{
    "cik": "1368275",
    "company": "W&E Source Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-06-30",
    "sic": "4700",
    "state_of_inc": "DE",
    "state_location": "A8",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1368275/0001062993-22-020762-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1368275/000106299322020762/form10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1368275/0001062993-22-020762.txt",
    "filename": "1368275_10K_2022_0001062993-22-020762.htm",
    "content": "ITEM 1. BUSINESS\nForward Looking Statements\nThis report contains forward-looking statements. These statements relate to future events or our future financial performance. In some cases, you can identify forward-looking statements by terminology such as \"may\", \"should\", \"expects\", \"plans\", \"anticipates\", \"believes\", \"estimates\", \"predicts\", \"potential\" or \"continue\" or the negative of these terms or other comparable terminology. These statements are only predictions and involve known and unknown risks, uncertainties and other factors, including the risks in the section entitled \"Risk Factors\", that may cause our company's or our industry's actual results, levels of activity, performance or achievements to be materially different from any future results, levels of activity, performance or achievements expressed or implied by these forward-looking statements.\nAlthough we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance or achievements. Except as required by applicable law, including the securities laws of the United States, we do not intend to update any of the forward-looking statements to conform these statements to actual results.\nOur financial statements are stated in United States dollars (US$) and are prepared in accordance with United States generally accepted accounting principles.\nIn this report, unless otherwise specified, all references to \"common shares\" refer to the common shares of our capital stock.\nAs used in this report, the terms \"we\", \"us\", \"our\", \"W&E Source Corp.\" means W&E Source Corp., unless otherwise indicated.\nCorporate Overview\nThe Company has identified the global tourism market as its first investment target. As it currently exists, the tourism industry is fragmented into various geographic regions. We believe that approaching this industry from a global perspective is an emerging market with tremendous growth potential. We plan to set up and/or acquire offices in various regions of the world and through them, develop the local tourism industry and expand our local tourism market. Ultimately, we plan to unify and manage our regional offices and to market our global services through the internet.\nWe have set up three subsidiaries, Airchn Travel Global, Inc. in Seattle, Washington (\"ATGI\"), Airchn Travel (Canada) Inc., in Vancouver, British Columbia in Canada (\"ATCI\") and Airchn Travel (Beijing) Inc. in Beijing, China (\"ATBI\"). Our Beijing office has been closed as of June 30, 2022 due to lack of business and to reduce operating costs.\nWe are engaged in services such as airline and cruise ticketing, customized and packaged tours, travel blogs, travel magazines, sales of travel related merchandise, group hotel reservations, business travel arrangements, conference travel arrangements, car rental and admission ticket sale for local tourist attractions.\nWe will continue to explore other business growth opportunities, regardless of industry, in order to diversify our business operations and investments.\nOn January 17, 2012, the Company filed a Certificate of Amendment to its Certificate of Incorporation with the Secretary of State of Delaware to change its name from News of China, Inc. to W&E Source Corp. In connection with the name change, our listing symbol also changed from \"NWCH\" to \"WESC.\" In addition, the Company also increased its total authorized shares to 500,000,000 to anticipate future financing through the issuance of our equity or convertible debt to finance our business.\nOn June 6, 2022, certain stockholders of the Company entered into a Stock Purchase Agreement (the \"SPA\") with Hong Ba and Christina Chen for the sale and purchase of an aggregate of 118,123,001 shares of common stock of the Company. One June 8, 2022, the transaction contemplated by the SPA closed, representing approximately 90.8% of the Company's issued and outstanding common shares. It resulted in change of control of the Company with Christina Chen owning approximately 70% of the Company's outstanding stock. Effective June 8, 2022, Junjun Wu resigned as member of the Board of Directors and the Board appointed Christina Chen as a new director of the Company. Hong Ba continues to serve as a director, CEO and CFO of the Company.\nEmployees\nAs of June 30, 2022, we have one part time consultant, who is responsible for sales of the various travel products and consulting services we offer. We have not experienced any labor disputes and we believe we have good relationships with our employees. We are not a party to any collective bargaining agreements.\nResearch and Development Expenditures\nWe did not incur expenditures in research and development over the last fiscal year.\nIntellectual Property\nWe do not own, either legally or beneficially, any patent or trademark. ITEM 1A. RISK FACTORS\nOur common shares are considered speculative. Prospective investors should consider carefully the risk factors set out below.\nRisks Related To Our Business\nOur revenue is derived from the global travel industry and a prolonged or substantial decrease in global travel volume, as well as other industry trends, could adversely affect us.\nOur revenue is derived from the global travel industry. As a result, our revenue is directly related to the overall level of travel activity, and is therefore significantly impacted by declines in, or disruptions to, travel in any region due to factors entirely outside of our control. Such factors include:\nglobal security issues, political instability, acts or threats of terrorism, hostilities or war and other political issues that could adversely affect global air travel volume;\nepidemics or pandemics, such as COVID-19, H1N1 \"swine\" flu, avian flu, Severe Acute Respiratory Syndrome (\"SARS\") and Ebola virus disease;\nnatural disasters, such as hurricanes, volcanic activity and resulting ash clouds, earthquakes and tsunamis;\ngeneral economic conditions, particularly to the extent that adverse conditions may cause a decline in travel volume, such as the crisis in the global credit and financial markets, diminished liquidity and credit availability, declines in consumer confidence and discretionary income, declines in economic growth, increases in unemployment rates and uncertainty about economic stability;\nthe financial condition of travel suppliers, including airlines and hotels, and the impact of any changes such as airline bankruptcies or consolidations on the cost and availability of air travel and hotel rooms;\nchanges to laws and regulations governing the airline and travel industry and the adoption of new laws and regulations detrimental to operations, including environmental and tax laws and regulations;\nfuel price escalation;\nwork stoppages or labor unrest at any of the major airlines or other travel suppliers or at airports;\nincreased security, particularly airport security that could reduce the convenience of air travel;\ntravelers' perception of the occurrence of travel-related accidents, of the environmental impact of air travel, particularly in regards to CO2 emissions, or of the scope, severity and timing of the other factors described above; and\nchanges in occupancy and room rates achieved by hotels.\nIf there were to be a prolonged substantial decrease in travel volume, for these or any other reason, it would have an adverse impact on our business, financial condition and results of operations.\nThe COVID-19 pandemic could negatively affect the Company's business and operating results.\nThe future impacts of the global emergence of the novel strain of Corona virus and the disease it causes (known as \"COVID-19\") on the Company's business or operating and financial results are unpredictable and cannot be identified with certainty at this time. The widespread health crisis has adversely affected the global economy and resulted in a widespread economic downturn which could adversely impact demand for our services. Such interruptions include significant disruptions and restrictions on travel. There is no assurance that the outbreak will not have a material adverse impact on our business or results of operations. Further, our operations could be negatively affected if a significant number of our service providers are unable to perform their normal duties because of contracting COVID-19 or based on further direction from governments, public health authorities or regulatory agencies. The extent of the impact, if any, will depend on developments beyond our control, including actions taken by governments, financial institutions, monetary policy authorities, and public health authorities to contain and respond to public health concerns and general economic conditions as a result of the pandemic.\nWe will continue to actively monitor the situation and may take further actions that alter our business operations as may be required or recommended by federal, provincial, state or local authorities, or that we determine are in the best interests of our customers, partners, suppliers, shareholders and other stakeholders. We cannot be certain of potential effects any such alterations or modifications may have on our business or operating and financial results for the fiscal year ending June 30, 2023.\nThe travel industry may not recover from the recent global financial crisis and recession to the extent anticipated or may not grow in line with long-term historical trends following any recovery.\nAs a participant in the global travel industry, our business and operating results are impacted by global economic conditions, including the recent European debt crisis, a slowdown in growth of the Chinese economy, a prolonged slow economic recovery in Japan and a general reduction in net disposable income as a result of fiscal measures adopted by countries to address high levels of budgetary indebtedness, which may adversely affect our business, results of operations and financial condition. In our industry, the recent financial crisis and global recession have resulted in higher unemployment, a decline in consumer confidence, large-scale business failures and tightened credit markets. As a result, the global travel industry, which historically has grown at a rate in excess of global GDP growth during economic expansions, has experienced a cyclical downturn. A continuation of recent adverse economic developments in areas such as employment levels, business conditions, interest rates, tax rates, fuel and energy costs, particularly a rise in the price of crude oil, and other matters could reduce discretionary spending further and cause the travel industry to continue to contract. In addition, the global economy may not recover as quickly or to the extent anticipated, and consumer spending on leisure travel and business spending on corporate travel may not increase despite improvement in economic conditions. As a result, our business may not benefit from a broader macroeconomic recovery, which could adversely affect our business, financial condition or results of operations.\nThe travel industry is highly competitive, and we are subject to risks relating to competition that may adversely affect our performance.\nOur businesses operate in highly competitive industries. If we cannot compete effectively, we may lose share to our competitors, which may adversely affect our financial performance. Our continued success depends, to a large extent, upon our ability to compete effectively in industries that contain numerous competitors, some of which may have significantly greater financial, marketing, personnel and other resources than us.\nThe travel industry is seasonal.\nOur business travel operations will experience seasonal fluctuations, reflecting seasonal variations in demand for travel services. During the first quarter, demand for travel services generally declines and the number of bookings flattens or decreases, in part due to a slowdown in business activity during the holidays. Demand for travel services generally peaks during the second half of the year and there may be seasonal fluctuations in allocations of travel services made available to us by travel suppliers. Consequently, our revenue may fluctuate from quarter to quarter.\nOur business depends on the technology infrastructure of third parties.\nWe rely on third-party computer systems and other service providers, including the computerized reservation systems of airlines and hotels to make reservations and confirmations. Other third parties provide, for instance, our back-up data center, telecommunications access lines, significant computer systems and software licensing, support and maintenance service and air-ticket delivery. Any interruption in these or other third-party services or deterioration in their performance could impair the quality of our service.\nRisks Related To Our Company\nWe have only commenced our business operations in October, 2005 and we have a limited operating history. If we cannot successfully manage the risks normally faced by start-up companies, we may not achieve profitable operations and ultimately our business may fail.\nAs of June 30, 2022, we had an accumulated deficit of $1,327,434. We anticipate continuing to incur significant losses until, at the earliest, we generate sufficient revenues to offset the substantial up-front expenditures and operating costs associated with developing and marketing our services. There can be no assurance that we will ever operate profitably.\nWe will also encounter risks and difficulties frequently experienced by growing companies in evolving industries such as the travel agency and travel service industry. Our operating history to date is not adequate to evaluate how we will address these risks and difficulties in the future. Some of the risks relate to our ability to: (i) attract and retain customers and encourage our customers to engage in repeat transactions; (ii) retain our existing agreements and relationships with travel suppliers such as hotels and airlines and to expand our product and service offerings on satisfactory terms with our travel suppliers; (iii) operate, support, expand and develop our operations, our call centers, our website, and our communications and other systems; (iv) diversify our sources of revenue; (v) maintain effective control of our expenses; and (vi) respond to changes in our regulatory environment.\nIf we are not successful in addressing any or all of these risks, our business may be materially affected in an adverse manner.\nThere is substantial doubt about our ability to continue as a going concern, which may hinder our ability to obtain future financing.\nIn their report accompanying this annual report, our independent auditors stated that our consolidated financial statements were prepared assuming that we would continue as a going concern. Our ability to continue as a going concern is an issue raised as we have losses from operations and an accumulated deficit. We anticipate that we will continue to experience net operating losses. Our ability to continue as a going concern is subject to our ability to obtain necessary funding from outside sources, including obtaining additional funding from the sale of our securities. Our lack of revenue and continued net operating losses increase the difficulty in meeting such goals and there can be no assurances that such methods will prove successful.\nWe have generated limited revenues and have only limited marketing experience to develop customers.\nWe have generated revenues by providing air ticket reservations, hotel reservations and other travel related services to our customers. We do not believe that we will generate significant revenues in the immediate future. There can be no assurance that we will ever be able to obtain a significant number of customers to generate meaningful revenues or achieve profitable operations.\nWe have only limited experience in developing and marketing our travel services, and there is limited information available concerning the potential performance or market acceptance of our proposed services. There can be no assurance that unanticipated expenses, problems or technical difficulties will not occur which would result in material delays in commercialization of our services or that our efforts will result in successful commercialization.\nThe continued growth of our business will require additional funding from time to time which would be used for general corporate purposes. General corporate purposes may include acquisitions, investments, repayment of debt, capital expenditures, repurchase of our capital stock and any other purposes that we may specify in any prospectus supplement. Obtaining additional funding would be subject to a number of factors including market conditions, operational performance and investor sentiment. These factors may make the timing, amount, terms and conditions of additional funding unattractive, or unavailable, to us.\nThe terms of any future financing may adversely affect your interest as stockholders.\nIf we require additional financing in the future, we may be required to incur indebtedness or issue equity securities, the terms of which may adversely affect your interests in our company. For example, the issuance of additional indebtedness may be senior in right of payment to your shares upon our liquidation. In addition, indebtedness may be under terms that make the operation of our business more difficult because the lender's consent will be required before we take certain actions. Similarly the terms of any equity securities we issue may be senior in right of payment of dividends to your common stock and may contain superior rights and other rights as compared to your common stock. Further, any such issuance of equity securities may dilute your interest in our company, which may reduce the value of your investment.\nOur Certificate of Incorporation and Bylaws contain limitations on the liability of our directors and officers, which may discourage suits against directors and executive officers for breaches of fiduciary duties.\nOur Certificate of Incorporation, as amended, and our Bylaws contain provisions limiting the liability of our directors for monetary damages to the fullest extent permissible under Delaware law. This is intended to eliminate the personal liability of a director for monetary damages on an action brought by origin our right for breach of a director's duties to us or to our stockholders except in certain limited circumstances. In addition, our Certificate of Incorporation, as amended, and our Bylaws contain provisions requiring us to indemnify our directors, officers, employees and agents serving at our request, against expenses, judgments (including derivative actions), fines and amounts paid in settlement. This indemnification is limited to actions taken in good faith in the reasonable belief that the conduct was lawful and in, or not opposed to our best interests. The Certificate of Incorporation and the Bylaws provide for the indemnification of directors and officers in connection with civil, criminal, administrative or investigative proceedings when acting in their capacities as agents for us. These provisions may reduce the likelihood of derivative litigation against directors and executive officers and may discourage or deter stockholders or management from suing directors or executive officers for breaches of their fiduciary duties, even though such an action, if successful, might otherwise benefit our stockholders and directors and officers.\nOur success depends on our management team and other key personnel, the loss of any of whom could disrupt our business operations.\nOur future success will depend in substantial part on the continual services of our senior management, including our President, Chief Executive Officer and Chief Financial Officer, Hong Ba. As a startup company, currently none of the senior management team draws salaries from our company. We do not carry key person life insurance on any of our officers or employees. The loss of the services of one or more of our key personnel could impede implementation of our business plan and result in reduced profitability.\nBecause our officers, directors and principal shareholders control a majority of our common stock, investors will have little or no control over our management or other matters requiring shareholder approval.\nOur officers and directors in the aggregate, beneficially own approximately 90.9% of issued and outstanding shares of our common stock. As a result, they may have the ability to control matters affecting minority shareholders, including the election of our directors, the acquisition or disposition of our assets, and the future issuance of our shares. Because our officers, directors and principal shareholders control the company, investors will not be able to replace our management if they disagree with the way our business is being run. Because control by these insiders could result in management making decisions that are in the best interest of those insiders and not in the best interest of the investors, you may lose some or all of the value of your investment in our common stock.\nBecause we do not have sufficient insurance to cover our business losses, we might have uninsured losses, increasing the possibility that you would lose your investment.\nWe may incur uninsured liabilities and losses as a result of the conduct of our business. We do not currently maintain any comprehensive liability or property insurance. Even if we obtain such insurance in the future, we may not carry sufficient insurance coverage to satisfy potential claims. We do not carry any business interruption insurance. Should uninsured losses occur, any purchasers of our common stock could lose their entire investment.\nRisks Relating to the People's Republic of China\nThe economic policies of the People's Republic of China could affect our business.\nChina is one of the regions which we will focus our business development. Accordingly, our results of operations and prospects are subject, to a significant extent, to the economic, political and legal developments in the People's Republic of China. While the People's Republic of China's economy has experienced significant growth in the past 20 years, such growth has been uneven, both geographically and among various sectors of the economy. The Chinese government has implemented various measures to encourage economic growth and guide the allocation of resources. Some of these measures benefit the overall economy of the People's Republic of China, but they may also have a negative effect on us.\nThe economy of the People's Republic of China has been changing from a planned economy to a more market-oriented economy. In recent years, the Chinese government has implemented measures emphasizing the utilization of market forces for economic reform and the reduction of state ownership of productive assets, and the establishment of corporate governance in business enterprises; however, a substantial portion of productive assets in the People's Republic of China are still owned by the Chinese government. In addition, the Chinese government continues to play a significant role in regulating industry development by imposing industrial policies. It also exercises significant control over the People's Republic of China's economic growth through the allocation of resources, the control of payment of foreign currency-denominated obligations, the setting of monetary policy and the provision of preferential treatment to particular industries or companies.\nCapital outflow policies in the People's Republic of China may hamper our ability to expand our business and/or operations. The People's Republic of China has adopted currency and capital transfer regulations. These regulations may require us to comply with complex regulations for the movement of capital. Although our management believes that it is currently in compliance with these regulations, should these regulations or the interpretation of them by courts or regulatory agencies change, we may not be able to remit income earned and proceeds received in connection with any off-shore operations or from other financial or strategic transactions we may consummate in the future.\nFluctuation of the Renminbi, or Chinese Yuan (\"Renminbi\"), could materially affect our financial condition and results of operations.\nFluctuation of the Renminbi, the currency of the People's Republic of China, could materially affect our financial condition and results of operations. The value of the Renminbi fluctuates and is subject to changes in the People's Republic of China's political and economic conditions. Since July 2005, the conversion of Renminbi into foreign currencies, including United States dollars, is pegged against the inter-bank foreign exchange market rates or current exchange rates of a basket of currencies on the world financial markets. As of June 30, 2022, the exchange rate between the Renminbi and the United States dollar was approximately 6.6956 Renminbi to every one United States dollar.\nIt will be extremely difficult to acquire jurisdiction and enforce liability against our officers, directors and assets based in The People's Republic of China.\nBecause some of our executive officers and current directors are Chinese citizens, it may be difficult, if not impossible, to acquire jurisdiction over these persons in the event a lawsuit is initiated against us and/or our officers and directors by a stockholder or group of stockholders in the United States.\nRisks Associated With Our Common Stock\nTrading on the OTC Markets may be volatile and sporadic, which could depress the market price of our common stock and make it difficult for our stockholders to resell their shares.\nOur common stock is quoted on the OTC Markets. Trading in stock quoted on the OTC Markets is often thin and characterized by wide fluctuations in trading prices due to many factors that may have little to do with our operations or business prospects. This volatility could depress the market price of our common stock for reasons unrelated to operating performance. Moreover, the OTC Markets is not a stock exchange, and trading of securities on the OTC Markets is often more sporadic than the trading of securities listed on a quotation system like Nasdaq or a stock exchange like the New York Stock Exchange. Accordingly, our shareholders may have difficulty reselling any of their shares.\nOur stock is a penny stock. Trading of our stock may be restricted by the SEC's penny stock regulations and the FINRA's sales practice requirements, which may limit a stockholder's ability to buy and sell our stock.\nOur stock is a penny stock. The Securities and Exchange Commission has adopted Rule 15g-9 which generally defines \"penny stock to be any equity security that has a market price (as defined) less than $5.00 per share or an exercise price of less than $5.00 per share, subject to certain exceptions. Our securities are covered by the penny stock rules, which impose additional sales practice requirements on broker-dealers who sell to persons other than established customers and \"accredited investors\". The term \"accredited investor\" refers generally to institutions with assets in excess of $5,000,000 or individuals with a net worth in excess of $1,000,000 or annual income exceeding $200,000 or $300,000 jointly with their spouse. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document in a form prepared by the SEC which provides information about penny stocks and the nature and level of risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction and monthly account statements showing the market value of each penny stock held in the customer's account. The bid and offer quotations, and the broker-dealer and salesperson compensation information, must be given to the customer orally or in writing prior to effecting the transaction and must be given to the customer in writing before or with the customer's confirmation. In addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from these rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchaser's written agreement to the transaction. These disclosure requirements may have the effect of reducing the level of trading activity in the secondary market for the stock that is subject to these penny stock rules. Consequently, these penny stock rules may affect the ability of broker-dealers to trade our securities. We believe that the penny stock rules discourage investor interest in, and limit the marketability of, our common stock.\nIn addition to the \"penny stock rules\" promulgated by the Securities and Exchange Commission, the Financial Industry Regulatory Authority has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customer's financial status, tax status, investment objectives and other information. Under interpretations of these rules, the Financial Industry Regulatory Authority believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. The Financial Industry Regulatory Authority requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock.\nOther Risks\nTrends, Risks and Uncertainties\nWe have sought to identify what we believe to be the most significant risks to our business, but we cannot predict whether, or to what extent, any such risks may be realized nor can we guarantee that we have identified all possible risks that might arise. Investors should carefully consider all of the risk factors before making an investment decision with respect to our common stock. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe currently lease our only office in Vancouver which covers approximately 400 square feet with an annual lease of CAD$9,600. We subleased out our office in Seattle to a third party effective August 1, 2014. We did not renew our lease for our Beijing office which terminated at the end of 2013. ITEM 3. LEGAL PROCEEDINGS\nWe know of no material, active or pending legal proceedings against our company, nor are we involved as a plaintiff in any material proceeding or pending litigation. There are no proceedings in which any of our directors, officers or affiliates, or any registered or beneficial shareholder, is an adverse party or has a material interest adverse to our interest. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock is currently not traded on any exchange. Our common stock was quoted on the OTC Markets. We cannot assure you that there will be a market for our common stock in the future.\nThe following is a report of high and low bid prices for each quarterly period for the years ended June 30, 2022 and 2021 obtained from Yahoo! Finance.\nQuarter Ended High Low\nJune 30, 2022 $0.09 $0.01\nMarch 31, 2022 $1.25 $0.01\nDecember 31, 2021 $0.01 $0.01\nSeptember 30, 2021 $0.02 $0.01\nJune 30, 2021 $0.02 $0.01\nMarch 31, 2021 $0.02 $0.01\nDecember 31, 2020 $0.03 $0.01\nSeptember 30, 2020 $0.01 $0.01\nHolders of our Common Stock\nAs of June 30, 2022, there were approximately 63 holders of record of our common stock. As of such date, 130,085,501 shares of common stock were issued and outstanding.\nOur shares of common stock are issued in registered form. Colonial Stock Transfer Co, Inc. is the registrar and transfer agent for our shares of common stock. Our CUSIP number is 92890J108.\nDividends\nSince our inception, we have not declared nor paid any cash dividends on our capital stock and we do not anticipate paying any cash dividends in the foreseeable future. Our current policy is to retain any earnings in order to finance the expansion of our operations. Our board of directors will determine future declarations and payments of dividends, if any, in light of the then-current conditions they deem relevant and in accordance with applicable corporate law.\nThere are no restrictions in our articles of incorporation or bylaws that prevent us from declaring dividends.\nSecurities authorized for issuance under equity compensation plans.\nAs at June 30, 2022, we had not adopted any equity compensation plan.\nRecent Sales of Unregistered Securities and Use of Proceeds\nNot applicable. ITEM 6. SELECTED FINANCIAL DATA [Reserved] ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nThe Company has identified the global tourism market as its first investment target. As it currently exists, the tourism industry is fragmented into various geographic regions. We believe that approaching this industry from a global perspective is an emerging market with tremendous growth potential. We plan to set up and/or acquire offices in various regions of the world and through them, develop the local tourism industry and expand our local tourism market. Ultimately, we plan to unify and manage our regional offices and to market our global services through the internet.\nWe have set up three subsidiaries, Airchn Travel Global, Inc. in Seattle, Washington (\"ATGI\") and Airchn Travel (Canada) Inc., in Vancouver, British Columbia in Canada (\"ATCI\") and Airchn Travel (Beijing) Inc. in Beijing, China (\"ATBI\"). Our Beijing office has been closed as of June 30, 2022 due to lack of business and to reduce operating costs.\nWe are engaged in services such as airline and cruise ticketing, customized and packaged tours, travel blogs, travel magazines, sales of travel related merchandise, group hotel reservations, business travel arrangements, conference travel arrangements, car rental and admission ticket sale for local tourist attractions.\nWe will continue to explore other business growth opportunities, regardless of industry, in order to diversify our business operations and investments.\nOn January 17, 2012, the Company filed a Certificate of Amendment to its Certificate of Incorporation with the Secretary of State of Delaware to change its name from News of China, Inc. to W&E Source Corp. In connection the name change, our listing symbol also changed from \"NWCH\" to \"WESC.\" In addition, the Company also increased its total authorized shares to 500,000,000 to anticipate future financing through the issuance of our equity or convertible debt to finance our business.\nOn June 6, 2022, certain shareholders of the Company entered into a Stock Purchase Agreement (the \"SPA\") with Hong Ba and Christina Chen for the sale and purchase of an aggregate of 118,123,001 shares of common stock of the Company. One June 8, 2022, the transaction contemplated by the SPA closed, representing approximately 90.8% of the Company's issued and outstanding common shares. It resulted in change of control of the Company with Christina Chen owning approximately 70% of the Company's outstanding stock. Effective June 8, 2022, Junjun Wu resigned as member of the Board of Directors and the Board appointed Christina Chen as a new director of the Company. Hong Ba continues to serve as a director, CEO and CFO of the Company.\nEffective January 1, 2018, the Company adopted the guidance of Accounting Standards Codification (ASC) 606, Revenue from Contracts. The implementation of ASC 606 did not have a material impact on the Company's consolidated financial statements. ASC 606 create a five-step model that requires entities to exercise judgement when considering the terms of contract, which includes (1) identifying the contracts or agreement with a customer, (2) identifying our performance obligations in the contract or agreement, (3) determining the transaction price, (4) allocating the transaction price to the separate performance obligation, and (5) recognizing revenue as each performance obligation is satisfied. The Company only applies the five-step model to contracts when it is probable that the Company will collect the consideration it is entitled to in exchange for the services it transfers to its clients.\nCOVID-19\nIn December 2019, a novel strain of coronavirus, COVID-19, was first detected in Wuhan, China, and has since spread to other regions, including Europe and North America. On March 11, 2020, the World Health Organization declared that the rapidly spreading COVID-19 outbreak was a global pandemic (\"COVID-19 pandemic\"). In response to the pandemic, many governments around the world have implemented, and continue to implement, a variety of measures to reduce the spread of COVID-19, including travel restrictions and bans, instructions to residents to practice social distancing, quarantine advisories, shelter-in-place orders and required closures of non-essential businesses. These government mandates have forced many of the companies on whom our business relies, including hotels and other accommodation providers and airlines, to seek government support in order to continue operating, to curtail drastically their service offerings or to cease operations entirely. Further, these measures have materially adversely affected, and may further adversely affect, consumer sentiment and discretionary spending patterns, economies and financial markets, and our customers. The COVID-19 pandemic and the resulting economic conditions and government orders have resulted in a material decrease in consumer spending and an unprecedented decline in travel activities and consumer demand for related services. Our financial results and prospects are almost entirely dependent on the sale of such travel-related services. Our results for the year ended June 30, 2022 have been significantly and negatively impacted, with a material decline in gross travel bookings and total revenues as compared to the corresponding period in 2019-2020. We expect to continue to see severely reduced new travel reservation bookings as compared to 2019-2020 levels for the foreseeable future, which will have a materially adverse impact on our business, financial condition, results of operations and cash flows. Due to the uncertain and rapidly evolving nature of current conditions around the world, we are unable to predict accurately the impact that the COVID-19 pandemic will have on our business going forward. With the continued spread of COVID-19 in the United States and various other countries, we expect the pandemic and its effects to continue to have a significant adverse impact on our business for the duration of the pandemic, during any resurgences of the pandemic and during the subsequent economic recovery, which could be an extended period of time.\nResults of Operations\nThe following summary of our results of operations should be read in conjunction with our audited financial statements for the years ended June 30, 2022 and 2021.\nYears Ended June 30, 2022 and 2021:\nJune 30, 2022\nJune 30, 2021\nRevenues $ -\n$ -\nCost of revenues\n-\n-\nExpenses\nGeneral and administrative expenses\n(65,730 )\n(55,028 )\nInterest expense\n(542 )\n(14,386 )\nGain on debt settlement\n-\n90,433\nForeign currency exchange gain (loss)\n(5,321 )\n6,158\nNet income (loss) $ (71,593 ) $ 27,177\nRevenues\nWe have generated total revenues of $Nil from operations during the year ended June 30, 2022 as compared to $Nil for the same period in 2021. The lack of revenues was mainly due to the decrease in our travel business arrangement income caused by the COVID-19 pandemic globally in the years ended June 30, 2022 and 2021.\nExpenses\nGeneral and administrative expenses for the year ended June 30, 2022 was $65,730 and increased from $55,028, or 19%, compared with the year ended June 30, 2021. The increase in expenses during the current year was mainly due to an increase in legal, accounting and filing fees due to the stock sale resulting in a a change of control of the Company during the year ended June 30, 2022.\nNet income (loss)\nWe had net losses of $71,593 and net income of $27,177 for the years ended June 30, 2022 and 2021, respectively, and had an accumulated deficit of $1,327,434 since the inception of our business through June 30, 2022. The decrease in the net income is mainly due to the gain on debt settlement which occurred in the year ended June 30, 2021 and the increased expenses in the year ended June 30, 2022.\nLiquidity and Capital Resources\nOur financial condition for the years ended June 30, 2022 and 2021 are summarized as follows:\nWorking Capital\nJune 30, 2022\nJune 30, 2021\nCurrent Assets $\n$ 2,290\nCurrent Liabilities\n(100,784 )\n(36,581 )\nWorking Capital $ (99,891 ) $ (34,291 )\nOur working capital deficiency for the year ended June 30, 2022 was significantly increased by $65,600 compared with 2021 mainly due to a increase in accrued liabilities.\nCash Flows\nJune 30, 2022\nJune 30, 2021\nCash used in operating activities $ (43,085 ) $ (33,698 )\nCash used in investing activities\n-\n-\nCash provided by financing activities\n40,478\n32,153\nCumulative translation adjustment\n1,212\nNet decrease in cash $ (1,395 ) $ (1,260 )\nCash Used in Operating Activities\nFor the year ended June 30, 2022, our cash used in operating activities increased by $9,387 compared with the previous year. The increase is mainly due to the stock sale resulting in a change of control of the Company during the year ended June 30, 2022.\nCash Used in Investing Activities\nFor the year ended June 30, 2022, no cash was used in investing activities.\nCash Provided by Financing Activities\nFor the year ended June 30, 2022, the Company received $40,478 proceeds from related parties, as compared with $32,153 in the previous year.\nCash Requirements\nOver the next 12-months ending June 30, 2023, we anticipate that we will incur the following operating expenses:\nExpense\nAmount\nGeneral and administrative\n$ 40,000\nProfessional fees\n60,000\nForeign currency exchange loss\n4,000\nTotal\n$ 104,000\nOur CEO, Hong Ba, has committed to providing our working capital requirements for the next 12 months.\nThere is substantial doubt about our ability to continue as a going concern as the continuation of our business is dependent upon the continued financial support from our shareholders, our ability to obtain necessary equity financing to continue operations, and achieving a profitable level of operations. The issuance of additional equity securities by us could result in a significant dilution in the equity interests of our current stockholders. Obtaining commercial loans, assuming those loans would be available, will increase our liabilities and future cash commitments.\nIn addition to the issues set out above regarding our ability to raise capital, global economies are currently undergoing a period of economic uncertainty related to the COVID-19 pandemic and the tightening of credit markets worldwide. This has resulted in numerous adverse effects, including unprecedented volatility in financial markets and stock prices, slower economic activity, decreased consumer confidence, increased commodity prices, reduced corporate profits and capital spending, increased unemployment, liquidity concerns and volatile and increasing energy prices. We anticipate that the current economic conditions and the credit shortage will adversely impact our ability to raise financing. In addition, if the future economic environment continues to be less favorable than it has been in recent years, we may experience difficulty in completing our current business plan.\nOff Balance Sheet Arrangements\nWe have no significant off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to stockholders.\nRecently Issued Accounting Standards\nWe continue to assess the effects of recently issued accounting standards. The impact of all recently adopted and issued accounting standards has been disclosed in the Footnotes to the financial statements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot required. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe consolidated financial statements and notes thereto are included herein beginning at page. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nWe maintain \"disclosure controls and procedures\", as that term is defined in Rule 13a-15(e), promulgated by the Securities and Exchange Commission pursuant to the Securities Exchange Act of 1934, as amended. Disclosure controls and procedures include controls and procedures designed to ensure that information required to be disclosed in our company's reports filed under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission's rules and forms, and that such information is accumulated and communicated to our management, including our principal executive officer and principal accounting officer to allow timely decisions regarding required disclosure.\nAs required by paragraph (b) of Rules 13a-15 under the Securities Exchange Act of 1934, our management, with the participation of our principal executive officer and principal financial officer, evaluated our company's disclosure controls and procedures as of the end of the period covered by this annual report on Form 10-K. Based on this evaluation, our management concluded that as of the end of the period covered by this annual report on Form 10-K, our disclosure controls and procedures were not effective due to the material weaknesses described in Management's Report on Internal Control over Financial Reporting below.\nManagement's annual report on internal control over financial reporting\nOur management, including our principal executive officer, principal financial officer and our Board of Directors, is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934).\nOur management, with the participation of our principal executive officer and principal financial officer, evaluated the effectiveness of our internal control over financial reporting as of June 30, 2022. Our management's evaluation of our internal control over financial reporting was based on the framework in Internal Control-Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, our management concluded that our internal control over financial reporting was not effective as of June 30, 2022 due to the material weaknesses described below.\n(a) The Company has inadequate segregation of duties consistent with control objectives.\n(b) The Company has insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of GAAP and SEC disclosure requirements.\nA material weakness is a deficiency or a combination of control deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis.\nLimitations on Effectiveness of Controls\nOur principal executive officer and principal financial officer do not expect that our disclosure controls or our internal control over financial reporting will prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of a simple error or mistake. Additional controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the controls. The design of any system of controls also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions; over time, controls may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\nChanges in internal control over financial reporting\nThere were no changes in our internal control over financial reporting during the quarter ended June 30, 2022 that have materially affected, or are reasonably likely to materially affect our internal control over financial reporting.\nCertifications\nCertifications with respect to disclosure controls and procedures and internal control over financial reporting under Rules 13a-14(a) or 15d-14(a) of the Exchange Act are attached to this annual report on Form 10-K. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table sets forth information regarding our directors and executive officers.\nDate First Elected or\nName Position Held with our Company Age Appointed\nHong Ba Chief Executive Officer, Chief Financial Officer, and Director August 1, 2011\nSeptember 1, 2011\nChristina Chen Director June 8, 2022\nThe following is a brief account of the education and business experience of directors and executive officers during the past five years, indicating their principal occupation during the period, and the name and principal business of the organization by which they were employed.\nHong Ba\nMrs. Ba joined our company in August 2011 as Chief Executive Officer and was appointed as a Director on September 1, 2011 and as our Chief Financial Officer on May 13, 2013. Mrs. Ba was born in 1966. She graduated from Taiyuan University Software in 1988. She had worked in China Eastern Airline from 1988. She has over 20 years of work experience in aviation marketing. Mrs. Ba has been working for Shanxi Jinyan Aviation Business Inc. as the president and a director from 2008. Mrs. Ba provides her services on a full time basis to our company.\nWe believe Mrs. Ba is qualified to serve on our board of directors because of her extensive business experience and network of business associates in China which will assist our company to seek and identify future opportunities.\nChristina Chen\nMs. Chen joined our company as a Director in June 2022. Ms. Chen was born in 2000. She became an entrepreneur at age 18 and has worked in the food and aquaculture industries as director and manager for over three years. She has gained significant experience as a director and manager in multiple successful companies, including helping them manage through the Covid-19 disruptions. Currently, she is leading a new team to strive to realize the strategic vision of bringing seafood from the ocean to the dining table as well as establishing an international trading business. Ms. Chen is currently a director of each of Ocean Story Fishing Group Inc., Global Cuisine & Management Group Ltd., Global Oceanic Restaurant and Management Ltd. and East Ocean Family Holdings Group Co., Ltd., all of which are private companies.\nWe believe Ms. Chen is qualified to serve on our board of directors because of her business experience and network of business associates in the food and aquaculture industries and involvement in import and export international trading business, which will assist our company to seek and identify future opportunities.\nCorporate Governance\nDirector Independence\nOur board of directors has concluded that none of our directors will be independent as the term \"independent\" is defined by the rules of the New York Stock Exchange and Rule 10A-3 of the U.S. Securities Exchange Act of 1934, as amended.\nBoard Meetings and Committees\nOur board of directors held no formal meetings during the year ended June 30, 2022. All proceedings of the board of directors were conducted by resolutions consented to in writing by all the directors and filed with the minutes of the proceedings of the directors. Such resolutions consented to in writing by the directors entitled to vote on that resolution at a meeting of the directors are, according to the Delaware Corporation Law and the bylaws of our company, as valid and effective as if they had been passed at a meeting of the directors duly called and held.\nWe do not have standing audit, nominating or compensation committees, or committees performing similar functions. Our board of directors believes that it is not necessary to have a standing audit or compensation committees at this time because the functions of such committees are adequately performed by our board of directors.\nOur board of directors also is of the view that it is appropriate for us not to have a standing nominating committee because the current size of our board of directors does not facilitate the establishment of a separate committee. Our board of directors has performed and will perform adequately the functions of a nominating committee. The directors who perform the functions of a nominating committee are not independent because they are also officers of our company. The determination of independence of directors has been made using the definition of \"independent director\" contained under Rule 4200(a)(15) of the Rules of the Financial Industry Regulatory Authority. Our board of directors has not adopted a charter for the nomination committee. There has not been any defined policy or procedure requirements for stockholders to submit recommendations or nomination for directors. Our board of directors does not believe that a defined policy with regard to the consideration of candidates recommended by stockholders is necessary at this time because we believe that, given the early stages of our development, a specific nominating policy would be premature and of little assistance until our business operations are at a more advanced level. There are no specific, minimum qualifications that our board of directors believes must be met by a candidate recommended by our board of directors. The process of identifying and evaluating nominees for director typically begins with our board of directors soliciting professional firms with whom we have an existing business relationship, such as law firms, accounting firms or financial advisory firms, for suitable candidates to serve as directors. It is followed by our board of directors' review of the candidates' resumes and interview of candidates. Based on the information gathered, our board of directors then makes a decision on whether to recommend the candidates as nominees for director. We do not pay any fee to any third party or parties to identify or evaluate or assist in identifying or evaluating potential nominee.\nOur company does not have any defined policy or procedural requirements for shareholders to submit recommendations or nominations for directors. Our directors believe that, given the stage of our development, a specific nominating policy would be premature and of little assistance until our business operations develop to a more advanced level. Our company does not currently have any specific or minimum criteria for the election of nominees to the Board of Directors and we do not have any specific process or procedure for evaluating such nominees. Our board of directors will assess all candidates, whether submitted by management or shareholders, and make recommendations for election or appointment.\nA shareholder who wishes to communicate with our Board of Directors may do so by directing a written request addressed to our President, at the address appearing on the first page of this annual report.\nAudit Committee and Audit Committee Financial Expert\nWe do not have a standing audit committee at the present time. Our board of directors has determined that we do not have a board member that qualifies as an \"audit committee financial expert\" as defined in Item 401(h) of Regulation S-K, nor do we have a board member that qualifies as \"independent\" as the term is used in Item 7(d)(3)(iv) of Schedule 14A under the Securities Exchange Act of 1934, as amended.\nWe believe that our board of directors is capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. The board of directors of our company does not believe that it is necessary to have an audit committee because we believe that the functions of an audit committee can be adequately performed by the board of directors. In addition, we believe that retaining an independent director who would qualify as an \"audit committee financial expert\" would be overly costly and burdensome and is not warranted in our circumstances given the early stages of our development.\nFamily Relationships\nThere are no family relationships between any director or executive officer.\nInvolvement in Certain Legal Proceedings\nOur directors, executive officers, or control persons have not been involved in any of the following events during the past ten years:\n1. any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2. any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offences);\n3. being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities; or\n4. being found by a court of competent jurisdiction (in a civil action), the Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\nCode of Ethics\nOn September 10, 2007, our board of directors confirmed the adoption of our Code of Ethics and Business Conduct that applies to, among other persons, our company's chief executive officer, president and chief financial officer (being our principal executive officer, principal financial officer and principal accounting officer), as well as persons performing similar functions. As adopted, our Code of Ethics and Business Conduct sets forth written standards that are designed to deter wrongdoing and to promote:\n1. honest and ethical conduct, including the ethical handling of actual or apparent conflicts of interest between personal and professional relationships;\n2. full, fair, accurate, timely, and understandable disclosure in reports and documents that we file with, or submit to, the Securities and Exchange Commission and in other public communications made by us;\n3. compliance with applicable governmental laws, rules and regulations;\n4. the prompt internal reporting of violations of the Code of Ethics and Business Conduct to an appropriate person or persons identified in the Code of Ethics and Business Conduct; and\n5. accountability for adherence to the Code of Ethics and Business Conduct.\nOur Code of Ethics and Business Conduct requires, among other things, that all of our company's senior officers commit to timely, accurate and consistent disclosure of information; that they maintain confidential information; and that they act with honesty and integrity.\nIn addition, our Code of Ethics and Business Conduct emphasizes that all employees have a responsibility for maintaining financial integrity within our company, consistent with generally accepted accounting principles, and federal and state securities laws. Any employee who becomes aware of any incidents involving financial or accounting manipulation or other irregularities, whether by witnessing the incident or being told of it, must report it to our company. Any failure to report such inappropriate or irregular conduct of others is to be treated as a severe disciplinary matter. It is against our company policy to retaliate against any individual who reports in good faith the violation or potential violation of our company's Code of Ethics and Business Conduct by another.\nOur Code of Ethics and Business Conduct was filed with the Securities and Exchange Commission as Exhibit 14.1 to our annual report on Form 10-KSB filed on September 28, 2007. We will provide a copy of the Code of Ethics and Business Conduct to any person without charge, upon request. Requests can be sent to our President at the address appearing on the first page of this annual report.\nDelinquent Section 16(a) Reports\nSection 16(a) of the Securities Exchange Act requires our executive officers and directors, and persons who own more than 10% of our common stock, to file reports regarding ownership of, and transactions in, our securities with the Securities and Exchange Commission. Based solely on our review of such filings or written representations from certain reporting persons, we believe that during the fiscal year ended June 30, 2022, all filing requirements applicable to our officers, directors and greater than 10% beneficial owners were complied with except that no Forms 4 were filed by Hong Ba, Junjun Wu, Shanxi Ai Chen Technology Ltd. and Youzhi Li, and no Form 3 was filed by Christina Chen. ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation\nThe particulars of compensation paid to the following persons:\nour principal executive officer;\neach of our two most highly compensated executive officers who were serving as executive officers at the end of the year ended June 30, 2022; and\nup to two additional individuals for whom disclosure would have been provided under (b) but for the fact that the individual was not serving as our executive officer at the end of the most recently completed financial year, who we will collectively refer to as the named executive officers, for our fiscal years ended June 30, 2022 and 2021, are set out in the following summary compensation table:\nName and\nPrincipal\nPosition Year Salary\n($) Bonus\n($) Stock\nAwards\n($) Option\nAwards\n($) Non-Equity\nIncentive Plan\nCompensation\n($) Nonqualified\nDeferred\nCompensation\nEarnings\n($) All Other\nCompensation\n($) Total\n($)\nHong Ba\nCEO, CFO and Director\nNil\nNil Nil\nNil Nil\nNil Nil\nNil Nil\nNil Nil\nNil Nil\nNil Nil\nNil\nEmployment Agreements\nWe have not entered into any employment agreement or consulting agreement with our executive officers.\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for executive officers. Our executive officers may receive stock options at the discretion of our board of directors in the future. We do not have any material bonus or profit sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that stock options may be granted at the discretion of our board of directors.\nWe have no plans or arrangements in respect of remuneration received or that may be received by our executive officers to compensate such officers in the event of termination of employment (as a result of resignation, retirement, change of control) or a change of responsibilities following a change of control, where the value of such compensation exceeds $60,000 per executive officer.\nOutstanding Equity Awards at Fiscal Year-End\nAs at June 30, 2022, we had not adopted any equity compensation plan and no stock, options, or other equity securities were awarded to our executive officers.\nOption exercises and stock vested\nAs at June 30, 2022, we had not adopted any equity compensation plan and no stock, options, or other equity securities were awarded to our executive officers. No options have been exercised.\nCompensation of Directors\nThe particulars of compensation paid to our directors for our year ended June 30, 2022, is set out below:\nName Fees\nEarned or\nPaid in\nCash\n($) Stock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($) Change in\nPension\nValue and\nNonqualified\nDeferred\nCompensation\nEarnings\nAll Other\nCompensation\n($) Total\n($)\nJunjun Wu Nil Nil Nil Nil Nil Nil Nil\nHong Ba Nil Nil Nil Nil Nil Nil Nil\nChristina Chen Nil Nil Nil Nil Nil Nil Nil\nWe reimburse our directors for expenses incurred in connection with attending board meetings. We did not pay director's fees or other cash compensation for services rendered as a director in the year ended June 30, 2022.\nWe have no formal plan for compensating our directors for their service in their capacity as directors, although such directors are expected in the future to receive stock options to purchase common shares as awarded by our board of directors or (as to future stock options) a compensation committee which may be established. Directors are entitled to reimbursement for reasonable travel and other out-of-pocket expenses incurred in connection with attendance at meetings of our board of directors. Our board of directors may award special remuneration to any director undertaking any special services on our behalf other than services ordinarily required of a director. No director received and/or accrued any compensation for their services as a director, including committee participation and/or special assignments.\nAggregated Options Exercised in the Year Ended June 30, 2022 and Year End Option Values\nAs at June 30, 2022, we had not adopted any equity compensation plan and no stock, options, or other equity securities were awarded to our executive officers. No options have been exercised.\nRe-pricing of Options/SARS\nThere were no options granted during the year ended June 30, 2022 therefore no options were re-priced. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nIn the following tables, we have determined the number and percentage of shares beneficially owned in accordance with Rule 13d-3 of the Exchange Act based on information provided to us by our controlling shareholders, executive officers and directors, and this information does not necessarily indicate beneficial ownership for any other purpose. In determining the number of shares of our common stock beneficially owned by a person and the percentage ownership of that person, we include any shares as to which the person has sole or shared voting power or investment power, as well as any shares subject to warrants or options held by that person that are currently exercisable or exercisable within 60 days.\n(1) Title of\nclass (2) Name and address of\nbeneficial owner (3) Amount and nature of\nbeneficial ownership (4) Percent of\nclass\nOfficers and Directors\ncommon stock\nHong Ba\nUnit 2702, Sanlitun SOHO Building 2,\nNo. 8, Gongtibeilu\nChaoyang District, Beijing China 100027 27,123,001 Direct\n20.9%\ncommon stock\nChristina Chen\n6868 Hamber St.\nRichmond, BC V7C 5T2\nCanada\n91,000,000 Direct\n70.0%\nDirectors and Officers as a Group (2 persons) 118,123,001 Direct 90.9%\n5% Beneficial Owner\nNo additional 5%\nbeneficial owners.\nSecurity ownership of certain beneficial owners\nPercentage of ownership is based on 130,085,501 shares of common stock issued and outstanding as of October 13, 2022. Except as otherwise indicated, we believe that the beneficial owners of the common stock listed above, based on information furnished by such owners, have sole investment and voting power with respect to such shares, subject to community property laws where applicable. Beneficial ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities. Shares of common stock subject to options or warrants currently exercisable, or exercisable within 60 days, are deemed outstanding for purposes of computing the percentage ownership of the person holding such option or warrants, but are not deemed outstanding for purposes of computing the percentage ownership of any other person. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nTransactions with related persons\nMrs. Hong Ba serves as the Chief Executive Officer and Director of the Company. Mr. Feng Li, the husband of Mrs. Hong Ba, is the owner of the Canada Airchn Financial Inc. (\"CAFI\"). The shareholders make advances to the Company from time to time for the Company's operations. These advances are due on demand and non-interest bearing.\nAs of June 30, 2022, there was $51,474 (June 30, 2021 - $12,020) due to related parties in total.\nDuring the year ended June 30, 2021, on December 14, 2020, the CEO of the Company assigned the debt owed to her by the Company to a transferee who entered into a debt cancellation agreement to convert the debt of $10,584 into 2,116,804 common shares of the Company at a price of $0.005 per share.\nDuring the year ended June 30, 2022, the CEO of the Company advanced $28,910 (June 30, 2021 - $7,048) to the Company for operating expenditure.\nFor the year ended June 30, 2021, on December 14, 2020, the debt of $33,402 (2020 - $28,201) owed to a company owned by Feng Li, the husband of Mrs. Hong Ba, our CEO was assigned to a transferee who entered into a debt cancellation agreement to convert the debt into 6,680,448 common shares of the Company at a price of $0.005 per share.\nDuring the year ended June 30, 2022, a company owned by Feng Li charged the Company $7,584 (CAD$9,600) (June 30, 2021 - $7,498 (CAD$9,600) in rent. As of June 30, 2022, the debt of $11,187 (June 30, 2021 - $3,850) has been due to the related party.\nAs of the year ended June 30, 2022, Mr Feng Li advanced $3,529 (June 30, 2021 - $900) to the Company for operating expenditures.\nAs of June 30, 2021, the Company has received advances for future share issuance of $192,444 and an advance of $222 for operating expenditure from a related party who is an over 10% shareholder of the Company. As of June 30, 2022, the Company expensed $14,896 (June 30, 2021 - $14,326) in imputed interest. On December 14, 2020, such related party assigned the debt owed to him by the Company to a transferee who entered into a debt cancellation agreement to convert the debt into 38,488,858 common shares of the Company at a price of $0.005 per share. All advances for future share issuance were issued common shares of the Company and no such advances were outstanding as of June 30, 2022.\nOther than the disclosure above, none of the following parties has, during the Company's last two fiscal years or thereafter, had any material interest, direct or indirect, in any transaction with us or in any presently proposed transaction that has or will materially affect us, other than as noted in this section:\n(i) Any of our directors or officers;\n(ii) Any person proposed as a nominee for election as a director;\n(iii) Any person who beneficially owns, directly or indirectly, shares carrying more than 5% of the voting rights attached to our outstanding shares of common stock;\n(iv) Any of our promoters; and\n(v) Any member of the immediate family (including spouse, parents, children, siblings and in- laws) of any of the foregoing persons.\nEmployment Contracts\nWe are not party to any employment contracts with our directors and officers.\nPension, Retirement or Similar Benefit Plans\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. We have no material bonus or profit sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that stock options may be granted at the discretion of the Board of Directors or a committee thereof.\nWe have no plans or arrangements in respect of remuneration received or that may be received by our executive officers to compensate such officers in the event of termination of employment (as a result of resignation, retirement, change of control) or a change of responsibilities following a change of control, where the value of such compensation exceeds $60,000 per executive officer. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nAudit and Accounting Fees\nThe following table sets forth the fees billed to the Company for professional services rendered by the Company's principal accountant, for the years ended June 30, 2022 and 2021:\nServices\nAudit fees $ 24,500\n$ 31,250\nTax fees\n-\nAll other fees\n-\n-\nTotal fees $ 24,500\n$ 31,750\nAudit Fees\nConsist of fees billed for professional services rendered for the audits of our financial statements, reviews of our interim financial statements included in quarterly reports, services performed in connection with filings with the Securities and Exchange Commission and related comfort letters and other services that are normally provided by independent auditors and accountants for the fiscal years ended June 30, 2022 and 2021 in connection with statutory and regulatory filings or engagements.\nTax Fees\nConsisted of fees billed for professional services rendered by the principal accountant for tax compliance. Consisted of fees billed for professional services rendered by the principal accountant for tax compliance.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a) (1) Financial Statements.\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations and Comprehensive Loss for the Years Ended June 30, 2022 and 2021\nConsolidated Statements of Changes in Shareholders' (Deficit) as of June 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the Years Ended June 30, 2022 and 2021\nNotes to Consolidated Financial Statements\n(3) The following Exhibits are filed as part of this report on Form 10-K:\n(3) Articles of Incorporation and By-laws\n3.1 Articles of Incorporation (attached as an exhibit to our registration statement on Form SB-2 filed September 25, 2006)\n3.2 Certificate of Amendment of Certificate of Incorporation (incorporated by reference to an exhibit to the Quarterly Report on form 10-Q filed on February 10, 2012)\n3.3 By-Laws (attached as an exhibit to our registration statement on Form SB-2 filed September 25, 2006)\n(4) Description of Registrant's Securities\n4.1 Description of Common Stock (incorporated by reference to an exhibit to the Annual Report on Form 10-K filed on September 27, 2019)\n(10) Material Contracts\n10.1 Stock Purchase Agreement, dated June 6, 2022, by and among the Purchasers and Sellers (attached as an exhibit to our Current Report on Form 8-K filed June 10, 2022)\n(14) Code of Ethics\n14.1 Code of Ethics adopted September 10, 2007 (attached as an exhibit to our annual report on Form 10-KSB filed September 28, 2007)\n(21) Subsidiaries of Registrant\n21.1 List of Subsidiaries (attached as an exhibit to our annual report on Form 10-K filed on October 11, 2012)\n(31) Section 302 Certification\n31.1* Certification Statement of the Principal Executive Officer and Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n(32) Section 906 Certification\n32.1* Certification Statement of the Principal Executive Officer and Principal Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101* Interactive Data Files\n101.INS Inline XBRL Instance Document-the instance document does not appear in the Interactive Data File as its XBRL tags are embedded within the Inline XBRL document\n101.SCH Inline XBRL Taxonomy Extension Schema Document\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n*filed herewith\nITEM 16. FORM 10-K SUMMARY.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nW&E SOURCE CORP.\nBy: /s/ Hong Ba\nHong Ba\nCEO, CFO\nPrincipal Executive Officer, Principal Financial Officer and Principal Accounting Officer\nDate: October 13, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n/s/ Hong Ba\nHong Ba\nDirector, CEO, CFO\nPrincipal Executive Officer, Principal Financial Officer and Principal Accounting Officer\nDate: October 13, 2022\n/s/ Christina Chen\nChristina Chen\nDirector\nDate: October 13, 2022\nW&E Source Corp.\nFinancial Statements\nAs of and for the years ended June 30, 2022 and 2021\nContents\nReport of Independent Registered Public Accounting Firm PCAOB ID: 5854\nConsolidated Balance Sheets\nConsolidated Statements of Operations and Comprehensive Income (Loss)\nConsolidated Statements of Changes in Shareholders' (Deficit)\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements -11\nTo the Shareholders and Board of Directors,\nW&E Source Corp.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of W&E Source Corp. (the \"Company\") as of June 30, 2022 and 2021, the related statements of operations, stockholders' deficit, and cash flows for the years then ended, and the related notes (collectively referred to as the \"consolidated financial statements\"). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nGoing Concern Matter\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the consolidated financial statements, the Company has suffered recurring losses from operations that raises substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ TAAD LLP\nWe have served as the Company's auditor since 2016\nDiamond Bar, California\nOctober 13, 2022\n______________________________\nW&E Source Corp.\n(Formerly News of China Inc.)\nConsolidated Balance Sheets\nAs of June 30, 2022 and 2021\n(Audited)\nJune 30, 2022\nJune 30, 2021\nAssets\nCurrent Assets\nCash $\n$ 2,248\nOther Receivables\nTotal current assets\n2,290\nNon-Current Assets\nPrepayments/Deposits\n11,653\n12,030\nTotal non-current assets\n11,653\n12,030\nTOTAL ASSETS $ 12,546\n$ 14,320\nLiabilities and Shareholders' Deficit\nCurrent liabilities\nAccounts payable and accrued liabilities $ 49,310\n$ 24,561\nAdvances from related parties and related party payables\n51,474\n12,020\nTotal current liabilities\n100,784\n36,581\nTOTAL LIABILITIES\n100,784\n36,581\nShareholders' deficit\nCommon stock, $0.0001 par value, 500,000,000 shares authorized, 130,085,501 shares issued and outstanding as of June 30, 2022 and 2021\n13,009\n13,009\nAdditional paid-in capital\n1,217,646\n1,217,106\nAccumulated deficit\n(1,327,434 )\n(1,255,841 )\nAccumulated other comprehensive income\n8,541\n3,465\nTotal shareholders' deficit\n(88,238 )\n(22,261 )\nTOTAL LIABILITIES AND SHAREHOLDERS' DEFICIT $ 12,546\n$ 14,320\nThe accompanying notes are an integral part of these consolidated financial statements.\nW&E Source Corp.\n(Formerly News of China Inc.)\nConsolidated Statements of Operations and Comprehensive Loss\nFor the Years Ended June 30, 2022 and 2021\n(Audited)\nJune 30, 2022\nJune 30, 2021\nRevenues $ -\n$ -\nCost of revenues\n-\n-\nGross profit\n-\n-\nOperating expenses\nGeneral and administrative expenses\n65,730\n55,028\nTotal operating expenses\n65,730\n55,028\nOperating Loss\n(65,730 )\n(55,028 )\nOther income (expense)\nInterest expense\n(542 )\n(14,386 )\nGain on debt settlement\n-\n90,433\nForeign currency exchange gain (loss)\n(5,321 )\n6,158\nTotal other income (expense)\n(5,863 )\n82,205\nNet income (loss)\n(71,593 )\n27,177\nOther comprehensive income (loss):\nCumulative foreign currency translation adjustment\n3,282\n12,456\nComprehensive income (loss) $ (68,311 ) $ 39,633\nWeighted average number of shares outstanding - basic and diluted\n130,085,501\n108,379,583\nIncome (loss) per share - basic and diluted $ (0.00 ) $ 0.00\nThe accompanying notes are an integral part of these consolidated financial statements.\nW&E Source Corp.\n(Formerly News of China, Inc.)\nConsolidated Statements of Changes in Shareholders' (Deficit)\nAs of June 30, 2022 and 2021\n(Audited)\nCommon\nAdditional\nAccumulated other\nTotal\nStock\nPaid-in\nComprehensive\nAccumulated\nShareholders'\nShares\nAmount\nCapital\nIncome\nDeficit\nEquity (Deficit)\nBalance at June 30, 2020 82,489,391\n8,249\n1,059,931\n15,920\n(1,283,018 )\n(198,918 )\nImputed interest -\n-\n13,091\n-\n-\n13,091\nForeign currency translation adjustment -\n-\n-\n(3,735 )\n-\n(3,735 )\nNet Loss -\n-\n-\n-\n(26,468 )\n(26,468 )\nBalance at September 30, 2020 82,489,391\n8,249\n1,073,022\n12,185\n(1,309,486 )\n(216,030 )\nImputed interest -\n-\n1,235\n-\n-\n1,235\nShare issuance by debts settlement 47,596,110\n4,760\n142,788\n-\n-\n147,548\nForeign currency translation adjustment -\n-\n-\n(8,052 )\n-\n(8,052 )\nNet Loss -\n-\n-\n-\n82,863\n82,863\nBalance at December 31, 2020 130,085,501\n13,009\n1,217,045\n4,133\n(1,226,623 )\n7,564\nForeign currency translation adjustment -\n-\n-\n-\nNet Loss -\n-\n-\n-\n(12,173 )\n(12,173 )\nBalance at March 31, 2021 130,085,501\n13,009\n1,217,045\n4,938\n(1,238,796 )\n(3,804 )\nImputed interest -\n-\n-\n-\nForeign currency translation adjustment -\n-\n-\n(1,473 )\n-\n(1,473 )\nNet Loss -\n-\n-\n-\n(17,045 )\n(17,045 )\nBalance at June 30, 2021 130,085,501\n13,009\n1,217,106\n3,465\n(1,255,841 )\n(22,261 )\nImputed interest -\n-\n-\n-\nForeign currency translation adjustment -\n-\n-\n2,322\n-\n2,322\nNet Loss -\n-\n-\n-\n(12,065 )\n(12,065 )\nBalance at September 30, 2021 130,085,501\n13,009\n1,217,144\n5,787\n(1,267,906 )\n(31,966 )\nImputed interest -\n-\n-\n-\nForeign currency translation adjustment -\n-\n-\n(528 )\n-\n(528 )\nNet Loss -\n-\n-\n-\n(10,545 )\n(10,545 )\nBalance at December 31, 2021 130,085,501\n13,009\n1,217,214\n5,259\n(1,278,451 )\n(42,969 )\nImputed interest -\n-\n-\n-\nForeign currency translation adjustment -\n-\n-\n(2,671 )\n-\n(2,671 )\nNet Loss -\n-\n-\n-\n(14,243 )\n(14,243 )\nBalance at March 31, 2022 130,085,501\n13,009\n1,217,317\n2,588\n(1,292,694 )\n(59,780 )\nImputed interest -\n-\n-\n-\nForeign currency translation adjustment -\n-\n-\n5,953\n-\n5,953\nNet Loss -\n-\n-\n-\n(34,740 )\n(34,740 )\nBalance at June 30, 2022 130,085,501\n13,009\n1,217,646\n8,541\n(1,327,434 )\n(88,238 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nW&E Source Corp.\n(Formerly News of China, Inc.)\nConsolidated Statements of Cash Flows\nFor the Years Ended June 30, 2022 and 2021\n(Audited)\nJune 30, 2022\nJune 30, 2021\nCash Flow from Operating Activities\nNet income (loss) $ (71,593 ) $ 27,177\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nForeign currency exchange gain (loss)\n2,955\n7,600\nGain on debt settlement\n-\n(90,433 )\nImputed interest to related party\n14,386\nChange in operating assets and liabilities:\nIncrease (decrease) in accounts payable and accrued liabilities\n25,011\n8,109\nIncrease (decrease) in related party payable\n-\n(537 )\nNet cash used in operating activities\n(43,085 )\n(33,698 )\nCash Flows from Financing Activities\nProceeds from related parties\n40,478\n32,153\nNet cash provided by financing activities\n40,478\n32,153\nCumulative translation adjustment\n1,212\nNet increase (decrease) in cash for the year\n(1,395 )\n(1,260 )\nBeginning of period\n2,248\n3,508\nEnd of period $\n$ 2,248\nSupplemental cash flows information\nInterest paid\n-\n-\nIncome tax paid\n-\n-\nNon cash investing and financing activities\nShare issuance for the debt settlement\n-\n237,981\nThe accompanying notes are an integral part of these consolidated financial statements.\nW&E Source Corp.\n(Formerly News of China, Inc.)\nNotes to Consolidated Financial Statements\nFor the Years Ended June 30, 2022 and 2021\nNote 1 - Organization and Nature of Operations\nW&E Source Corp. (\"the Company\") was incorporated in the State of Delaware on October 11, 2005 and is based in Montréal, Québec, Canada. The Company is providing air ticket reservations, hotel reservations and other travel related services.\nOn August 25, 2011, the Company incorporated a company called Airchn Travel Global, Inc. (\"ATGI\") in the State of Washington, USA. ATGI is a wholly owned subsidiary of the Company. ATGI focuses on a business segment of travel businesses which includes air ticket reservations, hotel reservations and other travel services.\nOn October 4, 2011, the Company incorporated a company called Airchn Travel (Canada) Inc. (\"ATCI\") in the Province of British Columbia, Canada. ATCI is a wholly owned subsidiary of ATGI. ATCI has a similar business segment as ATGI.\nIn January 2012, the Company changed its name from News of China, Inc. to W&E Source Corp. and increased its authorized shares to 500,000,000 shares. As a result of the name change, the Company's listing symbol was also changed to WESC.\nDuring the year ended June 30, 2012, the Company incorporated a company named Airchn Travel (Beijing) Inc. (\"ATBI\") in Beijing, China. ATBI is also a wholly owned subsidiary of ATGI. ATBI has a similar business segment as ATGI.\nOn December 15, 2012, Airchn Travel (Beijing) Inc., a wholly owned subsidiary of W&E Source Corp. (the \"Company\"), entered into the Share Purchase Agreement (the \"Agreement\") with Mr. Wu Hao (the \"Seller\"), a majority shareholder of Chengdu Baopiao Internet Co., Ltd. (\"Baopiao\"), to acquire part of his ownership in Baopiao which equals 51% of all issued and outstanding stock of Baopiao (the \"Shares\").\nThe Company will pay for the aggregate purchase price of RMB 2,550,000 for the Shares in cash and by assuming the Seller's debt to Baopiao in the amount of RMB1,800,000 (approximately US $289,000) (the \"Debt\"). According to the terms of the Agreement, the Company will assume the Debt upon execution of the Agreement and pay the Seller the remaining RMB750,000 of the purchase price within 20 days from the execution of the Agreement. Also at execution, the Company will pay Baopiao RMB200,000 as repayment of the Debt and satisfy the remaining Debt of RMB1,600,000 within 20 days from the execution of the Agreement.\nAlso pursuant to the Agreement, the Seller will provide guaranties that other than the information including financial statements provided to the Company, Baopiao does not have any other debts, and no third party has any rights or liens on the assets of Baopiao. The Seller and Baopiao will also indemnify the Company against any damages, liabilities, losses and expenses which the Company may sustain or suffer due to any breach of the guaranties made by the Seller or Baopiao.\nBaopiao has obtained the necessary shareholder approval for the transfer of the Shares and will register the transfer of the Shares with the applicable State Administration for Industry and Commerce within three days from the date of the Agreement.\nIn connection with the Agreement, the Company also entered into an agreement with the Seller and Baopiao that as an incentive for the management team of Baopiao, the Company will reserve up to 26 million shares of its common stock for issuance to the Baopiao employees upon achievement of certain milestones over the next three years.\nThe Share Purchase Agreement with Mr. Wu Hao was not completed in January, 2013 and both the Company and Mr. Wu Hao agreed to terminate the agreement entered on December 15, 2012.\nOn June 6, 2022, certain shareholders of the Company entered into a Stock Purchase Agreement (the \"SPA\") with Hong Ba and Xingru (Christina) Chen for the sale and purchase of an aggregate of 118,123,001 shares of common stock of the Company. On June 8, 2022, the transaction contemplated by the SPA closed, representing approximately 90.8% of the Company's issued and outstanding common shares. For detail refer to the Form 8-K filed on June 10, 2022. It resulted in change of control of the Company. Pursuant to the provisions of the SPA, effective June 8, 2022, Junjun Wu resigned as a member of the Board of Directors, Hong Ba would continue to serve as a director of the Company, CEO and CFO of the Company and the Board of Directors appointed Christina Chen as a director of the Company.\nNote 2 - Summary of Significant Accounting Policies\na. Basis of presentation. The Company prepares its financial statements in accordance with accounting principles generally accepted in the United States. This basis of accounting involves the application of accrual accounting and consequently, revenues and gains are recognized when earned, and expenses and losses are recognized when incurred. The consolidated financial statements are expressed in U.S. dollars.\nb. Foreign currency translation. ATCI's and ATBI's functional currency for operations is the Canadian dollar and Chinese yuan. However, the Company's reporting currency is the U.S. dollar. Therefore, the consolidated financial statements for all periods presented have been translated into the U.S. dollar using the current rate method. Under this method, the income statement and the cash flows for each period have been translated into U.S. dollars using the average rate of the reporting period, and assets and liabilities have been translated using the exchange rate at the end of the period. All resulting exchange differences are reported in the cumulative translation adjustment account as a separate component of shareholders' equity. As at June 30, 2022, the foreign exchange rate were adopted:\nRMB to USD CAD to USD\nSpot rate: 0.1493 0.7769\nAverage rate: 0.1549 0.7900\nc. Principles of consolidation. The consolidated statements include the accounts of the Company and its wholly owned subsidiaries, ATGI, ATCI and ATBI. All inter-company transactions and balances were eliminated.\nd. Use of Estimates. The preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities as of the date of the consolidated financial statements and the reported amounts of revenues and expense during the period. Actual results could differ from those estimates.\ne. Loss per share. Basic loss per share (\"EPS\") is computed by dividing net loss available to common stockholders by the weighted average number of common shares outstanding during the period, excluding the effects of any potentially dilutive securities. Diluted EPS gives effect to all dilutive potential of shares of common stock outstanding during the period including stock options or warrants, using the treasury stock method (by using the average stock price for the period to determine the number of shares assumed to be purchased from the exercise of stock options or warrants), and convertible debt or convertible preferred stock, using the if-converted method. EPS excludes all potential dilutive shares of common stock if their effect is anti-dilutive. There were no dilutive securities at June 30, 2022 and 2021.\nf. Revenue recognition. The Company recognizes revenue when it is realized or realizable and earned. The Company considers revenue realized or realizable and earned when it has persuasive evidence of an arrangement, delivery has occurred, the sales price is fixed or determinable, and collectability is reasonably assured. Revenue, which primarily consists of commission fees from air ticketing and hotel booking operations, is recognized as tickets and hotels are booked and non-cancellable, and is recorded on a net basis (that is, the amount billed to a customer less the amount paid to a supplier) as the Company acts as an agent in these transactions. Effective January 1, 2018, the Company adopted the guidance of Accounting Standards Codification (ASC) 606, Revenue from Contracts. The implementation of ASC 606 did not have a material impact on the Company's consolidated financial statements. ASC 606 create a five-step model that requires entities to exercise judgement when considering the terms of contract, which includes (1) identifying the contracts or agreement with a customer, (2) identifying our performance obligations in the contract or agreement, (3) determining the transaction price, (4) allocating the transaction price to the separate performance obligation, and (5) recognizing revenue as each performance obligation is satisfied. The Company only applies the five-step model to contracts when it is probable that the Company will collect the consideration it is entitled to in exchange for the services it transfers to its clients. The Company's revenue consists of revenue from providing travel consulting and travel arrangement advisory services (\"service revenue\"), and service revenue from travel schedule arrangements and advisory.\ng. Cash and cash equivalents. The Company includes in cash and cash equivalents all short-term, highly liquid investments that mature within three months or less of their acquisition date. Cash equivalents consist principally of investments in interest-bearing demand deposit accounts and liquidity funds with financial institutions and are stated at cost, which approximates fair value. As of June 30, 2022 and 2021, we have no cash equivalents.\ni. Income taxes. Deferred tax assets and liabilities are recognized for future tax consequences attributable to differences between financial statement carrying amounts of existing assets and liabilities and their respective tax bases. In addition, the Company recognizes future tax benefits, such as carryforwards, to the extent that realization of such benefits is more likely than not and that a valuation allowance is provided when it is more likely than not that some portion of the deferred tax asset will not be realized. Company's net operating losses carryforwards are subject to Section 382 limitation.\nj. Recently issued accounting pronouncements. The Company does not expect that any recently issued accounting pronouncement will have a significant impact on the consolidated results of operations, financial position, or cash flows of the Company.\nRecently Issued Accounting Pronouncements\nOn March 2021, the FASB issued Accounting Standards Update (ASU) 2021-03, \"Intangibles-Goodwill and Other (Topic 350): Accounting Alternative for Evaluating Triggering Events\" (\"ASU 2021-03\"). The amendments in ASU 2021-03 provide private companies and not-for-profit (NFP) entities with an accounting alternative to perform the goodwill impairment triggering event evaluation as required in FASB Accounting Standards Codification (FASB ASC) 350-20, Intangibles-Goodwill and Other-Goodwill, as of the end of the reporting period, whether the reporting period is an interim or annual period. An entity that elects this alternative is not required to monitor for goodwill impairment triggering events during the reporting period but, instead, should evaluate the facts and circumstances as of the end of each reporting period to determine whether a triggering event exists and, if so, whether it is more likely than not that goodwill is impaired. The amendments in this ASU are effective on a prospective basis for fiscal years beginning after December 15, 2019. Early adoption is permitted for both interim and annual financial statements that have not yet been issued as of June 30, 2022. The Company have adopted this ASU on the consolidated financial statements in the year ended June 30, 2021. The adoption had no material impact on the consolidated financial statements in the year ended June 30, 2022 and 2021.\nOn April 2021, the FASB issued ASU 2021-04, \"Earnings Per Share (Topic 260), Debt- Modifications and Extinguishments (Subtopic 470-50), Compensation-Stock Compensation (Topic 718), and Derivatives and Hedging- Contracts in Entity's Own Equity (Subtopic 815-40): Issuer's Accounting for Certain Modifications or Exchanges of Freestanding Equity-Classified Written Call Options\" (\"ASU 2021-04\") to clarify the accounting by issuers for modifications or exchanges of equity-classified warrants. The new ASU is available here and effective for all entities in fiscal years starting after December 15, 2021. Early adoption is permitted. The Company is currently evaluating the impact of ASU 2021-04 on its consolidated financial statements.\nOn July 2021, the FASB issued ASU 2021-05, \"Leases (Topic 842): Lessors-Certain Leases with Variable Lease Payments\", which upon adoption requires a lessor to classify a lease with variable lease payments (that do not depend on a rate or index) as an operating lease on commencement date if classifying the lease as a sales-type or direct financing lease would result in a selling loss. The amendments in this ASU are effective for all entities in fiscal years, and interim periods within those fiscal years, beginning after December 15, 2021. The adoption had no material impact on the consolidated financial statements for the year ended June 30, 2022.\nOn July 2021, the FASB issued ASU 2021-07, \"Stock Compensation (Topic 718): Stock Compensation\" (\"ASU 2021-07\") to address the concerns from stakeholders about the cost and complexity of determining the fair value of equity-classified share-based awards for private companies. It specifically permits private companies to use 409A valuations prepared under US Treasury regulations to estimate the fair value of certain awards under ASC 718. The Update is effective for private companies in fiscal years starting after December 15, 2021. Early adoption is permitted. The Company is currently evaluating the impact of ASU 2021-07 on its consolidated financial statements.\nOn August 2021, the FASB issued ASU 2021-08, \"Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers\" (\"ASU 2021-08\") to require an acquirer to recognize and measure contract assets and contract liabilities acquired in a business combination in accordance with revenue recognition guidance as if the acquirer had originated the contract. That is, such acquired contracts will not be measured at fair value. ASU 2021-08 is effective for privately held companies with fiscal years beginning after December 15, 2023, with early adoption permitted. The Company is currently evaluating the impact of ASU 2021-08 on its consolidated financial statements.\nNote 3 - Going Concern\nAs reflected in the accompanying consolidated financial statements, the Company had accumulated deficits of $1,327,434 and $1,255,841, and net loss of $71,593 and net income of $27,177, respectively, for the fiscal years ended June 30, 2022 and 2021. The Company currently has business activities to generate funds for its own operations, however, has not yet achieved profitable operations. These factors raise substantial doubt about our ability to continue as a going concern. The Company's ability to continue as a going concern is dependent on its ability to raise additional capital and implement its business plan. These financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nManagement believes that the current actions to obtain additional funding from independent investors or from the management and to implement its strategic plans should allow the Company to continue as a going concern. There are no assurances that additional funds will be available when needed from any source or, if available, will be available on terms that are acceptable to us.\nNote 4 - Prepayment\nAs of June 30, 2022, the Company prepaid a security deposit of $11,653 (CAD$15,000) (June 30, 2021 - $12,030 (CAD$15,000)) to Consumer Protection British Columbia Province for the guarantee of service quality.\nNote 5 - Accounts Payable and Accrued Liabilities\nAccounts Payable and Accrued Liabilities of $49,310 as of June 30, 2022 (June 30, 2021 - $24,561) consists of vendor payables of $1,295 in legal fees, $32,232 in audit and accounting fees, $245 in filing fees and $15,538 in other payables to a former shareholder of the Company advanced for operating expenses.\nNote 6 - Related Parties\nMrs. Hong Ba serves as the Chief Executive Officer and Director of the Company. Mr. Feng Li, the husband of Mrs. Hong Ba, is the owner of the Canada Airchn Financial Inc. (\"CAFI\"). The shareholders make advances to the Company from time to time for the Company's operations. These advances are due on demand and non-interest bearing.\nAs of June 30, 2022, there was $51,474 (June 30, 2021 - $12,020) due to related parties in total.\nAs of the year ended June 30, 2022, the CEO of the Company advanced $28,910 (June 30, 2021 - $7,048) to the Company for operating expenditures.\nDuring the year ended June 30, 2022, a company owned by Feng Li, the husband of Mrs. Hong Ba, our CEO, charged the Company $7,584 (CAD$9,600) (June 30, 2021 - $7,498 (CAD$9,600) in rent and the debt of $11,187 has been due to the related party (June 30, 2021 - $3,850).\nAs of the year ended June 30, 2022, Mr Feng Li advanced $3,529 (June 30, 2021 - $900) to the Company for operating expenditures.\nAs of June 30, 2022, the Company has received advances of $7,633 (June 30, 2021 - $Nil) for operating expenditures from related party, a director of the Company\nAs of June 30, 2022, the Company has received advances of $214 (June 30, 2021 - $222) for operating expenditures from related parties who were over 10% shareholders of the Company.\nNote 7 - Income Taxes\nUnited States of America\nThe Company and its subsidiary are subject to income taxes on an entity basis on income arising in, or derived from, the tax jurisdiction in which they operate and will file annual tax returns.\nCanada\nThe Company's subsidiary, Airchn Travel (Canada) Inc. is incorporated in British Columbia in Canada. It is subject to income taxes on income arising in, or derived from, the tax jurisdiction in British Columbia it operates. The basic federal rate of Part I tax is 38% of taxable income, 28% after federal tax abatement. After the general tax reduction, the net federal tax rate is 18% effective January 1, 2010; 16.5% effective January 1, 2011; 15% effective January 1, 2012. The provincial and territorial lower and higher tax rates in British Columbia are 2.5% and 10%, respectively. Other than income tax, Airchn Travel (Canada) Inc. is GST registrants who make taxable services in British Columbia and collect tax at the 5% GST rate on taxable services.\nPeople's Republic of China\nThe Company's subsidiary, Airchn Travel (Beijing) Inc. is incorporated in Beijing in China. It is subject to PRC tax laws. Prior to January 1, 2008, PRC enterprise income tax (\"EIT\") was generally assessed at the rate of 33% of taxable income. In March 2007, a new enterprise income tax law (the \"New EIT Law\") in the PRC was enacted which was effective on January 1, 2008. The New EIT Law generally applies a uniform 25% EIT rate to both foreign invested enterprises and domestic enterprises.\nFor the reporting periods, the components of loss before income taxes were comprised of the following:\nFor the Year Ended\nFor the Year Ended\nJune 30, 2022\nJune 30, 2021\nUnited States of America $ 58,215\n$ 28,735\nCanada\n11,588\n(5,988 )\nPeople's Republic of China\n1,790\n4,430\nLoss before income taxes $ 71,593\n$ 27,177\nThe components of deferred taxes assets at June 30:\nUSA net operating income $ (12,224 ) $ (6,034 )\nCanada net operating losses\n(1,738 )\nPRC net operating losses\n(448 )\n(1,108 )\nDeferred tax assets, net\n(14,410 )\n(6,244 )\nLess: valuation allowance\n14,410\n6,244\nDeferred tax assets, net $ -\n$ -\nAs of June 30, 2022, the Company has an accumulated deficit of $1,327,434 that can be carried forward to offset future net profit for income tax purposes. All tax penalties and interest are expensed as incurred. For the years ended June 30, 2022 and 2021, there were no tax penalties or interest.\nNote 8 - Commitment and Contingencies\nThe Company leases an office space in Canada for a term under month by month operating lease agreement. Monthly rent is $616 (CAD$800).\nCAD$9,600\nCAD$9,600\nCAD$9,600\nCAD$9,600\nCAD$9,600\nFor each of the year ended June 30, 2022 and 2021, the Company recorded a rent expense of $7,584 (CAD$9,600) and $7,498 (CAD$9,600), respectively.\nNote 9 - Common Stock\nOn January 23, 2012, the Company entered into a subscription agreement with the significant shareholder Hong Ba, for the sale of 22,000,000 common shares for $630,000 from cash received and expense paid on behalf by Hong Ba. Subsequent to the sale, Hong Ba owns 22,000,000 common shares which represent 45.9% of the issued and outstanding shares of the Company.\nThe Share Purchase Agreement with Mr. Wu Hao was not completed in January 2013, and both the Company and Mr. Wu Hao agreed to terminate the agreement entered on December 15, 2012. On October 26, 2014, the Company issued 15,538,300 common shares of the Company to settle the debts payable of $155,383 to related parties at $0.01 per share.\nThe Company is authorized to issue 500,000,000 shares of common stock with par value of $0.0001. As of June 30, 2022 and June 30, 2021, 130,085,501 and 130,085,501 shares of common stock were issued and outstanding, respectively.\nOn October 26, 2014, the Company issued 15,538,300 common shares of the Company to settle the debts payable of $155,383 to related parties at $0.01 per share.\nOn August 5, 2016, the Company entered into Debt Conversion Agreements (the \"Agreements\") with each of Lin Li and Youzhe Li, who were each creditors to the Company with total outstanding balances of $25,920 (the \"Lin Li Loan\") and $78,861 (the \"Youzhe Li Loan\" and, together with the Lin Li Loan, the \"Loans\"), respectively. Pursuant to the Agreements the Company agreed to issue an aggregate total of 19,051,091 shares of its common stock, $0.0001 par value per share (the \"Shares\"), at the conversion rate of $0.0055 per share as full payment for the Loans. Upon issuance and delivery of the Shares, the Loans were fully paid and the Company no longer had any obligations to the individuals under the Loans.\nLin Li is the sister of Mr. Feng Li, who is the husband of Hong Ba, the Company's director, CEO and CFO.\nOn August 5, 2016, the Company issued 14,338,364 common shares of the Company to such a related party in cancellation of the debt of $78,861 owed to such party at such time.\nOn December 14, 2020, the Company entered into Debt Cancellation Agreement (the \"Debt Cancellation Agreement\") with certain creditors to the Company with a total outstanding aggregate balance of US$237,981 (the \"Debts\"). Pursuant to the Debt Cancellation Agreement the Company agreed to issue an aggregate total of 47,596,110 shares of its common stock, $0.0001 par value per share (the \"Shares\"), at the conversion rate of US$0.005 per share as full payment for the Debts. Upon issuance and delivery of the Shares, the Debts were fully paid and the Company no longer had any obligations to the creditors under the Debts.\nOn June 6, 2022, certain shareholders of the Company entered into a Stock Purchase Agreement (the \"SPA\") with Hong Ba and Xingru (Christina) Chen for the sale and purchase of an aggregate of 118,123,001 shares of common stock of the Company. On June 8, 2022, the transaction contemplated by the SPA closed, representing approximately 90.8% of the Company's issued and outstanding common shares. It resulted in change of control of the Company.\nAs the filing date of these financial statements, there are 130,085,501 shares issued and outstanding."
}