{
    "cik": "1374567",
    "company": "Luvu Brands, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-14",
    "period_of_report": "2022-06-30",
    "sic": "2510",
    "state_of_inc": "FL",
    "state_location": "GA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1374567/0001654954-22-013718-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1374567/000165495422013718/luvu_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1374567/0001654954-22-013718.txt",
    "filename": "1374567_10K_2022_0001654954-22-013718.htm",
    "content": "ITEM 1. Business.\nGeneral\nLuvu Brands, Inc. designs, manufactures and markets a portfolio of consumer lifestyle brands through the Companys websites, online mass merchants and specialty retail stores worldwide. Brands include: Liberator®, a brand category of iconic products for enhancing sensuality and intimacy; Avana®, Top-of-Bed Comfort products and inclined bed therapy products, assistive in relieving medical conditions associated with acid reflux, surgery recovery and chronic pain; and Jaxx®, a diverse range of casual fashion daybeds, sofas and beanbags made from virgin and re-purposed polyurethane foam. These products are sold through the Companys websites, online mass merchants and retail stores worldwide. Many of our products are offered flat-packed and either roll or vacuum compressed to save on shipping and reduce our carbon footprint.\nHeadquartered in Atlanta, Georgia, the Company occupies a 140,000 square foot vertically-integrated manufacturing facility and employs over 200 people.\nThe Companys e-commerce websites include: liberator.com, jaxxbeanbags.com, and avanacomfort.com.\nUnless the context requires otherwise, all references in this report to the Company, Luvu Brands, we, our, and us refers to Luvu Brands, Inc. and its subsidiaries.\nOur executive offices are located at 2745 Bankers Industrial Dr., Atlanta, GA 30360; our telephone number is +1-770-246-6400.\nOur corporate website is www.LuvuBrands.com. There we make available copies of Luvu Brands documents, news releases and our filings with the U.S. Securities and Exchange Commission, the SEC, including financial statements.\nUnless specifically set forth to the contrary, the information that appears on our websites or our various social media platforms is not part of this annual report.\nCorporate History\nThe Company was incorporated in the State of Florida on February 25, 1999, under the name of WES Consulting, Inc. On October 19, 2009, the Company entered into a Merger and Recapitalization Agreement (the Merger Agreement) with Liberator, Inc., a Nevada corporation (Old Liberator). Pursuant to the Merger Agreement, Old Liberator merged with and into the Company, with the Company surviving as the sole remaining entity (the Merger). On February 28, 2011, the Company name was changed from WES Consulting, Inc. to Liberator, Inc. Effective November 5, 2015, the Company changed its corporate name from Liberator, Inc. to Luvu Brands, Inc. to reflect its broader offering of wellness and lifestyle products designed for mass market channels.\nOverview of our Facilities and Operations\nSince inception we have used a vertically integrated business model, with manufacturing, distribution, product development, advertising and marketing performed in-house. We believe this allows us to create new products with reduced lead times at a lower cost while enabling us to quickly respond to market and customer demands for our existing products.\nFor our wholesale accounts and international distributors, being able to fulfill large orders with shorter turnaround times allows us to capture business during December and February when wholesale customers make just-in-time holiday purchases.\nOur 140,000 square foot facility on eight acres is located in a suburb of metro Atlanta, Georgia and includes manufacturing and distribution, sales and marketing, product development, customer service and administrative staff. All of the Liberator, Jaxx and Avana branded products are designed, produced and marketed from our facility in Atlanta, Georgia where we currently employ 216 people.\nOur Atlanta-based manufacturing operation has two CAD controlled fabric cutters, one CAD controlled wood cutter, two CAD controlled foam contouring machines and three state-of-the-art conveyor unit production sewing systems.\nOur sewing equipment is also highly automated with conveyor-based lines leading into vacuum and roll compression packaging of finished products. We believe that our in-house manufacturing capabilities have enabled us to achieve greater efficiencies and cost savings, as well as strict control over the entire manufacturing cycle including raw material procurement, finished goods production and logistics optimization. In addition to providing us with greater production flexibility, our in-house manufacturing provides us with the opportunity to improve fulfillment response time, reduces the risk of out-of-stock situations, limits finished goods obsolescence and improves overall operating margins.\nBecause fabric cutting, sewing, foam contouring, assembly and vacuum packaging are performed in-house, we believe we can exercise greater control over product quality and respond faster to changing customer demands, which gives us a competitive advantage over companies that utilize only out-sourced sewing services. In addition to our in-house sewing capabilities, we outsource the sewing of certain high-volume products to a contract sewing facility in Mexico which, during fiscal 2022, produced approximately 35% of our sewn product requirements.\nWe source raw materials from multiple domestic and foreign suppliers and we have supply contracts in place to produce our specialty fabrics under specific quality control and performance standards with just-in-time deliveries. We also repurpose over 4,000 pounds of polyurethane foam trim each day, primarily for Jaxx bean bags, which gives us a cost and quality competitive advantage.\nDuring fiscal 2021, we installed a second, larger roll pack and compression machine used for the majority of our foam-based products, and a second foam contouring machine. In July 2022, we also acquired and installed an additional automated sewing conveyor system for increased capacity and flexibility. These actions resulted in increased throughput and lower production costs in these operations, which have been partially offset by increased raw material costs and wages.\nAll business activity of the Company is done through our wholly-owned subsidiary, OneUp Innovations, Inc. (OneUp). OneUp was organized in 2000 and began operations in 2002.\nBusiness Strategy\nOur goals are to achieve long-term growth and profitability by expanding our distribution channels and customer base for Liberator, Jaxx and Avana. We create ongoing collections of innovative products that have both good design and price to value that ship flat-packed and vacuum compressed. By running our own websites and aligning ourselves with both mass market and specialty retailers, we leave less room for importers and copy-cats to compete. We believe that marketing directly to the customer is the best way to build brands, and by doing so we create value for our customers and wealth for our shareholders.\n·\nManufacturing. To improve our business results, we constantly look for ways to manage the impact of rising raw material and labor costs by improving the productivity of our Lean manufacturing processes. As demand for certain high-volume products continues to increase, we plan to shift more of the sewing of those products to a contract facility in Mexico.\n·\nSustainability. We believe that sustainable operations are both financially and operationally beneficial to our business, and critical to our future success. We are acutely focused on waste reduction efforts: repurposing 98% of our foam trim to other products, compressing all of our foam products to reduce freight costs and corrugated use, improving manufacturing processes to reduce waste overall, finding new ways to repurpose certain waste streams and establishing local recycling partnerships to divert waste from landfills.\n·\nEco-Packaging. We maintain vacuum compressed packaging to reduce our carbon footprint, make our products more convenient for the consumer and easier to display for the retailer, and reduce our outbound shipping costs. In fiscal 2018 and 2019, the new roll pack compression equipment expanded the number of products offered in smaller boxes. With the addition of the larger roll pack compression machine that we installed during fiscal 2021, we can now more efficiently compress our larger foam products.\n·\nWholesale Operations. Our goal is to increase consumer demand through advertising and public relations while our wholesale operations expand our offering to distributors, retailers and e-tailers across every channel of adult, mass market, drug and specialty accounts. For wholesalers thinking about adding Sexual Wellness products to their retail or online store, our Liberator product line is typically one of the first safer products presented, as it can be promoted as an assistive aid to sexual positioning. As the mainstream demand for Sexual Wellness products grows, our sales staff is training and educating new resellers on how to get started in this category. For retail display, we offer mainstream packaging in a variety of sizes and price points to meet their customers particular demographic. We offer all our brands for sale through various e-tailers, and for these customers we maintain brand continuity by providing rich product content, photography and instructional videos for use on their websites. We also provide fulfillment services and can drop-ship orders directly to their customer, frequently the same day the order is received.\nProducts, Principal Markets and Methods of Distribution\nLiberator Products\nWe developed a patented brand category which we call Liberator Bedroom Adventure Gear®. The products in this collection are designed to elevate, create motion and create surfaces and textures that expand the sexual repertoire and make the act of love more exciting. Liberator Bedroom Adventure Gear combines functional design with sensuous textures that transform ordinary bedrooms into supportive landscapes for intimacy. Liberator products present angles, elevations, curves and motion that help people of all sizes, including those with back injuries and other medical conditions, find comfortable ways to connect intimately while assisting their stamina and performance.\nLiberator foam-based products (called Liberator Shapes) are manufactured in a variety of heights and widths to accommodate variations in the human body. They consist of differently shaped cushions and props that are available in an assortment of fabric colors to add to the visual excitement. Each of the product profiles of the Liberator Shapes is unique, designed to introduce positions to the sexual experience that were previously difficult to achieve or impossible to achieve with standard pillows or cushions. Liberator Shapes are manufactured from structured polyurethane foam, cut at various angles, platforms and profiles. The foam base is encased in a tight, fluid resistant polyester shell, helping the cushions to maintain their shape. Liberator Shapes that are designed to be used in tandem are covered in a proprietary microfiber cover that allow the Shapes to adhere to each-other without slipping loose. This allows for positioning freedom.\nWe have also developed vacuum compressed large profile designs that are commonly referred to as Love Loungers or Tantric / Yoga Chaises. Most of the sex furniture pieces are made from contoured polyurethane foam and covered in a variety of fabrics and colors. These items are marketed as the Esse® Chaise, Equus Wave® and Prelude® Bench all in a variety of sizes. Larger designs include products based on shredded polyurethane foam trim encased in a wide range of fabric types and colors and sold under our Zeppelin ® product offering. The Liberator larger profile designs can also be used as lounge seating when not being used for relaxed interaction and creative intimacy. Newer styles are now flat packed with wooden bases and maple feet.\nWe conduct our wholesale business for Liberator sexual wellness products through four primary channels: (1) adult and female friendly retailers and specialty boutiques, (2) e-tailers who sell our products through adult, mass market, drug and other sites offering sexual wellness products, (3) mail order catalogers, and (4) wholesale distributors of adult / sexual wellness products. These wholesale accounts have approximately 1,000 retail locations and/or websites in the United States and Canada. We have a growing number of retailers who have added a dedicated Liberator exhibition concept to their merchandising space. We also sell our products in Europe through a Germany based exclusive distributor.\nAll products sold under the Liberator brand provided 45% and 42% of our revenues in each of our fiscal years ended June 30, 2022 and 2021, respectively.\nProducts Purchased for Resale\nWe import high-quality pleasure objects from around the world. These resale products provided 6% and 8% of our revenues in each of our fiscal years ended June 30, 2022 and 2021 respectively.\nJaxx Casual Seating\nThe Company manufactures a line of contemporary casual indoor and outdoor seating under the Jaxx® brand. Jaxx bean bags are an offshoot from Liberator manufacturing as it provides additional revenue from repurposing our polyurethane foam trim into shredded bean bag fill.\nThe Jaxx indoor beanbag collection includes an offering of adult and children size beanbags in a variety of fabrics, faux-furs and vinyl. The Jaxx product line also includes solid foam indoor furniture collections and outdoor furniture collections that use polystyrene bead filling. The Jaxx product line and accessory products are sold through the following wholesale channels: (1) modern furniture e-tailers, (2) mass marketers, (3) mail order catalogers, (4) interior designers, (5) schools and daycare centers, and (6) retail furniture stores. We also offer Jaxx private label and custom designs for large regional and national furniture chains. The Company also owns and manages a website under the URLs www.JaxxBeanBags.com and www.JaxxLiving.com for direct to consumer sales of Jaxx products. Jaxx products provided 32% and 29% of our revenues in each of our fiscal years ended June 30, 2022 and 2021, respectively.\nThe contemporary seating business is highly competitive. We believe we compete effectively on the basis of product quality, good design, customer service, and good price to value. We believe that our primary competitive advantages are consumer recognition of the Jaxx brand, as well as distribution through the multiple sales channels where consumers prefer to purchase.\nAvana® Top-of-Bed Comfort Products\nThe Company sells a unique collection of comfort products that aid in sleep, meditation, and relaxation under the Avana® brand. These products include a diverse offering of top-of-bed support cushions and props, many of which are assistive in relieving medical conditions associated with acid reflux, surgery recovery, and chronic pain.\nThe Avana product line is sold through e-merchants (including Amazon.com, Walmart.com, medical product distributors and specialty e-tailers), mail order catalogers and through our website under the URL www.AvanaComfort.com. We believe that our Avana products compete effectively on the basis of good design, through offering a wide-range of designer colors and fabrics and supported by thousands of 5-star product reviews.\nTotal Avana products provided 11% and 16% of our revenues in our fiscal years ended June 30, 2022 and 2021, respectively.\nSales and Distribution\nOur sales management team is organized by market channel and by customer type. We have sales personnel who routinely visit sexual wellness retailers to assist in product training, merchandising and stocking of selling areas. Through our in-house wholesale sales organization, we engage e-merchants and retailers directly and then either ship to them on a wholesale basis or provide fulfillment services by drop-shipping directly to their customers. In international markets, the Company has a direct sales model with a US-based salesperson. This salesperson is responsible for wholesale sales, marketing operations and customer service in Canada and the European Union and other international markets. For European customers, orders are filled from our exclusive Germany-based distributor or directly from our facilities in Atlanta. Total international sales represented approximately 4% of our total net sales in each year ended June 30, 2022 and 2021.\nAs is customary in the sexual wellness and casual furniture industry, sales to customers are generally made pursuant to purchase orders, and we do not have long-term or exclusive contracts with any of our retail customers or wholesale distributors. We believe that our continuing relationships with our customers are based upon our ability to provide a wide selection and reliable source of sexual wellness and casual furniture products, combined with our expertise in marketing and new product introduction.\nInternet Websites\nWe design and operate our websites using in-house development teams and our creative group using all media and social platforms to promote visibility and sales conversions. We also maintain a B-to-B website allowing wholesalers to both place orders and track delivery schedules.\nLiberator.com is promoted as a direct B-to-C website, and entertainment and educational venue, where consumers can watch product demonstration videos, peruse e-zine blog content on sexual wellness topics, and watch non-pornographic videos on the many facets of human sexuality and erotic expression.\nJaxxbeanbags.com offers a collection of contemporary indoor and outdoor fashion seating, daybeds, childrens play couches and modular Panelist wall mounted headboards.\nAvanaComfort.com presents our collection of top-of-bed comfort products, specialty pillows and mattress elevators proven effective in controlling reflux and GERD symptoms during sleep.\nSources and Availability of Raw Materials\nWe obtain all of the raw materials and component parts used to produce our products from outside sources. A number of components, including certain fabrics and polyurethane foam are sourced from suppliers who currently serve as our sole or primary source of supply. We believe we can obtain these raw materials and components from other sources of supply, although we could experience some short-term disruption in our ability to fulfill orders in the event of an unexpected loss of supply from one of the primary suppliers. We utilize dual sourcing on most fabrics and components when effective.\nChanges in U.S. trade policy, including tariffs on certain goods imported into the United States from China, have increased the costs of certain raw materials, parts or components used in our products. Such an increase may materially and adversely affect our sales and our business, as we may increase the selling prices of our products. If any increase in costs of goods cannot be passed on to our customers, our business and gross profit may be materially and adversely affected.\nMajor Customers\nOur ten largest customers (excluding our own e-commerce sites) accounted for approximately 52% of net sales for the year ended June 30, 2022 and 51% of net sales for the year ended June 30, 2021. Sales to (and through) Amazon accounted for 31% of our net sales during the year ended June 30, 2022 and 29% of our sales for the year ended June 30, 2021. The loss of, or a significant adverse change in our relationship with, any of our largest customers could have a material adverse effect on our business, prospects, results of operations, financial condition or cash flows.\nCompetition\nWe compete with other marketers of sexual wellness, lifestyle and casual seating products both within and outside the U.S. The sexual wellness, bean bag and comfort products are highly fragmented and competition for the sale of such products comes from many types of e-tailers and retailers across diverse channels.\nFor Liberator products, we believe that our primary competitive advantage is consumer recognition of our iconic brand. Due to the strength of our brand, we have no direct competition for the majority of our Liberator branded products. In fact, many e-commerce websites refer to Liberator as a product category and not as a generic sex furniture listing. And since we sell through multiple sales channels, we provide consumers with the ability to shop for Liberator intimacy products in an environment or website that they are most comfortable in. We also believe that we differentiate ourselves from conventional sexual wellness products based on our utility of design and overall customer satisfaction as it relates to enhanced intimacy.\nFor Jaxx and Avana products, we believe our primary competitive advantage is good designs, our offering of a wide range of designer colors and fabrics, good price to value, and our positive consumer reviews.\nFor our pleasure products purchased for Resale, competition among retailers of adult products and web-based marketers is high. Although we compete with retail and internet businesses and now mass and drug retailers that sell sexual wellness products including vibrators, pleasure objects, accessories and similar merchandise, we believe that this opens new channels of distribution for our Liberator products and that we are able to compete favorably as our Liberator products are unique, are couple-centric, and are assistive devices for couples with sexual limitations and issues.\nFor the Liberator e-commerce website, other competitive factors include the effectiveness of our electronic customer mailing lists, maintaining natural search listing, advertising response rates, website design and functionality. The broad range of designs, color choice, fabrics and accessories that we offer helps to differentiate us and allows us to compete favorably against many other adult or sexual wellness websites. Liberator.com also competes against numerous mainstream websites, many of which have a greater volume of web traffic, greater financial strength and marketing resources.\nWe believe competition in our industries is based on, among other things, the ability to deliver the right product at the right time, product quality and safety, innovation, customer service and price. We believe we compete favorably with other companies because of our ability to provide a broad product offering for customers, our vertically integrated manufacturing operation which allows us to quickly respond to customer demand, our commitment to quality and safety, and our commitment to minimizing our environmental impact.\nOur future competitive position will likely depend on, but not be limited to, the following:\n·\nthe continued acceptance of our products by our customers and consumers;\n·\nour ability to protect our proprietary rights in our patent and trademarks and the continued validity of such intellectual property;\n·\nour ability to successfully expand our product offerings;\n·\nour ability to maintain adequate inventory levels to meet our customers demands;\n·\nour ability to expand operations;\n·\nour ability to continue to manufacture high quality products at competitive prices;\n·\nour ability to attract and retain qualified personnel;\n·\nthe effect of any future governmental regulations on our products and business;\n·\nthe continued growth of the global sexual wellness industry; and\n·\nour ability to respond to changes within the industry and consumer demand, financially and otherwise.\nGovernment Regulation\nWe are subject to customs, truth-in-advertising and other laws, including consumer protection regulations that regulate the promotion and sale of merchandise and the operation of warehouse facilities. We monitor changes in these laws and believe that we are in material compliance with applicable laws.\nIntellectual Property\nThe Liberator trademark is registered with the United States Patent and Trademark office and with the registries of many foreign countries. In addition, we were issued approximately 20 other product name trademarks and trade names including: Bedroom Adventure Gear®, Ramp®, Wedge®, Stage®, Esse®, Zeppelin®, Hipster®, Wing®, Equus®, Jaxx®, Avana®, and Bonbon®. In August 2005, we were issued utility patent number US 6,925,669 Support Cushion and System of Cushions. We believe our trademarks and patent have significant value and we intend to continue to vigorously protect them against infringement.\nHuman Capital and Resources\nAs of June 30, 2022, we had 201 employees (163 people in Production and Distribution, and 38 in sales, marketing and administrative operations). As of the date of this report, the Company employs 175 people in Production and Distribution, 2 people in Product Development, 17 people in Sales and Marketing, and 22 people in Administration. The Companys employment levels may change seasonally based on current and anticipated order levels. At present, approximately 25 people are employed at a subcontractor in Mexico. Additional staffing is typically required to support the peak holiday period through Valentines Day. None of our employees are represented by a union. We have had no labor-related work stoppages, and we believe our relationships with our employees are good.\nSeasonality\nPrior to COVID-19 pandemic our business was seasonal. With the divarication of our product line, we no longer have large seasonal fluctuations.\nAdditional information\nWe file annual and quarterly reports on Forms 10-K and 10-Q, current reports on Form 8-K and other information with the Securities and Exchange Commission (SEC or the Commission). The Commission also maintains an Internet site at http://www.sec.gov that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the Commission.\nOther information about the Company can be found on our website www.luvubrands.com. Reference in this document to that website address does not constitute incorporation by reference of the information contained on the website. ITEM 1A. Risk Factors.\nNot applicable to a smaller reporting company. ITEM 1B. Unresolved Staff Comments.\nNone. ITEM 2. Properties.\nWe are headquartered in Atlanta, Georgia. Our mailing address is 2745 Bankers Industrial Drive, Atlanta, GA 30360. We lease a 140,000 square feet building on eight acres, which we believe allows for expansion when needed. Our facility houses manufacturing, distribution and fulfillment, call center, in-house advertising and creative departments, product design group, and administrative offices. On November 2, 2020, the Company entered into an agreement with its landlord on a new lease for the current facilities for six years and two months, beginning January 1, 2021. The new lease includes two months of rent abatement totaling $103,230. Under the new lease, the monthly rent on the facility is $51,615 with annual escalations of 3% with the final two months of rent at $61,605. In addition, the Company will pay the landlord a 2% property management fee. The rent expense under this lease (and the prior lease) for the 12 months ended June 30, 2022 was $652,752. The rent expense under this lease and the prior lease) for the 12 months ended June 30, 2021 was $501,480.\nOur facilities are currently adequate for their intended purposes and are adequately maintained. ITEM 3. Legal Proceedings.\nAs of the date of this annual report, there are no material pending legal or governmental proceedings relating to our company or properties to which we are a party, and to our knowledge there are no material proceedings to which any of our directors, executive officers or affiliates are a party adverse to us or which have a material interest adverse to us. ITEM 4. Mine Safety Disclosures.\nNone.\nPART II. ITEM 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur common stock is quoted on the OTC Markets Group on the OTCQB tier (OTCQB) under the symbol LUVU. On September 30, 2022, the last reported sale price of our common stock on the OTCQB was $0.09. Any over the counter market quotation reflects inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nStockholders\nAs of September 27, 2022, we had 81 stockholders of record of our common stock. This amount does not reflect persons or entities that hold our securities in nominee or street name through various brokerage firms.\nDividend Policy\nWe have not paid dividends and we plan to retain all earnings generated by our operations, if any, for use in our business. We do not anticipate paying any cash dividends to our shareholders in the foreseeable future. The payment of future dividends on the common stock and the rate of such dividends, if any, and when not restricted, will be determined by our board of directors in light of our earnings, financial condition, capital requirements, and other factors. Additionally, under the terms of our credit facility, we are precluded from paying a dividend and we may in the future issue preferred stock and/or other securities that provides for preferences over holders of common stock in the payment of dividends.\nRecent Sales of Unregistered Securities\nNone.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone. ITEM 6. Selected Financial Data.\nNot applicable to smaller reporting company. ITEM 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThis discussion summarizes the significant factors affecting the results of operations and financial condition of the Company during the fiscal years ended June 30, 2022 and 2021 and should be read in conjunction with our financial statements and accompanying notes thereto included elsewhere herein. Certain information contained in this Managements Discussion and Analysis of Financial Condition and Results of Operations are forward-looking statements. Statements that are not historical in nature and which may be identified by the use of words like expects, assumes, projects, anticipates, estimates, we believe, could be and other words of similar meaning, are forward-looking statements. These statements are based on managements expectations and assumptions and are subject to risks and uncertainties that may cause actual results to differ materially from those expressed. Our actual results may differ materially from the results discussed in this section because of various factors, including those set forth elsewhere herein. See Forward-Looking Statements included in this report.\nResults of Operations\nOverview\nThe following table sets forth, for the periods indicated, information derived from our Consolidated Financial Statements, expressed as a percentage of net sales. The discussion that follows the table should be read in conjunction with our Consolidated Financial Statements.\nYear Ended\nJune 30, 2022\nYear Ended\nJune 30, 2021\nNet sales\n100 %\n100 %\nCost of goods sold\n77 %\n73 %\nGross profit\n23 %\n27 %\nSelling, General and Administrative Expenses\n19 %\n19 %\nOperating income\n4 %\n8 %\nFiscal Year ended June 30, 2022 Compared to the Fiscal Year Ended June 30, 2021\nNet sales. The net sales increase of 14% in fiscal 2022 from fiscal 2021 consists of a 22% increase in sales of Liberator products, a 22% increase in Jaxx products, offset, in part, by a 21% decrease in sales of Avana products and 9% decrease in products purchased for resale. Sales of Liberator products increased 22% from the prior year to approximately $12.0 million during fiscal 2022, and sales of Jaxx products increased 22% during fiscal 2022 to approximately $8.3 million. Sales of Avana products decreased 21% to $2.9 million during fiscal 2022. Sales of all products through the Wholesale sales channel in fiscal 2022 increased 19% from the prior year while the Direct sales channel increased approximately 3% from the prior year. The Wholesale sales channel includes branded products and resale products sold to brick-and-mortar retailers and e-merchants including, but not limited to, Amazon, Overstock and Wayfair. The Wholesale sales channel also includes contract manufacturing services which consists of specialty items that are manufactured in small quantities for certain customers, and which, to date, has not been a material part of our business. The Direct sales channel consists of consumer sales through our three websites. The increase in sales through the Direct channel was due to higher sales of products sold through our websites.\nGross profit. Gross profit, derived from net sales less the cost of product sales, includes the cost of materials, direct labor, manufacturing overhead and depreciation. Total gross profit as a percentage of sales for the year ended June 30, 2022 decreased to 23% from 27% in the prior year, primarily due to higher labor and raw material costs. Gross profit dollars decreased to $6,001,000 from $6,301,000 in the prior year and represented a 5% decrease. Price increases that were implemented during the second half of fiscal 2022 partially offset the labor and material cost increases; further selling price increases are being implemented. The Company also continued transitioning the sewing of certain high-volume Jaxx and Avana products to a contract facility in Mexico which, during fiscal 2022, produced approximately 35% of our sewn products and reduced our total cost of production for those products.\nOperating expenses. Excluding depreciation expense, total operating expenses for the year ended June 30, 2022 were 18% of net sales, or $4,749,000, compared to 18% of net sales, or $4,239,000, for the year ended June 30, 2021. The 12% increase in operating expenses from the prior year was primarily due to higher advertising and promotion expenses which were incurred in an effort to increase sales, higher occupancy costs, and higher personnel related costs.\nOther income (expense). Other income (expense) decreased to an expense of ($342,000) from income of $721,000 in the prior fiscal year, primarily due to the 2021 PPP Note forgiveness by the U.S. Small Business Administration of approximately $1,096,000.\nNet income. We had a net income from operations of $604,000, or $0.01 per diluted share, for the year ended June 30, 2022 compared with net income from operations of $2,563,000 or $0.03 per diluted share, for the year ended June 30, 2021.\nFinancial Information about Our Business Sales Channels\nWe conduct our business through two primary sales channels: Direct (consisting of our Internet websites) and Wholesale (consisting of our stocking reseller, drop-ship, contract manufacturing and distributor accounts). During our last two years, substantially all of our revenue was generated within North America, and all of our long-lived assets are located within the United States. The following is a summary of our revenues:\n(Dollars in thousands)\nFiscal\nFiscal\nDirect\n$ 7,136\n$ 6,919\nWholesale\n18,546\n15,618\nOther\nTotal Net Sales\n$ 26,343\n$ 23,105\nNet sales in the Other channel consists primarily of shipping and handling fees derived from our Direct business.\nDirect\nThe following is a summary of our Direct business net sales and the percentage relationship to total revenues:\n(Dollars in thousands)\nFiscal\nFiscal\nDirect sales channel net sales\n$ 7,136\n$ 6,919\nDirect net sales as a percentage of total revenues\n27 %\n30 %\nWholesale\nThe following is a summary of our net sales to Wholesale customers and the percentage relationship to total revenues:\n(Dollars in thousands)\nFiscal\nFiscal\nWholesale sales channel net sales\n$ 18,546\n$ 15,618\nWholesale net sales as a percentage of total revenues\n70 %\n68 %\nAs of June 30, 2022, the Company has over 950 active wholesale accounts, most of which are located in the United States.\nSales by Product Type\nThe following table represents the dollars and percentage of net sales by product type:\n(Dollars in thousands)\nYear Ended\nJune 30, 2022\nYear Ended\nJune 30, 2021\nNet sales:\nLiberator\n$ 11,978\n45 %\n$ 9,806\n42 %\nJaxx\n8,293\n32 %\n6,794\n29 %\nAvana\n2,893\n11 %\n3,655\n16 %\nProducts purchased for resale\n1,615\n6 %\n1,771\n8 %\nOther\n1,564\n6 %\n1,079\n5 %\nTotal Net Sales\n$ 26,343\n100 %\n$ 23,105\n100 %\nLiberator - Liberator products consist of items that are manufactured by us and are intended for sale in the sexual health and wellness market. Liberator products are sold to e-merchants, retailers and distributors as well as directly through our e-commerce site. Net sales of Liberator products increased 22% during the year ended June 30, 2022, from the comparable year earlier period. This increase is primarily related to higher sales through our e-commerce site, Liberator.com.\nJaxx - Jaxx products are contemporary seating products manufactured by us and sold under the Jaxx brand. Jaxx products are sold to e-merchants and retailers as well as directly through our e-commerce site. Net sales of Jaxx products increased 22% during the year ended June 30, 2022, compared to the prior year. This increase is primarily due to greater sales of Jaxx indoor and outdoor products to (and through) Amazon and other e-merchants including Wayfair and Overstock and our own e-commerce site, JaxxBeanbags.com.\nAvana - The Avana product line is a unique collection of top-of-bed and comfort products that aid in sleep, meditation, and relaxation. Avana products are sold through e-merchants, mail order catalogers and through our e-commerce site. Net sales of Avana products decreased 21% during the year ended June 30, 2022, compared to the prior year. The decrease in sales was due primarily to increased competition from lower priced products from China and other countries.\nProducts purchased for resale - Products purchased for resale are other branded products that we purchase from others at wholesale or distributor prices and resell through our sales channels to e-merchants, retailers, or through one of our e-commerce sites. Sales of these products decreased 9% during the year ended June 30, 2022 from the prior year, due to consumer demand shrinkage across the industry. Sales of these products is increasingly competitive and, as a result, the Company has elected to only offer a more curated selection of products that typically have a higher gross profit.\nOther - Other products include sales from contract manufacturing and fulfillment services. Net sales during the year ended June 30, 2022 increased 45% from the prior year.\nVariability of Results\nWe have experienced significant quarterly fluctuations in operating results and anticipate that these fluctuations may continue in future periods. Operating results have fluctuated as a result of changes in sales levels to consumers and wholesalers, competition, the COVID-19 pandemic aftereffects, seasonality costs associated with new product introductions, and increases in raw material costs. In addition, future operating results may fluctuate as a result of factors beyond our control such as raw material cost increases, labor cost increases resulting from the current labor shortage, foreign exchange fluctuation, changes in government regulations, and economic changes in the regions in which we operate and sell. A portion of our operating expenses are relatively fixed and the timing of increases in expense levels is based in large part on forecasts of future sales. Therefore, if net sales are below expectations in any given period, the adverse impact on results of operations may be magnified by our inability to meaningfully adjust spending in certain areas, or the inability to adjust spending quickly enough, as in personnel and administrative costs, to compensate for a sales shortfall. We may also choose to increase spending in response to market conditions, and these decisions may have a material adverse effect on financial condition and results of operations.\nLiquidity and Capital Resources\nThe following table summarizes our cash flows:\nYear ended\nJune 30,\n(in thousands)\nCash flow data from continuing operations:\nCash provided by operating activities\n$ 387\n$ 540\nCash used in investing activities\n$ (52 )\n$ (210 )\nCash used in financing activities\n$ (453 )\n$ (505 )\nAs of June 30, 2022, our cash and cash equivalents totaled $858,870 compared to $976,794 in cash and cash equivalents as of June 30, 2021.\nOperating Activities\nNet cash provided by operating activities primarily consists of the net income adjusted for certain non-cash items, including depreciation, stock-based compensation, PPP loan forgiveness (2021), and the effect of changes in operating assets and liabilities. Net cash provided by operating activities decreased from the prior year due to the net income from operations, offset, in part, by a decrease in inventory.\nInvesting Activities\nCash used in investing activities in the year ended June 30, 2022 was primarily for production equipment purchases, software development work, purchase of computer equipment and in the year ended June 30, 2021 was primarily for software development work, purchase of production equipment, and computer equipment.\nFinancing Activities\nCash used in financing activities in the year ended June 30, 2022 was primarily due to repayment of secured and unsecured notes payable and equipment notes payable offset in part by borrowings through unsecured notes payable.\nCash provided by financing activities in the year ended June 30, 2021 was primarily due to repayment of secured and unsecured notes payable and equipment notes payable offset in part by borrowings through secured and unsecured notes payable.\nInflation\nDuring fiscal 2021 and 2022, we experienced increases in various raw material costs and increases in labor costs. We believe these pricing pressures have not stabilized and will continue to increase throughout fiscal 2023, although there is no assurance this will occur. Inflation can harm our margins and profitability if we are unable to increase prices or improve productivity enough to offset the effects of inflation in our cost base. Furthermore, if our customers reduce their levels of spending in response to increases in retail prices and/or we are unable to pass such cost increases to our customers, our revenues and our profit margins may decrease.\nCapital Resources\nWe expect total capital expenditures for fiscal 2023 to be less than $150,000 and to be funded by equipment loans and, to a lesser extent, anticipated operating cash flows and borrowings under the line of credit with Advance Financial Corporation. This includes capital expenditures in support of our normal operations.\nIf our business plans and cost estimates are inaccurate and our operations require additional cash or if we deviate from our current plans, we could be required to seek additional debt financing for particular projects or for ongoing operational needs. This indebtedness could harm our business if we are unable to obtain additional financing on reasonable terms. In addition, any indebtedness we incur in the future could subject us to restrictive covenants limiting our flexibility in planning for, or reacting to changes in, our business. If we do not comply with such covenants, our lenders could accelerate repayment of our debt or restrict our access to further borrowings, which in turn could restrict our operating flexibility and endanger our ability to continue operations.\nOff-Balance Sheet Arrangements\nWe do not use off-balance sheet arrangements with unconsolidated entities or related parties, nor do we use other forms of off-balance sheet arrangements. Accordingly, our liquidity and capital resources are not subject to off-balance sheet risks from unconsolidated entities. As of June 30, 2022, we did not have any off-balance sheet arrangements, as defined in Item 303(a)(4)(ii) of SEC Regulation S-K.\nEffect of Recently Issued Accounting Standards and Estimates\nWe do not believe that any recently issued, but not yet effective, accounting standards, if currently adopted, will have a material effect on our consolidated financial position, results of operations, or cash flows.\nApplication of Critical Accounting Policies and Estimates\nOur consolidated financial statements included under Item 8 in this report have been prepared in accordance with GAAP. Our significant accounting policies are described in the notes to our consolidated financial statements. The preparation of financial statements in accordance with GAAP requires that we make estimates and assumptions that affect the amounts reported in our financial statements and their accompanying notes. We have identified certain policies that we believe are important to the portrayal of our financial condition and results of operations. These policies require the application of significant judgment by our management. We base our estimates on our historical experience, industry standards, and various other assumptions that we believe are reasonable under the circumstances. Actual results could differ from these estimates under different assumptions or conditions. An adverse effect on our financial condition, changes in financial condition, and results of operations could occur if circumstances change that alter the various assumptions or conditions used in such estimates or assumptions. Our critical accounting policies include those listed below.\nRevenue Recognition\nWe record revenue based on the five-step model which includes: (1) identifying the contract with the customer; (2) identifying the performance obligations in the contract; (3) determining the transaction price; (4) allocating the transaction price to the performance obligations; and (5) recognizing revenue when the performance obligations are satisfied. Substantially all of our revenue is generated by fulfilling orders for the purchase of manufactured products and product purchased for resale to retailers, wholesalers, or direct to consumers via online channels, with each order considered to be a distinct performance obligation. These orders may be formal purchase orders, verbal phone orders, e-mail orders or orders received online. Shipping and handling activities for which we are responsible under the terms and conditions of the order are not accounted for as performance obligations but as fulfillment costs. These activities are required to fulfill our promise to transfer the goods and are expensed when revenue is recognized. The impact of this policy election is insignificant as it aligns with our current practice.\nRevenue is measured as the net amount of consideration expected to be received in exchange for fulfilling a performance obligation. We have elected to exclude sales, use and similar taxes from the measurement of the transaction price. The impact of this policy election is insignificant, as it aligns with our current practice. The amount of consideration expected to be received and revenue recognized includes estimates of variable consideration, which includes costs for trade promotion programs, coupons, returns, and early payment discounts. Such estimates are calculated using historical averages adjusted for any expected changes due to current business conditions and experience. We review and update these estimates at the end of each reporting period and the impact of any adjustments are recognized in the period the adjustments are identified. In assessing whether collection of consideration from a customer is probable, we consider the customer's ability and intent to pay that amount of consideration when it is due. Payment of invoices is due as specified in the underlying customer agreement, typically 30 days from the invoice date, which occurs on the date of transfer of control of the products to the customer. Revenue is recognized at the point in time that control of the ordered products is transferred to the customer. Generally, this occurs when the product is delivered, or in some cases, picked up from one of our distribution centers by the customer.\nAllowance for Doubtful Accounts\nWe maintain an allowance for doubtful accounts to reflect our estimate of current and past due receivable balances that may not be collected. The allowance for doubtful accounts is based upon our assessment of the collectability of specific customer accounts, the aging of accounts receivable and our history of bad debts. We believe that the allowance for doubtful accounts is adequate to cover anticipated losses in the receivable balance under current conditions. However, significant deterioration in the financial condition of our customers, resulting in an impairment of their ability to make payments, could materially change these expectations and an additional allowance may be required.\nInventories\nWe value inventory at the lower of cost or net realizable value on an item-by-item basis and establish reserves equal to all or a portion of the related inventory to reflect situations in which the cost of the inventory is not expected to be recovered. This requires us to make estimates regarding the net realizable value of our inventory, including an assessment for excess and obsolete inventory. Once we establish an inventory reserve amount in a fiscal period, the reduced inventory value is maintained until the inventory is sold or otherwise disposed of. In evaluating whether inventory is stated at the lower of cost or net realizable value, management considers such factors as the amount of inventory on-hand, the estimated time required to sell such inventory, the foreseeable demand within a specified time horizon and current and expected market conditions. Based on this evaluation, we record adjustments to cost of goods sold to adjust inventory to its net realizable value. These adjustments are estimates, which could vary significantly, either favorably or unfavorably, from actual requirements if future economic conditions, customer demand or other factors differ from expectations. Finished goods and goods in process include a provision for manufacturing overhead, including depreciation.\nAccounting for Income Taxes\nWe utilize the asset and liability method of accounting for income taxes. We recognize deferred tax liabilities or assets for the expected future tax consequences of temporary differences between the book and tax basis of assets and liabilities. We regularly assess the likelihood that our deferred tax assets will be recovered from future taxable income. We consider projected future taxable income and ongoing tax planning strategies in assessing the amount of the valuation allowance necessary to offset our deferred tax assets that will not be recoverable. We have recorded and continue to carry a full valuation allowance against our gross deferred tax assets that will not reverse against deferred tax liabilities within the scheduled reversal period. If we determine in the future that it is more likely than not that we will realize all or a portion of our deferred tax assets, we will adjust our valuation allowance in the period we make the determination. We expect to provide a full valuation allowance on our future tax benefits until we can sustain a level of profitability that demonstrates our ability to realize these assets. At June 30, 2022, we carried a valuation allowance of $1.9 million against our net deferred tax assets.\nImpairment of Long-Lived Assets\nWe assess the impairment of long-lived assets whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. An asset or asset group is considered impaired if its carrying amount exceeds the undiscounted future net cash flows the asset or asset group is expected to generate. If an asset or asset group is considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the asset exceeds its fair value. If estimated fair value is less than the book value, the asset is written down to the estimated fair value and an impairment loss is recognized.\nIn fiscal year 2021 and 2022, we did generate positive cash flows from operations. However, if our long-term future results do not continue to yield positive cash flows in excess of the carrying amount of our long-lived assets, we would anticipate possible future impairments of those assets.\nConsiderable management judgment is necessary in estimating future cash flows and other factors affecting the valuation of long-lived assets, including the operating and macroeconomic factors that may affect them. We use historical financial information, internal plans and projections and industry information in making such estimates.\nNon-GAAP Financial Measures\nReconciliation of net income to Adjusted EBITDA for the years ended June 30, 2022 and 2021:\nYear ended June 30,\n(in thousands)\nNet income\n$ 604\n$ 2,563\nPlus interest expense and financing costs\nPlus depreciation and amortization expense\nPlus stock-based compensation expense\nAdjusted EBITDA\n$ 1,276\n$ 3,173\nAs used herein, Adjusted EBITDA represents net income before interest income, interest expense and financing costs, depreciation, and stock-based compensation expense. We have excluded the non-cash expenses and stock-based compensation expense as they do not reflect the cash-based operations of the Company. Adjusted EBITDA is a non-GAAP financial measure which is not required by or defined under GAAP. The presentation of this financial measure is not intended to be considered in isolation or as a substitute for the financial measures prepared and presented in accordance with GAAP, including the net income of the Company or net cash provided by operating activities.\nManagement recognizes that non-GAAP financial measures have limitations in that they do not reflect all of the items associated with the Companys net income as determined in accordance with GAAP, and are not a substitute for or a measure of the Companys profitability or net earnings. Adjusted EBITDA is presented because we believe it is useful to investors as a measure of comparative operating performance and liquidity, and because it is less susceptible to variances in actual performance resulting from depreciation and amortization and non-cash charges for stock-based compensation expense and loss on disposal of assets. ITEM 7A. Quantitative and Qualitative Disclosures about Market Risk.\nNot applicable for a smaller reporting company. ITEM 8. Financial Statements and Supplementary Data.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nConsolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm Auditor Firm ID (PCAOB Number 287)\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations for the years ended June 30, 2022 and 2021\nConsolidated Statements of Changes in Stockholders Equity (Deficit) for the years ended June 30, 2022 and June 30, 2021\nConsolidated Statements of Cash Flows for the years ended June 30, 2022 and 2021\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of\nLuvu Brands, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Luvu Brands, Inc. (the Company) as of June 30, 2022 and 2021, and the related consolidated statements of operations, stockholders equity and cash flows for each of the years in the two-year period ended June 30, 2022, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of inventory and inventory reserves\nAs described in Notes 2 and 4 to the financial statements, the Company has inventories, net totaled to approximately $3.82 million as of June 30, 2022. Inventories are stated at the lower of cost or net realizable value. Cost is determined using the first-in, first-out (FIFO) method. The Company establishes reserves for excess and obsolete inventory for each accounting period and records any potential adjustments needed for the reserves.\nAuditing managements estimates of the net realizable value of inventories, including inventory reserves was highly judgmental due to the degree of subjectivity involved in assessing the inventory reserves which are based on prevailing circumstances and judgment for consideration of current events, such as economic conditions, that may affect inventory.\nTo test the estimates for the net realizable value of inventories, including inventory reserves, we performed audit procedures that included, among others, evaluating the reasonableness of the inputs used in managements inventory reserve calculation and analyzing the reserve calculations to determine whether management identified any evidence of slow-moving inventory or any obsolescence due to existing and potential changes in marketability which may impact the reserves.\n/s/ Liggett & Webb, P.A.\nWe have served as the Companys auditor since 2012.\nBoynton Beach, Florida\nOctober 12, 2022\nLuvu Brands, Inc. and Subsidiaries\nConsolidated Balance Sheets\nAs of June 30, 2022 and 2021\nAssets:\n(in thousands, except share data)\nCurrent assets:\nCash and cash equivalents\n$ 859\n$ 977\nAccounts receivable, net of allowance for doubtful accounts and allowance for discounts and returns of $7 in 2022 and $55 in 2021\n1,107\n1,134\nInventories, net of allowance for inventory reserve of $176 in 2022 and $173 in 2021\n3,817\n3,391\nPrepaid expenses\nTotal current assets\n5,948\n5,647\nEquipment, property and leasehold improvements, net\n2,029\n1,934\nFinance lease assets\nOperating lease assets\n2,255\n2,554\nOther assets\nTotal assets\n$ 10,379\n$ 10,246\nLiabilities and stockholders equity (deficit):\nCurrent liabilities:\nAccounts payable\n$ 2,680\n$ 2,669\nCurrent debt\n1,618\n1,599\nOther accrued liabilities\nOperating lease liability\nTotal current liabilities\n5,174\n5,212\nNoncurrent liabilities:\nLong-term debt\n1,183\n1,288\nLong-term operating lease liability\n2,068\n2,423\nTotal noncurrent liabilities\n3,251\n3,711\nTotal liabilities\n8,425\n8,923\nCommitments and contingencies (See Note 15)\n-\n-\nStockholders equity (deficit):\nPreferred stock, 5,700,000 shares authorized, $0.0001 par value none issued and outstanding\n-\n-\nSeries A Convertible Preferred stock, 4,300,000 shares authorized $0.0001 par value, 4,300,000 shares issued and outstanding with a liquidation preference of $1,000 as of June 30, 2022 and 2021\n-\n-\nCommon stock, $0.01 par value, 175,000,000 shares authorized, 76,046,249 and 75,037,890 shares issued and outstanding as of June 30, 2022 and 2021, respectively\nAdditional paid-in capital\n6,183\n6,166\nAccumulated deficit\n(4,989 )\n(5,593 )\nTotal stockholders equity (deficit)\n1,954\n1,323\nTotal liabilities and stockholders equity (deficit)\n$ 10,379\n$ 10,246\nThe accompanying notes are an integral part of these consolidated financial statements.\nLuvu Brands, Inc. and Subsidiaries\nConsolidated Statements of Operations\nYears Ended June 30, 2022 and 2021\n(in thousands, except share data)\nNet Sales\n$ 26,343\n$ 23,105\nCost of goods sold\n20,342\n16,804\nGross profit\n6,001\n6,301\nOperating expenses:\nAdvertising and promotion\nOther selling and marketing\n1,189\n1,043\nGeneral and administrative\n2,986\n2,694\nDepreciation\nTotal operating expenses\n5,055\n4,459\nOperating income\n1,842\nOther income (expense):\nGain on forgiveness of PPP loan\n-\n1,096\nInterest expense and financing costs\n(342 )\n(375 )\nTotal other income (expense)\n(342 )\nIncome from operations before income taxes\n2,563\nProvision for income taxes\n-\n-\nNet income\n$ 604\n$ 2,563\nNet income per share:\nBasic\n$ 0.01\n$ 0.03\nDiluted\n$ 0.01\n$ 0.03\nShares used in calculation of net income per share:\nBasic\n75,456,306\n74,296,689\nDiluted\n76,110,815\n75,494,948\nThe accompanying notes are an integral part of these consolidated financial statements.\nLuvu Brands, Inc. and Subsidiaries\nConsolidated Statements of Changes in Stockholders Equity (Deficit)\nFor the years ended June 30, 2021 and June 30, 2022\nSeries A Preferred\nAdditional\nTotal\nStock\nCommon Stock\nPaid-in\nAccumulated\nStockholders\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nEquity (Deficit)\n(in thousands, except share data)\nBalance, June 30, 2020\n4,300,000\n$ -\n73,452,596\n$ 735\n$ 6,147\n$ (8,156 )\n$ (1,274 )\nStock-based compensation expense\n-\n-\n-\n-\n-\nStock option exercises\n-\n-\n1,585,294\n-\nNet income\n-\n-\n-\n-\n-\n2,563\n2,563\nbalance, June 30, 2021\n4,300,000\n-\n75,037,890\n6,166\n(5,593 )\n1,323\nStock-based compensation expense\n-\n-\n-\n-\n-\nStock option exercises\n-\n-\n1,008,359\n(7 )\n-\nNet income\n-\n-\n-\n-\n-\nbalance, June 30, 2022\n4,300,000\n$ -\n76,046,249\n$ 760\n$ 6,183\n$ (4,989 )\n$ 1,954\nThe accompanying notes are an integral part of these consolidated financial statements.\nLuvu Brands, Inc. and Subsidiaries\nConsolidated Statements of Cash Flows\nYears Ended June 30, 2022 and 2021\n(in thousands)\nOPERATING ACTIVITIES:\nNet income\n$ 604\n$ 2,563\nAdjustments to reconcile net income to net cash provided by operating activities:\nForgiveness of PPP Loan\n-\n(1,096 )\nDepreciation and amortization\nStock-based compensation expense\nProvision for bad debt\nProvision for inventory reserve\nAmortization of operating lease asset\nChange in operating assets and liabilities:\nAccounts receivable\nInventory\n(430 )\n(1,438 )\nPrepaid expenses and other assets\n(34 )\n(158 )\nAccounts payable\nAccrued expenses and interest\nOperating lease liability\n(274 )\n(209 )\nAccrued payroll and related\n(166 )\nNet cash provided by operating activities\nINVESTING ACTIVITIES:\nInvestment in equipment, software development and leasehold improvements\n(52 )\n(210 )\nNet cash used in investing activities\n(52 )\n(210 )\nFINANCING ACTIVITIES:\nBorrowing (repayment) under revolving line of credit\n(13 )\nRepayment of unsecured line of credit\n(12 )\n(11 )\nRepayment of credit card advance\n-\n(56 )\nBorrowings under secured note payable\n-\nRepayments under secured note payable\n(152 )\n(239 )\nProceeds from unsecured notes payable\nRepayment of unsecured notes payable\n(200 )\n(489 )\nPayments on equipment notes\n(268 )\n(189 )\nProceeds from exercise of stock options\nPrincipal payments on capital leases\n(11 )\n(8 )\nNet cash used in financing activities\n(453 )\n(505 )\nNet decrease in cash and cash equivalents\n(118 )\n(175 )\nCash and cash equivalents at beginning of year\n1,152\nCash and cash equivalents at end of year\n$ 859\n$ 977\nSupplemental Disclosure of Cash Flow Information:\nNon cash items:\nPurchases of equipment with equipment notes\n$ 346\n$ 998\nFinance lease asset obligation in exchange for lease payable\n$ 23\n$ 35\nAccrued interest converted for exercise of options\n$ -\n$ 10\nOperating lease asset obtained in exchange for operating lease liability\n$ -\n$ 2,684\nCash paid during the year for:\nInterest\n$ 338\n$ 371\nIncome taxes\n$ -\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 1. ORGANIZATION AND NATURE OF BUSINESS\nLuvu Brands, Inc. (the Company or Luvu) was incorporated in the State of Florida on February 25, 1999. References to the Company in these notes include the Company and its wholly owned subsidiaries, OneUp Innovations, Inc. (OneUp), and Foam Labs, Inc. (Foam Labs). All operations of the Company are currently conducted by OneUp Innovations, Inc.\nThe Company is an Atlanta, Georgia based designer, manufacturer and marketer of a portfolio of consumer lifestyle brands including: Liberator®, a brand category of iconic products for enhancing sexual performance; Avana® inclined bed therapy products, assistive in relieving medical conditions associated with acid reflux, surgery recovery and chronic pain; and Jaxx®, a diverse range of casual fashion daybeds, sofas and beanbags made from polyurethane foam and repurposed polyurethane foam trim. These products are sold through the Companys websites, online mass merchants and retail stores worldwide. Many of our products are offered flat-packed and either roll or vacuum compressed to save on shipping and reduce our carbon footprint.\nSales are generated through internet and print advertisements. We have a diversified customer base with only one customer accounting for 10% or more of consolidated net sales in the current and prior fiscal year and no particular concentration of credit risk in one economic sector. Foreign operations and foreign net sales are not material.\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThese consolidated financial statements include the accounts and operations of our wholly owned operating subsidiaries, OneUp and Foam Labs. Intercompany accounts and transactions have been eliminated in consolidation. Certain prior period amounts have been reclassified to conform to the current year presentation. The accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (GAAP).\nUse of Estimates\nThe preparation of the consolidated financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions in determining the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and reported amounts of revenues and expenses during the reporting period. Significant estimates in these consolidated financial statements include estimates of: income taxes; tax valuation reserves; allowances for doubtful accounts; inventory valuation and reserves, share-based compensation; and useful lives for depreciation and amortization. Actual results could differ materially from these estimates.\nRevenue Recognition\nWe record revenue based on the five-step model which includes: (1) identifying the contract with the customer; (2) identifying the performance obligations in the contract; (3) determining the transaction price; (4) allocating the transaction price to the performance obligations; and (5) recognizing revenue when the performance obligations are satisfied. Substantially all of our revenue is generated by fulfilling orders for the purchase of manufactured products and product purchased for resale to retailers, wholesalers, or direct to consumers via online channels, with each order considered to be a distinct performance obligation. These orders may be formal purchase orders, verbal phone orders, e-mail orders or orders received online. Shipping and handling activities for which we are responsible under the terms and conditions of the order are not accounted for as performance obligations but as fulfillment costs. These activities are required to fulfill our promise to transfer the goods and are expensed when revenue is recognized. The impact of this policy election is insignificant as it aligns with our current practice.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nRevenue is measured as the net amount of consideration expected to be received in exchange for fulfilling a performance obligation. We have elected to exclude sales, use and similar taxes from the measurement of the transaction price. The impact of this policy election is insignificant, as it aligns with our current practice. The amount of consideration expected to be received and revenue recognized includes estimates of variable consideration, which includes costs for trade promotion programs, coupons, returns and early payment discounts. Such estimates are calculated using historical averages adjusted for any expected changes due to current business conditions and experience. We review and update these estimates at the end of each reporting period and the impact of any adjustments are recognized in the period the adjustments are identified. In assessing whether collection of consideration from a customer is probable, we consider the customer's ability and intent to pay that amount of consideration when it is due. Payment of invoices is due as specified in the underlying customer agreement, typically 30 days from the invoice date, which occurs on the date of transfer of control of the products to the customer. Revenue is recognized at the point in time that control of the ordered products is transferred to the customer. Generally, this occurs when the product is delivered, or in some cases, picked up from one of our distribution centers by the customer.\nDeferred revenues\nDeferred revenues are recorded when the Company has received consideration (i.e. advance payment) before satisfying its performance obligations. Deferred revenues primarily relate to gift cards purchased, but not used, prior to the end of the fiscal period. Our total deferred revenue as of June 30, 2022 and June 30, 2021 was $18,118 and $16,965, respectively, and was included in Other accrued liabilities on our consolidated balance sheets.\nCost of Goods Sold\nCost of goods sold includes raw material, labor, manufacturing overhead, and royalty expense.\nShipping and Handling Costs\nWe include fees earned on the shipment of our products to customers in sales and include costs incurred on the shipment of product to customers in costs of goods sold.\nCash and Cash Equivalents\nFor purposes of reporting cash flows, the Company considers all highly liquid debt instruments purchased with a maturity of three months or less to be cash equivalents.\nAllowance for Doubtful Accounts\nThe allowance for doubtful accounts reflects management's best estimate of probable credit losses inherent in the accounts receivable balance. The Company determines the allowance based on historical experience, specifically identified nonpaying accounts and other currently available evidence. The Company reviews its allowance for doubtful accounts monthly with a focus on significant individual past due balances over 90 days. Account balances are charged off against the allowance after all means of collection have been exhausted and the potential for recovery is considered remote. The Company does not have any off-balance sheet credit exposure related to its customers.\nThe following is a summary of Accounts Receivable as of June 30, 2022 and June 30, 2021.\nJune 30,\nJune 30,\n(in thousands)\nAccounts receivable\n$ 1,114\n$ 1,189\nAllowance for doubtful accounts\n(1 )\n(1 )\nAllowance for discounts and returns\n(6 )\n(54 )\nTotal accounts receivable, net\n$ 1,107\n$ 1,134\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (continued)\nInventories and Inventory Reserves\nInventories are stated at the lower of cost or net realizable value. Cost is determined using the first-in, first-out (FIFO) method. Net realizable value is defined as sales price less cost to dispose and a normal profit margin. Inventory costs include materials, labor, depreciation and overhead. The company establishes reserves for excess and obsolete inventory, based on prevailing circumstances and judgment for consideration of current events, such as economic conditions, that may affect inventory. The reserve required to record inventory at lower of cost or net realizable value may be adjusted in response to changing conditions.\nConcentration of Credit Risk\nThe Company maintains its cash accounts with banks located in Georgia. The total cash balances are insured by the Federal Deposit Insurance Corporation (FDIC) up to $250,000 per bank. The Company had cash balances on deposit at June 30, 2022 and 2021 that exceeded the balance insured by the FDIC by $717,316 and $807,766, respectively. Accounts receivable are typically unsecured and are derived from revenue earned from customers primarily located in North America and Europe.\nDuring 2022, we purchased 34% of total inventory purchases from one vendor.\nDuring 2021, we purchased 34% of total inventory purchases from one vendor.\nAs of June 30, 2022, two of the Companys customers represent 21% and 13% of the total accounts receivables, respectively. As of June 30, 2021, two of the Companys customers represent 40% and 14% of the total accounts receivable, respectively. Sales to (and through) Amazon accounted for 31% and 29% of our net sales during each of the years ended June 30, 2022 and June 30, 2021 respectively.\nFair Value of Financial Instruments\nAt June 30, 2022 and 2021, our financial instruments included cash and cash equivalents, accounts receivable, accounts payable, short-term debt, and other long-term debt.\nThe fair values of these financial instruments approximated their carrying values based on either their short maturity or current terms for similar instruments.\nThe Company measures the fair value of its assets and liabilities under the guidance of ASC 820, Fair Value Measurements and Disclosures, which defines fair value, establishes a framework for measuring fair value in accordance with generally accepted accounting principles and expands disclosures about fair value measurements. ASC 820 does not require any new fair value measurements, but its provisions apply to all other accounting pronouncements that require or permit fair value measurement.\nASC 820 clarifies that fair value is an exit price, representing the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants based on the highest and best use of the asset or liability. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or liability. ASC 820 requires the Company to use valuation techniques to measure fair value that maximize the use of observable inputs and minimize the use of unobservable inputs. These inputs are prioritized as follows:\nLevel 1: Observable inputs such as quoted prices for identical assets or liabilities in active markets;\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (continued)\nLevel 2: Inputs, other than the quoted prices in active markets, that are observable either directly or indirectly such as quoted prices for similar assets or liabilities or market-corroborated inputs; and\nLevel 3: Unobservable inputs for which there is little or no market data, which require the reporting entity to develop its own assumptions about how market participants would price the assets or liabilities.\nThe valuation techniques that may be used to measure fair value are as follows:\nA. Market approach - Uses prices and other relevant information generated by market transactions involving identical or comparable assets or liabilities.\nB. Income approach - Uses valuation techniques to convert future amounts to a single present amount based on current market expectations about those future amounts, including present value techniques, option-pricing models and excess earnings method.\nC. Cost approach - Based on the amount that currently would be required to replace the service capacity of an asset (replacement cost).\nAdvertising Costs\nAdvertising costs are expensed in the period when the advertisements are first aired or distributed to the public. Prepaid advertising (included in prepaid expenses) was $1,050 at June 30, 2022 and $5,000 at June 30, 2021. Advertising expense for the years ended June 30, 2022 and 2021 was $574,146 and $501,711, respectively.\nResearch and Development\nResearch and development expenses for new products are expensed as they are incurred. Expenses for new product development (included in general and administrative expense) totaled $117,079 for the year ended June 30, 2022 and $109,024 for the year ended June 30, 2021.\nProperty and Equipment\nProperty and equipment are stated at cost. Depreciation and amortization are computed using the straight-line method over estimated service lives for financial reporting purposes of 2-10 years.\nExpenditures for major renewals and betterments which extend the useful lives of property and equipment are capitalized. Expenditures for maintenance and repairs are charged to expense as incurred. When properties are disposed of, the related costs and accumulated depreciation are removed from the respective accounts, and any gain or loss is recognized currently.\nOperating Leases\nOn November 2, 2020, the Company entered into an agreement with its landlord on a new lease for the current facilities for six years and two months, beginning January 1, 2021. The new lease includes two months of rent abatement totaling $103,230. Under the new lease, the monthly rent on the facility is $51,615 with annual escalations of 3% with the final two months of rent at $61,605. In addition, the Company will pay the landlord a 2% property management fee. The rent expense for the year ended June 30, 2022 and June 30,2021 was $652,752 and $501,480 respectively.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (continued)\nUnder ASC 842, which was adopted July 1, 2019, the Company determines whether the arrangement is or contains a lease based on the unique facts and circumstances present. Most leases with a term greater than one year are recognized on the balance sheet as right-of-use assets, lease liabilities and, if applicable, long-term lease liabilities. The Company elected not to recognize leases with a term less than one year on its balance sheet. Operating lease right-of-use (ROU) assets and their corresponding lease liabilities are recorded based on the present value of lease payments over the expected remaining lease term. The interest rate implicit in lease contracts is typically not readily determinable. As a result, the Company utilizes its incremental borrowing rates, which are the rates incurred to borrow on a collateralized basis over a similar term, an amount equal to the lease payments in a similar economic environment.\nIn accordance with the guidance in ASU 2016-02, components of a lease should be split into three categories: lease components (e.g. land, building, etc.), non-lease components (e.g. common area maintenance, consumables, etc.), and non-components (e.g. property taxes, insurance, etc.) Then the fixed and in-substance fixed contract consideration (including any related to non-components) must be allocated based on fair values to the lease components and non-lease components. Although separation of lease and non-lease components is required, the Company elected the practical expedient to not separate lease and non-lease components. The lease component results in an operating right-of-use asset being recorded on the balance sheet and amortized on a straight-line basis as lease expense.\nUnder prior guidance ASC 840, rent expense and lease incentives from operating leases were recognized on a straight-line basis over the lease term. The difference between rent expense recognized and rental payments was recorded as deferred rent in the accompanying consolidated balance sheets.\nThe Company also leases certain equipment under operating leases, as more fully described in NOTE 15 - Commitments and Contingencies.\nSegment Information\nWe have identified three reportable sales channels: Direct, Wholesale and Other. Direct includes product sales through our five e-commerce sites. Wholesale includes Liberator, Jaxx, and Avana branded products sold to distributors and retailers, purchased products sold to retailers, and private label items sold to other resellers. The Wholesale category also includes contract manufacturing services, which consists of specialty items that are manufactured in small quantities for certain customers, and which, to date, has not been a material part of our business. Other consists principally of shipping and handling fees and costs derived from our Direct business and fulfillment service fees.\nThe following is a summary of sales results for the Direct, Wholesale, and Other channels.\nYear Ended\nJune 30, 2022\nYear Ended\nJune 30, 2021\n%\nChange\n(in thousands)\nNet Sales by Channel:\nDirect\n$ 7,136\n$ 6,919\n3 %\nWholesale\n$ 18,546\n$ 15,618\n19 %\nOther\n$ 661\n$ 568\n16 %\nTotal Net Sales\n$ 26,343\n$ 23,105\n14 %\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (continued)\nYear Ended\nMargin\nYear Ended\nMargin\n%\nJune 30, 2022\n%\nJune 30, 2021\n%\nChange\n(in thousands)\n(in thousands)\nGross Profit by Channel:\nDirect\n$ 3,289\n46 %\n$ 3,329\n48 %\n(1 )%\nWholesale\n$ 4,017\n22 %\n$ 4,216\n27 %\n(4 )%\nOther\n$ (1,305 )\n(197 )%\n$ (1,244 )\n(219 )%\n5 %\nTotal Gross Profit\n$ 6,001\n23 %\n$ 6,301\n27 %\n(4 )%\nRecent accounting pronouncements\nFrom time to time, new accounting pronouncements are issued by the Financial Accounting Standards Board (FASB) or other standard setting bodies that are adopted by the Company as of the specified effective date.\nAdopted during the year ended June 30, 2021\nFair Value Measurement\nIn August 2018, the FASB issued Accounting Standards Update (ASU) No. 2018-13, Fair Value Measurement (Topic 820): Disclosure Framework-Changes to the Disclosure Requirements for Fair Value Measurement. The new standard eliminates, adds and modifies certain disclosure requirements for fair value measurement as part of the FASBs disclosure framework project. Under the new standard, the amount and reason for a transfer between Level 1 and Level 2 of the fair value hierarchy are no longer required to be disclosed, but public companies are required to disclose a range and weighted average of significant unobservable inputs for Level 3 fair value measurements. The Company adopted the new standard on July 1, 2020; however, it did not have a significant impact on the Companys financial statements.\nCollaborative Arrangements\nIn November 2018, the FASB issued ASU No. 2018-18, Collaborative Arrangements (Topic 808): Clarifying the Interaction between Topic 808 and Topic 606. The new standard clarifies that certain transactions between participants in a collaborative arrangement should be accounted for under Topic 606 when the counterparty is a customer. The new standard also precludes an entity from presenting consideration from a transaction in a collaborative arrangement as revenue from contracts with customers if the counterparty is not a customer for that transaction. The guidance amends Topic 808 to refer to the unit-of-account guidance in Topic 606 and requires it to be used only when assessing whether a transaction is in the scope of Topic 606. The Company adopted the new standard on July 1, 2020; however, it did not have a significant impact on the Companys financial statements.\nAdopted effective July 1, 2021\nFinancial Instruments-Credit Losses\nIn June 2016, the FASB issued ASU No. 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments. The new standard requires that financial assets measured at amortized cost be presented at the net amount expected to be collected and separately measure an allowance for credit losses that is deducted from the amortized cost basis of those financial assets. The Company early adopted the new standard on July 1, 2021; however, it did not have a significant impact on the Companys financial statements.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (continued)\nRecent accounting pronouncements (continued)\nIncome Taxes\nIn December 2019, the FASB issued ASU No. 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. The new standard includes several provisions that simplify the accounting for income taxes by removing certain exceptions to the general principles in Topic 740 and increasing consistency and clarity for the users of financial statements. The Company adopted the new standard on July 1, 2021; however, it did not have a significant impact on the Companys financial statements.\nInvestments - Equity Securities, Investments - Equity Method and Joint Ventures, and Derivatives and Hedging\nIn January 2020, the FASB issued ASU No. 2020-01, Investments - Equity Securities (Topic 321), Investments - Equity Method and Joint Ventures (Topic 323), and Derivatives and Hedging (Topic 815)-Clarifying the Interactions between Topic 321, Topic 323, and Topic 815. The new standard addresses interactions between the guidance to account for certain equity securities under ASC Topic 321, the guidance to account for investments under the equity method of accounting in ASC Topic 323 and the guidance in ASC Topic 815, which could change how an entity accounts for an equity security under the measurement alternative or a forward contract or purchased option to purchase securities that, upon settlement of the forward contract or exercise of the purchased option, would be accounted for under the equity method of accounting or the fair value option in accordance with ASC Topic 825, Financial Instruments. These amendments improve current U.S. GAAP by reducing diversity in practice and increasing comparability of the accounting for any such interactions. The Company adopted the new standard on July 1, 2021; however, it did not have a significant impact on the Companys financial statements.\nNet Income Per Share\nIn accordance with FASB Accounting Standards Codification No. 260, Earnings Per Share, basic net income per share is computed by dividing the net income available to common stockholders for the period by the weighted average number of common shares outstanding during the period. Diluted net income per share is computed by dividing net income available to common stockholders by the weighted average number of common and common equivalent shares outstanding during the period.\nThe total potential dilutive securities as of June 30, 2022 and 2021 are as follows:\nConvertible Preferred Stock\n4,300,000\n4,300,000\nStock options - 2015 Plan\n1,975,000\n2,500,000\nTotal\n6,275,000\n6,800,000\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (continued)\nIncome Taxes\nWe utilize the asset and liability method of accounting for income taxes. We recognize deferred tax liabilities or assets for the expected future tax consequences of temporary differences between the book and tax basis of assets and liabilities. We regularly assess the likelihood that our deferred tax assets will be recovered from future taxable income. We consider projected future taxable income and ongoing tax planning strategies in assessing the amount of the valuation allowance necessary to offset our deferred tax assets that will not be recoverable. We have recorded and continue to carry a full valuation allowance against our gross deferred tax assets that will not reverse against deferred tax liabilities within the scheduled reversal period. If we determine in the future that it is more likely than not that we will realize all or a portion of our deferred tax assets, we will adjust our valuation allowance in the period we make the determination. We expect to provide a full valuation allowance on our future tax benefits until we can sustain a level of profitability that demonstrates our ability to realize these assets. At June 30, 2022, we carried a valuation allowance of $1.4 million against our net deferred tax assets.\nStock Based Compensation\nWe account for stock-based compensation to employees in accordance with FASB ASC 718, Compensation - Stock Compensation. We measure the cost of each stock option and restricted stock award at its fair value on the grant date. Each award vests over the subsequent period during which the recipient is required to provide service in exchange for the award (the vesting period). The cost of each award is recognized as expense in the financial statements over the respective vesting period.\nNOTE 3. IMPAIRMENT OF LONG-LIVED ASSETS\nWe follow FASB ASC 360, Property, Plant, and Equipment, regarding impairment of our other long-lived assets (property, plant and equipment). Our policy is to assess our long-lived assets for impairment annually in the fourth quarter of each year or more frequently if events or changes in circumstances indicate that the carrying amount of these assets may not be recoverable.\nAn impairment loss is recognized only if the carrying value of a long-lived asset is not recoverable and is measured as the excess of its carrying value over its fair value. The carrying amount of a long-lived asset is considered not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use of a long-lived asset.\nAssets to be disposed of and related liabilities would be separately presented in the consolidated balance sheet. Assets to be disposed of would be reported at the lower of the carrying value or fair value less costs to sell and would not be depreciated. There was no impairment as of June 30, 2022 or 2021.\nNOTE 4. INVENTORIES\nAll inventories are stated at the lower of cost (which approximates first-in, first-out) or net realizable value. The Companys inventories consist of the following components at June 30, 2022 and 2021:\n(in thousands)\nRaw materials\n$ 1,893\n$ 1,637\nWork in process\nFinished goods\n1,660\n1,531\nTotal inventories\n3,993\n3,564\nAllowance for inventory reserves\n(176 )\n(173 )\nTotal inventories, net of allowance\n$ 3,817\n$ 3,391\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 5. EQUIPMENT, PROPERTY AND LEASEHOLD IMPROVEMENTS, NET\nEquipment, property and leasehold improvements at June 30, 2022 and 2021 consisted of the following:\nEstimated\nUseful Life\n(in thousands)\nFactory equipment\n$ 3,840\n$ 3,567\n2-10 years\nComputer equipment and software\n1,167\n1,146\n5-7 years\nOffice equipment and furniture\n5-7 years\nLeasehold improvements\n10 years\nProjects in process\nSubtotal\n6,010\n5,620\nAccumulated depreciation\n(3,981 )\n(3,686 )\nEquipment and leasehold improvements, net\n$ 2,029\n$ 1,934\nDepreciation expense was $305,643 and $220,635 for the years ended June 30, 2022 and 2021, respectively.\nNOTE 6. OTHER ACCRUED LIABILITIES\nOther accrued liabilities at June 30, 2022 and 2021 consisted of the following:\n(in thousands)\nAccrued compensation\n$ 344\n$ 509\nAccrued expenses and interest\nOther accrued liabilities\n$ 545\n$ 694\nNOTE 7. CURRENT AND LONG-TERM DEBT SUMMARY\nCurrent and long-term debt at June 30, 2022 and 2021 consisted of the following:\nCurrent debt:\n(in thousands)\nUnsecured lines of credit (Note 12)\n$ 25\n$ 37\nLine of credit (Note 11)\n1,070\n1,083\nShort-term unsecured notes payable (Note 8)\nCurrent portion of equipment notes payable (Note 15)\nCurrent portion secured notes payable (Note 13)\n-\nCurrent portion of finance leases payable (Note 15)\nCredit card advance (net of discount) (Note 10)\n-\n-\nTotal current debt\n1,618\n1,599\nLong-term debt:\nUnsecured notes payable (Note 8)\nEquipment notes payable (Note 15)\nFinance leases payable (Note 15)\nNotes payable- related party (Note 9)\nTotal long-term debt\n$ 1,183\n$ 1,288\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 8. UNSECURED NOTES PAYABLE\nUnsecured notes payable at June 30, 2022 and 2021 consisted of the following:\nCurrent debt:\n(in thousands)\n20% Unsecured note, interest only, due October 31, 2021 (1)\n-\n13.5% Unsecured note, interest only, due May 1, 2023 (2)\n-\nTotal current debt\nLong-term debt:\n20% Unsecured note, interest only, due July 31, 2021 (3)\n-\n13.5% Unsecured note, interest only, due May 1, 2023 (2)\n-\n13.5% Unsecured note, interest only, due July 31, 2023 (3)\n-\n13.5% Unsecured note, interest only, due October 31, 2023 (1)\n-\nTotal long-term debt\nTotal unsecured notes payable\n$ 400\n$ 400\n(1) Unsecured note payable for $100,000 to an individual with interest payable monthly at 20%, principal originally due in full on October 31, 2014, extended to October 31, 2019, then extended to October 31, 2021. This note was repaid in full on October 31, 2021 and replaced with a new note from an entity controlled by the same lender with interest payable monthly at 13.5%, principal due in full on October 31, 2023. Personally guaranteed by principal stockholder.\n(2) Unsecured note payable for $200,000 to an individual with interest payable monthly at 20%, principal originally due in full on May 1, 2013, extended to May 1, 2019, then extended to May 1, 2021. This note was repaid in full on April 30, 2021 and replaced with a new note from an entity controlled by the same lender with interest payable monthly at 13.5%, principal due in full on May 1, 2023. Personally guaranteed by principal stockholder.\n(3) Unsecured note payable for $100,000 to an individual with interest payable monthly at 20%, principal originally due in full on July 31, 2013, extended to July 31, 2019, then extended to July 31, 2021. This note was repaid in full on July 30, 2021 and replaced with a new note from an entity controlled by the same lender with interest payable monthly at 13.5%, principal due in full on July 31, 2023. Personally guaranteed by principal stockholder.\nNOTE 9. NOTES PAYABLE - RELATED PARTY\nRelated party notes payable at June 30, 2022 and 2021 consisted of the following:\n(in thousands)\nUnsecured note payable to an officer, with interest at 3.25%, due July 1, 2023\n$ 40\n$ 40\nUnsecured note payable to an officer, with interest at 3.25%, due July 1, 2023\nTotal unsecured notes payable\nLess: current portion\n-\n-\nLong-term unsecured notes payable\n$ 116\n$ 116\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 10. CREDIT CARD ADVANCES\nOn August 28, 2019, the Company borrowed $250,000 from Power Up against its future credit card receivables. Terms for this loan calls for a repayment of $290,000, which includes a one-time finance charge of $40,000, approximately ten months after the funding date. A 1% loan origination fee was deducted, and the Company received net proceeds of $247,500. This loan was repaid in full on September 16, 2020. This loan was guaranteed by the Company and was personally guaranteed by the Companys CEO and controlling shareholder, Louis S. Friedman (see Note 16).\nNOTE 11. LINE OF CREDIT\nThe Companys wholly owned subsidiary, OneUp and OneUps wholly owned subsidiary, Foam Labs has entered into a credit facility with a finance company, Advance Financial Corporation dated May 24, 2011, as amended, to provide it with an asset based line of credit of up to $1,200,000 against 85% of eligible accounts receivable (as defined in the agreement) for the purpose of improving working capital and includes an Inventory Advance (as defined in the agreement) of up to the lesser of $500,000 or 125% of the eligible accounts receivable loan. The term of the agreement was one year, renewable for additional one-year terms unless either party provides written notice of non-renewal at least 90 days prior to the end of the current financing period. The credit facility is secured by our accounts receivable and other rights to payment, general intangibles, inventory and equipment, and are subject to eligibility requirements for current accounts receivable. Advances under the agreement are currently charged interest at a rate of prime rate plus 2% over the lenders Index Rate. In addition, there is a Monthly Service Fee (as defined in the agreement) of currently 0.05 % per month.\nThe Companys President and Chief Executive Officer (CEO), Louis Friedman, has personally guaranteed the repayment of the facility. In addition, the Company has provided its corporate guarantee of the credit facility (see Note 16). On June 30, 2022, the balance owed under this line of credit was $1,070,069. As of June 30, 2022, we were current and in compliance with all terms and conditions of this line of credit.\nManagement believes cash flows generated from operations, along with current cash and investments as well as borrowing capacity under the line of credit should be sufficient to finance capital requirements required by operations. If new business opportunities do arise, additional outside funding may be required.\nNOTE 12. UNSECURED LINES OF CREDIT\nThe Company has drawn a cash advance on one unsecured lines of credit that is in the name of the Company and Louis S. Friedman (see Note 16). The terms of this unsecured line of credit calls for monthly payments of principal and interest, with interest at 8%. The aggregate amount owed on the unsecured line of credit was $24,879 at June 30, 2022 and $36,680 at June 30, 2021.\nNOTE 13. SECURED NOTE PAYABLE\nOn February 17, 2021, the Company entered into an agreement with Amazon, whereby Amazon agreed to loan OneUp Innovations a total of $200,000. Repayment of this note is by 12 monthly payments of $17,675, which includes interest at 10.99%. This loan was repaid in full on February 17, 2022. The Company has granted Amazon a security interest in the assets of the Company.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 14. PPP LOAN\nOn April 26, 2020, the Company entered into a promissory note (the PPP Note) evidencing an unsecured loan in the amount of $1,096,200 made to the Company under the Payroll Protection Plan (\"PPP\"). The PPP is a liquidity facility program established by the U.S. government as part of the CARES Act in response to the negative economic impact of the COVID-19 outbreak. The PPP Loan to the Company is being administered by Ameris Bank. The PPP Loan has a two-year term and bears interest at a rate of 1.0% per annum. Monthly principal and interest payments are deferred for six months. Beginning November 26, 2020, seven months from the date of the PPP Note, the Company is required to make monthly payments of principal and interest in the amount of $61,691.\nThe PPP Loan is a forgivable loan to the extent proceeds are used to cover qualified documented payroll, mortgage interest, rent, and utility costs over a 24-week measurement period (as amended) following loan funding. For the loan to be forgiven, the Company is required to formally apply for forgiveness, and potentially, required to pass an audit that it met the eligibility qualifications of the loan. Within 150 days from the application, the Company will be notified whether or not the loan is forgiven.\nOn December 18, 2020, the Company was informed by Ameris Bank that the PPP Note had been forgiven by the U.S. Small Business Administration.\nIn accounting for the terms of the PPP Loan, the Company is guided by ASC 470 Debt, and ASC 450-30 Gain contingency. Accordingly, the Company derecognized the PPP Note liability of $1,096,200 and recorded it as Other Income, as the forgiveness was certain.\nNOTE 15. COMMITMENTS AND CONTINGENCIES\nOperating Leases\nThe Company leases its facilities under non-cancelable operating leases expiring at the end of 2026. Right-of-use assets represent the right to use an underlying asset for the lease term and lease liabilities represent the obligation to make lease payments arising from the lease. Right-of-use assets and liabilities for the lease renewal were recognized at the inception date which is November 2, 2020 based on the present value of lease payments over the lease term, using the Companys incremental borrowing rate based on the information available. At June 30, 2022, the weighted average remaining lease term for the lease renewal is 6 years and the weighted average discount rate is 14.49%. Supplemental balance sheet information related to leases at June 30, 2022 is as follows:\nSupplemental balance sheet information related to leases at June 30, 2022 is as follows:\nOperating leases\nBalance Sheet Classification\n(in thousands)\nRight-of-use assets\nOperating lease right-of-use assets, net\n$ 2,255\nCurrent lease liabilities\nOperating lease obligations\n$ 331\nNon-current lease liabilities\nLong-term operating lease obligations\n2,068\nTotal lease liabilities\n$ 2,399\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 15. COMMITMENTS AND CONTINGENCIES (continued)\nMaturities of operating lease liabilities at June 30, 2022 are as follows:\nPayments\n(in thousands)\n2027 and thereafter\nTotal undiscounted lease payments\n3,333\nLess: Present value discount\n(934 )\nTotal operating lease liability balance\n$ 2,399\nEquipment Notes Payable\nThe Company has acquired equipment under the provisions of long-term equipment notes. For financial reporting purposes, minimum note payments relating to the equipment have been capitalized. The equipment acquired with these equipment notes has a total cost of approximately $1,761,393. These assets are included in the fixed assets listed in Note 5 - Equipment and Leasehold Improvements and include production equipment. The equipment notes have stated or imputed interest rates ranging from 10.5% to 11.3%.\nThe following is an analysis of the minimum future equipment note payable payments subsequent to June 30, 2022:\nYear ending June 30,\n(in thousands)\nFuture Minimum Note Payable Payments\n$ 1,317\nLess Amount Representing Interest\n(167 )\nPresent Value of Minimum Note Payable Payments\n1,150\nLess Current Portion\n(308 )\nLong-Term Obligations under Equipment Notes Payable\n$ 842\nFinance Leases Payable\nThe Company has lease obligations for equipment under the provisions of long-term finance leases. For financial reporting purposes, minimum lease payments relating to the equipment have been capitalized. The equipment acquired with these leases has a total cost of approximately $58,152. These assets are included in the finance lease and include production equipment.\nOn June 22, 2020 the Company entered into finance lease agreement with Wells Fargo in the amount of $34,761 with monthly payment of $850 with 48-month term at an imputed interest rate of 8.09%.\nOn February 1, 2022 the Company entered into finance lease agreement with Raymond in the amount of $22,862 with monthly payment of $514 with 48-month term at an imputed interest rate of 3.75%.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 15. COMMITMENTS AND CONTINGENCIES (continued)\nThe following is an analysis of the minimum finance lease payable payments subsequent to June 30, 2022:\nYear ending June 30,\n(in thousands)\nFuture Minimum Finance Lease Payable Payments\n$ 43\nLess Amount Representing Interest\n(3 )\nPresent Value of Minimum Finance Lease Payable Payments\nLess Current Portion\n(15 )\nLong-Term Obligations under Finance Lease Payable\n$ 25\nEmployment Agreements\nThe Company has entered into an employment agreement with Louis Friedman, President and Chief Executive Officer. The agreement provides for an annual base salary of $150,000 and eligibility to receive a bonus. In certain termination situations, the Company is liable to pay severance compensation to Mr. Friedman for up to nine months at his current salary.\nLegal Proceedings\nAs of the date of this Annual Report, there are no material pending legal or governmental proceedings relating to the Company or properties to which the Company is a party, and to the Companys knowledge there are no material proceedings to which any of its directors, executive officers or affiliates are a party adverse to the Company or which have a material interest adverse to the Company.\nNOTE 16. RELATED PARTY TRANSACTIONS\nThe Company has a subordinated note payable to an officer of the Company who is also the wife of the Companys CEO (Louis Friedman) and majority shareholder in the amount of $76,000 (see Note 9). Interest on the note during the year ended June 30, 2022 was accrued by the Company at the prevailing prime rate (which is currently 4.75%) and totaled $2,611. The accrued interest on the note as of June 30, 2022 was $32,760. This note is subordinate to all other credit facilities currently in place.\nOn October 30, 2010, Mr. Friedman, loaned the Company $40,000 (see Note 9). Interest on the note during the year ended June 30, 2022 was accrued by the Company at the prevailing prime rate (which is currently 4.75%) and totaled $1,374. The accrued interest on the note as of June 30, 2022 was $6,889. This note is subordinate to all other credit facilities currently in place.\nThe Companys CEO, Louis Friedman, has personally guaranteed the repayment of the loan obligation to Advance Financial Corporation (see Note 11 - Line of Credit). In addition, Luvu Brands has provided its corporate guarantees of the credit facility. On June 30, 2022, the balance owed under this line of credit was $1,070,069.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 16. RELATED PARTY TRANSACTIONS (continued)\nOn July 20, 2011, the Company issued an unsecured promissory note to an individual for $100,000. Terms of the promissory note call for monthly interest payments of $1,667 (equal to interest at 20% per annum), with the principal amount due in full on July 31, 2012; extended by the holder to July 31, 2021 under the same terms (see Note 8). This note was repaid in full on July 30, 2021 and replaced with a new note from an entity controlled by the same lender with interest payable monthly at 13.5%, principal due in full on July 31, 2023. Repayment of this promissory note is personally guaranteed by the Companys CEO and controlling shareholder, Louis S. Friedman.\nOn October 31, 2013, the Company issued an unsecured promissory note to an individual for $100,000. Terms of the promissory note call for monthly interest payments of $1,667 (equal to interest at 20% per annum) beginning on November 30, 2013, with the principal amount due in full on or before October 31, 2014 extended by the holder to October 31, 2021 (see Note 8). This note was repaid in full on October 31,2021 and replaced with a new note from an entity controlled by the same lender with interest payable monthly at 13.5%, principal due in full on October 31, 2023. Repayment of the promissory note is personally guaranteed by the Companys CEO and majority shareholder, Louis S. Friedman.\nOn May 1, 2012, an individual loaned the Company $200,000 with an interest rate of 20%. Interest on the loan is being paid monthly, with the principal due in full on May 1, 2013; then extended to May 1, 2021 (see Note 8). This note was repaid in full on April 30, 2021 and replaced with a new note from an entity controlled by the same lender with interest payable monthly at 13.5%, principal due in full on May 1, 2023. Mr. Friedman has personally guaranteed the repayment of the loan obligation.\nThe loans from Power Up Lending Group, Ltd. (see Note 10) were guaranteed by the Company (including OneUp and Foam Labs) and were personally guaranteed by the Companys CEO and majority shareholder, Louis S. Friedman. Power Up Lending Group, Ltd. is controlled by Curt Kramer, who also controls HCI. As last reported to us, HCI owns 7.1% of our common stock.\nThe Company has drawn a cash advance on one unsecured lines of credit that is in the name of the Company and Louis S. Friedman. The terms of this unsecured line of credit calls for monthly payments of principal and interest, with interest at 8%. The aggregate amount owed on the unsecured line of credit was $24,879 at June 30, 2022 and $36,680 at June 30, 2021 (see Note 12). The loan is personally guaranteed by the Companys CEO and majority shareholder, Louis S. Friedman.\nNOTE 17. STOCKHOLDERS EQUITY\nOptions\nAt June 30, 2022, the Company had the 2015 Equity Incentive Plan (the 2015 Plan), which is shareholder-approved and under which 2,225,000 shares are reserved for issuance under the 2015 Plan until that Plan terminates on August 31, 2025.\nUnder the 2015 Plan, eligible employees and certain independent consultants may be granted options to purchase shares of the Companys common stock. The shares issuable under the 2015 Plan will either be shares of the Companys authorized but previously unissued common stock or shares reacquired by the Company, including shares purchased on the open market. As of June 30, 2022, the number of shares available for issuance under the 2015 Plan was 250,000.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 17. STOCKHOLDERS EQUITY (continued)\nA summary of option activity under the Companys stock plan for the years ended June 30, 2022 and 2021 is presented below:\nOption Activity\nShares\nWeighted\nAverage\nExercise Price\nWeighted Average Remaining Contractual Term\nAggregate\nIntrinsic\nValue\nOutstanding at June 30, 2020\n4,250,000\n$ 0.02\n1.7 years\n$ 624,700\nGranted\n350,000\n$ 0.15\n4.8 years\nExercised\n(1,600,000 )\n$ 0.01\nForfeited or Expired\n(500,000 )\n$ 0.05\nOutstanding at June 30, 2021\n2,500,000\n$ 0.04\n1.9 years\n$ 974,300\nGranted\n900,000\n$ 0.18\n4.8 years\nExercised\n(1,175,000 )\n$ 0.03\nForfeited or Expired\n(250,000 )\n$ 0.07\nOutstanding at June 30, 2022\n1,975,000\n$ 0.10\n3.0 years\n$ 107,500\nExercisable at June 30, 2022\n750,000\n$ 0.03\n1.0 years\n$ 80,078\nThe aggregate intrinsic value in the table above is before applicable income taxes and represents the excess amount over the exercise price optionees would have received if all options had been exercised on the last business day of the period indicated, based on the Companys closing stock price of $0.14, $0.43, and $0.17 at June 30, 2022, 2021 and 2020, respectively.\nThere were 900,000 stock options granted during the year ended June 30, 2022 and 350,000 stock options granted during the year ended June 30, 2021.\nDuring the year ended June 30, 2022 and June 30, 2021 the Companys proceeds from stock options exercise under 2015 Plan were $3,000 and $8,750 respectively.\nThe range of fair value assumptions related to options granted during the years ended June 30, 2022 and 2021 were as follows:\nExercise Price:\n$ 0.16 - $0.30\n$ 0.13 - $0.17\nVolatility:\n500% - 519%\n469% - 489%\nRisk Free Rate:\n0.65% - 2.90%\n0.25% - 0.49%\nVesting Period:\n4 years\n4 years\nForfeiture Rate:\n0%\n0%\nExpected Life:\n4.1 years\n4.1 years\nDividend Rate:\n0%\n0%\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 17. STOCKHOLDERS EQUITY (continued)\nThe following table summarizes the weighted average characteristics of outstanding stock options as of June 30, 2022:\nOutstanding Options\nExercisable Options\nExercise Prices\nNumber\nof Shares\nRemaining\nLife\n(Years)\nWeighted\nAverage\nPrice\nNumber of\nShares\nWeighted\nAverage\nPrice\n.01 to .03\n925,000\n1.2\n$ 0.03\n725,000\n$ 0.03\n.05\n50,000\n1.0\n$ 0.05\n-\n-\n.15 to .20\n950,000\n4.7\n$ 0.17\n25,000\n$ 0.17\n.30\n50,000\n4.1\n$ 0.30\n-\n-\nTotal stock options\n1,975,000\n3.0\n$ 0.10\n750,000\n$ 0.03\nWe account for stock-based compensation to employees in accordance with FASB ASC 718, Compensation - Stock Compensation. We measure the cost of each stock option and at its fair value on the grant date. Each award vests over the subsequent period during which the recipient is required to provide service in exchange for the award (the vesting period). The cost of each award is recognized as expense in the financial statements over the respective vesting period.\nAll stock option grants made under the Plan were at exercise prices no less than the Companys closing stock price on the date of grant. Options under the Plan were determined by the board of directors in accordance with the provisions of the plan. The terms of each option grant include vesting, exercise, and other conditions are set forth in a Stock Option Agreement evidencing each grant. No option can have a life in excess of ten (10) years. The Company records compensation expense for employee stock options based on the estimated fair value of the options on the date of grant using the Black-Scholes option-pricing model. The model requires various assumptions, including a risk-free interest rate, the expected term of the options, the expected stock price volatility over the expected term of the options, and the expected dividend yield. Compensation expense for employee stock options is recognized ratably over the vesting term. The Company has no awards with market or performance conditions.\nStock-based compensation expense recognized in the consolidated statements of operations for each of the fiscal years ended June 30, 2022 and 2021 is based on awards ultimately expected to vest.\nAs of June 30, 2022, total unrecognized stock-based compensation expense related to all unvested stock options was $163,906 which is expected to be expensed over a weighted average period of 3.6 years.\nIn determining the grant date fair value of option awards under the equity incentive plans, the Company applied the Black-Scholes option pricing model. Based upon limited option exercise history, the Company has generally used the simplified method outlined in SEC Staff Accounting Bulletin No. 110 to estimate the expected life of stock option grants. Management believes that the historical volatility of the Companys stock price on OTCQB best represents the expected volatility over the estimated life of the option. The risk-free interest rate is based upon published U.S. Treasury yield curve rates at the date of grant corresponding to the expected life of the stock option. An assumed dividend yield of zero reflects the fact that the Company has never paid cash dividends and has no intentions to pay dividends in the foreseeable future.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 17. STOCKHOLDERS EQUITY (continued)\nThe following table summarizes stock-based compensation expense by line item in the consolidated statements of operations, all relating to employee stock plans:\nFor the Years Ended June 30,\n(in thousands)\nCost of Goods Sold\n$ 3\n$ -\nOther Selling and Marketing\nGeneral and Administrative\nTotal\n$ 24\n$ 15\nShare Purchase Warrants\nAs of June 30, 2022 and 2021, there were no share purchase warrants outstanding.\nCommon Stock\nThe Companys authorized common stock was 175,000,000 shares at June 30, 2022 and 2021. Common shareholders are entitled to dividends if and when declared by the Companys Board of Directors, subject to preferred stockholder dividend rights. At June 30, 2022, the Company had reserved the following shares of common stock for issuance:\nJune 30, 2022\nShares of common stock reserved for issuance under the 2015 Stock Option Plan\n2,225,000\nShares of common stock issuable upon conversion of the Preferred Stock\n4,300,000\nTotal shares of common stock equivalents\n6,525,000\nDuring fiscal year 2022 and fiscal year 2021 the Company issued 1,008,359 and 1,585,294 common shares respectively for stock option exercises under 2015 Equity Incentive Plan.\nPreferred Stock\nOn February 18, 2011, the Company filed an amendment to its Articles of Incorporation, effective February 9, 2011, authorizing the issuance of preferred stock and the Company now has 10,000,000 authorized shares of preferred stock, par value $0.0001 per share, of which 4,300,000 shares have been designated and issued as Series A Convertible Preferred Stock. Each share of Series A Convertible Preferred Stock is convertible into one share of common stock and has a liquidation preference of $0.2325 ($1,000,000 in the aggregate). Liquidation payments to the preferred holders have priority and are made in preference to any payments to the holders of common stock. In addition, each share of Series A Convertible Preferred Stock is entitled to the number of votes equal to the result of: (i) the number of shares of common stock of the Company issued and outstanding at the time of such vote multiplied by 1.01; divided by (ii) the total number of Series A Convertible Preferred Shares issued and outstanding at the time of such vote. At each meeting of shareholders of the Company with respect to any and all matters presented to the shareholders of the Company for their action or consideration, including the election of directors, holders of Series A Convertible Preferred Shares shall vote together with the holders of common shares as a single class.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 18. INCOME TAXES\nDeferred tax assets and liabilities are computed by applying the effective U.S. federal income tax rate to the gross amounts of temporary differences and other tax attributes. Deferred tax assets and liabilities relating to state income taxes are not material. In assessing the realizability of deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. Management considers the scheduled reversal of deferred tax liabilities, projected future taxable income, and tax planning strategies in making this assessment. As of June 30, 2022 and 2021, the Company believed it was more likely than not that future tax benefits from net operating loss carryforwards and other deferred tax assets would not be realizable through generation of future taxable income; therefore, they were fully reserved.\nThe components of deferred tax assets and liabilities at June 30, 2022 and 2021 are approximately as follows:\n(in thousands)\nDeferred tax assets:\nInventory reserves\n$ 46\n$ 45\nAllowance for doubtful accounts\nStock-based compensation\nNet operating loss carry-forwards\n1,233\n1,384\nTotal gross deferred tax assets\n1,387\n1,543\nValuation allowance\n(1,387 )\n(1,543 )\nNet deferred tax assets\n$ -\n$ -\nThe income tax provision differs from the amount of income tax determined by applying the U.S. federal and state income tax rates of 25% to pretax (income) loss from operations for the years ended June 30, 2022 and 2021 due to the following:\nNet (income) loss\n$ (156 )\n$ (660 )\nPermanent differences and change in tax rate estimate\n-\nValuation (allowance)\nNet tax benefit\n$ -\n$ -\nAt June 30, 2022, the Company had net operating loss (NOL) carryforwards of approximately $4.7 million that may be offset against future taxable income. During 2022 and 2021, the total change in the valuation allowance was approximately $156,000 and $378,000, respectively. The Companys ability to use its NOL carryforwards may be substantially limited due to ownership change limitations that may have occurred or that could occur in the future, as required by Section 382 of the Internal Revenue Code of 1986, as amended (the Code), as well as similar state provisions. These ownership changes may limit the amount of NOL that can be utilized annually to offset future taxable income and tax, respectively. In general, an ownership change as defined by Section 382 of the Code results from a transaction or series of transactions over a three-year period resulting in an ownership change of more than 50.0% of the outstanding stock of a company by certain stockholders or public groups.\nLuvu Brands, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended June 30, 2022 and 2021\nNOTE 18. INCOME TAXES (continued)\nThe Company has not completed a study to assess whether an ownership change has occurred or whether there have been multiple ownership changes since the Company became a loss corporation under the definition of Section 382. If the Company has experienced an ownership change, utilization of the NOL carryforwards would be subject to an annual limitation under Section 382 of the Code, which is determined by first multiplying the value of the Companys stock at the time of the ownership change by the applicable long-term, tax-exempt rate, and then could be subject to additional adjustments, as required. Any limitation may result in expiration of a portion of the NOL carryforwards before utilization. Further, until a study is completed and any limitation known, no positions related to limitations are being considered as an uncertain tax position or disclosed as an unrecognized tax benefit. Any carryforwards that expire prior to utilization as a result of such limitations will be removed from deferred tax assets with a corresponding reduction of the valuation allowance. Due to the existence of the valuation allowance, it is not expected that any possible limitation will have an impact on the results of operations or financial position of the Company. The NOL carryforwards of approximately $4.7 million can be carried forward indefinitely, but are limited to 80% of taxable income in any one year.\nThe tax years that remain subject to examination by major taxing jurisdictions are those for the years ended June 30, 2013 through 2022. The Company has not filed its Federal or State tax returns for 2017 through 2021 but expects to file these returns before the end of calendar year 2022.\nNOTE 19. - SUBSEQUENT EVENTS\nThere are no events required to be disclosed under this Item. ITEM 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nThere are no events required to be disclosed under this Item. ITEM 9A. Controls and Procedures.\n(a) Evaluation of Disclosure Controls and Procedures\nWe maintain certain disclosure controls and procedures as defined under the Securities Exchange Act of 1934. They are designed to help ensure that material information is: (1) gathered and communicated to our management, including our principal executive and financial officers, in a manner that allows for timely decisions regarding required disclosures; and (2) recorded, processed, summarized, reported and filed with the SEC as required under the Securities Exchange Act of 1934 and within the time periods specified by the SEC.\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of June 30, 2022. Based on such evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of June 30, 2022.\n(b) Managements Annual Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting for the Company, and for performing an assessment of the effectiveness of internal control over financial reporting as of June 30, 2022. For this purpose, internal control over financial reporting refers to a process designed by, or under the supervision of, the Companys principal executive and financial officers and effected by the Companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. Internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material adverse effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement performed an assessment of the effectiveness of the Companys internal control over financial reporting as of June 30, 2022 based upon criteria in an Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, management believes the Companys internal control over financial reporting was effective as of June 30, 2022 based on the criteria issued by COSO.\nThis Annual Report on Form 10-K does not include an attestation report of the Companys registered public accounting firm. Our independent registered public accounting firm will not be required to formally attest to the effectiveness of our internal control over financial reporting as long as we are an emerging growth company pursuant to the provisions of the JOBS Act.\n(c) Changes in Internal Control Over Financial Reporting\nThere were no changes to our internal control over financial reporting during the fourth quarter ended June 30, 2022 that have materially affected, or that are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. Other Information.\nNone.\nPART III. ITEM 10. Directors, Executive Officers and Corporate Governance.\nThe following table sets forth the officers and directors of Luvu Brands, Inc. as of June 30, 2022.\nName\nAge\nPosition\nLouis S. Friedman\nChief Executive Officer, President, Director\nAlexander A. Sannikov\nChief Financial Officer\nLeslie S. Vogelman\nTreasurer\nAll directors serve for one-year terms until their successors are elected or they are re-elected at the annual shareholders meeting. Officers hold their positions at the pleasure of the board of directors.\nThere is no arrangement, agreement or understanding between any of the directors or officers and any other person pursuant to which any director or officer was or is to be selected as a director or officer. Also, there is no arrangement, agreement or understanding between management and non-management shareholders under which non-management shareholders may directly or indirectly participate in or influence the management of our affairs.\nDirectors are not presently compensated for their service on the board, other than the repayment of actual expenses incurred. There are no present plans to compensate directors for their service on the board.\nBackground of Executive Officers and Directors\nLouis S. Friedman, President, Chief Executive Officer and Director. Mr. Friedman has served as President, Chief Executive Officer, and director since our merger with Old Liberator in October 2009. Prior to that, he served as Old Liberators Chief Executive Officer and a director since June 2009, when OneUp Innovations, Inc. merged with Old Liberator in June 2009. Mr. Friedman founded OneUp in 2000. Before starting OneUp, Mr. Friedman was in business consulting, venture capital and private investing from 1990 to 2000. Earlier in his career, Mr. Friedman was Executive Vice President of Chemtronics, Inc., until its sale to Morgan Crucible in 1990. Mr. Friedmans experience as Chief Executive Officer and insight into our operations, our industry, and related risks as well as experience bringing consumer products to market were factors considered by our board of directors in concluding he should serve as a director of our Company.\nAlexander A. Sannikov, Chief Financial Officer. Mr. Sannikov joined the Company in April 2022. From 2021 to 2022, Mr. Sannikov was Finance Director of The Weather Group. Prior to The Weather Group, Mr. Sannikov held multiple finance leadership positions at AMES Taping Tools, FiberLight, and Cox Communications. Mr. Sannikov holds a B.B.A. degree in Finance and an M.B.A. degree with concentration in Finance from Georgia State University.\nLeslie Vogelman, Treasurer. Ms. Vogelman joined the Company in October 2009 in connection with our merger with Old Luvu Brands, Inc. Prior to that, she served as Old Liberators Treasurer since June 2009, when OneUp Innovations, Inc. merged with Old Liberator in June 2009. Ms. Vogelman joined OneUp at its inception in 2000 as Secretary and Treasurer. Ms. Vogelman holds a B.A. from the State University of New York in Binghamton and an M.B.A. from Adelphi University.\nThe experience and background of our director, as summarized above, were significant factors in such director previously being nominated a director of the Company.\nFamily Relationships\nLouis Friedman, our President, Chief Executive Officer and Chairman, and Leslie Vogelman, our Treasurer, are husband and wife.\nThere are no other relationships between the officers or directors of the Company.\nCommittees\nAs of the date of this report, we have not established an audit committee or any other committee of the board of directors and, therefore, the responsibilities of such committees have been conducted by our board of directors as a whole.\nWe may, in the future, establish an audit committee and/or other committees of the board of directors. We currently do not have any independent directors.\nAudit Committee Financial Expert\nIn general, an audit committee financial expert is an individual who:\n·\nunderstands generally accepted accounting principles and financial statements,\n·\nis able to assess the general application of such principles in connection with accounting for estimates, accruals and reserves,\n·\nhas experience preparing, auditing, analyzing or evaluating financial statements comparable to the breadth and complexity of our financial statements,\n·\nunderstands internal controls over financial reporting, and\n·\nunderstands audit committee functions.\nOur board of directors has determined that Louis Friedman, our sole Director, is not an audit committee financial expert within the meaning of the foregoing definition.\nDiversity\nWe only have one member on our board of directors, but we hope to add more members for a diverse board in terms of previous business experience and educational and personal background of the members of our board. While the Company does not have a policy regarding diversity of its board members, diversity is one of a number of factors that will be taken into account in identifying board nominees.\nDirectors Compensation\nFor the fiscal years ended June 30, 2022 and 2021, our directors did not receive any compensation in their capacity as a director.\nCompliance with Section 16(a) of the Exchange Act\nSection 16(a) of the Exchange Act requires our executive officers, directors, and persons who beneficially own more than 10% of a registered class of our equity securities to file with the SEC initial statements of beneficial ownership, reports of changes in ownership, and annual reports concerning their ownership of our common shares and other equity securities on Forms 3, 4, and 5 respectively. Executive officers, directors, and greater than 10% shareholders are required by SEC regulations to furnish us with copies of all Section 16(a) reports they file. Based on a review of the copies of such forms received by us, and to the best of our knowledge, there were no reports untimely filed during the fiscal year ended June 30, 2022, except as provided below.\nOn February 23, 2022, the three executive officers of the Company each filed a Form 4 to disclose the exercise of options. Such Form 4s were each filed late due to administrative error.\nCode of Ethics\nWe have not yet adopted a Code of Business Conduct and Ethics. We are currently working towards developing a formal Code of Business Conduct and Ethics, which will apply to all of our employees, including our board of directors. When available, a copy of our Code of Business Conduct and Ethics may, upon request made to us in writing at the following address, be made available without charge: 2745 Bankers Industrial Drive, Atlanta, Georgia, 30360. ITEM 11. Executive Compensation.\nSummary Compensation Table\nThe following summary compensation table indicates the cash and non-cash compensation earned during the fiscal years ended June 30, 2022 and 2021 by our named executive officers as defined in Item 402(a) of Regulation S-K (each an NEO).\nFiscal\nSalary\nBonus\nStock\nAwards\nOption\nAwards\nNon-Equity\nIncentive Plan\nCompensation\nAll Other\nComp-\nensation\nTotal\nName and Principal Position\nYear\n($)\n($)\n($)\n($)(1)\n($)\n($)\n($)\nLouis S. Friedman\n150,000\n-\n-\n-\n-\n-\n150,000\nPresident, Chief Executive\n150,000\n-\n-\n-\n-\n-\n150,000\nOfficer and Chairman of the Board\nAlexander A. Sannikov (2)\n31,154\n-\n-\n50,000\n-\n-\n81,154\nChief Financial Officer\n-\n-\n-\n-\n-\n-\n-\nRonald P. Scott (3)\n123,722\n-\n-\n-\n-\n-\n123,722\nChief Financial Officer\n145,000\n-\n-\n-\n-\n-\n145,000\nManuel Munoz (4)\n145,000\n-\n-\n-\n-\n-\n145,000\nChief Information Officer\n144,231\n-\n-\n-\n-\n-\n144,231\n(1) The amounts reported in this column represent the full grant date fair value of stock awards in accordance with ASC 718, net of estimated forfeitures. Refer to Note 17 of the financial statements included in Item 8 of this Annual Report for the assumptions made in the valuation of stock awards. See Grants of Plan-Based Awards table below.\n(2) On April 26, 2022, the Company appointed Alexander A. Sannikov Chief Financial Officer of the Company effective April 29, 2022.\n(3) Ronald P. Scott resigned as Companys Chief Financial Officer and member of the board of directors on April 29, 2022.\n(4) Effective September 13, 2021, Manuel Munoz transitioned to a nonexecutive position and is no longer an executive officer.\nGrants of Plan-Based Awards\nThe following table summarizes information concerning each grant of an award made in our fiscal year ending June 30, 2022 to each of our NEOs:\nName\nGrant Date\nAll Other Option Awards:\nNumber of Securities\nUnderlying Options\n(#)\nExercise or\nbase price of\noption\nawards per\nshare\n($)\nGrant Date Fair\nValue of Stock\nand Option\nAwards\n($)\nAlexander A. Sannikov\n4/11/2022\n250,000\n0.20\n50,000\n.\nOutstanding Equity Awards at Fiscal Year End\nThe following table shows, for the fiscal year ended June 30, 2022, certain information regarding outstanding equity awards at fiscal year-end for our NEOs.\nOutstanding Equity Awards at June 30, 2022\nOption Awards\nStock Awards\nName\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nExercisable\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nUnexercisable\nOption\nExercise\nPrice ($)\nOption\nExpiration\nDate\nNumber of\nShares\nor Units of\nStock\nThat Have Not\nVested (#)\nMarket\nValue\nof Shares\nor\nUnits of\nStock\nThat Have\nNot Vested\n($)\nLouis S. Friedman\n200,000\n-\n$ .028\n12/11/2022(1)\n-\n-\nAlexander A. Sannikov\n-\n250,000\n$ .200\n4/11/2027(2)\n-\n-\n(1)\nThe common stock option vested pro rata over a four-year period on each of December 11, 2018, December 11, 2019, December 11, 2020 and December 11, 2021.\n(2)\nThe common stock option vests pro rata over a four-year period on each of April 11, 2023, April 11, 2024, April 11, 2025, and April 11, 2026.\nIncentive and Non-qualified Stock Option and Stock Award Plans\nAt June 30, 2022 we had options outstanding under the 2015 Equity Incentive Plan. Please see Note 17 to the notes to our financial statements appearing elsewhere in this report for a description of the material terms of this plan.\nEmployment Agreement\nThe Company has entered into an employment agreement with Louis Friedman, President and Chief Executive Officer. The agreement provides for an annual base salary of $150,000 and eligibility to receive a bonus, should the Company implement a bonus plan for executives. Under the agreement, this executive employee may be terminated at any time with or without cause, or by reason of death or disability. In certain termination situations, the Company is liable to pay severance compensation to this executive for up to 9 months.\nThe Company has not entered into a formal written employment agreement with Alexander Sannikov, Chief Financial Officer, however, on April 11, 2022, Mr. Sannikov entered into a Stock Option Agreement pursuant to the Companys 2015 Equity Incentive Plan granting him an incentive stock option for an aggregate of 250,000 shares of our common stock, 62,500 shares exercisable on April 11 of each year, beginning 2023 through 2026, at an exercise price of $0.20 per share. The option is exercisable for a period of 5 years from the initial grant date. ITEM 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nOur voting securities include shares of our common stock and our Series A Convertible Preferred Stock. The following table sets forth certain information known to us with respect to the beneficial ownership of our common stock by:\n·\nall persons who are beneficial owners of five percent (5%) or more of any class of our voting securities;\n·\neach of our directors;\n·\neach of our Named Executive Officers; and\n·\nall current directors and executive officers as a group.\nExcept as otherwise indicated, and subject to applicable community property laws, the persons named in the table below have sole voting and investment power with respect to all shares of our securities held by them.\nApplicable percentage ownership in the following table is based on 76,046,249 shares of common stock and 4,300,000 shares of Series A Convertible Preferred Stock outstanding as of October 12, 2022.\nBeneficial ownership is determined in accordance with the rules of the SEC. In computing the number of shares beneficially owned by a person and the percentage ownership of that person, shares of common stock subject to options held by that person that are currently exercisable or exercisable within 60 days of October 12, 2022, are deemed outstanding. Such shares, however, are not deemed outstanding for the purpose of computing the percentage ownership of any other person. Unless otherwise disclosed these persons address is c/o Luvu Brands, Inc., 2745 Bankers Industrial Drive, Atlanta, GA 30360.\nTitle of\nClass\nName and Address of Beneficial\nOwner\nAmount and Nature of\nBeneficial Ownership\nPercent\nof Class\nExecutive Officers and Directors\nCommon\nLouis S. Friedman\n36,397,233\n(1)\n45.2\n%\nCommon\nAlexander A. Sannikov\n(2)\n*\nCommon\nLeslie Vogelman\n596,428\n(3)\n*\nCommon\nAll directors and executive officers as a group (3 persons)\n36,993,661\n45.9\n%\n5% Shareholders\nCommon\nHope Capital, Inc.\n5,384,933\n(4)\n7.1\n%\nExecutive Officers and Directors\nSeries A Convertible Preferred Stock\nLouis S. Friedman\n4,300,000\n(5)\n100.0\n%\nSeries A Convertible Preferred Stock\nAlexander A. Sannikov\n0.0\n%\nSeries A Convertible Preferred Stock\nLeslie Vogelman\n0.0\n%\nSeries A Convertible Preferred Stock\nAll directors and executive officers as a group (3 persons)\n4,300,000\n(5)\n100.0\n%\n* Less than 1%\n(1)\nIncludes 4,300,000 shares of common stock issuable upon conversion of 4,300,000 shares of Series A Convertible Preferred stock at the discretion of the holder. Mr. Friedman owns 100% of the Series A Convertible Preferred Stock, each share of which has the number of votes equal to the result of: (i) the number of shares of common stock of the Company issued and outstanding at the time of such vote multiplied by 1.01; divided by (ii) the total number of Series A Convertible Preferred Stock issued and outstanding at the time of such vote. Accordingly, Mr. Friedman will own 71.2 % of the combined voting power of the common stock and Series A Convertible Preferred Stock, voting as a single class and will control the outcome of any corporate transaction or other matter submitted to the shareholders for approval, including mergers, consolidations and the sale of all or substantially all of our assets, and also the power to prevent or cause a change in control. The interests of Mr. Friedman may differ from the interests of the other shareholders. Also includes options for purchase 200,000 shares of common stock.\n(2)\nExcludes 250,000 shares of common stock underlying options that are subject to vesting.\n(3)\nIncludes options to purchase 125,000 shares of common stock. Ms. Vogelman disclaims any beneficial ownership of shares held by Louis S. Friedman.\n(4)\nThis persons address is 111 Great Neck Road, Suite 216, Great Neck, NY 11021. Curt Kramer is the sole shareholder of Hope Capital, Inc. and the natural control person over these securities.\n(5)\nMr. Friedman owns 100% of the Series A Convertible Preferred Stock, each share of which has the number of votes equal to the result of: (i) the number of shares of common stock of the Company issued and outstanding at the time of such vote multiplied by 1.01; divided by (ii) the total number of Series A Convertible Preferred Stock issued and outstanding at the time of such vote. Accordingly, Mr. Friedman will own 71.1 % of the combined voting power of the common stock and Series A Convertible Preferred Stock, voting as a single class and will control the outcome of any corporate transaction or other matter submitted to the shareholders for approval, including mergers, consolidations and the sale of all or substantially all of our assets, and also the power to prevent or cause a change in control. The interests of Mr. Friedman may differ from the interests of the other shareholders.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe following table sets forth securities authorized for issuance under any equity compensation plan approved by our shareholders as well as any equity compensation plans not approved by our stockholders as of June 30, 2022.\nNumber of securities to\nbe issued upon exercise\nof outstanding options,\nwarrants and rights\n(a)\nWeighted average\nexercise price of\noutstanding options,\nwarrants and rights\n(b)\nNumber of securities\nremaining available for\nfuture issuance under\nequity compensation\nplans (excluding\nsecurities reflected in\ncolumn (a)\n(c)\nPlan category\nPlans approved by stockholders:\n2015 Equity Incentive Plan\n1,975,000\n.10\n250,000 ITEM 13. Certain Relationships and Related Transactions, and Director Independence.\nRelated Party Transactions - refer to Note 16 in the Notes to Consolidated Financial Statements\nDirector Independence\nOur board of directors has determined that none of its current members qualifies as independent as the term is used in Item 407 of Regulation S-K as promulgated by the SEC or under Nasdaqs Marketplace Rule 5605(a)(2). ITEM 14. Principal Accounting Fees and Services.\nThe aggregate fees billed by our principal accountant for each of the last two fiscal years for Audit Fees, Audit-Related Fees, Tax Fees and All Other Fees are as follows:\nFiscal Year Ended June 30,\n(in thousands)\nAudit Fees (1)\n$ 42\n$ 42\nAudit-Related Fees (2)\n$ -\n$ -\nTax Fees (3)\n$ -\n$ -\nAll Other Fees (4)\n$ -\n$ -\n(1)\nAudit Fees - This category includes the audit of our annual financial statements, review of financial statements included in our Quarterly Reports on Form 10-Q, and services that are normally provided by independent auditors in connection with the engagement for fiscal years. This category also includes advice on audit and accounting matters that arose during, or as a result of, the audit or the review of interim financial statements.\n(2)\nAudit-Related Fees - This category consists of assurance and related services by our independent auditors that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees. The services for the fees disclosed under this category include consultation regarding our correspondence with the SEC.\n(3)\nTax Fees - This category consists of professional services rendered by our independent auditors for tax compliance and tax advice. The services for the fees disclosed under this category include tax return preparation and technical tax advice.\n(4)\nAll Other Fees - This category consists of fees for other miscellaneous items.\nOur board of directors reviews and approves audit and permissible non-audit services performed by its independent accountants, as well as the fees charged for such services. In its review of non-audit service fees and its appointment of Liggett & Webb P.A. as our independent accountants, the Board considered whether the provision of such services is compatible with maintaining independence. All of the services provided and fees charged by Liggett & Webb P.A. were approved by the Board.\nPART IV ITEM 15. Exhibits, Financial Statement Schedules.\n(a) Financial Statements; Schedules\nOur consolidated financial statements for the fiscal years ended June 30, 2022 and 2021 begin on page of this annual report. We are not required to file any financial statement schedules.\n(b) Exhibits.\nIncorporated by Reference\nFiled or\nNo.\nExhibit Description\nForm\nDate Filed\nNumber\nFurnished\nHerewith\n2.1\nMerger and Recapitalization Agreement between WES Consulting, Inc., the majority shareholder of WES Consulting, Inc., Luvu Brands, Inc., and the majority shareholder of Luvu Brands, Inc., dated as of October 19, 2009\n8-K\n10/22/09\n2.1\n2.2\nStock Purchase and Recapitalization Agreement between OneUp Acquisition, Inc., Remark Enterprises, Inc., OneUp Innovations, Inc., and Louis S. Friedman, dated March 31, 2009 and fully executed on April 3, 2009\n8-K/A\n3/24/10\n2.2\n2.3\nAmendment No. 1 to Stock Purchase and Recapitalization Agreement, dated June 22, 2009\n8-K/A\n3/24/10\n2.3\n3.1\nAmended and Restated Articles of Incorporation\nSB-2\n3/2/07\n3i\n3.2\nBylaws\nSB-2\n3/2/07\n3ii\n3.3\nArticles of Amendment to the Amended and Restated Articles of Incorporation\n8-K\n2/23/11\n3.1\n3.4\nArticles of Amendment to the Amended and Restated Articles of Incorporation, effective February 28, 2011\n8-K\n3/3/11\n3.1\n4.1\nDesignation of Rights and Preferences of Series A Convertible Preferred Stock.\n8-K\n2/23/11\n4.1\n10.1\nReceivables Financing Agreement between One Up Innovations, Inc. and Advance Financial Corporation, dated May 24, 2011\n10-K\n10/12/11\n10.17\n10.2\nGuarantee between Luvu Brands, Inc. and Advance Financial Corporation, dated May 24, 2011\n10-K\n10/12/11\n10.18\n10.3\nGuarantee between Foam Labs, Inc. and Advance Financial Corporation, dated May 24, 2011\n10-K\n10/12/11\n10.20\n10.4\nGuarantee between Louis S. Friedman and Advance Financial Corporation, dated May 24, 2011\n10-K\n10/12/11\n10.21\n10.5\nAmended and Restated Receivable Financing Agreement between One Up Innovations, Inc. and Advance Financial Corporation, dated September 4, 2013\n10-K\n9/30/13\n10.8\n10.6\nForm of promissory note\n10-K\n10/11/19\n10.11\n10.7\nEmployment Agreement between the Company and Louis Friedman dated January 27, 2021\n8-K\n2/2/11\n10.3\n10.8\n2015 Equity Incentive Plan\nDEF14C\n10/9/15\nB\n10.9\nU.S. Small Business Administration Note by One Up Innovations, Inc. in favor of Ameris Bank\n8-K\n4/28/20\n10.1\n10.10\nLease Agreement between Goodsen Land Partners, LLC and OneUp Innovations, Inc. dated November 20, 2020\n10-Q\n11/12/20\n10.1\n21.1\nSubsidiaries\n10-K\n9/29/14\n21.1\n23.1\nConsent of Liggett & Webb P.A. independent registered public accounting firm\nFiled\n31.1\nSection 302 Certificate of Chief Executive Officer\nFiled\n31.2\nSection 302 Certificate of Chief Financial Officer\nFiled\n32.1\nSection 906 Certificate of Chief Executive Officer\nFiled\n32.2\nSection 906 Certificate of Chief Financial Officer\nFiled\n101.INS\nXBRL Instance Document\nFiled\n101.SCH\nXBRL Taxonomy Extension Schema Document\nFiled\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\nFiled\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\nFiled\n101.LAB\nXBRL Taxonomy Extension Labels Linkbase Document\nFiled\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\nFiled\nITEM 16. Form 10-K Summary.\nThe Company elected not to provide the summary information.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nLUVU BRANDS, INC.\nDate: October 13, 2022\nBy:\n/s/ Louis S. Friedman\nLouis S. Friedman, Chief Executive Officer and President\nDate: October 13, 2022\nBy:\n/s/ Alexander A. Sannikov\nAlexander A. Sannikov, Chief Financial Officer\n(Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nNAME\nTITLE\nDATE\n/s/ Louis S. Friedman\nChairman of the Board of Directors, Chief Executive Officer,\nand President (Principal Executive Officer)\nOctober 13, 2022\nLouis S. Friedman"
}