{
    "cik": "1374328",
    "company": "FITLIFE BRANDS, INC.",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2021-12-31",
    "sic": "2833",
    "state_of_inc": "NV",
    "state_location": "NE",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1374328/0001851734-22-000612-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1374328/000185173422000612/ftlf20211231_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1374328/0001851734-22-000612.txt",
    "filename": "1374328_10K_2021_0001851734-22-000612.htm",
    "content": "ITEM 1. BUSINESS\nAs used in this Annual Report, we, us, our, FitLife, FitLife Brands, the Company or our company refers to FitLife Brands, Inc. and all of its subsidiaries.\nOverview\nFitLife Brands, Inc. (the Company) is a national provider of innovative and proprietary nutritional supplements for health-conscious consumers marketed under the following brand names: (i) NDS Nutrition, PMD Sports, SirenLabs, CoreActive, Nutrology, and Metis Nutrition (together, NDS Products); and (ii) iSatori, BioGenetic Laboratories, and Energize (together, the \"iSatori Products\"). The Company distributes the NDS Products principally through franchised General Nutrition Centers, Inc. (GNC) stores located both domestically and internationally, and, with the launch of Metis Nutrition, through corporate GNC stores in the United States. The iSatori Products are sold through more than 17,000 retail locations, which include specialty, mass, and online.\nFitLife Brands is headquartered in Omaha, Nebraska. For more information on the Company, please go to www.fitlifebrands.com. The Companys Common Stock, par value $0.01 per share (Common Stock), trades under the symbol FTLF on the OTC Pink market.\nRecent Developments\nForward Stock Split\nThe Board of Directors of the Company (the Board) approved a forward stock split of the Companys authorized, issued and outstanding shares of common stock, par value $0.01 per share (the Common Stock), at a ratio of 4-for-1 (the Forward Split). The Forward Split was effective as of December 2, 2021 and began trading on such basis on December 8, 2021. Prior to the Forward Split, the Company was authorized to issue 15.0 million shares of Common Stock. As a result of the Forward Split, the Company is now authorized to issue 60.0 million shares of Common Stock. The Forward Split did not have any effect on the stated par value of the Common Stock and did not affect the Companys authorized preferred stock.\nAll references in this Annual Report to number of common shares, price per share and weighted average number of shares outstanding have been adjusted to reflect the Forward Split on a retroactive basis as of the earliest period presented, unless otherwise noted.\nNutrology Asset Purchase\nOn April 7, 2021, the Company purchased substantially all of the assets of Triple Impact Corporation, a New Jersey corporation doing business as Nutrology, a nutritional supplement company catering to consumers who prioritize all-natural and plant-based nutritional supplements. See Note 3 for additional detail regarding the acquisition.\nTax Benefits Preservation Plan\nOn February 26, 2021, the Board declared a dividend distribution of one right (a Right) for each outstanding share of Common Stock to stockholders of record at the close of business on February 26, 2021 (the Record Date). Each Right entitles its holder, under the circumstances described below, to purchase from the Company one one-thousandth of a share of Series B Junior Participating Preferred Stock of the Company, par value $0.01 per share (the Series B Preferred), at an exercise price of $100.00 per Right, subject to adjustment. The description and terms of the Rights are set forth in the tax benefits preservation plan (the Tax Benefits Preservation Plan), dated as of February 26, 2021, between the Company and Colonial Stock, as rights agent (and any successor rights agent, the Rights Agent).\nThe Company adopted the Tax Benefits Preservation Plan in order to protect shareholder value against a possible limitation on the Companys ability to use its Net Operating Losses (NOLs) and certain other tax benefits to reduce potential future U.S. federal income tax obligations. The NOLs are a valuable asset to the Company, which may inure to the benefit of the Company and its stockholders. However, if the Company experiences an ownership change, as defined in Section 382 of the Internal Revenue Code (IRC), its ability to fully utilize the NOLs and certain other tax benefits will be substantially limited and the timing of the usage of the NOLs and such other benefits could be substantially delayed, which could significantly impair the value of those assets. Generally, an ownership change occurs if the percentage of the Companys stock owned by one or more of its five-percent shareholders (as such term is defined in Section 382 of the IRC) increases by more than 50 percentage points over the lowest percentage of stock owned by such stockholder or stockholders at any time over a three-year period. The Tax Benefits Preservation Plan is intended to prevent against such an ownership change by deterring any person or group from acquiring beneficial ownership of 4.99% or more of the Companys securities. Subsequent to the end of the fiscal year, the Tax Benefits Preservation Plan expired by its terms on March 1, 2022 and is no longer in effect.\nShare Repurchase Plan\nOn February 1, 2021, the Board approved an additional amendment to the authorized share repurchase program initially approved by the Board on August 16, 2019, as amended on September 23, 2019 and November 6, 2019 (Share Repurchase Program). Under the terms of the amendment, the Company is authorized to repurchase up to $5.0 million of the Company's Common Stock, warrants to purchase shares of the Company's Common Stock (\"Warrants\"), and other securities issued by the Company (\"Securities\") over the next 24 months at a purchase price, in the case of Common Stock, equal to the fair market value of the Company's Common Stock on the date of purchase, and in the case of Warrants and Securities, at a purchase price determined by management, with the exact date and amount of such purchases to be determined by management.\nDuring the year ended December 31, 2021, the Company repurchased 36,092 shares of Common Stock under the Share Repurchase Program. The Company also purchased 50,840 dilutive in-the-money options from employees at a discount to their intrinsic value for total consideration of $184,000.\nTrade date\nTotal\nnumber\nof shares\npurchased\nAverage\nprice paid\nper share\nTotal\nnumber\nof shares\npurchased\nas part of\npublicly\nannounced\nprograms\nDollar\nvalue of\nshares that\nmay yet be\npurchased\nFirst quarter ended March 31, 2021\n-\n$ -\n-\n$ 3,610,917\nSecond quarter ended June 30, 2021\n36,092\n$ 7.13\n36,092\n$ 3,169,917\nThird quarter ended September 30, 2021\n-\n$ -\n-\n$ 3,169,917\nFourth quarter ended December 31, 2021\n-\n$ -\n-\n$ 3,169,917\nSubtotal\n36,092\n$ 7.13\n36,092\n$ 3,169,917\nCOVID-19 Pandemic\nThe COVID-19 pandemic has had an effect on the Companys employees, business and operations and those of its customers, vendors and business partners. In this respect, the temporary or permanent closure of some of our retail partners store locations and the stay-at-home orders that occurred early in the pandemic negatively affected our results from operations, although much of the impact has been offset by an increase in revenue attributable to online sales, and increased sales during the more recent quarters. Our future financial position and operating results could be materially and adversely affected in the event that a resurgence of COVID-19 cases leads to new stay-at-home orders and/or further disruptions in both our supply chain and manufacturing lead-times, which could lower demand for the Companys products and/or prevent the Company from producing and delivering its products in a timely manner, although the extent of these effects cannot be determined at this time. The Company expects to continue to assess the evolving impact of the COVID-19 pandemic and intends to make adjustments to its business and operations accordingly.\nCARES Act\nThe Coronavirus Aid, Relief, and Economic Security Act (\"CARES Act\") was enacted on March 27, 2020 in the United States. On April 27, 2020, the Company received proceeds from a loan in the amount of $449,700 from its lender, CIT Bank, N.A. (the PPP Lender), pursuant to approval by the U.S. Small Business Administration (the SBA) for the PPP Lender to fund the Companys request for a loan under the SBAs Paycheck Protection Program (PPP Loan) created as part of the CARES ACT administered by the SBA (the Loan Agreement). In accordance with the requirements of the CARES Act, the Company used the proceeds from the PPP Loan primarily for payroll costs, covered rent payments, and covered utilities during the eight-week period commencing on the date of loan approval. The PPP Loan was scheduled to mature on April 27, 2022, had a 1.0% interest rate, and was subject to the terms and conditions applicable to all loans made pursuant to the Paycheck Protection Program as administered by the SBA under the CARES Act. The Company was informed by the PPP Lender and the SBA that the full balance of the PPP Loan, including accrued interest, was forgiven on January 15, 2021.\nIndustry Overview\nWe compete principally in the nutrition industry. The Nutrition Business Journal categorizes the industry in the following segments:\n●\nNatural & Organic Foods (products such as cereals, milk, non-dairy beverages and frozen meals);\n●\nFunctional Foods (products with added ingredients or fortification specifically for health or performance purposes);\n●\nNatural & Organic Personal Care and Household Products; and\n●\nSupplements (products focused on sports nutrition and weight management).\nManagement believes that the following factors drive growth in the nutrition industry:\n●\nThe general publics awareness and understanding of the connection between diet and health;\n●\nThe aging population in the Companys markets who tend to use more nutritional supplements as they age;\n●\nIncreasing healthcare costs and the consequential trend toward preventative medicine and non-traditional medicines; and\n●\nProduct introductions in response to new scientific studies.\nOur Products\nThe Company currently focuses its sales and marketing efforts on its full line of sports, weight loss and general nutrition products that are currently marketed and sold both nationally and internationally. The Company currently markets more than 75 different NDS Products to more than 750 GNC franchise locations located in the United States, as well as to additional franchise locations in other countries, all of which are distributed through GNCs distribution system. In addition, following the launch of Metis Nutrition, we distribute products through more than 1,600 corporate GNC stores in the United States. We sell iSatori Products through more than 17,000 specialty, mass, and online retail locations. A complete product list is available on our website at fitlifebrands.com.\nNDS Products\nThe Companys NDS Products include:\n●\nNDS - Innovative weight loss, general health and sports nutrition supplements - examples include Censor, Cardio Cuts and LipoRUSH XT;\n●\nPMD - Precision sports nutrition formulations for professional muscular development - examples include Amplify XL, Pump Fuel and Flex Stack;\n●\nSiren Labs - Weight loss and sports nutrition performance enhancing supplements for fitness enthusiasts - examples include Shockd, Ultrakarbs, NeuroLean, and Vaso-Vol;\n●\nNutrology -Sports nutrition and general wellness formulations with an emphasis on natural, vegan, and organic ingredients - examples include Tripact Protein, Beet Natural, and Zen Natural; and\n●\nMetis Nutrition - Multifaceted mens health and weight loss formulations, including JXT5 and PyroStim.\nNDS Products also include innovative diet, health and sports nutrition supplements and related products marketed through its Core Active Nutrition product line (Core Active). Core Active products, which are sold exclusively online, provide essential support for accelerated fitness and nutrition goals.\niSatori Products\niSatori Products include scientifically engineered nutritional products that are sold online as well as through multiple retail partners. iSatori Products include:\n●\nSports Nutritionals: Products including Bio-Active Peptides (Bio-Gro™), advanced creatine powder (Creatine A5X), and a natural testosterone booster (Isa-TestGF™);\n●\nEnergy Products: iSatoris energy supplement, Energize, designed to safely boost energy through a combination of time-released caffeine, vitamins, and herbal formulations;\n●\nMeal Replacements: protein-based products related to health nutrition and performance, including iSatoris 100% Bio-Active Whey, a premium protein blend with Bio-Active Peptides; and\n●\nWeight Loss Products: iSatoris weight loss products are principally sold under the BioGenetic Laboratories brand and include Forskolin Lean & Tone™ and hCG Alternative, as well as iSatoris thermogenic, LIPO-DREX™ with C3G nutrient partitioning technology.\nManufacturing, Sources and Availability of Raw Materials\nAll of the Companys products are manufactured by FDA-regulated contract manufacturers within the United States and Canada. Each contract manufacturer is required by the Company to abide by current Good Manufacturing Practices (cGMPs) to ensure quality and consistency, and to manufacture its products according to the Companys strict specifications, and nearly all our contract manufacturers are certified through a governing body such as the NPA (Natural Products Association) or NSF International. In most cases, contract manufacturers purchase the raw materials based on the Companys specifications; however, from time to time, the Company will license particular raw material ingredients and supply its own source to the manufacturer. Once produced, in addition to in-house testing performed by the contract manufacturer, the Company may also perform independent analysis and testing. The contract manufacturer either ships the finished product to one of our fulfillment centers or directly to our customers. The Company has implemented vendor qualification programs for all of its suppliers and manufacturers, including analytical testing of purchased products. As part of the vendor program, the Company also periodically inspects vendors facilities to monitor quality control and assurance procedures.\nProduct Reformulations and New Product Identification\nFrom time to time we reformulate existing products to address market developments and trends, and to respond to customer requests. We also continually expand our product line through the development of new products. New product ideas are derived from a number of sources including trade publications, scientific and health journals, consultants, distributors, and other third parties. Prior to reformulating existing products or introducing new products, we investigate product formulations as they relate to regulatory compliance and other issues. We introduced a total of 15 new products during the year ended December 31, 2021, which included 4 completely new products, and 11 product reformulations and flavor extensions, and 32 new products during the year ended December 31, 2020, which included 12 completely new products, and 20 product reformulations and flavor extensions.\nManagement continually assesses and analyzes developing market trends to detect and proactively address what they believe are areas of unmet or growing demand that represent an opportunity for the Company and, where deemed appropriate, attempt to introduce new products and/or packaging solutions in direct response to meet that demand.\nSales, Marketing and Distribution\nNDS Products\nNDS Products are sold through more than 750 GNC franchise locations located throughout the United States. The Company also distributes NDS Products to additional franchise locations in other countries. On May 1, 2014, the Company transitioned the majority of its distribution of NDS Products to GNCs centralized distribution platform for all NDS Products, excluding protein products, which transitioned in mid-September 2014. Prior to the change, the majority of the Companys revenue was realized upon direct shipment of NDS Products to individual franchise locations. For the years ended December 31, 2021 and 2020, the majority of NDS Product sales were through GNCs centralized distribution platform.\nOur sales and marketing efforts are designed to expand sales of NDS Products to additional GNC franchise locations both domestically and internationally. In addition, we have recently relaunched our Core Active brand as a new online-exclusive brand. The GNC domestic franchise market remains the core of our operations. Management is committed to continue to work collaboratively with GNC and its franchisees to build on our established track record of growth and innovation.\niSatori Products\niSatori Products are distributed directly to consumers through the Company's own websites and through other e-commerce platforms such as Amazon.com, Inc. (\"Amazon\"), as well as through the specialty, drug and mass-market distribution channels. iSatori products are currently sold in over 17,000 retail locations.\nIn some cases, iSatori utilizes independent brokers, who work in conjunction with iSatoris experienced sales employees and management to oversee the drug and mass-market channels. iSatori sells its products to mass-market merchandisers either directly or through distributors of nutritional supplement products. In addition to the Companys online distribution channels for direct-to-consumer sales, major iSatori customers include CVS, GNC, Rite Aid, Vitamin Shoppe, Walgreens and Wal-Mart.\niSatoris core strategy is to build and strengthen brands among consumers seeking nutritional supplement products with a reputation for quality and innovation. iSatori utilizes social media campaigns, coupons, and online advertising, plus cooperative and other incentive programs, to build consumer awareness and generate trial and repeat purchases to drive sales revenue. Our marketing team regularly reviews the media mix for its effectiveness in creating consumer demand and the highest return on investment dollars.\nProduct Returns\nWe currently have a 30-day product return policy for NDS Products, which allows for a 100% sales price refund for the return of unopened and undamaged products purchased from us online through one of our websites. Product sold to GNC may be returned from store shelves or the distribution center in the event the product is damaged, short dated, expired or recalled. GNC maintains a customer satisfaction program that allows customers to return product to the store for credit or refund. Subject to certain terms and restrictions, GNC may require reimbursement from vendors for unsaleable returned product through either direct payment or credit against a future invoice. We also support a product return policy for iSatori Products, whereby customers can return product for credit or refund. Product returns can and do occur from time to time and can be material.\nCompetition\nThe nutrition industry is highly competitive, and the Company has many competitors that sell products similar to the Companys products. Many of the Companys competitors have significantly greater financial and human resources than our own. The Company seeks to differentiate its products and marketing from its competitors based on product quality, benefits, and functional ingredients. Patent and trademark applications that protect brands, product names, and new technologies are pursued whenever possible. While we cannot assure that such measures will block competitive products, we believe our continued emphasis on innovation and new product development targeted at the needs of the consumer will enable the Company to effectively compete in the marketplace.\nRegulatory Matters\nOur business is subject to varying degrees of regulation by a number of government authorities in the U.S., including the Federal Drug Administration (FDA), the Federal Trade Commission (FTC), the Consumer Product Safety Commission, the U.S. Department of Agriculture, and the Environmental Protection Agency. Various agencies of the states and localities in which we operate and in which our products are sold also regulate our business, such as the California Department of Health Services, Food and Drug Branch. The areas of our business that these and other authorities regulate include, among others:\n●\nproduct claims and advertising;\n●\nproduct labels;\n●\nproduct ingredients; and\n●\nhow we manufacture, package, distribute, import, export, sell, and store our products.\nThe FDA, in particular, regulates the formulation, manufacturing, packaging, storage, labeling, promotion, distribution and sale of vitamins and other nutritional supplements in the U.S., while the FTC regulates marketing and advertising claims. In August 2007, a new rule issued by the FDA went into effect requiring companies that manufacture, package, label, distribute or hold nutritional supplements to meet cGMPs to ensure such products are of the quality specified and are properly packaged and labeled. We are committed to meeting or exceeding the standards set by the FDA and believe we are currently operating within the FDA mandated cGMPs.\nThe FDA also regulates the labeling and marketing of dietary supplements and nutritional products, including the following:\n●\nthe identification of dietary supplements or nutritional products and their nutrition and ingredient labeling;\n●\nrequirements related to the wording used for claims about nutrients, health claims, and statements of nutritional support;\n●\nlabeling requirements for dietary supplements or nutritional products for which high potency and antioxidant claims are made;\n●\nnotification procedures for statements on dietary supplements or nutritional products; and\n●\npremarket notification procedures for new dietary ingredients in nutritional supplements.\nThe Dietary Supplement Health and Education Act of 1994 (DSHEA) revised the provisions of the Federal Food, Drug and Cosmetic Act (FDCA) concerning the composition and labeling of dietary supplements, and defined dietary supplements to include vitamins, minerals, herbs, amino acids and other dietary substances used to supplement diets. DSHEA generally provides a regulatory framework to help ensure safe, quality dietary supplements and the dissemination of accurate information about such products. The FDA is generally prohibited from regulating active ingredients in dietary supplements as drugs unless product claims, such as claims that a product may heal, mitigate, cure or prevent an illness, disease or malady, trigger drug status.\nDSHEA also permits statements of nutritional support to be included in labeling for nutritional supplements without FDA premarket approval. These statements must be submitted to the FDA within 30 days of marketing and must bear a label disclosure that includes the following: This statement has not been evaluated by the FDA. This product is not intended to diagnose, treat, cure, or prevent any disease. These statements may describe a benefit related to a nutrient deficiency disease, the role of a nutrient or nutritional ingredient intended to affect the structure or function in humans, the documented mechanism by which a nutrient or dietary ingredient acts to maintain such structure or function, or the general well-being from consumption of a nutrient or dietary ingredient, but may not expressly or implicitly represent that a nutritional supplement will diagnose, cure, mitigate, treat or prevent a disease. An entity that uses a statement of nutritional support in labeling must possess scientific evidence substantiating that the statement is truthful and not misleading. If the FDA determines that a particular statement of nutritional support is an unacceptable drug claim or an unauthorized version of a disease claim for a food product, or if the FDA determines that a particular claim is not adequately supported by existing scientific data or is false or misleading, we will be prevented from using the claim.\nIn addition, DSHEA provides that so-called third-party literature, for example a reprint of a peer-reviewed scientific publication linking a particular nutritional ingredient with health benefits, may be used in connection with the sale of a nutritional supplement to consumers without the literature being subject to regulation as labeling. Such literature must not be false or misleading; the literature may not promote a particular manufacturer or brand of nutritional supplement; the literature must present a balanced view of the available scientific information on the nutritional supplement; if displayed in an establishment, the literature must be physically separate from the nutritional supplement; and the literature may not have appended to it any information by sticker or any other method. If the literature fails to satisfy each of these requirements, we may be prevented from disseminating it with our products, and any dissemination could subject our products to regulatory action as an illegal drug. Moreover, any written or verbal representation by us that would associate a nutrient in a product that we sell with an effect on a disease will be deemed evidence of intent to sell the product as an unapproved new drug, a violation of the FDCA.\nIn December 2006, the Dietary Supplement and Nonprescription Drug Consumer Protection Act (DSNDCPA) was passed, which further revised the provisions of the FDCA. Under the act, manufacturers, packers or distributors whose name appears on the product label of a dietary supplement or nonprescription drug are required to include contact information on the product label for consumers to use in reporting adverse events associated with the products use and are required to notify the FDA of any serious adverse event report within 15 business days of receiving such report. Events reported to the FDA would not be considered an admission from a company that its product caused or contributed to the reported event. We are committed to meeting or exceeding the requirements of the DSNDCPA.\nWe are also subject to a variety of other regulations in the U.S., including those relating to bioterrorism, taxes, labor and employment, import and export, the environment, and intellectual property. All of these regulations require significant financial and operational resources to ensure compliance, and we cannot assure that we will always be in compliance despite our best efforts to do so.\nOur operations outside the U.S. are similarly regulated by various agencies and entities in the countries in which we operate and in which our products are sold. The regulations of these countries may conflict with those in the U.S. and may vary from country to country. The sale of our products in certain European countries is subject to the rules and regulations of the European Union, which may be interpreted differently among the countries within the European Union. In other markets outside the U.S., we may be required to obtain approvals, licenses or certifications from a countrys ministry of health or comparable agency before we begin operations or the marketing of products in that country. Approvals or licenses may be conditioned on the reformulation of our products for a particular market or may be unavailable for certain products or product ingredients. These regulations may limit our ability to enter certain markets outside the U.S. Similar to the costs of regulatory compliance in the U.S., foreign regulations require significant financial and operational resources to ensure compliance, and we cannot assure that we will always be in compliance despite our best efforts to do so. Our failure to maintain regulatory compliance within and outside the U.S. could impact our ability to sell our products, and thus, materially impact our financial position and results of operations.\nPatents, Trademarks and Proprietary Rights\nThe Company regards intellectual property, including its trademarks, service marks, website URLs (domains) and other proprietary rights, as valuable assets and part of its brand equity. The Company believes that protecting such intellectual property is crucial to its business strategy. The Company pursues registration of the registrable trademarks, service marks and patents, associated with its key products in the United States, Canada, Europe and other places it distributes its products.\nThe Company formulates its products using proprietary ingredient formulations, flavorings and delivery systems. To further protect its product formulations and flavors, the Company enters into agreements with manufacturers that provide exclusivity to certain products formulations and delivery technologies. When appropriate, the Company will seek to protect its research and development efforts by filing patent applications for proprietary product technologies or ingredient combinations. We have abandoned or not pursued efforts to register certain other patents and marks identifying other items in our product line for various reasons, including the inability of some names to qualify for registration or patent applications to qualify for patent protection, and due to our abandonment of certain such products. All trademark registrations are protected for a period of ten years and then are renewable thereafter if still in use.\nEmployees\nWe had 25 and 23 full-time employees as of December 31, 2021 and 2020, respectively. In addition, the Company retains consultants for certain services on an as-needed basis. We consider our employee relations to be good.\nCost of Compliance with Environmental Laws\nWe have not incurred any costs associated with compliance with environmental regulations, nor do we anticipate any future costs associated with environmental compliance; however, no assurances can be given that we will not incur such costs in the future.\nAvailable Information\nAs a public company, we are required to file our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements on Schedule 14A and other information (including any amendments) with the Securities and Exchange Commission (the SEC). The SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. You can find our SEC filings at the SECs website at www.sec.gov.\nOur Internet address is www.fitlifebrands.com. Information contained on our website is not part of this Annual Report. Our SEC filings (including any amendments) will be made available free of charge on www.fitlifebrands.com, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. ITEM 1A - Risk Factors\nAn investment in our securities involves a high degree of risk. You should carefully consider the following information about these risks, together with the other information contained in this Annual Report, before investing in our securities. If any of the events anticipated by the risks described below occur, our results of operations and financial condition could be adversely affected, which could result in a decline in the market price of our securities, causing you to lose all or part of your investment.\nRisk Factors Relating to our Business and Industry\nThe Company was profitable during the years ended December 31, 2021 and 2020. However, we may not be able to achieve sustained profitability. Our failure to sustain profitability or effectively manage growth could result in net losses, and therefore negatively affect our financial condition.\nIn the event of any decrease in sales, if we are not able to maintain growth, or if we are unable to effectively manage our growth, we may not be able to sustain profitability, and may incur net losses in the future, and those net losses could be material. In the event we incur net losses, our financial condition could be negatively affected, and such effect could be material.\nWe are currently dependent on sales to GNC for a substantial portion of our total sales.\nSales to GNCs centralized distribution platform, including indirect distribution of product to domestic and international franchisees, accounted for approximately 71% of our total sales for both years ended December 31, 2021 and 2020. GNCs franchisees are not required to carry our products. In the event GNC ceases purchasing products from us, or otherwise reduces its purchases, our total revenue will be negatively impacted, and such impact could be material. Moreover, the transition to GNCs centralized distribution system has had the effect of concentrating the majority of our accounts receivable with a single payor. Prior to the transition, we collected receivables directly from over 300 franchisees. We anticipate that GNC will continue to represent a substantial portion of all accounts receivable for the foreseeable future. In the event that our sales to GNC decrease, our results from operations will be negatively affected, and such effect may be material.\nOur ability to materially increase sales is largely dependent on the ability to increase sales of product to our wholesale partners as well as directly to the end consumer. We may invest significant amounts in these expansions with little success, and if we are unable to maintain good relationships with our existing customers and e-commerce platforms, our business could suffer.\nWe currently are focusing our marketing efforts on increasing the sale of products to GNC, both domestically and internationally, as well as increasing the number of retailers selling iSatori Products. In addition, we are focused on increasing our direct-to-consumer revenue through e-commerce platforms such as Amazon. We may not be able to successfully increase sales through these channels. Moreover, unilateral decisions could be taken by our distributors, customers, or third-party e-commerce platforms such as Amazon, to discontinue all or any of our products that they are carrying or selling at any time, which would cause our business to suffer. The inability to sell our products through e-commerce platforms, including Amazon, would materially impact our sales and operating results.\nIn addition, although we continued efforts to expand international distribution for our products in the years ended December 31, 2021 and 2020, we cannot assure that any further efforts to sell our products outside the United States will result in material increased revenue. We may need to overcome significant regulatory and legal barriers in order to continue to sell our products internationally, and we cannot give assurances as to whether we will be able to comply with such regulatory or legal requirements.\nWe are affected by extensive laws, governmental regulations, administrative determinations, court decisions and similar constraints, which can make compliance costly and subject us to enforcement actions by governmental agencies.\nThe formulation, manufacturing, packaging, labeling, holding, storage, distribution, advertising and sale of our products are affected by extensive laws, governmental regulations and policies, administrative determinations, court decisions and similar constraints at the federal, state and local levels, both within the United States and in any country where we conduct business. There can be no assurance that we or our wholesale partners will be in compliance with all of these regulations. A failure by us or our wholesale partners to comply with these laws and regulations could lead to governmental investigations, civil and criminal prosecutions, administrative hearings and court proceedings, civil and criminal penalties, injunctions against product sales or advertising, civil and criminal liability for the Company and/or its principals, bad publicity, and tort claims arising out of governmental or judicial findings of fact or conclusions of law adverse to the Company or its principals. In addition, the adoption of new regulations and policies or changes in the interpretations of existing regulations and policies may result in significant new compliance costs or discontinuation of product sales, and may adversely affect the marketing of our products, resulting in decreases in revenue.\nWe are currently dependent on a limited number of independent suppliers and manufacturers of our products, which may affect our ability to deliver our products in a timely manner. If we are not able to ensure timely product deliveries, potential distributors and customers may not order our products, and our revenue may decrease.\nWe rely on a limited number of third parties to supply and manufacture our products. Our products are manufactured on a purchase order basis only, and manufacturers can terminate their relationships with us at will. These third-party manufacturers may be unable to satisfy our supply requirements, manufacture our products on a timely basis, fill and ship our orders promptly, provide services at competitive costs, or offer reliable products and services. The failure to meet any of these critical needs would delay or reduce product shipment and adversely affect our revenue, as well as jeopardize our relationships with our distributors and customers. In the event any of our third-party manufacturers were to become unable or unwilling to continue to provide us with products in required volumes and at suitable quality levels, we would be required to identify and obtain acceptable replacement manufacturing sources. There is no assurance that we would be able to obtain alternative manufacturing sources on a timely basis. Additionally, our third-party manufacturers source the majority of the raw materials for our products and, if we were to use alternative manufacturers, we may not be able to duplicate the exact taste and consistency profile of the product from the original manufacturer. An extended interruption in the supply of our products would likely result in decreased product sales and a corresponding decline in revenue. We believe that we can meet our current supply and manufacturing requirements with our current suppliers and manufacturers or with available substitute suppliers and manufacturers.\nCOVID-19 has impacted global supply chains and such impacts have impacted us and our third-party suppliers and could have a material adverse impact on us in the future.\nThe coronavirus (COVID-19) pandemic has had a material impact on global supply chains, including for certain raw materials imported from China, among other countries, that have had an impact on our third-party suppliers and our wholesale partners. As a result, we have had to increase purchases in certain raw materials and build finished goods inventory, especially in our best-selling products, to avoid, in addition to other consequences, stockouts. The extent to which the ongoing supply chain challenges continue to impact our operations, those of our third-party suppliers or our wholesale partners will depend on future developments, which are highly uncertain and cannot be predicted. If the public continues to avoid public spaces, including retail stores, or if we, or any of our third-party suppliers continue to encounter challenges in the supply chain for certain raw materials, or incur disruptions to our or their respective operations, facilities or stores, or if our wholesale partners retail stores were to partially or fully close due to the coronavirus, which has previously occurred in the case of certain GNC locations, then the manufacture, supply, distribution and sale of our products and our financial results could be adversely affected.\nWe are dependent on our third-party manufacturers to supply our products in the compositions we require, and we do not independently analyze each production lot of our products. Any errors in our product manufacturing could result in product recalls, significant legal exposure, and reduced revenue.\nAlthough we require that our manufacturers verify the accuracy of the contents of our products, we do not have the expertise or personnel to monitor the production of products by these third parties. We rely primarily, with limited independent verification, on certificates of analysis regarding product content provided by our third-party suppliers and limited safety testing by them. We cannot be assured that these outside manufacturers will continue to reliably supply products to us in the compositions we require. Errors in the manufacture of our products could result in product recalls, significant legal exposure, adverse publicity, and decreased revenue.\nWe face significant competition from existing suppliers of products similar to ours. If we are not able to compete with these companies effectively, we may not be able to maintain profitability.\nWe face intense competition from numerous resellers, manufacturers and wholesalers of nutritional supplements similar to ours, including retail, online and mail-order providers. Many of our competitors have longer operating histories, more-established brands in the marketplace, revenue significantly greater than ours and better access to capital than we have. We anticipate that these competitors may use their resources to engage in various business activities that could result in reduced sales of our products. Companies with greater capital and research capabilities could re-formulate existing products or formulate new products that could gain wide marketplace acceptance, which could have a negative effect on our future sales. In addition, aggressive advertising and promotion by our competitors may require us to compete by lowering prices or by increasing our marketing expenditures, and the economic viability of our operations likely would be diminished.\nAdverse publicity associated with our products, ingredients, or those of similar companies, could adversely affect our sales and revenue.\nOur customers perception of the safety and quality of our products or even similar products distributed by others can be significantly influenced by national media attention, publicized scientific research or findings, product liability claims, and other publicity concerning our products or similar products distributed by others. Adverse publicity, whether or not accurate, that associates consumption of our products or any similar products with illness or other adverse effects will likely diminish the publics perception of our products. Claims that any products are ineffective, inappropriately labeled or have inaccurate instructions as to their use, could have a material adverse effect on the market demand for our products, including reducing our sales and revenue.\nThe efficiency of nutritional supplement products is supported by limited conclusive clinical studies, which could result in less market acceptance of these products and lower revenue or lower growth rates in revenue.\nOur nutritional supplement products are made from various ingredients, including vitamins, minerals, amino acids, herbs, botanicals, fruits, berries, and other substances for which there is a long history of human consumption. However, there is little long-term experience with human consumption of certain product ingredients or combinations of ingredients in concentrated form. Although we believe that all of our products fall within the generally known safe limits for daily doses of each ingredient contained within them, nutrition science is imperfect. Moreover, some people have peculiar sensitivities or reactions to nutrients commonly found in certain foods and may have similar sensitivities or reactions to nutrients contained in our products. Furthermore, nutrition science is subject to change based on new research. New scientific evidence may disprove the efficacy of our products or prove our products to have effects not previously known. We could be adversely affected by studies that may assert that our products are ineffective or harmful to consumers, or if adverse effects are associated with a competitors similar products.\nOur products may not meet health and safety standards or could become contaminated.\nWe do not have control over the third parties involved in the manufacturing of our products and their compliance with government health and safety standards. Even if our products meet these standards, they could otherwise become contaminated. A failure to meet these standards or contamination could occur in our operations or those of our distributors or suppliers. This could result in expensive production interruptions, recalls and liability claims. Moreover, negative publicity could be generated from false, unfounded or nominal liability claims or limited recalls. Any of these failures or occurrences could negatively affect our business and financial performance.\nThe sale of our products involves product liability and related risks that could expose us to significant insurance and loss expense.\nWe face an inherent risk of exposure to product liability claims if the use of our products results in, or is believed to have resulted in, illness or injury. Most of our products contain combinations of ingredients, and there is little long-term experience with the effect of these combinations. In addition, interactions of these products with other products, prescription medicines and over-the-counter drugs have not been fully explored or understood and may have unintended consequences. Although our third-party manufacturers perform tests in connection with the formulations of our products, these tests are not designed to evaluate the inherent safety of our products.\nAlthough we maintain product liability insurance, it may not be sufficient to cover all product liability claims, and any claims that may arise could have a material adverse effect on our business. The successful assertion or settlement of an uninsured claim, a significant number of insured claims or a claim exceeding the limits of our insurance coverage would harm us by adding further costs to our business and by diverting the attention of our senior management from the operation of our business. Even if we successfully defend a liability claim, the uninsured litigation costs and adverse publicity may be harmful to our business.\nAny product liability claim may increase our costs and adversely affect our revenue and operating income. Moreover, liability claims arising from a serious adverse event may increase our costs through higher insurance premiums and deductibles and may make it more difficult to secure adequate insurance coverage in the future. In addition, our product liability insurance may fail to cover future product liability claims, which, if adversely determined, could subject us to substantial monetary damages.\nIf the products we sell do not have the healthful effects intended, our business may suffer.\nIn general, our products sold consist of nutritional supplements that are classified in the United States as dietary supplements, which do not currently require approval from the FDA or other regulatory agencies prior to sale. Although many of the ingredients in such products are vitamins, minerals, herbs and other substances for which there is a long history of human consumption, our products often contain innovative ingredients or combinations of ingredients. Although we believe such products and the combinations of ingredients in them are safe when taken as directed by us, there is little long-term experience with human or other animal consumption of certain of these ingredients or combinations thereof in concentrated form. The products could have certain side effects if not taken as directed or if taken by a consumer that has certain medical conditions. Furthermore, there can be no assurance that any of the products, even when used as directed, will have the effects intended or will not have harmful side effects.\nA slower growth rate in the nutritional supplement industry could lessen our sales and make it more difficult for us to sustain consistent growth.\nThe nutritional supplement industry has been growing at a strong pace over the past ten years. However, any reported medical concerns with respect to ingredients commonly used in nutritional supplements could negatively impact the demand for our products. Additionally, low-carb products, liquid meal replacements and similar competing products addressing changing consumer tastes and preferences could affect the market for certain categories of supplements. All these factors could have a negative impact on our sales growth.\nOur U.S. Net Operating Loss (\"NOL\") carryforwards may expire or could be substantially limited if we experience an ownership change as defined in the Internal Revenue Code (IRC) or if changes are made to the IRC.\nWe have significant U.S. NOL carryforwards. Under federal tax laws, we can carry forward and use our NOLs to reduce our future U.S. taxable income and tax liabilities until such NOL carryforwards expire in accordance with the IRC of 1986, as amended. Our NOL carryforwards provide a benefit to us, if fully utilized, of significant future tax savings. However, our ability to use these tax benefits in future years will depend upon the amount of our federal and state taxable income. If we do not have sufficient federal and state taxable income in future years to use the benefits before they expire, we will permanently lose the benefit of the NOL carryforwards.\nAdditionally, Section 382 and Section 383 of the IRC provide an annual limitation on our ability to utilize our NOL carryforwards, as well as certain built-in losses, against the future U.S. taxable income in the event of a change in ownership, as defined under the IRC. While we have implemented a stockholders right plan to protect our NOL carryforwards, there is no assurance that we will not experience a change in ownership in the future as a result of changes in our stock ownership, and any such subsequent changes in ownership for purposes of the IRC could further limit our ability to use our NOL carryforwards.\nIf other changes are made to the IRC, they could impact our ability to utilize our NOLs. Accordingly, any such occurrences could adversely affect our financial condition, operating results and cash flows.\nCompliance with changing corporate governance regulations and public disclosures may result in additional risks and exposures.\nChanging laws, regulations and standards relating to corporate governance and public disclosure, including the Sarbanes-Oxley Act of 2002 and new regulations from the SEC, have created uncertainty for public companies such as ours. These laws, regulations, and standards are subject to varying interpretations in many cases and as a result, their application in practice may evolve over time as new guidance is provided by regulatory and governing bodies. This could result in continuing uncertainty regarding compliance matters and higher costs necessitated by ongoing revisions to disclosure and governance practices. As a result, our efforts to comply with evolving laws, regulations, and standards have resulted in, and are likely to continue to result in, increased expense and significant management time and attention.\nLoss of key personnel could impair our ability to operate.\nOur success depends on hiring, retaining and integrating senior management and skilled employees. We are currently dependent on certain current key employees, who are vital to our ability to grow our business and maintain profitability. As with all personal service providers, our officers can terminate their relationship with us at will. Our inability to retain these individuals may result in a reduced ability to operate our business.\nRisk Factors Relating to Our Common Stock\nA limited trading market currently exists for our Common Stock, and we cannot assure you that an active market will ever develop, or if developed, will be sustained.\nThere is currently a limited trading market for our Common Stock on the OTC Pink marketplace, and an active trading market may not develop. Consequently, we cannot assure you when and if an active trading market in our Common Stock will be established, or whether any such market will be sustained or sufficiently liquid to enable holders of shares of our Common Stock to liquidate their investment in the Company.\nThe price of our securities could be subject to wide fluctuations and your investment could decline in value.\nThe market price of the securities of a company such as ours with little name recognition in the financial community and without significant revenue can be subject to wide price swings. For example, the closing price of our Common Stock has ranged from a high of $16.00 to a low of $4.77 during the year ending December 31, 2021. The market price of our securities may be subject to wide changes in response to quarterly variations in operating results, announcements of new products by us or our competitors, reports by securities analysts, volume trading, or other events or factors. In addition, the financial markets have experienced significant price and volume fluctuations for a number of reasons, including the failure of certain companies to meet market expectations. These broad market price swings, or any industry-specific market fluctuations, may adversely affect the market price of our securities.\nCompanies that have experienced volatility in the market price of their stock have been the subject of securities class action litigation. If we were to become the subject of securities class action litigation, it could result in substantial costs and a significant diversion of our managements attention and resources.\nWe may issue Preferred Stock with rights senior to the Common Stock.\nOur Articles of Incorporation authorize the issuance of up to 10.0 million shares of preferred stock, par value $0.01 per share (\"Preferred Stock\") in the aggregate. Currently, 1,000 shares of Series A Preferred Stock, par value $0.01 per share, are authorized (the Series A Preferred) and, therefore, could be issued without shareholder approval. For purposes of enacting its Tax Benefits Preservation Plan, dated February 26, 2021, by and between the Company and Colonial Stock (the \"Tax Benefits Plan\"), the Company's transfer agent, the Company designated a class of Preferred Stock on March 2, 2021 as Series B Junior Participating Preferred Stock, par value $0.01, which shall have rights, powers, and preferences similar to those of the Company's Common Stock. However, the rights and preferences of any class or series of preferred stock, were we to designate or issue additional shares of preferred stock, would be established by our Board of Directors in its sole discretion and may have dividend, voting, liquidation and other rights and preferences that are senior to the rights of our Common Stock.\nYou should not rely on an investment in our Common Stock for the payment of cash dividends.\nWe have never paid cash dividends on our Common Stock and do not anticipate paying any cash dividends in the foreseeable future. You should not make an investment in our Common Stock if you require dividend income. Any return on investment in our Common Stock would only come from an increase in the market price of our stock, which is uncertain and unpredictable.\nOur Chair of the Board of Directors, Chief Executive Officer and significant shareholder may have certain personal interests that may affect the Company.\nDue to the securities held by Sudbury Capital Fund, LP (\"Sudbury\") and Dayton Judd, the Companys Chair of the Board and Chief Executive Officer, Mr. Judd may be deemed to be the beneficial owner of a majority of the Companys outstanding voting securities. Consequently, Mr. Judd individually, and together with Sudbury as stockholders acting together, can significantly influence all matters requiring approval by our stockholders, including the election of directors and significant corporate transactions, such as mergers or other business transactions requiring shareholder approval. This concentration of ownership may have effects such as delaying or preventing a change in control of the Company that may be favored by other shareholders or preventing transactions in which shareholders might otherwise recover a premium for their shares over current market prices. In addition, as a result of Mr. Judds position as Chair of the Board and Chief Executive Officer, he and/or Sudbury may have the ability to exert influence over both the actions of the Board of Directors, as well as the execution of managements plans.\nSHOULD ONE OR MORE OF THE FOREGOING RISKS OR UNCERTAINTIES MATERIALIZE, OR SHOULD THE UNDERLYING ASSUMPTIONS PROVE INCORRECT, ACTUAL RESULTS MAY DIFFER SIGNIFICANTLY FROM THOSE ANTICIPATED, BELIEVED, ESTIMATED, EXPECTED, INTENDED OR PLANNED. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nThe Company, including its subsidiaries, leases its headquarters in Omaha, Nebraska. Management believes that the Company's site is adequate to support the business and suitable for present purposes, and the property and equipment have been well maintained. ITEM 3. LEGAL PROCEEDINGS\nWe are currently not involved in any litigation that we believe could have a material adverse effect on our financial condition or results of operations. There is no action, suit, proceeding, inquiry or investigation before or by any court, public board, government agency, self-regulatory organization or body pending or, to the knowledge of the executive officers of the Company or any of its subsidiaries, threatened against or affecting the Company, our Common Stock, any of our subsidiaries or of the Companys or our subsidiaries directors or officers in their capacities as such, in which an adverse decision could have a material adverse effect. ITEM 4. MINE SAFETY DISCLOSURES\nNone.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON STOCK, RELATED STOCKHOLDER MATTERS AND ISSUERS PURCHASES OF EQUITY SECURITIES\nOur Common Stock is traded in the over-the-counter market, and quoted on the OTC Pink market under the symbol FTLF.\nAs of December 31, 2021, there were 4,552,485 shares of Common Stock outstanding, and there were 29 shareholders of record of the Companys Common Stock in addition to an undetermined number of holders whose shares are held in street name.\nThe following table sets forth the high and low closing prices for our Common Stock for the periods indicated. The following stock prices reflect the Forward Split that became effective on December 2, 2021.\nHigh\nLow\nFiscal Year 2021\nFirst Quarter (January - March 2021)\n$ 8.13\n$ 4.77\nSecond Quarter (April - June 2021)\n$ 10.43\n$ 8.00\nThird Quarter (July - September 2021)\n$ 13.75\n$ 9.71\nFourth Quarter (October - December 2021)\n$ 16.00\n$ 11.88\nHigh\nLow\nFiscal Year 2020\nFirst Quarter (January - March 2020)\n$ 3.69\n$ 1.93\nSecond Quarter (April - June 2020)\n$ 3.06\n$ 2.25\nThird Quarter (July - September 2020)\n$ 3.74\n$ 2.48\nFourth Quarter (October - December 2020)\n$ 5.40\n$ 3.50\nOn October 10, 2022, the closing price of our Common Stock was $16.15 per share.\nRecent Sales of Unregistered Securities\nNo unregistered securities were issued during the fiscal year that were not previously reported in a Quarterly Report on Form 10-Q or Current Report on Form 8-K.\nDuring the year ended December 31, 2021, the Company repurchased 36,092 shares of Common Stock, under the Share Repurchase Program through a private transaction. The Company also repurchased 50,840 dilutive in-the-money options from employees at a discount to their intrinsic value for total consideration of $184,000. As of December 31, 2021, we were authorized to repurchase up to $5.0 million, of which approximately $3.2 million remained available.\nCommon Stock repurchase activity under our publicly announced Share Repurchase Program during each quarter of 2021 and 2020 was as follows:\nTrade date\nTotal\nnumber\nof shares\npurchased\nAverage\nprice paid\nper share\nTotal\nnumber\nof shares\npurchased\nas part of\npublicly\nannounced\nprograms\nDollar\nvalue of\nshares that\nmay yet be\npurchased\nFirst quarter ended March 31, 2021\n-\n$ -\n-\n$ 3,610,917\nSecond quarter ended June 30, 2021\n36,092\n$ 7.13\n36,092\n$ 3,169,917\nThird quarter ended September 30, 2021\n-\n$ -\n-\n$ 3,169,917\nFourth quarter ended December 31, 2021\n-\n$ -\n-\n$ 3,169,917\nSubtotal\n36,092\n$ 7.13\n36,092\n$ 3,169,917\nTransfer Agent\nOur transfer agent and registrar for the Common Stock is Colonial Stock Transfer located in Sandy, Utah.\nSecurities Authorized for Issuance under Equity Compensation Plans\nFor a discussion of our equity compensation plans, please see Item 11 of this Annual Report. ITEM 6. SELECTED FINANCIAL DATA\nNot a required disclosure for Smaller Reporting Companies. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OR PLAN OF OPERATION\nThe following is managements discussion and analysis of certain significant factors that have affected our financial position and operating results during the periods included in the accompanying consolidated financial statements, as well as information relating to the plans of our current management. This report includes forward-looking statements. Generally, the words believes, anticipates, may, will, should, expect, intend, estimate, continue, and similar expressions or the negative thereof or comparable terminology are intended to identify forward-looking statements. Such statements are subject to certain risks and uncertainties, including the matters set forth in this Annual Report or other reports or documents we file with the Securities and Exchange Commission from time to time, which could cause actual results or outcomes to differ materially from those projected. Undue reliance should not be placed on these forward-looking statements, which speak only as of the date hereof. We undertake no obligation to update these forward-looking statements.\nThe following discussion and analysis should be read in conjunction with our consolidated financial statements and the related notes thereto and other financial information contained elsewhere in this Annual Report.\nRestatement of Previously Issued Unaudited Interim Condensed Consolidated Financial Statements\nWe have restated our previously issued unaudited interim condensed consolidated Financial Statements as of and for the three months ended March 31, 2021, and as of and for the three and six months ended June 30, 2021. Refer to the section entitled Explanatory Note preceding Item 1 hereof for background on the restatement, the fiscal periods impacted, control considerations, and other information.\nWithin this MD&A, we have restated our previously issued unaudited interim condensed consolidated statements of operations for the three months ended March 31, 2021 and for the three and six months ended June 30, 2021; and unaudited interim condensed consolidated statements of cash flows for the three months ended March 31, 2021 and for the six months ended June 30, 2021 (the Prior Quarterly Financial Statements), to reflect the restatement more fully described in Note 11 to the notes of the audited consolidated financial statements in this Annual Report.\nSee Note 11, Quarterly Financial Data (Unaudited), in Item 8, Consolidated Financial Statements and Supplementary Data, for such restated information, and see Supplemental Unaudited Quarterly Financial Information, in Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations, for additional interim financial information.\nIn connection with the Restatement, the Company restated the financial information as of and for the fiscal year December 31, 2020 and December 31, 2019, as well as the relevant unaudited interim financial information for the quarterly periods ended September 30, 2020, June 30, 2020, March 31, 2020, September 30, 2019, June 30, 2019, and March 31, 2019 in a separate filing in the 2020 Annual Report, as amended, on Form 10-K/A.\nCritical Accounting Policies\nUse of Estimates and Assumptions\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States (GAAP) requires management to make estimates and assumptions that affect (i) the reported amounts of assets and liabilities, (ii) the disclosure of contingent assets and liabilities known to exist as of the date the financial statements are published, and (iii) the reported amount of net sales and expense recognized during the periods presented.\nThose estimates and assumptions include estimates for reserves of uncollectible accounts receivable, allowance for product returns, sales returns and incentive programs, allowance for inventory obsolescence, depreciable lives of property and equipment, analysis of impairment of goodwill, realization of deferred tax assets, accruals for potential liabilities and assumptions made in valuing stock instruments issued for services. Management evaluates these estimates and assumptions on a regular basis. Actual results could differ from those estimates.\nAccounts Receivable and Allowance for Doubtful Accounts\nThe Companys accounts receivable balance is related to trade receivables and are recorded at the invoiced amount and do not bear interest. The allowance for doubtful accounts is the Companys best estimate of the amount of probable credit losses in its existing accounts receivable. The Company will maintain allowances for doubtful accounts, estimating losses resulting from the inability of its customers to make required payments for products. Accounts with known financial issues are first reviewed and specific estimates are recorded. The remaining accounts receivable balances are then grouped in categories by the amount of days the balance is past due, and the estimated loss is calculated as a percentage of the total category based upon past history. Account balances are charged off against the allowance when it is probable the receivable will not be recovered.\nThe determination of collectability of the Companys accounts receivable requires management to make frequent judgments and estimates in order to determine the appropriate amount of allowance needed for doubtful accounts. The Companys allowance for doubtful accounts is estimated to cover the risk of loss related to accounts receivable. This allowance is maintained at a level we consider appropriate based on historical and other factors that affect collectability. These factors include historical trends of write-offs, recoveries and credit losses; the careful monitoring of customer credit quality; and projected economic and market conditions. Different assumptions or changes in economic circumstances could result in changes to the allowance.\nTotal allowance for doubtful accounts as of December 31, 2021 and 2020 amounted to $55,000 and $51,000, respectively.\nProduct Returns, Sales Incentives and Other Forms of Variable Consideration\nIn measuring revenue and determining the consideration the Company is entitled to as part of a contract with a customer, the Company takes into account the related elements of variable consideration. Such elements of variable consideration include, but are not limited to, product returns and sales incentives, such as markdowns and margin adjustments. For these types of arrangements, the adjustments to revenue are recorded at the later of when (i) the Company recognizes revenue for the transfer of the related products to the customers, or (ii) the Company pays, or promises to pay, the consideration.\nWe currently have a 30-day product return policy for NDS Products, which allows for a 100% sales price refund for the return of unopened and undamaged products purchased from us online through one of our websites or e-commerce platforms. Product sold to GNC may be returned from store shelves or the distribution center in the event product is damaged, short dated, expired or recalled.\nGNC maintains a customer satisfaction program which allows customers to return product to the store for credit or refund. Subject to certain terms and restrictions, GNC may require reimbursement from vendors for unsaleable returned product through either direct payment or credit against a future invoice. We also support a product return policy for iSatori Products, whereby customers can return product for credit or refund. Product returns can and do occur from time to time and can be material.\nFor the sale of goods with a right of return, the Company estimates variable consideration using the most likely amount method and recognizes revenue for the consideration it expects to be entitled to when control of the related product is transferred to the customers and records a product returns liability for the amount it expects to credit back its customers. Under this method, certain forms of variable consideration are based on expected sell-through results, which requires subjective estimates. These estimates are supported by historical results as well as specific facts and circumstances related to the current period. In addition, the Company recognizes an asset included in Inventories, net and a corresponding adjustment to Cost of Goods Sold for the right to recover goods from customers associated with the estimated returns. The product returns liability and corresponding asset include estimates that directly impact reported revenue. These estimates are calculated based on a history of actual returns, estimated future returns and information provided by customers regarding their inventory levels. Consideration of these factors results in an estimate for anticipated sales returns that reflects increases or decreases related to seasonal fluctuations. In addition, as necessary, product returns liability and the related assets may be established for significant future known or anticipated events. The types of known or anticipated events that are considered, and will continue to be considered, include, but are not limited to, changes in the retail environment and the Company's decision to continue to support new and existing products.\nInformation for product returns is received on regular basis and adjusted for accordingly. Adjustments for returns are based on factual information and historical trends for both NDS products and iSatori products and are specific to each distribution channel. We monitor, among other things, remaining shelf life and sell-through data on a weekly basis. If we determine there are any risks or issues with any specific products, we accrue sales return allowances based on managements assessment of the overall risk and likelihood of returns in light of all information available.\nTotal allowance for product returns, sales returns and incentive programs as of December 31, 2021 and 2020 amounted to $632,000 and $345,000, respectively.\nInventory\nThe Companys inventory is carried at the lower of cost or net realizable value using the first-in, first-out (FIFO) method. The Company evaluates the need to record adjustments for inventory on a regular basis. Company policy is to evaluate all inventories including components and finished goods for all of its product offerings across all of the Companys operating subsidiaries.\nThe Company recognizes an allowance for obsolescence for expiring, excess, and slow-moving inventory. To calculate the allowance, the Company analyzes sales projections for each SKU relative to the remaining shelf life of the product. The value of any finished goods inventory that expires within six months of the date of assessment is included in the allowance, even if the Company anticipates selling some or all of the inventory. In addition, the allowance includes the value of longer-dated finished good inventory that, based on projections, will remain unsold at the time of its expiration.\nTotal allowance for expiring, excess and slow-moving inventory items as of December 31, 2021 and 2020 amounted to $56,000 and $56,000, respectively.\nGoodwill\nIn January 2017, the FASB issued ASU 2017-04, Intangibles - Goodwill and Other (Topic 350): Simplifying the Accounting for Goodwill Impairment. ASU 2017-04 removes Step 2 of the goodwill impairment test, which required a hypothetical purchase price allocation. A goodwill impairment will now be the amount by which a reporting units carrying value exceeds its fair value, not to exceed the carrying amount of goodwill. This update also eliminated the requirements for any reporting unit with a zero or negative carrying amount to perform a qualitative assessment and, if it fails that qualitative test, to perform Step 2 of the goodwill impairment test. The Company adopted ASU 2017-04 on January 1, 2020 and applied the requirements prospectively.\nThere were no impairment charges incurred during the year ended December 31, 2021.\nRevenue Recognition\nThe Companys revenue is comprised of sales of nutritional supplements, primarily to GNC.\nThe Company accounts for revenues in accordance with Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers. The underlying principle of ASC 606 is to recognize revenue to depict the transfer of goods or services to customers at the amount expected to be collected. ASC 606 creates a five-step model that requires entities to exercise judgment when considering the terms of contract(s), which includes (1) identifying the contract(s) or agreement(s) with a customer, (2) identifying our performance obligations in the contract or agreement, (3) determining the transaction price, (4) allocating the transaction price to the separate performance obligations, and (5) recognizing revenue as each performance obligation is satisfied. Under ASC 606, revenue is recognized when performance obligations under the terms of a contract are satisfied, which occurs for the Company upon shipment or delivery of products to our customers based on written sales terms, which is also when control is transferred. Revenue is measured as the amount of consideration we expect to receive in exchange for transferring the products or services to a customer.\nAll products sold by the Company are distinct individual products and consist of nutritional supplements and related supplies. The products are offered for sale solely as finished goods, and there are no performance obligations required post-shipment for customers to derive the expected value from them.\nControl of products we sell transfers to customers upon shipment from our facilities or delivery to our customers, and the Companys performance obligations are satisfied at that time. Shipping and handling activities are performed before the customer obtains control of the goods and therefore represent a fulfillment activity rather than promised goods to the customer. Payment for sales are generally made by check, credit card, or wire transfer. Historically the Company has not experienced any significant payment delays from customers.\nFor direct-to-consumer sales, the Company allows for returns within 30 days of purchase. Our wholesale customers, such as GNC, may return purchased products to the Company under certain circumstances, which include expired or soon-to-be-expired products located in GNC corporate stores or at any of its distribution centers, and products that are subject to a recall or that contain an ingredient or ingredients that are subject to a recall by the U.S. Food and Drug Administration.\nA right of return does not represent a separate performance obligation, but because customers are allowed to return products, the consideration to which the Company expects to be entitled is variable. Upon evaluation of returns, the Company determined that less than 5% of products are returned, and therefore believes it is probable that such returns will not cause a significant reversal of revenue in the future. We assess our contracts and the reasonableness of our conclusions on a quarterly basis.\nStock-Based Compensation.\nThe Company periodically issues stock options and warrants to employees and non-employees in non-capital raising transactions for services rendered. The Company accounts for stock option and warrant grants issued and vesting to employees based on the authoritative guidance provided by the Financial Accounting Standards Board (FASB) where the value of the award is measured on the date of grant and recognized as compensation on the straight-line basis over the vesting period.\nFrom prior periods until December 31, 2018, the Company accounted for share-based compensation issued to non-employees and consultants in accordance with the provisions of FASB ASC 505-50, Equity-Based Payments to Non-Employees. Measurement of share-based payment transactions with non-employees is based on the fair value of whichever is more reliably measurable: (a) the goods or services received or (b) the equity instruments issued. The final fair value of the share-based payment transaction is determined at the performance completion date.\nIn June 2018, the FASB issued ASU 2018-07, Compensation - Stock Compensation (Topic 718): Improvements to Nonemployee Share-Based Payment Accounting (ASU 2018-07). The guidance was issued to simplify the accounting for share-based transactions by expanding the scope of ASU 2018-07 from only being applicable to share-based payments to employees to also include share-based payment transactions for acquiring goods and services from nonemployees. As a result, nonemployee share-based transactions are measured by estimating the fair value of the equity instruments at the grant date, taking into consideration the probability of satisfying performance conditions. We adopted ASU 2018-07 on January 1, 2019. The adoption of the standard did not have a material impact on our financial statements for the year ended December 31, 2019 or the previously reported financial statements.\nThe fair value of the Companys stock option and warrant grants are estimated using the Black-Scholes option pricing model, which uses certain assumptions related to risk-free interest rates, expected volatility, expected life of the stock options or warrants, and future dividends. Compensation expense is recorded based upon the value derived from the Black-Scholes option pricing model and based on actual experience. The assumptions used in the Black-Scholes option pricing model could materially affect compensation expense recorded in future periods.\nRecent Accounting Pronouncements\nSee Note 2 of the Notes to the Consolidated Financial Statements included in this Annual Report for a description of recent accounting pronouncements believed by management to have a material impact on our present or future financial statements.\nResults of Operations\nAs Restated\nDecember\n31, 2021\nDecember\n31, 2020\nChange\n%\nRevenue\n$ 27,913,000\n$ 22,111,000\n$ 5,802,000\n%\nCost of goods sold\n(15,409,000 )\n(12,574,000 )\n(2,835,000 )\n%\nGross profit\n12,504,000\n9,537,000\n2,967,000\n%\nGeneral and administrative expense\n(3,651,000 )\n(3,047,000 )\n(604,000 )\n%\nSelling and marketing expense\n(2,564,000 )\n(2,106,000 )\n(458,000 )\n%\nDepreciation and amortization\n(59,000 )\n(38,000 )\n(21,000 )\n%\nTotal operating expenses\n(6,274,000 )\n(5,191,000 )\n(1,083,000 )\n%\nIncome from operations\n6,230,000\n4,346,000\n1,884,000\n%\nOther income (expense)\n478,000\n64,000\n414,000\nn/a\n(Provision) benefit for income tax\n(1,298,000 )\n4,415,000\n(5,713,000 )\nn/a\nNet income\n$ 5,410,000\n$ 8,825,000\n$ (3,415,000 )\n(39 )%\nFiscal Year Ended December 31, 2021 Compared to Fiscal Year Ended December 31, 2020\nNet Sales. Revenue for the year ended December 31, 2021 increased 26% to $27,913,000 as compared to $22,111,000 for the year ended December 31, 2020. Revenue for the year ended December 31, 2021 compared to the prior year reflects continued growth in our wholesale business and in our online direct-to-consumer offering.\nOnline revenue during the year ended December 31, 2021 was approximately 24% of total revenue, compared to roughly 20% of total revenue during the same twelve-month period in 2020. Due to the ongoing shift to online purchasing by consumers, including additional growth arising from the effects of the COVID-19 pandemic as a result of the shutdown of various retail outlets, e-commerce sales have accounted for a growing percentage of our domestic revenue. Although no assurances can be given, management believes that online revenue will continue to increase in subsequent periods relative to prior comparable periods given managements focus on higher margin online sales.\nThe Company continually reformulates and introduces new products, as well as seeks to increase both the number of stores and number of approved products that can be sold within the GNC franchise system that comprise its domestic and international distribution footprint. Management also believes that its focus on developing its e-commerce capabilities will drive additional incremental sales in the short-term, while yielding substantial benefits in the longer-term.\nCost of Goods Sold. Cost of goods sold for the year ended December 31, 2021 increased 23% to $15,409,000 as compared to $12,574,000 for the year ended December 31, 2020. This increase is principally attributable to higher revenue.\nGross Profit Margin. Gross profit for the year ended December 31, 2021 increased to $12,504,000 as compared to $9,537,000 for the year ended December 31, 2020. Gross margin for the year ended December 31, 2021 increased to 44.8% from 43.1% for the comparable period last year. The increase in gross profit during the year ended December 31, 2021 is principally attributable to higher revenue and a larger percentage of higher-margin direct-to-consumer sales.\nGeneral and Administrative Expense. General and administrative expense for the year ended December 31, 2021 increased by $604,000 to $3,651,000 as compared to $3,047,000 for the year ended December 31, 2020. The increase in general and administrative expense was primarily due to an increase of $374,000 in stock compensation expense as well as $253,000 of expenses related to M&A activity.\nSelling and Marketing Expense. Selling and marketing expense for the year ended December 31, 2021 increased to $2,564,000 as compared to $2,106,000 for the year ended December 31, 2020. This increase is primarily attributable to higher co-operative marketing expenses paid to one of our wholesale partners. The Company anticipates that this higher level of marketing expense which was fully funded by wholesale price increases will continue for the foreseeable future.\nDepreciation and Amortization. Depreciation and amortization for the year ended December 31, 2021 increased to $59,000 from $38,000 during the same period in 2020. The increase is primarily attributable to the amortization of intangibles acquired in the Nutrology business combination.\nNet Income. We generated a net income of $5,410,000 for the year ended December 31, 2021, as compared to a net income of $8,825,000 for the year ended December 31, 2020. The decrease in net income for the year ended December 31, 2021 compared to the same period in 2020 was primarily attributable to an income tax benefit of $4,415,000 during 2020 resulting from removing a substantial portion of the reserve against our deferred tax assets.\nNon-GAAP Measures\nThe financial presentation below contains certain financial measures defined as non-GAAP financial measures by the SEC, including non-GAAP EBITDA and adjusted non-GAAP EBITDA. These measures may be different from non-GAAP financial measures used by other companies. The presentation of this financial information, which is not prepared under any comprehensive set of accounting rules or principles, is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in this Annual Report in accordance with GAAP.\nAs presented below, non-GAAP EBITDA excludes interest, income taxes, and depreciation and amortization. Adjusted non-GAAP EBITDA excludes-in addition to interest, taxes, depreciation and amortization-stock-based compensation, acquisition related expenses, and gains or losses of a non-recurring nature. The Company believes the non-GAAP measures provide useful information to both management and investors by excluding certain expense and other items that may not be indicative of its core operating results and business outlook. The Company believes that the inclusion of non-GAAP measures in the financial presentation below allows investors to compare the Companys financial results with the Companys historical financial results and is an important measure of the Companys comparative financial performance.\nYear Ended December 31,\n(Unaudited)\n(Unaudited)\nNet income\n$ 5,410,000\n$ 8,825,000\nInterest expense (income), net\n(25,000 )\n6,000\nProvision (benefit) for income taxes\n1,298,000\n(4,415,000 )\nDepreciation and amortization\n59,000\n38,000\nEBITDA\n6,742,000\n4,454,000\nNon-cash and non-recurring adjustments\nStock-based compensation expense\n452,000\n78,000\nAcquisition related expenses\n253,000\n-\nNon-recurring gains\n(453,000 )\n(70,000 )\nAdjusted EBITDA\n$ 6,994,000\n$ 4,462,000\nLiquidity and Capital Resources\nAs of December 31, 2021, the Company had working capital of $13,626,000, compared to working capital of $7,615,000 at December 31, 2020. Our principal sources of liquidity at December 31, 2021 consisted of $9,897,000 of cash and $945,000 of accounts receivable. The increase in working capital is principally attributable to cash flows from operating activities during fiscal 2021, partially offset by the acquisition of Nutrology and share repurchases.\nOn September 24, 2019, the Company entered into a Revolving Line of Credit Agreement (the Line of Credit Agreement) with Mutual of Omaha Bank (the Lender), subsequently acquired by CIT Bank N.A., providing the Company with a $2.5 million revolving line of credit (the Line of Credit). The Line of Credit allows the Company to request advances thereunder and to use the proceeds of such advances for working capital purposes until the Maturity Date, or unless renewed at maturity upon approval by the Companys Board and the Lender. The Line of Credit is secured by all assets of the Company.\nAdvances drawn under the Line of Credit bear interest at an annual rate of the one-month LIBOR rate plus 2.75%, and each advance will be payable on the Maturity Date with the interest on outstanding advances payable monthly. The Company may, at its option, prepay any borrowings under the Line of Credit, in whole or in part at any time prior to the Maturity Date, without premium or penalty.\nOn March 20, 2020, the Lender advanced the Company $2.5 million under the Line of Credit, which amount was repaid on April 29, 2020. The advance was intended to provide the Company with additional liquidity given the uncertainty regarding the timing of collection of certain accounts receivable and in anticipation of an expected negative impact on sales to GNC and our other wholesale customers resulting from the COVID-19 outbreak.\nOn September 20, 2022, the Company and the Lender amended the Line of Credit Agreement to extend the Maturity Date to December 23, 2022. All other terms of the Line of Credit Agreement remain unchanged.\nOn April 27, 2020, the Company received proceeds from a loan in the amount of $449,700 from the PPP Lender, pursuant to approval by the SBA for the Lender to fund the Companys request for the PPP Loan created as part of the recently enacted CARES Act administered by the SBA. In accordance with the requirements of the CARES Act, the Company used the proceeds from the PPP Loan primarily for payroll costs, covered rent payments, and covered utilities during the eight-week period commencing on the date of loan approval. The PPP Loan was scheduled to mature on April 27, 2022, had a 1.0% interest rate, and was subject to the terms and conditions applicable to all loans made pursuant to the Paycheck Protection Program as administered by the SBA under the CARES Act. The Company did not provide any collateral or guarantees for the PPP Loan, nor did the Company pay any fees to obtain the PPP Loan. The Company was informed by the PPP Lender and the SBA that the full amount balance of the PPP Loan, including accrued interest, was forgiven on January 15, 2021. See Note 1 to the Consolidated Financial Statements contained within this Annual Report.\nThe Company has historically financed its operations primarily through cash flow from operations and equity and debt financings. The Company has also provided for its cash needs by issuing Common Stock, options and warrants for certain operating costs, including consulting and professional fees. The Company currently anticipates that cash derived from operations and existing cash resources, along with available borrowings under the Line of Credit, will be sufficient to provide for the Companys liquidity for the next twelve months.\nThe Company is dependent on cash flow from operations and amounts available under the Line of Credit to satisfy its working capital requirements. No assurances can be given that cash flow from operations and/or the Line of Credit will be sufficient to provide for the Companys liquidity for the next twelve months. Should the Company be unable to generate sufficient revenue in the future to achieve positive cash flow from operations, and/or should capital be unavailable under the terms of the Line of Credit, additional working capital will be required. Management currently has no intention to raise additional working capital through the sale of equity or debt securities and believes that the cash flow from operations and available borrowings under the Line of Credit will provide sufficient capital necessary to operate the business over the next twelve months. In the event the Company fails to achieve positive cash flow from operations, additional capital is unavailable under the terms of the Line of Credit, and management is otherwise unable to secure additional working capital through the issuance of equity or debt securities, the Companys business would be materially and adversely harmed.\nCash Provided by Operating Activities\nNet cash provided by operating activities was $4,480,000 during the fiscal year ended December 31, 2021, compared to net cash provided by operating activities of $5,721,000 for the year ended December 31, 2020. The decrease in cash provided by operating activities is primarily attributable to increased investments in working capital, particularly inventory.\nCash Used in Investing Activities\nCash used in investing activities for the fiscal year ended December 31, 2021 was $529,000 related to the Nutrology acquisition, as compared to $0 used in investing activities during the year ended December 31, 2020.\nCash Provided by (Used in) Financing Activities\nCash used in financing activities for the year ended December 31, 2021 was $390,000 as compared to cash provided by financing of $350,000 during the year ended December 31, 2020. Receipt of funds from the PPP loan during 2020 and increased share repurchases during 2021 account for the primary difference.\nSupplemental Unaudited Quarterly Financial Information\nThe following unaudited quarterly financial information is presented to illustrate the effects of the corrections of misstatements to previously reported quarterly unaudited financial information as a result of the restatement. Such corrections of misstatements are described in more detail in Note 11, Restatement of Previously Issued Consolidated Financial Statements, in Item 8, Financial Statements and Supplementary Data. This unaudited quarterly financial information should be read in conjunction with the other sections of this Comprehensive Annual Report, including the consolidated financial statements and related notes contained in Item 8, Financial Statements and Supplementary Data.\nManagement's Discussion and Analysis of the Unaudited Financial Condition and Results of Operations - June 30, 2021\nRestated\nComparison of the three and six months ended June 30, 2021 to the three and six months ended June 30, 2020\nThree months ended\nSix months ended\nAs Restated\nAs Restated\nAs Restated\nAs Restated\nJune 30, 2021\nJune 30, 2020\nChange\nJune 30, 2021\nJune 30, 2020\nChange\nRevenue\n$ 8,406,000\n$ 2,990,000\n$ 5,416,000\n%\n$ 14,005,000\n$ 9,532,000\n$ 4,473,000\n%\nCost of goods sold\n(4,725,000 )\n(1,554,000 )\n(3,171,000 )\n%\n(7,529,000 )\n(5,186,000 )\n(2,343,000 )\n%\nGross profit\n3,681,000\n1,436,000\n2,245,000\n%\n6,476,000\n4,346,000\n2,130,000\n%\nOperating expenses\n(1,648,000 )\n(1,446,000 )\n(202,000 )\n%\n(3,182,000 )\n(2,862,000 )\n(320,000 )\n%\nIncome (loss) from operations\n2,033,000\n(10,000 )\n2,043,000\nn/a\n3,294,000\n1,484,000\n1,810,000\n%\nOther income (expense)\n5,000\n(5,000 )\n10,000\nn/a\n464,000\n61,000\n403,000\nn/a\n(Provision) Benefit for income tax\n(406,000 )\n40,000\n(446,000 )\nn/a\n(721,000 )\n81,000\n(802,000 )\nn/a\nNet income (loss)\n$ 1,632,000\n$ 25,000\n$ 1,607,000\nn/a\n$ 3,037,000\n$ 1,626,000\n$ 1,411,000\n%\nNet Sales. Revenue for the three months ended June 30, 2021 increased to $8,406,000 as compared to $2,990,000 for the three months ended June 30, 2020. Revenue for the six months ended June 30, 2021 increased 47% to $14,005,000 as compared to $9,532,000 for the six months ended June 30, 2020. The increase in revenue for the three- and six-month periods ended June 30, 2021 compared to the prior three- and six-month period is principally due to the closure of some of our retail partners store locations and the stay-at-home orders during 2020 caused by the COVID-19 pandemic and continued organic growth in our online and wholesale businesses.\nOnline revenue during the three and six months ended June 30, 2021 was approximately 21% and 24% of total revenue, respectively, compared to approximately 38% and 21% of total revenue during the three and six months ended June 30, 2020.\nCost of Goods Sold. Cost of goods sold for the three months ended June 30, 2021 increased to $4,725,000 as compared to $1,554,000 for the three months ended June 30, 2020. Cost of goods sold for the six months ended June 30, 2021 increased to $7,529,000 as compared to $5,186,000 for the six months ended June 30, 2020. The increase during the three- and six-month period is principally attributable to higher revenue.\nGross Profit. Gross profit for the three months ended June 30, 2021 increased to $3,681,000 as compared to $1,436,000 for the three months ended June 30, 2020. Gross profit for the six months ended June 30, 2021 increased to $6,476,000 as compared to $4,346,000 for the six months ended June 30, 2020. The increase during the three- and six- month period is principally attributable to higher revenue.\nGross margin for the three months ended June 30, 2021 decreased to 43.8% compared to 48.0% during the same period last year. The decrease during the three-month period is principally attributable to a lower percentage of online sales during 2021 compared to the same period in 2020. Gross margin for the six months ended June 30, 2021 increased to 46.2% compared to 45.6% for the same period last year. The increase was primarily attributable to a greater proportion of higher margin online revenue during 2021 compared to the same period in 2020.\nGeneral and Administrative Expense. General and administrative expense for the three months ended June 30, 2021 decreased to $917,000 as compared to $1,001,000 for the three months ended June 30, 2020. The decrease in the three-month period ended June 30, 2021 primarily reflects a decrease in bad debt expense, partially offset by higher stock compensation expense and higher consulting expense. For the six-month period ended June 30, 2021, general and administrative expense increased to $1,774,000 from $1,734,000 during the same period in the prior year.\nSelling and Marketing Expense. Selling and marketing expense for the three months ended June 30, 2021 increased to $716,000 as compared to $435,000 for the three months ended June 30, 2020. Selling and marketing expense for the six months ended June 30, 2021 increased to $1,385,000 as compared to $1,106,000 for the six months ended June 30, 2020. The increases in both the three- and six-month periods ended June 30, 2021 reflect higher co-operative marketing expense paid to one of our wholesale partners. The Company anticipates that this higher level of marketing expense, which is fully funded by wholesale price increases, will continue for the foreseeable future.\nDepreciation and Amortization Expense. Depreciation and amortization expense for the three months ended June 30, 2021 increased to $15,000 as compared to $10,000 for the three months ended June 30, 2020. The increase was due to amortization of intangibles acquired in the Nutrology business combination. Depreciation and amortization expense for the six months ended June 30, 2021 was flat at $23,000 as compared to $23,000 for the six months ended June 30, 2020, with the increase in amortization associated with the Nutrology intangibles being offset by other assets becoming fully depreciated.\nNet Income. We generated net income of $1,632,000 for the three-month period ended June 30, 2021 as compared to net income of $25,000 for the three months ended June 30, 2020. We generated a net income of $3,037,000 for the six-month period ended June 30, 2021 as compared to a net income of $1,626,000 for the six months ended June 30, 2020. The increase in net income for the three- and six-month periods ended June 30, 2021 was primarily due to higher revenues resulting from the increase in wholesale and online sales as compared to the impact of COVID-19 on sales during the same periods in 2020.\nNon-GAAP Measures\nThe financial presentation below contains certain financial measures defined as non-GAAP financial measures by the SEC, including non-GAAP EBITDA and adjusted non-GAAP EBITDA. These measures may be different from non-GAAP financial measures used by other companies. The presentation of this financial information, which is not prepared under any comprehensive set of accounting rules or principles, is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in this Quarterly Report in accordance with GAAP.\nAs presented below, non-GAAP EBITDA excludes interest, income taxes, and depreciation and amortization. Adjusted non-GAAP EBITDA excludes, in addition to interest, taxes, depreciation and amortization, equity-based compensation and non-recurring gains or losses. The Company believes the non-GAAP measures provide useful information to both management and investors by excluding certain expense and other items that may not be indicative of its core operating results and business outlook. The Company believes that the inclusion of non-GAAP measures in the financial presentation below allows investors to compare the Companys financial results with the Companys historical financial results and is an important measure of the Companys comparative financial performance.\nFor the three months ended June 30,\nFor the six months ended June 30,\n(unaudited)\n(unaudited)\n(unaudited)\n(unaudited)\nNet income\n$ 1,632,000\n$ 25,000\n$ 3,037,000\n$ 1,626,000\nInterest (income) expense, net\n(5,000 )\n5,000\n(11,000 )\n9,000\nProvision for income taxes\n406,000\n(40,000 )\n721,000\n(81,000 )\nDepreciation and amortization\n15,000\n10,000\n23,000\n22,000\nEBITDA\n2,048,000\n-\n3,770,000\n1,576,000\nNon-cash and non-recurring adjustments\nStock compensation expense\n107,000\n26,000\n238,000\n54,000\nAcquisition related expenses\n71,000\n-\n95,000\n-\nNon-recurring gains\n-\n-\n(453,000 )\n(70,000 )\nAdjusted EBITDA\n$ 2,226,000\n$ 26,000\n$ 3,650,000\n$ 1,560,000\nOff-Balance Sheet Arrangements\nOther than contractual obligations incurred in the normal course of business, we do not have any off-balance sheet financing arrangements or liabilities, retained or contingent interests in transferred assets or any obligation arising out of a material variable interest in an unconsolidated entity.\nManagement's Discussion and Analysis of the Unaudited Financial Condition and Results of Operations - March 31, 2021\nRestated\nComparison of the three months ended March 31, 2021 to the three months ended March 31, 2020\nThree months ended\nAs Restated\nAs Restated\nMarch 31,\nMarch 31,\nChange\n(unaudited)\nRevenue\n$ 5,599,000\n$ 6,542,000\n$ (943,000 )\n(14 )%\nCost of goods sold\n(2,804,000 )\n(3,632,000 )\n828,000\n(23 )%\nGross profit\n2,795,000\n2,910,000\n(115,000 )\n(4 )%\nOperating expenses\n(1,534,000 )\n(1,416,000 )\n(118,000 )\n%\nIncome from operations\n1,261,000\n1,494,000\n(233,000 )\n(16 )%\nOther income (expense)\n459,000\n66,000\n393,000\nn/a\n(Provision) Benefit for income tax\n(315,000 )\n41,000\n(356,000 )\nn/a\nNet income\n$ 1,405,000\n$ 1,601,000\n$ (196,000 )\n(12 )%\nNet Sales. Revenue for the three months ended March 31, 2021 decreased 14% to $5,599,000 as compared to $6,542,000 for the three months ended March 31, 2020. Revenue for the three months ended March 31, 2021 compared to the prior period reflects fluctuations in the timing of orders from our wholesale customers.\nOnline revenue during the three months ended March 31, 2021 and 2020 was approximately 29% of total revenue for the three months ended March 31, 2021 as compared to 13% for the same period of 2020. Due to the ongoing shift to online purchasing by consumers, including additional growth arising from the effects of the COVID-19 pandemic as a result of the shutdown of various retail outlets, e-commerce sales have accounted for a growing percentage of our domestic revenue. Although no assurances can be given, management believes that online revenue will continue to increase in subsequent periods relative to prior comparable periods given managements focus on higher margin online sales.\nCost of Goods Sold. Cost of goods sold for the three months ended March 31, 2021 decreased to $2,804,000 as compared to $3,632,000 for the three months ended March 31, 2020. This 23% decrease is principally attributable to lower revenue.\nGross Profit. Gross profit for the three months ended March 31, 2021 decreased to $2,795,000 as compared to $2,910,000 for the three months ended March 31, 2020. Gross margin for the three months ended March 31, 2021 increased to 49.9% from 44.5% for the comparable period in 2020. The decrease in gross profit is principally attributable to lower revenue. The increase in gross margin was primarily attributable to a greater proportion of higher margin online revenue during 2021 compared to the same period in 2020.\nGeneral and Administrative Expense. General and administrative expense for the three months ended March 31, 2021 increased to $857,000 as compared to $733,000 for the three months ended March 31, 2020. The increase in the three-month period ended March 31, 2021 primarily reflects stock compensation expense of $131,000 related to options and RSUs issued during the quarter.\nSelling and Marketing Expense. Selling and marketing expense for the three months ended March 31, 2020 was roughly flat at $669,000 as compared to $671,000 for the three months ended March 31, 2020.\nDepreciation and Amortization Expense. Depreciation and amortization expense for the three months ended March 31, 2021 decreased to $8,000 as compared to $12,000 for the three months ended March 31, 2020. The decrease in the three-month period was primarily attributable to a reduction in depreciation expense due to certain assets becoming fully depreciated.\nNet Income. We generated net income of $1,405,000 for the three-month period ended March 31, 2021 as compared to net income of $1,601,000 for the three months ended March 31, 2020. The decrease in net income for the three-month period ended March 31, 2021 compared to the same period in 2020 was primarily attributable to lower revenue and increased compensation cost related to options and RSUs.\nNon-GAAP Measures\nThe financial presentation below contains certain financial measures not in accordance with accounting principles generally accepted in the United States (GAAP), defined by the SEC as non-GAAP financial measures, including non-GAAP EBITDA and adjusted non-GAAP EBITDA. These measures may be different from non-GAAP financial measures used by other companies. The presentation of this financial information, which is not prepared under any comprehensive set of accounting rules or principles, is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in this Quarterly Report in accordance with GAAP.\nAs presented below, non-GAAP EBITDA excludes interest, income taxes, and depreciation and amortization. Adjusted non-GAAP EBITDA excludes, in addition to interest, taxes, depreciation and amortization, equity-based compensation and non-recurring gains or losses. The Company believes the non-GAAP measures provide useful information to both management and investors by excluding certain expense and other items that may not be indicative of its core operating results and business outlook. The Company believes that the inclusion of non-GAAP measures in the financial presentation below allows investors to compare the Companys financial results with the Companys historical financial results and is an important measure of the Companys comparative financial performance.\nFor the three months ended\nMarch 31,\n(Unaudited)\n(Unaudited)\nNet income\n$ 1,405,000\n$ 1,601,000\nInterest expense (income)\n(6,000 )\n4,000\nProvision for income taxes\n315,000\n(41,000 )\nDepreciation and amortization\n8,000\n12,000\nEBITDA\n1,722,000\n1,576,000\nNon-cash and non-recurring adjustments\nStock compensation expense\n131,000\n28,000\nAcquisition related expenses\n24,000\n-\nNon-recurring losses (gains)\n(453,000 )\n(70,000 )\nAdjusted EBITDA\n$ 1,424,000\n$ 1,534,000\nLiquidity and Capital Resources\nAt March 31, 2021, we had positive working capital of approximately $9,030,000, compared to $7,615,000 at December 31, 2020. Our principal sources of liquidity at March 31, 2021 consisted of $6,625,000 of cash and $1,580,000 of accounts receivable.\nOn September 24, 2019, the Company entered into a Revolving Line of Credit Agreement (the Line of Credit Agreement) with Mutual of Omaha Bank (the Lender), subsequently acquired by CIT Bank N.A., providing the Company with a $2.5 million revolving line of credit (the Line of Credit). The Line of Credit allows the Company to request advances thereunder and to use the proceeds of such advances for working capital purposes until the Maturity Date, or unless renewed at maturity upon approval by the Companys Board and the Lender. The Line of Credit is secured by all assets of the Company.\nAdvances drawn under the Line of Credit bear interest at an annual rate of the one-month LIBOR rate plus 2.75%, and each advance will be payable on the Maturity Date with the interest on outstanding advances payable monthly. The Company may, at its option, prepay any borrowings under the Line of Credit, in whole or in part at any time prior to the Maturity Date, without premium or penalty.\nOn March 20, 2020, the Lender advanced the Company $2.5 million under the Line of Credit, which amount was repaid on April 29, 2020. The advance was intended to provide the Company with additional liquidity given the uncertainty regarding the timing of collection of certain accounts receivable and in anticipation of an expected negative impact on sales to GNC and our other wholesale customers resulting from the COVID-19 outbreak.\nOn September 20, 2022, the Company and the Lender amended the Line of Credit Agreement to extend the Maturity Date to December 23, 2022. All other terms of the Line of Credit Agreement remain unchanged.\nOn April 27, 2020, the Company received proceeds from a loan in the amount of $449,700 from its lender, CIT Bank, N.A. (the PPP Lender), pursuant to approval by the U.S. Small Business Administration (the SBA) for the PPP Lender to fund the Companys request for a loan under the SBAs Paycheck Protection Program (PPP Loan) created as part of the Coronavirus Aid, Relief, and Economic Security Act (CARES Act) administered by the SBA (the Loan Agreement). In accordance with the requirements of the CARES Act, the Company used the proceeds from the PPP Loan primarily for payroll costs, covered rent payments, and covered utilities during the eight-week period commencing on the date of loan approval. The PPP Loan was scheduled to mature on April 27, 2022, had a 1.0% interest rate, and was subject to the terms and conditions applicable to all loans made pursuant to the Paycheck Protection Program as administered by the SBA under the CARES Act. The Company was informed by the PPP Lender and the SBA that the full balance of the PPP Loan, including accrued interest, was forgiven on January 15, 2021.\nThe Company has historically financed its operations primarily through cash flow from operations and equity and debt financings. The Company has also provided for its cash needs by issuing Common Stock, options and warrants for certain operating costs, including consulting and professional fees. The Company currently anticipates that cash derived from operations and existing cash resources, along with available borrowings under the Line of Credit, will be sufficient to provide for the Companys liquidity for the next twelve months.\nThe Company is dependent on cash flow from operations and amounts available under the Line of Credit to satisfy its working capital requirements. No assurances can be given that cash flow from operations and/or the Line of Credit will be sufficient to provide for the Companys liquidity for the next twelve months. Should the Company be unable to generate sufficient revenue in the future to achieve positive cash flow from operations, and/or should capital be unavailable under the terms of the Line of Credit, additional working capital will be required. Management currently has no intention to raise additional working capital through the sale of equity or debt securities and believes that the cash flow from operations and available borrowings under the Line of Credit will provide sufficient capital necessary to operate the business over the next twelve months. In the event the Company fails to achieve positive cash flow from operations, additional capital is unavailable under the terms of the Line of Credit, and management is otherwise unable to secure additional working capital through the issuance of equity or debt securities, the Companys business would be materially and adversely harmed.\nCash Provided by Operations. Cash provided by operating activities for the three months ended March 31, 2021 was $289,000, as compared to cash provided by operations of $1,000 for the three months ended March 31, 2020. The increase in cash provided by operating activities is primarily attributable to increased focus on managing working capital.\nCash Provided by (Used in) Investing Activities. There was no cash provided by or used in investing activities for the three-month periods ended March 31, 2021 or 2020.\nCash Provided by (Used in) Financing Activities. Cash provided by financing activities for the three months ended March 31, 2021 was $0 as compared to cash provided by financing activities of $2,400,000 during the three months ended March 31, 2020. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nOur business is currently conducted principally in the United States. As a result, our financial results are not materially affected by factors such as changes in foreign currency exchange rates or economic conditions in foreign markets. We do not engage in hedging transactions to reduce our exposure to changes in currency exchange rates, although as the geographical scope of our business broadens, we may do so in the future.\nOur exposure to risk for changes in interest rates related primarily to any borrowings under our existing Line of Credit, and our investments in short-term financial instruments. As of December 31, 2021, the Company had a zero balance under its existing Line of Credit.\nInvestments of our existing cash balances in both fixed-rate and floating-rate interest-earning instruments carry some interest rate risk. The fair value of fixed-rate securities may fall due to a rise in interest rates, while floating-rate securities may produce less income than expected if interest rates fall. Partly as a result of this, our future interest income will vary due to changes in interest rates and we may suffer losses in principal if we are forced to sell securities that have fallen in estimated fair value due to changes in interest rates. However, as substantially all of our cash equivalents consist of bank deposits and short-term money market instruments, we do not expect any material change with respect to our net income as a result of an interest rate change.\nWe do not hold any derivative instruments and do not engage in any hedging activities. ITEM 8. FINANCIAL STATEMENTS\nThe information required hereunder in this Annual Report is set forth in the financial statements and the notes thereto beginning on Page. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\n(a) Evaluation of Disclosure Controls and Procedures.\nIn connection with the filing of this Comprehensive Form 10-K for the period ended December 31, 2021, our management, with the participation of our Chief Executive Officer (CEO) and Chief Financial Officer (CFO), evaluated the effectiveness of the design and operation of our disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act). As a result of this evaluation, our CEO and CFO concluded that our disclosure controls and procedures were not effective due to the material weaknesses described below, which resulted in reporting errors requiring a restatement of our financial statements for the years ended December 31, 2020 and 2019 and our interim financial information for the quarterly periods ended June 30, 2021, March 31, 2021, September 30, 2020, June 30, 2020, March 31, 2020, September 30, 2019, June 30, 2019 and March 31, 2019.\nNotwithstanding the material weaknesses described in Management's Report on Internal Control Over Financial Reporting, our management has concluded that our consolidated financial statements for the periods covered by and included in this Annual Report are prepared in accordance with accounting principles generally accepted in the United States (GAAP) and fairly present, in all material respects, our financial position, results of operations and cash flows for each of the periods presented herein.\n(b) Managements Annual Report on Internal Control over Financial Reporting.\nOur management, including our CEO and CFO, is responsible for establishing and maintaining adequate internal control over our financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Managements establishing and maintaining adequate internal control over financial reporting is based upon the criteria established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (the COSO Framework). A system of internal control over financial reporting should be designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP.\nAn effective internal control system, no matter how well designed, has inherent limitations, including the possibility of human error, the circumvention or overriding of controls, or fraud, and therefore can provide only reasonable assurance with respect to reliable financial reporting. Because of its inherent limitations, our internal control over financial reporting may not prevent or detect all misstatements.\nA material weakness is defined as a deficiency, or combination of deficiencies in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis. Based on this definition, our management, with the participation of our CEO and CFO, evaluated the effectiveness and design of our internal control over financial reporting against the COSO Framework and concluded that our internal control over financial reporting was not effective as of December 31, 2019, 2020, and 2021 due to material weaknesses arising from flaws in our control environment, risk oversight measures, control activities, information processing and communication and our monitoring systems, each of which is described in more detail below. The material weaknesses resulted in reporting errors requiring a restatement of our financial statements for Annual Reports on Form 10-K for the years ended December 31, 2019 and 2020, and each of the interim financial statements for the quarterly periods in 2019, 2020 and 2021 included in our Quarterly Reports on Form 10-Q for the periods ending March 31, 2019, June 30, 2019, September 30, 2019, March 31, 2020, June 30, 2020, September 30, 2020, March 31, 2021, and June 30, 2021 (collectively, the \"Restated Periods\").\nControl environment. We concluded that we did not maintain effective controls in the following areas: (i) managerial functions, procedures and oversight; (ii) organizational structure, delegation of authority and responsibilities; (iii) segregation of duties; (iv) adequacy of trained accounting and financial reporting personnel to ensure that internal control responsibilities were performed effectively and material accounting errors were detected; and (v) maintenance and enforcement of internal control responsibilities, including holding individuals accountable for their internal control responsibilities.\nRisk oversight environment. We did not maintain adequate risk oversight measures related to the (i) identification and assessment of risks that could impact achieving our objectives and (ii) identification and analysis of the potential changes that could affect our internal controls environment.\nControl activities. We concluded that we did not have effective control activities in the following areas: (i) selecting and developing control policies, procedures and activities to mitigate risks, including with respect to the methodologies used to calculate and report financial information and results; and (ii) selecting and implementing information technology and related systems supportive to our internal control over financial reporting.\nInformation processing and communication. We identified deficiencies associated with information processing and communication within our internal control framework. Specifically, we did not effectively communicate objectives and internal control responsibilities throughout the organization which contributed to inadequate documentation of processes and methodologies used to recognize revenue, costs of goods sold, inventory and accounts receivable, hindering clear communication with management, the Board of Directors and our independent auditor.\nMonitoring activities. We concluded that we did not design and implement effective monitoring activities related to (i) selecting, developing, and performing separate evaluations of our internal control over financial reporting; and (ii) evaluating and communicating internal control deficiencies in a timely manner to parties responsible for taking corrective actions.\nThe issues described above resulted in the following errors in our financial statements previously filed with the SEC: improper recognition of revenue, cost of sales, accounts receivable, inventory and the provision for income taxes.\nRemediation Efforts to Address Material Weaknesses\nOur management, including our CFO, has worked with expert accounting consultants and our Audit Committee to design and implement both a short-term and a long-term remediation plan to correct the material weaknesses in our disclosure controls and procedures and our internal control over financial reporting. The following activities highlight our commitment to remediating our identified material weaknesses.\nSince March 2022 and through the filing date of this Comprehensive Form 10-K, we have hired expert accounting consultants to assess our control environment and recommend improvements. In addition, we hired a new highly qualified CFO in August 2022 with extensive public-company experience.\nIn addition to the items noted above, as we continue to evaluate, remediate, and improve our internal control over financial reporting, our management expects to continue to implement additional measures to address control deficiencies and further refine and improve the remediation efforts described above. Specifically, we are developing a checklist of activities based on the criteria established in the COSO Framework against which we will assess the design of entity-level and activity-level controls, and the operational effectiveness of such controls. Deficiencies identified in this process will be addressed by management, including our CEO and CFO. This assessment, any deficiencies, and any remedial actions will be shared and discussed with our Audit Committee and our independent auditors on a quarterly basis.\n(c) Changes in Internal Controls over Financial Reporting.\nWe are still in the process of implementing our remedial actions throughout 2022. Also, during August 2022, we hired a new CFO, a highly qualified individual with public company experience. Management will continue to evaluate and monitor our internal controls as each of the affected areas evolves.\nAll of the changes above were implemented during 2022 outside the period covered by this report. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS AND EXECUTIVE OFFICERS\nDirectors and Executive Officers\nSet forth below is information regarding each of the Companys current directors and executive officers. There are no family relationships between any of our directors or executive officers. Stockholders elect the directors annually. The executive officers serve at the by appointment of the Board of Directors (the Board).\nName\nAge\nTitle\nDayton Judd\nChief Executive Officer and Chairman\nLewis Jaffe\nDirector\nGrant Dawson\nDirector\nSeth Yakatan\nDirector\nTodd Ordal\nDirector\nJakob York\nChief Financial Officer\nPatrick Ryan\nChief Retail officer\nEach of the Companys executive officers and directors will hold office until their successors are duly elected and qualified. The background and principal occupations of each officer and director are as follows:\nDayton Judd has served as a director of the Company since June 2017, is currently the Chairman of the Companys Board of Directors and began serving as the Companys Chief Executive Officer on February 18, 2018. Mr. Judd is the founder and Managing Partner of Sudbury Capital Management (Sudbury). Prior to founding Sudbury, Mr. Judd worked from 2007 through 2011 as a Portfolio Manager at Q Investments, a multi-billion dollar hedge fund in Fort Worth, Texas. Prior to Q Investments, he worked with McKinsey & Company from 1996 through 1998, and again from 2000 through 2007. He graduated from Brigham Young University in 1995 with a Bachelors Degree, summa cum laude, and a Masters Degree, both in accounting. He also earned an M.B.A. with high distinction from Harvard Business School in 2000, where he was a Baker Scholar. Mr. Judd is a Certified Public Accountant.\nThe Companys Nominating and Corporate Governance Committee believes that Mr. Judds significant experience in investing in microcap companies, together with his substantial ownership position in the Companys Common Stock, assists the Board of Directors in the management of the Company and setting goals and objectives to build stockholder value.\nLewis Jaffe has served as a director of the Company since 2010 and served as the Chairman of the Companys Board of Directors from July 2011 to October 2017. Mr. Jaffe became a partner at CEO Coaching International as of January 2021 and continues his role as a Clinical Professor in the school of Entrepreneurship at Loyola Marymount University, a position he has held since the fall of 2014, where he was awarded Professor of the Year in 2016. He was Chief Executive Officer of Movio, a high speed, mobile movie and content downloading service and application, prior to its sale. Prior to Movio, Mr. Jaffe was a principal at Jaffe & Associates (J&A), a consulting and advisory firm that provides strategic and tactical planning to mid-market companies and CEO coaching to their executives. Prior to 2009, Mr. Jaffe was Interim Chief Executive Officer and President of Oxford Media, Inc., where he served from 2006 to 2008. Mr. Jaffe has also served in executive management positions with Verso Technologies, Inc., Wireone Technologies, Inc., Picturetel Corporation, and was also previously a Managing Director of Arthur Andersen. Mr. Jaffe is a graduate of the Stanford Business School Executive Program and holds a Bachelor of Science from LaSalle University. Mr. Jaffe also served on the Board of Directors of Benihana, Inc. as its lead independent director from 2004 to 2012. He is currently on the Board of Directors of Reeds Inc. (NYSE: REED) and Yorktel, a privately held telecommunications company.\nThe Companys Nominating and Corporate Governance Committee believes that Mr. Jaffes experience as a CEO of both public and private companies, and consultant providing strategic and tactical planning to public companies, as well as his corporate governance expertise, provide management and the Board of Directors with a depth of experience, knowledge, systems and best practices to guide corporate strategy and business operations.\nGrant Dawson has served as a director of the Company since November 2013 and is currently a Portfolio Manager of Fixed Income Investments for Polar Asset Management Partners (Polar), where he has worked since 2014. Mr. Dawson brings more than 20 years of experience in finance and has significant board-level experience in corporate governance for public companies. Prior to Polar, he was Managing Director of Fixed Income Investments for Manulife Asset Management, a subsidiary of Manulife Financial Corporation and Vice President and Lead Analyst responsible for corporate debt ratings with Dominion Bond Rating Agency. Prior to such time, Mr. Dawson held various senior management positions in credit management and corporate finance with Nortel and in equity research with Dain Rauscher Ltd. Mr. Dawson earned an M.B.A. from the SMU Cox School of Business, a B.Comm in Finance from the University of Windsor, and holds the Chartered Financial Analyst designation. Additionally, Mr. Dawson is a member of the Institute of Corporate Directors and holds the ICD.D designation.\nThe Companys Nominating and Corporate Governance Committee believes that Mr. Dawsons extensive expertise and knowledge regarding corporate finance and investment banking matters, as well as corporate governance, provides the Company with valuable insight and will assist the Company as it builds a long-term, sustainable capital structure.\nSeth Yakatan has served a director of the Company since September 2015, as Vice President of Business Development for Invion, Ltd. (ASX: IVX) since August 2012, and as a Partner of Katan Associates, Inc., a corporate strategy and finance advisory group, since April 2001. Prior to joining the Companys Board of Directors, Mr. Yakatan served as a director for iSatori, Inc. from September 2014 until the completion of the Companys acquisition of iSatori. Prior to founding Katan Associates, Inc. in 2001, Mr. Yakatan worked in merchant banking at the Union Bank of California, N.A. in the Specialized Lending Media and Telecommunications Group, and as a venture capital analyst with Ventana Growth Funds and Sureste Venture Management. Mr. Yakatan holds an M.B.A. in Finance from the University of California, Irvine, and a Bachelor of Arts in History and Public Affairs from the University of Denver.\nThe Companys Nominating and Corporate Governance Committee believes that Mr. Yakatans 25 years of experience as a life sciences business development and corporate finance professional, including actively supporting small cap and major companies in achieving corporate, financing, and asset monetization objectives, provides the Board of Directors with valuable guidance and expertise based on his extensive knowledge and understanding of banking matters.\nTodd Ordal has served a director of the Company since September 2015, and is the President and founder of Applied Strategy, LLC, a private consulting company founded in 2003 that provides consulting and coaching services to chief executive officers and other executives around the word. Prior to joining the Companys Board of Directors, Mr. Ordal served as a director for iSatori, Inc. from April 2012 until the completion of the Companys acquisition of iSatori. Before founding Applied Strategy, LLC, Mr. Ordal served as Chief Executive Officer of Dore Achievement Centers from December 2002 until November 2004, and President and Chief Executive Officer of Classic Sports Companies from January 2001 until December 2002. Prior to Classic Sport Companies, Mr. Ordal served as a Division President for Kinkos Service Corporation, where he had accountability for $500 million in revenue, 300 stores and 7,000 people, and as a member of the Board of Directors for Kinkos from July 1992 until July 1997. He has also served on several non-profit boards and boards of advisors. Mr. Ordal received his Bachelors Degree in psychology from Morehead State University and his M.B.A. from Regis University.\nThe Companys Nominating and Corporate Governance Committee believes that Mr. Ordals considerable experience with growing successful businesses, as well as his extensive knowledge and understanding of marketing and finance matters, provides the Board of Directors with valuable guidance and insight.\nThere have been no events under any bankruptcy act, no criminal proceedings and no judgments or injunctions material to the evaluation of the ability and integrity of any of the Companys executive officers or directors during the past ten years.\nJakob York has served as the Companys Chief Financial Officer since he joined the Company in August 2022. Prior to joining FitLife, he served as Controller for Greenidge Generation Holdings (NASDAQ: GREE). Prior to Greenidge, Mr. York worked in various controller and financial reporting capacities, primarily at Allied Motion Technologies (NASDAQ:AMOT). Prior to joining Allied Motion, he worked at Pricewaterhouse Coopers as an auditor from 2002 to 2007. He graduated from Brigham Young University in 2002 with a Bachelors Degree and a Masters degrees in Accounting. Mr. York is a Certified Public Accountant.\nPatrick Ryan has served as the Companys Chief Retail Officer since his appointment in June 2016. He brings over 23 years of experience in the retail and wholesale business both domestically and internationally. Since February 2009, Mr. Ryan served as the Companys Vice President of Sales during which time he oversaw multiple retail and wholesale branches and worked collaboratively with key members of management to drive strategic initiatives in sales, employee training and the overall growth of the Company. Prior to that, he served in various sales positions of increasing responsibility since joining the Company in 2004. Mr. Ryan received his Bachelor of Science Degree in Public Relations from Kansas State University.\nCORPORATE GOVERNANCE, BOARD COMPOSITION AND BOARD COMMITTEES\nTerm of Office\nPursuant to our Bylaws, each member of the Board serves from the date they are duly elected and qualified, until the Companys following annual meeting of stockholders or until their death, resignation or removal from office.\nBoard Member Independence\nThe Board believes that a majority of its members are independent directors. The Board has determined that, with the exception of Mr. Judd who also serves as the Companys Chief Executive Officer, all directors are independent as defined by the rules and regulations of the NASDAQ Capital Market.\nBoard Structure\nThe Board does not have a policy regarding the separation of the roles of the Chief Executive Officer and Chair of the Board, as the Board believes it is in the best interest of the Company and its stockholders to make that determination based on the position and direction of the Company and the membership of the Board, from time to time. Currently, Mr. Judd serves as both the Chief Executive Officer and as Chair of the Board. At this time, the Board believes that these combined roles are beneficial to both the daily operations of the Company and the strategic perspective of the Board.\nBoard Risk Oversight\nOur Board administers its oversight function through both regular and special meetings and by frequent telephonic updates with our senior management. A key element of these reviews is gathering and assessing information relating to risks of our business. All businesses are exposed to risks, including unanticipated or undesired events or outcomes that could impact an enterprises strategic objectives, organizational performance and stockholder value. A fundamental part of risk management is not only understanding such risks that are specific to our business, but also understanding what steps management is taking to manage those risks and what level of risk is appropriate. In setting our business strategy, our Board assesses the various risks being mitigated by management and determines what constitutes an appropriate level of risk.\nAlthough our Board has the ultimate oversight responsibility for our risk management process, various committees of our Board also have responsibility for risk management. In particular, the Audit Committee focuses on financial risk, including internal controls, and the assessments of risks reflected in audit reports. Legal and regulatory compliance risks are also reviewed by our Audit Committee. Risks related to our compensation programs are reviewed by the Compensation Committee. Our Board is advised by the committees of significant risks and managements response via periodic updates.\nBoard Meetings\nThe Board held 5 meetings during the year ended December 31, 2021, supplemented by numerous additional discussions by and among a majority of the Board, and numerous actions effectuated by unanimous written consent in lieu of a formal motion and vote during an official meeting. In 2021, incumbent directors attended 100% of the aggregate number of meetings of the Board. The Board also holds independent executive sessions without members of management on an as-needed basis.\nBoard Committees and Charters\nThe Board has three standing committees which consists of the Audit Committee, Compensation Committee, and Nominating and Corporate Governance Committee. The Board appoints the members and committee chair of each committee (based upon the recommendation of the Nominating and Corporate Governance Committee). Each independent director also serves as a member of the standing committees of the Board. Copies of each committee charter are available upon request to the Companys Corporate Secretary at 5214 S. 136th Street, Omaha, Nebraska 68137.\nAudit Committee\nMembers:\nGrant Dawson (Chair)\nLewis Jaffe\nTodd Ordal\nSeth Yakatan\nNumber of Meetings Held:\nThe Audit Committee held 4 meetings during 2021.\nFunctions:\nThe Audit Committee assists the Board in fulfilling its legal and fiduciary obligations in matters involving our accounting, auditing, financial reporting, internal control and legal compliance functions by approving the services performed by our independent accountants and reviewing their reports regarding our accounting practices and systems of internal accounting controls. The Audit Committee also oversees the audit efforts of our independent accountants and takes those actions as it deems necessary to satisfy it that the accountants are independent of management.\nIndependence\nThe members of the Audit Committee each meet the independence standards established by the NASDAQ Capital Market and the SEC for audit committees. In addition, the Board has determined that Messrs. Dawson, Jaffe and Ordal each satisfy the definition of an audit committee financial expert under SEC rules and regulations. These designations do not impose any duties, obligations or liabilities on Messrs. Dawson, Jaffe and Ordal that are greater than those generally imposed on them as members of the Audit Committee and the Board, and their designations as audit committee financial experts does not affect the duties, obligations or liability of any other member of the Audit Committee or the Board.\nCompensation Committee\nMembers:\nGrant Dawson (Chair)\nLewis Jaffe\nTodd Ordal\nSeth Yakatan\nNumber of Meetings Held:\nThe Compensation Committee held 1 meeting during 2021 and handled other matters via unanimous written consent or in board meetings.\nFunctions:\nThe Compensation Committee determines our general compensation policies and the compensation provided to our directors and officers. The Compensation Committee also reviews and determines bonuses for our officers and other employees. In addition, the Compensation Committee reviews and determines equity-based compensation for our directors, officers, employees and consultants and administers our stock option plans and employee stock purchase plan.\nIndependence\nWe believe that the composition of our Compensation Committee meets the criteria for independence under, and the functioning of our Compensation Committee complies with, the applicable requirements of the Sarbanes-Oxley Act of 2002 and current SEC rules and regulations.\nNominating and Corporate Governance Committee\nMembers:\nLewis Jaffe (Chair)\nGrant Dawson\nTodd Ordal\nSeth Yakatan\nNumber of Meetings Held:\nThe Nominating and Corporate Governance Committee held no meetings during 2021, electing instead to address committee matters by action taken by the full Board.\nFunctions:\nThe Nominating and Corporate Governance Committee is responsible for making recommendations to the Board of Directors regarding director candidates and the size and composition of the Board and its committees. In addition, the Nominating and Corporate Governance Committee is responsible for overseeing our corporate governance guidelines and reporting and making recommendations to the Board concerning corporate governance matters.\nIndependence\nWe believe that the composition of our Nominating and Corporate Governance Committee meets the criteria for independence under, and the functioning of our Nominating and Corporate Governance Committee complies with, the applicable requirements of the Sarbanes-Oxley Act of 2002 and current SEC rules and regulations.\nSection 16(A) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934, as amended (Exchange Act), requires the Companys directors and executive officers, and persons who beneficially own more than 10% of a registered class of the Companys equity securities, to file reports of beneficial ownership and changes in beneficial ownership of the Companys securities with the SEC on Forms 3 (Initial Statement of Beneficial Ownership), 4 (Statement of Changes of Beneficial Ownership of Securities) and 5 (Annual Statement of Beneficial Ownership of Securities). Directors, executive officers and beneficial owners of more than 10% of the Companys Common Stock are required by SEC regulations to furnish the Company with copies of all Section 16(a) forms that they file.\nTo our knowledge, based solely on a review of the copies of such reports furnished to us and written representations that no other reports were required, during the fiscal year ended December 31, 2021, management believes that all necessary reports were filed in a timely manner and all filings are current as of the date of this filing.\nCode of Ethics and Business Conduct\nWe have adopted a Code of Ethics that applies to all of our executive officers, directors and employees, which sets forth the business and ethical principles that govern all aspects of our business. This document will be made available in print, free of charge, to any stockholder requesting a copy in writing from the Company. A form of the Code of Conduct and ethics was filed as Exhibit 14.1 to our Annual Report on Form 10-K for the fiscal year ended December 31, 2008.\nIndemnification of Officers and Directors\nAs permitted by Nevada law, the Company will indemnify its directors and officers against expense and liabilities they incur to defend, settle, or satisfy any civil or criminal action brought against them on account of their being or having been Company directors or officers unless, in any such action, they are adjudged to have acted with gross negligence or willful misconduct.\nExclusion of Liability\nThe Nevada Business Corporation Act excludes personal liability for directors for monetary damages based upon any violation of their fiduciary duties as directors, except as to liability for any breach of the duty of loyalty, acts or omissions not in good faith or which involve intentional misconduct or a knowing violation of law, acts in violation of the Nevada Business Corporation Act, or any transaction from which a director receives an improper personal benefit. This exclusion of liability does not limit any right that a director may have to be indemnified and does not affect any director's liability under federal or applicable state securities laws. ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table\nThe following table sets forth information concerning the compensation paid to the Companys Chief Executive Officer, and the Companys two most highly compensated executive officers other than its Chief Executive Officer, who were serving as executive officers as of December 31, 2021 and whose annual compensation exceeded $100,000 during such year (collectively the Named Executive Officers).\nName and Principal Position\nYear\nSalary\n($)\nBonus ($)\nStock\nAwards\n($)\nWarrants/ Option Awards\n($) (1)\nAll Other\nCompensation ($) (2)\nTotal\n($)\nDayton Judd\n$ 326,539\n$ 100,000\n$ 666,344\n$ 184,620\n-\n$ 1,277,503\nChief Executive Officer and\nChair of the Board\n$ 299,017\n$ 80,000\n$ -\n$ -\n$ -\n$ 379,017\nPatrick Ryan\n$ 132,692\n$ 5,000\n$ -\n-\n$ 214,448\n$ 352,140\nChief Retail Officer\n$ 127,692\n$\n$ -\n$ -\n$ 131,899\n$ 260,091\nSusan Kinnaman\n$ 131,538\n$ 8,000\n$ -\n$ -\n$ -\n$ 154,138\nChief Financial Officer\n$ 126,731\n$ 8,000\n$ -\n$ -\n$ -\n$ 134,731\n(1)\nThe amounts in this column represent the grant date fair value of stock option awards computed in accordance with FASB guidance, excluding the effect of estimated forfeitures under which the Named Executive Officer has the right to purchase, subject to vesting, shares of the Companys Common Stock.\n(2)\nAmounts reflect commissions paid to the Named Executive Officer.\nEmployment Agreements\nDayton Judd. Dayton Judd currently serves as the Companys Chief Executive Officer. Effective February 1, 2021, the Board approved an increase of Mr. Judds annual base salary from $300,000 to $330,000. On the same day, the Board also approved the issuance of (i) options to purchase 72,000 shares of the Companys Common Stock, which have a term of five years, an exercise price of $5.24, and which vest ¼ immediately, and ¼ on the second, third, and fourth anniversaries of the grant; (ii) options to purchase 56,000 shares of the Companys Common Stock, which have a term of ten years, and exercise price of $4.76, and which vest ¼ immediately, and ¼ on the second, third, and fourth anniversaries of the grant; and (iii) restricted stock units (RSUs) which convert into one share of the Companys Common Stock upon vesting, and will vest (a) 40,000 shares at such date that the 30 day volume weighted average price (\"VWAP\") for shares of the Companys Common Stock meets or exceeds $7.50, (b) 40,000 shares at such date that the 30 day VWAP for shares of the Companys Common Stock meets or exceeds $9.00, (c) 40,000 shares at such date that the 30 day VWAP for shares of the Companys Common Stock meets or exceeds $10.50, and (d) 40,000 shares at such date that the 30 day VWAP for shares of the Companys common stock meets or exceeds $12.00.\nPatrick Ryan. Under the terms of an Employment Agreement dated June 13, 2019, Mr. Ryan serves in the capacity of Chief Retail Officer until the termination of the Agreement on June 7, 2022. Pursuant to the terms and conditions of the Employment Agreement, Mr. Ryan is entitled to receive the following compensation as consideration for his services to the Company: (i) an annual base salary of $125,000 per year, which increased to $130,000 per year effective on the first anniversary of the Employment Agreement, and to $135,000 per year effective on the second anniversary of the Employment Agreement; (ii) commissions on a monthly basis in arrears in an amount equal to 2.5% of the adjusted gross profit from the sale of franchise exclusive products, less certain expenses and costs, related to the sale of franchise exclusive products to both domestic and international locations, as determined in good faith by Company; (iii) an annual cash bonus, in an amount to be determined by the compensation committee of the Companys Board, in its sole discretion, on an annual basis; and (iv) reimbursement for any out-of-pocket expenses reasonably incurred by Mr. Ryan in connection with the performance of his duties. Mr. Ryan is also entitled to participate in such life insurance, disability, medical, dental, stock plans, retirement plans and other programs as may be made generally available from time to time by the Company for the benefit of similarly situated employees or its employees generally. In addition, pursuant to the terms and conditions of the Employment Agreement, Mr. Ryan shall be subject to certain non-competition and non-solicitation provisions for a period of one year following his termination for any reason.\nOutstanding Equity Awards at Fiscal Year-End\nThe following table sets forth information regarding unexercised options and stock that had not vested and equity incentive awards held by each of the Named Executive Officers outstanding as of December 31, 2021:\nName\nGrant Date\nNumber of\nsecurities\nunderlying\nunexercised\noptions (#)\nexercisable\nNumber of\nsecurities\nunderlying\nunexercised\noptions (#)\nunexercisable\nEquity incentive\nplan awards:\nNumber of\nunderlying\nunexercised\nunearned options (#)\nOption\nexercise\nprice ($)\nOption\nexpiration\ndate\nNumber of\nshares or units\nof stock\nthat have not vested (#)\nMarket value\nof shares\nor units of\nstock that\nhave not\nvested ($)\nDayton Judd\n7/31/2018\n230,000\n-\n-\n$ 0.70\n7/31/2028\nChief Executive Officer and Chairman\n2/5/2021\n18,000 (1)\n54,000\n-\n$ 5.24\n2/5/2026\n2/5/2021\n14,000 (1)\n42,000\n-\n$ 4.76\n2/5/2031\n(1)\nOne-fourth of the stock options vested on the grant date of February 5, 2021, with the remainder vesting in three equal annual installments thereafter, becoming fully vested on February 5, 2024.\nDescription of Equity Compensation Plan\nThe 2019 Omnibus Incentive Plan (the 2019 Plan) was adopted by the Board on July 3, 2019, as approved by a majority of the Companys stockholders at the annual meeting of stockholders on August 16, 2019. The 2019 Plan reserves for issuance 400,000 shares of the Companys Common Stock for issuance as one of four types of equity incentive awards: (i) stock options, (ii) stock appreciation rights, (iii) restricted stock, and (iv) stock units. The 2019 Plan permits the qualification of awards under the plan as performance-based compensation within the meaning of Section 162(m) of the Internal Revenue Code. Upon becoming effective, the Plan replaced, and no further awards were made under the Companys 2010 Incentive Plan.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following table provides information as of December 31, 2021, with respect to the shares of Common Stock that may be issued upon the exercise of options and other rights under our existing equity compensation plans and arrangements. The information includes the number of shares covered by and the weighted average exercise price of outstanding options and other rights and the number of shares remaining available for future grants, excluding the shares to be issued upon exercise of outstanding options and other rights.\nPlan category\nNumber of\nSecurities to be issued upon exercise of outstanding options, warrants and rights\nWeighted-\naverage exercise\nprice of\noutstanding\noptions, warrants\nand rights\nNumber of\nsecurities\nremaining\navailable\nfor future issuance\nunder equity\ncompensation\nplans\n(excluding\nsecurities\nreflected in\nfirst column)\nEquity compensation plans approved by security holders:\n380,300\n$ 3.44\n262,000\nCompensation Committee Interlocks and Insider Participation\nNo executive officers of the Company serve on the Compensation Committee (or in a like capacity) for the Company or any other entity.\nDirector Compensation\nWe currently have five directors, four of whom are considered independent. Non-independent directors who are also employees of the Company do not receive compensation for their services as a director on the Board. For the year ended December 31, 2021, each of our non-employee directors were entitled to receive $40,000 per annum for their services on the Board pursuant to the Companys current director compensation plan, which compensation may be paid in cash, shares of Company Common Stock or a combination thereof, at the option of each individual director.\nThe table below summarizes the compensation paid to our non-employee directors for the fiscal year ended December 31, 2021:\nFees earned or paid in cash\nStock awards\nOption awards\nTotal\nGrant Dawson\n$ 40,000\n$ -\n$ -\n$ 40,000\nLewis Jaffe\n$ 40,000\n$ -\n$ -\n$ 40,000\nTodd Ordal\n$ 40,000\n$ -\n$ -\n$ 40,000\nSeth Yakatan\n$ 40,000\n$ -\n$ -\n$ 40,000 ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nThe following tables set forth information regarding shares of our Common Stock beneficially owned as of October 12, 2022, by:\n(i)\neach of our officers and directors;\n(ii)\nall officers and directors as a group; and\n(iii)\neach person known by us to beneficially own five percent or more of the outstanding shares of our Common Stock. Percent ownership is calculated based on 4,555,957 shares of our Common Stock outstanding at October 12, 2022.\nBeneficial Ownership of our Common Stock\nName and Address of Owner (1)\nTitle of Class\nNumber of\nShares\nOwned\nPercentage\nof Class\nDayton Judd, Chair and Chief Executive Officer (2)\nCommon Stock\n2,881,529\n57.7 %\nJakob York, Chief Financial Officer\nCommon Stock\n4,984\n* %\nPatrick Ryan, Chief Retail Officer\nCommon Stock\n20,420\n* %\nGrant Dawson\nCommon Stock\n76,428\n1.7 %\nLewis Jaffe\nCommon Stock\n-\n- %\nTodd Ordal\nCommon Stock\n30,944\n* %\nSeth Yakatan\nCommon Stock\n-\n- %\nAll Officers and Directors as a group (seven persons)\nCommon Stock\n3,014,305\n60.3 %\n* Less than 1%\n(1)\nThe address of each of the officers and directors is c/o FitLife Brands, Inc., 5214 S. 136th Street, Omaha, NE 68137.\n(2)\nConsists of 519,401 shares of Common Stock held by Mr. Judd personally, including in IRA accounts; 230,000 shares of Common Stock issuable upon the exercise of stock options at $0.70 per share, exercisable within 60 days of October 12, 2022; 36,000 shares of Common Stock issuable upon the exercise of stock options at $5.24 per share, exercisable within 60 days of October 12, 2022; 28,000 shares of Common Stock issuable upon the exercise of stock options at $4.76 per share, exercisable within 60 days of October 12, 2022; 1,924,648 shares of Common Stock held by Sudbury Holdings, LLC; and 143,480 shares of Common Stock issuable upon the exercise of warrants held by Sudbury Holdings, LLC.\nChanges in Control\nThe Company is not aware of any arrangements that may result in a change in control of the Company. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThere were no transaction between the Company and any of its directors, executive officers or any other related persons during the year ended December 31, 2021. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nOur independent registered public accounting firm for the years ended December 31, 2021 and 2020 was Weaver and Tidwell, L.L.P. (Weaver\") Set forth below are the aggregate fees we were billed by Weaver for professional services rendered for the years ended December 31, 2021 and 2020.\nThe following table sets forth the aggregate fees billed by Weaver with respect to audit and non-audit services for the Company during the fiscal years ended December 31, 2021 and 2020:\nYear Ended\nDecember 31,\nAudit fees\n$ 91,000\n$ 84,000\nAudit-related fees\n-\n-\nTax fees\n30,000\n33,000\nAll other fees\n-\n4,900\nTotal\n$ 121,000\n$ 121,900\nAs defined by the SEC, (i) audit fees are fees for professional services rendered by our principal accountant for the audit of our annual financial statements and review of financial statements included in our Form 10-K, or for services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years; (ii) audit-related fees are fees for assurance and related services by our principal accountant that are reasonably related to the performance of the audit or review of our financial statements and are not reported under audit fees; (iii) tax fees are fees for professional services rendered by our principal accountant for tax compliance, tax advice, and tax planning; and (iv) all other fees are fees for products and services provided by our principal accountant, other than the services reported under audit fees, audit-related fees, and tax fees.\nAudit Fees\nDuring the fiscal year ended December 31, 2021 and 2020, the fees for Weaver were approximately $91,000 and $84,000, respectively.\nTax Fees\nDuring the fiscal year ended December 31, 2021 and 2020, the fees paid to Weaver for tax compliance, tax advice and tax planning were $30,000 and $33,000, respectively.\nAll Other Fees\nDuring the fiscal years ended December 31, 2021 and 2020, the fees paid to Weaver for other services were $0 and $4,900, respectively.\nAudit Committee Pre-Approval Policies and Procedures\nUnder the SECs rules, the Audit Committee is required to pre-approve the audit and non-audit services performed by the independent registered public accounting firm in order to ensure that they do not impair the auditors independence. The Commissions rules specify the types of non-audit services that an independent auditor may not provide to its audit client and establish the Audit Committees responsibility for administration of the engagement of the independent registered public accounting firm.\nConsistent with the SECs rules, the Audit Committee Charter requires that the Audit Committee review and pre-approve all audit services and permitted non-audit services provided by the independent registered public accounting firm to us or any of our subsidiaries. The Audit Committee may delegate pre-approval authority to a member of the Audit Committee and if it does, the decisions of that member must be presented to the full Audit Committee at its next scheduled meeting. Accordingly, 100% of audit services and non-audit services described in this Item 14 were pre-approved by the Audit Committee.\nThere were no hours expended on the principal accountants engagement to audit the registrants financial statements for the most recent fiscal year that were attributed to work performed by persons other than the principal accountants full-time, permanent employees.\nPART IV ITEM 15. EXHIBITS AND REPORTS\nExhibits\n2.1\nAgreement and Plan of Merger, by and among the Company, iSatori, Inc., and ISFL Merger Sub, Inc., dated May 18, 2015 (incorporated by reference to Exhibit 2.1 to the Companys Current Report on Form 8-K filed on May 18, 2015).\n2.2\nVoting and Standstill Agreement dated May 18, 2015 (incorporated by reference to Exhibit 4.1 of Schedule 13D (Commission File No. 005-47773) filed by the Company, Stephen Adelé Enterprises, Inc., Stephen Adelé, RENN Universal Growth Investment Trust, PLC, RENN Global Entrepreneurs Fund, Inc. and Russell Cleveland).\n3.1\nArticles of Incorporation (incorporated by reference to Exhibit 3.1 filed with Amendment No. 3 to the Companys Registration Statement on Form SB2 (Commission File No. 333-137170)).\n3.2\nAmendments to Articles of Incorporation (incorporated by reference to Exhibit 3.2 filed with Amendment No. 3 to the Companys Registration Statement on Form SB2 (Commission File No. 333-137170)).\n3.3\nAmended and Restated Bylaws of the Corporation (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on January 25, 2018).\n3.4\nCertificate of Amendment to Articles of Incorporation (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on September 13, 2010).\n3.5\nCertificate of Amendment to Articles of Incorporation to change name to FitLife Brands, Inc. (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on October 1, 2013).\n3.6\nCertificate of Amendment to Articles of Incorporation to effect 1-for-10 reverse split (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on October 1, 2013).\n3.7\nCertificate of Designations, Preferences and Rights of the Series A Convertible Preferred Stock, dated November 13, 2018 (incorporated by reference to Exhibit 3.2 to the Companys Quarterly Report on Form 10-Q filed on November 14, 2018).\n3.8\nCertificates of Change, dated April 11, 2019 (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on April 15, 2019).\n3.9\nCertificate of Designations, Preferences and Rights of the Series B Junior Preferred Stock, dated March 3, 2021 (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on March 4, 2021).\n3.10\nCertificate of Change for FitLife Brands, Inc., effective as of December 2, 2021 (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on December 7, 2021).\n4.1\nForm of Warrant, dated November 13, 2018 (incorporated by reference to Exhibit 4.1 to the Companys Quarterly Report on Form 10-Q filed on November 14, 2018).\n4.2\nTax Benefit Preservation Plan, dated February 26, 2021 (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on March 4, 2021).\n10.1\nSecond Amendment to Asset Purchase Agreement (incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed on October 6, 2009).\n10.2\nAssignment of Name (incorporated by reference to Exhibit 10.6 to the Companys Current Report on Form 8-K filed on October 6, 2009).\n10.3\nDemand Promissory Note (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on September 11, 2015).\n10.4\nSecurity Agreement by and among the Company, Stephen Adele Enterprises, and Stephen Adele, dated September 11, 2015 (incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on September 11, 2015).\n10.5\nAmendment No. 1 to Employment Agreement, dated May 1, 2013, by and between the Company and Michael Abrams (incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on April 26, 2017).\n10.6\nLoan Modification Agreement, dated August 28, 2017, by and between the Company and U.S. National Bank Association Bank (incorporated by reference to Exhibit 10.1 filed to the Companys Current Report on Form 8-K filed on August 31, 2017).\n10.7\nMerchant Agreement by and between NDS Nutrition, Inc., iSatori, Inc., and Compass Bank, d/b/a Commercial Billing Service (incorporated by reference to Exhibit 3.1 filed to the Companys Current Report on Form 8-K filed on January 25, 2018).\n10.8\nContinuing Guarantee of FitLife Brands, Inc. (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on on January 25, 2018).\n10.9\nConsulting Services Agreement, by and between the Company and Dayton Judd, dated March 13, 2018 (incorporated by reference to Exhibit 10.26 to the Companys Annual Report on Form 10-K filed on April 17, 2018).\n10.10\nForm of Subscription Agreement, dated November 13, 2018 (incorporated by reference to Exhibit 10.1 to the Companys Quartelry Report on Form 10-Q filed on November 14, 2018).\n10.11\nPromissory Note issued to Sudbury Capital Fund, LP dated December 26, 2018 (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on December 26, 2018).\n10.12\nPromissory Note issued to Dayton Judd dated December 26, 2018 (incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on December 26, 2018).\n10.13\nEmployment Agreement, by and between FitLife Brands, Inc. and Patrick Ryan, dated June 13, 2019 (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on June 18, 2019).\n10.14\n2019 Omnibus Incentive Plan (incorporated by reference to Appendix A to the Definitive Proxy Statement on Schedule 14A filed on July 12, 2019).\n10.15\nRevolving Line of Credit Agreement, dated as of September 24, 2019, between the Company and Mutual of Omaha Bank (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on September 26, 2019).\n10.16\nNote Payable Agreement by and between FitLife Brands, Inc. and CIT Bank, N.A. dated April 27, 2020 (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on May 1, 2020).\n14.1\nCode of Ethics (incorporated by reference to Exhibit 14.1 to the Companys Annual Report on Form 10-K filed on March 27, 2009).\n16.1\nLetter from Tarvaran, Askelson & Company, LLP, dated April 25, 2017 (incorporated by reference to Exhibit 16.1 to the Companys Current Report on Form 8-K filed on April 26, 2017).\n16.2\nLetter from Weinberg & Company, P.A., dated September 17, 2019 (incorporated by reference to Exhibit 16.1 to the Companys Current Report on Form 8-K filed on September 17, 2019).\nList of Subsidiaries\n31.1\nCertification of Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act.\n31.2\nCertification of Principal Financial and Accounting Officer Pursuant to Section 302 of the Sarbanes-Oxley Act.\n32.1\nCertification of Chief Executive Officer Pursuant to Section 906 of the Sarbanes-Oxley Act.\n32.2\nCertification of Chief Accounting Officer Pursuant to Section 906 of the Sarbanes-Oxley Act.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, there unto duly authorized.\nRegistrant\nFitLife Brands, Inc.\nDate: October 13, 2022\nBy: /s/ Dayton Judd\nDayton Judd\nChief Executive Officer (Principal Executive Officer)\nDate: October 13, 2022\nBy: /s/ Jakob York\nJakob York\nChief Financial Officer (Principal Financial Officer)\nIn accordance with the Securities Exchange Act of 1934, as amended, this report has been signed below by the following persons on behalf of the Company and in the capacities and on the dates indicated.\nDate: October 13, 2022\nBy: /s/ Dayton Judd\nDayton Judd\nChief Executive Officer and Chair of the Board\nDate: October 13, 2022\nBy: /s/ Grant Dawson\nGrant Dawson\nDirector\nDate: October 13, 2022\nBy: /s/ Lewis Jaffe\nLewis Jaffe\nDirector\nDate: October 13, 2022\nBy: /s/ Todd Ordal\nTodd Ordal\nDirector\nDate: October 13, 2022\nBy: /s/ Seth Yakatan\nSeth Yakatan\nDirector\nITEM 8. FINANCIAL STATEMENTS\nFITLIFE BRANDS, INC.\nPage\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM (PCAOB ID: 410)\nCONSOLIDATED FINANCIAL STATEMENTS:\nConsolidated Balance Sheets at December 31, 2021 and 2020\nConsolidated Statements of Operations for the years ended December 31, 2021 and 2020\nConsolidated Statement of Stockholders Equity for the years ended December 31, 2021 and 2020\nConsolidated Statements of Cash Flows for the years ended December 31, 2021 and 2020\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders\nFitLife Brands, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of FitLife Brands, Inc. and Subsidiaries (the Company) as of December 31, 2021 and 2020, and the related consolidated statements of operations, stockholders equity, and cash flows for the years then ended, and the related notes to the consolidated financial statements (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2021 and 2020, and the results of its operations and its cash flows for each of the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nRestatement to Correct Previously Issued Consolidated Financial Statements\nAs discussed in Note 11 to the financial statements, the 2020 financial statements have been restated to correct misstatements discovered during the current year.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entity's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nProduct Returns - Managements Estimate of Product Returns including Discontinued or Expired Product. Refer to Note 2 to the Financial Statements\nCritical Accounting Matter Description\nIn measuring revenue and determining the consideration the Company is entitled to as part of a contract with a customer, the Company takes into account related elements of variable consideration, including, but not limited to, product returns. The allowance for product returns is based on specific terms and conditions included in the customer agreements, historical experience and managements expectation of future returns.\nWe identified managements estimate of product returns, including discontinued or expired product as a critical audit matter because of the judgments necessary for management to estimate and monitor, among other things, remaining shelf life, sell-through data, history of actual and estimated future returns, and information provided by customers regarding their inventory levels. The types of arrangements and complexity of information required a high degree of auditor judgment and an increased extent of effort when performing audit procedures to audit managements estimates and evaluating the results of those procedures.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to managements estimate of product returns included the following:\n●\nWe obtained an understanding of the design and implementation of managements controls and evaluated managements review of the inputs used and assumptions applied in the product returns calculation.\n●\nTo assess the reasonableness of the product returns estimate, we performed procedures that included, among others, testing managements historical return rate calculation and the completeness and accuracy of sales and product returns data used in the calculation. We evaluated the historical accuracy of managements estimate, read contracts and performed direct inquiries with management to identify any terms or conditions not included in customer contracts that could impact the estimate. We performed revenue cutoff testing to assess if there were unusual patterns at period end not considered in the Companys analyses, performed lookback analyses using actual historical data to evaluate the forecasted amounts, which included testing credits issued and payments made throughout year, assessed subsequent events to determine whether there was any new information that would require adjustment to the estimate, and evaluated overall trends in product returns based on preceding years.\nIncome taxes - Realizability of Deferred Tax Assets - Refer to Note 9 to the Financial Statements\nCritical Accounting Matter Description\nFor the years ended December 31, 2021 and 2020, the Company recorded a provision (benefit) for income taxes of $1,298,000 and ($4,415,000), respectively, driven primarily by an income tax benefit of ($3,045,000) and ($4,339,000), respectively resulting from the elimination of the valuation reserve against the Companys net operating losses and other deferred tax assets in 2020. The carrying amount of deferred tax assets are reviewed at each reporting date and reduced to the extent that it is no longer probable that all or part of the deferred tax assets will be utilized, based on positive and negative evidence, including that sufficient future taxable income will be available.\nManagements analysis of the realizability of its deferred tax assets, including the recognition, measurement, and disclosure of deferred tax assets was significant to our audit because the amounts are material to the consolidated financial statements. Auditing managements assessment is complex and involves significant judgment as the Companys ability to generate taxable income sufficient to utilize the assets may be impacted by various economic and industry conditions.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to managements realizability of deferred tax assets included the following:\n●\nWe obtained an understanding of the design and implementation of managements controls relating to the realizability of deferred tax assets, including projections of future taxable income and the future reversal of existing taxable temporary differences.\n●\nAmong other audit procedures performed, we evaluated the positive and negative evidence in assessing whether the deferred tax assets are more likely than not to be utilized, including evaluating the trends of both the historical financial results and the projected sources of taxable income. Our audit procedures also included testing the calculations of existing temporary book-tax differences, the scheduling of the reversal of existing temporary taxable differences and of the appropriate character of income. We evaluated the assumptions used by the Company to develop projections of future taxable income and tested the completeness and accuracy of the underlying data used in its projections. For example, we compared the projections of future taxable income with the actual results of prior periods as well as managements consideration of current industry and economic trends.\nWEAVER AND TIDWELL, L.L.P.\nWe have served as the Companys auditor since 2019.\nFort Worth, Texas\nOctober 13, 2022\nFITLIFE BRANDS, INC.\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\nDecember 31,\nAs Restated\nASSETS:\nCURRENT ASSETS\nCash\n$ 9,897,000 $ 6,336,000\nAccounts receivable, net of allowance of doubtful accounts, $55,000 and $51,000, respectively\n945,000 1,797,000\nInventories, net of allowance for obsolescence of $56,000 and $56,000, respectively\n6,520,000 3,529,000\nIncome tax receivable\n- 40,000\nPrepaid expenses and other current assets\n322,000 52,000\nTotal current assets\n17,684,000 11,754,000\nProperty and equipment, net\n70,000 98,000\nRight of use asset, net of amortization of $322,000 and $272,000, respectively\n158,000 208,000\nIntangibles, net of amortization of $30,000 and $0, respectively\n192,000 -\nGoodwill\n358,000 225,000\nDeferred tax asset\n3,045,000 4,339,000\nTOTAL ASSETS\n$ 21,507,000 $ 16,624,000\nLIABILITIES AND STOCKHOLDERS EQUITY:\nCURRENT LIABILITIES:\nAccounts payable\n$ 2,880,000 $ 3,246,000\nAccrued expense and other liabilities\n491,000 498,000\nProduct returns\n632,000 345,000\nLease liability - current portion\n55,000 50,000\nTotal current liabilities\n4,058,000 4,139,000\nLong-term lease liability, net of current portion\n103,000 158,000\nPPP loan\n- 453,000\nTOTAL LIABILITIES\n4,161,000 4,750,000\nSTOCKHOLDERS EQUITY:\nPreferred stock, $0.01 par value, 10,000,000 shares authorized, none outstanding as of December 31, 2021 and December 31, 2020\n- -\nCommon stock, $.01 par value, 60,000,000 shares authorized; 4,552,485 and 4,243,272 issued and outstanding as of December 31, 2021 and December 31, 2020, respectively\n46,000 42,000\nTreasury stock, 881,311 and 842,524 shares, respectively\n(2,087,000 )\n(1,790,000 )\nAdditional paid-in capital\n32,529,000 32,174,000\nAccumulated deficit\n(13,142,000 )\n(18,552,000 )\nTOTAL STOCKHOLDERS EQUITY\n17,346,000 11,874,000\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY\n$ 21,507,000 $ 16,624,000\nThe accompanying notes are an integral part of these consolidated financial statements\nFITLIFE BRANDS, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYears ended\nDecember 31,\nAs Restated\nRevenue\n$ 27,913,000 $ 22,111,000\nCost of goods sold\n15,409,000 12,574,000\nGross profit\n12,504,000 9,537,000\nOPERATING EXPENSES:\nGeneral and administrative\n3,651,000 3,047,000\nSelling and marketing\n2,564,000 2,106,000\nDepreciation and amortization\n59,000 38,000\nTotal operating expenses\n6,274,000 5,191,000\nOPERATING INCOME\n6,230,000 4,346,000\nOTHER EXPENSES (INCOME)\nInterest expense (income)\n(25,000 )\n6,000\nGain on settlement\n- (70,000 )\nPPP loan forgiveness, including accrued interest\n(453,000 )\n-\nTotal other expenses (income)\n(478,000 )\n(64,000 )\nPRE-TAX NET INCOME\n6,708,000 4,410,000\nPROVISION (BENEFIT) FOR INCOME TAXES\n1,298,000 (4,415,000 )\nNET INCOME\n$ 5,410,000 $ 8,825,000\nNET INCOME PER SHARE:\nBasic\n$ 1.23 $ 2.08\nDiluted\n$ 1.13 $ 1.94\nBasic weighted average common shares\n4,406,614 4,232,828\nDiluted weighted average common shares\n4,801,370 4,549,396\nThe accompanying notes are an integral part of these consolidated financial statements\nFITLIFE BRANDS, INC.\nCONSOLIDATED STATEMENT OF STOCKHOLDERS' EQUITY\nCommon Stock\nTreasury\nAdditional Paid-in\nAccumulated\nShares\nAmount\nStock\nCapital\nDeficit\nTotal\nYEAR ENDED DECEMBER 31, 2021\nDECEMBER 31, 2020 4,243,272 $ 42,000 $ (1,790,000 )\n$ 32,174,000 $ (18,552,000 )\n$ 11,874,000\nRepurchase of common stock\n(36,092 )\n- (260,000 )\n- - (260,000 )\nExercise of stock options\n65,305 1,000 (37,000 )\n90,000 - 54,000\nRepurchase of options\n- - - (184,000 )\n- (184,000 )\nStock-based compensation\n280,000 3,000 - 449,000 - 452,000\nNet income\n- - - - 5,410,000 5,410,000\nDECEMBER 31, 2021\n4,552,485 $ 46,000 $ (2,087,000 )\n$ 32,529,000 $ (13,142,000 )\n$ 17,346,000\nYEAR ENDED DECEMBER 31, 2020 (AS RESTATED)\nDECEMBER 31, 2019 1,054,516 $ 12,000 $ (1,619,000 )\n$ 32,055,000 $ (27,377,000 )\n$ 3,071,000\nFair value of common stock issued for services\n1,202 - - 15,000 - 15,000\nRepurchase of common stock\n(11,900 )\n- (171,000 )\n- - (171,000 )\nExercise of stock options\n17,000 - - 71,000 - 71,000\nForward split at a 4:1 ratio 3,182,454 30,000 - (30,000 ) - -\nStock-based compensation\n- - - 63,000 - 63,000\nNet income\n- - - - 8,825,000 8,825,000\nDECEMBER 31, 2020\n4,243,272 $ 42,000 $ (1,790,000 )\n$ 32,174,000 $ (18,552,000 )\n$ 11,874,000\nThe accompanying notes are an integral part of these consolidated financial statements\nFITLIFE BRANDS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears ended December 31,\nAs Restated\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income\n$ 5,410,000 $ 8,825,000\nAdjustments to reconcile net income to net cash used in operating activities:\nDepreciation and amortization\n59,000 38,000\nRight of use asset amortization and lease liability\n50,000 -\nAllowance for doubtful accounts\n4,000 25,000\nAllowance for inventory obsolescence\n- (74,000 )\nFair value of stock and options issued for services\n452,000 78,000\nForgiveness of PPP loan, including accrued interest (453,000 )\n-\nChanges in operating assets and liabilities:\nAccounts receivable - trade\n974,000 (104,000 )\nInventories\n(2,945,000 )\n(97,000 )\nDeferred tax asset\n1,294,000 (4,339,000 )\nPrepaid expense\n(270,000 )\n20,000\nIncome tax receivable\n40,000 (40,000 )\nSecurity deposit\n- 10,000\nAccounts payable\n(366,000 )\n1,228,000\nLease liability\n(50,000 )\n-\nAccrued liabilities and other liabilities\n(6,000 )\n72,000\nProduct returns\n287,000 79,000\nNet cash provided by operating activities\n4,480,000 5,721,000\nCASH FLOWS FROM INVESTING ACTIVITIES:\nCash paid for acquisition\n(529,000 )\n-\nNet cash used in investing activities\n(529,000 )\n-\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from exercise of stock options\n54,000 71,000\nProceeds from Paycheck Protection Program\n- 450,000\nRepurchases of common stock and options\n(444,000 )\n(171,000 )\nNet cash provided by (used in) financing activities\n(390,000 )\n350,000\nCHANGE IN CASH\n3,561,000 6,071,000\nCASH, BEGINNING OF PERIOD\n6,336,000 265,000\nCASH, END OF PERIOD\n$ 9,897,000 $ 6,336,000\nSupplemental disclosure operating activities\nCash paid for interest\n$ - $ 12,000\nCash paid (refunded) for income taxes\n$ (42,000 )\n$ -\nSupplemental noncash financing activities\nForgiveness of PPP loan, including accrued interest $ 453,000 -\nThe accompanying notes are an integral part of these condensed consolidated financial statements\nFITLIFE BRANDS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED DECEMBER 31, 2021 AND 2020\nNOTE 1. DESCRIPTION OF BUSINESS\nSummary\nFitLife Brands, Inc. (the Company) is a national provider of innovative and proprietary nutritional supplements for health-conscious consumers marketed under the following brand names: (i) NDS Nutrition, PMD Sports, SirenLabs, CoreActive, Nutrology, and Metis Nutrition (together, NDS Products); and (ii) iSatori, BioGenetic Laboratories, and Energize (together, the \"iSatori Products\"). The Company distributes the NDS Products principally through franchised General Nutrition Centers, Inc. (GNC) stores located both domestically and internationally, and, with the launch of Metis Nutrition, through corporate GNC stores in the United States. The iSatori Products are sold through more than 17,000 retail locations, which include specialty, mass, and online.\nFitLife Brands is headquartered in Omaha, Nebraska. For more information on the Company, please go to www.fitlifebrands.com. The Companys Common Stock, par value $0.01 per share (Common Stock), trades under the symbol FTLF on the OTC Pink market.\nRecent Developments\nForward Stock Split\nThe Board of Directors of the Company (the Board) approved a forward stock split of the Companys authorized, issued and outstanding shares of common stock, par value $0.01 per share (the Common Stock), at a ratio of 4-for-1 (the Forward Split). The Forward Split was effective as of December 2, 2021 and began trading on such basis on December 8, 2021. Prior to the Forward Split, the Company was authorized to issue 15.0 million shares of Common Stock. As a result of the Forward Split, the Company is now authorized to issue 60.0 million shares of Common Stock. The Forward Split did have any effect on the stated par value of the Common Stock and did not affect the Companys authorized preferred stock.\nAll references in this Annual Report to number of common shares, price per share and weighted average number of shares outstanding have been adjusted to reflect the Forward Split on a retroactive basis as of the earliest period presented, unless otherwise noted.\nNutrology Asset Purchase\nOn April 7, 2021, the Company purchased substantially all of the assets of Triple Impact Corporation, a New Jersey corporation doing business as Nutrology, a nutritional supplement company catering to consumers who prioritize all-natural and plant-based nutritional supplements. See Note 3 for additional detail regarding the acquisition.\nTax Benefits Preservation Plan\nOn February 26, 2021, the Board declared a dividend distribution of one right (a Right) for each outstanding share of Common Stock to stockholders of record at the close of business on February 26, 2021 (the Record Date). Each Right entitles its holder, under the circumstances described below, to purchase from the Company one one-thousandth of a share of Series B Junior Participating Preferred Stock of the Company, par value $0.01 per share (the Series B Preferred), at an exercise price of $100.00 per Right, subject to adjustment. The description and terms of the Rights are set forth in the tax benefits preservation plan (the Tax Benefits Preservation Plan), dated as of February 26, 2021, between the Company and Colonial Stock, as rights agent (and any successor rights agent, the Rights Agent).\nF-\nThe Company adopted the Tax Benefits Preservation Plan in order to protect shareholder value against a possible limitation on the Companys ability to use its Net Operating Losses (NOLs) and certain other tax benefits to reduce potential future U.S. federal income tax obligations. The NOLs are a valuable asset to the Company, which may inure to the benefit of the Company and its stockholders. However, if the Company experiences an ownership change, as defined in Section 382 of the Internal Revenue Code (IRC), its ability to fully utilize the NOLs and certain other tax benefits will be substantially limited and the timing of the usage of the NOLs and such other benefits could be substantially delayed, which could significantly impair the value of those assets. Generally, an ownership change occurs if the percentage of the Companys stock owned by one or more of its five-percent shareholders (as such term is defined in Section 382 of the IRC) increases by more than 50 percentage points over the lowest percentage of stock owned by such stockholder or stockholders at any time over a three-year period. The Tax Benefits Preservation Plan is intended to prevent against such an ownership change by deterring any person or group from acquiring beneficial ownership of 4.99% or more of the Companys securities. Subsequent to the end of the fiscal year, the Tax Benefits Preservation Plan expired by its terms on March 1, 2022, and is no longer in effect.\nShare Repurchase Plan\nOn February 1, 2021, the Board approved an additional amendment to the previously authorized share repurchase program initially approved by the Board on August 16, 2019, as amended on September 23, 2019 and November 6, 2019 (Share Repurchase Program). Under the terms of the amendment, the Company is authorized to repurchase up to $5.0 million of the Company's Common Stock, warrants to purchase shares of the Company's Common Stock (\"Warrants\"), and other securities issued by the Company (\"Securities\") over the next 24 months at a purchase price, in the case of Common Stock, equal to the fair market value of the Company's Common Stock on the date of purchase, and in the case of Warrants and Securities, at a purchase price determined by management, with the exact date and amount of such purchases to be determined by management.\nDuring the year ended December 31, 2021, the Company repurchased 36,092 shares of Common Stock under the Share Repurchase Program. The Company also purchased 50,840 dilutive in-the-money options from employees at a discount to their intrinsic value for total consideration of $184,000.\nTrade date\nTotal\nnumber\nof shares\npurchased\nAverage\nprice paid\nper share\nTotal number of\nshares\npurchased\nas part of\npublicly\nannounced\nprograms\nDollar\nvalue of\nshares that\nmay yet be\npurchased\nFirst quarter ended March 31, 2021\n- $ - - $ 3,610,917\nSecond quarter ended June 30, 2021\n36,092 $ 7.13 36,092 $ 3,169,917\nThird quarter ended September 30, 2021\n- $ - - $ 3,169,917\nFourth quarter ended December 31, 2021\n- $ - - $ 3,169,917\nSubtotal\n36,092 $ 7.13 36,092 $ 3,169,917\nCOVID-19 Pandemic\nThe COVID-19 pandemic has had an effect on the Companys employees, business and operations and those of its customers, vendors and business partners. In this respect, the temporary or permanent closure of some of our retail partners store locations and the stay-at-home orders that occurred early in the pandemic negatively affected our results from operations, although much of the impact has been offset by an increase in revenue attributable to online sales, and increased sales during the more recent quarters. Our future financial position and operating results could be materially and adversely affected in the event that a resurgence of COVID-19 cases leads to new stay-at-home orders and/or further disruptions in both our supply chain and manufacturing lead-times, which could lower demand for the Companys products and/or prevent the Company from producing and delivering its products in a timely manner, although the extent of these effects cannot be determined at this time. The Company expects to continue to assess the evolving impact of the COVID-19 pandemic and intends to make adjustments to its business and operations accordingly.\nF-\nCARES Act\nThe Coronavirus Aid, Relief, and Economic Security Act (\"CARES Act\") was enacted on March 27, 2020 in the United States. On April 27, 2020, the Company received proceeds from a loan in the amount of $449,700 from its lender, CIT Bank, N.A. (the PPP Lender), pursuant to approval by the U.S. Small Business Administration (the SBA) for the PPP Lender to fund the Companys request for a loan under the SBAs Paycheck Protection Program (PPP Loan) created as part of the CARES ACT administered by the SBA (the Loan Agreement). In accordance with the requirements of the CARES Act, the Company used the proceeds from the PPP Loan primarily for payroll costs, covered rent payments, and covered utilities during the eight-week period commencing on the date of loan approval. The PPP Loan was scheduled to mature on April 27, 2022, had a 1.0% interest rate, and was subject to the terms and conditions applicable to all loans made pursuant to the Paycheck Protection Program as administered by the SBA under the CARES Act. The Company was informed by the PPP Lender and the SBA that the full balance of the PPP Loan, including accrued interest, was forgiven on January 15, 2021.\nThe CARES Act permits employers to defer payment of the employer portion of payroll taxes owed on wages paid through December 31, 2020 for a period of up to two years. Through December 31, 2021, the Company deferred payment of $45,000, which amount has been expensed and is included in accrued liabilities.\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThe Company prepares its financial statements in accordance with accounting principles generally accepted in the United States of America. Significant accounting policies are as follows:\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and NDS Nutrition Products, Inc. Intercompany accounts and transactions have been eliminated in the consolidated financial statements.\nUse of Estimates and Assumptions\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States (GAAP) requires management to make estimates and assumptions that affect (i) the reported amounts of assets and liabilities, (ii) the disclosure of contingent assets and liabilities known to exist as of the date the financial statements are published, and (iii) the reported amount of net sales and expense recognized during the periods presented.\nThose estimates and assumptions include estimates for reserves of uncollectible accounts receivable, allowance for inventory obsolescence, depreciable lives of property and equipment, analysis of impairment of goodwill, realization of deferred tax assets, accruals for potential liabilities and assumptions made in valuing stock instruments issued for services. Management evaluates these estimates and assumptions on a regular basis. Actual results could differ from those estimates.\nRevenue Recognition\nThe Companys revenue is comprised of sales of nutritional supplements to consumers, primarily through GNC stores.\nThe Company accounts for revenues in accordance with Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers. The underlying principle of ASC 606 is to recognize revenue to depict the transfer of goods or services to customers at the amount expected to be collected. ASC 606 creates a five-step model that requires entities to exercise judgment when considering the terms of contract(s), which includes (1) identifying the contract(s) or agreement(s) with a customer, (2) identifying our performance obligations in the contract or agreement, (3) determining the transaction price, (4) allocating the transaction price to the separate performance obligations, and (5) recognizing revenue as each performance obligation is satisfied. Under ASC 606, revenue is recognized when performance obligations under the terms of a contract are satisfied, which occurs for the Company upon shipment or delivery of products to our customers based on written sales terms, which is also when control is transferred. Revenue is measured as the amount of consideration we expect to receive in exchange for transferring the products to a customer.\nF-\nAll products sold by the Company are distinct individual products and consist of nutritional supplements and related supplies. The products are offered for sale solely as finished goods, and there are no performance obligations required post-shipment for customers to derive the expected value from them. Other than promotional activities, which can vary from time to time but nevertheless are entirely within the Companys control, contracts with customers contain no incentives or discounts that could cause revenue to be allocated or adjusted over time.\nControl of products we sell transfers to customers upon shipment from our facilities or delivery to our customers, and the Companys performance obligations are satisfied at that time. Shipping and handling activities are performed before the customer obtains control of the goods and therefore represent a fulfillment activity rather than promised goods to the customer. Payment for sales are generally made by check, credit card, or wire transfer. Historically the Company has not experienced any significant payment delays from customers.\nFor direct-to-consumer sales, the Company allows for returns within 30 days of purchase. Our wholesale customers such as GNC, may return products to the Company under certain circumstances, which include expired or soon-to-be-expired products located in GNC corporate stores or at any of its distribution centers, and products that are subject to a recall or that contain an ingredient or ingredients that are subject to a recall by the U.S. Food and Drug Administration.\nA right of return does not represent a separate performance obligation, but because customers are allowed to return products, the consideration to which the Company expects to be entitled is variable. Upon evaluation of returns, the Company determined that less than 5% of products are returned, and therefore believes it is probable that such returns will not cause a significant reversal of revenue in the future. We assess our contracts and the reasonableness of our conclusions on a quarterly basis.\nCustomer Concentration\nTotal net sales to GNC during 2021 and 2020 were $19,772,000, and $15,833,000, respectively, representing 71% of total revenue for both years. Accounts receivable attributable to GNC before adjusting for product return reserves as of December 31, 2021 and 2020 were $850,000 and $1,892,000, respectively, representing 74% and 89% of the Companys total accounts receivable balance, respectively. The loss of this customer would have a material adverse effect on the Companys business, financial condition, and results of operation.\nAccounts Receivable and Allowance for Doubtful Accounts\nAll of the Companys accounts receivable balance is related to trade receivables. Trade accounts receivable are recorded at the invoiced amount and do not bear interest. The allowance for doubtful accounts is the Companys best estimate of the amount of probable credit losses in its existing accounts receivable. The Company will maintain allowances for doubtful accounts, estimating losses resulting from the inability of its customers to make required payments for products. Accounts with known financial issues are first reviewed and specific estimates are recorded. The remaining accounts receivable balances are then grouped into categories by the amount of days the balance is past due, and the estimated loss is calculated as a percentage of the total category based upon past history. Account balances are charged off against the allowance when it is probable that the receivable will not be recovered. We maintain an insurance policy for iSatori Products for international shipments, which protects the Company in the event the international distributor does not or cannot remit payment.\nAs of December 31, 2021 and 2020, the Company had provided a reserve for doubtful accounts of $55,000 and $51,000, respectively.\nF-\nProduct Returns, Sales Incentives and Other Forms of Variable Consideration\nIn measuring revenue and determining the consideration the Company is entitled to as part of a contract with a customer, the Company takes into account the related elements of variable consideration. Such elements of variable consideration include, but are not limited to, product returns and sales incentives, such as markdowns and margin adjustments. For these types of arrangements, the adjustments to revenue are recorded at the later of when (i) the Company recognizes revenue for the transfer of the related products to the customers, or (ii) the Company pays, or promises to pay, the consideration.\nWe currently have a 30-day product return policy for NDS Products, which allows for a 100% sales price refund for the return of unopened and undamaged products purchased from us online through one of our websites. Product sold to GNC may be returned from store shelves or the distribution center in the event product is damaged, short dated, expired or recalled. Information for product returns is received on regular basis and adjusted for accordingly. Adjustments for returns are based on factual information and historical trends for both NDS products and iSatori products and are specific to each distribution channel. We monitor, among other things, remaining shelf life and sell through data on a weekly basis. If we determine there are any risks or issues with any specific products, we accrue sales return allowances based on managements assessment of the overall risk and likelihood of returns in light of all information available.\nGNC maintains a customer satisfaction program that allows customers to return product to the store for credit or refund. Subject to certain terms and restrictions, GNC may require reimbursement from vendors for unsaleable returned product through either direct payment or credit against a future invoice. We also support a product return policy for iSatori Products, whereby customers can return product for credit or refund. Product returns can and do occur from time to time and can be material.\nFor the sale of goods with a right of return, the Company estimates variable consideration using the most likely amount method and recognizes revenue for the consideration it expects to be entitled to when control of the related product is transferred to the customers and records a product returns liability for the amount it expects to credit back its customers. Under this method, certain forms of variable consideration are based on expected sell-through results, which requires subjective estimates. These estimates are supported by historical results as well as specific facts and circumstances related to the current period. In addition, the Company recognizes an asset included in Inventories, net and a corresponding adjustment to Cost of Goods Sold for the right to recover goods from customers associated with the estimated returns. The product returns liability and corresponding asset include estimates that directly impact reported revenue. These estimates are calculated based on a history of actual returns, estimated future returns and information provided by customers regarding their inventory levels. Consideration of these factors results in an estimate for anticipated sales returns that reflects increases or decreases related to seasonal fluctuations. In addition, as necessary, product returns liability and the related assets may be established for significant future known or anticipated events. The types of known or anticipated events that are considered, and will continue to be considered, include, but are not limited to, changes in the retail environment and the Company's decision to continue to support new and existing products.\nInformation for product returns is received on regular basis and adjusted for accordingly. Adjustments for returns are based on factual information and historical trends for both NDS products and iSatori products and are specific to each distribution channel. We monitor, among other things, remaining shelf life and sell-through data on a weekly basis. If we determine there are any risks or issues with any specific products, we accrue sales return allowances based on managements assessment of the overall risk and likelihood of returns in light of all information available.\nTotal allowance for product returns, sales returns and incentive programs as of December 31, 2021 and 2020 amounted to $632,000 and $345,000, respectively.\nF-\nCost of Goods Sold\nCost of goods sold is comprised of the costs of products, in-bound freight charges, shipping and handling costs, purchase and receiving costs, and commissions paid to Amazon and other online selling platforms. Other expenses not related to the production and distribution of our products is classified as operating expense.\nCash and Cash Equivalents\nThe Companys cash balances on deposit with banks are guaranteed by the Federal Deposit Insurance Corporation up to $250,000 at December 31, 2021. The Company may be exposed to risk for the amounts of funds held in bank accounts more than the insurance limit. In assessing the risk, the Companys policy is to maintain cash balances with high-quality financial institutions. The Company had cash balances more than the guarantee during the years ended December 31, 2021 and 2020.\nInventory\nInventory is stated at the lower of cost to purchase and/or manufacture the inventory or the current estimated market value of the inventory. We regularly review our inventory quantities on hand and record a provision for excess and obsolete inventory based primarily on our estimated forecast of product demand and/or our ability to sell the product(s) concerned and production requirements. Demand for our products can fluctuate significantly. Factors that could affect demand for our products include unanticipated changes in consumer preferences, general market conditions or other factors, which may result in cancellations of advance orders or a reduction in the rate of reorders placed by customers. Additionally, our managements estimates of future product demand may be inaccurate, which could result in an understated or overstated provision required for excess and obsolete inventory.\nAs of December 31, 2021 and 2020, the aggregate allowance for expiring, slow moving and excess inventory amounted to $56,000 and $56,000, respectively.\nProperty and Equipment\nProperty and equipment is recorded at cost and depreciated over the estimated useful lives of the assets using the straight-line method. The Company amortizes leasehold improvements over the estimated life of these assets or the term of the lease, whichever is shorter. When items are retired or otherwise disposed of, income is charged or credited for the difference between net book value and proceeds realized. Ordinary maintenance and repairs are charged to expense as incurred, and replacements and betterments are capitalized.\nThe range of estimated useful lives used to calculate depreciation for principal items of property and equipment are as follows:\nAsset Category\nDepreciation / Amortization Period (in years)\nFurniture and fixtures\nOffice equipment\nLeasehold improvements\nManagement regularly reviews property, equipment and other long-lived assets for possible impairment. This review occurs annually or more frequently if events or changes in circumstances indicate the carrying amount of the asset may not be recoverable. Based upon managements annual assessment, there were no indicators of impairment of the Companys property and equipment and other long-lived assets as of December 31, 2021 and 2020.\nF-\nGoodwill and Intangible Assets\nIn January 2017, the FASB issued ASU 2017-04, Intangibles - Goodwill and Other (Topic 350): Simplifying the Accounting for Goodwill Impairment. ASU 2017-04 removes Step 2 of the goodwill impairment test, which required a hypothetical purchase price allocation. A goodwill impairment will now be the amount by which a reporting units carrying value exceeds its fair value, not to exceed the carrying amount of goodwill. This update also eliminated the requirements for any reporting unit with a zero or negative carrying amount to perform a qualitative assessment and, if it fails that qualitative test, to perform Step 2 of the goodwill impairment test. The Company adopted ASU 2017-04 on January 1, 2020 and applied the requirements prospectively.\nIdentifiable intangible assets are stated at cost and accounted for based on whether the useful life of the asset is finite or indefinite. Identified intangible assets with finite useful lives are amortized using the straight-line methods over their estimated useful lives. Intangible assets with indefinite lives are not amortized to operations, but instead are reviewed for impairment at least annually, or more frequently if there is an indicator of impairment. In relation to the Nutrology acquisition in 2021, the company has an indefinite lived intangible asset, which will be reviewed for impairment annually.\nThere were no impairment charges incurred during the years ended December 31, 2021 and 2020.\nIncome Taxes\nThe Company accounts for income taxes under Financial Accounting Standards Boards (FASB) ASC 740 Income Taxes. Under the asset and liability method of ASC 740, deferred tax assets and liabilities are recognized for the expected future tax consequences of events that have been included in the financial statements or tax returns. Under this method, deferred tax assets and liabilities are determined based on the differences between the financial reporting and tax bases of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. The deferred tax assets of the Company relate primarily to operating loss carryforwards for federal income tax purposes.\nAs discussed in more detail in Note 9, during the fourth quarter of fiscal 2020, management determined that it is more likely than not that the Company will be able to utilize the majority of its net operating loss carryforwards. The release of a substantial portion of the reserve against the Companys deferred tax assets resulted in an income tax benefit of $4,339,000 for 2020, and a corresponding increase in net income of the same amount.\nThe Company periodically evaluates its tax positions to determine whether it is more likely than not that such positions would be sustained upon examination by a tax authority for all open tax years, as defined by the statute of limitations, based on their technical merits. The Company accrues interest and penalties, if incurred, on unrecognized tax benefits as components of the income tax provision in the accompanying consolidated statements of operations. As of December 31, 2021, and 2020, the Company has not established a liability for uncertain tax positions.\nNet Income Per Share\nBasic net income per share is computed by dividing net income by the weighted average number of common shares outstanding for the period. Diluted earnings per share is computed by dividing the net income available to common stockholders by the weighted average number of common shares outstanding plus the number of additional common shares that would have been outstanding if all dilutive potential common shares had been issued using the treasury stock method. Potential common shares are excluded from the computation when their effect is antidilutive. The dilutive effect of potentially dilutive securities is reflected in diluted net income per share if the exercise prices were lower than the average fair market value of common shares during the reporting period.\nThe following potentially dilutive shares were excluded from the shares used to calculate diluted earnings per share as their inclusion would be anti-dilutive:\nDecember 31,\nOptions\n18,828 22,300\nTotal\n18,828 22,300\nF-\nFair Value Measurements\nThe Company uses various inputs in determining the fair value of its investments and measures these assets on a recurring basis. Financial assets recorded at fair value in the balance sheets are categorized by the level of objectivity associated with the inputs used to measure their fair value. ASC 820 establishes a three-level valuation hierarchy for the use of fair value measurements based upon the transparency of inputs to the valuation of an asset or liability as of the measurement date:\n●\nLevel 1 - Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities.\n●\nLevel 2 - Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly, including quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; inputs other than quoted prices that are observable for the asset or liability (e.g., interest rates); and inputs that are derived principally from or corroborated by observable market data by correlation or other means.\n●\nLevel 3 - Inputs that are both significant to the fair value measurement and unobservable. These inputs rely on management's own assumptions about the assumptions that market participants would use in pricing the asset or liability. The unobservable inputs are developed based on the best information available in the circumstances and may include the Companys own data.\nThe carrying amounts of financial assets and liabilities, such as cash and cash equivalents, accounts receivable and accounts payable, approximate their fair values because of the short maturity of these instruments. The carrying values of the line of credit, notes payable and long-term financing obligations approximate their fair values due to the fact that the interest rates on these obligations are based on prevailing market interest rates.\nStock Compensation Expense\nThe Company periodically issues stock options and warrants to employees and non-employees in non-capital raising transactions for services rendered. The Company accounts for stock option and warrant grants issued and vesting to employees based on the authoritative guidance provided by the Financial Accounting Standards Board (FASB) where the value of the award is measured on the date of grant and recognized as compensation on the straight-line basis over the vesting period.\nFor prior periods until December 31, 2018 the Company accounted for share-based compensation issued to non-employees and consultants in accordance with the provisions of FASB ASC 505-50, Equity-Based Payments to Non-Employees. Measurement of share-based payment transactions with non-employees is based on the fair value of whichever is more reliably measurable: (a) the goods or services received or (b) the equity instruments issued. The final fair value of the share-based payment transaction is determined at the performance completion date.\nIn June 2018, the FASB issued ASU 2018-07, Compensation - Stock Compensation (Topic 718): Improvements to Nonemployee Share-Based Payment Accounting (ASU 2018-07). The guidance was issued to simplify the accounting for share-based transactions by expanding the scope of ASU 2018-07 from only being applicable to share-based payments to employees to also include share-based payment transactions for acquiring goods and services from nonemployees. As a result, nonemployee share-based transactions will be measured by estimating the fair value of the equity instruments at the grant date, taking into consideration the probability of satisfying performance conditions. We adopted ASU 2018-07 on January 1, 2019. The adoption of the standard did not have a material impact on our financial statements for the year ended December 31, 2019 or the previously reported financial statements.\nF-\nThe fair value of the Companys stock option and warrant grants are estimated using the Black-Scholes option pricing model, which uses certain assumptions related to risk-free interest rates, expected volatility, expected life of the stock options or warrants, and future dividends. Compensation expense is recorded based upon the value derived from the Black-Scholes option pricing model and based on actual experience. The assumptions used in the Black-Scholes option pricing model could materially affect compensation expense recorded in future periods.\nSegments\nThe Company operates in one segment for the distribution of our products. In accordance with the Segment Reporting Topic of ASC 280, the Companys chief operating decision maker has been identified as the Chief Executive Officer, who reviews operating results to make decisions about allocating resources and assessing performance for the entire Company. Existing guidance, which is based on a management approach to segment reporting, establishes requirements to report selected segment information quarterly and to report annually entity-wide disclosures about products and services, major customers, and the countries in which the entity holds material assets and reports revenue. All material operating units qualify for aggregation under Segment Reporting due to their similar customer base and similarities in: economic characteristics; nature of products and services; and procurement, manufacturing and distribution processes. Since the Company operates in one segment, all financial information required by Segment Reporting can be found in the accompanying consolidated financial statements.\nRecently Adopted Accounting Pronouncements\nIn February 2016, the FASB issued ASU 2016-02, Leases. This update requires the recognition of a right-of-use asset and a corresponding lease liability, initially measured at the present value of the lease payments, for all leases with terms longer than 12 months. For operating leases, the asset and liability will be expensed over the lease term on a straight-line basis, with all cash flows included in the operating section of the statement of cash flows. For finance leases, interest on the lease liability will be recognized separately from the amortization of the right-of-use asset in the statement of comprehensive income and the repayment of the principal portion of the lease liability will be classified as a financing activity while the interest component will be included in the operating section of the statement of cash flows. ASU 2016-02 is effective for annual and interim reporting periods beginning after December 15, 2019.\nIn January 2017, the FASB issued ASU 2017-04, Intangibles - Goodwill and Other (Topic 350): Simplifying the Accounting for Goodwill Impairment. ASU 2017-04 removes Step 2 of the goodwill impairment test, which required a hypothetical purchase price allocation. A goodwill impairment will now be the amount by which a reporting units carrying value exceeds its fair value, not to exceed the carrying amount of goodwill. This update also eliminated the requirements for any reporting unit with a zero or negative carrying amount to perform a qualitative assessment and, if it fails that qualitative test, to perform Step 2 of the goodwill impairment test. The Company adopted ASU 2017-04 on January 1, 2020 and applied the requirements prospectively.\nOther recent accounting pronouncements issued by the FASB, including its Emerging Issues Task Force, the American Institute of Certified Public Accountants, and the Securities and Exchange Commission did not or are not believed by management to have a material impact on the Companys present or future financial statements.\nRecently Issued Accounting Pronouncements\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments. The amendments included in ASU 2016-13 require the measurement of all expected credit losses for financial assets held at the reporting date based on historical experience, current conditions, and reasonable and supportable forecasts. Although the new standard, known as the current expected credit loss (CECL) model, has a greater impact on financial institutions, most other organizations with financial instruments or other assets (trade receivables, contract assets, lease receivables, financial guarantees, loans and loan commitments, and held-to-maturity (HTM) debt securities) are subject to the CECL model and will need to use forward-looking information to better evaluate their credit loss estimates. Many of the loss estimation techniques applied today will still be permitted, although the inputs to those techniques will change to reflect the full amount of expected credit losses. In addition, the ASU amends the accounting for credit losses on available-for-sale debt securities and purchased financial assets with credit deterioration. ASU 2016-13 was originally effective for public companies for fiscal years beginning after December 15, 2019. In November of 2019, the FASB issued ASU 2019-10, which delayed the implementation of ASU 2016-13 to fiscal years beginning after December 15, 2022 for smaller reporting companies. The Company is currently evaluating the impact that the adoption of this guidance will have on its consolidated financial statements.\nF-\nNOTE 3. BUSINESS COMBINATION\nOn April 7, 2021, the Company closed on the purchase of substantially all of the assets of Triple Impact Nutrition (the Acquisition), a New Jersey corporation doing business as Nutrology, a nutritional supplement company catering to consumers who prioritize all-natural and plant-based nutritional supplements. Under the terms of the Asset Purchase Agreement (the APA), the Company agreed to pay cash consideration of $500,000, subject to certain working capital adjustments set forth in the APA. Total consideration paid, including the effects of the working capital adjustment, was $529,000.\nThe Acquisition was accounted for as a business combination under the acquisition method of accounting. The purchase price of $529,000 was allocated to the tangible and intangible assets acquired based on their fair values on the acquisition date of April 7, 2021. The Company assumed no liabilities as part of the Acquisition, and no employees of Nutrology became employees of the Company. The excess of the purchase price over the net assets acquired is recorded as goodwill. The goodwill is attributable to synergies from leveraging Nutrologys strong all-natural and plant-based nutritional supplements, customer relationships and website domain name to enter into new sales with consumers for future growth and expansion. The Company incurred transaction costs of approximately $49,000 related to the Acquisition, of which $30,000 was expensed as incurred during the second quarter of 2021 as part of general and administrative expenses on the Consolidated Statement of Operations. The remaining $19,000 of transaction costs was expensed as incurred during the third quarter of 2021.\nIncluded in the Companys Consolidated Statement of Operations from the acquisition date of April 7, 2021 for the period ended December 31, 2021 are revenue of $897,000 and gross profit of $346,000.\nBelow is a summary of the fair value of assets assumed as of the date of acquisition.\nAssets Acquired:\nFair Value\nAccounts receivable\n$ 48,000\nInventory\n126,000\nIntangibles\n222,000\nGoodwill\n133,000\nFair value of assets acquired and consideration transferred\n$ 529,000\nThe fair values of acquired assets assumed represent managements estimate of fair value utilizing a third-party appraiser and are subject to change if additional information becomes available. Goodwill will not be amortized but instead will be tested for impairment at least annually (or more frequently if indicators of impairment arise). In the event management determines that the goodwill has become impaired, the Company will incur an accounting charge for the amount of the impairment during the fiscal quarter in which the determination is made. The goodwill arising from the Acquisition is deductible for tax purposes.\nOur estimate of intangible assets related to the Acquisition consists of non-contractual customer relationships, trademarks, formulations, and a website domain name. The value of the customer relationships was determined using the income approach, trademarks and formulations was determine using the relief from royalty method, and the website domain name was based on the replacement method cost approach. All methods are considered Level 3 fair value measurements.\nF-\nIntangible assets are amortized on a straight-line basis over their estimated useful lives. The following table sets forth the components of the identifiable intangible assets acquired and their estimated useful lives as of the date of acquisition.\nFair Value\nUseful Life (Years)\nClient relationships\n$\n80,000\nFormulations\n70,000\nTrademarks\n60,000\nIndefinite\nWebsite\n12,000\nTotal identifiable assets\n$\n222,000\nAmortization expense was $31,000 for the year ended December 31, 2021 compared to $0 for the year ended December 31, 2020.\nNOTE 4. INVENTORIES\nThe global supply chain for nutritional supplement ingredients and components has been adversely affected by the continuing COVID-19 pandemic and other variables. In response to these challenges, the Company made the decision to significantly increase its finished goods inventory, particularly for its best-selling products, in an attempt to avoid future stockouts. As a result, finished goods inventory has increased from approximately $2.9 million as of December 31, 2020 to $5.9 million as of December 31, 2021.\nThe Companys inventories as of December 31, 2021 and 2020 were as follows:\nDecember 31,\nDecember 31,\nAs Restated\nFinished goods\n$ 5,908,000 $ 2,917,000\nComponents\n668,000 668,000\nAllowance for obsolescence\n(56,000 )\n(56,000 )\nTotal\n$ 6,520,000 $ 3,529,000\nNOTE 5. PROPERTY AND EQUIPMENT\nThe Company had fixed assets as of December 31, 2021 and 2020 as follows:\nDecember 31,\nDecember 31,\nEquipment\n$ 902,000 $ 902,000\nAccumulated depreciation\n(832,000 )\n(804,000 )\nTotal\n$ 70,000 $ 98,000\nDepreciation expense was $28,000 for the year ended December 31, 2021 compared to $38,000 for the year ended December 31, 2020.\nNOTE 6. NOTES PAYABLE\nLine of Credit - CIT Bank\nOn September 24, 2019, the Company entered into a Revolving Line of Credit Agreement (the Line of Credit Agreement) with Mutual of Omaha Bank, (the Lender), subsequently acquired by CIT Bank N.A., providing the Company with a $2.5 million line of credit (the Line of Credit). The Line of Credit allows the Company to request advances thereunder and to use the proceeds of such advances for working capital purposes until the Maturity Date, unless renewed at maturity upon approval by the Companys Board of Directors and the Lender. The Line of Credit is secured by all assets of the Company.\nAdvances drawn under the Line of Credit bear interest at an annual rate of the one-month LIBOR rate plus 2.75%, and each advance will be payable on the Maturity Date with the interest on outstanding advances payable monthly. The Company may, at its option, prepay any borrowings under the Line of Credit, in whole or in part at any time prior to the Maturity Date, without premium or penalty.\nF-\nOn March 20, 2020, the Lender advanced the Company $2.5 million under the Line of Credit, which amount was repaid on April 29, 2020. The advance was intended to provide the Company with additional liquidity given the uncertainty regarding the timing of collection of certain accounts receivable and in anticipation of an expected negative impact on sales to GNC and our other wholesale customers resulting from the COVID-19 outbreak.\nOn September 20, 2022, the Company and the Lender amended the Line of Credit Agreement to extend the Maturity Date to December 23, 2022. All other terms of the Line of Credit Agreement remain unchanged.\nPaycheck Protection Program Loan\nOn April 27, 2020, the Company received proceeds from a loan in the amount of $449,700 from the PPP Lender, pursuant to approval by the SBA for the PPP Lender to fund the Companys request for the PPP Loan created as part of the recently enacted CARES Act administered by the SBA. In accordance with the requirements of the CARES Act, the Company used the proceeds from the PPP Loan primarily for payroll costs, covered rent payments, and covered utilities during the eight-week period commencing on the date of loan approval. The PPP Loan was scheduled to mature on April 27, 2022, had a 1.0% interest rate, and was subject to the terms and conditions applicable to all loans made pursuant to the Paycheck Protection Program as administered by the SBA under the CARES Act. The Company was informed by the PPP Lender and the SBA that the full balance of the PPP Loan, including accrued interest, was forgiven on January 15, 2021.\nNOTE 7 - RIGHT OF USE ASSETS AND LIABILITIES\nIn prior years, the Company entered into several non-cancellable leases for its office facilities and equipment. The lease agreements range from 36 months to 84 months and require monthly payments ranging between $200 and $7,000 through October 2024. On January 1, 2019, the Company adopted Topic 842, Leases which requires a lessee to record a right-of-use asset and a corresponding lease liability at the inception of the lease initially measured at the present value of the lease payments. The Company classified the leases as operating leases and determined that the fair value of the lease assets and liability at the inception of the leases was $480,000 using a discount rate of 9%.\nDuring the year ended December 31, 2021, the Company made payments resulting in a $50,000 reduction in the lease liability. As of December 31, 2021, lease liability amounted to $158,000. Topic 842 requires recognition in the statement of operations of a single lease cost, calculated so that the cost of the lease is allocated over the lease term, generally on a straight-line basis. Rent expense, including real estate taxes, for the year ended December 31, 2021 was $92,000. The right-of-use asset at December 31, 2021 was $158,000, net of amortization of $322,000.\nYear ended\nDecember 31,\nLease Cost\nOperating lease cost (included in general and administrative in the Company's unaudited and consolidated statement of operations)\n$ 92,000\nOther information\nCash paid for amounts included in the measurement of lease liabilities for 2021\n-\nWeighted average remaining lease term - operating leases (in years)\n2.8\nAverage discount rate - operating leases\n9 %\nF-\nThe supplemental balance sheet information related to leases for the period is as follows:\nOperating leases\nAt\nDecember 31,\nLong-term right-of-use assets\n$ 158,000\nShort-term operating lease liabilities\n55,000\nLong-term operating lease liabilities\n103,000\nTotal operating lease liabilities\n$ 158,000\nMaturities of the Company's lease liabilities are as follows (in thousands):\nYear ending\nOperating\nleases\n$ 67,000\n61,000\n51,000\nLess: Imputed interest/present value discount\n(21,000 )\nPresent value of lease liabilities\n$ 158,000\nNOTE 8. EQUITY\nThe Board approved a forward stock split of the Companys Common Stock at a ratio of 4-for-1 (the Forward Split), effective as of December 2, 2021. Prior to the Forward Split, the Company was authorized to issue 15.0 million shares of Common Stock. As a result of the Forward Split, the Company is now authorized to issue 60.0 million shares of Common Stock, $0.01 par value per share, of which 4,552,485 and 4,243,272 shares of Common Stock were issued and outstanding as of December 31, 2021 and 2020, respectively. The Forward Split did not have any effect on the stated par value of the Common Stock and did not affect the Companys authorized preferred stock.\na.\nCommon Stock Issued for Services\nIn July 2018, in connection with the appointment of Mr. Dayton Judd as Chief Executive Officer, the Company granted Mr. Judd an aggregate of 180,000 shares of restricted Common Stock, which included vesting conditions subject to the achievement of certain market prices of the Companys Common Stock. Such shares were also subject to forfeiture in the event Mr. Judd resigned from his position or was terminated by the Company. As the vesting of the 180,000 shares of restricted Common Stock was subject to certain market conditions, pursuant to current accounting guidelines, the Company determined the fair value to be $105,000, computed using Monte Carlo simulations on a binomial model with the assistance of a valuation specialist using a derived service period of nine years. As of December 31, 2020, all of the shares were fully vested and there was no remaining compensation cost to be expensed.\nIn February 2021, the Company granted Mr. Judd an aggregate of 160,000 restricted share units (RSUs). Each RSU converted into one share of the Companys Common Stock upon vesting. The RSUs vested as follows: (1) 40,000 shares at such date that the 30-day volume-weighted average price of Common Stock meets or exceeds $7.50, (ii) 40,000 shares at such date that the 30-day volume-weighted average price of Common Stock meets or exceeds $9.00, (iii) 40,000 shares at such date that the 30-day volume-weighted average price of Common Stock meets or exceeds $10.50, and (iv) 40,000 shares at such date that the 30-day volume-weighted average price of Common Stock meets or exceeds $12.00. The RSUs were subject to forfeiture in the event Mr. Judd resigned from his position or was terminated by the Company. As the vesting of the RSUs was subject to certain market conditions, pursuant to current accounting guidelines, the Company determined the fair value to be $666,000, computed using Monte Carlo simulations on a binomial model with the assistance of a valuation specialist. During the year ended December 31, 2021, the Company expensed $349,000 as a compensation cost. As of December 31, 2021, there was $317,000 of unamortized compensation expense associated with the grant of the RSUs. As of December 31, 2021, the vesting conditions for all of the RSUs had been met, and the shares are included in the outstanding share count as of the end of the year.\nF-\nb.\nShare Repurchase Program\nOn August 16, 2019, the Company's Board authorized management to repurchase up to $500,000 of the Company's Common Stock over the following 24 months, which Share Repurchase Program was previously reported on the Company's Current Report on Form 8-K filed August 20, 2019. On September 23, 2019, the Board approved an amendment to the Companys Share Repurchase Program to increase the repurchase of up to $1,000,000 of the Company's Common Stock, its Series A Preferred, and Warrants, over the following 24 months, at a purchase price, in the case of Common Stock, equal to the fair market value of the Company's Common Stock on the date of purchase, and in the case of Series A Preferred and Warrants, at a purchase price determined by management, with the exact date and amount of such purchases to be determined by management. On November 6, 2019, the Companys Board of Directors amended the previously approved Share Repurchase Program to increase the amount of authorized repurchases to $2.5 million, and on February 1, 2021, the Companys Board of Directors amended previously approved Share Repurchase Program to increase the amount of authorized repurchases to purchase up to $5.0 million. All other terms of the Share Repurchase Program remain unchanged.\nDuring the year ended December 31, 2021, the Company repurchased 36,092 shares of Common Stock under the Share Repurchase Program. The Company also purchased 50,840 dilutive in-the-money options from employees at a discount to their intrinsic value for total consideration of $184,000. The Company is accounting for repurchased shares as treasury stock.\nOptions\nInformation regarding options outstanding as of December 31, 2021 is as follows:\nNumber of\nWeighted\nAverage\nExercise\nWeighted\nAverage\nRemaining\nLife\nOptions\nPrice\n(Years)\nOutstanding, December 31, 2019\n597,140 $ 2.94 5.0\nIssued\n- -\nExercised\n(68,000 )\n1.05\nForfeited\n(158,000 )\n4.76\nOutstanding, December 31, 2020\n371,140 $ 2.51 5.9\nIssued\n128,000 5.03\nExercised\n(68,000 )\n3.48\nForfeited\n- -\nRepurchased\n(50,840 )\n3.48\nOutstanding, December 31, 2021\n380,300 $ 3.44 6.2\nOutstanding\nExercisable\nExercise\nPrice Per\nshare\nTotal Number\nof Options\nWeighted\nAverage\nRemaining\nLife (Years)\nWeighted\nAverage\nExercise\nPrice\nNumber of\nVested\nOptions\nWeighted\nAverage\nExercise\nPrice\n$ 60.70 - 5.24 358,000 6.5 $ 2.25 314,000 $ 1.14\n$ 5.25 - 36.09 22,300 1.8 $ 22.55 22,300 $ 22.55\n380,300 6.2 $ 3.44 336,300 $ 2.56\nThe closing stock price for the Companys stock on December 31, 2021 was $16.00, resulting in an intrinsic value of outstanding options of $4,972,000.\nDuring the year ended December 31, 2021, the Company granted stock options to employees for services rendered to purchase 128,000 shares of Company Common Stock. The stock options are exercisable at an average price of $5.03 per share, expire in five or ten years and vest as follows: one-fourth vested immediately upon issuance, and the remainder vest equally in equal annual installments over a period of three years from grant date.\nF-\nThe total fair value of these options at grant date was approximately $185,000, which was determined using the Black-Scholes option pricing model with the following average assumption: stock price of $5.01 per share, expected term of four years, volatility of 40%, dividend rate of 0% and risk-free interest rate of 1.19%. The risk-free interest rate is based on the U.S. Treasury yield curve in effect at the time of measurement corresponding with the expected term of the share option award; the expected term represents the weighted-average period of time that share option awards granted are expected to be outstanding giving consideration to vesting schedules and historical participant exercise behavior; the expected volatility is based upon historical volatility of the Companys Common Stock; and the expected dividend yield is based on the fact that the Company has not paid dividends in the past and does not expect to pay dividends in the future.\nDuring the year ended December 31, 2021, the Company recognized compensation expense of $100,000 based upon the vesting of outstanding options. As of December 31, 2021, there was $85,000 of unvested stock compensation that will be recognized as an expense in future periods as the options vest.\nDuring the year ended December 31, 2020, the Company did not grant any stock options. However, the Company recognized compensation expense of $29,000 based upon the vesting of outstanding options.\nWarrants\nTotal outstanding warrants to purchase shares of Common Stock as of December 31, 2021 and 2020 amounted to 143,480. Total intrinsic value as of December 31, 2021 amounted to $2,131,000.\nDuring the years ended December 31, 2021 and 2020, no warrants were granted and no warrants expired.\nOutstanding\nExercise Price\nIssuance Date\nExpiration Date\nVesting\n143,480\n$\n1.15\n11/13/18\n11/13/23\nYes\nNOTE 9. INCOME TAXES\nThe Company had available federal net operating loss carryforwards (NOLs) of approximately $15.3 million and $21.6 million as of December 31, 2021 and 2020, respectively, to reduce future taxable income. The federal carryforward expires between 2029 through 2037. Due to the restrictions imposed by Internal Revenue Code Section 382 regarding substantial changes in ownership of companies with loss carryforwards, the utilization of the Companys NOLs may be limited to statutory limits as a result of change in stock ownership. NOLs incurred subsequent to the latest change in control are not subject to the limitations.\nGiven the Companys improving profitability over the past three fiscal years, management has concluded that it is more likely than not that the Company will be able to utilize the majority of its NOLs. However, the Company projects that roughly $2,557,000 of iSatori NOLs will not be able to be utilized prior to their expiration due to the ownership change limitations, which amount remains fully reserved.\nFor the year ended December 31, 2021, the Company recorded a provision for income taxes of $1,298,000. For the year ended December 31, 2020, the Company recorded a benefit for income taxes of $4,415,000, driven primarily by an income tax benefit of $4,339,000 resulting from the elimination of a substantial portion of the reserve against the Companys NOLs and other deferred tax assets.\nF-\nThe Company recognizes tax benefits from uncertain tax positions only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement. As of December 31, 2021 and December 31, 2020, the Company did not have a liability for unrecognized tax benefits.\nThe Company recognizes, as income tax expense, interest and penalties on uncertain tax provisions. As of December 31, 2021, and 2020, the Company has not accrued interest or penalties related to uncertain tax positions. Tax years 2017 through 2021 remain open to examination by the major taxing jurisdictions to which the Company is subject.\nSignificant components of the Companys deferred income tax assets are as follows:\nDecember 31,\n2021 2020\nAs Restated\nNet operating loss carryforward\n$ 3,209,000 $ 4,526,000\nAllowances for sales returns, bad debt and inventory\n155,000 92,000\nShare based compensation\n16,000 80,000\nOther\n202,000 178,000\nTotal deferred asset\n3,582,000 4,876,000\nValuation allowance\n(537,000 ) (537,000 )\nNet deferred tax asset\n$ 3,045,000 $ 4,339,000\nReconciliation of the effective income tax rate to the U.S. statutory rate is as follows:\nDecember 31,\nAs Restated\nFederal statutory tax rate\n21 %\n21 %\nState tax, net of federal benefit\n- % - %\n21 %\n21 %\nPermanent differences (7 )\nValuation allowance\n(123 %)\nEffective tax rate\n14 %\n(102 %)\nNOTE 10. COMMITMENTS AND CONTINGENCIES\nWe are currently not involved in any litigation that we believe could have a material adverse effect on our financial condition or results of operations. There is no action, suit, proceeding, inquiry or investigation before or by any court, public board, government agency, self-regulatory organization or body pending or, to the knowledge of the executive officers of the Company or any of its subsidiaries, threatened against or affecting the Company, our Common Stock, any of our subsidiaries or of the Companys or our subsidiaries officers or directors in their capacities as such, in which an adverse decision could have a material adverse effect.\nNOTE 11. QUARTERLY FINANCIAL DATA (UNAUDITED)\nAs described in our Form 8-K filed on September 21, 2022, Weaver advised the Audit Committee of the Board of Directors that Companys previously issued financial statements included in its Annual Reports on Form 10-K for the years ended December 31, 2019 and 2020, and each of the interim financial statements for the quarterly periods in 2019, 2020 and 2021 included in its Quarterly Reports on Form 10-Q for the periods ending March 31, 2019, June 30, 2019, September 30, 2019, March 31, 2020, June 30, 2020, September 30, 2020, March 31, 2021, and June 30, 2021 (collectively, the \"Restated Periods\") should be restated to correct historical errors related to the recognition of revenue, expensing of costs of inventory, inventory, accounts receivable and the financial reporting and internal controls related to such arrangements, and should therefore no longer be relied upon (the \"Restatement\"). The intended Restatement follows the determination that the revenue associated for all customers with standard FOB destination terms, as reported in the Companys prior period consolidated financial statements, was incorrectly recognized at the time of shipment instead of when the performance obligation was satisfied upon delivery. In addition, the accounting treatment related to the recognition of corresponding accounts receivables, inventory and expensing of costs of goods sold will also be restated. The Companys errors in the misapplication of revenue recognition resulted in certain errors recorded in various account balances in the Companys consolidated balance sheets, statements of operations, statements of stockholders equity, statement of cash flows, and the related notes to the consolidated financial statements (collectively referred to as the consolidated financial statements) for the Restated Periods.\nIn this comprehensive Annual Report on Form 10-K for the year ended December 31, 2021 (the 2021 Form 10-K), FitLife Brands, Inc. is restating its previously issued condensed consolidated financial statements as of and for the three months ended March 31, 2021, and as of and for the three and six months ended June 30, 2021.\nF-\nRestatement of Previously Issued Consolidated Financial Statements\nIn connection with the Restatement, the Company restated the financial information as of and for the fiscal year December 31, 2020 and December 31, 2019, as well as the relevant unaudited interim financial information for the quarterly periods ended September 30, 2020, June 30, 2020, March 31, 2020, September 30, 2019, June 30, 2019, and March 31, 2019 in its 2020 Annual Report, as amended, on Form 10-K/A.\nSee Supplemental Unaudited Quarterly Financial Information, in Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations, for additional restated 2020 unaudited interim financial information.\nDescription of misstatements\n(a)\nTiming of recognition of revenue\nWe recorded adjustments for the revenues that were incorrectly recognized at the time of shipment instead of the time the products were received by the customers. The correction changed the timing of the revenue recognition for these deliveries, which results in recognizing such revenue when the Company is entitled to receive such revenue upon satisfaction of performance obligations in accordance with the requirements of ASC 606. The correction in the timing of revenue recognition under ASC 606 resulted in adjustments to revenue, cost of sales, inventory and accounts receivable.\n(b)\nOther adjustments\nWe recorded adjustments to correct other identified out-of-period and uncorrected misstatements that were not material, individually or in the aggregate, to our consolidated financial statements. These other misstatements were primarily related to sales returns reserve, income statement reclassification, and certain accrued liabilities. The impacts of the other misstatements on each period are discussed in restatement reference (b) throughout this note.\nThe following tables represent our restated unaudited condensed consolidated financial statements for the three months ended March 31, 2021, and as of and for the three and six months ended June 30, 2021. The values as previously reported for the fiscal quarters ended March 31, 2021 and June 30, 2021 were derived from our Quarterly Reports on Form 10-Q filed on May 14, 2021 and August 16, 2021, respectively.\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(UNAUDITED)\nAs Restated\nJune 30, 2021\nMarch 31, 2021\nASSETS:\nCURRENT ASSETS:\nCash\n$ 8,425,000 $ 6,625,000\nAccounts receivable, net of allowance of doubtful accounts, $59,000 and $60,000, respectively\n1,250,000 1,580,000\nInventories, net of allowance for obsolescence of $28,000 and $25,000, respectively\n5,094,000 5,143,000\nIncome tax receivable\n40,000 40,000\nPrepaid expenses and other current assets\n228,000 22,000\nTotal current assets\n15,037,000 13,410,000\nProperty and equipment, net\n85,000 90,000\nRight of use asset, net of amortization of $296,000, and $285,000, respectively\n183,000 195,000\nIntangibles, net of amortization of $10,000 and $0, respectively\n212,000 225,000\nGoodwill\n358,000 -\nDeferred tax asset\n3,615,000 4,014,000\nTOTAL ASSETS\n$ 19,490,000 $ 17,934,000\nLIABILITIES AND STOCKHOLDERS EQUITY:\nCURRENT LIABILITIES:\nAccounts payable\n$ 3,542,000 $ 3,410,000\nAccrued expense and other liabilities\n679,000 614,000\nProduct returns\n326,000 304,000\nLease liability - current portion\n53,000 52,000\nTotal current liabilities\n4,600,000 4,380,000\nLong-term lease liability, net of current portion\n131,000 144,000\nTOTAL LIABILITIES\n4,731,000 4,524,000\nSTOCKHOLDERS EQUITY:\nPreferred stock, $0.01 par value, 10,000,000 shares authorized, none outstanding, as of June 30, 2021 and March 31, 2021\nCommon stock, $.01 par value, 60,000,000 shares authorized; 4,442,760, and 4,363,272 issued and outstanding as of June 30, 2021 and March 31, 2021, respectively\n42,000 42,000\nTreasury stock, 878,616 and 842,524 shares as of June 30, 2021, and March 31, 2021, respectively\n(2,050,000 )\n(1,790,000 )\nAdditional paid-in capital\n32,282,000 32,305,000\nAccumulated deficit\n(15,515,000 )\n(17,147,000 )\nTOTAL STOCKHOLDERS EQUITY\n14,759,000 13,410,000\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY\n$ 19,490,000 $ 17,934,000\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED STATEMENT OF OPERATIONS\n(UNAUDITED)\nAs Restated\nJune 30, 2021\nMarch 31, 2021\nThree Months Ended\nSix Months Ended\nThree Months Ended\nRevenue\n$ 8,406,000 $ 14,005,000 $ 5,599,000\nCost of goods sold\n4,725,000 7,529,000 2,804,000\nGross profit\n3,681,000 6,476,000 2,795,000\nOPERATING EXPENSES:\nGeneral and administrative\n917,000 1,774,000 857,000\nSelling and marketing\n716,000 1,385,000 669,000\nDepreciation and amortization\n15,000 23,000 8,000\nTotal operating expenses\n1,648,000 3,182,000 1,534,000\nOPERATING INCOME\n2,033,000 3,294,000 $ 1,261,000\nOTHER EXPENSES (INCOME)\nInterest income\n(5,000 )\n(11,000 )\n(6,000 )\nGain on settlement\n- (453,000 )\n(453,000 )\nTotal other expenses (income)\n(5,000 )\n(464,000 )\n(459,000 )\nPRE-TAX NET INCOME\n2,038,000 3,758,000 1,720,000\nPROVISION FOR INCOME TAXES\n406,000 721,000 315,000\nNET INCOME\n$ 1,632,000 $ 3,037,000 $ 1,405,000\nNET INCOME PER SHARE\nBasic\n$ 0.37 $ 0.70 $ 0.33\nDiluted\n$ 0.34 $ 0.64 $ 0.30\nBasic weighted average common shares\n4,392,000 4,349,540 4,306,604\nDiluted weighted average common shares\n4,779,520 4,756,276 4,698,664\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED STATEMENT OF STOCKHOLDERS EQUITY\n(UNAUDITED)\nAs Restated\nFor the Six Months Ended June 30, 2021\nCommon Stock\nTreasury\nAdditional Paid-\nAccumulated\nShares\nAmount\nStock\nIn capital\nDeficit\nTotal\nBalance at December 31, 2020\n4,243,272 $ 42,000 (1,790,000 )\n$ 32,174,000 $ (18,552,000 )\n$ 11,874,000\nRepurchase of common stock\n(36,092 )\n- (260,000 )\n- - (260,000 )\nExercise of stock options\n15,580 - - 54,000 - 54,000\nRepurchase of options\n- - - (184,000 )\n- (184,000 )\nStock-based compensation\n200,000 - - 238,000 - 238,000\nNet income\n- - - - 3,037,000 3,037,000\nBalance at June 30, 2021\n4,422,760 $ 42,000 (2,050,000 )\n$ 32,282,000 $ (15,515,000 )\n$ 14,759,000\nAs Restated\nFor the Three Months Ended March 31, 2021\nCommon Stock Treasury Additional Paid- Accumulated\nShares Amount Stock In capital Deficit Total\nBalance at December 31, 2020\n4,243,272 $ 42,000 $ (1,790,000 )\n$ 32,174,000 $ (18,552,000 )\n$ 11,874,000\nStock-based compensation\n120,000 - - 131,000 - 131,000\nNet income\n- - - - 1,405,000 1,405,000\nBalance at March 31, 2021\n4,363,272 $ 42,000 $ (1,790,000 )\n$ 32,305,000 $ (17,147,000 )\n$ 13,410,000\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(UNAUDITED)\nAs Restated\nJune 30, 2021 March 31, 2021\nSix months ended Three months ended\nNet income\n$ 3,037,000 $ 1,405,000\nAdjustments to reconcile net income to net cash used in operating activities:\nDepreciation and amortization\n23,000 8,000\nRight of use asset amortization\n24,000 14,000\nAllowance for doubtful accounts\n8,000 9,000\nAllowance for inventory obsolescence\n(27,000 )\n(31,000 )\nFair value of stock and options issued for services\n238,000 131,000\nForgiveness of PPP loan\n(453,000 )\n(453,000 )\nChanges in operating assets and liabilities:\nAccounts receivable - trade\n666,000 208,000\nInventories\n(1,490,000 )\n(1,584,000 )\nDeferred tax asset\n724,000 325,000\nPrepaid expense\n(176,000 )\n30,000\nAccounts payable\n296,000 164,000\nLease liability\n(24,000 )\n(12,000 )\nAccrued liabilities and other liabilities\n171,000 106,000\nProduct returns\n(9,000 )\n(31,000 )\nNet cash provided by operating activities\n3,008,000 289,000\nCash paid for acquisition\n(529,000 )\n-\nNet cash provided by investing activities\n(529,000 )\n-\nProceeds from exercise of stock options\n54,000 -\nRepurchases of common stock and options\n(444,000 )\n-\nNet cash provided by (used in) financing activities\n(390,000 )\n-\nCHANGE IN CASH\n2,089,000 289,000\nCASH, BEGINNING OF PERIOD\n6,336,000 6,336,000\nCASH, END OF PERIOD\n$ 8,425,000 $ 6,625,000\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED BALANCE SHEET\n(UNAUDITED)\nJune 30, 2021\nAs Previously Reported\nRestatement Impacts\nRestatement Reference\nAs Restated\nASSETS:\nCURRENT ASSETS\nCash\n$ 8,425,000 $ - $ 8,425,000\nAccounts receivable, net of allowance of doubtful accounts of $59,000\n1,757,000 (507,000 )\n(a)\n1,250,000\nInventories, net of allowance for obsolescence of $28,000\n4,834,000 260,000 (a)\n5,094,000\nIncome tax receivable\n40,000 - 40,000\nPrepaid expenses and other current assets\n228,000 - 228,000\nTotal current assets\n15,284,000 (247,000 )\n15,037,000\nProperty and equipment, net\n85,000 - 85,000\nRight of use asset, net of amortization of $296,000\n183,000 - 183,000\nIntangibles, net of amortization of $10,000\n212,000 - 212,000\nGoodwill\n358,000 - 358,000\nDeferred tax asset\n3,639,000 (24,000 )\n(a)\n3,615,000\nTOTAL ASSETS\n$ 19,761,000 $ (271,000 )\n$ 19,490,000\nLIABILITIES AND STOCKHOLDERS EQUITY:\nCURRENT LIABILITIES:\nAccounts payable\n$ 3,542,000 $ - $ 3,542,000\nAccrued expense and other liabilities\n635,000 44,000 (b)\n679,000\nProduct returns\n326,000 - 326,000\nLease liability - current portion\n53,000 - 53,000\nTotal current liabilities\n4,556,000 44,000 4,600,000\nLong-term lease liability, net of current portion\n131,000 - 131,000\nTOTAL LIABILITIES\n4,687,000 44,000 4,731,000\nSTOCKHOLDERS EQUITY:\nPreferred stock, $0.01 par value, 10,000,000 shares authorized, none outstanding as of June 30, 2021\nCommon stock, $.01 par value, 60,000,000 shares authorized; 4,422,760\n12,000 30,000 * 42,000\nTreasury stock, 878,616\n(2,050,000 )\n- (2,050,000 )\nAdditional paid-in capital\n32,312,000 (30,000 ) * 32,282,000\nAccumulated deficit\n(15,200,000 )\n(315,000 )\n(a)(b)\n(15,515,000 )\nTOTAL STOCKHOLDERS EQUITY\n15,074,000 (315,000 )\n14,759,000\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY\n$ 19,761,000 $ (271,000 )\n$ 19,490,000\n(a)\nRevenue Recognition - The correction of these misstatements resulted in a decrease to accounts receivable of $507,000, an increase to inventory of $260,000, and an increase to accumulated deficit of $247,000.\n(b)\nOther adjustments - The correction of these misstatements resulted in a decrease to deferred tax asset of $24,000, an increase to accrued expense and other liabilities of $44,000, and an increase to accumulated deficit of $68,000.\n* Stock Split - Share values previously reported have been adjusted retroactively between Common stock and Additional paid-in capital to reflect the 4:1 forward stock split that occurred in December 2021.\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED BALANCE SHEET\n(UNAUDITED)\nMarch 31, 2021\nAs Previously Reported\nRestatement Impacts\nRestatement Reference\nAs Restated\nASSETS:\nCURRENT ASSETS\nCash\n$ 6,625,000 $ - $ 6,625,000\nAccounts receivable, net of allowance of doubtful accounts of $60,000 and $51,000, respectively\n2,372,000 (792,000 )\n(a)\n1,580,000\nInventories, net of allowance for obsolescence of $25,000 and $56,000, respectively\n4,738,000 405,000 (a)\n5,143,000\nIncome tax receivable\n40,000 - 40,000\nPrepaid expenses and other current assets\n22,000 - 22,000\nTotal current assets\n13,797,000 (387,000 )\n13,410,000\nProperty and equipment, net\n90,000 - 90,000\nRight of use asset, net of amortization of $285,000 and $272,000, respectively\n195,000 - 195,000\nGoodwill\n225,000 - 225,000\nDeferred tax asset\n4,042,000 (28,000 )\n(b)\n4,014,000\nTOTAL ASSETS\n$ 18,349,000 $ (415,000 )\n$ 17,934,000\nLIABILITIES AND STOCKHOLDERS' EQUITY:\nCURRENT LIABILITIES:\nAccounts payable\n$ 3,410,000 $ - $ 3,410,000\nAccrued expense and other liabilities\n590,000 24,000 (b) 614,000\nProduct returns\n304,000 -\n304,000\nLease liability - current portion\n52,000 - 52,000\nTotal current liabilities\n4,356,000 24,000 4,380,000\nLong-term lease liability, net of current portion\n144,000 144,000\nTOTAL LIABILITIES\n4,500,000 24,000 4,524,000\nSTOCKHOLDERS' EQUITY:\nPreferred stock, $0.01 par value, 10,000,000 shares authorized, none outstanding as of March 31, 2021 and December 31, 2020\nCommon stock, $.01 par value, 60,000,000 shares authorized; 4,363,272 issued and outstanding as of March 31, 2021\n12,000 30,000 * 42,000\nTreasury stock, 842,524\n(1,790,000 )\n- (1,790,000 )\nAdditional paid-in capital\n32,335,000 (30,000 ) * 32,305,000\nAccumulated deficit\n(16,708,000 )\n(439,000 )\n(a)(b)\n(17,147,000 )\nTOTAL STOCKHOLDERS' EQUITY\n13,849,000 (439,000 )\n13,410,000\nTOTAL LIABILITIES AND STOCKHOLDERS' EQUITY\n$ 18,349,000 $ (415,000 )\n$ 17,934,000\n(a)\nRevenue Recognition - The correction of these misstatements resulted in a decrease to accounts receivable of $792,000, an increase to inventory of $405,000, and an increase to accumulated deficit of $387,000.\n(b)\nOther adjustments - The correction of these misstatements resulted in a decrease to deferred tax asset of $28,000, an increase of $24,000 to accrued expenses and other liabilities and an increase to accumulated deficit of $52,000.\n*\nStock Split - Share values previously reported have been restated retroactively between Common stock and Additional paid-in capital to reflect the 4:1 forward stock split that occurred in December 2021.\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED STATEMENT OF OPERATIONS\n(UNAUDITED)\nFor the Six Months Ended June 30, 2021\nAs Previously Reported\nRestatement Impacts\nRestatement Reference\nAs Restated\nRevenue\n$ 14,299,000 $ (294,000 )\n(a)(b)\n$ 14,005,000\nCost of goods sold\n7,661,000 (132,000 )\n(a)\n7,529,000\nGross profit\n6,638,000 (162,000 )\n6,476,000\nOPERATING EXPENSES:\nGeneral and administrative\n1,774,000 - 1,774,000\nSelling and marketing\n1,385,000 - 1,385,000\nDepreciation and amortization\n23,000 - 23,000\nTotal operating expenses\n3,182,000 - 3,182,000\nOPERATING INCOME (LOSS)\n3,456,000 (162,000 )\n3,294,000\nOTHER EXPENSES (INCOME)\nInterest expense (income)\n(11,000 )\n- (11,000 )\nGain on debt forgiveness\n(453,000 )\n- (453,000 )\nTotal other expenses (income)\n(464,000 )\n- (464,000 )\nPRE-TAX NET INCOME\n3,920,000 (162,000 )\n3,758,000\nPROVISION FOR INCOME TAXES\n728,000 (7,000 )\n(b)\n721,000\nNET INCOME\n$ 3,192,000 $ (155,000 )\n(a)(b)\n$ 3,037,000\nNET INCOME PER SHARE\nBasic\n$ 0.73 (0.03 )\n** $ 0.70\nDiluted\n$ 0.67 (0.03 )\n** $ 0.64\nBasic weighted average common shares\n4,349,540 - 4,349,540\nDiluted weighted average common shares\n4,756,276 - 4,756,276\n(a) Revenue Recognition - The correction of these misstatements resulted in a decrease to revenue of $260,000, a decrease of cost of goods sold of $132,000, and a decrease to net income of $128,000\n(b)\nOther adjustments - The correction of these misstatements resulted in a decrease to revenue of $34,000 a decrease to provision for income taxes of $7,000, and a decrease to net income of $27,000.\n** Net income per share values previously reported have been adjusted to reflect the 4:1 forward split that occurred in December 2021.\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED STATEMENT OF OPERATIONS\n(UNAUDITED)\nFor the Three Months Ended June 30, 2021\nAs Previously Reported\nRestatement Impacts\nRestatement Reference\nAs Restated\nRevenue\n$ 8,141,000 $ 265,000 (a)(b)\n$ 8,406,000\nCost of goods sold\n4,580,000 145,000 (a)\n4,725,000\nGross profit\n3,561,000 120,000 3,681,000\nOPERATING EXPENSES:\nGeneral and administrative\n917,000 - 917,000\nSelling and marketing\n716,000 - 716,000\nDepreciation and amortization\n15,000 - 15,000\nTotal operating expenses\n1,648,000 - 1,648,000\nOPERATING INCOME (LOSS)\n1,913,000 120,000 2,033,000\nOTHER EXPENSES (INCOME)\nInterest expense (income)\n(5,000 )\n- (5,000 )\nTotal other expenses (income)\n(5,000 )\n- (5,000 )\nPRE-TAX NET INCOME\n1,918,000 120,000 2,038,000\nPROVISION FOR INCOME TAXES\n410,000 (4,000 )\n(b)\n406,000\nNET INCOME\n$ 1,508,000 $ 124,000 (a)(b)\n$ 1,632,000\nNET INCOME PER SHARE\nBasic\n$ 0.34 0.03 ** $ 0.37\nDiluted\n$ 0.32 0.02 ** $ 0.34\nBasic weighted average common shares\n4,392,000 - 4,392,000\nDiluted weighted average common shares\n4,779,520 - 4,779,520\n(a) Revenue Recognition - The correction of these misstatements resulted in an increase to revenue of $285,000, an increase of cost of goods sold of $145,000, and an increase to net income of $140,000.\n(b)\nOther adjustments - The correction of these misstatements resulted in a decrease to revenue of $20,000 and a decrease to provision for income taxes of $4,000, and a decrease of $16,000 to net income.\n** Net income per share values previously reported have been adjusted to reflect the 4:1 forward split that occurred in December 2021.\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED STATEMENT OF OPERATIONS\n(UNAUDITED)\nFor the Three Months Ended March 31, 2021\nAs Previously Reported\nRestatement Impacts\nRestatement Reference\nAs Restated\nRevenue\n$ 6,158,000 $ (559,000 )\n(a)(b)\n$ 5,599,000\nCost of goods sold\n3,081,000 (277,000 )\n(a)\n2,804,000\nGross profit\n3,077,000 (282,000 )\n2,795,000\nOPERATING EXPENSES:\nGeneral and administrative\n857,000 - 857,000\nSelling and marketing\n669,000 - 669,000\nDepreciation and amortization\n8,000 - 8,000\nTotal operating expenses\n1,534,000 - 1,534,000\nOPERATING INCOME\n1,543,000 (282,000 )\n1,261,000\nOTHER EXPENSES (INCOME)\nInterest expense (income)\n(6,000 )\n- (6,000 )\nGain on settlement\n- - -\nGain on debt forgiveness\n(453,000 )\n- (453,000 )\nTotal other expenses (income)\n(459,000 )\n- (459,000 )\nPRE-TAX NET INCOME\n2,002,000 (282,000 )\n1,720,000\nPROVISION FOR INCOME TAXES\n318,000 (3,000 )\n(b)\n315,000\nNET INCOME\n1,684,000 (279,000 )\n(a)(b)\n1,405,000\nNET INCOME PER SHARE\nBasic\n$ 0.39 (0.06 ) ** $ 0.33\nDiluted\n$ 0.36 (0.03 ) ** $ 0.30\nBasic weighted average common shares\n4,306,604 - 4,306,604\nDiluted weighted average common shares\n4,698,664 - 4,698,664\n(a) Revenue Recognition - The correction of these misstatements resulted in a decrease to revenue of $545,000, a decrease of cost of goods sold of $277,000, and a decrease to net income of $268,000.\n(b)\nOther adjustments - The correction of these misstatements resulted in a decrease to revenue of $14,000, and a decrease to provision for income taxes of $3,000, and a decrease of $11,000 to net income.\n** Net income per share values previously reported have been adjusted to reflect the 4:1 forward split that occurred in December 2021.\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED STATEMENT OF STOCKHOLDERS' EQUITY\n(UNAUDITED)\nAdditional\nRestatement\nCommon Stock\nTreasury\nPaid-in\nAccumulated\nReference\nShares\nAmount\nStock\nCapital\nDeficit\nTotal\nSIX MONTHS ENDED JUNE 30, 2021\nDECEMBER 31, 2020 (AS PREVIOUSLY REPORTED)\n4,243,272 $ 12,000 $ (1,790,000 )\n$ 32,204,000 $ (18,392,000 )\n$ 12,034,000\nRepurchase of common stock\n(36,092 )\n- (260,000 )\n- - (260,000 )\nExercise of stock options\n15,580 - - 54,000 - 54,000\nRepurchase of options\n- - - (184,000 )\n- (184,000 )\nFair value of common stock and options issued for services\n200,000 - - 238,000 - 238,000\nNet income\n- - - - 3,192,000 3,192,000\nJUNE 30, 2021\n4,422,760 $ 12,000 $ (2,050,000 )\n$ 32,312,000 $ (15,200,000 )\n$ 15,074,000\nSIX MONTHS ENDED JUNE 30, 2021\nDECEMBER 31, 2020 (RESTATEMENT IMPACT)\n* - $ 30,000 $ - $ (30,000 ) $ (160,000 )\n$ (160,000 )\nRepurchase of common stock\n- - - - - -\nExercise of stock options\n- - - - - -\nRepurchase of options\n- - - - - -\nFair value of vested common shares and options issued for services\n- - - - - -\nNet income\n(a)(b)\n- - - - (155,000 )\n(155,000 )\nJUNE 30, 2021\n- $ 30,000 $ - $ (30,000 ) $ (315,000 )\n(315,000 )\nSIX MONTHS ENDED JUNE 30, 2021\nDECEMBER 31, 2020 (AS RESTATED)\n4,243,272 $ 42,000 $ (1,790,000 )\n$ 32,174,000 $ (18,552,000 )\n$ 11,874,000\nRepurchase of common stock\n(36,092 )\n- (260,000 )\n- - (260,000 )\nExercise of stock options\n15,580 - - 54,000 - 54,000\nRepurchase of options\n- - - (184,000 )\n- (184,000 )\nFair value of vested common shares and options issued for services\n200,000 - - 238,000 - 238,000\nNet income\n- - - - 3,037,000 3,037,000\nJUNE 30, 2021\n4,422,760 $ 42,000 $ (2,050,000 )\n$ 32,282,000 $ (15,515,000 )\n$ 14,759,000\nSee descriptions of the net income impacts in the condensed consolidated statement of operations for the six months ended June 30, 2021 section above.\n*\nStock Split - Share values previously reported have been restated retroactively between Common stock and Additional paid-in capital to reflect the 4:1 forward stock split that occurred in December 2021.\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED STATEMENT OF STOCKHOLDERS' EQUITY\n(UNAUDITED)\nAdditional\nRestatement\nCommon Stock\nTreasury\nPaid-in\nAccumulated\nReference\nShares\nAmount\nStock\nCapital\nDeficit\nTotal\nTHREE MONTHS ENDED MARCH 31, 2021\nDECEMBER 31, 2020 (AS PREVIOUSLY REPORTED)\n4,243,272 $ 12,000 $ (1,790,000 )\n$ 32,204,000 $ (18,392,000 )\n$ 12,034,000\nFair value of common stock and options issued for services\n120,000 - - 131,000 - 131,000\nNet income\n- - - - 1,684,000 1,684,000\nMARCH 31, 2021\n4,363,272 $ 12,000 $ (1,790,000 )\n$ 32,335,000 $ (16,708,000 )\n$ 13,849,000\nTHREE MONTHS ENDED JUNE 30, 2021\nDECEMBER 31, 2020 (RESTATEMENT IMPACT)\n- $ 30,000 - (30,000 ) $ (160,000 )\n$ (160,000 )\nFair value of vested common shares and options issued for services\n- - - - - -\nNet income\n(a)(b) - - - - (279,000 )\n(279,000 )\nMARCH 31, 2021\n- $ 30,000 $ - $ (30,000 ) $ (439,000 )\n$ (439,000 )\nTHREE MONTHS ENDED MARCH 31, 2021\nDECEMBER 31, 2020 (AS RESTATED)\n4,243,272 $ 42,000 $ (1,790,000 )\n$ 32,174,000 $ (18,552,000 )\n$ 11,874,000\nFair value of vested common shares and options issued for services\n120,000 - - 131,000 - 131,000\nNet income\n- - - - 1,405,000 1,405,000\nMARCH 31, 2021\n4,363,272 $ 42,000 $ (1,790,000 )\n$ 32,305,000 (17,147,000 )\n$ 13,410,000\nSee descriptions of the net income impacts in the condensed consolidated statement of operations for the three months ended March 31, 2021 section above.\n*\nStock Split - Share values previously reported have been restated retroactively between Common stock and Additional paid-in capital to reflect the 4:1 forward stock split that occurred in December 2021.\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED STATEMENT OF CASH FLOWS\n(UNAUDITED)\nSix months ended June 30, 2021\nAs Previously Reported\nRestatement Impact\nRestatement Reference\nAs Restated\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income\n$ 3,192,000 $ (155,000 )\n(a)\n$ 3,037,000\nAdjustments to reconcile net income to net cash used in operating activities:\nDepreciation and amortization\n23,000 - 23,000\nRight of use asset amortization\n24,000 - 24,000\nAllowance for doubtful accounts\n8,000 - 8,000\nAllowance for inventory obsolescence\n(27,000 )\n- (27,000 )\nFair value of stock and options issued for services\n238,000 - 238,000\nForgiveness of PPP loan\n(453,000 )\n- (453,000 )\nChanges in operating assets and liabilities:\nAccounts receivable - trade\n406,000 260,000 (a)\n666,000\nInventories\n(1,358,000 )\n(132,000 )\n(a)\n(1,490,000 )\nDeferred tax asset\n731,000 (7,000 )\n(b)\n724,000\nPrepaid expense\n(176,000 )\n- (176,000 )\nAccounts payable\n296,000 - 296,000\nLease liability\n(24,000 )\n- (24,000 )\nAccrued liabilities and other liabilities\n137,000 35,000 (b)\n172,000\nProduct returns\n(9,000 )\n- (9,000 )\nNet cash provided by operating activities\n3,008,000 - 3,008,000\nCASH FLOWS FROM INVESTING ACTIVITIES:\nCash paid for acquisition\n(529,000 )\n- (529,000 )\nNet cash used in investing activities\n(529,000 )\n- (529,000 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from exercise of stock options\n54,000 - 54,000\nRepurchases of common stock and options\n(444,000 )\n- (444,000 )\nNet cash provided by (used in) financing activities\n(390,000 )\n- (390,000 )\nCHANGE IN CASH\n2,089,000 - 2,089,000\nCASH, BEGINNING OF PERIOD\n6,336,000 - 6,336,000\nCASH, END OF PERIOD\n$ 8,425,000 $ - $ 8,425,000\nSee Note 11, Restatement of Previously Issued Consolidated Financial Statements, for a description of the misstatements in each category of restatements referenced by (a) through (b).\nSee description of the net income impacts in the Condensed Consolidated Statement of Operations for the six months ended June 30, 2021 included above.\nNone of the misstatements impacted the classifications between net operating, net investing, or net financing cash flows.\nF-\nFITLIFE BRANDS, INC.\nCONDENSED CONSOLIDATED STATEMENT OF CASH FLOWS\n(UNAUDITED)\nThree months ended March 31, 2021\nAs Previously Reported\nRestatement\nImpact\nRestatement Reference\nAs Restated\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income\n$ 1,684,000 $ (279,000 )\n(a)\n$ 1,405,000\nAdjustments to reconcile net income to net cash used in operating activities:\nDepreciation and amortization\n8,000 - 8,000\nRight of use asset amortization\n14,000 - 14,000\nAllowance for doubtful accounts\n9,000 - 9,000\nAllowance for inventory obsolescence\n(31,000 )\n- (31,000 )\nFair value of stock and options issued for services\n131,000 - 131,000\nForgiveness of PPP loan\n(453,000 )\n- (453,000 )\nChanges in operating assets and liabilities:\nAccounts receivable - trade\n(337,000 )\n545,000 (a)\n208,000\nInventories\n(1,307,000 )\n(277,000 )\n(a)\n(1,584,000 )\nDeferred tax asset\n328,000 (3,000 )\n(b)\n325,000\nPrepaid expense\n30,000 - 30,000\nAccounts payable\n164,000 - 164,000\nLease liability\n(12,000 )\n- (12,000 )\nAccrued liabilities and other liabilities\n92,000 15,000 (b)\n107,000\nProduct returns\n(31,000 )\n- (31,000 )\nNet cash provided by operating activities\n289,000 - 289,000\nCASH FLOWS FROM INVESTING ACTIVITIES:\nNet cash provided by investing activities\n- - -\nCASH FLOWS FROM FINANCING ACTIVITIES:\nNet cash provided by (used in) financing activities\n- - -\nCHANGE IN CASH\n289,000 - 289,000\nCASH, BEGINNING OF PERIOD\n6,336,000 - 6,336,000\nCASH, END OF PERIOD\n$ 6,625,000 - $ 6,625,000\nSee Note 11, Restatement of Previously Issued Consolidated Financial Statements, for a description of the misstatements in each category of restatements referenced by (a) through (b).\nSee description of the net income impacts in the Consolidated Statement of Operations for the three months ended March 31, 2021 included above.\nNone of the misstatements impacted the classifications between net operating, net investing, or net financing cash flows.\nF-\nNOTE 12. SUBSEQUENT EVENTS\nIn accordance with the Subsequent Events Topic of the FASB ASC 855, we have evaluated subsequent events through the filing date and noted no further subsequent events that are reasonably likely to impact the Companys financial statements."
}