{
    "cik": "1374881",
    "company": "Kingfish Holding Corp",
    "filing_type": "10-K",
    "filing_date": "2023-12-19",
    "period_of_report": "2023-09-30",
    "sic": "1540",
    "state_of_inc": "DE",
    "state_location": "FL",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1374881/0001477932-23-009244-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1374881/000147793223009244/king_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1374881/0001477932-23-009244.txt",
    "filename": "1374881_10K_2023_0001477932-23-009244.htm",
    "content": "ITEM 1. BUSINESS\nBackground\nKingfish Holding Corporation (us, our, we, the Company, or Kingfish) was incorporated in the State of Delaware on April 11, 2006 as Offline Consulting Inc. On May 18, 2007, we entered into a reverse merger transaction pursuant to a Share Exchange Agreement whereby we acquired Kesselring Corporation, a Florida corporation. Following the reverse merger we became Kesselring Holding Corporation on June 8, 2007. A Certificate of Ownership was filed with the Secretary of State of the State of Delaware, effective as of June 8, 2007. On November 25, 2014, we changed our name to Kingfish Holding Corporation.\nThe principal executive offices of the Company are located at 822 62nd Circle East, Unit 105, Bradenton, Florida 34208, and our telephone number is (941) 487-3653. The Company does not have an internet address.\nBusiness Operations and Proposed Merger Transaction\nThe primary business of the Company is to seek a suitable private company acquisition. The Company has not been engaged in any other business activity.\nBackground of Proposed Merger Transaction\nOn October 28, 2022, the Company and Renovo, entered into an Agreement and Plan of Merger (the Original Merger Agreement), pursuant to which Renovo would be merged with and into the Company (the Merger), with the Company being the legal successor or surviving corporation in the Merger.\nOn March 31, 2023, the parties entered into First Amendment to the Merger Agreement (First Amendment) which amended the Original Merger Agreement to, among other things, extend the date for the closing of the Merger and to revise certain other provisions relating to a delay in the receipt of Renovos audited financial statements required as a condition for closing.\nOn August 17, 2023 the board of directors of the Company approved and, on August 18, 2023, the Company entered into the Second Amendment with Renovo. Pursuant to the Second Amendment, the Merger Agreement was amended to, among other things: (i) eliminate the condition that Renovo acquire 6 LLC, a Florida limited liability company owned and controlled by the shareholders of Renovo that owns the buildings and property (Property) on which Renovo conducts its operations (6 LLC) prior to the Merger (Acquisition Condition); (ii) require as a condition to the closing of the Merger that Renovo would take all steps necessary to cause: (a) 6 LLC to enter into a new lease agreement (the Lease), with an initial term of two years for the Property on terms reasonably satisfactory to the Company with Renovo effective concurrently with or immediately after the closing of the Merger; and (b) 6 LLC and all of the 6 LLC owners to grant the surviving corporation an exclusive option to purchase 6 LLC for a period of years following the closing of the Merger (Purchase Option) and to enter into an agreement regarding the Purchase Option with the surviving corporation (the Purchase Option Agreement); (iii) require delivery of the executed Purchase Option Agreement and Lease at the closing of the Merger, and (iv) extend the outside termination date for the closing as set forth in the Original Merger Agreement (the Outside Termination Date) to October 31, 2023.\nOn December 15, 2023, the Company and Renovo entered into a letter agreement (Letter Agreement), whereby they again agreed to extend the Outside Terminate Date to March 31, 2024 and to reduce the number of directors that will be appointed to the Companys board of directors by Renovo following the Merger. With respect to the composition of the board of directors following the Merger, Kristen N. Toomey, one of the prospective Renovo appointees, has subsequently informed the parties that she will not serve on the board of directors following the Merger. Accordingly, pursuant to the Letter Agreement, the parties have determined to revise the terms of the Merger Agreement to only expand the Board to six directors and appoint the remaining previously disclosed Renovo appointees to the board of directors following the consummation of the Merger.\nThe foregoing description of the Letter Agreement does not purport to be complete and is qualified in its entirety by reference to the complete text of the Letter Agreement, which is filed as Exhibit 2.4 to this Annual Report on Form 10-K and incorporated into this Form 10-K by reference.\nThe Original Merger Agreement, the First Amendment, the Second Amendment, and the Letter Agreement are referred to collectively herein as the Merger Agreement.\nSummary of Proposed Terms of the Proposed Merger\nSet forth below is a summary of some of the significant terms of the Merger transaction.\nUnder the terms of the Merger Agreement, at the effective time of the Merger, each outstanding common share, no par value, of Renovo (Renovo Stock) will be converted into and will represent the right to receive 6,000 shares (Exchange Ratio) of common stock, par value $0.0001 per share, of the Company (Company Stock), after giving effect to the Reverse Stock Split (described below). The Exchange Ratio shall be fixed and no adjustment shall be made under any circumstances other than with respect to certain anti-dilution provision of the Merger Agreement. No fractional share of the Company Stock will be issued pursuant to the Merger. To the extent that a holder of Renovo Stock would otherwise have been entitled to receive a fraction of a share of Company Stock (after taking into account all certificates delivered by such holder), such holder shall receive, in lieu thereof, an additional fraction of a share of the Company Stock rounded up to the nearest whole share of the Company Stock.\nThe Merger Agreement requires the parties to enter into various ancillary agreements related to the Merger, including an Investment Letter with each of the shareholders of Renovo (the Renovo Owners), which contains various representations and warranties relating to the Renovo Owners investor status and an agreement regarding transfer restrictions related to the Common Stock to be issued to the Renovo Owners in exchange for the Renovo Stock and a related registration rights agreement pursuant to which the Renovo Owners may request, under certain circumstances and conditions, that the Company register the shares received by the Renovo Owners in connection with the Merger under the Securities Act (the Registration Rights Agreement). As described above, pursuant to the Second Amendment, the parties are also required to deliver the Purchase Option Agreement and the Lease.\nThe foregoing description of the Registration Rights Agreement and the Investment Letter does not purport to be complete and are qualified in their entirety by reference to the complete text thereof, complete copies of which have been filed as exhibits to the Original Merger Agreement filed as Exhibit 2.1 to the Original Merger Form 8-K, and are hereby incorporated by reference herein. Similarly, the foregoing description of the Lease and the Purchase Option Agreement does not purport to be complete and are qualified in their entirety by reference to the complete text thereof, complete copies of which have been filed as exhibits to the Second Amendment, which Second Amendment was included as an exhibit 2.1 to the Second Amendment Form 8-K filed with the Commission, and is incorporated herein by reference.\nConsummation of the Merger is subject to a number of conditions, including among others, the following: (i) approval of the Merger Agreement by Renovos stockholders (Renovo Stockholder Approval), (ii) the Company, as the surviving corporation in the Merger, shall have been approved as a Secondary Metals Recycler under Section 538.25 of the Florida Statutes to be effective immediately following the closing of the Merger, (iii) Renovo shall have provided the Company with a loan of approximately $200,000 (Renovo Loan), as evidenced by a promissory note, to provide the funds necessary for the Company to continue operations and consummate the transactions contemplated by the Merger Agreement (Renovo Promissory Note), (iv) the Company shall have entered into a Registration Rights Agreement, a copy of which is attached as Exhibit A to the Merger Agreement, with each of the Renovo shareholders, (v) each of the Renovo shareholders shall have entered into an Investment Letter which is attached as Exhibit B to the Merger Agreement, (vi) the execution and delivery of the Lease by and between Renovo and 6 LLC, a copy of each which is attached as Exhibit A to the Second Agreement, (vii) the execution and delivery the Purchase Option Agreement by and between the Company and 6 LLC, a copy of each which is attached as Exhibit B to the Second Agreement, (viii) there shall not have been any material adverse effects on the operations of Renovo, (ix) there shall not have been certain additional adverse legal proceedings commenced against the Company or Renovo which prevents the consummation of the Merger transactions, and (x) the satisfaction of certain other customary closing conditions. The Renovo Stockholder Approval and the Renovo Loan conditions have been satisfied as of the date hereof. In addition to the conditions described above, the closing of the Merger transaction also is conditioned upon the approval and prior implementation of an amendment to the Amended and Restated Certificate of Incorporation of the Company to effect (a) a 1-for 500 reverse stock split, such that every holder of the Companys Common Stock shall receive one share of the Companys Common Stock for every 500 shares of the Companys Common Stock held prior to such reverse stock split, and all fractional shares resulting therefrom will be rounded up to the nearest whole share; and (b) a corresponding reduction of the number of authorized shares of Companys Common Stock from 200,000,000 to 20,000,000 shares and the number of shares of Companys Preferred Stock from 20,000,000 to 2,000,000 shares (collectively, the Reverse Stock Split).\nThe Merger Agreement contains customary representations, warranties and covenants made by Renovo, including, among other things, covenants (i) to conduct its business in the ordinary course consistent with past practice during the interim period between the execution of the Merger Agreement and consummation of the Merger and (ii) not to engage in certain kinds of transactions during such period. The Merger Agreement also contains certain termination rights for both the Company and Renovo.\nThe Merger Agreement may be terminated at any time before the effective time of the Merger, whether before or after receipt of the Companys stockholder approval of the Merger, under the following circumstances: (a) by mutual written consent of both parties; (b) by either party if the Merger is not consummated by the Outside Termination Date (as revised under the Letter Agreement, March 31, 2024), provided, however, that no such termination may be made if the failure to close by such date is caused by the action or inaction of the party seeking to terminate the Merger Agreement and such action or inaction is a material breach by such party of its obligations under the Merger Agreement; (c) by either party in the event any material governmental approval required for consummation of the Merger shall have been denied by a final non-appealable action of the applicable governmental authority or if such action taken is not appealed within the time limit for appeal; (d) by either party in the event that any of the conditions precedent to the obligations of such party to consummate the Merger cannot be satisfied or fulfilled by the Outside Termination Date (provided that the terminating party is not then in breach of any representation or warranty contained in this Agreement under the applicable standard set forth in the Merger Agreement or is in material breach of any covenant or other agreement contained in the Merger Agreement); or (e) by the Company if (i) the board of directors of Renovo has withdrawn, modified, or changed its recommendation that the Renovo Owners approve the Merger Agreement, (ii) Renovo has breached its non-solicitation obligations, or (iii) Renovo has failed to execute the Renovo Loan agreements within four business days after the execution of the Merger Agreement (which Renovo Loan was timely executed and funded).\nUnder certain circumstances, if the Company terminates the Merger Agreement for the reason set forth above (other than by mutual agreement or passage of the Outside Termination Date), or Renovo terminates the Merger Agreement in connection with another acquisition proposal, the Company may be entitled to a termination fee of up to $350,000 (for breaches of the non-solicitation and Renovo recommendation requirements or Renovos termination relating to an acquisition proposal) and/or the Company expenses associated with the Merger Agreement and the steps taken in connection with the anticipated consummation of the Merger (including those incurred in connection with the preparation of anticipated Commission filings and the preparation of an Information Statement to be disseminated to stockholders in connection with any stockholders meeting seeking approval of the Merger).\nIf the Merger is consummated, the Company has agreed to take all actions reasonably necessary at the effective time of the Merger to expand the size of the Board of Directors to six and to appoint the following shareholders of Renovo to the surviving corporations Board of Directors to fill the vacancies created thereby: Randall A. Moritz, Keri A. Moritz, and Lori M. Toomey. Lori M. Toomey and James K. Toomey are spouses.\nUnder the rules and regulations of the Commission, the Company, as a shell company, is required to file a Form 8-K within four business days following the close of such Merger transaction that includes certain information relating to the post-Merger surviving corporation as would be required in a Form 10 filed under the Exchange Act, including without limitation, all required disclosures concerning the post-Merger operations and management of the Company and all required consolidated and pro forma financial statements (Merger Form 8-K). The ability to prepare the Merger Form 8-K will be largely dependent on the ability of Renovo to furnish the Company with audited financial statements and other information necessary to prepare such Merger Form 8-K. As a result, as a condition to the closing of the Merger, Renovo is required to provide the Company with all information concerning Renovo and the Renovo Owners as the Company may reasonably request in connection with preparing such Form 8-K disclosures. If Renovo is unable to timely furnish such information to the Company, of which there is no assurance, the Merger Agreement may be terminated and the Merger transaction will not be consummated.\nAlthough the parties have executed the Merger Agreement, there is no assurance that the parties will be able to consummate a Merger transaction. There can be no assurance that the conditions required to complete the Merger will be satisfied or waived on the anticipated schedule, or at all.\nThe foregoing description of the Merger Agreement does not purport to be complete and is qualified in its entirety by reference to (a) the Original Merger Agreement, a complete and true copy of which has been filed as Exhibit 1.1 to our Current Report on Form 8-K filed with the Securities and Exchange Commission (Commission) on October 31, 2022 (Original Merger Form 8-K), and is incorporated herein by reference, (b) the First Amendment, a complete and true copy of which has been filed as Exhibit to 2.1 to our Current Report on Form 8-K filed with the Commission on April 3, 2023 (First Amendment Form 8-K), and is incorporated herein by reference, and (c) the Second Amendment, a complete and true copy of which has been filed as Exhibit to 2.1 to our Current Report on Form 8-K filed with the Commission on August 21, 2023 (Second Amendment Form 8-K), and is incorporated herein by reference.\nBlank Check and Shell Company Status\nTo the extent that the Company should engage in the public issuance of its stock, the Company may be considered to be a blank check company and be subject to certain restrictions and regulations related to the use of aggregate proceeds therefrom. The rules and regulations of the Commission defines blank check companies as any development stage company that is issuing a penny stock, within the meaning of Section 3(a)(51) of the Exchange Act and that has no specific business plan or purpose, or has indicated that its business plan is to merge with an unidentified company or companies. Pursuant to Rule 12b-2 promulgated under the Exchange Act, the Company also qualifies as a shell company, because it has no or nominal assets (other than cash) and no or nominal operations. Many states have enacted statutes, rules and regulations limiting the sale of securities of blank check companies in their respective jurisdictions. Management does not intend to undertake any efforts to cause a market to develop in our securities, either debt or equity, until we have successfully concluded a business combination transaction.\nIf the Merger transaction is consummated, the Company should no longer be classified as a shell company under the Commissions rules and the filing of the Merger Form 8-K should constitute the filing of current Form 10 Information under Rule 144(i)(2) and (3) and Instruction B.6. of Form S-3, each as promulgated by the Commission under the Securities Act.\nEmployees\nWe presently have no employees apart from our management. Our officers and directors are engaged in outside business activities and are employed on a full-time basis by certain unaffiliated companies. Our officers and directors will be dividing their time among these entities and anticipates that they will devote very limited time to our business until the acquisition of a successful business opportunity has been identified. The specific amount of time that management will devote to the Company may vary from week to week or even day to day, and therefore the specific amount of time that management will devote to the Company on a weekly basis cannot be ascertained with any level of certainty. In all cases, management intends to spend as much time as is necessary to exercise its fiduciary duties as an officer and director of the Company and believes that it will be able to devote the time required to consummate a business combination transaction as necessary. We expect no significant changes in the number of our employees or the amount of time devoted to our business by our officers and directors other than such changes, if any, incident to any business combination, including the Merger, if consummated. ITEM 1A. RISK FACTORS\nAs a Smaller Reporting Company, the Company is not required to provide the information required by this Item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nAs a Non-Accelerated Filer, the Company is not required to provide the information required by this Item.\nITEM 1C. CYBERSECURITY\nAs a Smaller Reporting Company, the Company is not yet required to provide the information required by this Item. ITEM 2. PROPERTIES\nThe Company neither rents nor owns any properties. The Company utilizes the office space and equipment of its Chief Financial Officer at no charge. In the event that the Merger is consummated, the Company will become a party to the Lease related to its use of the property on which the Renovo business is conducted post-Merger. ITEM 3. LEGAL PROCEEDINGS\nThere are presently no pending legal proceedings to which the Company, any of its subsidiaries, any executive officer, any owner of record or beneficially of more than five percent of any class of voting securities is a party or as to which any of its property is subject, and no such proceedings are known to the Company to be threatened or contemplated against it. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nPrice History. Our Common Stock is not traded on any exchange. Although there is no established trading market for our Common Stock, our Common stock is quoted by the OTC Markets Group, Inc. in their OTC Expert Market tier under the symbol KSSH. Trading in stocks quoted on these markets is often thin and is characterized by wide fluctuations in trading prices due to factors that have little to do with a companys operations, or business, or prospects. There has only been limited and sporadic trading of our Common Stock during the past two fiscal years and there is no assurance that an active trading market will ever develop for our Common Stock.\nThe following table sets forth high and low closing quotations for the quarters indicated. These quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission, and may not necessarily represent actual transactions.\nHigh\nLow\nYear Ended September 30, 2023:\nFirst Quarter (10/1/22 to 12/31/22)\n$ 0.0003\n$ 0.0002\nSecond Quarter (1/1/23 to 3/31/23)\n$ 0.0003\n$ 0.0003\nThird Quarter (4/1/23 to 6/30/23)\n$ 0.0007\n$ 0.0004\nFourth Quarter (7/1/23 to 9/30/23)\n$ 0.0008\n$ 0.0008\nYear Ended September 30, 2022:\nFirst Quarter (10/1/21 to 12/31/21)\n$ 0.0050\n$ 0.0000\nSecond Quarter (1/1/22 to 3/31/22)\n$ 0.0010\n$ 0.0010\nThird Quarter (4/1/22 to 6/30/22)\n$ 0.0029\n$ 0.0010\nFourth Quarter (7/1/22 to 9/30/22)\n$ 0.0033\n$ 0.0029\nThe numbers of holders of record of our Common Stock on December 15, 2023 was approximately 70. On December 13, 2023 the last reported sale price of our Common Stock as quoted by the OTC Markets Group, Inc. in the OTC Expert Market tier was $0.0001 per share.\nThe trading volume in our Common Stock generally has been sporadic and extremely limited. The limited nature of the trading market can create the potential for significant changes in the trading price for our Common Stock as a result of relatively minor changes in the supply and demand for our Common Stock and perhaps without regard to our business activities. Because of the lack of specific transaction information and our belief that quotations during the period were particularly sensitive to actual or anticipated volume of supply and demand, we do not believe that such quotations during these periods are necessarily reliable indicators of a trading market for the Common Stock.\nImpact of Penny Stock Designation. Our Common Stock is designated as a penny stock under the Exchange Act, and the Commission has adopted rules which regulate broker-dealer practices in connection with transactions in penny stocks (Rules 15g-2 through l5g-6 of the Exchange Act, which are referred to as the penny stock rules). Penny stocks generally are any non-Nasdaq equity securities with a price of less than $5.00, subject to certain exceptions. The penny stock rules require a broker - dealer to: (a) deliver a standardized risk disclosure document established under the penny stock rules, (b) provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction, monthly account statements showing the market value of each penny stock held in the customers account, (c) make a special written determination that the penny stock is a suitable investment for the purchaser, and (d) receive the purchasers written agreement to the transaction. These disclosure and other requirements may have the effect of reducing the level of trading activity, if any, in the secondary market for a stock that is subject to the penny stock rules. Since our Common Stock is subject to the penny stock rules, persons holding or receiving such shares may find it more difficult to sell their shares. The market liquidity for the shares could be severely and adversely affected by limiting the ability of broker-dealers to sell the shares and the ability of shareholders to sell their stock in any secondary market.\nRestrictions on the Use of Rule 144 by Shell Companies or Former Shell Companies. Historically, the Commissions staff has taken the position that Rule 144 is not available for the resale of securities initially issued by companies that are, or previously were, blank check companies, to their promoters or affiliates despite technical compliance with the requirements of Rule 144. The Commission has formalized and expanded this position in recent amendments to Rule 144 which prohibit the use of Rule 144 for resale of securities issued by any shell companies (other than business combination related shell companies) or any issuer that has been at any time previously a shell company. The Commission has provided an exception to this prohibition, however, if the following conditions are met:\n·\nthe issuer of the securities that was formerly a shell company has ceased to be a shell company;\n·\nthe issuer of the securities is subject to the reporting requirements of Section 13 or 15(d) of the Exchange Act;\n·\nthe issuer of the securities has filed all Exchange Act reports and material required to be filed, as applicable, during the preceding 12 months (or such shorter period that the issuer was required to file such reports and materials), other than Form 8-K reports; and\n·\nat least one year has elapsed from the time that the issuer filed current Form 10 Information with the Commission reflecting its status as an entity that is not a shell company (which can be furnished on any other applicable form).\nAs a result, our existing stockholders will not be able to sell the shares pursuant to Rule 144 without registration until one year after we have completed our business combination and have satisfied the four conditions of a former shell company as described above.\nIf the Merger transaction is consummated, the Company should no longer be classified as a shell company under the Commissions rules and the filing of the Merger Form 8-K should constitute the filing of current Form 10 Information under Rule 144 referenced in the bullet point above.\nDividends\nHolders of the Companys Common Stock are entitled to receive dividends when and if declared by its Board of Directors out of funds legally available therefore. The Company, however, has never declared any cash dividends on its common shares and does not anticipate the payment of cash dividends in the foreseeable future. We do not have earnings out of which to pay cash dividends. We may consider payment of dividends at some point in the future when and if we have earnings sufficient for that purpose, but the declaration of dividends is at the discretion of the board of directors, and there is no assurance that dividends will be paid at any time.\nSecurities Authorized under Equity Compensation Plans\nWe do not presently maintain any equity compensation plans.\nRecent Sales of Unregistered Securities\nWe did not engage in any sales of unregistered securities during the fiscal year ended September 30, 2023.\nTransfer Agent\nThe transfer agent and registrar for our common shares is Manhattan Transfer Registrar Co., whose address is 38B Sheep Pasture Road, Port Jefferson, New York 11777 and whose telephone number is 631-928-7655. ITEM 6. [Reserved] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nGeneral\nThis Managements Discussion and Analysis of Financial Condition and Results of Operations discusses the operating results and financial condition of the Company for the fiscal years ended September 30, 2023 and 2022. The discussion and analysis set forth below is intended to assist you in understanding the financial condition and results of our operations and should be read in conjunction with our audited financial statements and the accompanying notes included elsewhere in this Form 10-K. Our results of operations and financial condition, as reflected in the accompanying statements and related notes, are subject to managements evaluation and interpretations of business conditions, changing market conditions and other factors. Historical results and trends that might appear should not be taken as indicative of future operations. The following discussion contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of various factors, including those discussed elsewhere in this Form 10-K.\nOverview\nOperations. During the fiscal year ended September 30, 2010, the Company defaulted on its loan agreements with AMI Holdings, Inc., a corporation controlled by Mr. Toomey, a shareholder, officer and director of the Company, and certain of his relatives (AMI), and on May 24, 2010, AMI foreclosed on and took possession of all of the Companys then-existing operating entities. On September 16, 2011, the Company, having only 69 holders of record and no significant assets, filed a Form 15 with the Commission to terminate the registration of its Common Stock under Section 12 of the Exchange Act and to suspend its reporting obligations under Section 15(d) of the Exchange Act.\nIn 2014, the Company took the steps necessary to reactivate its reporting obligations that had been suspended since 2011 under Section 15(d) of the Exchange Act (Reactivation Actions). The Company completed its Reactivation Actions and commenced its reactivated reporting obligations on December 17, 2014. However, the Company was unsuccessful in its endeavor to identify and engage in a business combination with a potential target company or business following its Reactivation Actions and, as of the fiscal year ended September 30, 2016, the Company had expended substantially all of its available cash and was unable to secure any additional funds to finance its operations. As a result, the Company was dormant from such date through May 2020 (the Dormancy Period).\nIn May 2020, the Company determined that the business environment had sufficiently changed so that identifying a target and completing a business combination may be more likely than was previously the case. As part of this strategy, the Company determined to attempt to seek the financing necessary to prepare and file all of its periodic reports on Form 10-K under the Exchange Act that were not filed during its Dormancy Period and to again aggressively pursue an acquisition target. In order for the Company to finance the preparation and filing of such periodic reports with the Commission, Mr. Toomey loaned the Company funds during the fiscal year ended 2020 and the first quarter of the 2021 fiscal year to finance such activities.\nOn March 2, 2022, the Company completed its filings with the Commission under the Exchange Act of all its periodic reports on Form 10-K for the fiscal years ended September 30, 2016 through 2021, as well as Forms 10-Q for the most recently completed fiscal year ended (Filing Updates).\nThe Company entered into preliminary discussions regarding a potential business combination and equity financing transaction with, and undertook due diligence review of, Renovo. On October 28, 2022, the Company entered into a Merger Agreement with Renovo and the Companys operations since that date have been solely limited to taking the necessary to consummate the Merger Agreement, including the negotiation of the First Amendment and Second Amendment and the Letter Agreement, and preparing for a Stockholders Meeting to vote on the Merger proposal, as well as preparing and filing its periodic reports with the Commission.\nFinancial Condition. We did not record revenues from operations during the fiscal years covered by our financial statements included in this Form 10-K and are not currently engaged in any business activities that provide cash flows. We do not expect to generate any revenues over the next 12 months, unless we enter into and complete a business combination transaction, such as the Merger transaction, during that period of time.\nWe have negative working capital, negative stockholders equity and have not earned any revenues from operations since the fiscal year ended September 30, 2011. Because we have had no revenues from operations and do not own any significant assets against which we can borrow funds, we historically had relied on funds furnished by Mr. Toomey, a principal shareholder, director and secretary of the Company, in exchange for issuances of our convertible debt securities in order to finance our operations following our Reactivation Actions. However, Mr. Toomey temporarily ceased financing our operations at the end of our 2016 fiscal year end.\nFollowing our determination that the business environment was once again favorable to pursue our strategy, Mr. Toomey again agreed to provide us with debt financing to recommence our operations. In order to fund our operations and proposed business activities through such time as we may consummate a merger or other business combination with a target company or business operation, we will need to continue to raise the required capital through the issuance of equity or debt securities or by other means. Although Mr. Toomey has provided us with additional debt financing since May 2020, we have no formal commitment that Mr. Toomey will continue to provide the Company with working capital sufficient until we consummate a merger or other business combination with a target company or business operation, and we anticipate that his willingness to provide additional financing will be dependent on our ability to demonstrate meaningful progress with our business strategy.\nIn connection with the Merger Agreement, Renovo provided the Company with the Renovo Loan and, following the execution of the Merger Agreement, has paid various professional fees on behalf of the Company as described below.\nOur ability to continue as a going concern is dependent upon our ability to develop additional sources of capital, locate and complete a merger with another company, including the proposed Merger, and ultimately, achieve profitable operations.\nExcept as described herein as it relates to the proposed Merger, we have no specific plans, understandings or agreements with respect to the raising of any additional financings, and we may seek to raise the required capital by the issuance of equity or debt securities or by other means. Since we have no such arrangements or plans currently in effect (other than the proposed merger described herein), our limited ability to raise funds to continue operations and to seek an acquisition may have a severely negative impact on our ability to become a viable company. Our historical operating results disclosed in this Form 10-K are not meaningful to our future results.\nResults of Operations\nComparison of Years Ended September 30, 2023 and 2022\nRevenues. Because we currently do not have any business operations, we have not had any revenues during our fiscal years ended September 30, 2023 and September 30, 2022.\nOperating Expenses. We had operating expenses of $259,421 and $185,800 for the fiscal years ended September 30, 2023 and 2022, respectively. Our expenses during the fiscal years ended September 30, 2023 and September 30, 2022 primarily consisted of payments associated with maintaining our corporate status and expenses were incurred in connection with our professional fees to prepare and file certain of our SEC filings in connection with the Filing Updates. During the fiscal year ended September 30, 2023, we had $206,788 in expenses and professional fees incurred in connection with our due diligence of, and negotiations regarding a potential business combination with, the Renovo Group (Renovo Related Fees) which are included in the above total expenses. The increase in such expenses for the fiscal year ended September 30, 2023 as compared to the same period ended September 30, 2022 primarily was due to such Renovo Related Fees.\nOther Expenses. We had interest expenses of $17,882 and $6,327 for the fiscal years ended September 30, 2023 and 2022, respectively. The interest expenses in 2023 increased from those in 2022 due to an additional loan from a related party during 2023.\nNet Income (Loss). We recognized a net loss of $277,303 for the fiscal year ended September 30, 2023 as compared to a net loss of $192,127 for the fiscal year ended September 30, 2022. The increase in net loss was directly attributable to the payment of additional professional fees incurred in connection with the Filing Updates and the Renovo Related Fees incurred during the current fiscal year.\nLiquidity and Capital Resources\nAs of September 30, 2023, we had limited available cash resources and we had a working capital deficit of $531,494. Our current liabilities were $532,889 at September 30, 2023 and $324,437 at September 30, 2022. Total assets increased to $1,395 as of September 30, 2023 from $246 as of September 30, 2022 due primarily to the additional $200,000 loan from a related party offset by additional expenses associated with the Renovo Related Fees in the fiscal year ended September 30, 2023.\nWe had no material commitments for capital expenditures as of September 30, 2023 and 2022. However, if we are able to execute our business plan as anticipated in the future, including the consummation of the proposed Merger transaction with the Renovo described in Item 1. Business - Business Operations and Proposed Merger Transaction, we would likely incur substantial capital expenditures and require additional financing to fund such expenditures.\nIn connection with our Reactivation Actions, the subsequent preparation of the filing updates and related activities, the maintenance of our corporate and Commission filing requirements, and the preparation and negotiation of the Merger transaction with Renovo, we have entered into various lending arrangements with related parties to finance our activities. Set forth below is a summary of our outstanding debt obligations.\nThe Company entered into a convertible note with a director for $20,000 effective December 7, 2015. The note bears interest at a rate of 3.5% per annum and all unpaid principal and interest are due on demand by the director. The outstanding principal balance of the note, which is $25,555 as of September 30, 2023, is convertible into the Companys shares of common stock at the conversion price of $1.00 per share.\nThe Company entered into a convertible note with a director for $20,000 effective March 3, 2016. The note bears interest at a rate of 3.5% per annum and all unpaid principal and interest are due on demand by the director. The outstanding principal balance of the note, which is $25,299 as of September 30, 2023, is convertible into the Companys shares of common stock at the conversion price of $1.00 per share.\nThe Company entered into a convertible note with a director for $30,000 effective July 11, 2016. The note bears interest at a rate of 3.5% per annum and all unpaid principal and interest are due on demand by the director. The outstanding principal balance of the note, which is $37,580 as of September 30, 2023, is convertible into the Companys shares of common stock at the conversion price of $1.00 per share.\nThe Company entered into a convertible note with a director for $20,000 effective September 19, 2016. The note bears interest at a rate of 3.5% per annum and all unpaid principal and interest are due on demand by the director. The outstanding principal balance of the note, which is $24,415 as of September 30, 2023, is convertible into the Companys shares of common stock at the conversion price of $1.00 per share.\nThe Company entered into a note to convert prior advances in a note payable with Mr. Toomey, a director, for $130,000 effective February 1, 2021 (the 2021 Promissory Note). The note bears interest, commencing on the date of the loan, at an initial rate of 2% per annum and the note matures on December 31, 2023. As of September 30, 2023, the 2021 Promissory Note had an outstanding principal balance of $137,072. The maturity date of the note will accelerate and be due and payable immediately upon any change of control, merger, or other business combination (as defined in the note). If the maturity date is extended for any reason whatsoever (including in connection with an acceleration event), the note will bear interest at a rate of 5% per annum, commencing on the date of any such extension. The note is not convertible into shares of the Companys Common Stock.\nFollowing the completion of the Filing Updates, the Company borrowed $50,000 in aggregate principal amount from James K. Toomey, the Companys corporate secretary and a director, (the Toomey Loan). The Toomey Loan is evidenced by a consolidated promissory note, dated March 7, 2022, issued by the Company to Mr. Toomey (the 2022 Promissory Note). The 2022 Promissory Note bears interest, commencing on the date of the loan, at an initial rate of 2% per annum and the note matures on December 31, 2024. As of September 30, 2023, the 2022 Promissory Note had an outstanding principal balance of $51,556. The maturity date of the 2022 Promissory Notes will accelerate and be due and payable immediately upon any change of control, merger, or other business combination (as defined in the 2022 Promissory Note). If the maturity date is extended for any reason whatsoever (including in connection with an acceleration event), the 2022 Promissory Note will bear interest at a rate of 5% per annum, commencing on the date of any such extension. The 2022 Promissory Note is not convertible into our common shares. The proceeds of the Toomey Loan were used to pay outstanding amounts owed for professional services, to pay operating expenses, and to pursue the Companys acquisition strategy.\nOn October 28, 2022, the Company and Renovo entered into the Merger Agreement, as discussed in greater detail in Item 1. Business - Business Operations and Proposed Merger Transaction pursuant to which Renovo will be merged with and into the Company, with the Company being the legal successor or surviving corporation in the Merger. Pursuant to the terms of the Merger Agreement, Renovo loaned $200,000 in principal amount to the Company on October 28, 2022 (referred to as the Renovo Loan). The Renovo Loan is evidenced by a consolidated promissory note, dated October 28, 2022, issued by the Company to Renovo (referred to as the Renovo Promissory Note).\nThe Renovo Promissory Note bears interest, commencing on the date of the loan, at an initial rate of 6% per annum and the note matures on October 28, 2024. No payments of principal or interest are due prior to the maturity date and on such date all such amounts are payable in full. As of September 30, 2023, the Renovo Promissory Note had an outstanding principal balance of $210,981. The Company may prepay the amounts owed under the Renovo Promissory Note at any time without any prepayment penalties. In the event of a default by the Company under the Renovo Promissory Note, the outstanding principal amount, accrued and unpaid interest, and all other amounts payable under the Renovo Promissory Note shall become immediately due and payable without notice, declaration, or other act on the part of the Renovo. The proceeds of the Renovo Loan have been used to provide the funds necessary for the Company to continue operations and consummate the transactions contemplated by the Merger Agreement.\nOn August 18, 2023, Renovo and the Company negotiated and entered into an addendum to the Renovo Promissory Note, dated August 18, 2023 (the Renovo Promissory Note Addendum), providing that in the event that the Merger does not close, the Company may issue shares of Common Stock to Renovo in order to satisfy its obligations under the Renovo Promissory Note, including all accrued interest.\nA complete copy of the Renovo Promissory Note is filed as Exhibit 2.2 to the Original Merger Form 8-K filed with the Commission and a complete copy of the Renovo Promissory Note Addendum is filed as Exhibit to 10.1 to the Second Amendment Form 8-K filed with the Commission, each of which is incorporated herein by reference.\nIn addition to the Renovo Promissory Note, during the year ended September, 30, 2023, Renovo paid various professional fees on behalf of the Company amounting to approximately $174,000 as of September 30, 2023. These advances are non-interest bearing and unsecured.\nSubsequent Events\nOn December 15, 2023, Mr. Toomey and the Company entered into Amendment to the 2021 Promissory Note (2021 Promissory Note Amendment) to extend the maturity date of the 2021 Promissory Note to December 31, 2024. The foregoing description of the 2021 Promissory Note Amendment does not purport to be complete and is qualified in its entirety by reference to the complete text of the 2021 Promissory Note Amendment, a copy of which is filed as Exhibit 10.9 to this Annual Report on Form 10-K and incorporated into this Form 10-K by reference.\nGoing Concern\nThe Company is required to evaluate whether there is a substantial doubt about its ability to continue as a going concern in each reporting period. In evaluating the Companys ability to continue as a going concern, management has considered conditions and events that could raise substantial doubt about the Companys ability to continue as a going concern for one year following the date the Companys financial statements are issued. These conditions and evaluations included the Companys current financial condition and liquidity sources, including current cash balances, forecasted cash flows, obligations due within twelve months from the date of this Annual Report, on Form 10-K including the Companys obligations described in Note 4 - Convertible Notes Payable to Related Party, Note 5 - Notes Payable to Related Party, and the other conditions and events described below, including those described in Note 3 - Going Concern.\nManagements plans to alleviate substantial doubt include (a) completion of the Merger, (b) negotiating favorable repayment terms to and other revisions to any Renovo debt assumed in connection with the consummation of the Merger, (c) negotiating favorable repayment terms to and other revisions to any debt that may be assumed in the event that the Company elects to exercise its Purchase Option post-Merger to acquire 6, LLC, and (d) pursuing additional equity and debt financings to replace or repay any such assumed debt.\nFurthermore, because we do not have any revenues from operations, if we are unable to consummate the Merger or other business combination with an operating company or a public or private sale of our equity or debt securities, the occurrence of which cannot be assured, we will continue to be dependent upon future loans or equity investments from our present stockholders or management to fund operating shortfall and do not foresee a change in this situation in the immediate future. We will attempt to raise capital for our current operational needs through loans from related parties, debt financing, equity financing, or a combination of financing options. However, there are no existing undertakings, commitments, or agreements for any debt or equity financings and there is no assurance to that effect. Further, our need for capital may change dramatically if unknown claims or debts surface or if we consummate the Merger or acquire a business opportunity. There can be no assurances that any additional financings will be available to us on satisfactory terms and conditions, if at all. Unless we can close the Merger or other business combination with an operating company or successfully conduct a public or private sale of our equity or debt securities, our ability to continue as a going concern is doubtful.\nBased on the uncertainty of achieving these goals and the significance of these factors described herein, there is substantial doubt as to the Companys ability to continue as a going concern for a period of one year after the September 30, 2023 financial statements are issued.\nOff-Balance Sheet Arrangements\nWe do not have any off balance sheet arrangements.\nCritical Accounting Policies and Estimates\nWe prepare our financial statements in conformity with accounting principles generally accepted in the United States of America (GAAP), which requires management to make certain estimates and assumptions and apply judgments.\nIn its report dated December 18, 2023, our auditors, Accell Audit & Compliance P.A., expressed an opinion that there is substantial doubt about our ability to continue as a going concern. Our financial statements do not include any adjustments that may result from the outcome of this uncertainty. We generated no operating revenues for the fiscal years ended September 30, 2023 and September 30, 2022, and at September 30, 2023 we had a stockholders deficit of $801,494. Furthermore, at September 30, 2023 and 2022, we had an accumulated deficit of $5,171,801 and $4,894.498, respectively, and a working capital deficit of $531,494 at September 30, 2023. As a result of our working capital deficiency and anticipated operating costs for the next twelve months, we do not have sufficient funds available to sustain our operations for a reasonable period without additional financing. Our continuation as a going concern is therefore dependent upon future events, including our ability to close the proposed Merger transaction or raise additional capital and to generate positive cash flows.\nWe base our estimates and judgments on historical experience, current trends, and other factors that management believes to be important at the time the financial statements are prepared; actual results could differ from our estimates and such differences could be material. We have identified below the critical accounting policies, which are assumptions made by management about matters that are highly uncertain and that are of critical importance in the presentation of our financial position, results of operations and cash flows. Due to the need to make estimates about the effect of matters that are inherently uncertain, materially different amounts could be reported under different conditions or using different assumptions. On a regular basis, we review our critical accounting policies and how they are applied in the preparation of our financial statements.\nUse of Estimates. The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets, if any, at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from these estimates.\nIncome Taxes. Deferred taxes are provided on the asset and liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Future tax benefits for net operating loss carry forwards are recognized to the extent that realization of these benefits is considered more likely than not. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized.\nThe Company follows the provisions of FASB ASC 740-10 Uncertainty in Income Taxes (ASC 740-10). A reconciliation of the beginning and ending amount of unrecognized tax benefits has not been provided since there are not unrecognized benefits for all periods presented. The Company has not recognized interest expense or penalties as a result of the implementation of ASC 740-10. If there were an unrecognized tax benefit, the Company would recognize interest accrued related to unrecognized tax benefit in interest expense and penalties in operating expenses.\nNet Income (Loss) Per Share. Basic income (loss) per share is computed by dividing net income (loss) available to common shareholders by the weighted average number of outstanding common shares during the period of computation. Diluted loss per share gives effect to potentially dilutive common shares outstanding. The Company gives effect to these dilutive securities using the Treasury Stock Method. Potentially dilutive securities also include other convertible financial instruments. The Company gives effect to these dilutive securities using the If-Converted-Method.\nNew Accounting Pronouncements\nFor a description of recent accounting standards, including the expected dates of adoption and estimated effects, if any, on our financial statements, see Note 8: Recent Accounting Pronouncement in Part II, Item 8 of this Form 10-K. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a Smaller Reporting Company, the Company is not required to provide the information required by this Item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nPage\nReport of Independent Registered Public Accounting Firm (#3289)\nBalance Sheets\nStatements of Operations\nStatements of Changes in Stockholders Deficit\nStatements of Cash Flows\nNotes to Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Kingfish Holding Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Kingfish Holding Corporation (the Company) as of September 30, 2023 and 2022, and the related statements of operations, changes in stockholders deficit, and cash flows for each of the years in the two-year period ended September 30, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the years in the two-year period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has suffered recurring losses from operations and negative operating cash flows since inception. These conditions raise substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there were no critical audit matters.\n/s/ Accell Audit & Compliance, P.A.\nWe have served as the Companys auditor since 2020.\nTampa, Florida\nDecember 18, 2023\n3001 N. Rocky Point Dr. East, Suite 200 ☐ Tampa, Florida 33607 ☐ 813.367.3527\nKINGFISH HOLDING CORPORATION\nBALANCE SHEETS\nSEPTEMBER 30, 2023 AND 2022\nASSETS\nCurrent assets:\nCash\n$ 1,395\n$ 246\nTotal Assets\n$ 1,395\n$ 246\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent liabilities:\nAccounts payable\n$ 94,156\n$ 207,300\nAccrued interest payable\n45,019\n27,137\nConvertible notes payable to related party\n90,000\n90,000\nNotes payable to related party\n130,000\n-\nAdvances from related party\n173,714\n-\nTotal Current Liabilities\n532,889\n324,437\nLong term liabilities:\nNotes payable to related parties\n250,000\n180,000\nRescission liability\n20,000\n20,000\nTotal Long Term Liabilities\n270,000\n200,000\nTotal Liabilities\n802,889\n524,437\nCommitments and contingencies (Note 11)\nStockholders deficit:\nPreferred stock, par $0.0001, 20,000,000 shares authorized, 0 shares issued and outstanding\n-\n-\nCommon stock, par $0.0001, 200,000,000 shares authorized, 120,942,987 shares issued and outstanding\n12,094\n12,094\nPaid in capital\n4,378,213\n4,378,213\nAccumulated deficit\n(5,171,801 )\n(4,894,498 )\nRescission liability\n(20,000 )\n(20,000 )\nTotal stockholders deficit\n(801,494 )\n(524,191 )\nTotal Liabilities and Stockholders Deficit\n$ 1,395\n$ 246\nThe accompanying notes are an integral part of the financial statements\nKINGFISH HOLDING CORPORATION\nSTATEMENTS OF OPERATIONS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND 2022\nExpenses:\nOperating expenses:\nProfessional fees\n$ 257,482\n$ 185,750\nGeneral and administrative\n1,939\nTotal operating expenses\n259,421\n185,800\nOther Expenses:\nInterest expense\n17,882\n6,327\nTotal other expenses\n17,882\n6,327\nTotal expenses\n277,303\n192,127\nNet Loss Before Income Taxes\n(277,303 )\n(192,127 )\nProvision for income taxes\n-\n-\nNet Loss\n$ (277,303 )\n$ (192,127 )\nBasic and diluted net income (loss) per share\n$ (0.00 )\n$ (0.00 )\nBasic and diluted weighted average common shares outstanding\n120,942,987\n120,942,987\nThe accompanying notes are an integral part of the financial statements\nKINGFISH HOLDING CORPORATION\nSTATEMENTS OF CHANGES IN STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND 2022\nCommon Stock\nPaid In\nAccumulated\nRescission\nShares\nPar $0.0001\nCapital\nDeficit\nLiability\nTotal\nBalance, September 30, 2021\n120,942,987\n$ 12,094\n$ 4,378,213\n$ (4,702,371 )\n$ (20,000 )\n$ (332,064 )\nNet Loss\n-\n-\n-\n(192,127 )\n(192,127 )\nBalance, September 30, 2022\n120,942,987\n$ 12,094\n$ 4,378,213\n$ (4,894,498 )\n$ (20,000 )\n$ (524,191 )\nNet Loss\n-\n-\n-\n(277,303 )\n(277,303 )\nBalance, September 30, 2023\n120,942,987\n$ 12,094\n$ 4,378,213\n$ (5,171,801 )\n$ (20,000 )\n$ (801,494 )\nThe accompanying notes are an integral part of the financial statements\nKINGFISH HOLDING CORPORATION\nSTATEMENTS OF CASH FLOWS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND 2022\nCash Flows From Operating Activities:\nNet loss\n$ (277,303 )\n$ (192,127 )\nAdjustments to reconcile net loss to net cash used by operations:\nChanges in operating assets and liabilities:\nAccrued interest payable\n17,882\n6,328\nAccounts payable\n(113,144 )\n97,768\nNet Cash flows used by operating activities\n(372,565 )\n(88,031 )\nCash Flows From Financing Activities:\nAdvances from related party\n173,714\n-\nProceeds from note payable to related party\n200,000\n50,000\nNet Cash flows from financing activities\n373,714\n50,000\nNet Increase (Decrease) in Cash\n1,149\n(38,031 )\nCash at the beginning of year\n38,277\nCash at the end of the year-\n$ 1,395\n$ 246\nSupplemental disclosure of cash flow information:\nCash paid for taxes\n$ -\n$ -\nCash paid for interest\n$ -\n$ -\nNon-cash investing and financing information\nAdvances from related party converted into note to related party\n$ -\n$ 130,000\nThe accompanying notes are an integral part of the financial statements\nKINGFISH HOLDING CORPORATION\nNOTES TO FINANCIAL STATEMENTS\nSEPTEMBER 30, 2023 AND 2022\n1. Business:\nOur Business:\nKingfish Holding Corporation (the Company) was incorporated in the State of Delaware on April 11, 2006 as Offline Consulting, Inc. It became Kesselring Holding Corporation on June 8, 2007 and on November 25, 2014 it changed its name to Kingfish Holding Corporation.\nThe primary business of the Company is to seek a suitable private company acquisition. The Company has not been engaged in any other business activity.\nOn October 28, 2022, the Company and Renovo Resource Solutions, Inc., a Florida corporation (Renovo), entered into an Agreement and Plan of Merger (the Original Merger Agreement), pursuant to which Renovo will be merged with and into the Company (the Merger), with the Company being the legal successor or surviving corporation in the Merger. Consummation of the Merger is subject to a number of conditions, including among others approval of the Merger Agreement by Renovos stockholders, the Company shall have been approved as a Secondary Metals Recycler under Section 538.25 of the Florida Statutes to be effective immediately following the closing of the Merger, and the satisfaction of certain other customary closing conditions.\nOn March 31, 2023, the parties entered into a First Amendment to the Merger Agreement (First Amendment) which amended the Original Merger Agreement to, among other things, extend the date for the closing of the Merger and to revise certain other provisions relating to a delay in the receipt of Renovos audited financial statements required as a condition for closing.\nSubsequent to the date of the First Amendment, the Company was advised by the shareholders of Renovo (Renovo Owners) that, as the sole equity holders of 6 LLC, a Florida limited liability company owned and controlled by the shareholders of Renovo and which owns the buildings and property (Property) on which Renovo conducts its operations (6 LLC), that compliance by Renovo that it acquire 6 LLC prior to the Merger (Acquisition Condition) would have unanticipated material adverse tax consequences to the Renovo Owners.\nOn August 18, 2023, the parties entered into the Second Amendment pursuant to which, the parties have revised the Merger Agreement to, among other things: (i) eliminate the Acquisition Condition; (ii) require as a condition to the closing of the Merger that Renovo would take all steps necessary to cause: (a) 6 LLC to enter into the Lease with Renovo for the Property effective concurrently with or immediately after the closing of the Merger; and (b) 6 LLC and all of the 6 LLC Owners to enter into a Purchase Option Agreement with the surviving corporation; (iii) require delivery of the executed Purchase Option Agreement and Lease at the closing of the Merger, and (iv) extending the Outside Termination Date to October 31, 2023. On December 15, 2023, the Company and Renovo entered into a Letter Agreement which, among other things, again agreed to extend the Outside Terminate Date to March 31, 2024.\n2. Summary of Significant Accounting Policies:\nBasis of presentation:\nThe accompanying financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America (GAAP), and pursuant to the rules and regulations of the SEC and reflect all adjustments, consisting of normal recurring adjustments, which management believes are necessary to fairly present the financial position, results of operations and cash flows of the Company for the years ended September 30, 2023 and 2022.\nUse of estimates:\nThe preparation of financial statements in conformity with GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities, if any at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from these estimates.\nCash:\nCash is maintained at a financial institution and, at times, the balance may exceed federally insured limits. The Company has never experienced any losses related to the balance. Currently, the FDIC provides insurance coverage up to $250,000 per depositor at each financial institution and the Companys cash balance did not exceed such coverage on September 30, 2023.\nFor purpose of the statements of cash flows, the Company considers all highly liquid investments with a maturity of three months or less when purchased to be cash.\nFair Value of Financial Instruments:\nThe carrying amounts of cash and current liabilities approximate fair value because of the short maturity of these items. These fair value estimates are subjective in nature and involve uncertainties and matters of significant judgment, and, therefore, cannot be determined with precision. Changes in assumptions could significantly affect these estimates. Management does not hold or issue financial instruments for trading purposes, nor does the Company utilize derivative instruments in the management of the Companys foreign exchange, commodity price or interest rate market risks.\nThe Financial Accounting Standards Board (FASB) Codification clarifies that fair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. It also requires disclosure about how fair value is determined for assets and liabilities and establishes a hierarchy for which these assets and liabilities must be grouped, based on significant levels of inputs as follows:\nLevel 1:\nQuoted prices in active markets for identical assets or liabilities\nLevel 2:\nQuoted prices in active markets for similar assets and liabilities and inputs that are observable for the asset or liability\nLevel 3:\nUnobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nThe determination of where assets and liabilities fall within this hierarchy is based upon the lowest level of input that is significant to the fair value measurement.\nRevenue Recognition:\nThe Company recognizes revenues in accordance with Accounting Standards Codification (ASC) Topic 606, Revenue from Contracts with Customers, and all related interpretations for recognition of our revenue from services. Revenue is recognized when the following criteria are met:\n·\nidentification of the contract, or contracts, with the customer;\n·\nidentification of the performance obligations in the contract;\n·\ndetermination of the transaction price;\n·\nallocation of the transaction price to the performance obligations in the contract; and\n·\nrecognition of revenue when, or as, we satisfy the performance obligation.\nIncome Taxes:\nDeferred taxes are provided on the asset and liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Future tax benefits for net operating loss carry forwards are recognized to the extent that realization of these benefits is considered more likely than not. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized.\nThe Company follows the provisions of FASB ASC 740-10 Uncertainty in Income Taxes (ASC 740-10). A reconciliation of the beginning and ending amount of unrecognized tax benefits has not been provided since there are no unrecognized benefits for all periods presented. The Company has not recognized interest expense or penalties as a result of the implementation of ASC 740-10. If there were an unrecognized tax benefit, the Company would recognize interest accrued related to unrecognized tax benefit in interest expense and penalties in operating expenses.\nNet income (loss) per share:\nBasic income (loss) per share is computed by dividing net income (loss) available to common stockholders by the weighted average number of outstanding common shares during the period of computation. Diluted loss per share gives effect to potentially dilutive common shares outstanding. The Company gives effect to these dilutive securities using the If-Converted Method. Potentially dilutive securities include convertible financial instruments.\nAt September 30, 2023 and 2022, convertible notes payable to related party of $90,000 can potentially convert into 90,000 shares of common stock. Interest expense related to the convertible notes was immaterial. These shares have been excluded from the diluted net loss per share calculations because the effect of including them would be anti-dilutive at September 30, 2023 and 2022.\n3. Going Concern:\nAs reflected in the Companys financial statements, the Company has an accumulated deficit of $5,171,801 and $4,894,498 as of September 30, 2023 and 2022, respectively. The Company used cash of $372,565 and $88,031 in operating activities during the years ended September 30, 2023 and 2022, respectively. The Company has a working capital deficiency of $531,494 at September 30, 2023 that is insufficient in managements view to sustain current levels of operations for a reasonable period without additional financing. These trends and conditions continue to raise substantial doubt surrounding the Companys ability to continue as a going concern for a reasonable period. Ultimately, the Companys ability to continue as a going concern is dependent upon managements ability to continue to curtail current operating expense and obtain additional financing to augment working capital requirements and support acquisition plans. There can be no assurance that management will be successful in achieving these objectives or obtain financing under terms and conditions that are suitable. The accompanying financial statements do not include any adjustments associated with these uncertainties.\n4. Convertible Notes Payable to Related Party:\nThe Company entered into a convertible note with a director for $20,000 effective December 7, 2015. The note bears interest at a rate of 3.5% per annum and all unpaid principal and interest are due on demand by the director. The outstanding principal balance of the note is convertible into the Companys shares of common stock at the conversion price of $1.00 per share.\nThe Company entered into a convertible note with a director for $20,000 effective March 3, 2016. The note bears interest at a rate of 3.5% per annum and all unpaid principal and interest are due on demand by the director. The outstanding principal balance of the note is convertible into the Companys shares of common stock at the conversion price of $1.00 per share.\nThe Company entered into a convertible note with a director for $30,000 effective July 11, 2016. The note bears interest at a rate of 3.5% per annum and all unpaid principal and interest are due on demand by the director. The outstanding principal balance of the note is convertible into the Companys shares of common stock at the conversion price of $1.00 per share.\nThe Company entered into a convertible note with a director for $20,000 effective September 19, 2016. The note bears interest at a rate of 3.5% per annum and all unpaid principal and interest are due on demand by the director. The outstanding principal balance of the note is convertible into the Companys shares of common stock at the conversion price of $1.00 per share.\nBased on the Companys stock price at the respective commitments dates, the Company determined that the above convertible notes did not have a beneficial conversion feature to the note holder.\nThe above transactions and amounts are not necessarily what third parties would have agreed to.\n5. Notes Payable to Related Party:\nThe Company entered into a note to convert prior advances in a note payable with Mr. Toomey, a director, for $130,000 effective February 1, 2021. The 2021 Promissory Note bears interest, commencing on the date of the loan, at an initial rate of 2% per annum and the note matures on December 31, 2023. The maturity date of the note will accelerate and be due and payable immediately upon any change of control, merger, or other business combination (as defined in the note). If the maturity date is extended for any reason whatsoever (including in connection with an acceleration event), the note will bear interest at a rate of 5% per annum, commencing on the date of any such extension. The note is not convertible into shares of the Companys Common Stock. On December 15, 2023, Mr. Toomey and the Company entered into Amendment to the 2021 Promissory Note to extend the maturity date of the 2021 Promissory Note to March 31, 2024.\nThe Company entered into a note with Mr. Toomey, a director, for $50,000 effective March 7, 2022. The note bears interest, commencing on the date of the loan, at an initial rate of 2% per annum and the note matures on December 31, 2024. The maturity date of the note will accelerate and be due and payable immediately upon any change of control, merger, or other business combination (as defined in the note). If the maturity date is extended for any reason whatsoever (including in connection with an acceleration event), the note will bear interest at a rate of 5% per annum, commencing on the date of any such extension. The note is not convertible into shares of the Companys Common Stock.\nPursuant to the terms of the Original Merger Agreement, Renovo loaned $200,000 in principal amount to the Company on October 28, 2022 (the Renovo Loan). The Renovo Loan is evidenced by a promissory note dated October 22, 2022 issued by the Company to Renovo. The Renovo Promissory Note bears interest, commencing on the date of the loan, at an initial rate of 6% per annum and the note matures on October 28, 2024. No payments of principal or interest are due prior to the maturity date and on such date all such amounts are payable in full. The Company may prepay the amounts owed under the Renovo Promissory Note at any time without any prepayment penalties. In the event of a default by the Company under the Renovo Promissory Note, the outstanding principal amount, accrued and unpaid interest, and all other amounts payable under the Renovo Promissory Note shall become immediately due and payable without notice, declaration, or other act on the part of the Renovo. On August 18, 2023, Renovo and the Company negotiated and entered into an addendum to the Renovo Promissory Note, dated August 18, 2023 (the Renovo Promissory Note Addendum), providing that in the event that the Merger does not close, the Company may issue shares of Common Stock to Renovo in order to satisfy its obligations under the Renovo Promissory Note, including all accrued interest.\nMr. Toomey, Lori M. Toomey (Mr. Toomeys wife), Kristen N. Toomey (Mr. Toomeys adult daughter), and their affiliates (the Toomey Debtholders) have certain affiliate loans to Renovo (the Renovo Affiliate Debt), which, if the Merger is consummated, the Company will assume in connection with the Merger and which will be payable by the surviving corporation post-closing in accordance with the terms of the Renovo Affiliate Debt.\nThe above transactions and amounts are not necessarily what third parties would have agreed to.\n6. Advances from Related Party:\nDuring the year ended September 30, 2023, Renovo paid various professional fees on behalf of the Company amounting to $173,714 as of September 30,2023. These advances are non-interest bearing and unsecured.\nThe above transactions and amounts are not necessarily what third parties would have agreed to.\n7. Preferred Stock:\nThe Company is authorized to issue up to 20,000,000 shares of Preferred Stock with designations, rights and preferences determined from time to time by our Board of Directors. Accordingly, our Board of Directors is empowered, without shareholder approval, to issue Preferred Stock with dividend, liquidation, conversion, voting or other rights that could adversely affect the voting power or other rights of the holders of our Common Stock. The terms of the preferred stock have not been approved. As of September 30, 2023 and 2022, there was no Preferred Stock issued and outstanding.\n8. Income Taxes:\nThe Companys provision (benefit) for income taxes was as follows:\n9/30/2023\n9/30/2022\nCurrent\nFederal\n$ -\n$ -\nState\n-\n-\nForeign\n-\n-\n-\n-\nDeferred\nFederal\n(51,183 )\n(35,462 )\nState\n(7,050 )\n(4,885 )\nTotal\n$ (58,233 )\n$ (40,347 )\nThe income tax provision differs from the amount of tax determined by applying the Federal statutory rate as follows:\n9/30/2023\n9/30/2022\nIncome tax provision at statutory rate:\n$ (58,233 )\n$ (40,347 )\nIncrease (decrease) in income tax due to:\nChange in Valuation Allowance\n58,233\n40,347\nNet deferred tax assets and liabilities were comprised of the following:\n9/30/2023\n9/30/2022\nLong-term deferred tax assets (liabilities)\nNet Operating Loss\n$ 710,833\n$ 652,600\nValuation Allowance\n(710,833 )\n(652,600 )\nThe following is a reconciliation of the applicable federal income tax as computed at the federal statutory tax rate to the actual income taxes reflected in the Statements of Operations for the years ended September 30, 2023 and 2022\nYears Ended September 30,\nTax provision at U.S. federal income tax rate\n18.5 %\n18.5 %\nState income tax provision net of federal\n2.5 %\n2.5 %\nValuation allowance\n(21.0)\n%\n(21.0)\n%\nProvision for income taxes\n0.0 %\n0.0 %\nThe tax benefit for the period presented is offset by a valuation allowance established against deferred tax assets arising from operating losses and other temporary differences, the realization of which could not be considered more likely than not. In future periods, tax benefits and related tax deferred assets will be recognized when management considers realization of such amounts to be more likely than not.\nThe Companys earliest tax year remains subject to examination by all tax jurisdictions was September 30, 2016.\n9. Rescission Liability:\nOn November 20, 2009, the Company issued 2,000,000 shares of its common stock to pay for services valued at $20,000. The issuance of these shares was declared invalid by the court since they were issued by prior management who did not have the authority to do so since they were validly removed on November 16, 2009. These shares remained outstanding at September 30, 2023 and will be returned to the Companys transfer agent upon locating the holder of these shares.\n10. Recent Accounting Pronouncements:\nRecent pronouncements issued by FASB, the American institute of Certified Public Accountants (AICPA) and the Commission did not have a material impact on the Companys present or future financial statements.\n11. Commitments and Contingencies:\nDuring the normal course of business, the Company may be exposed to litigation. When the Company becomes aware of potential litigation, it evaluates the merits of the case in accordance with FASB ASC 450-20-50, Contingencies. The Company evaluates its exposure to the matter, possible legal or settlement strategies and the likelihood of an unfavorable outcome. If the Company determines that an unfavorable outcome is probable and can be reasonably estimated, it establishes the necessary accruals. As of September 30, 2023 and 2022, the Company is not aware of any contingent liabilities that should be reflected in the financial statements.\n12. Subsequent Events:\nOn October 30, 2023, the Company engaged Thomas J. Bellante to serve as a consultant to the Company in the primary role of assisting our Chief Financial Officer with the preparation of the Companys financial statements and with other finance-related tasks as the Chief Financial Officer may request. Mr. Bellantes has currently been engaged to assist with financial statements relating to the calendar year ended December 31, 2023 and each of the future 3-month periods occurring in 2024.\nOn December 15, 2023, the Company and Renovo entered into a Letter Agreement which (a) extend the Outside Terminate Date for the consummation of the Merger to March 31, 2024, and (b) reduced the post-Merger size of the board of directors to six directors and to appoint 3 persons designated by Renovo to fill the vacancies on the board created thereby. .\nOn December 15, 2023, Mr. Toomey and the Company entered into the 2021 Promissory Note Amendment to extend the maturity date of the 2021 Promissory Note to December 31, 2024. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot Applicable. ITEM 9A. CONTROLS AND PROCEDURES\nControls and Procedures\nOur disclosure controls and procedures are designed to provide reasonable assurance that information required to be disclosed in our reports filed under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed in reports filed under the Exchange Act is accumulated and communicated to management, including the principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nOur management evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 15d-15(e) under the Exchange Act) as of the end of the period covered by this annual report. Based upon that evaluation, our management, including our Chief Executive Officer and Chief Financial Officer, concluded that, as of the end of such period, our disclosure controls and procedures were not effective due to material weakness in our internal control over financial reporting in providing reasonable assurance in timely alerting management to material information relating to the Company and that information required to be disclosed in our reports is recorded, processed, summarized, and reported as required to be included in our periodic filings with the Commission.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 15d-15(f) of the Exchange Act. Internal control over financial reporting is a process designed by, or under the supervision of, our sole officer and employee to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States. Internal control over financial reporting includes policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the Companys transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements and that receipts and expenditures of the Companys assets are made in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements. Because of its inherent limitations, internal control over financial reporting is not intended to provide absolute assurance that a misstatement of the Companys financial statements would be prevented or detected.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of September 30, 2023 as required by the Securities Exchange Act of 1934 Rule 15d-15(c). In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) based on the framework in its Internal Control-Integrated Framework (2013 Framework).\nBased on our evaluation, management concluded that our internal control over financial reporting was not effective as of September 30, 2023 because of material weaknesses in our internal control over financial reporting. A material weakness is a control deficiency or combination of deficiencies in internal control, such that there is a reasonable possibility that a material misstatement of the entitys financial statements will not be prevented or detected and corrected on a timely basis. Our management concluded that the Company has several material weaknesses in our internal control over financial reporting because of inadequate segregation of duties over authorization due to the lack of employees for this purpose, lack of sufficient documentation concerning our review, risk assessment, and recording of transactions, as well as the financial reporting of such transactions.\nDue to the Companys limited resources and staffing, management has not developed a plan to mitigate the above material weaknesses. Despite the existence of these material weaknesses, the Company believes the financial information presented herein is materially correct and in accordance with generally accepted accounting principles in the United States.\nHowever, in the event that the Merger is consummated, we will thoroughly evaluate a number of steps to enhance our internal control over financial reporting and address these material weaknesses, including: appointing specific financial reporting personnel with technical accounting and financial reporting experience, adopting policies to ensure proper internal communications and review in connection with non-routine transactions, enhancing our internal review procedures during the financial statement closing process, and designing and implementing journal entry procedures and controls.\nNo system of controls, no matter how well designed and operated, can provide absolute assurance that the objectives of the system of controls are met, and no evaluation of controls can provide absolute assurance that the system of controls has operated effectively in all cases. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nNeither our management nor an independent registered public accounting firm has performed an evaluation of our internal control over financial reporting in accordance with the provisions of the Sarbanes-Oxley Act because no such evaluation has been required because the Company is not an accelerated filer under the Exchange Act.\nChanges in Internal Control over Financial Reporting\nThere were no significant changes in our internal controls or in other factors that could significantly affect these controls subsequent to the date of their evaluation. There was no change in our internal control over financial reporting during the fourth fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe directors and executive officers of the Company, their ages, and positions with the Company as of September 30, 2023 are set forth below.\nName\nAge\nPosition with Company\nTed Sparling\nDirector, President, and Chief Executive Officer\nJames K. Toomey\nDirector and Secretary\nJames M. La Manna\nDirector and Chief Financial Officer\nAll directors of the Company hold office until the earlier of the next annual meeting of shareholders and until their successors have been duly elected and qualified, or their death, resignation, or removal. Officers are elected annually by the respective Boards of Directors of the Company to hold office until the earlier of their death, resignation, or removal.\nSet forth below is a description of the business experience during the past five years or more and other biographical information of the directors and executive officers of the Company.\nTed Sparling has served as the President, Chief Executive Officer, and a director of the Company since January 2012. Mr. Sparling also served as Chief Executive Officer and Secretary from January 2012 until November 2014, and as the President of the Kesselring Corporation, a Florida corporation, from March 2005 (prior to its acquisition by the Company pursuant to the Share Exchange Agreement, dated May 18, 2007 (the Share Exchange Agreement) until October 2007 when the Shares Exchange Agreement was consummated. Mr. Sparling also has served as the President and sole director of Gulf & Bay Constructors, Inc., a building contractor located in north west Florida, since December 2006 and has served in the same capacities for Gulf & Bay Inspections, Inc., a building inspector located in north west Florida, since January 2007. Mr. Sparling has been a state certified building contractor since 1989 and has been a state certified home inspector since 2012.\nMr. Sparlings prior experiences as the President and CEO of the predecessor company provides important background and institutional knowledge about the Company.\nJames K. Toomey has served as Secretary of the Company since November 14, 2014. He was appointed to serve as a director of the Company on August 31, 2013. Mr. Toomey also had served as a director of the Company from 2006 to 2008. Mr. Toomey has served on the board of directors of Research Development and Manufacturing, Inc., a privately held engineering and bio-tech firm, since 2016. He previously has served as a director and Chairman of the Board of Directors of Coast Financial Holdings, Inc. (Coast Financial), a financial institution which was a reporting company under the Exchange Act from its inception in 2003 until its merger with another financial institution in 2007 (the Coast Merger Transaction). He also served as a director of Coast Bank of Florida, a Florida state-chartered bank (Coast Bank), from its inception in April 2000 through the sale of the bank in December 2007 as part of the Coast Merger Transaction. Upon formation of Coast Financial as a bank holding company in 2003, Coast Bank became a wholly-owned subsidiary of Coast Financial. Prior to 2003, Coast Bank was operated as a stand-alone banking institution. Previously, Mr. Toomey served in various positions for Knight-Ridder/Bradenton Herald from August 1990 to September 1997. Since September 1997, Mr. Toomeys business interests have been focused towards commercial shopping development and investments. He is the co-owner of four real estate investment companies (including, Braden River Industries, Inc., a Florida corporation and real estate holding company, and AMI Holdings, Inc., a commercial real estate holding company), a retail clothing company (Two Sides of Nature), and an ice cream store (Two Scoops). Mr. Toomey also has served as a director and co-manager of Renovo Resource Solutions, Inc. (referred to as Renovo), a metal recycling company, since September 2015. In addition, he founded the Toomey Foundation for the Natural Sciences in 2000, a not-for-profit organization for the preservation and education of archeological, paleontological and geological resources. He also has served as a trustee of the Sarasota Marine Safety Foundation, a not-for-profit entity, since 2019 and has been an officer of the Coast Guard Auxiliary since 2008. Mr. Toomey received his MBA from Crummer Graduate School, Rollins College in 1990 and his Bachelor of Arts degree in Economics from Rollins in 1988.\nMr. Toomeys prior experience as a director and Chairman of the Board of a public company and a member of its audit committee will be beneficial to the Company as it reactivates it reporting obligations under the Exchange Act. He understands the disclosure responsibilities and duties owed to shareholders of public companies and can provide his public company experience to the board of directors.\nJames M. La Manna, CPA has served as the Chief Financial Officer of the Company since November 14, 2014 and as a director of the Company since September 13, 2013. Mr. La Manna is a certified public accountant and has served as the Chief Executive Officer and sole owner of James M. La Manna, CPA, PA, an accounting firm, since 2007. Mr. La Manna has been a licensed Florida certified accountant since 1998 and prior to opening his own firm, he had most recently served as a supervising auditor for Aidman Piser, an accounting firm, in 2006 and as a supervising audit and tax partner for Christopher Smith Leonard, an accounting firm, from 2003 - 2006.\nMr. La Mannas experience as a CPA and his qualifications as a potential audit committee financial expert are invaluable skills needed by the Company as it seeks to carry out its business plan.\nConsultant\nOn October 30, 2023, the Company hired Mr. Bellante to serve as a consultant to our Chief Financial Officer to, among other things, assist with the preparation of the Companys financial statements and with other finance-related tasks as the Company may request. Under the terms of his engagement, Mr. Bellante has assisted the Chief Financial Officer with the preparation of the Companys financial statements for the calendar year ended December 31, 2023 (including the audited financial statements for fiscal year ended September 30, 2023, and each of the future 3-month periods occurring in 2024 fiscal year.\nThomas J. Bellante,age 75,has been practicing in public accounting since 1969. In November 2012, he started the CPA firm of Thomas J. Bellante CPA PA, where he is the Managing Partner. It assists smaller/public companies with their SEC filing requirements. Mr. Bellante has been the acting Chief Financial Officer of Innovators, Inc. since February 2022. Innovators is a public company that provides information technology solutions and services to healthcare and laboratory customers in the United States. From 2012 until 2020, Mr. Bellante was the Chief Financial Officer of Garyn Angel Enterprises, Inc., a company that designs, develops, markets and distributes products that provide consumers the ability to refine herbs into topical preparations and ingredients for edibles. He also has been with Surety Accounting Services since their inception in June 2018 until 2019. He was a shareholder with that firm handling tax planning, tax return preparation, financial consulting and bookkeeping for its clients. He joined the firm of Pender McNulty & Newkirk in April 1976. In 1981, he became a partner of that firm. Mr. Bellante led that firms Audit Department and established the SEC Practice Division. Under his leadership, that firms SEC Practice Division was ranked 48th in Bowman First Alerts 2006 list of the Top 100 Public Company Accounting Firms in the U.S. He served as that firms Managing Partner from 1989 to 2005, growing the company to a 52-person CPA firm. In January 2013, Pender Newkirk & Company joined forces with Warren Averett, LLC. Warren Averett, with more than 800 employees, is presently ranked among the nations Top 30 accounting firms. Mr. Bellante served as a leader of that firms SEC Practice Group. Mr. Bellantes industry experience includes reporting for public shell corporations, construction firms, software developers, manufacturing companies, R.V. dealerships, mortgage brokers and bankers, brokerage dealers, international communication system companies, real estate developers, data processing companies, import/export companies, development stage enterprises and multi-state/international corporate conglomerates.\nFamily Relationships\nThere are no family relationships between any of directors or executive officers of the Company.\nInvolvement in Certain Legal Proceedings\nDuring the past ten years, none of our directors, executive officers, promoters, or control persons has been involved in any of the legal proceedings listed in Item 401(f) of Regulation S-K.\nArrangements for Selection of Directors\nExcept as may be contemplated under the terms of the Merger Agreement if consummated, there are no current arrangements or understandings between an executive officer, director, and any other person pursuant to which he was or is to be elected or selected as a director or as an executive officer of the Company.\nDirectorships\nNone of the Companys directors currently is a director of, or during the past 5 years has held any directorship in, any other company with a class of securities registered pursuant to Section 12 of the Exchange Act or subject to the requirements of Section 15(d) of the Exchange Act.\nCode of Conduct and Ethics\nAlthough prior to the filing of its Form 15 with the Commission on September 16, 2011, the Company had previously disclosed in its filings with the Commission that it had adopted a Code of Ethics and Business Conduct for Officers, Directors and Employees, our current management is not familiar with any such Code of Ethics and, to ensure that there are no inadvertent violations thereof, the board of directors has rescinded any and all such existing codes. Although the Company has initially determined to prepare and approve a new Code of Ethics, this was delayed and will be addressed in the future when the Company has additional resources to commit to such endeavors. Accordingly, the Company does not currently have a Code of Ethics.\nCertain Corporate Governance Matters\nThe Board of Directors has established a standing Compensation Committee, but has not established or reinstated any audit or other committees of the board. With the exception of our Compensation Committee, the functions of audit, nominating committees, and any committees forming similar functions are instead being undertaken by our full board of directors and, as a result, the entire board of directors is responsible for the full oversight of the non-compensation affairs of the Company, including the assessment and oversight of the Companys financial risk exposure.\nCompensation Committee. The Compensation Committee is comprised solely of Mr. Toomey, and it did not hold any meetings during fiscal year ended September 30, 2023. The Compensation Committee does not have a charter. However, principal responsibilities of this committee are to review and make recommendations to the Board of Directors concerning the compensation of officers of the Company, to provide input and make recommendations to the Board on individuals elected to be executive officers of the Company, to review and make recommendations with respect to the Companys existing and proposed compensation and bonus plans, and to serve as the committee responsible for administering the Companys existing compensation and benefits plans. In addition, this committee also is responsible for evaluating and recommending compensation to be paid to our directors, including retainers, fees, benefits and perquisites. The sole member of this Committee is not independent within the meaning of the listing standards of the Nasdaq Rule 5605(a)(2)(A).\nShareholder Nominees of Directors. Currently, we do not have a policy regarding the consideration of any director candidates that may be recommended by our shareholders, including the minimum qualifications for director candidates, nor has our sole director established a process for identifying and evaluating director nominees. Furthermore, given our size and lack of operations, we do not have a diversity policy as it relates to the make-up and composition of our directors who serve on the board. We also have not adopted a policy regarding the handling of any potential recommendation of director candidates by our shareholders, including the procedures to be followed. To date, no shareholders have recommended any persons to be nominated for election to our board of directors. Given our relative size and lack of directors and officers insurance coverage, we do not anticipate that any of our shareholders will make such a recommendation in the near future. While there have been no nominations of additional directors proposed, in the event such a proposal is made, all current members of our Board would participate in the consideration of director nominees.\nCompliance with Section 16 of the Exchange Act\nThe completion of our Reactivation Actions in the 2015 fiscal year resulted in the reactivation of the Companys reporting obligations solely under Section 15(d) of the Exchange Act which had been suspended since 2011. Accordingly, the Companys securities are not registered under Section 12 of the Exchange Act and, as a result, the reporting obligations of Section 16 of the Exchange Act do not apply to the Company. ITEM 11. EXECUTIVE COMPENSATION\nCompensation of Executive Officers\nThe Company did not pay any officer or any other person any compensation for the fiscal years ended September 30, 2023 or 2022 and none of our executive officers has an employment agreement with the Company. Furthermore, as of September 30, 2023, none of our executive officers have any outstanding equity awards in his capacity as an employee with respect to the Companys common stock.\nDirector Compensation\nNone of the Companys directors received any cash compensation, equity awards, or other non-cash compensation or other arrangements for services provided in their capacity as directors for the fiscal years ended September 30, 2023 or 2022. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCK HOLDER MATTERS\nThe following table sets forth certain information regarding the beneficial ownership of the Companys outstanding common shares as of November 30, 2023 by: (a) each person known by us to beneficially own 5% or more of the Companys common shares, (b) each director of the Company and each executive officer of the Company, and (c) all directors and executive officers of the Company as a group. Except as otherwise indicated, the persons named in the table below have sole voting and investment power with respect to all of the common shares owned by them.\nName of Beneficial Owner\nCurrent Beneficial Ownership\nNumber (1)\nPercentage (2)\nJames K. Toomey (3)\n84,839,003\n70.08 %\nTed Sparling\n3,719,668\n3.08 %\nJim La Manna\n2,000,000\n1.66 %\nAll directors and executive officers as a group (3 persons)(4)\n90,558,671\n74.81 %\n_____________________________________\n(1)\nFor purposes of this table, a person is deemed to be the beneficial owner of a security if he or she (a) has or shares voting power or dispositive power with respect to such security, or (b) has the right to acquire such ownership within sixty days. Voting power is the power to vote or direct the voting of shares, and dispositive power is the power to dispose or direct the disposition of shares, irrespective of any economic interest in such shares.\n(2)\nIn calculating the percentage ownership or percent of equity vote for a given individual or group, the number of Common Shares outstanding includes unissued shares subject to options, warrants, rights or conversion privileges exercisable within sixty days held by such individual or group, but are not deemed outstanding by any other person or group.\n(3)\nIncludes 4,963,095 common shares held jointly by Mr. Toomey and his spouse over which he has shared voting and investment powers. This also includes 113,866 shares that may be issued upon conversion of the convertible promissory notes and advances in principal aggregate amount of $90,000 issued pursuant to loan advances made in December 2015, March 2016, July 2016, September 2016, and February 2019 (Convertible Notes), including the shares issuable with respect to accrued interest of $23,866 thereon. All of the Convertible Notes are currently convertible at a conversion price of $1.00 per share. Mr. Toomeys address is 800 Morgan-Johnson Road, Bradenton, FL 34208.\n(4)\nIncludes 113,866 shares that may be issued upon conversion of outstanding convertible promissory notes in principal aggregate amount of $90,000 (including shares issuable with respect to accrued interest of $23,866 thereon.).\nChange of Control\nIn the event that the Reverse Stock Split is implemented and the Merger is consummated and, the Renovo stockholders as a group will own 600,000 of the 841,886 post-Merger shares of Common Stock then outstanding (or approximately 71.3% of the post-Merger outstanding Common Stock, with the precise amount dependent on how many fractional shares will be rounded up to the nearest whole share in the Reverse Stock Split).\nFurther, as a result of the Reverse Stock Split, on a pre-Merger basis, Mr. Toomey, Lori M. Toomey (Mr. Toomeys wife), and their affiliates (the Toomey Stockholders) will hold approximately 169,451 shares of the then-outstanding shares of the Company Common Stock and, in connection with the Merger, they will receive 110,000 of the 600,000 shares of our Common Stock issued to the Renovo Holders. Accordingly, following the Merger, the Toomey Stockholders will beneficially own approximately 279,451 shares of the approximately 841,886 then-outstanding shares post-Merger (or approximately 33.2% of the post-Merger outstanding Common Stock) and will continue to be the largest stockholder block of the Company. The number of post-Merger shares held by the Toomey Stockholders assumes that none of the convertible promissory notes held by Mr. Toomey are converted into Common Stock.\nIn addition, Kristen N. Toomey, the adult daughter of James K. Toomey and Lori M. Toomey currently beneficially owns 15% of the outstanding Renovo Stock and, will receive 90,000 shares of our Common Stock issued to the Renovo Holders from the Merger, representing approximately 10.7% of the outstanding post-Merger Common Stock.\nEquity Compensation Plans\nDuring the fiscal year ended September 30, 2023, we did not have any equity incentive or other equity awards plans in which any director, officer, consultant, or employee of our Company was able to participate. During the fiscal year ended September 30, 2023, no individual grants of stock options, whether or not in tandem with stock appreciation rights known as SARs or freestanding SARs were made to our directors or executive officers and, as of September 30, 2023, none of our directors or our executive offices have been granted, or held, any stock options or other equity award to acquire any of our capital stock. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nCertain Relationships and Related Transactions\nToomey Loans to the Company\nDuring the fiscal year ended September 30, 2016, Mr. Toomey has advanced an aggregate of $90,000 to the Company pursuant to the following convertible notes: (a) the December 2015 Note Agreement (bearing interest at 3.5%) in exchange for the December 2015 Promissory Notes (b) the May 2016 Note Agreement (bearing interest at 3.5%) in exchange for the March 2016 Promissory Notes, (c) the August 2016 Note Agreement (bearing interest at 3.5%) in exchange for the July 2016 Promissory Note, and (d) the September 2016 Note Agreement (bearing interest at 3.5%) in exchange for the September 2016 Promissory Note. These promissory notes remain outstanding and are convertible into our common stock at a fixed conversion price equal to $1.00 per share (subject to anti-dilution adjustments).\nIn addition to the above loans, Mr. Toomey also: (a) advanced an aggregate of $130,000 to the Company during the fiscal years ended September 30, 2021 and 2020, evidenced by a consolidated promissory note, dated February 1, 2021, bearing interest at an initial rate of 2% per annum and maturing on December 31, 2023 (the February 2021 Note) and (b) loaned $50,000 in aggregate principal amount to the Company following the completion of the Filing Updates, evidenced by a promissory note, dated March 7, 2022, bearing interest at an initial rate of 2% per annum and maturing on December 31, 2024. These promissory notes remain outstanding and they are not convertible into our Common Stock.\nOn December 15, 2023, Mr. Toomey and the Company entered into Amendment to the 2021 Promissory Note Amendment to extend the maturity date of the 2021 Promissory Note to December 31, 2024. The foregoing description of the 2021 Promissory Note Amendment does not purport to be complete and is qualified in its entirety by reference to the complete text of the 2021 Promissory Note Amendment, a copy of which is filed as Exhibit 10.9 to this Annual Report on Form 10-K and incorporated into this Form 10-K by reference.\nThe maturity date of each of the promissory notes issued to Mr. Toomey to the Company in exchange for his loans will accelerate and be due and payable immediately upon any change of control, merger, or other business combination.\nRenovo Loan and of Certain Advances for Expenses\nPursuant to the terms of the Merger Agreement, Renovo loaned $200,000 in principal amount to the Company on October 28, 2022, evidenced by a promissory note, dated October 28, 2022, issued by the Company to Renovo. The Renovo Promissory Note bears interest, commencing on the date of the loan, at an initial rate of 6% per annum and the note matures on October 28, 2024. Pursuant to the Renovo Promissory Note Addendum, in the event that the Merger does not close, the Company may issue shares of Common Stock to Renovo in order to satisfy its obligations under the Renovo Promissory Note, including all accrued interest. Mr. Toomey, his wife, and his daughter serve on the board of directors of Renovo, and the Toomey Stockholders have an 18.33% equity ownership interest in Renovo.\nDuring the year ended September, 30, 2023, Renovo also paid various professional fees on behalf of the Company amounting to approximately $174,000 as of September 30, 2023. These advances are non-interest bearing and unsecured.\nProposed Merger Transaction and Post-Merger 6 LLC Agreements\nJames K. Toomey and the other Toomey Stockholders, who collectively have a controlling interest in the Company, have an interest in the Merger Agreement and Renovo Promissory Note due to the following relationships: (a) Mr. Toomey, his wife, and his daughter serve on the board of directors of Renovo, (b) Mr. Toomey and his wife serve as executive officers of Renovo, (c) the Toomey Stockholders have an 18.33% equity ownership interest in Renovo and will receive additional shares of Common Stock from the exchange of their Renovo Stock in the Merger, (d) Mr. Toomeys wife will become a director of the combined entity following the consummation of the Merger, (e) the Company will assume the Renovo Affiliate Debt in the amount of approximately $1.6 million, (f) the Renovo Affiliate Debt that will be assumed by the surviving corporation after consummation of the Merger will be payable to a group comprised of Mr. Toomey, Lori M. Toomey (Mr. Toomeys wife), Kristen N. Toomey (Mr. Toomeys adult daughter), and their affiliates (the Toomey Debtholders), and (g) the Toomey Debtholders have a combined one-third equity ownership interest in 6 LLC, which as discussed above, will receive rent payments under the Lease from the surviving corporation. It is anticipated that the rental payments received by 6 LLC will be in part used to service the debts of 6 LLC, including certain debts owed by 6 LLC to the Toomey Debtholders.\nMr. Toomey and his wife currently beneficially own approximately of 84,839,003 shares of Common Stock, or approximately 70.1% of the outstanding Common Stock, and 18.33% of the outstanding Renovo Stock. In the event that the Reverse Stock Split is implemented and the Merger transaction is consummated, the Toomey Stockholders will hold approximately 169,451 shares of the then-outstanding shares of the Company Common Stock and in connection with the Merger they will receive 110,000 shares of our Common Stock in exchange for their shares of Renovo Stock. Accordingly, following the merger, the Toomey Stockholders will beneficially own approximately 279,451 shares of the approximately 841,886 then-outstanding shares of Common Stock the Company (or 33.2% of the then-outstanding shares of Common Stock). The number of post-Merger shares held by the Toomey Stockholders assumes that none of the convertible promissory notes held by Mr. Toomey are converted into Common Stock. In addition, the Toomey Stockholders also will have registration rights under the Registration Rights Agreement to require the Company to register, at its expense, shares of Common Stock held by them, including shares received in exchange for their shares of Renovo Stock pursuant to the Merger.\nIn addition, Kristen N. Toomey, the adult daughter of James K. Toomey and Lori M. Toomey currently beneficially owns 15% of the outstanding Renovo Stock and, will receive 90,000 shares of our Common Stock issued to the Renovo Holders from the Merger, representing approximately 10.7% of the outstanding post-Merger Common Stock.\nThe Toomey Stockholders, as beneficial owners of Renovo and 6 LLC would have experienced certain of the unanticipated material adverse tax consequences to the Renovo Owners described in Note 1 to the financial statements in the event that the Merger transaction continued to require that Renovo acquire 6 LLC prior to the Merger (referred to as the Acquisition Condition). If the Acquisition Condition not been eliminated, it is anticipated that the owners of 6 LLC would have received approximately $5.7 million of taxable gain. Accordingly, the elimination of the Acquisition Condition provided by the Second Amendment may provide significant tax benefits to the Toomey Stockholders, as owners of 6 LLC, if the Merger is consummated.\nIn addition, as holders of 6 LLC Equity Interests, the Toomey Stockholders also have an interest in the Lease Agreement and Purchase Option Agreement to be entered into by 6 LLC in connection with the consummation of the Merger.\nUnder the Lease Agreement, Renovo (and following the Merger, the surviving corporation) will lease the Property on which Renovos operations are currently conducted from 6 LLC for annual rent of $480,000 paid in twelve (12) monthly payments of $40,000, which is inclusive of electrical, water, sewer, and other utilities. The Lease has an initial term of two years, and may be extended for a period of up to five (5) years by the surviving corporation.\nUnder the terms of the Purchase Option Agreement to be executed in connection with the closing of the Merger transaction, the surviving corporation will have the exclusive option, subject to certain conditions, in its sole discretion, exercisable at any time within five (5) years after the closing of the Merger, to acquire 6 LLC in a post-Merger transaction (the Future Acquisition) at a purchase price (Purchase Price) equal to (i) the fair market value of 6 LLC, as determined in accordance with the terms of the Purchase Option Agreement (Fair Market Value) plus (ii) a premium equal to fifteen percent (15%) of the Fair Market Value. To the extent that 6 LLCs outstanding bank loan (Bank Loan) with Hancock Whitney Bank (the Bank) remains outstanding at the time the Purchase Option at the time of any Future Acquisition, either (i) the cash portion of the Purchase Price would be used to first payoff any such amount, or (ii) if the surviving corporation negotiates the assumption of the Bank Loan with the Bank (the Bank Loan Assumption), the dollar amount of the outstanding Bank Loan so assumed shall be applied to the payment of the Purchase Price. It is a condition to the exercise of the Purchase Option that the surviving corporation either repay the Bank Loan or negotiate the assumption of the Bank Loan by the surviving corporation at the closing of the Future Acquisition. The Fair Market Value will be determined by an independent appraisal of the fair market value of the 6 LLC assets (or, upon a bona fide offer with a firm price made by an unaffiliated third party within 12 months of an exercise of the Purchase Option by the surviving corporation).\nDirector Independence\nAlthough there is no established trading market for our common shares, limited and sporadic trading of our common shares is quoted by the OTC Markets Group, Inc. in the OTC Expert Market tier, which does not have director independence requirements or defines who would constitute an independent director. We, however, undertook a review of the independence of our directors using the independence standards for directors provided in the rules of The Nasdaq Stock Market. These rules require consideration of whether any director has a material relationship with us that could interfere with his ability to exercise independent judgment in carrying out his responsibilities. Under Nasdaq Rule 5605(a)(2), however, a director is not considered to be independent if he or she, among other things:\n·\nis, or has been within the past three years, an executive officer or employee of the Company.\n·\nhas accepted or who has an immediate family member who has accepted, with limited exceptions thereto, any compensation from the Company in excess of $120,000 during any period of twelve consecutive months within the three years preceding the determination of independence.\n·\nhas an immediate family member who is, or at any time during the past three years was, employed by the Company as an executive officer.\n·\nexcept under specified limited circumstances, is, or has an immediate family member who is, a partner in, or a controlling shareholder or an executive officer of, any organization to which the Company made, or from which the Company received, payments for property or services in the current or any of the past three fiscal years that exceed 5% of the recipients consolidated gross revenues for that year, or $200,000, whichever is more.\n·\nis or has been, or has an immediate family member who is or has been, within the last three years, employed as an executive officer of another company where any of the Companys present executive officers at the same time serves or served on the other companys compensation committee.\n·\nis, or has an immediate family member who is , a current partner of the Companys outside auditor, or was a partner or employee of the Companys outside auditor who worked on the Companys audit at any time during any of the past three years.\nUnder such definition, as of September 30, 2023, none of our directors could be classified as independent. Each of our directors are considered a non-independent director because of their appointment as executive officers of the Company. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe firm of Accell Audit & Compliance, P.A., an independent registered public accounting firm (AAC), has served as the Companys auditors for the fiscal years ending September 30, 2023 and 2022.\nAudit and Non-Audit Fees\nThe following table presents fees for professional audit services rendered by AAC for the audit of the Companys annual financial statements for the years ended September 30, 2023 and fees billed for other services rendered by AAC during this period.\nAudit fees (1)\n$ 37,500\n$ 30,000\nAudit related fees (2)\n$ 0\n$ 0\nTax fees (3)\n$ 0\n$ 0\nAll other fees (4)\n$ 0\n$ 0\n_______________________\n(1)\nAudit fees consistent principally of audit work performed on the financial statements, as well as work generally only the independent auditors can reasonably be expected to provide, such as statutory audits.\n(2)\nAudit related fees consisted principally of an attestation report on managements report on internal controls, a review of our Form 10-Qs and related press releases, and other general miscellaneous matters.\n(3)\nTax fees consisted principally of assistance with tax compliance, preparation of returns, tax planning, and providing tax guidance.\n(4)\nConsist of fees for products and services provided by our principal accountants, other than services reported under Audit fees, Audit related fees, or Tax fees.\nAs part of its responsibility for oversight of the independent registered public accountants, the board of directors has established a policy to pre-approve all audit and permissible non-audit services provided by the independent auditor. In accordance with this policy, each type of audit, audit related, tax and other permitted service to be provided by the independent auditors is specifically described and each service. The fees are budgeted and the board of directors requires the independent auditor and management to report actual fees versus the budget periodically throughout the year by category of service.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)\nDocuments are filed as part of this report:\n(1)\nFinancial Statements: See Item 8. Financial Statements and Supplementary Data herein.\n(2)\nThe following Financial Statement Schedules are included herein:\nSchedules are not submitted because they are not applicable or not required or because the required information is included in the financial statements or the notes thereto.\n(3)\nThe following exhibits set forth below, numbered in accordance with Item 601 of Regulation S-K, are filed as part of this Report (exhibits marked with an asterisk have been previously filed with the Commission as indicated and are incorporated herein by this reference):\n2.1\nAgreement and Plan of Merger, dated October 28, 2022 by and between Kingfish Holding Corporation and Renovo Resource Solutions, Inc., incorporated herein by reference to Exhibit 2.1 to the Companys Current Report on Form 8-K, filed with the Commission on October 31, 2022.\n2.2\nFirst Amendment to Agreement and Plan of Merger, dated March 31, 2023 by and between Kingfish Holding Corporation and Renovo Resource Solutions, Inc., incorporated herein by reference to Exhibit 2.1 to the Companys Current Report on Form 8-K, filed with the Commission on April 4, 2023.\n2.3\nSecond Amendment to Agreement and Plan of Merger, dated August 18, 2023 by and between Kingfish Holding Corporation and Renovo Resource Solutions, Inc., incorporated herein by reference to Exhibit 2.1 to the Companys Current Report on Form 8-K, filed with the Commission on August 21, 2023.\n2.4 *\nLetter Agreement, dated December 15, 2023 by and between Kingfish Holding Corporation and Renovo Resource Solutions, Inc.\n3.1\nAmended and Restated Certificate of Incorporation of the Company, incorporated herein by reference to Exhibit 3.1 to the Companys Annual Report on Form 10-K, filed with the Commission on December 17, 2014.\n3.2\nAmended and Restated Bylaws of the Company, incorporated herein by reference to Exhibit 3.2 to the Companys Annual Report on Form 10-K, filed with the Commission on December 17, 2014.\n4.1\nAmended and Restated Convertible Promissory Note No. 14 in favor of James K. Toomey in principal amount of $20,000 for December 7, 2015 loan, incorporated herein by reference to Exhibit 4.12 to the Companys Annual Report on Form 10-K, filed with the Commission on December 22, 2015.\n4.2\nAmended and Restated Convertible Promissory Note No. 15 in favor of James K. Toomey in principal amount of $20,000 for March 3, 2016 loan, incorporated herein by reference to Exhibit 4.1 to the Companys Quarterly Report on Form 10-Q, filed with the Commission on May 20, 2016.\n4.3\nAmended and Restated Convertible Promissory Note No.16 in favor of James K. Toomey in principal amount of $30,000 for July 11, 2016 loan, incorporated herein by reference to Exhibit 4.1 to the Companys Quarterly Report on Form 10-Q, filed with the Commission on August 11, 2016.\n4.4\nConvertible Promissory Note No.17 in favor of James K. Toomey in principal amount of $20,000 for September 19, 2016 loan, incorporated herein by reference to Exhibit 4.4 to the Companys Annual Report on Form 10-K for the fiscal year ended September 30, 2016, filed with the Commission on March 1, 2022.\n10.1\nConvertible Promissory Note Purchase Agreement, effective December 15, 2015, by and between Kingfish Holding Corporation and James K. Toomey for December 7, 2015 loan, incorporated herein by reference to Exhibit 10.5 to the Companys Annual Report on Form 10-K, filed with the Commission on December 22, 2015.\n10.2\nConvertible Promissory Note Purchase Agreement, effective May 18, 2016, by and between Kingfish Holding Corporation and James K. Toomey for March 3, 2016 loan, incorporated herein by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q, filed with the Commission on May 20, 2016.\n10.3\nConvertible Promissory Note Purchase Agreement, effective August 10, 2016, by and between Kingfish Holding Corporation and James K. Toomey for July 11, 2016 loan, incorporated herein by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q, filed with the Commission on August 11, 2016.\n10.4\nConvertible Promissory Note Purchase Agreement, effective as of September 19, 2016, by and between Kingfish Holding Corporation and James K. Toomey for September 19, 2016 loan, incorporated herein by reference to Exhibit 10.4 to the Companys Annual Report on Form 10-K for the fiscal year ended September 30, 2016, filed with the Commission on March 1, 2022.\n10.5\nPromissory Note, dated February 1, 2021 in favor of James K. Toomey in the principal amount of $130,000, incorporated herein by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K, filed with the Commission on February 28, 2022.\n10.6\nPromissory Note, dated March 7, 2022 in favor of James K. Toomey in the principal amount of $50,000, incorporated herein by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K, filed with the Commission on March 9, 2022.\n10.7\nPromissory Note, dated October 28, 2022, by and between Kingfish Holding Corporation and Renovo Resource Solutions, Inc., incorporated herein by reference to Exhibit 2.1 to the Companys Current Report on Form 8-K, filed with the Commission on October 31, 2022.\n10.8\nRenovo Promissory Note Addendum, dated August 18, 2023 by and between Kingfish Holding Corporation and Renovo Resource Solutions, Inc., incorporated herein by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K, filed with the Commission on August 21, 2023.\n10.9 *\nAmendment to Promissory Note, dated December 15, 2023 by and between Kingfish Holding Corporation and James K. Toomey, amending that certain Promissory Note, dated February 1, 2021 in favor of James K. Toomey in the principal amount of $130,000,\n31.1 *\nCertification of the Companys Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Rule 15d-14(a)), with respect to the registrants Annual Report on Form 10-K for the year ended September 30, 2023.\n31.2 *\nCertification of the Companys Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Rule 15d-14(a)), with respect to the registrants Annual Report on Form 10-K for the year ended September 30, 2023.\n32.1 *\nCertificate of Principal Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted under Section 906 of the Sarbanes-Oxley Act of 2002 (Rule 15d-14(b)).\n32.2 *\nCertificate of Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted under Section 906 of the Sarbanes-Oxley Act of 2002 (Rule 15d-14(b)).\n101.INS\nInline XBRL Instance Document *\n101.SCH\nInline XBRL Taxonomy Extension Schema Document *\n101.CAL\nInline XBRL Taxonomy Extension Calculation Document *\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase *\n101.LAB\nInline XBRL Taxonomy Extension Labels Linkbase Document *\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document *\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101). *\n* Exhibit Filed Herewith\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nKINGFISH HOLDING CORPORATION\nDate: December 19, 2023\nBy:\n/s/ Ted Sparling\nTed Sparling\nPresident and Chief Executive Officer\nIn accordance with the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Ted Sparling\nPresident, Chief Executive Officer, and Director\nDecember 19, 2023\nTed Sparling\n(Principal Executive Officer)\n/s/ James K. Toomey\nDirector\nDecember 19, 2023\nJames K. Toomey\n/s/ James M. La Manna\nDirector and Chief Financial Officer\nDecember 19, 2023\nJames M. La Manna\n(Principal Financial Officer)"
}