{
    "cik": "1376793",
    "company": "Cavitation Technologies, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-06-30",
    "sic": "0700",
    "state_of_inc": null,
    "state_location": "CA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1376793/0001683168-22-006887-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1376793/000168316822006887/cavitation_i10k-063022.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1376793/0001683168-22-006887.txt",
    "filename": "1376793_10K_2022_0001683168-22-006887.htm",
    "content": "ITEM 1. BUSINESS\nCavitation Technologies, Inc. (referred to herein, unless otherwise indicated, as the Company, CTi, we, us, and our) is a Nevada corporation originally incorporated under the name Bio Energy, Inc. We are a process and product development firm that has developed, patented, and commercialized environmentally friendly technology-based systems that are designed to serve large, growing, global markets such as vegetable oil refining, renewable fuels, water treatment, wines and spirits enhancement, algae oil extraction, water-oil emulsions and crude oil yield improvement. Our systems are designed to process industrial liquids at a reduced processing time, lower operating cost, improved yield while operating in environmentally friendly manner. Our patented Nano Reactor® and LPN™ are the critical components of our business and we have generated all of our revenue while utilizing these components.\nCovid-19\nIn March 2020, the World Health Organization declared coronavirus COVID-19 a global pandemic. This contagious disease outbreak, which has continued to spread, has adversely affected workforces, customers, economies, and financial markets globally. It has also disrupted the normal operations of many businesses. This outbreak could decrease spending, adversely affect demand for the Companys products, and harm the Companys business and results of operations. During the year ended June 30, 2021, the Company believes the COVID-19 pandemic did not materially impact its operating results due to the nature of the Companys business and its operations. The Company has not observed any impairments of its assets or a significant change in the fair value of its assets due to the COVID-19 pandemic. At this time, it is not possible for the Company to predict the duration or magnitude of the adverse results of the outbreak and its effects on the Companys business or results of operations, financial condition, or liquidity.\nVegetable Oil Refining\nOur first commercial application for our technology has been the CTi Nano Neutralization® System which has been utilized to improve edible vegetable oil refining process. Our environmentally friendly process has been shown to reduce refining costs, increase oil yield, and limit the number of chemical additives used in chemical refining of vegetables oils. This patented process (US Patent # 7,762,715 and # 8,042,989) is designed to be incorporated into new and existing soybean, rapeseed, canola and palm vegetable oil refineries.\nOur first pilot test of our CTi NANO Neutralization® System was conducted in 2010 at Carolina Soya, a 200-metric ton/day crude soy oil refining plant in Estill, South Carolina. Our second system, which became operational in fiscal 2011, has been continuously utilized since 2011 at the plant that processes approximately 450 metric tons per day of soy oil. Further, we have successfully shipped over 50 systems domestically and internationally. We also continuously focus on developing additional Nano Reactor® applications and managing the intellectual property issues associated with new processes and applications.\nThe global consumption of vegetable oils has grown consistently at a rate of about 4.1% p.a. from 90.5 million metric tons (MMT) in 2001 to approximately 213 million metric tons (MMT) in 2021-2022. In 2021-2022 consumption of vegetable oil was 213.2 MMT compared to 206.4 MMT in 2020-2021, an increase approximately 3% (https://www.statista.com/statistics/263978/global-vegetable-oil-production-since-2000-2001/). It is also a highly competitive commodity market in which the lowest-cost producer has the advantage.\nDesmet Ballestra Agreement\nOn May 14, 2012, we signed a global R&D, Marketing and Technology License Agreement with Desmet Ballestra Group s.a. (Desmet), a Belgian company that is actively marketing the NANO Neutralization® System, the key component of which is our Nano Reactor® to soybean and other vegetable oil refiners. The Agreement provided Desmet (licensee) a limited, exclusive license and right to develop, design and supply our NANO Neutralization® System which incorporates Nano Reactor® devices on a global basis tools and fats and oleo chemical applications. The agreement expired in May 2015.\nOn January 22, 2016, Desmet and the Company executed a new three year License Agreement with essentially the same terms with the May 2012 agreement that was effective August 1, 2015. As part of the agreement, Desmet provided, under certain conditions, limited monthly advance payments of $50,000 to be applied against gross profit share from future sales. The agreement expired in August 2018.\nOn October 1, 2018, Desmet and the Company executed a new three year License Agreement with essentially the same terms with the January 2016 agreement. As part of the agreement, Desmet provided us under certain conditions, limited monthly advances of $50,000 through October 1, 2021, to be applied against gross profit share from future sales. The agreement expired in October 2021.\nOn November 1, 2021, Desmet and the Company executed a new three-year License Agreement. As part of the agreement, Desmet provides the Company monthly advances of $40,000 through November 1, 2024, to be applied against from future reactor sales.\nDesmet, together with its affiliates, is a global engineering and equipment supply firm engaged in the development, design and supply of process equipment for oils and fats processing facilities including vegetable oil refining, biofuel, oleo chemical, seed crushing, surfactant and detergent markets. Desmet supplies these markets with services based on the latest globally sourced technologies. Desmet has relationships with major refiners globally A significant portion of global vegetable oil refineries include major refiners such as Archer Daniels Midland Company, Cargill, Inc. and Bunge Limited. Desmet has more than 40 sales representatives selling in North America, South America, Europe, and Asia. Since its founding in 1946, Desmet reports that it has built a global network that includes 1,300 employees, 17 global and 8 representative offices, and more than 6,000 lines in a variety of applications. Desmet operates a separate division for each of the above markets and the Desmet Oils & Fats division has supplied small and large plants to approximately 1,900 oil millers in 150 countries, covering over 6,300 process sections.\nAlong with Desmet, we have been working together to accelerate appropriate sales goals and installation process. Our CTi Nano Neutralization® Systems is designed to be used as an add-on process to an existing neutralization system within soybean and other vegetable oil refineries. Desmets focus has been on marketing our CTi Nano Neutralization® Systems to vegetable oil refiners to help them increase profits through cost savings and improved oil yields. Desmet purchases our CTi Nano Neutralization® Systems from us and installs them at the refinery as part of an integrated neutralization system. Based on successful commercial implementations, Desmet guarantees minimum economic benefits to a facility that installs our CTi Nano Neutralization® Systems. We are therefore substantially dependent on Desmet to identify prospects, complete sales contracts, install the system and manage relationships with end-users.\nAdditionally, in fiscal 2017 Desmet installed our first Nano Reactor® at a bio-diesel production plant in South America. Bio-diesel industry has been under pricing pressure for a considerable period of time and slow to adopt to newer technologies. We are continuously working with Desmet pursuing additional sales opportunities in Asia and South America, however, the acceptance of our technology has been slow and there were no sales generated in our Fiscal 2022.\nEnviro Watertek, LLC\nIn April 2019, the Company and Delaware Water Company, LLC (Delaware) formed a limited liability company called Enviro WaterTek LLC (Enviro ,EW). Enviro is owned 50% by the Company and 50% by Delaware, and the Company accounts for its investment in Enviro under the equity method of accounting. From 2019 to 2021, Enviro had insignificant operations. This agreement covers our first commercial entrance into industrial treatment of produced and frac water. Fracking industry has seen a significant growth over the past ten years, reaching daily water consumption volume of over 58 million barrels per day. Our newly designed Low Pressure Nano Reactor (LPN™) was specifically developed to be integrated into produced water treatment system along with our proprietary chemical formulations, and has depicted measurable and quantifiable advantages over industry standard processes and equipment. Our agreement with EW provides for sales on LPN™ plus recurring revenue stream based on processing of produced and frac water volumes and utilization. Our agreement with EW has a fifteen-year term. In March 2020, global pandemic of COVID-19 has taken an unexpected negative impact on the oil and gas industry worldwide, and has consequently impaired our ability to rapidly accelerate LPN™ sales and recurring revenue stream. While the industry has gone through a major overhaul, we are seeing a gradual recovery in the industry. Our current system installations can handle approximately 25,000 barrels per day (BPD), and we received $46,000 in total revenue in our Fiscal 2022 from sale of reactors and usage fee.\nAlchemy Beverages, Inc\nIn fiscal 2014, Roman Gordon, one of our shareholders and a former officer, formed a company, Cameo USA LLC (Cameo). Since its formation, Cameo has had no revenue, no operations, and has had no assets or liabilities. On June 4, 2018, Mr. Gordon contributed his 100% interest in Cameo to Cavitation Technologies, Inc. As Mr. Gordon had no reasonable and objectively supportable basis in the valuation of his investment in Cameo, there was no value assigned to the contribution of Cameo.\nOn June 29, 2018, we agreed to license Cameo to Alchemy Beverages Inc. (ABI). In addition, we have agreed to provide certain licensing rights related to our miniature low pressure nano-reactor (MLPN) to be used in developing and manufacturing of small home appliances to enhance alcoholic beverages. In consideration for these ABI has agreed to issue 19.9% of ABIs outstanding common shares to us (limited to 20 million shares of ABI). ABI is a private company and in the business of producing and selling alcoholic beverages, equipment, and home appliances. Prior to this agreement, ABI was independent of CTI and had no relation to us nor to our management.\nPursuant to the licensing agreements, ABI will have the exclusive global marketing and distribution rights of Cameo and our patented and patent pending technologies for the processing of alcoholic beverages. We have agreed to assist in the installation and maintenance of the MLPN to ABI and will receive royalty payments ranging from 1% to 3% on all net revenues, as defined in our license agreement for the life of the applicable patents. In addition, we will receive leasing, consulting, and manufacturing fees as defined in the licensing agreement.\nAs of June 30, 2022 and the date of this report, ABI has not generated any sales under Cameo brand. Since June 2018, the Company and ABI have developed a small table top home appliance unit Barmuze® utilizing MLPN , allowing consumers to experience a new way of enjoying wines and spirits, utilizing CTis patented and patent pending technologies to molecularly restructure alcohol, convert harsh acids to pleasant tasting esters, and reduce levels of certain impurities commonly present in alcohol.\nDuring fiscal 2022 and 2021, we have received approval for several patent applications, protecting our technology and processing rights, expanding our broad portfolio of patents.\nDuring fiscals 2022 and 2021, there were no sales or royalties generated pertaining to our agreement with Alchemy Beverages, Inc. The investment in ABI has no value assigned to it, which approximates its fair value.\nCustomers Dependence\nWe continue to sell our industrial capacity Nano Reactor® and Nano Neutralization® System through our strategic partner Desmet and most of our revenue for the fiscal year ended June 30, 2022, was derived from sales of reactors to Desmet and the corresponding gross profit share. We have generated minimal revenue pertaining to our licensing agreement with EW in our fiscal 2022. We had no revenue of LPN™ due to COVID-19, whereas oil production in US has negative impact on oil & gas industry. Oil and gas industry has seen a recovery, while price of oil has spiked to around $100 per barrel, and we foresee a great opportunity for our technology providing a significant upside potential both at the point of sale and recurring revenue stream.\nSources and availability of raw materials and the names of principal suppliers\nWe have historically sourced reactor components from various domestic and international suppliers. We do not have any long-term contracts, agreements, or commitments with any supplier. We believe it would take approximately 30 days to find a new supplier, if necessary.\nCompetition\nOur competitors who sell equipment and engineering services for the vegetable oil refining business are a myriad of companies both large and small that provide equipment and technology to oil refiners. These include known companies that have longer operating histories, more experience, and stronger financial capabilities. Competitors include Alfa Laval, and Crown Iron Works as well as many firms that provide advice and services to small and regional firms. In addition, Arisdyne Systems, a designer of cavitation devices, is marketing a system using similar technology. The vegetable oil refining business is a highly competitive commodity market in which the lowest-cost producer has the advantage. We intend to compete by offering solutions that help our clients remain or become a low-cost producer. Because the industry in which we compete has had limited new technology introduced in the last 50 years, we believe our CTi Nano Neutralization® Systems provide a unique opportunity for refiners to increase margins. We seek to differentiate ourselves by offering solutions based on our proprietary and patented designs, processes, and applications to help our clients described in our issued and patent pending applications. We compete by offering solutions that we believe can reduce operating expenses and increase oil yield vs currently applied technologies.\nIn addition, our competitors in produced and frac water treatment application range from local service providers to multi-national global corporations with considerable financial resources, engineering expertise, established and proven technologies. We believe that LPN™ is a conceptually new technology that has not been introduced in the field of water treatment applications up to now. LPN™ has demonstrated exceptional results in treating produced and frac water commercially, significantly reducing the usage of hazards chemicals during the process, meanwhile, achieving desirable water quality for industrial re-use or disposal.\nPatents\nOur Cavitation Generator patent was issued during fiscal 2011. In addition, we have a patent for our Multi-Stage Cavitation Device Nano Reactor® that was issued on October 25, 2011. In the fiscal 2014 we received approvals for another apparatus patent and 2 additional process patents in the US. As of June 30, 2022, our portfolio of patents included 19 issued patents in the United States and 12 issued patents internationally. Our patents cover multiple process and applications of our technology in vegetable oil refining, production of biodiesel, treatment of process and industrial water, upgrade of hydrocarbons and enhancing of alcoholic beverages. We continuously develop new technologies and applications, as we have filed new patent applications for Low Pressure Nano-Reactors LPN™. LPN™ is a highly efficient homogenizer and emulsifier that can be utilized in multiple fluids processing applications. Recently, we have filed a patent application for a small home appliance. This new product is designed directly with consumer in mind and the first step for our company to introduce our technology outside of the industrial sector where we typically sell our products.\nIssued\nUS\nCavitation Generator\n7,762,715\nUS\nMulti-Stage Cavitation Device\n8,042,989\nUS\nProcess for Producing Biodiesel Through Lower Molecular Weight Alcohol-Targeted Cavitation\n8,603,198\nUS\nHigh-Throughput Cavitation and Electro Coagulation Apparatus\n8,673,129\nUS\nExtraction of Oil from Algae by Hydrodynamic Cavitation for Biodiesel Production\n8,709,750\nUS\nFlow-Through Cavitation-Assisted Rapid Modification of Crude Oil\n8,894,273\nUS\nMethod for Cavitation-Assisted Refining, Degumming and Dewaxing of Oil and Fat\n8,911,808\nUS\nProcess to Remove Impurities from Triacylglycerol Oil\n8,945,644\nUS\nProcess for Producing Biodiesel Through Lower Molecular Weight Alcohol-Targeted Cavitation\n8,981,135\nUS\nProcess for Removing Waxes and Phospholipids from Vegetable Oils and Increasing Production of Food Grade Lecithin Therefrom\n9,357,790\nUS\nMethod and Flow Through Hydrodynamic Cavitational Apparatus for Alterations of Beverages\n9,474,301\nUS\nMethod for Cavitation-Assisted Refining, Degumming and Dewaxing of Oil and Fat\n9,481,853\nUS\nProcess for Extracting Carbohydrates from Biomass and Converting the Carbohydrates into Biofuels\n9,611,496\nUS\nFlow-Through Cavitation-Assisted Rapid Modification of Crude Oil\n9,719,025\nUS\nProcesses for Increasing Bioalcohol Yield from Biomass\n9,944,964\nUS\nProcesses for Increasing Bioalcohol Yield from Biomass\n9,988,651\nUS\nProcesses for Extracting Carbohydrates from Biomass and Converting the Carbohydrates into Biofuels\n10.093.953\nUS\nVariable Flow Through Cavitation Device\n10,507,442\nUS\nSystem and Method for Purification of Drinking Water, Ethanol and Alcohol Beverages of Impurities\n10,781,113\nIntl\nProcess to Remove Impurities from Triacylglycerol Oil\nAr AR083000B1\nIntl\nCavitation Generator\nBr - PI0919602-1\nIntl\nProcess to Remove Impurities from Triacylglycerol Oil\nCa - 2,809,236\nIntl\nProcess to Remove Impurities from Triacylglycerol Oil\nMalaysia MY164311A\nIntl\nProcess to Remove Impurities from Triacylglycerol Oil\nMexico - MX/E/2013/015504\nIntl\nProcess to Remove Impurities from Triacylglycerol Oil\nSingapore P187241\nIntl\nProcess to Remove Impurities from Triacylglycerol Oil\nMexico - MX/a/2016/006201\nIntl\nProcess to Remove Impurities from Triacylglycerol Oil\nEU 10 857 392.4\nIntl\nMethod for Cavitation-Assisted Refining, Degumming and Dewaxing of Oil and Fat\nBr PI0919602-1\nIntl\nProcess to Remove Impurities from Triacylglycerol Oil\nFr E 2 616 156\nIntl\nProcess to Remove Impurities from Triacylglycerol Oil\nGr 2 616 156\nIntl\nProcess to Remove Impurities from Triacylglycerol Oil\nUK 2 616 156\nUS\nUS\nSystem and Method for Purification of Alcohol Beverages of Impurities US 10781113\nUS\nMethod and Device for Producing of High-Quality Alcoholic Beverages US 10876084\nPatent Pending Update\nUS\nTabletop Beverage Cavitation Device\nUS\nMethod for Purification of Drinking Water, Ethanol and Alcohol Beverages of Impurities\nUS\nProcess for Increasing Plant Protein Yield from Biomass\nBr\nProcess to Remove Impurities from Triacylglycerol Oil\nEu\nSystem and Method for Purification of Drinking Water, Ethanol and Alcohol Beverages of Impurities\nBr\nProcess to Remove Impurities from Triacylglycerol Oil\nWe plan on continuing to invest in research and development and file for new and improved patents.\nRoyalty Agreements\nOn July 1, 2008, our wholly owned subsidiary entered into Patent Assignment Agreements with two parties, our President as well as our former Chief Executive Officer (CEO) who currently serves as our Technology Senior Manager, where certain devices and methods involved in our hydrodynamic cavitation processes invented by the President and former CEO/current Technology Senior Manager have been assigned to the subsidiary. In exchange, that subsidiary agreed to pay a royalty of 5% of gross revenues to each of the President and former CEO/current Technology Senior Manager for licensing of the technology and leasing of the related equipment embodying the technology. These agreements were subsequently assumed by us on May 13, 2010, from our subsidiary. Our former CEO/current Technology Senior Manager and President both waived their rights to receive royalty payments that have accrued, or that may accrue, on any gross revenue generated through June 30, 2022.\nOn April 30, 2008 and as amended on November 22, 2010, our wholly owned subsidiary entered into an employment agreement with its former Director of Chemical and Analytical Department (the Inventor) to pay, in the first year, an amount equal to 5% of actual gross revenue received by us on any patent for which the Inventor was a legally named inventor, and, in each subsequent year, 3% of actual gross revenue received by us on any such patent. Since entering into that employment agreement, and during the term of this employment agreement, we have not received any revenue on any patents for which the Inventor was a legally named inventor.\nGovernmental Approval and Regulations and Environmental Compliance\nDue to the nature of our products, we have incurred no costs with respect to environmental compliance with federal, state, and local laws. To our knowledge, our products do not require governmental approval, and we do not foresee that governmental regulations will have a material impact on our business.\nEmployees\nAs of June 30, 2022, we had four full-time employees and had engaged several consultants and independent contractors over the past year. Members of our technical team are comprised of experienced professionals who are chemists, civil, chemical, and mechanical engineers with expertise in hydrodynamic cavitation, nano technology and water treatment. These individuals hold degrees in Civil, Chemical, and Mechanical Engineering.\nResearch and Development Expenditures\nDuring the fiscal years ended June 30, 2022 and 2021, we spent $17,000 and $21,000, respectively, on research and development activities. ITEM 1A. RISK FACTORS\nNot applicable for smaller reporting companies. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nOur corporate headquarter is located in Chatsworth, California, with an area of approximately 5,000 square foot facility, which includes office space and an area to conduct research and development. Our lease agreement for this space will end in February 2025. Our monthly rent payments approximate $6,000 up to $7,000. We do not anticipate any material difficulties with the renewal of our rental agreement when it expires or in securing replacement facilities on commercially reasonable terms. ITEM 3. LEGAL PROCEEDINGS\nThe Company may be involved in certain legal proceedings that arise from time to time in the ordinary course of its business. Except for income tax contingencies (commencing April 1, 2009), the Company records accruals for contingencies to the extent that management concludes that the occurrence is probable and that the related amounts of loss can be reasonably estimated. Legal expenses associated with the contingency are expensed as incurred.\nThe Company is not aware of any pending litigations. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nCommon Stock\nOur Common Stock is traded on the OTCQB Market under the symbol CVAT. The following table sets forth the high and low price per share based on the closing price of our Common Stock for the periods indicated.\nHIGH LOW\nFiscal 2021 First Quarter $ 0.02 $ 0.01\nSecond Quarter 0.02 0.01\nThird Quarter 0.07 0.02\nFourth Quarter 0.08 0.04\nHIGH LOW\nFiscal 2022 First Quarter $ 0.11 $ 0.05\nSecond Quarter 0.12 0.06\nThird Quarter 0.12 0.04\nFourth Quarter 0.06 0.04\nFiscal 2023 First Quarter 0.05 0.04\nWe became a public company through a share exchange that was affected in October 2008. The first day of public trading of our stock was November 11, 2008. Since our fiscal year end was changed to June 30, public trading of our stock began in the second quarter of fiscal 2009. As of September 30, 2022, there were approximately 1,500 holders of record of our Common Stock. This does not reflect the number of persons or entities who hold stock in nominee or street name through various brokerage firms. The closing price of our common stock on September 23, 2022 was $0.04.\nDividend Policy\nWe have neither declared nor paid any dividends on our Common Stock in the preceding two fiscal years. We currently intend to retain future earnings, if any, to fund ongoing operations and finance the growth and development of our business and, therefore, do not anticipate declaring or paying cash dividends on our Common Stock for the foreseeable future. Any future decision to declare or pay dividends will be at the discretion of the Board of Directors and will be dependent upon our financial condition, results of operations, capital requirements, and such other factors as the Board of Directors deems relevant.\nSecurities Authorized for Issuance under Equity Compensation Plans\nNone.\nRecent Sales of Equity Securities and Use of Proceeds\nWe sold equity securities during the year ended June 30, 2022 and 2021 as follows:\nIn July 2021, we issued 12,071,785 shares of common stock at a selling price of $0.065 per share and 12,071,785 of warrants, exercisable at $0.09 to various entities and individuals for net proceeds of $785,000. The shares were issued in reliance on Section 4(2) of the Securities Act of 1933, as amended. The shares were not offered via general solicitation to the public. No sales commissions or other remuneration was paid in connection with this issuance.\nIn June 2021, we issued 11,269,538 shares of common stock at a selling price of $0.065 per share and 11,269,538 of warrants, exercisable at $0.09 to various entities and individuals for net proceeds of $728,000. The shares were issued in reliance on Section 4(2) of the Securities Act of 1933, as amended. The shares were not offered via general solicitation to the public. No sales commissions or other remuneration was paid in connection with this issuance.\nIssuer Purchases of Equity Securities\nNone. ITEM 6. SELECTED FINANCIAL DATA\nNot applicable for smaller reporting companies. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis should be read in conjunction with our financial statements and the related notes. This discussion contains forward-looking statements based upon current expectations that involve risks and uncertainties, such as its plans, objectives, expectations and intentions. Its actual results and the timing of certain events could differ materially from those anticipated in these forward-looking statements.\nOverview of Our Business\nWe are a Nevada corporation originally incorporated under the name Bio Energy, Inc. On January 29, 2007, we incorporated a wholly owned subsidiary, Hydrodynamic Technology, Inc. as a California corporation.\nWe have developed, patented, and commercialized proprietary technology that can be used for processing of various industrial and consumer-oriented fluids. Our patented Nano Reactor® is the critical components of the CTi Nano Neutralization® System which has been shown to reduce operating costs and increase yields in processing oils and fats. CTi holds and applied for numerous patents covering technology and various processes in US and Internationally, covering vegetable and crude oil refining, processed and frac water treatment, algae oil extraction, and alcoholic beverage enhancement. During our Fiscal 2022, we have continuously worked on developing additional technologies and products related to low pressure nano reactor (LPN™). LPN™ is designed to become a highly efficient mixer and homogenizer. We believe that LPN™ has a great commercial utilization opportunity by providing efficient and cost-effective solution in multiple fluid processing industries. LPN™ has a number of advantages over current mechanically operated mixers and homogenizers. Industrial application of our technology in produced and frac water treatment system, LPN™ along with our proprietary chemical formulations have depicted measurable and quantifiable advantages over industry standard processes and equipment. Additionally, our miniature low pressure nano reactor MLPN has become an integral part of Barmuze®, a small home appliance device for enhancing taste and extracting unwanted impurities typically present in alcoholic beverages.\nDuring the year ended June 30, 2022, we recorded revenue of $1,665,000 and net loss of $619,000, respectively.\nInflation and potential recession\nWe are, and our suppliers are experiencing significant broad-based inflation of manufacturing and distribution costs as well as transportation challenges, partially as a result of the pandemic. Although we do not believe that inflation has had a material effect on our business, financial condition or results of operations, it may in the future. We are monitoring cost structures and evaluating to what extent any such costs can be passed on to customers, taking into account the overall impact of increasing inflation and interest rate pressures on consumers. We expect input cost inflation to continue at least throughout 2022. If we are unable to successfully manage the effects of inflation, our business, operating results, cash flows and financial condition may be adversely affected. Additionally, there have been various economic indicators that the United States economy may be entering a recession in upcoming quarters. An economic recession could potentially impact the general business environment and the capital markets, which may have a material negative impact on our financial results.\nManagements Plan of Operation\nWe are continuously engaged in manufacturing of our Nano Reactor® and Nano Neutralization® Systems which are designed to help refine vegetable oils such as soybean, canola and rapeseed. Additionally, we have developed LPN™s that provide commercial opportunity in industrial water treatment, enhancement of alcoholic beverages, and MLPN being utilized in a consumer small home appliance.\nDuring the year ended June 30, 2022, we incurred net loss of $619,000 and used cash in operating activities of $484,000. As of June 30, 2022, we have a working capital deficiency of $30,000 and a stockholders surplus of $1,110,000.\nManagements plan is to generate income from operations by licensing our technology globally through Desmet Ballestra Group (Desmet), agreements with EnviroWaterTek and Alchemy Beverages, Inc. In October 2018, we signed a three-year global R and D, Marketing and Technology License Agreement with Desmet for the sale and licensing of our Nano Reactor® and Nano Neutralization® Systems. This agreement is a continuation of the original agreement we signed with Desmet in May 2012. As part of the agreement, Desmet is also obligated to provide us with monthly advances of $40,000 to be applied against the sale of reactors. During the year ended June 30, 2022, advances received from Desmet amounted to $300,000 and together with previous period advances of $727,000, were recorded as revenues totaling $1,027,000. These funds service operational expenses on monthly basis.\nOur agreement with Enviro WaterTek signed in March of 2019, has generated sales of LPN™s and recurring revenue stream in our fiscal 2022, resulting in aggregate revenue of $46,000\nThere was no revenue produced in relationship to our agreement with Alchemy Beverages, Inc.\nWe anticipate that we may need additional funding, and we may attempt to raise additional debt and/or equity financing to fund operations and to provide additional working capital. However, there is no assurance that such financing will be consummated or obtained in sufficient amounts necessary to meet our needs, or that we will be able to meet our future contractual obligations. Should management fail to obtain such financing, we may curtail its operations.\nCritical Accounting Policies and Revenue Recognition\nOur discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements which have been prepared in accordance with accounting principles generally accepted in the United States of America. The preparation of these consolidated financial statements requires management to make certain estimates and assumptions that affect the reported amounts of assets and liabilities and the reported amounts of revenues and expenses. The accounting policies and estimates described below are those we consider most critical in preparing its consolidated financial statements. The following is a review of the accounting policies and estimates that include significant judgments made by management using information available at the time the estimates are made. However, these estimates could change materially if different information or assumptions were used instead.\nNote 1 of the accompanying consolidated financial statements includes a summary of significant accounting policies, estimates, and methods used in the preparation of our financial statements. Accounting estimates are an integral part of the preparation of financial statements and are based on judgments by management using its knowledge and experience about the past and current events and assumptions regarding future events, all of which we consider to be reasonable. These judgments and estimates reflect the effects of matters that are inherently uncertain and that affect the carrying value of our assets and liabilities, the disclosure of contingent liabilities and reported amounts of expenses during the reporting period.\nRevenue Recognition\nThe Company follows the guidance of Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers. ASC 606 creates a five-step model that requires entities to exercise judgment when considering the terms of contracts, which includes (1) identifying the contracts or agreements with a customer, (2) identifying our performance obligations in the contract or agreement, (3) determining the transaction price, (4) allocating the transaction price to the separate performance obligations, and (5) recognizing revenue as each performance obligation is satisfied. The Company only applies the five-step model to contracts when it is probable that the Company will collect the consideration it is entitled to in exchange for the services it transfers to its clients.\nRevenue from sale of our Nano Reactor® and LPN™ is recognized when products are shipped from our manufacturing facilities as this is our sole performance obligation under these contracts and we have no continuing obligation to the customer.\nThe Company also recognizes revenue from its share of gross profit to be earned from distributors, as defined, which we treat as variable consideration and recognize using the most likely amount method. Estimates are available from our distributor which are considered in the determination of the most likely amount. However, given the lack of control over the sale to the end customer and the lack of history of prior sales, the amount of gross profit revenue recognized is limited to the actual amount of cash received under the contract which the Company has determined is not refundable and that a significant future reversal of cumulative revenue under the contract will not occur.\nIn addition, the Company also recognizes revenues from usage fees of certain reactors. Usage fees are recognized based on actual usage by the customer.\nLeases\nThe Company accounts for leases under guidance of Accounting Standards Codification (ASC) 842, which requires an entity to recognize a right-of-use asset and a lease liability for virtually all leases. Leases with an initial term of 12 months or less are not recorded on the balance sheet. The Company accounts for the lease and non-lease components of its office lease as a single lease component. Lease expense is recognized on a straight-line basis over the lease term.\nEquity Method Investment\nThe Company accounts for investments in entities in which the Company has significant influence over the entitys financial and operating policies, but does not control, using the equity method of accounting. The equity method investments are initially recorded at cost, and subsequently increased for capital contributions and allocations of net income, and decreased for capital distributions and allocations of net loss. Equity in net income (loss) from the equity method investment is allocated based on the Companys economic interest. The Company assesses its investment in equity method investments for recoverability, and if it is determined that a loss in value of the investment is other than temporary, the Company writes down the investment to its fair value. The Company does not believe that the value of its equity method investment was impaired as of June 30, 2022.\nShare-Based Compensation\nThe Company periodically issues stock options and warrants to employees and non-employees in non-capital raising transactions for services and for financing costs. The Company accounts for stock option and warrant grants issued and vesting to employees based on the authoritative guidance provided by the Financial Accounting Standards Board whereas the value of the award is measured on the date of grant and recognized over the vesting period. The Company accounts for stock option and warrant grants issued and vesting to non- employees in accordance with the authoritative guidance of the Financial Accounting Standards Board whereas the value of the stock compensation is based upon the measurement date as determined at either a) the date at which a performance commitment is reached, or b) at the date at which the necessary performance to earn the equity instruments is complete. Non-employee stock-based compensation charges generally are amortized over the vesting period on a straight-line basis. In certain circumstances where there are no future performance requirements by the non-employee, option grants are immediately vested and the total stock-based compensation charge is recorded in the period of the measurement date.\nRecent Accounting Pronouncements\nSee Note 1 of the financial statements for discussion of recent accounting pronouncements.\nResults of Operations\nBelow is summary comparing fiscal 2022 and fiscal 2021.\nFor the Years Ended\nJune 30,\n$ Change % Change\nRevenue $ 1,619,000 $ 537,000 $ 1,082,000 201%\nRevenue-related party 46,000 21,000 25,000 119%\nCost of revenue (41,000 ) (20,000 ) (21,000 ) 105%\nGross profit 1,624,000 538,000 1,086,000 202%\nGeneral and administrative expenses 1,728,000 1,264,000 464,000 36%\nImpairment of equipment 178,000 - 178,000 100%\nResearch and development expenses 17,000 21,000 (4,000 ) (19)%\nTotal operating expenses 1,923,000 1,285,000 638,000 50%\nIncome (loss/) from operations (299,000 ) (747,000 ) 448,000 68%\nGain on forgiveness of PPP Loan 104,000 104,000 - -%\nLoss on settlement of liabilities (371,000 ) - (371,000 ) (100)%\nLoss from equity method investment (48,000 ) - 26,000 100%\nInterest expense (5,000 ) (6,000 ) 1,000 17%\nNet income (loss) $ (619,000 ) $ (649,000 ) $ 115,000 (18)%\nRevenue\nDuring the year ended June 30, 2022, revenue increased by $1,107,000 to $1,665,000 and it was derived primarily from the sales of our Nano Reactor® and CTi Nano Neutralization Systems to Desmet of $592,000 and share in gross profit of $1,027,000. In addition, the Company also recorded an aggregate revenue of $46,000 from the sale of LPN™ and water processing to Enviro Watertek, LLC.\nDuring the year ended June 30, 2021, our revenue was $558,000 and it was derived from the sale of our Nano Reactor® and CTi Nano Neutralization Systems to Desmet of $541,000, in addition, we recorded an aggregate revenue of $17,000 from the sale of LPN™ and water processing usage fee to Enviro Watertek, LLC.\nOperating Expenses\nOperating expenses for fiscal 2022 amounted to $1,923,000 versus $1,285,000 in fiscal 2021, an increase of $638,000 or 50%. The increase in operating expenses was attributed to an increase in advertising expenses of $95,000, an impairment charge of $178,000 on equipment, an increase in consulting fees of $99,000, an increase in legal fees of $54,000, non-cash stock based compensation expense of $352,000, with major expense categories being salaries and payroll taxes of approximately $744,000, legal and professional fees of approximately $198,000, marketing services of $107,000. Research and development (R&D) expense was $17,000 and $21,000 for the fiscal years ended June 30, 2022 and 2021.\nOperating expenses for fiscal 2021 amounted to $1,285,000 versus $1,487,000 in fiscal 2020, a decrease of $195,000 or 14%. The decrease in operating expenses was attributed to lower legal fees, office and stock compensation expense compared to fiscal 2020, and amendment of certain stock warrants issued in prior period. Non-cash expense items such as amortization and depreciation expense of $18,000, primarily amounted to a small proportion of operating expenses, with major expense categories being salaries and payroll taxes of approximately $629,000, legal and professional fees of approximately $126,000, for travel, insurance and marketing services combined $156,000. Research and development (R&D) expense was $21,000 compared to $18,000 the same as in the year ended June 30, 2020.\nNet Loss\nOur reporting net loss in fiscal 2022 was $619,000 compared to $649,000 in fiscal 2021.\nLiquidity and Capital Resources\nOur cash balance at June 30, 2022 was $441,000, a decrease of $922,000 compared to $1,363,000 at June 30, 2021.\nFor the year ended June 30, 2022 cash used in operating activities was $484,000, cash used in investing activities was $1,223,000, and cash generated from financing activities was $785,000.\nFor the year ended June 30, 2021 cash provided by operating activities was $250,000, cash used in investing activities was $128,000, and cash provided by financing activities was $982,000.\nGoing concern\nDuring the year ended June 30, 2022, we incurred a net loss of $619,000 and used cash in operating activities of $484,000. These factors, among others, raise substantial doubt about our ability to continue as a going concern within one year of the date that the financial statements are issued. In addition, the Companys independent registered public accounting firm, in its report on our June 30, 2022 financial statements, has raised substantial doubt about the Companys ability to continue as a going concern. The Companys financial statements do not include any adjustments that might result from the outcome of this uncertainty be necessary should we be unable to continue as a going concern.\nManagements plan is to generate income from operations by continuing to license its technology globally. Additionally, we anticipate generating revenues from our agreements with EW and ABI.\nWe may also attempt to raise additional debt and/or equity financing to fund operations and to provide additional working capital. There is no assurance that such financing will be available in the future or obtained in sufficient amounts necessary to meet our needs, that we will be able to achieve profitable operations or that we will be able to meet our future contractual obligations. Should management fail to obtain such financing, we may curtail its operations.\nOff-balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on its financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources. ITEM 7A. Quantitative and Qualitative Disclosures about Market Risk.\nNot applicable for Smaller Reporting Companies. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors\nCavitation Technologies, Inc.\nLos Angeles, CA\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Cavitation Technologies, Inc. (the Company) as of June 30, 2022 and 2021, the related consolidated statements of operations, changes in stockholders equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of their operations and their cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1, the Company has incurred recurring operating losses and used cash in operations since inception. These matters raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1 to the financial statements. These consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved especially challenging, subjective, or complex judgments. The communication of the critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinion on the critical audit matters or on the accounts or disclosures to which they relates.\nEstimation of variable consideration\nAs described in Notes 1 and 2 to the consolidated financial statements, the Company receives a share of the gross profit earned by one of its distributors upon such distributors sale of products which include the Company's Nano Reactor® and CTi Nano Neutralization® System products. The Company's performance obligation related to the sale of its products is completed upon the shipment of the products to the distributor. Accordingly, at such time, the expected future share of gross profit to be earned from distributors is treated as variable consideration and recognized as revenue using the most likely amount method, subject to variable consideration constraints.\nWe identified managements estimation and valuation of variable consideration as a critical audit matter because of the significant judgement by management in estimating the Companys share of gross profit to be earned from distributors and the high degree of auditor judgment, subjectivity, and effort in performing audit procedures and evaluating the reasonableness of the significant assumptions used in developing the estimate.\nOur primary audit procedures related to the estimation of variable consideration included the following, among others:\n· We evaluated the appropriateness of the Companys revenue recognition policy, including its compliance with applicable accounting standards.\n· We tested the completeness, accuracy, and relevance of the underlying data used in managements estimates by testing recorded revenues to supporting documents.\n· We evaluated the reasonableness of management's estimate of variable consideration in accordance with their accounting policies based on contractual terms and historical data and variable consideration estimates, including potential variable consideration constraints.\n· We confirmed the Companys share of gross profit with the distributor.\nAccounting for Equity Method Investment\nAs described in Note 3 to the consolidated financial statements, in 2019, the Company and Delaware Water Company (Delaware) formed a limited liability company called Enviro WaterTek (Enviro) owned 50% by the Company and 50% by Delaware. In September 2021, the Company and Delaware entered into a separate agreement under Enviro for a specific project (referred to as Ameredev). Under the separate agreement, the Company contributed $1.2 million, and receives usage fees from Ameredev, as defined, with the balance of net income (loss) from Ameredev allocated 70% to Delaware and 30% to the Company. The Company accounts for its investment in Enviro Ameredev using the equity method of accounting based on its determination that it does not hold an absolute controlling financial interest but has the ability to exercise significant influence over the operating and financial policies of Enviro Ameredev.\nWe identified the accounting for the equity method investment as a critical audit matter because of the significance of the equity method investment to the Companys financial statements, and the judgments made by management when assessing the results of the operations of the equity method investment. This required an increased extent of effort, and the high degree of auditor judgment, subjectivity, and effort in performing audit procedures and evaluating the reasonableness of managements assumptions used for recording the equity method investment.\nOur primary audit procedures related to the accounting for equity method investment included the following, among others:\n· We obtained and read the executed Enviro Ameredev agreements to evaluate the accuracy and completeness of the terms used in managements assessment that the Company does not control but has significant influence over Enviro Ameredev.\n· We evaluated the equity method investment and income from equity method investment by testing transactions related to the equity method investment, such as contributions, distributions, and the allocation of net income (loss).\nWe have served as the Companys auditor since 2013.\n/s/ Weinberg & Company, P.A.\nLos Angeles, California\nOctober 13, 2022\nCAVITATION TECHNOLOGIES, INC.\nCONSOLIDATED BALANCE SHEETS\nJune 30,2022 June 30, 2021\nASSETS\nCurrent assets:\nCash and cash equivalents $ 441,000 $ 1,363,000\nAccounts receivable 1,000 6,000\nInventory 48,000 25,000\nPrepaid expenses 38,000 -\nTotal current assets 528,000 1,394,000\nProperty and equipment, net 4,000 182,000\nEquity method investment 1,149,000 -\nOperating lease right-of-use asset 180,000 245,000\nOther assets 10,000 10,000\nTotal assets $ 1,871,000 $ 1,831,000\nLIABILITIES AND STOCKHOLDERS' EQUITY (DEFICIT)\nCurrent liabilities:\nAccounts payable and accrued expenses $ 135,000 $ 342,000\nAccrued payroll and payroll taxes - related parties 280,000 667,000\nRelated party payable - 1,000\nCustomer advances 80,000 727,000\nOperating lease liability, current portion 63,000 58,000\nTotal current liabilities 558,000 1,795,000\nNotes payable, non-current 150,000 254,000\nOperating lease liability, non-current portion 127,000 193,000\nTotal liabilities 835,000 2,242,000\nCommitments and contingencies - -\nStockholders' equity (deficit):\nPreferred stock, $0.001 par value, 10,000,000 shares authorized, no shares issued and outstanding as of June 30, 2022 and 2021, respectively - -\nCommon stock, $0.001 par value, 1,000,000,000 shares authorized, 276,698,831 and 208,267,444 shares issued and outstanding as June 30, 2022 and 2021, respectively 277,000 208,000\nAdditional paid-in capital 26,005,000 24,008,000\nAccumulated deficit (25,246,000 ) (24,627,000 )\nTotal stockholders' equity (deficit) 1,036,000 (411,000 )\nTotal liabilities and stockholders' equity (deficit) $ 1,871,000 $ 1,831,000\nSee accompanying notes to the consolidated financial statements\nCAVITATION TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended\nJune 30,\nRevenue $ 1,619,000 $ 537,000\nRevenue - related party 46,000 21,000\nCost of revenue (41,000 ) (20,000 )\nGross profit 1,624,000 538,000\nGeneral and administrative expenses 1,728,000 1,264,000\nImpairment of equipment 178,000 -\nResearch and development expenses 17,000 21,000\nTotal operating expenses 1,923,000 1,285,000\nLoss from operations (299,000 ) (747,000 )\nOther Income (Expense)\nGain on forgiveness of PPP Loan 104,000 104,000\nLoss on settlement of liabilities (371,000 ) -\nLoss from equity method investment (48,000 ) -\nInterest expense (5,000 ) (6,000 )\nOther, net (320,000 ) 98,000\nNet loss $ (619,000 ) $ (649,000 )\nNet loss per share,\nBasic and diluted $ (0.00 ) $ (0.00 )\nWeighted average shares outstanding,\nBasic and diluted 248,736,262 197,224,988\nSee accompanying notes to the consolidated financial statements\nCAVITATION TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY (DEFICIT)\nYEARS ENDED JUNE 30, 2022 AND 2021\nCommon\nStock Additional\nPaid-in Accumulated\nShares Amount Capital Deficit Total\nBalance at June 30, 2020 196,997,906 $ 197,000 $ 23,291,000 $ (23,978,000 ) $ (490,000 )\nCommon stock issued for cash 11,269,538 11,000 717,000 - 728,000\nNet loss - - - (649,000 ) (649,000 )\nBalance at June 30, 2021 208,267,444 208,000 24,008,000 (24,627,000 ) (411,000 )\nCommon stock issued for cash 12,071,785 12,000 773,000 - 785,000\nCashless exercise of warrants 33,715,228 34,000 (34,000 ) - -\nCashless exercise of options 6,181,818 6,000 (6,000 ) - -\nFair value of warrants granted for services - - 40,000 - 40,000\nFair value of common stock issued upon exercise of warrants and options 778,609 1,000 86,000\n87,000\nFair value of common stock issued for services 4,500,000 5,000 220,000 - 225,000\nFair value of common stock issued to settle liabilities 11,183,947 11,000 918,000 - 929,000\nNet loss - - - (619,000 ) (619,000 )\nBalance at June 30, 2022 276,698,831 $ 277,000 $ 26,005,000 $ (25,246,000 ) $ 1,036,000\nSee accompanying notes to the consolidated financial statements\nCAVITATION TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears Ended June 30,\nOperating activities:\nNet loss $ (619,000 ) $ (649,000 )\nAdjustments to reconcile net loss to net cash provided by (used in) operating activities:\nDepreciation and amortization - 22,000\nFair value of common stock issued upon exercise of warrants and options 87,000 -\nFair value of warrants granted for services 40,000 -\nFair value of common stock issued for services 225,000 -\nGain on forgiveness of PPP note payable (104,000 ) (104,000 )\nLoss on settlement of liabilities 371,000 -\nImpairment of equipment 178,000 -\nLoss from equity method investment 48,000 -\nDistribution from equity method investment 26,000 -\nEffect of changes in: - -\nAccounts receivable 5,000 98,000\nInventory (23,000 ) 22,000\nPrepaid expenses (38,000 ) -\nOperating lease right-of-use assets 65,000 63,000\nAccounts payable and accrued expenses (3,000 ) 26,000\nAccrued payroll and payroll taxes - related parties (33,000 ) (26,000 )\nRelated party payable (1,000 ) -\nCustomer advances (647,000 ) 359,000\nOperating lease liabilities (61,000 ) (61,000 )\nNet cash used in operating activities (484,000 ) (250,000 )\nInvesting activities:\nCapital contribution to equity investment (1,223,000 ) -\nPurchase of property and equipment - (128,000 )\nCash used in investing activities (1,223,000 ) (128,000 )\nFinancing activities:\nProceeds from notes payable - 254,000\nProceeds from sale of common stock 785,000 728,000\nCash generated from financing activities 785,000 982,000\nNet increase in cash and cash equivalents (922,000 ) 604,000\nCash and cash equivalents, beginning of period 1,363,000 759,000\nCash and cash equivalents, end of period $ 441,000 $ 1,363,000\nSupplemental disclosures of cash flow information:\nCash paid for interest $ - $ -\nCash paid for income taxes $ - $ -\nSupplemental disclosures of cash flow information:\nLiabilities settled with common stock $ 558,000 $ -\nSee accompanying notes to the consolidated financial statements\nCAVITATION TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nYEARS ENDED JUNE 30, 2022 AND 2021\nNote 1 - Organization and Summary of Significant Accounting Policies\nCavitation Technologies, Inc. (the Company, CTi, we, us, and our) is a Nevada corporation originally incorporated in January 2007 under the name Bio Energy, Inc. The Company has developed, patented, and commercialized proprietary technology used in our Nano Reactor® and LPN™ liquid processing applications.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities and commitments in the normal course of business. As reflected in accompanying consolidated financial statements, during the year ended June 30, 2022, the Company incurred a net loss of $619,000 and used cash in operating activities of $484,000. These factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. The accompanying consolidated financial statements do not include any adjustments that may result from an inability of the Company to continue as a going concern.\nAs of June 30, 2022, the Company has cash in the amount of $441,000. The Companys ability to continue as a going concern is dependent upon its ability to continue to implement its business plan. Currently, managements plan is to increase revenues by continuing to license its technology globally. While the Company believes in the viability of its strategy to increase revenues, there can be no assurances to that effect.\nThe Company may also attempt to raise additional debt and/or equity financing to fund operations and to provide additional working capital. There is no assurance that such financing will be available in the future or obtained in sufficient amounts necessary to meet the Companys needs, that the Company will be able to achieve profitable operations or that the Company will be able to meet its future contractual obligations. Should management fail to obtain such financing, the Company may curtail its operations.\nCovid-19\nDuring the year ended June 30, 2022, the COVID-19 pandemic did not have a material net impact on our operating results. The Company has not observed any impairments of its assets or a significant change in the fair value of its assets due to the COVID-19 pandemic. At this time, it is not possible for the Company to predict the duration or magnitude of the adverse results of the outbreak and its effects on the Companys business or results of operations, financial condition, or liquidity.\nAs of June 30, 2022, the Company has been following the recommendations of local health authorities to minimize exposure risk for its employees, including having employees work remotely and utilizing electronic submission of invoices and payments.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of Cavitation Technologies, Inc. and its wholly owned subsidiary Hydrodynamic Technology, Inc. Intercompany transactions and balances have been eliminated in consolidation.\nUse of Estimates\nThe preparation of the consolidated financial statements in conformity with accounting principles generally accepted in the U.S requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the financial statement date, and reported amounts of revenue and expenses during the reporting period. Significant estimates include estimates for reserves for inventory obsolescence, valuation of our equity method investments, assumptions used in valuing our stock options, stock warrants and common stock issued for services and valuation allowance for our deferred tax asset, among other items. Actual results could differ from these estimates.\nRevenue Recognition\nThe Company follows the guidance of Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers (ASC 606). ASC 606 creates a five-step model that requires entities to exercise judgment when considering the terms of contracts, which includes (1) identifying the contracts or agreements with a customer, (2) identifying our performance obligations in the contract or agreement, (3) determining the transaction price, (4) allocating the transaction price to the separate performance obligations, and (5) recognizing revenue as each performance obligation is satisfied. The Company only applies the five-step model to contracts when it is probable that the Company will collect the consideration it is entitled to in exchange for the services it transfers to its clients. Revenue from sale of our Nano Reactors is recognized when products are shipped from our manufacturing facilities as this is our sole performance obligation under these contracts and we have no continuing obligation to the customer. The Company also recognizes revenue from its share of gross profit to be earned from distributors, as defined, which we treat as variable consideration and recognize using the most likely amount method. Estimates are available from our distributor which are considered in the determination of the most likely amount. However, given the lack of control over the sale to the end customer and the lack of history of prior sales, the amount of gross profit revenue recognized is limited to the actual amount of cash received under the contract which the Company has determined is not refundable and that a significant future reversal of cumulative revenue under the contract will not occur. In addition, the Company also recognizes revenues from usage fees of certain reactors. Usage fees are recognized based on actual usage by the customer.\nCash and Cash Equivalents\nThe Company considers highly liquid investments with original maturities of three months or less to be cash equivalents. At June 30, 2022 and 2021, the Company had no cash equivalents.\nThe Company maintains its cash with one domestic financial institution. From time to time, cash balances in this domestic bank may exceed federally insured limits provided by the Federal Deposit Insurance Corporation (FDIC) of up to $250,000.\nAs of June 30, 2022, and 2021, Company had deposits in excess of federally insured limit with one bank. The Company believes that no significant concentration of credit risk exists with respect to this cash balances because of its assessment of the creditworthiness and financial viability of this financial institution.\nAccounts Receivable\nAccounts receivable are generally recorded at the invoiced amounts net of an allowance for expected losses. The Company evaluates the collectability of our trade accounts receivable based on a number of factors. In circumstances where it becomes aware of a specific customers inability to meet its financial obligations to us, a specific reserve for bad debts is estimated and recorded which reduces the recognized receivable to the estimated amount that management believes will ultimately be collected. In addition to specific customer identification of potential bad debts, bad debt charges are recorded based on our historical losses and an overall assessment of past due trade accounts receivable outstanding. At June 30, 2022 and 2021, the Company had no reserve recorded for uncollectible accounts receivable.\nInventory\nInventory is stated at the lower of cost or net realizable value. Cost is determined on a specific item basis. Inventory is composed of finished goods and represents costs incurred to manufacture the Companys Nano Reactor® systems and LPN™.\nProperty and Equipment\nProperty and equipment is stated at cost. Depreciation is provided using the straight-line method over the estimated useful lives of the assets. Betterments, renewals, and extraordinary repairs that extend the life of the assets are capitalized; other repairs and maintenance charges are expensed as incurred. The cost and related accumulated depreciation applicable to retired assets are removed from the Companys accounts, and the gain or loss on dispositions, if any, is recognized in the consolidated statements of operations.\nProperty and equipment are recorded at cost and depreciated using the straight-line method over the following estimated useful lives.\nProperty and equipment useful life\nLeasehold improvements\nShorter of the life of the asset or lease term\nFurniture\n5-7 Years\nOffice equipment\n5 Years\nLab equipment\n4 Years\nSkid systems\n4 Years\nManagement assesses the carrying value of property and equipment whenever events or changes in circumstances indicate that the carrying value may not be recoverable. If there is indication of impairment, management prepares an estimate of future cash flows expected to result from the use of the asset and its eventual disposition. If these cash flows are less than the carrying amount of the asset, an impairment loss is recognized to write down the asset to its estimated fair value.\nEquity Method Investment\nThe Company accounts for investments in entities in which the Company has significant influence over the entitys financial and operating policies, but does not control, using the equity method of accounting. The equity method investments are initially recorded at cost, and subsequently increased for capital contributions and allocations of net income, and decreased for capital distributions and allocations of net loss. Equity in net income (loss) from the equity method investment is allocated based on the Companys economic interest. Equity method investments are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. If it is determined that a loss in value of the equity method investment is other than temporary, an impairment loss is measured based on the excess of the carrying amount of an investment over its estimated fair value. Impairment analyses are based on current plans, intended holding periods, and available information at the time the analysis is prepared. The Company does not believe that the value of its equity method investment was impaired as of June 30, 2022.\nIncome Taxes\nThe Company follows the asset and liability method of accounting for income taxes. The Company recognizes deferred tax assets and liabilities to reflect the estimated future tax effects, calculated at anticipated future tax rates, of future deductible or taxable amounts attributable to events that have been recognized on a cumulative basis in the financial statements. A valuation allowance related to a deferred tax asset is recorded when it is more likely than not that some portion of the deferred tax asset will not be realized. Deferred tax assets and liabilities are adjusted for the effects of the changes in tax laws and rates of the date of enactment.\nLeases\nThe Company accounts for its leases in accordance with the guidance of FASB ASC 842, Leases. The Company determines whether a contract is, or contains, a lease at inception. Right-of-use assets represent the Companys right to use an underlying asset during the lease term, and lease liabilities represent the Companys obligation to make lease payments arising from the lease. Right-of-use assets and lease liabilities are recognized at lease commencement based upon the estimated present value of unpaid lease payments over the lease term. The Company uses its incremental borrowing rate based on the information available at lease commencement in determining the present value of unpaid lease payments (see Note 3).\nFair Value Measurement\nFASB ASC 820-10 requires entities to disclose the fair value of financial instruments, both assets and liabilities recognized and not recognized on the balance sheet for which it is practicable to estimate fair value. ASC 820-10 defines the fair value of a financial instrument as the amount at which the instrument could be exchanged in a current transaction between willing parties.\nIn addition to defining fair value, the standard expands the disclosure requirements around fair value and establishes a fair value hierarchy for valuation inputs. The hierarchy prioritizes the inputs into three levels based on the extent to which inputs used in measuring fair value are observable in the market. Each fair value measurement is reported in one of the three levels which are determined by the lowest level input that is significant to the fair value measurement in its entirety. These levels are:\nLevel 1 - inputs are based upon unadjusted quoted prices for identical instruments traded in active markets.\nLevel 2 - inputs are based upon significant observable inputs other than quoted prices included in Level 1, such as quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant assumptions are observable in the market or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - inputs are generally unobservable and typically reflect managements estimates of assumptions that market participants would use in pricing the asset or liability. The fair values are therefore determined using model-based techniques that include option pricing models, discounted cash flow models, and similar techniques.\nAs of June 30, 2022, and 2021, the carrying value of certain accounts such as accounts receivable, inventory, accounts payable, accrued expenses and accrued payroll approximates their fair value due to the short-term nature of such instruments.\nShare-Based Compensation\nWe periodically issue stock options, warrants and common stock to employees and non-employees for services and capital raising transactions. We account for share-based payments under the guidance of FASB ASC 718, which requires the measurement and recognition of compensation expense for all share-based payment awards made to employees, officers, directors, and consultants, including employee stock options, based on estimated fair values. We estimate the fair value of stock option and warrant awards to employees and directors on the date of grant using an option-pricing model, and the value of the portion of the award that is ultimately expected to vest is recognized as expense over the required service period in our Statements of Operations. We estimate the fair value of restricted stock awards to employees and directors using the market price of our common stock on the date of grant, and the value of the portion of the award that is ultimately expected to vest is recognized as expense over the required service period in our Statements of Operations. Recognition of compensation expense for non-employees is in the same period and manner as if the Company had paid cash for the services.\nUnder ASC 718, the amount of cash or other assets transferred (or liabilities incurred) to repurchase an equity award shall be charged to equity, to the extent that the amount paid does not exceed the fair value of the equity instruments repurchased at the repurchase date. Any excess of the repurchase price over the fair value of the instruments repurchased shall be recognized as additional compensation cost.\nAdvertising Costs\nAdvertising costs, including marketing expense, incurred in the normal course of operations are expensed as incurred. Advertising expenses amounted to $106,000 and $12,000 for the years ended June 30, 2022 and 2021 respectively and was reported as part of General and administrative expenses in the accompanying Consolidated Statements of Operations.\nResearch and Development Costs\nResearch and development expenses relate primarily to the development, design, testing of preproduction prototypes and models, compensation, and consulting fees, and are expensed as incurred. Total research and development costs recorded during the years ended June 30, 2022 and 2021 amounted to $17,000 and $21,000, respectively.\nWarranty Policy\nThe Company provides a limited warranty with every set of reactors sold, typically 2 to 5 years. The Company has not experienced significant claims under its warranty policy, and management determined no accrual for warranty reserve was necessary at June 30, 2022 and 2021.\nNet (Loss) Per Share\nThe Companys computation of loss per share (EPS) includes basic and diluted EPS. Basic EPS is measured as the income available to common stockholders divided by the weighted average common shares outstanding for the period. Diluted income per share reflects the potential dilution, using the treasury stock method, that could occur if securities or other contracts to issue common stock were exercised or converted into common stock or resulted in the issuance of common stock that then shared in the income of the Company as if they had been converted at the beginning of the periods presented, or issuance date, if later. In computing diluted income per share, the treasury stock method assumes that outstanding options and warrants were exercised and the proceeds are used to purchase common stock at the average market price during the period. Options and warrants may have a dilutive effect under the treasury stock method only when the average market price of the common stock during the period exceeds the exercise price of the options and warrants. Potential common shares that have an anti-dilutive effect (i.e., those that increase income per share or decrease loss per share) are excluded from the calculation of diluted EPS.\nThe following table sets forth the computation of basic and diluted loss per common share.\nBasic and diluted loss per common share\nJune 30,\nNet loss $ (619,000 ) $ (649,000 )\nWeighted average common shares - basic 248,736,262 197,224,988\nDilutive effect of outstanding stock options and warrants - -\nWeighted average shares - diluted 248,736,262 197,224,988\nNet loss per common share:\nBasic and Diluted $ (0.00 ) $ (0.00 )\nThere were no adjustments to net income (loss) required for purposes of computing diluted earnings per share. At June 30, 2022 and 2021, the Company excluded the outstanding securities summarized below, which entitle the holders thereof to acquire shares of common stock, from its calculation of its diluted earnings per share, as their effect would have been anti-dilutive.\nSchedule of antidilutive shares\nJune 30, 2022 June 30, 2021\nOptions 1,250,000 11,000,000\nWarrants 61,427,834 98,966,049\nConcentrations\nDuring the year ended June 30, 2022, we recorded 97% of our revenue from Desmet Ballestra (Desmet) and 3% from Enviro Watertek, LLC (EW) (see Note 2).\nDuring the year ended June 30, 2021, we recorded 96% of our revenue from Desmet and 3% from EW (see Note 2).\nAt June 30, 2022 and 2021, 100% of accounts receivable were due from EW.\nSegment\nAs of June 30, 2022, the Company operated one reportable business segment. In accordance with the Segment Reporting Topic of the ASC, the Companys chief operating decision maker has been identified as the Chief Executive Officer, who reviews operating results to make decisions about allocating resources and assessing performance for the entire Company. Existing guidance, which is based on a management approach to segment reporting, establishes requirements to report selected segment information quarterly and to report annually entity-wide disclosures about products and services, major customers, and the countries in which the entity holds material assets and reports revenue. All material operating units qualify for aggregation under Segment Reporting due to their similar customer base and similarities in: economic characteristics; nature of products and services; and procurement, manufacturing and distribution processes. Since the Company operates in one segment, all financial information required by Segment Reporting can be found in the accompanying consolidated financial statements.\nRecent Accounting Pronouncements\nIn June 2016, the Financial Accounting Standards Board (the \"FASB\") issued ASU No. 2016-13, Credit Losses - Measurement of Credit Losses on Financial Instruments (ASU 2016-13). ASU 2016-13 requires entities to use a forward-looking approach based on current expected credit losses (CECL) to estimate credit losses on certain types of financial instruments, including trade receivables. This may result in the earlier recognition of allowances for losses. ASU 2016-13 is effective for the Company beginning July 1, 2023, and early adoption is permitted. The Company does not believe the potential impact of the new guidance and related codification improvements will be material to its financial position, results of operations and cash flows.\nOther recent accounting pronouncements issued by the FASB, including its Emerging Issues Task Force, the American Institute of Certified Public Accountants, and the Securities and Exchange Commission did not or are not believed by management to have a material impact on the Companys present or future consolidated financial statements.\nNote 2 - Contracts with Desmet Ballestra\nThe Company has the following agreements with Desmet Ballestra (Desmet), a company located in Europe:\na. October 2021 Agreement - In October 2021, the Company executed a three-year agreement with Desmet that is a continuation of the October 2018 agreement (See B below). In accordance with ASC 606, the Company recognizes revenue from the sale of reactors at the time of shipment of the Nano reactor hardware as shipment is deemed to be the Companys only performance obligation and the Company had no more continuing obligation other than the reactors two-year standard warranty. Desmet pays for such reactors on credit terms and the amount of a sale is recorded as a receivable upon acceptance by Desmet. In addition, Desmet agreed to provide the Company monthly advances of $40,000 through October 1, 2024 to be applied against future sales of reactors.\nb. October 2018 Agreement (expired in October 2021, see A above) - In October 2018, the Company signed a three-year global Research and Development (R&D), Marketing and Technology License Agreement with Desmet for the sale and licensing of the Companys reactors. This agreement was a continuation of an original agreement the Company signed with Desmet in fiscal 2012 and amended in fiscal 2016.\nAs part of the October 2018 agreement, Desmet provided the Company monthly advances of $50,000 through October 1, 2021, to be applied against the Companys gross profit share from future sales. In accordance with ASC 606, the Company determined that the gross profit to be earned from Desmet was a variable consideration and evaluated the amount of the potential payments and the likelihood that the payments would be received using the most likely amount approach (subject to the variable consideration constraint). Estimates were available from our distributor which were considered in the determination of the most likely amount. However, given the lack of control over the sale to the end customer and the lack of history of prior sales, the Company considered these as variable revenue constraints, and as such, the amount of gross profit share revenue recognized was limited to the actual amount of cash received under the contract which the Company had determined was not refundable and probable that a significant revenue reversal would not occur. Further, the Company had not been able to develop an expectation of the actual collection based on its historical experience. The Company also had no control with regards to the sale and installation of Nano Reactor® and CTi Nano Neutralization® System, between Desmet and the end customer. Under the October 2021 agreement (See A above), the Company is no longer entitled to revenue from a share of gross profit to be earned from distributors.\nDuring the year ended June 30, 2022, the Company recorded sales of $592,000 from Nano Reactor® sales from Desmet, and $1,027,000 from gross profit share for a total revenue of $1,619,000 from Desmet.\nDuring the year ended June 30, 2021, the Company recorded sales of $346,000 from Nano Reactor® sales and $191,000 from gross profit share for a total revenue of $537,000 from Desmet.\nAs of June 30, 2022, advances received from Desmet related to future sales of reactors amounted to $80,000. At June 30, 2022, there were no advances received from Desmet related to the Companys future gross profit share. At June 30, 2021, advances received from Desmet related to the Companys future gross profit share amounted to $727,000.\nNote 3 - Investment in equity method investment\nIn 2019, the Company and Delaware Water Company, LLC (Delaware) formed a limited liability company called Enviro WaterTek LLC (Enviro). Enviro is owned 50% by the Company and 50% by Delaware, and the Company accounts for its investment in Enviro under the equity method. From 2019 to 2021, Enviro had no operations.\nIn September 2021, the Company and Delaware entered into a separate agreement under Enviro for a specific project (referred to as Ameredev). Delaware has certain contracts in place to provide recycled water to operators of certain active oil and gas wells. Under the agreement, the Company contributed $1.2 million that was used by Ameredev to increase the capacity of certain pipelines and water treatment facilities operated by Delaware. Pursuant to the agreement, for each barrel of recycled water that Ameredev sells, Delaware will receive $0.10 per barrel, and the Company will receive $0.05 per barrel (referred to as usage fees), with the balance of net income (loss) from Ameredev being allocated 70% to Delaware and 30% to the Company. The Ameredev agreement will terminate the earlier of three years (unless extended by unanimous agreement of the Board and Members of Ameredev) from the date of the agreement or by unanimous agreement of the Board and Members of Ameredev.\nDuring the year ended June 30, 2022, the Company recorded total revenues from Ameredev of $46,000, made up of $32,000 from the sale of reactors, and $13,000 from usage fees. During the year ended June 30, 2022, the Company recognized a loss of $48,000 related to the equity method investment.\nDuring the year ended June 30, 2021, the Company recorded revenues of $21,000 from the usage fee. During the year ended June 30, 2021, there was no income or loss recognized for the equity method investment.\nThe following table summarizes the activity of the Companys equity method investment:\nSchedule of equity method investment\nJune 30, 2022\nBalance at beginning of period $ -\nContributions to equity method investment 1,223,000\nLoss from equity method investment (48,000 )\nDistribution from equity method investment (26,000 )\nBalance at end of period $ 1,149,000\nA summarized balance sheet as of June 30, 2022, for Ameredev, and a summarized statement of operations for the year ended June 30, 2022, for Ameredev is presented below:\nBalance Sheet:\nStatement of operations for Ameredev\nAmount\nCash $ 11,000\nProperty and equipment $ 1,223,000\nTotal assets $ 1,234,000\nAccounts payable $ 43,000\nPartners equity $ 1,191,000\nTotal liabilities and equity $ 1,234,000\nIncome Statement:\nAmount\nRevenue $ 165,000\nUsage fees paid to Cavitation and Delaware (41,000 )\nOperating expenses (282,000 )\nNet loss $ (158,000 )\nNote 4 - Operating Lease\nThe Company leases certain warehouse and corporate office space under an operating lease agreement. We determine if an arrangement is a lease at inception. Lease assets are presented as operating lease right-of-use assets and the related liabilities are presented as lease liabilities in our consolidated balance sheets.\nOperating lease right-of-use (ROU) assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. ROU assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Generally, the implicit rate of interest in lease arrangements is not readily determinable and the Company utilizes its incremental borrowing rate in determining the present value of lease payments. The Companys incremental borrowing rate is a hypothetical rate based on its understanding of what its credit rating would be. The operating lease ROU asset includes any lease payments made and excludes lease incentives.\nThe components of lease expense and supplemental cash flow information related to leases for the period are as follows:\nLease cost table\nJune 30, June 30,\nLease costs:\nOperating lease (included in general and administrative in the Companys consolidated statement of operations) $ 78,000 $ 74,000\nOther information:\nCash paid for amounts included in the measurement of lease liabilities $ 72,000 $ 71,000\nWeighted average remaining lease term - operating leases (in years) 2.6 3.6\nAverage discount rate - operating leases 4% 4%\nThe supplemental balance sheet information related to leases for the period is as follows:\nLong-term right-of-use assets $ 180,000 $ 245,000\nShort-term operating lease liabilities $ 63,000 $ 58,000\nLong-term operating lease liabilities 127,000 193,000\nTotal operating lease liabilities $ 190,000 $ 251,000\nSupplemental cash flow information related to the lease liabilities are as follows:\nSchedule of lease liability maturities\nOperating\nYear Ending June 30: Lease\n$ 75,000\n78,000\n47,000\nTotal lease payments 200,000\nLess: Imputed interest/present value (10,000 )\nPresent value of lease liabilities $ 190,000\nNote 5 - Property and Equipment\nProperty and equipment consist of the following as of June 30, 2022 and 2021:\nSchedule Property and Equipment\nJune 30, June 30,\nLeasehold improvement $ 2,000 $ 2,000\nFurniture 27,000 27,000\nOffice equipment 2,000 2,000\nEquipment 306,000 484,000\nSystems 187,000 187,000\n524,000 702,000\nLess: accumulated depreciation and amortization (520,000 ) (520,000 )\nProperty and equipment, net $ 4,000 $ 182,000\nDepreciation expense for the years ended June 30, 2022 and 2021 amounted to $0 and $22,000, respectively and was recorded as part of General and Administrative expenses in the accompanying Consolidated Statements of Operations.\nIn June 2022, the Company determined to cease further development and construction of certain testing equipment and a result, the Company write-down certain capitalized equipment costs of $178,000 that we considered abandoned. For the year ended June 30, 2021, the Company did not recognize any impairment for its property and equipment.\nNote 6 - Related Party Transactions\nAt June 30, 2021, accrued salaries and estimated payroll taxes due to current and former officers of the Company totaled $667,000. During the year ended June 30, 2022, the Company paid $27,000 of accrued payroll expenses, reduced estimated payroll taxes by $44,000, and transferred $316,000 to an unrelated party, which was subsequently settled through the issuance of 6,855,700 shares of common stock (see Note 8). As of June 30, 2022, outstanding balance of accrued payroll and payroll taxes-related parties totaled $280,000.\nNote 7 - Notes Payable\nSchedule of notes payable\nJune 30, June 30,\nA. Note Payable - PPP#1 $ - $ -\nB. Note Payable - PPP#2 - 104,000\nC. Note Payable - EIDL 150,000 150,000\nTotal $ 150,000 $ 254,000\nA. On April 16, 2020, the Company was granted a loan for $104,000 (PPP #1) pursuant to the Paycheck Protection Program (PPP) under the Coronavirus Aid, Relief and Economic Security Act (the Cares Act). PPP #1 loan was scheduled to mature in April 2022 had a 1% per annum interest rate, and was subject to the terms and conditions applicable to loans administered by the Small Business Administration (SBA) under the CARES Act. The Company applied ASC 470, Debt, to account for PPP #1 loan. In May, 2021, the SBA approved the forgiveness of PPP #1 loan of $104,000, and we recognized a gain on extinguishment of PPP #1 loan of $104,000 during the year ended June 30, 2021.\nB. On March 26, 2021, the Company was granted a of $104,000 (PPP #2) pursuant to the PPP that was scheduled to mature in March 2026. PPP #2 loan had an interest rate of 1% per annum, was unsecured, and guaranteed by the Small Business Administration (the SBA). In July 2021, the SBA approved the forgiveness of PPP #2 loan of $104,000, and we recognized a gain on extinguishment of PPP #2 loan of $104,000 during the year ended June 30, 2022.\nC. In July 2020, the Company received a loan of $150,000 from the SBA under its Economic Injury Disaster Loan (EIDL) assistance program. The EIDL loan is payable over 30 years, bears interest at a rate of 3.75% per annum and secured by all tangible and intangible property of the Company. The Company was in compliance with the terms of the EIDL loan as of June 30, 2021. As of June 30, 2022 and 2021, the outstanding balance of the note payable was $150,000, respectively.\nNote 8 - Stockholders Deficit\nPreferred Stock\nOn March 17, 2009, the Company filed an Amended and Restated Articles of Incorporation and created two new series of preferred stock, the first of which is designated Series A Preferred Stock and the second of which is designated as Series B Preferred Stock. The total number of shares of Common Stock which this corporation has authority to issue is 1,000,000,000 shares of Common Stock and 10,000,000 shares of Preferred Stock of which 5,000,000 shares are designated as Series A Preferred Stock, and 5,000,000 shares are designated as Series B Preferred Stock, with the rights, preferences and privileges of the Series B Preferred Stock to be designated by the Board of Directors. Each share of Common Stock and Preferred Stock has a par value of $0.001. As of June 30, 2022, and 2021, there are no shares of Series A or Series B Preferred Stock issued and outstanding.\nCommon Stock\nYear Ending June 30, 2022\nDuring the year ended June 30, 2022, the Company issued 12,071,785 shares of common stock and 12,071,785 fully vested warrant to purchase common stock over a period of 5 years with an exercise price of $0.09 per share in exchange for net cash proceeds of $785,000.\nDuring the year ended June 30, 2022, the Company issued 34,407,709 shares of common stock to warrant holders who exercised their 50,110,000 warrants on a cashless basis.\nDuring the year ended June 30, 2022, the Company issued 6,267,946 shares of common stock to option holders who exercised their 8,500,000 options on a cashless basis.\nThe Company issued an additional 778,609 with a fair value of $87,000 to the warrant and option holders who exercised their cashless exercise options above. These shares of common stock were valued based on the closing price of the Companys common stock on the date the shares were issued.\nDuring the year ended June 30, 2022, the Company issued 500,000 shares of common stock valued at $25,000 for services rendered. These shares of common stock were valued based on the closing price of the Companys common stock on the date the Company entered into the agreement related to the issuance.\nOn June 16, 2022, the company granted an executive officer 4,000,000 shares of common stock as part of the officer's compensation valued at $200,000. These shares of common stock were valued based on the closing price of the Companys common stock on the date the Company entered into the agreement related to the issuance.\nDuring the year ended June 30, 2022, the Company issued 6,855,700 shares of common stock with a fair value of $718,000 to settle $316,000 of liabilities related to former accrued payroll (see Note 6) and $31,000 of additional liabilities. A loss on settlement of $371,000 was recognized. In addition, during the year ended June 30, 2022, the Company issued 4,331,260 shares of common stock with a fair value of valued at $211,000 to settle outstanding liabilities of $211,000, with no gain or recognized. These shares of common stock were valued based on the closing price of the Companys common stock on the date the Company entered into the agreements related to such issuance.\nYear Ending June 30, 2021\nDuring the year ended June 30, 2021, the Company issued 11,269,538 shares of common stock and 11,269,538 fully vested warrants to purchase common stock over a period of five years with an exercise price of $0.09 per share in exchange for net cash proceeds of $728,000.\nStock Options\nThe Company has not adopted a formal stock option plan. However, it has assumed outstanding stock options resulting from the acquisition of its wholly owned subsidiary, Hydrodynamic Technology, Inc. In addition, the Company has made periodic non-plan grants. A summary of the stock option activity from June 30, 2022 and 2021 is as follows:\nStock Option activity table\nWeighted-\nAverage\nWeighted- Remaining\nAverage Contractual\nExercise Life\nOptions Price (Years)\nOutstanding at June 30, 2020 11,000,000 $ 0.03 6.07\n- Granted - - -\n- Forfeited - - -\n- Exercised - - -\n- Expired - - -\nOutstanding at June 30, 2021 11,000,000 $ 0.03 6.07\n- Granted - - -\n- Forfeited - - -\n- Exercised (8,500,000 ) 0.03 6.07\n- Expired (1,250,000 ) 0.03 0.67\nOutstanding at June 30, 2022 1,250,000 $ 0.03 0.43\nAs of June 30, 2022, all outstanding options were fully vested and exercisable. The intrinsic value of the outstanding options as of June 30, 2022 was $25,000. The following table summarizes additional information concerning options outstanding and exercisable at June 30, 2022.\nSchedule of options outstanding and exercisable\nOptions Outstanding\nOptions Exercisable\nWeighted\nWeighted\nWeighted\nAverage\nAverage\nAverage\nExercise\nNumber\nRemaining\nExercise\nNumber\nRemaining\nPrice\nof Shares\nLife (Years)\nPrice\nof Shares\nLife (Years)\n$ 0.03\n1,250,000\n0.87\n$ 0.03\n1,250,000\n0.87\n1,250,000\n1,250,000\nWarrants\nA summary of the Companys warrant activity and related information from as of June 30, 2022 and 2021 is as follows.\nSchedule of warrant activity\nWeighted-\nAverage\nWeighted- Remaining\nAverage Contractual\nExercise Life\nWarrants\nPrice (Years)\nOutstanding at June 30, 2020 87,696,511 $ 0.07 5.64\nGranted 11,269,538 0.09 5.00\nExercised -\nExpired -\nOutstanding at June 30, 2021 98,966,049 0.07 4.49\nGranted 12,571,785 0.09 5.00\nExercised (50,110,000 )\nExpired -\nOutstanding at June 30, 2022 61,427,834 $ 0.09 2.81\nAs of June 30, 2022, all outstanding warrants were fully vested and exercisable. The intrinsic value of the outstanding warrants as of June 30, 2022 was $216,000. The following table summarizes additional information concerning warrants outstanding and exercisable at June 30, 2022.\nSchedule of warrants outstanding and exercisable\nWarrants Outstanding\nWarrants Exercisable\nWeighted\nWeighted\nWeighted\nAverage\nAverage\nAverage\nExercise\nNumber\nRemaining\nExercise\nNumber\nExercise\nPrice\nof Shares\nLife (Years)\nPrice\nof Shares\nPrice\n$0.03 - $0.05\n18,626,518\n2.63\n$ 0.04\n18,626,518\n$ 0.04\n$0.08 - $0.12\n42,801,316\n2.89\n$ 0.10\n42,801,316\n$ 0.10\n61,427,834\n61,427,834\nYear Ending June 30, 2022\nDuring the year ended June 30, 2022, the Company granted warrants to purchase 12,071,785 shares of common stock in relation to the issuance of common stock (see Common Stock above).\nOn August 1, 2021, the Company granted a service provider a warrant exercisable for 500,000 shares of common stock at an exercise price of $0.09 per share, these warrants were valued at $40,000.\nThe fair value of the warrant awards was estimated using the Black-Scholes method based on the following weighted-average assumptions:\nAssumptions\nJune 30,\nRisk-free interest rate\n0.66%\nContractual terms (years)\n5 years\nExpected volatility\n258%\nExpected dividend yield\n0%\nThe risk-free interest rate is based on the U.S. Treasury yield curve in effect at the time of measurement corresponding with the expected term of the warrants; the contractual terms represents full contractual term the warrants; expected volatility is based upon historical volatility of the Companys common stock; and the expected dividend yield is based on the fact that the Company has not paid dividends in the past and does not expect to pay dividends in the future.\nYear Ending June 30, 2021\nDuring the year ended June 30, 2021, the Company granted warrants to purchase 11,269,538 shares of common stock in relation to the issuance of common stock (see Common Stock above).\nNote 9 - Income Taxes\nFor the year ended June 30, 2022, the Company recorded no provision for income taxes due to the Companys taxable net loss position. For the year ended June 30, 2021, the Company recorded no provision for income taxes due to available Federal and State net operating loss (NOL) carryforwards that are available to reduce taxable income.\nA reconciliation of the effective income tax to statutory US federal income tax is as follows:\nIncome Tax Provision\nJune 30, June 30,\nFederal statutory rate (21)% (21)%\nState income taxes, net of Federal benefit (7)% (7)%\nValuation allowance 28% 28%\nIncome tax provision - -\nDeferred income taxes result from temporary differences in the recognition of income and expenses for the financial reporting purposes and for tax purposes. The components of deferred tax assets are presented below.\nAt June 30, 2022, the Company had available Federal NOL carryforwards of approximately $10.5 million that are available to reduce future taxable income. The Federal NOL carry forward expires through 2037. The NOLs are subject to statutory limitations under Internal Revenue Code Section 382 regarding substantial changes in ownership of companies with loss carry forwards.\nDuring the year ended June 30, 2022 and 2021, management has determined that it is more likely than not that the Company will not be able to realize the tax benefit of the carryforwards due to recurring operating losses. Based on their valuation, the Company determined that the net deferred tax assets, do not meet the requirements to realize, and as such, the Company has provided a full valuation allowance against them.\nAt June 30, 2022 and 2021, significant component of the Companys deferred tax assets and liabilities are as follows:\nSchedule of Deferred Tax Assets\nJune 30, June 30,\nNet Operating loss carryforwards $ 3,063,000 $ 2,758,000\nStock compensation expense 938,000 840,000\nTotal net deferred tax assets 4,001,000 3,598,000\nLess valuation discount (4,001,000 ) (3,598,000 )\nNet deferred tax assets $ - $ -\nAccounting rules prescribes a recognition threshold that a tax position is required to meet before being recognized in the financial statements and provides guidance on recognition, measurement, classification, interest and penalties, accounting in interim periods, disclosure and transition issues. The Company classifies interest and penalties as a component of interest and other expenses. To date, there have been no interest or penalties assessed or paid.\nThe Company measures and records uncertain tax positions by establishing a threshold for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. Only tax positions meeting the more-likely-than-not recognition threshold at the effective date may be recognized or continue to be recognized.\nNote 10 - Commitments and Contingencies\nRoyalty Agreements\nOn July 1, 2008, the Companys wholly owned subsidiary entered into Patent Assignment Agreements with two parties, its President as well as its former Chief Executive Officer (CEO) and current Technology Senior Manager, where certain devices and methods involved in the hydrodynamic cavitation processes invented by the President and former CEO/ current Technology Senior Manager have been assigned to the Company. In exchange, the Company agreed to pay a royalty of 5% of gross revenues to each of the President and former CEO/ current Technology Senior Manager for licensing of the technology and leasing of the related equipment embodying the technology. These agreements were subsequently assigned to Cavitation Technologies on May 13, 2010. The Companys former CEO/ current Technology Senior Manager and President both waived their rights to receive royalty payments that have accrued, or that may accrue, on any gross revenue generated through June 30, 2022 and 2021.\nOn April 30, 2008 (as amended November 22, 2010), the Companys wholly owned subsidiary entered into an employment agreement with the Director of Chemical and Analytical Department (the Inventor) providing that the Inventor shall receive an amount equal to 5% of actual gross royalties received from the royalty stream in the first year in which the Company receives royalty payments from the patent which the Inventor was the legally named inventor, and 3% of actual gross royalties received by the Company resulting from the patent in each subsequent year. As of June 30, 2022, and 2022 no patents have been granted in which this person is the legally named inventor. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nIn accordance with rule 13a-15(a), our management must maintain disclosure controls and procedures as defined in Rule 13a-15(e) of the Securities and Exchange Act of 1934, or the Exchange Act, to provide reasonable assurance that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission rules and forms, and accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nIn accordance with Rule 13a-15(b) and (c), management must also evaluate the effectiveness of these disclosure control and procedures at the end of each fiscal year. As of June 30, 2022, we carried out an evaluation, under the supervision and with the participation of our principal executive officer and principal financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures. Based upon that evaluation, our principal executive officer and principal financial officer concluded that these disclosure controls and procedures were not effective as of June 30, 2022.\nReport of Management on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) under the Exchange Act. Our internal control over financial reporting is designed under the supervision of our principal executive and principal financial officer, and effected by our board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\n(i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n(ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n(iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on the financial statements.\nUnder the supervision and with the participation of our management, including our Principal Executive Officer and Principal Financial Officer, we conducted an evaluation of the effectiveness of our internal controls and procedures, (as defined under Rule 13a-15(e) and Rule 15d-15(e) promulgated under the Securities Exchange Act of 1934, as amended (Exchange Act)) as of the year ended June 30, 2021. Management conducted as assessment of our internal control over financial reporting based on the framework and criteria established by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013). Our management concluded that as of June 30, 2022, our internal control over financial reporting was not effective, and that material weaknesses existed in the following areas as of June 30, 2022:\n1. We do not employ full time in-house personnel with the technical knowledge to identify and address some of the reporting issues surrounding certain complex or non-routine transactions. With respect to material, complex and non-routine transactions, management has and will continue to seek guidance from third-party experts and/or consultants to gain a thorough understanding of these transactions;\n2. We have ineffective controls over segregation of duties due to limited resources and number of employees.\nWe are in the continuous process of improving our internal control over financial reporting in an effort to eliminate these material weaknesses through improved supervision and training of our staff, but additional effort is needed to fully remedy these deficiencies. We intend to hire the necessary staff to address the weaknesses once additional capital is obtained which will allow full operations to commence. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting during the year ended June 30, 2022 that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nAttestation\nPursuant to Item 308(b) of Regulation S-K, as amended by the Dodd-Frank Wall Street Reform and Consumer Protection Act (Wall Street Reform Act), this report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. The Wall Street Reform Act permanently exempts small public companies from the requirement to obtain an external audit on the effectiveness of internal financial reporting controls. ITEM 9B. Other Information\nNone.\nPART III ITEM 10. Directors, Executive Officers and Corporate Governance.\nPerson\nAge\nPosition\nIgor Gorodnitsky\nPresident, PEO, Secretary and Director\nNaum Voloshin\nPrincipal Accounting Officer\nJames Fuller\nDirector\nJerry Bailey PhD\nDirector\nAudit committee standing members consisted of Igor Gorodnitsky and James Fuller as of June 30, 2021. We anticipate forming compensation, governance, and other committees as necessary.\nIgor Gorodnitsky. Mr. Gorodnitsky has been our President and member of the Board of Directors since September 26, 2008, and he became the Company's Secretary and Principal Executive Officer in November of 2012. Mr. Gorodnitsky developed expertise in handling and processing hazardous waste material. As a Senior Haz-Mat Specialist, he coordinated and successfully completed more than 500 emergency response Haz-mat clean-ups over the past 20 years. He coordinated and supervised Haz Mat projects, emergency and routine spill clean-ups, and confined space entry tasks. He coordinated and scheduled manpower and purchased and scheduled equipment and materials for containment and treatment of spills. He successfully managed, coordinated and supervised projects including Hazscanning, sampling, lab-packing, manifesting, profiling, labeling, and other special procedures for a variety of commercial clients and municipalities. He is a chemist by training and holds numerous certifications and licenses including Hazwoper Training Program, Confined Space Entry and Gas Vapour HazCating, Certified Uniform Waste Manifest Training, Basic and Intermediate HazCating, On-Scene Incident Commander Emergency, Site Remediation Methods, Underground Storage Tank Removal, Health & Safety Supervisor Certification, Hazardous Certification, and Tosco Refinery Safety. Mr. Gorodnitsky was president of Express Environmental Corp. since its inception in 1980 until he sold his interest in January 2009. Based on his significant industry experience and management skills it was determined that Mr. Gorodnitsky should serve on the Companys Board.\nJames Fuller. Mr. Fuller is an independent director and has been Chairman of our Audit Committee and Independent Financial Expert since February 2010. He was formerly a Vice President of the New York Stock Exchange and director of the Securities Investor Protection Corporation. In addition to his over 30 years of experience in the securities markets, Mr. Fuller sat on the Board of Trustees of the University of California, Santa Cruz and previously served as Chairman of their Audit Committee and Independent Financial Expert. Jim is a partner at Baytree Capital Associates, LLC. He received his BS in Political Science from San Jose State University and his MBA from California State University - Fresno. Mr. Fuller also served as a Director of Propell Technologies Group, Inc (OTCQB: Propell), a public company engaged in oil and gas exploration from October 14, 2011 until February 17, 2015. Based on Mr. Fullers extensive experience in finance as well as his prior public company experience it was determined that Mr. Fuller should serve on the Companys Board.\nNaum Voloshin. Mr. Voloshin has over 30 years of experience in investment banking, business operations and marketing. Prior to joining CTi, Mr. Voloshin has worked for several developmental stage companies in US, Europe and Asia. The scope of his duties was to provide management, financial reporting, funding, and marketing expertise.\nJerry Bailey PhD. Mr. Bailey has over 50 years of experience in the international petroleum industry. He is a former President of Exxon - Arabian Gulf and prior to that, served in various operating capacities for major oil producers throughout the Middle East and in the U.S. onshore and offshore sectors. Dr. Bailey is currently the Chairman of Bailey Petroleum, LLC, a consulting firm for major oil and gas exploration and development corporations. In addition, during his extensive career, Dr. Bailey has served in a variety of C-Suite and Board capacities for several oil & gas enterprises. Dr. Bailey holds a BS Degree in Chemical Engineering from the University of Houston, an MS Degree in Chemical Engineering from the New Jersey Institute of Technology, a PhD Degree from Columbia Pacific University and is a graduate of Engineering Doctoral Studies from Lamar University.\nFamily Relationships\nRoman Gordon is a founder and current Global Technology Manger of the Company. He was a former member of the Companys Board of Directors and Chief Technology Officer up to July 15, 2016. He is also the brother of Mr. Igor Gorodnitsky, President, Principal Executive Officer and member of the Companys Board of Directors.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934, as amended, requires our executive officers, directors, persons who own more than 10% of our common stock, and immediate family members living in the same household to file an Initial Statement of Beneficial Ownership on Form 3 and changes in ownership on Form 4 with the Securities and Exchange Commission (the \"SEC\"). Such \"insiders\" are required by SEC rules to furnish us with copies of all Section 16(a) forms they file.\nBased on a review of Forms 3, 4, and 5 and amendments thereto furnished to us during fiscal 2020 updated forms were filed, ended June 30, 2021, there were no delinquent forms filed during the year.\nDirector Independence\nAlthough our common stock is not listed on a national securities exchange, for purposes of independence we use the definition of independence applied by the NASDAQ stock market. The Board has determined that Mr. Fuller is an independent in accordance with such definition. Mr. Gorodnitsky is not independent due to his current positions with the Company.\nCode of Ethics\nWe have adopted a Code of Business Conduct and Ethics that applies to all officers, directors and employees. A copy may also be obtained free of charge by mailing a request in writing to: Cavitation Technologies, Inc., 10019 Canoga Ave., Chatsworth, CA 91311 USA. If we make any substantive amendments to the Code of Business Conduct and Ethics or grant any waiver from a provision of the Code to any executive officer or director, we will promptly disclose the nature of the amendment or waiver in a current report on Form 8-K. ITEM 11. Executive Compensation.\nSummary Compensation Table\nThe following table sets forth a summary of cash and non-cash compensation awarded, earned or paid for services rendered to us during the years ended June 30, 2022 and 2021 by our named executive officers, consisting of (i) each individual serving as principal executive officer, and (ii) our Chief Financial Officer/Chief Operating Officer, our other executive officer.\nYear Salary Bonus Stock Awards (1) Warrant Awards Non-Equity Incentive Plan Compen-\nsation Changes in Pension Value and Non-Qualified Deferred Compen-\nsation All Other Compen-\nsation Totals\nIgor Gorodnitsky $ 187,933 $ - $ - $ - $ - $ - $ - $ 187,933\nPresident, Principal Executive Officer $ 173,800 $ - $ - $ - $ - $ - $ - $ 173,800\nNaum Voloshin $ 207,746 $ - $ 200,000 $ - $ - $ - $ - $ 407,746\nPrincipal Accounting Officer $ 173,800 $ - $ - $ - $ - $ - $ - $ 173,800\nOutstanding Equity Awards at Fiscal Year-End\nThe table below reflects all outstanding equity awards made to each of the named executive officers that are outstanding as of June 30, 2022\nRestricted Stock Awards\nName Restricted Stock grant date Number of securities Underlying Restricted Stock Awards # Exercisable Number of securities Underlying Restricted Stock Awards # Unexercisable Restricted Stock Awards Grant Price\nNaum Voloshin 6/21/2022 4,000,000 - 0.05\nPrincipal Accounting Officer\nThe fair value of each restricted stock grant is the market value of the stock on the grant date.\nEmployment Agreements\nOur executive officers work as at-will employees.\nCode Section 162(m) Provisions\nSection 162(m) of the U.S. Internal Revenue Code, or the Code, generally disallows a tax deduction to public companies for compensation in excess of $1 million paid to the Chief Executive Officer or any of the four most highly compensated officers. Performance-based compensation arrangements may qualify for an exemption from the deduction limit if they satisfy various requirements under Section 162(m). Although we consider the impact of this rule when developing and implementing our executive compensation programs, we believe it is important to preserve flexibility in designing compensation programs. Accordingly, we have not adopted a policy that all compensation must qualify as deductible under Section 162(m) of the Code. While our stock options are intended to qualify as performance-based compensation (as defined by the Code), amounts paid under our other compensation programs may not qualify as such.\n2022 Director Compensation\nThe following table sets forth information for the fiscal year ended June 30, 2022 regarding the compensation of our directors who at June 30, 2022 were not also named executive officers.\nFees\nNon-equity\nEarned\ninventive\nNon-qualified\nor paid\nStock\nOption\nplan\ndeferred\nAll other\nin cash\nAwards\nAwards\ncompensation\ncompensation\ncompensation\nTotal\nName\n($)\n($)\n($)\n($)\nEarnings\n($)\n($)\nJames Fuller (1)\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nJerry Bailey\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nAs of June 30, 2022, the following table sets forth the number of aggregate outstanding option awards held by each of our directors who were not also named executive officers:\nAggregate\nNumber of\nName Option Awards\n  - ITEM 12. Security Ownership of Certain Beneficial Owners and Management\nThe following table provides information regarding the beneficial ownership of our common stock as of September 30, 2022, (the Evaluation Date) by: (i) each of our current directors, (ii) each of our named executive officers, and (iii) all such directors and executive officers as a group. We know of no other person or group of affiliated persons who beneficially own more than five percent of our common stock. The table is based upon information supplied by our officers, directors and principal stockholders and a review of Schedules 13D and 13G, if any, filed with the SEC. Unless otherwise indicated in the footnotes to the table and subject to community property laws where applicable, we believe that each of the stockholders named in the table has sole voting and investment power with respect to the shares indicated as beneficially owned.\nApplicable percentages are based on 276,698,831 shares outstanding as of the Evaluation Date, adjusted as required by rules promulgated by the SEC. These rules generally attribute beneficial ownership of securities to persons who possess sole or shared voting power or investment power with respect to those securities. In addition, the rules include shares of our common stock issuable pursuant to the exercise of stock options or warrants that are either immediately exercisable or exercisable within 60 days of the Evaluation Date. These shares are deemed to be outstanding and beneficially owned by the person holding those options for the purpose of computing the percentage ownership of that person, but they are not treated as outstanding for the purpose of computing the percentage ownership of any other person.\nAmount and\nNature of\nBeneficial\nPercent of\nName of Beneficial Owner\nOwnership\nClass (1)\nIgor Gorodnitsky\n(2)\n13,927,681\n5.0 %\nPresident, Principal Executive Officer, Director\nJames Fuller\n(3)\n2,837,500\n1.0 %\nChairman of Audit Committee, Director\nNaum Voloshin\n(4)\n10, 212,390\n3.7 %\nPrincipal Accounting Officer\nDr. Gerald Bailey\n(5)\n400,000\n*\nDirector\nDirectors and Officers\n27,377,571\n9.8 %\n(as a group, four individuals)\n* Less than 1%\n(1) Unless otherwise set forth below, the mailing address of Executive Officers, Directors and 5% or greater holders is in care of the Company,\n(2) Consists of 13,927,681 shares of common stock\n(3) Consists of 837,500 shares of common stock and warrants exercisable for 2,000,000[warrant list shows 1,500,000] shares of common stock, all of which re vested\n(4) Consists of 10,212,390 shares of common stock, including 4,000,000 restricted shares granted to Mr. Voloshin on June 21,, 2022.\n(5) Consists of warrants exercisable for 400,000 shares of common stock ITEM 13. Certain Relationships and Related Transactions\nCertain Related Party Transactions\nSince the beginning of our last fiscal year , there has not been, and there is not currently proposed, any transaction or series of similar transactions to which we were or will be a party in which the amount involved exceeded or will exceed the lesser of $120,000 or one percent of the average of our total assets at year-end for the last two completed fiscal years and in which any of our directors, executive officers, holders of more than five percent of any class of our voting securities or any member of the immediate family of the foregoing persons had or will have a direct or indirect material interest.\nAccrued Payroll and Payroll Taxes\nAs of June 30, 2022, and 2021, the Company had accrued unpaid salaries to officers and former officers amounting to $247,000 and $667,000 respectively.\nCameo USA LLC\nIn fiscal 2014, Roman Gordon, one of the Companys shareholders and a former officer, formed a company called Cameo USA LLC (Cameo). Since its formation, Cameo has had no revenue, no operations, and has had no assets or liabilities. On June 4, 2018, Mr. Gordon contributed his 100% interest in Cameo to the Company. As Mr. Gordon had no basis in his investment in Cameo, there was no value assigned to the contribution of Cameo. Subsequent to the contribution of Cameo to the Company, Cameo was sold to Alchemy Beverages Inc.\nDirector Independence\nAs our common stock is currently traded on the OTC Bulletin Board, we are not subject to the rules of any national securities exchange which require that a majority of a listed company's directors and specified committees of the board of directors meet independence standards prescribed by such rules. For the purpose of preparing the disclosures in this Report on Form 10-K regarding director independence, we have used the definition of \"independent director\" set forth in the Marketplace Rules of The NASDAQ, which defines an \"independent director\" generally as a person other than an executive officer or employee of the Company or any other individual having a relationship which, in the opinion of the Company's board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. Consistent with these standards, we believe that James Fuller is an Independent Financial Expert. ITEM 14. Principal Accounting Fees and Services\nIndependent Registered Public Accounting Firms Fee Summary\nThe following table provides information regarding the fees billed to us by Weinberg & Company, P.A. for the years ended June 30, 2022 and 2021. All fees described below were approved by the Board:\nJune 30,\nJune 30,\nAudit Fees and Expenses (1) $ 112,000 $ 99,000\nAudit Related Fees (2) $ - $ -\nAll Other Fees $ 15,000 $ 13,000\n(1) Audit fees and expenses were for professional services rendered for the audit and reviews of the consolidated financial statements of the Company, professional services rendered for issuance of consents and assistance with review of documents filed with the SEC.\n(2) The audit related fees were for professional services rendered for additional filing for registration statements and forms with the SEC.\nPre-Approval Policies and Procedures\nConsistent with SEC policies regarding auditor independence, the Audit Committee has responsibility for appointing, setting compensation and overseeing the work of the independent registered public accounting firm. In recognition of this responsibility, the Audit Committee has established a policy to pre-approve all audit and permissible non-audit services provided by the independent registered public accounting firm.\nPrior to the engagement of the independent registered public accounting firm for the next years audit, management will submit a list of services and related fees expected to be rendered during that year for audit services, audit-related services, tax services and other fees to the Audit Committee for approval.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a) The following documents are filed as part of this annual report on Form 10-K:\n1. Financial Statements\nThe financial statements are filed as part of this report under Item 8 Financial Statements and Supplementary Data.\n2. Financial Statement Schedules\nAll other schedules are omitted because they are not applicable or the required information is presented in the financial statements and notes thereto.\n3. Exhibits\nThe exhibits required by Item 601 of Regulation S-K are included in Item 15(b) below.\n(b) - Exhibits.\nIncorporated by Reference\nExhibit\nFiled\nNumber Exhibit Description Herewith Form Pd. Ending Exhibit Filing Date\n3(i)(a) Articles of Incorporation - original name of Bioenergy, Inc.\nSB-2 N/A 3.1 October 19, 2006\n3(i)(b) Articles of Incorporation - Amended and Restated\n10-Q December 31, 2008 3.1 February 17, 2009\n3(i)(c) Articles of Incorporation - Amended and Restated\n10-Q June 30, 2009 3.1 May 14, 2009\n3(i)(d) Articles of Incorporation - Amended; increase in authorized shares\n8-K N/A N/A October 29, 2009\n3(i)(e) Articles of Incorporation - Certificate of Amendment; forward split\n10-Q December 31, 2009 3.1 November 16, 2009\n10.1 Patent Assignment Agreement between the Company and Roman Gordon dated July 1, 2008.\n8-K June 30, 2009 10.1 May 18, 2010\n10.2 Patent Assignment Agreement between the Company and Igor Gorodnitsky dated July 1, 2008.\n8-K June 30, 2009 10.2 May 18, 2010\n10.3 Assignment of Patent Assignment Agreement between the Company and Roman Gordon\n8-K June 30, 2009 10.3 May 18, 2010\n10.4 Assignment of Patent Assignment Agreement between the Company and Igor Gorodnitsky\n8-K June 30, 2009 10.4 May 18, 2010\n10.5 Employment Agreement between the Company and Roman Gordon date March 17, 2008\n10K/A June 30, 2009 10.3 October 20, 2011\n10.6 Employment Agreement between the Company and Igor Gorodnitsky dated March 17, 2008\n10K/A June 30, 2009 10.4 October 20, 2011\n10.7 Employment Agreement with R.L. Hartshorn dated Sept. 22, 2009\n10-Q December 31, 2011 10.7 February 10, 2012\n10.8 Employment and Confidentiality and Invention Assignment Agreement between the Company and Varvara Grichko dated April 30, 2008\n10-Q December 31, 2010 10.3 February 11, 2011\n10.9 Board of Director Agreement - James Fuller\n10-Q December 31, 2011 10.12 October 20, 2011\n10.1 Technology and License Agreement with Desmet Ballestra dated 14 May 2012\n10-K June 30, 2012 10.1 October 15, 2012\n10.11 Convertible Note Payable - Prolific Group LLC - $25,000\n10-Q December 31, 2011 10.4 February 10, 2012\n10.12 Convertible Note Payable - Tripod Group LLC - $30,000\n10-Q December 31, 2011 10.41 February 10, 2012\n14.1 Code of Business Conduct and Ethics*\n10-K June 30, 2011 14.1 September 28, 2011\n31.1 Certificate of Principal Executive Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002 X\n31.2 Certificate of Principal Financial Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002 X\n32.1 Certification of Principal Executive Officer pursuant to 18 U.S.C Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. X\n32.2 Certification of Principal Financial Officer pursuant to 18 U.S.C Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. X\n101.INS Inline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document) X\n101.SCH Inline XBRL Taxonomy Extension Schema Document X\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document X\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document X\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document X\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document X\nCover Page Interactive Data File (embedded within the Inline XBRL document) X\n* In accordance with Regulation S-K 406 of the Securities Act of 1934, we undertake to provide to any person without charge, upon request, a copy of our Code of Business Conduct and Ethics. A copy may be requested by sending an email to info@cavitationtechnologies.com.\n(c) - Financial Statement Schedules\nSee Item (a) 2 above.\nITEM 16. SUMMARY. FORM 10-K SUMMARY\nNot applicable\nSIGNATURES\nPURSUANT TO THE REQUIREMENTS OF THE SECURITIES EXCHANGE ACT OF 1934, THIS REPORT HAS BEEN SIGNED BELOW BY THE FOLLOWING PERSONS ON BEHALF OF THE REGISTRANT AND IN THE CAPACITIES AND ON THE DATES INDICATED\nSIGNATURE\nTITLE\nDATE\n/s/ Igor Gorodnitsky\nPresident; Member of Board of Directors\nOctober __, 2022\nIgor Gorodnitsky\n(Principal Executive Officer)\n/s/ N. Voloshin\nChief Financial Officer\nOctober __, 2022\nN. Voloshin\n(Principal Financial Officer)\n/s/ James Fuller\nAudit Committee Chairman,\nOctober __, 2022\nJames Fuller\nIndependent Financial Expert"
}