{
    "cik": "1378590",
    "company": "Bridgeline Digital, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-27",
    "period_of_report": "2023-09-30",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "MA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1378590/0001437749-23-035439-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1378590/000143774923035439/blin20230930c_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1378590/0001437749-23-035439.txt",
    "filename": "1378590_10K_2023_0001437749-23-035439.htm",
    "content": "Item 1. Business.\nOverview\nBridgeline Digital is a marketing technology company that offers a suite of products that help companies grow online revenue by driving more traffic to their websites, converting more visitors to purchasers, and increasing average order value.\nAll of Bridgelines software is available through a cloud-based Software as a Service (SaaS) model, whose flexible architecture provides customers hosting and support. Additionally, Unbound and HawkSearch have the option to be available via a traditional perpetual licensing business model, in which the software can reside on a dedicated infrastructure either on premise at the customers facility, or manage-hosted by Bridgeline via a cloud-based, dedicated hosted services model.\nBridgeline's product offerings include:\nHawkSearch: a site search, recommendation, and personalization software application, built for marketers, merchandisers, and developers to enhance, normalize, and enrich an online customer's content search and product discovery experience.\nCelebros Search: a commerce-oriented site search product that provides Natural Language Processing with artificial intelligence to present relevant search results based on long-tail keyword searches.\nWoorank: a Search Engine Optimization (SEO) audit tool that generates an instant performance audit of the sites technical, on-page, and off-page SEO.\nUnbound: a Digital Experience Platform that includes Web Content Management, eCommerce, Digital Marketing, and Web Analytics.\nTruPresence: a web content management and eCommerce platform that supports the needs of multi-unit organizations and franchises.\nOrchestraCMS: the only content and digital experience platform built 100% native on Salesforce and helps customers create websites and intranets for their customers, partners, and employees.\nBridgeline Digital was incorporated under the laws of the State of Delaware on August 28, 2000.\nLocations\nThe Companys corporate headquarters is located in Woburn, Massachusetts. The Company maintains regional field offices serving the following geographical locations: Woodbury, New York; Rosemont, Illinois; Atascadero, California; Ontario, Canada; and Brussels, Belgium.\nThe Company has four wholly-owned subsidiaries: Bridgeline Digital Pvt. Ltd., located in Bangalore, India; Bridgeline Digital Canada, Inc., located in Ontario, Canada; Hawk Search Inc. located in Rosemont, Illinois and Bridgeline Digital Belgium BV, located in Brussels, Belgium.\nProducts and Services\nProducts\nSubscription and Perpetual Licenses\nAll of Bridgelines software is available through a cloud-based Software as a Service (SaaS) model, whose flexible architecture provides customers hosting and support. Additionally, HawkSearch and Unbound have the option to be available via a traditional perpetual licensing business model, in which the software can reside on a dedicated infrastructure either on premise at the customers facility, or manage-hosted by Bridgeline via a cloud-based, dedicated hosted services model. This software is reported as Subscription and Perpetual Licenses in the accompanying consolidated financial statements.\nBridgeline offers enterprise site search solutions with its HawkSearch and Celebros Search products.\n●\nHawkSearch is an AI-powered site search, recommendation, and personalization software application for marketers, merchandisers, and developers to enhance, normalize, and enrich an online customer's product discovery. HawkSearch leverages artificial intelligence, machine learning and industry-leading merchandising features to deliver accurate, relevant and personalized results and recommendations derived from multiple data sources. HawkSearch has integrations and partner relationships with platforms such as Adobe, BigCommerce, Optimizely, Sitefinity, Shopify and others.\n●\nCelebros Search is a commerce-oriented, site search product that provides for Natural Language Processing and incorporates artificial intelligence to present relevant search results based on long-tail keyword searches. Celebros Search is a semantic search and conversion technology that is available in seven languages. Celebros Search has plug-ins into the Bridgeline Unbound Commerce offering in addition to many other third-party Commerce platforms such as Adobe, Hybris and Shopify.\nBridgeline offers Search Engine Optimization auditing through its WooRank by Bridgeline software.\n●\nWoorank is a Search Engine Optimization (SEO) audit tool that generates an instant performance audit of the sites technical, on-page, and off-page SEO. Wooranks clear, actionable insights help companies increase their search engine ranking, while boosting website traffic, audience engagement, conversion, and customer retention rates.\nBridgeline offers franchise marketing software with its TruPresence platform.\n●\nTruPresence is a Web Content Management and eCommerce platform that supports the needs of multi-unit organizations and franchises. The TruPresence product empowers large franchises, brand networks, and other multi-unit organizations to manage a large hierarchy of digital properties at scale. TruPresence provides centralized and distributed management of content and products from parent sites down to multiple child sites for consistency in branding and messaging while also enabling regional / local site owners to manage the local messaging, products and promotions specific to their local market.\nBridgeline offers Bridgeline Unbound as a Digital Experience Platform.\n●\nUnbound is a Digital Experience Platform that includes Web Content Management, eCommerce, Digital Marketing, and Web Analytics. Unbound Content, Unbound Marketing, Unbound Commerce, and Unbound Insights empower marketers to easily manage their digital experiences and create personalized customer journeys. Each Unbound implementation incorporates a set of flexible templates and modules to accelerate implementation speed and reduce costs. The Unbound platform, combined with its professional services, assists customers in powering engaging digital experiences that drive lead generation, increase revenue, improve customer service and loyalty, enhance employee knowledge, and reduce operational costs.\nBridgeline also offers OrchestraCMS as a Digital Experience Platform.\n●\nOrchestraCMS is a digital experience platform built 100% native on Salesforce and helps customers create websites and intranets for their customers, partners, and employees. The software combines content with business data, processes and applications, including Salesforce Communities, social media, portals, intranets, websites, applications and services. OrchestraCMS also has a rich set of APIs to enable development of custom solutions, third-party integrations and delivery of digital transformation initiatives on the Salesforce platform, helping customers drive deeper engagement and collaboration, increase efficiency and minimize risk.\nServices\nRevenue from Digital Engagement Services\nRevenue from all digital engagement services is reported as Digital engagement services in the accompanying consolidated financial statements.\nDigital engagement services address specific customer needs such as digital strategy, web design and web development, usability engineering, information architecture, and SEO for their mission critical website, intranet or online store. Application development engagements are often sold as part of a multiple element arrangement that includes our software products, hosting arrangements (i.e., Managed Service Hosting) that provide for the use of certain hardware and infrastructure through our partnership with Amazon Web Services or professional services retained after completion of the application development.\nSales and Marketing\nOverview\nBridgeline employs a direct sales force, which focuses its efforts on selling to mid-sized and large companies. These companies are generally categorized in the following vertical markets:\n●\nAssociations and Foundations\n● Banks and Credit Unions\n●\neCommerce Retailers\n● Franchises & Enterprises\n● Health Services and Life Sciences\n●\nIndustrial Distribution and Wholesale\n●\nManufacturers\n●\nTechnology\nWe also pursue strategic alliances and partnerships to enhance the sales and distribution opportunities of Bridgeline intellectual property. We currently have partner relationships with platforms such as Adobe, BigCommerce, Optimizely, Sitefinity, Shopify, and others.\nOrganic Growth from Existing Customer Base\nOur business development professionals seek ongoing business opportunities within our existing customer base and within other operating divisions or subsidiaries of our existing customer base.\nNew Customer Acquisition\nWe identify customers within our vertical expertise. Our business development professionals create an annual territory plan identifying various strategies to prospect and engage our target verticals.\nNew Lead Generation Programs\nWe generate targeted leads and new business opportunities by leveraging online marketing strategies. We receive leads by maximizing the SEO capabilities of our own websites. Through our websites, we provide various educational whitepapers and promote upcoming online seminars. In addition, we utilize banner advertisements on various independent newsletters and paid search advertisements that are linked to our website. We also participate and exhibit at targeted online and in-person events and conferences.\nCustomer Retention Programs\nWe have a dedicated Customer Success team that engages with customers regularly to conduct strategic business reviews and audits to ensure they are getting the most value out of the Bridgeline product offerings. We use surveying techniques to gauge and monitor customer sentiment as well as digital marketing capabilities to inform our customer base of the latest feature releases and product innovations. We make product releases available via email campaigns as well as publication on our website. Bridgeline also provides educational white papers and featured case studies, to inform customers of best practices and enhancements. We also host educational online webinars for customers as well as face-to-face customer focus groups and training sessions.\nSocial Media Programs\nWe market Bridgelines upcoming events, white papers, blogs, case studies, digital product tutorials, announcements, and related articles frequently on leading social media platforms such as Twitter, LinkedIn, YouTube and Facebook.\nResearch and Development\nWe have research and development activities focusing on creating new products and innovations, product enhancements, and funding future market opportunities. Research and development expenses were approximately $3.7 million or 23% of revenues and $3.2 million or 19% of revenues during fiscal 2023 and 2022, respectively.\nEmployees\nHuman Capital\nBridgeline is dedicated to creating the best digital presence for our customers, and our employees are critical to achieving this mission. In order to continue to design innovative experiences and products and compete and succeed in our highly competitive and rapidly evolving market, we continue to attract and retain experienced and talented employees. As part of these efforts, we strive to offer a competitive compensation and benefits program, foster a community of inclusion and empower individuals to do their best work.\nAs of September 30, 2023, we had approximately 55 full-time employees. Of our full-time employees, approximately 40 were in the United States and the remaining were based in our various international locations. None of our employees are represented by a labor union or covered by a collective bargaining agreement.\nCompensation and Benefits Program\nOur compensation program is designed to attract and reward talented individuals who possess the skills necessary to support our business objectives, assist in the achievement of our strategic goals and create long-term value for our stockholders. We provide employees with compensation packages that include base salary, incentive bonuses, and long-term stock option awards tied to the value of our stock price. We believe that a compensation program with both short-term and long-term awards provides fair and competitive compensation and aligns employee and stockholder interests, including by incentivizing business and individual performance (pay for performance), motivating individuals based on long-term company performance and integrating compensation with our business plans. In addition to cash and equity compensation, we also offer employees benefits such as life and health (medical, dental & vision) insurance, paid time off, and a 401(k) plan.\nCustomers\nWe primarily serve the following vertical markets that we believe have a history of investing in information technology enhancements and initiatives:\n●\nAssociations and Foundations\n● Banks and Credit Unions\n●\neCommerce Retailers\n● Franchises & Enterprises\n● Health Services and Life Sciences\n●\nIndustrial Distribution and Wholesale\n●\nManufacturers\n●\nTechnology\nFor the years ended September 30, 2023 and 2022, no customer exceeded 10% of the Companys total revenues.\nCompetition\nThe markets for our products and services, including eCommerce platform software, eMarketing software, software for web content management, web analytics software and digital engagement services are highly competitive, fragmented, and rapidly changing. Barriers to entry in such markets remain relatively low. The markets are significantly affected by new product introductions and other market activities of industry participants. With the introduction of new technologies and market entrants, we expect competition to persist and intensify in the future.\nWe believe we compete adequately with others and we distinguish ourselves from our competitors in a number of ways, including:\n●\nOur competitors generally offer their web application software with an emphasis on a singular focus/function (such as content management only, or commerce only) as compared to the deeply integrated and multi-faceted approach provided by Bridgelines platforms.\n●\nThe architecture comprising Bridgelines platforms are flexible and some are capable of being deployed in either a SaaS or dedicated server environment.\n●\nThe majority of our competitors do not provide interactive technology development services that complement their software products. Our ability to develop mission critical websites and online stores on our own deeply integrated platforms provides a quality end-to-end solution.\n●\nThe interface of the Bridgeline platforms have been designed for ease of use without requiring substantial technical skills from our customers.\n●\nFinally, we believe the Bridgeline platforms offer a competitive price-to-functionality ratio when compared to our competitors.\nPatents, Trademarks, and Trade Secrets\nWe own a number of trade secrets, licenses and trademarks related to Bridgeline products and services and their loss could have a material adverse effect on the Company. We do not own any patents. For additional information see Risk Factor - If we are unable to protect our proprietary technology and other intellectual property rights, our ability to compete in the marketplace may be substantially reduced.\nAvailable Information\nThis Annual Report on Form 10-K, as well as our quarterly reports on Form 10-Q and current reports on Form 8-K, along with any amendments to those reports, are made available upon request, on our website www.bridgeline.com as soon as reasonably practicable after such material is electronically filed with or furnished to the Securities and Exchange Commission (SEC). Copies of the following are also available through our website on the About - Investor Relations page and are available in print to any stockholder who requests it:\n●\nCode of Business Ethics\n●\nCommittee Charters for the following Board Committees:\n-\nNominating and Corporate Governance Committee\n-\nAudit Committee\n-\nCompensation Committee\nThe public may read and copy any materials that we file with the SEC at the SECs Public Reference Room at 450 Fifth Street, N.W., Washington, D.C. 20549. Information regarding the SECs Public Reference Room can be obtained by calling the SEC at 1-800-SEC-0330. The SEC also maintains an Internet site that contains reports, proxy and information statements, and other information and can be found at http://www.sec.gov. Item 1A. Risk Factors\nThis report contains forward-looking statements that involve risks and uncertainties, such as statements of our objectives, expectations and intentions. The cautionary statements made in this report are applicable to all forward-looking statements wherever they appear in this report. Our actual results could differ materially from those discussed herein. In addition to the risks discussed in Managements Discussion and Analysis of Financial Condition and Results of Operations, our business is subject to the risks set forth below.\nWe operate in a rapidly changing environment that involves certain risks and uncertainties, some of which are beyond our control. The risks described below are not the only risks we face. Additional risks and uncertainties not currently known to us or that we currently deem to be immaterial may also materially adversely affect our business, financial condition and/or operating results.\nRisk Factors\nRisk Factors Related to our Business\nWe have incurred significant net losses since inception and expect to continue to incur operating losses for the foreseeable future. We may never achieve or sustain profitability, which would depress the market price of our common stock and could cause you to lose all or a part of your investment.\nWe incurred net loss of approximately $9.4 million for the year ended September 30, 2023, which includes gains related to the change in the fair value of warrant liabilities and a goodwill impairment charge of $7.5 million. Since our inception in 2000 and through fiscal 2019, and in fiscal 2021 and fiscal 2023, we have incurred net losses, and may do so again. As of September 30, 2023, we had an accumulated deficit of approximately $90 million. Our prior losses have had an adverse effect on our stockholders equity and working capital. Because of the numerous risks and uncertainties associated with our business, we are unable to predict the extent of any future losses or when we may become profitable. If we do become profitable, we may not be able to sustain or increase our profitability on a quarterly or annual basis.\nWe may require additional financing to execute our business plan and further expand our operations.\nWe may require additional funding to further expand our operations. We depend on financing sources, either debt or equity, or a combination thereof, which may not be available to us in a timely basis if at all, or on terms acceptable to us. Further, our ability to obtain financing may be limited by rules of the Nasdaq Stock Market.\nIf we fail to obtain acceptable funding when needed, we may not have sufficient resources to fund our operations, and this would have a material adverse effect on our business.\nA reduction in our license renewal rate could reduce our revenue.\nOur customers have no obligation to renew their subscription licenses, and some customers have elected or may elect not to do so. Our license renewal rates may decline or fluctuate as a result of a number of factors, including customer dissatisfaction with our products and services, our failure to update our products to maintain their attractiveness in the market, or constraints or changes in budget priorities faced by our customers. A decline in license renewal rates could cause our revenue to decline, which would have a material adverse effect on our operations.\nWe may become dependent upon a concentration of major customers, and a failure to renew our licenses with such customers could reduce our revenue.\nWe have previously and may from time to time derive a significant portion of our revenues from a relatively concentrated number of customers. Considering a reduction in our license renewal rate could reduce our revenue, these consequences could be exacerbated if we are dependent upon several major customers and any one of them were to elect not to renew.\nThe length of our sales cycle can alternate markedly, which could result in significant fluctuations in the recognition of license revenues from quarter to quarter.\nThe decision by a customer to purchase our products often involves the development of a complex implementation plan across a customers business. This process often requires a significant commitment of resources both by prospective customers and us. Given the significant investment and commitment of resources required in order to implement our software, it may take several months, or even several quarters, for marketing opportunities to materialize. If a customers decision to purchase our products is delayed, or if the installation of our products takes longer than originally anticipated, the date on which we may recognize revenue from these sales would be delayed. Such delays and fluctuations could cause our revenue to be lower than expected in a particular period, and we may not be able to adjust our costs quickly enough to offset such lower revenue, potentially negatively impacting our results of operations.\nWe depend on a third-party cloud platform provider to host our Bridgeline SaaS environment and managed services business and if we were to experience a disruption or interference in service, our business and reputation could suffer.\nWe host our SaaS and managed hosting customers via a third-party, Amazon Web Services. If upon renewal date our third-party provider does not provide commercially reasonable terms, we may be required to transfer our services to a new provider, such as a data center facility, and we may incur significant equipment costs and possible service interruption in connection with doing so. Service interruptions might reduce our revenue, cause us to issue credits or refunds to customers, subject us to potential liability, or harm our renewal rates. Interference from unauthorized access to or tampering with these systems, including those resulting from cyber-attacks, could result in a variety of consequences, including devaluation of our intellectual property, goodwill, increased expenditures on data security and litigation, and can have a material adverse effect on our business, revenues, reputation, operating results and financial condition.\nIf our security measures or those of our third-party cloud computing platform provider are breached and unauthorized access is obtained to a customers data, our services may be perceived as not being secure, and we may incur significant legal and financial exposure and liabilities.\nSecurity breaches could expose us to a risk of loss of our customers information, litigation and possible liability. While we have security measures in place, they may be breached as a result of third-party action, including intentional misconduct by computer hackers and cybercriminals, employee error, malfeasance or otherwise and result in someone obtaining unauthorized access to our IT systems, our customers data or our data, including our intellectual property and other confidential business information. Because the techniques used to obtain unauthorized access, or to sabotage systems, change frequently and generally are not recognized until launched against a target, we may be unable to implement adequate preventative measures. In addition, our customers may authorize third-party technology providers to access their customer data, and some of our customers may not have adequate security measures in place to protect their data that is stored on our services. Because we do not control our customers or third-party technology providers, or the processing of such data by third-party technology providers, we cannot ensure the integrity or security of such transmissions or processing. Malicious third parties may also conduct cyber-attacks designed to temporarily deny customers access to our services. Any security breach could result in a loss of confidence in the security of our services, damage our reputation, negatively impact our future sales, disrupt our business and lead to legal liability.\nWe rely on encryption and authentication technology from third parties to provide the security and authentication to effectively secure transmission of confidential information, including consumer payment card numbers. Such technology may not be sufficient to protect the transmission of such confidential information or these technologies may have material defects that may compromise the confidentiality or integrity of the transmitted data. Any imposition of liability, particularly liability that is not covered by insurance, or is in excess of insurance coverage, could harm our reputation, business and operating results. We might be required to expend significant capital and other resources to protect further against security breaches or to rectify problems caused by any security breach, which, in turn, could divert funds available for corporate growth and expansion or future acquisitions.\nOur operating lease commitments may adversely affect our financial condition and cash flows from operations.\nWe have contractual commitments in operating lease arrangements. Our ability to meet our expenses and contractual commitments will depend on our future performance, which will be affected by financial, business, economic, regulatory and other factors. We will not be able to control many of these factors, such as economic conditions and governmental regulations. Further, our operations may not generate sufficient cash to enable us to service our working capital needs or contractual obligations resulting from our leases. If we are at any time unable to generate sufficient cash flows from operations, we may be required to obtain additional sources of financing. There can be no assurance that we would be able to successfully renegotiate such terms, or that additional financing could be obtained on terms that are favorable or acceptable to us. Refer to the Risk Factor - We may require additional financing to execute our business plan and further expand our operations, for a description of capital raising activities.\nWe face intense and growing competition, which could result in price reductions, reduced operating margins and loss of market share.\nWe operate in a highly competitive marketplace and generally encounter intense competition to create and maintain demand for our services and to obtain service contracts. If we are unable to successfully compete for new business and license renewals, our revenue growth and operating margins may decline. The market for our platforms and web development services are competitive and rapidly changing. Barriers to entry in such markets are relatively low. Competitors and partners are investing in artificial intelligence. With the introduction of new technologies and market entrants, we expect competition to intensify in the future. Some of our principal competitors offer their products at a lower price, which may result in pricing pressures. Such pricing pressures and increased competition generally could result in reduced sales, reduced margins or the failure of our product and service offerings to achieve or maintain more widespread market acceptance.\nThe marketplace is highly fragmented with a large number of competitors and potential competitors. Our competitors include companies such as Algolia, Bloomreach, Coveo, Searchspring, Semrush, Sitecore and Yext. We face competition from customers and potential customers who develop their own applications internally. We also face competition from potential competitors that are substantially larger than we are and who have significantly greater financial, technical and marketing resources, and established direct and indirect channels of distribution. As a result, they are able to devote greater resources to the development, promotion and sale of their products than we can.\nIf our products fail to perform properly due to undetected errors or similar problems, our business could suffer, and we could face product liability exposure.\nWe develop and sell complex web engagement software which may contain undetected errors or bugs. Such errors can be detected at any point in a products life cycle but are frequently found after introduction of new software or enhancements to existing software. We continually introduce new products and new versions of our products. Despite internal testing and testing by current and potential customers, our current and future products may contain serious defects. If we detect any errors before we ship a product, we might have to delay product shipment for an extended period of time while we address the problem. We might not discover software errors that affect our new or current products or enhancements until after they are deployed, and we may need to provide enhancements to correct such errors. Therefore, it is possible that, despite our testing, errors may occur in our software. These errors could result in the following:\n●\nharm to our reputation;\n●\nlost sales;\n●\ndelays in commercial release;\n●\nproduct liability claims;\n●\ncontractual disputes;\n●\nnegative publicity;\n●\ndelays in or loss of market acceptance of our products;\n●\nlicense terminations or renegotiations; or\n●\nunexpected expenses and diversion of resources to remedy errors.\nFurthermore, our customers may use our software together with products from other companies. As a result, when problems occur, it might be difficult to identify the source of the problem. Even when our software does not cause these problems, the existence of these errors might cause us to incur significant costs, divert the attention of our technical personnel from our product development efforts, impact our reputation, or cause significant customer relations problems.\nTechnology and customer requirements evolve rapidly in our industry, and if we do not continue to develop new products and enhance our existing products in response to these changes, our business could suffer.\nWe will need to continue to enhance our products in order to maintain our competitive position. We may not be successful in developing and marketing enhancements to our products on a timely basis, and any enhancements we develop may not adequately address the changing needs of the marketplace. Overlaying the risks associated with our existing products and enhancements are ongoing technological developments and rapid changes in customer requirements. Our future success will depend upon our ability to develop and introduce, in a timely manner, new products that take advantage of technological advances and respond to new customer requirements. The development of new products is increasingly complex and uncertain, which increases the risk of delays. We may not be successful in developing new products and incorporating new technology on a timely basis, and any new products may not adequately address the changing needs of the marketplace. Failure to develop new products and product enhancements that meet market needs in a timely manner could have a material adverse effect on our business, financial condition and operating results.\nIf we are unable to protect our proprietary technology and other intellectual property rights, our ability to compete in the marketplace may be substantially reduced.\nIf we are unable to protect our intellectual property, our competitors could use our intellectual property to market products similar to our products, which could decrease demand for such products, thus decreasing our revenue. We rely on a combination of copyright, trademark and trade secret laws, as well as licensing agreements, third-party non-disclosure agreements and other contractual measures to protect our intellectual property rights. These protections may not be adequate to prevent our competitors from copying or reverse engineering our products. Our competitors may independently develop technologies that are substantially similar or superior to our technology. To protect our trade secrets and other proprietary information, we require employees, consultants, advisors and collaborators to enter into confidentiality agreements. These agreements may not provide meaningful protection for our trade secrets, know-how or other proprietary information in the event of any unauthorized use, misappropriation or disclosure of such trade secrets, know-how or other proprietary information. The protective mechanisms we include in our products may not be sufficient to prevent unauthorized copying. Existing copyright laws afford only limited protection for our intellectual property rights and may not protect such rights in the event competitors independently develop similar products. In addition, the laws of some countries in which our products are or may be licensed do not protect our products and intellectual property rights to the same extent as do the laws of the United States.\nPolicing unauthorized use of our products is difficult and litigation could become necessary in the future to enforce our intellectual property rights. Any litigation could be time consuming and expensive to prosecute or resolve, result in substantial diversion of management attention and resources, and materially harm our business or financial condition.\nIf a third party asserts that we infringe upon its proprietary rights, we could be required to redesign our products, pay significant royalties or enter into license agreements.\nClaims of infringement are becoming increasingly common as the software industry continues to develop and as related legal protections, including but not limited to patents, are applied to software products. Although we do not believe that our products infringe on the rights of third parties, a third party may assert that our technology or technologies of entities we acquire violates its intellectual property rights. As the number of software products in our markets increases, and the functionality of these products further overlap, we believe that infringement claims will become more common. Any claims against us, regardless of their merit, could:\n●\nbe expensive and time consuming to defend;\n●\nresult in negative publicity;\n●\nforce us to stop licensing our products that incorporate the challenged intellectual property;\n●\nrequire us to redesign our products;\n●\ndivert managements attention and our other resources; and/or\n●\nrequire us to enter into royalty or licensing agreements in order to obtain the right to use necessary technologies, which may not be available on terms acceptable to us, if at all.\nWe believe that any successful challenge to our use of a trademark or domain name could substantially diminish our ability to conduct business in a particular market or jurisdiction and thus decrease our revenue and result in possible losses to our business.\nIncreasing government regulation could affect our business and may adversely affect our financial condition.\nWe are subject not only to regulations applicable to businesses generally, but also to laws and regulations directly applicable to electronic commerce. In addition, an inability to satisfy the standards of certain voluntary third-party certification bodies that our customers may expect, such as an attestation of compliance with the Payment Card Industry (PCI) Data Security Standards, may have an adverse impact on our business and results. Further, there are various statutes, regulations, and rulings relevant to the direct email marketing and text-messaging industries, including the Telephone Consumer Protection Act (TCPA), the CAN-SPAM Act and related Federal Communication Commission (FCC) orders. The interpretation of many of these statutes, regulations, and rulings is evolving in the courts and administrative agencies and an inability to comply may have an adverse impact on our business and results. If in the future we are unable to achieve or maintain industry-specific certifications or other requirements or standards relevant to our customers, it may harm our business and adversely affect our results.\nWe may also expand our business in countries that have more stringent data protection laws than those in the United States, and such laws may be inconsistent across jurisdictions and are subject to evolving and differing interpretations. In particular, the European Union has passed the General Data Protection Regulation (GDPR), which came into force on May 25, 2018. The GDPR includes more stringent operational requirements for entities that receive or process personal data (as compared to U.S. privacy laws and previous EU laws), along with significant penalties for non-compliance, more robust obligations on data processors and data controllers, greater rights for data subjects, and heavier documentation requirements for data protection compliance programs. Additionally, both laws regulating privacy and third-party products purporting to address privacy concerns could negatively affect the functionality of, and demand for, our products and services, thereby reducing our revenue.\nGeneral Risk Factors\nOur revenue and quarterly results may fluctuate, which could adversely affect our stock price.\nWe have experienced, and may in the future experience, significant fluctuations in our quarterly operating results that may be caused by many factors. These factors include, among others:\n●\nchanges in demand for our products;\n●\nintroduction, enhancement or announcement of products by us or our competitors;\n●\nmarket acceptance of our new products;\n●\nthe growth rates of certain market segments in which we compete;\n●\nsize and timing of significant orders;\n●\nbudgeting cycles of customers;\n●\nmix of products and services sold;\n●\nchanges in the level of operating expenses;\n●\ncompletion or announcement of acquisitions; and\n●\ngeneral economic conditions in regions in which we conduct business.\nIf we are unable to manage our future growth efficiently, our business, liquidity, revenues and profitability may suffer.\nWe anticipate that continued expansion of our core business will require us to address potential market opportunities. For example, we may need to expand the size of our research and development, sales, corporate finance or operations staff. There can be no assurance that our infrastructure will be sufficiently flexible and adaptable to manage our projected growth or that we will have sufficient resources, human or otherwise, to sustain such growth. If we are unable to adequately address these additional demands on our resources, our profitability and growth might suffer. Also, if we continue to expand our operations, management might not be effective in expanding our physical facilities and our systems, and our procedures or controls might not be adequate to support such expansion. Our inability to manage our growth could harm our business and decrease our revenues.\nThere may be a limited market for our common stock, which may make it more difficult for you to sell your stock and which may reduce the market price of our common stock.\nThe average shares traded per day in fiscal 2023 was approximately 56,000 shares per day compared to approximately 286,000 for fiscal 2022, and 2,839,000 for fiscal 2021. Our average trading volume of our common stock can be very sporadic and may impair the ability of holders of our common stock to sell their shares at the time they wish to sell them or at a price that they consider reasonable. A low trading volume may also reduce the fair market value of the shares of our common stock. Accordingly, there can be no assurance that the price of our common stock will reflect our actual value. There can be no assurance that the daily trading volume of our common stock will increase or improve.\nThe market price of our common stock is volatile, which could adversely affect your investment in our common stock.\nThe market price of our common stock is volatile and could fluctuate significantly for many reasons, including, without limitation: as a result of the risk factors listed in this Annual Report on Form 10-K; actual or anticipated fluctuations in our operating results; and general economic and industry conditions. During fiscal 2023, the closing price of our common stock as reported by the Nasdaq Capital Market fluctuated between $0.82 and $1.42. We are required to meet certain financial criteria in order to maintain our listing on the Nasdaq Capital Market. One such requirement is that we maintain a minimum closing bid price of at least $1.00 per share for our common stock. If we fail this requirement then Nasdaq will issue a notice that we are not in compliance and we will need to take corrective actions in order to not be delisted. Such corrective actions could include a reverse stock split, which may adversely affect the liquidity of our common stock. Additionally, there is no way to guarantee that such a measure, if implemented, would help us regain compliance with Nasdaq's minimum bid price requirement or maintain compliance with its other listing rules.\nWe are dependent upon our management team and the loss of any of these individuals could harm our business.\nWe are dependent on the efforts of our key management personnel. The loss of any of our key management personnel, or our inability to recruit and train additional key management and other personnel in a timely manner, could materially and adversely affect our business, operations and future prospects. We maintain a key man insurance policy covering our Chief Executive Officer.\nOur business can be impacted by geopolitical events, trade and other international disputes, war, terrorism, natural disasters, public health issues, and other business interruptions.\nGeopolitical events, trade and other international disputes, war, terrorism, natural disasters, public health issues, and other business interruptions can adversely impact international commerce and the global economy, and could have a material adverse effect on our business, customers, employees, and partners.\nBecause competition for highly qualified personnel is intense, we might not be able to attract and retain the employees we need to support our planned growth.\nWe will need to increase the size and maintain the quality of our sales force, software development staff and professional services organization to execute our growth plans. To meet our objectives, we must attract and retain highly qualified personnel with specialized skill sets. Competition for qualified personnel can be intense, and we might not be successful in attracting and retaining them. Our ability to maintain and expand our sales, product development and professional services teams will depend on our ability to recruit, train and retain top quality people with advanced skills who understand sales to, and the specific needs of, our target customers. For these reasons, we have experienced, and we expect to again experience in the future, challenges in hiring and retaining highly skilled employees with appropriate qualifications for our business. In addition to hiring services personnel to meet our needs, we may also engage additional third-party consultants as contractors, which could have a negative impact on our financial results. If we are unable to hire or retain qualified personnel, or if newly hired personnel fail to develop the necessary skills or reach productivity slower than anticipated, it would be more difficult for us to sell our products and services, and we could experience a shortfall in revenue and fail to achieve our planned growth.\nAcquisitions may be difficult to integrate into our existing operations, may disrupt our business, dilute stockholder value, divert managements attention, or negatively affect our operating results.\nWe have acquired multiple businesses since our inception in 2000, including two in fiscal 2021. Acquisitions could involve substantial investment of funds or financings by issuance of debt or equity securities and could result in one-time charges and expenses and have the potential to either dilute the interests of existing stockholders or result in the issuance or assumption of debt. Any such acquisition may not be successful in generating revenues, income or other returns to us, and the resources committed to such activities will not be available to us for other purposes. Moreover, if we are unable to access capital markets on acceptable terms or at all, we may not be able to consummate acquisitions, or may have to do so based upon less than optimal capital structure. Our inability to take advantage of growth opportunities for our business or to address risks associated with acquisitions or investments in businesses may negatively affect our operating results. Additionally, any impairment of goodwill or other intangible assets acquired in an acquisition or in an investment, or charges to earnings associated with any acquisition or investment activity, may materially reduce our earnings which, in turn, may have a material adverse effect on the price of our common stock.\nWe have issued preferred stock with rights senior to our common stock, and may issue additional preferred stock in the future, in order to consummate a merger or other transaction necessary to continue as a going concern.\nOur Certificate of Incorporation authorizes the issuance of up to 1,000,000 shares of preferred stock, par value $0.001 per share, without stockholder approval and on terms established by our board of directors, of which 264,000 shares have been designated as Series A Preferred, 5,000 shares have been designated as Series B Preferred, 11,000 shares have been designated as Series C Preferred and 4,200 shares have been designated as Series D Preferred. We may issue additional shares of preferred stock in order to consummate a financing or other transaction, in lieu of the issuance of common stock. The rights and preferences of any such class or series of preferred stock would be established by our board of directors in its sole discretion and may have dividend, voting, liquidation and other rights and preferences that are senior to the rights of our common stock.\nWe have never paid dividends on our common stock and we do not anticipate paying dividends in the future.\nWe have never paid cash dividends and do not believe that we will pay any cash dividends on our common stock in the future. Since we have no plan to pay cash dividends, an investor would only realize income from their investment in our shares if there is an increase in the market price of our common stock, which is uncertain and unpredictable.\nWe are also subject to anti-takeover provisions under Delaware law, which could delay or prevent a change of control. Together these provisions may make the removal of management more difficult and may discourage transactions that otherwise could involve payment of a premium over prevailing market prices for our securities. Provisions in our amended and restated bylaws and Delaware law may have the effect of discouraging lawsuits against our directors and officers.\nOur amended and restated bylaws require that derivative actions brought in our name, actions against our directors, officers, other employees or stockholders for breach of fiduciary duty and other similar actions may be brought only in the Court of Chancery in the State of Delaware. Any person or entity purchasing or otherwise acquiring any interest in shares of our capital stock shall be deemed to have notice of and consented to the forum provisions in our amended and restated bylaws.\nThis choice of forum provision may limit a stockholders ability to bring a claim in a judicial forum that it finds favorable for disputes with us or any of our directors, officers, other employees or stockholders, which may discourage lawsuits with respect to such claims. Alternatively, if a court were to find the choice of forum provision contained in our amended and restated bylaws to be inapplicable or unenforceable in an action, we may incur additional costs associated with resolving such action in other jurisdictions, which could harm our business, operating results and financial condition. Item 1B. Unresolved Staff Comments.\nNone.\nItem 1C. Cybersecurity.\nNot applicable. Item 2. Properties.\nThe following table lists our office locations, all of which are leased:\nGeographic Location\nAddress\nDescription\nWoburn, Massachusetts\n100 Sylvan Rd, Suite G-700\nWoburn, MA 01801\nProfessional office space\nWoodbury, New York\n150 Woodbury Road\nWoodbury, NY 11797\nProfessional office space\nRosemont, Illinois\n5600 North River Rd, Suite 100\nRosemont, IL 60018\nProfessional office space\nAtascadero, California\n6225 Atascadero Ave\nAtascadero, CA 93422\nProfessional office space\nOntario, Canada\nPerth Mews RO\nPerth, ON K7H 3A0, Canada\nPO Box\nBrussels, Belgium\nCours Saint Michel 30B\n1040 Etterbeek\nBrussels, Belgium\nProfessional office space\nProfessional office space is of varying size, ranging up to approximately 3,600 square feet. Item 3. Legal Proceedings.\nFrom time to time, we are subject to ordinary routine litigation and claims incidental to our business. We are not currently involved in any legal proceedings that we believe are material. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur common stock is currently traded on the Nasdaq Capital Market under the trading symbol BLIN.\nNumber of Stockholders\nAs of December 27, 2023, we had approximately 60 stockholders of record. Since many stockholders choose to hold their shares under the name of their brokerage firm, we estimate that the actual number of stockholders was over 6,000.\nDividend Policy\nWe have not declared or paid cash dividends on our common stock and do not plan to pay cash dividends to our common stockholders in the near future.\nRecent Sales of Unregistered Securities; Use of Proceeds From Registered Securities\nThere were no sales of unregistered or registered equity securities during the fiscal year ended September 30, 2023. Item 6. [Reserved].\nNot applicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThis section contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of a variety of factors and risks, including the impact of any weakness in the U.S. and international economies on our business, our inability to manage our future growth effectively or profitably, fluctuations in our revenue and quarterly results, our license renewal rate, the impact of competition and our ability to maintain margins or market share, the limited market for our common stock, the ability to maintain our listing on the Nasdaq Capital Market, the volatility of the market price of our common stock, the ability to raise capital, the performance of our products, our ability to respond to rapidly evolving technology and customer requirements, our ability to protect our proprietary technology, the security of our software and response to cyber security risks, our ability to meet our financial obligations and commitments, our dependence on our management team and key personnel, our ability to hire and retain future key personnel, our ability to maintain an effective system of internal controls, or our ability to respond to government regulations. These and other risks are more fully described herein and in our other filings with the Securities and Exchange Commission.\nThis section should be read in combination with the accompanying audited consolidated financial statements and related notes prepared in accordance with United States generally accepted accounting principles (GAAP).\nOverview\nBridgeline Digital is a marketing technology company that offers a suite of products that help companies grow online revenue and share information with customers, partners, and employees.\nAll of Bridgelines software is available through a cloud-based Software as a Service (SaaS) model, whose flexible architecture provides customers hosting and support. Additionally, Unbound and HawkSearch have the option to be available via a traditional perpetual licensing business model, in which the software can reside on a dedicated infrastructure either on premise at the customers facility, or manage-hosted by Bridgeline via a cloud-based, dedicated hosted services model.\nBridgeline's product offerings include:\nHawkSearch: a site search, recommendation, and personalization software application, built for marketers, merchandisers, and developers to enhance, normalize, and enrich an online customer's content search and product discovery experience.\nCelebros Search: a commerce-oriented site search product that provides Natural Language Processing with artificial intelligence to present relevant search results based on long-tail keyword searches.\nWoorank: a Search Engine Optimization (SEO) audit tool that generates an instant performance audit of the sites technical, on-page, and off-page SEO.\nUnbound: a Digital Experience Platform that includes Web Content Management, eCommerce, Digital Marketing, and Web Analytics.\nTruPresence: a web content management and eCommerce platform that supports the needs of multi-unit organizations and franchises.\nOrchestraCMS: the only content and digital experience platform built 100% native on Salesforce and helps customers create websites and intranets for their customers, partners, and employees.\nSales and Marketing\nBridgeline employs a direct sales force, which focuses its efforts on selling to mid-sized and large companies. These companies are generally categorized in the following vertical markets:\n●\nAssociations and Foundations\n● Banks and Credit Unions\n●\neCommerce Retailers\n● Franchises & Enterprises\n● Health Services and Life Sciences\n●\nIndustrial Distribution and Wholesale\n●\nManufacturers\n●\nTechnology\nEach of the Bridgeline companies goes to market through two main types of partnerships. The first partner category includes platforms such as Adobe, BigCommerce, Optimizely, Sitefinity, Shopify and others. The Bridgeline software often embeds directly into these platforms through connectors and SDK solutions that Bridgeline develops in concert with each platform. The second category includes web-development agencies which typically have deep relationships with end-customers and have the technical expertise to implement the Bridgeline software solutions according to client needs, platform requirements, and industry standards.\nGoodwill and Intangible Asset Impairment\nDuring the year ended September 30, 2023, the Company recognized a goodwill impairment charge of $7.5 million. There were no goodwill impairment charges recognized during the year ended September 30, 2022.\nAcquisitions\nBridgeline will continue to evaluate expanding its distribution of its suite of products and interactive development capabilities through acquisitions. We may make additional acquisitions in the foreseeable future. These potential acquisitions will be consistent with our growth strategy by providing Bridgeline with new geographical distribution opportunities, an expanded customer base, an expanded sales force and an expanded developer force. In addition, integrating acquired companies into our existing operations allows us to consolidate the finance, human resources, legal, marketing, and research and development of the acquired businesses with our own internal resources. This integration may reduce the aggregate of such expenses for the combined businesses and similarly improve operating results.\nCustomer Information\nWe currently have over 2,000 active customers. For the years ended September 30, 2023 and 2022, no customers exceeded 10% of the Companys total revenue.\nSummary of Results of Operations\nTotal revenue for the fiscal year ended September 30, 2023 (fiscal 2023) decreased to $15.9 million from $16.8 million for the fiscal year ended September 30, 2022 (fiscal 2022). The loss from operations for fiscal 2023 was $9.9 million, compared with a loss from operations of $1.9 million for fiscal 2022. We had a net loss for fiscal 2023 of $9.4 million, which included income of approximately $0.6 million as a result of the change in fair value of certain warrant liabilities, and a goodwill impairment charge of $7.5 million in fiscal 2023, compared with a net income of $2.1 million, which included income of approximately $3.7 million as a result of the change in fair value of certain warrant liabilities fiscal 2022. Basic net loss per share attributable to common stockholders for fiscal 2023 was $(0.91) compared with the equivalent basic net income per share attributable to common stockholders of $0.21 for fiscal 2022. Diluted net loss per share attributable to common stockholders for fiscal 2023 was $(0.91) compared with the equivalent diluted net income per share attributable to common stockholders of $0.20 for fiscal 2022.\n(in thousands)\nYear Ended September 30,\n$\n%\n%\n%\nChange\nChange\nNet Revenue\nSubscription and perpetual licenses\n$ 12,742\n80%\n$ 13,560\n81%\n$ (818 )\n(6)%\nDigital engagement services\n3,143\n20%\n3,259\n19%\n(116 )\n(4)%\nTotal net revenue\n15,885\n16,819\n(934 )\n(6)%\nCost of revenue\nSubscription and perpetual licenses\n3,364\n26%\n3,358\n25%\n0%\nDigital engagement services\n1,650\n52%\n1,759\n54%\n(109 )\n(6)%\nTotal cost of revenue\n5,014\n32%\n5,117\n30%\n(103 )\n(2)%\nGross profit\n10,871\n68%\n11,702\n70%\n(831 )\n(7)%\nOperating expenses\nSales and marketing\n4,757\n30%\n5,232\n31%\n(475 )\n(9)%\nGeneral and administrative\n3,173\n20%\n3,387\n20%\n(214 )\n(6)%\nResearch and development\n3,679\n23%\n3,217\n19%\n14%\nDepreciation and amortization\n1,528\n10%\n1,599\n10%\n(71 )\n(4)%\nGoodwill impairment\n7,517\n47%\n-\n0%\n7,517\nN/A\nRestructuring and acquisition related expenses\n1%\n1%\n(32 )\n(20)%\nTotal operating expenses\n20,786\n13,599\n7,187\n53%\nLoss from operations\n(9,915 )\n(1,897 )\n(8,018 )\n423%\nChange in fair value of contingent consideration, interest expense and other, net\n(189 )\n(606 )\n(145)%\nChange in fair value of warrant liabilities\n3,655\n(3,080 )\n(84)%\nIncome (loss) before income taxes\n(9,529 )\n2,175\n(11,704 )\n(538)%\nProvision for (benefit from) income taxes\n(94 )\n(124 )\n(413)%\nNet (loss) income\n$ (9,435 )\n$ 2,145\n$ (11,580 )\n(540)%\nNon-GAAP Measure:\nAdjusted EBITDA\n$ (309 )\n$\n$ (505 )\n(258)%\nRevenue\nOur revenue is derived from two sources: (i) Subscription and Perpetual licenses and (ii) Digital Engagement Services.\nSubscription and Perpetual Licenses\nRevenue from Subscription and perpetual licenses decreased $0.8 million, or 6%, to $12.7 million in fiscal 2023 from $13.6 million in fiscal 2022. The decrease compared to the prior period included a reduction in revenue from a particular customer. Subscription and perpetual license revenue as a percentage of total revenue decreased to 80% in fiscal 2023 from 81% in fiscal 2022.\nDigital Engagement Services\nDigital engagement services revenue is comprised of implementation and retainer-related services. Total revenue from digital engagement services of $3.1 million in fiscal 2023 decreased 4% from $3.3 million in fiscal 2022. Digital engagement services revenue as a percentage of total revenue increased to 20% in fiscal 2023 from 19% in fiscal 2022.\nCost of Revenue\nTotal cost of revenue for fiscal 2023 of $5.0 million decreased $0.1 million, or 2% compared to the prior period.\nCost of Subscription and Perpetual License\nCost of subscription and perpetual licenses of $3.4 million in fiscal 2023 increased slightly from fiscal 2022. The increase in cost of subscription and perpetual licenses in fiscal 2023 compared to fiscal 2022 is primarily due to higher costs to operate our cloud-based hosting model with Amazon Web Services, offset by a decrease in personnel costs. The cost of subscription and perpetual licenses as a percentage of subscription and perpetual license revenue increased to 26% in fiscal 2023 from 25% in fiscal 2022. These increases are primarily due to the overall decrease in subscription and perpetual license revenue.\nCost of Digital Engagement Services\nCost of digital engagement services decreased 6%, to $1.7 million in fiscal 2023 from $1.8 million in fiscal 2022. The cost of total digital engagement services as a percentage of total digital engagement services revenue decreased to 52% in fiscal 2023 from 54% in fiscal 2022. These decreases are primarily due to the overall decrease in personnel costs.\nGross Profit\nGross profit of $10.9 million decreased $0.8 million, or 7%, in fiscal 2023 compared to $11.7 million for fiscal 2022. The gross profit margin decreased to 68% for fiscal 2023 compared to 70% for fiscal 2022. The decrease in the gross profit margin for fiscal 2023 compared to fiscal 2022 is primarily attributable to the decrease in the proportion of subscription and perpetual license revenue, which is generally associated with higher margins, to digital engagement service revenue.\nOperating Expenses\nSales and Marketing Expenses\nSales and marketing expenses of $4.8 million in fiscal 2023 decreased $0.5 million, or 9%, from $5.2 million in fiscal 2022. Sales and marketing expense as a percentage of total revenue decreased to 30% in fiscal 2023 compared to 31% in fiscal 2022. The decrease compared to the prior period is primarily attributable to lower personnel costs and marketing spend on leads and conferences.\nGeneral and Administrative Expenses\nGeneral and administrative expenses of $3.2 million in fiscal 2023 decreased $0.2 million, or 6%, from $3.4 million in fiscal 2022. General and administrative expense as a percentage of revenue was 20% in fiscal 2023 and fiscal 2022. These decreases are primarily due to lower personnel costs.\nResearch and Development\nResearch and development expense of $3.7 million in fiscal 2023 increased $0.5 million, or 14%, from $3.2 million in fiscal 2022. Research and development expense as a percentage of total revenue increased to 23% in fiscal 2023 compared to 19% for fiscal 2022. These increases compared to the prior period are primarily attributable to higher personnel costs.\nDepreciation and Amortization\nDepreciation and amortization expense of $1.5 million in fiscal 2023 decreased by $0.1 million, or 4%, from $1.6 million in fiscal 2022. Depreciation and amortization as a percentage of total revenue remained consistent at 10% in fiscal 2023 and 2022.\nGoodwill Impairment\nDuring the year ended September 30, 2023, the Company recognized a goodwill impairment charge of $7.5 million. There were no goodwill impairment charges recognized during the year ended September 30, 2022.\nRestructuring and Acquisition Related Expenses\nRestructuring and acquisition related expenses was $0.1 million in fiscal 2023, compared to $0.2 million in fiscal 2022. During fiscal 2023 expenses incurred were related to severance and merger and acquisition costs and during fiscal 2022 expenses incurred were related to further acquisition integrations.\nLoss from Operations\nThe loss from operations was $9.9 million for fiscal 2023 compared to a loss from operations of $1.9 million for fiscal 2022, a decrease of $8.0 million or 423%.\nChange in fair value of contingent consideration, interest expense and other, net\nThe change in fair value of contingent consideration, interest expense and other, net, was $0.2 million of expense in fiscal 2023, which primarily consisted of non-recurring non-operating costs, compared to $0.4 million of income in fiscal 2022, which primarily consisted of the change in fair value of contingent consideration.\nChange in fair value of warrant liabilities\nThe Company recognized a gain related to the change in fair value of warrant liabilities of $0.6 million for fiscal 2023, and a gain related to the change in fair value of warrant liabilities of $3.7 million for fiscal 2022.\nProvision for Income Taxes\nThe provision for (benefit from) income taxes was ($94) thousand for fiscal 2023 and $30 thousand for fiscal 2022. Income tax expense consists of estimated liability for federal and state income taxes owed by the Company. Net operating loss (NOL) carryforwards are estimated to be sufficient to offset any potential taxable income for all periods presented. A valuation allowance is established if it is more likely than not that all or a portion of the deferred tax asset will not be realized. The Company maintains a valuation allowance against its net deferred tax assets. As of September 30, 2023 and 2022, the Company had a valuation allowance on its net deferred tax assets of $10.8 million and $10.5 million, respectively.\nThe Federal NOL carryforward is approximately $37.3 million as of September 30, 2023 of which $29.6 million is subject to the 20-year carryforward and expire on various dates through 2038. The remaining federal NOL carryforward of $7.7 million is indefinite. Net operating losses incurred after December 31, 2017 carry forward indefinitely. Internal Revenue Code Section 382 places certain limitations on the amount of taxable income that can be offset by NOL carryforwards after a change in control of a loss corporation. Generally, after a change in control, a loss corporation cannot deduct NOL carryforwards in excess of the Section 382 limitation. Due to these change of ownership provisions, utilization of NOL carryforwards may be subject to an annual limitation on utilization against taxable income in future periods. The Company has not performed a Section 382 analysis. However, if performed, Section 382 may be found to limit potential future utilization of our NOL carryforwards. The Company also has approximately $45.4 million in state NOLs which expire on various dates through 2041.\nThe acquisition of HawkSearch during the third quarter of fiscal 2021 resulted in the recognition of deferred tax liabilities of approximately $1.2 million related to intangible assets. Prior to the business combination, the Company had a full valuation allowance on its net deferred tax assets. The deferred tax liabilities generated from the business combination netted against the Companys pre-existing deferred tax assets. Consequently, the impact of such resulted in the release of $1.2 million of the pre-existing valuation allowance against the deferred tax assets and corresponding deferred tax benefit recognized during fiscal 2021.\nWe recognize deferred tax assets for stock-based awards that result in deductions on our income tax returns, based on the amount of stock-based compensation recognized and the statutory tax rate in the jurisdiction in which we will receive a tax deduction.\nAdjusted EBITDA\nWe also measure our performance based on a non-GAAP (Generally Accepted Accounting Principles) measurement of earnings before interest, taxes, depreciation, amortization, stock-based compensation expense, impairment of goodwill and intangible assets, non-cash warrant related income/expense, other income and expenses, change in fair value of derivative instruments, change in fair value of contingent consideration, and restructuring and acquisition related charges (Adjusted EBITDA).\nWe believe this non-GAAP financial measure of Adjusted EBITDA is useful to management and investors in evaluating our operating performance for the periods presented and provides a tool for evaluating our ongoing operations.\nAdjusted EBITDA, however, is not a measure of operating performance under accounting principles generally accepted in the United States of America (U.S. GAAP) and should not be considered as an alternative or substitute for U.S. GAAP profitability measures such as (i) income from operations and net income, or (ii) cash flows from operating, investing and financing activities, both as determined in accordance with U.S. GAAP. Adjusted EBITDA as an operating performance measure has material limitations because it excludes the financial statement impact of income taxes, net interest expense, amortization of intangibles, depreciation, goodwill impairment, restructuring charges, acquisition related expenses, loss on disposal of assets, other amortization, changes in fair value of warrant liabilities, changes in fair value of contingent consideration and stock-based compensation, and therefore does not represent an accurate measure of profitability. As a result, Adjusted EBITDA should be evaluated in conjunction with net income (loss) for a complete analysis of our profitability, as net income (loss) includes the financial statement impact of these items and is the most directly comparable U.S. GAAP operating performance measure to Adjusted EBITDA. Our definition of Adjusted EBITDA may also differ from and therefore may not be comparable with similarly titled measures used by other companies, thereby limiting its usefulness as a comparative measure. Because of the limitations that Adjusted EBITDA has as an analytical tool, investors should not consider it in isolation, or as a substitute for analysis of our operating results as reported under U.S. GAAP.\nThe following table reconciles net income (loss) (which is the most directly comparable U.S. GAAP operating performance measure) to Adjusted EBITDA:\nYear Ended September 30,\nNet income (loss)\n$ (9,435 )\n$ 2,145\nProvision for income tax\n(94 )\nChange in fair value of contingent consideration, interest expense and other, net\n(417 )\nChange in fair value of warrants\n(575 )\n(3,655 )\nAmortization of intangible assets\n1,378\n1,487\nDepreciation and other amortization\nGoodwill impairment\n7,517\n-\nRestructuring and acquisition related charges\nStock-based compensation\nAdjusted EBITDA\n$ (309 )\n$\nLiquidity and Capital Resources\nCash Flows\nOperating Activities\nCash provided by operating activities was $0.3 million during fiscal 2023 compared to cash used in operating activities of $0.1 million during fiscal 2022. The change in cash used in operating activities compared to the prior period was primarily due to a decrease in net earnings and changes in non-cash items, including changes in fair value of warrant liabilities and goodwill impairment, and changes to accounts payable and accrued liabilities as well as deferred revenue.\nInvesting Activities\nCash used in investing activities was $25 thousand during fiscal 2023 compared to cash used in investing activities of $0.2 million during fiscal 2022. Cash used in investing activities during fiscal 2023 related primarily to purchases of property and equipment. Cash used in investing activities during fiscal 2022 was primarily related to capitalized software development costs and purchases of property and equipment.\nFinancing Activities\nCash used in financing activities was $0.6 million during fiscal 2023 compared with $5.5 million during fiscal 2022. Cash used in financing activities during both fiscal 2023 and fiscal 2022 was primarily related to payments of long-term debt and deferred purchase price and contingent consideration payments related to acquisitions completed during fiscal 2021.\nCapital Resources and Liquidity Outlook\nThe Company has historically incurred operating losses and used cash on hand and from financing activities to fund operations as well as develop new products. The Company believes that future revenues and cash flows will supplement its working capital and it has an appropriate cost structure to support future revenue growth.\nThe Company may offer and sell, from time to time, in one or more offerings, up to $50 million of its debt or equity securities, or any combination thereof. Such securities offerings may be made pursuant to the Companys currently effective registration statement on Form S-3 (File No. 333-262764), which was initially filed with the Securities and Exchange Commission on February 16, 2022 and declared effective on March 4, 2022 (the Shelf Registration). A complete description of the types of securities that the Company may sell is described in the Preliminary Prospectus contained in the Shelf Registration. As of the date of the filing of this Quarterly Report, there are no active offerings for the sale or obligations to purchase any of the Companys securities pursuant to the Shelf Registration. There can be no assurances that the Company will offer any securities for sale or that if the Company does offer any securities that it will be successful in selling any portion of the securities offered on a timely basis if at all, or on terms acceptable to us. Further, our ability to offer or sell such securities may be limited by rules of the Nasdaq Stock Market.\nOff-Balance Sheet Arrangements\nAt this time, the Company does not have any off-balance sheet arrangements, financings or other relationships with unconsolidated entities or other persons, other than our operating leases.\nContractual Obligations\nWe lease all of our office locations. The gross obligations for operating leases and subleases is $0.4 million of which $0.2 million is expected in the next twelve months. Debt payments on the Companys various debt obligations total $0.7 million of which $0.3 million is expected to be paid in the next twelve months.\nCritical Accounting Policies and Estimates\nThese critical accounting policies and estimates by our management should be read in conjunction with Note 2, Summary of Significant Accounting Policies to the Consolidated Financial Statements that were prepared in accordance with U.S. GAAP.\nThe preparation of consolidated financial statements in accordance with U.S. GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses in the reporting periods. We regularly make estimates and assumptions that affect the reported amounts of assets and liabilities. The most significant estimates included in our consolidated financial statements are the valuation of accounts receivable and long-term assets, including intangibles, goodwill and deferred tax assets, stock-based compensation, amounts of revenue to be recognized on service contracts in progress, unbilled receivables, and deferred revenue. We base our estimates and assumptions on current facts, historical experience and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. The actual results experienced by us may differ materially and adversely from our estimates. To the extent there are material differences between our estimates and the actual results, our future results of operations will be affected.\nWe consider the following accounting policies to be both those most important to the portrayal of our financial condition and those that require the most subjective judgment:\n●\nRevenue recognition;\n●\nAllowance for doubtful accounts;\n●\nAccounting for goodwill and other intangible assets;\n●\nAccounting for business combinations;\n● Accounting for common stock purchase warrants; and\n●\nAccounting for stock-based compensation.\nRevenue Recognition\nOverview\nThe Company derives its revenue from two sources: (i) Subscription and Perpetual Licenses, which are comprised of software subscription fees (SaaS), perpetual software licenses, and maintenance for post-customer support (PCS) on perpetual licenses, and (ii) Digital Engagement Services, which are professional services to implement our products such as web development, digital strategy, information architecture and usability engineering search. Customers who license the software on a subscription basis, which can be described as Software as a Service or SaaS, do not take possession of the software.\nRevenue is recognized when control of these services is transferred to the Companys customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those services. If the consideration promised in a contract includes a variable amount, for example, overage fees, contingent fees or service level penalties, the Company includes an estimate of the amount it expects to receive for the total transaction price if it is probable that a significant reversal of cumulative revenue recognized will not occur. The Companys subscription service arrangements are non-cancelable and do not contain refund-type provisions. Revenue is reported net of applicable sales and use tax.\nThe Company recognizes revenue from contracts with customers using a five-step model, which is described below:\n1.\nIdentify the customer contract;\n2.\nIdentify performance obligations that are distinct;\n3.\nDetermine the transaction price;\n4.\nAllocate the transaction price to the distinct performance obligations; and\n5.\nRecognize revenue as the performance obligations are satisfied.\n1.\nIdentify the customer contract - A customer contract is generally identified when there is approval and commitment from both the Company and its customer, the rights have been identified, payment terms are identified, the contract has commercial substance and collectability and consideration is probable.\n2.\nIdentify performance obligations that are distinct - A performance obligation is a promise to provide a distinct good or service or a series of distinct goods or services. A good or service that is promised to a customer is distinct if the customer can benefit from the good or service either on its own or together with other resources that are readily available to the customer, and the Companys promise to transfer the good or service to the customer is separately identifiable from other promises in the contract.\n3.\nDetermine the transaction price - The transaction price is the amount of consideration to which the Company expects to be entitled in exchange for transferring goods or services to a customer, excluding sales taxes that are collected on behalf of government agencies.\n4.\nAllocate the transaction price to distinct performance obligations - The transaction price is allocated to each performance obligation based on the relative standalone selling prices (SSP) of the goods or services being provided to the customer. The Company determines the SSP of its goods and services based upon the historical average sales prices for each type of software license and professional services sold.\n5.\nRecognize revenue as the performance obligations are satisfied - Revenue is recognized when or as control of the promised goods or services is transferred to customers. Revenue from SaaS licenses is recognized ratably over the subscription period beginning on the date the license is made available to customers. Most subscription contracts are three-year terms. Customers who license the software on a perpetual basis receive rights to use the software for an indefinite time period and an option to purchase post-customer support (PCS). PCS revenue is recognized ratably on a straight-line basis over the period of performance and the perpetual license is recognized upon delivery. The Company also offers hosting services for those customers who purchase a perpetual license and do not want to run the software in their environment. Revenue from hosting is recognized ratably over the service period, ranging from one to three-year terms. The Company recognizes revenue from professional services as the services are provided.\nCustomer Payment Terms\nPayment terms with customers typically require payment 30 days from invoice date. Payment terms may vary by customer but generally do not exceed 45 days from invoice date. Invoicing for digital engagement services are either monthly or upon achievement of milestones and payment terms for such billings are within the standard terms described above. Invoices for subscriptions and hosting are typically issued monthly and are generally due in the month of service. The Companys subscription and hosting agreements provide for refunds when service is interrupted for an extended period of time and are reserved for in the month in which they occur, if necessary.\nOur digital engagement services agreements with customers do not provide for any refunds for services or products and therefore no specific reserve for such is maintained. In the infrequent instances where customers raise a concern over delivered products or services, we have endeavored to remedy the concern and all costs related to such matters have been insignificant in all periods presented.\nWarranty\nCertain arrangements include a warranty period, which is generally 30 days from the completion of work. In hosting arrangements, we provide warranties of up-time reliability. We continue to monitor the conditions that are subject to the warranties to identify if a warranty claim may arise. If we determine that a warranty claim is probable, then any related cost to satisfy the warranty obligation is estimated and accrued. Warranty claims to date have been immaterial.\nAllowance for Doubtful Accounts\nWe maintain an allowance for doubtful accounts which represents estimated losses resulting from the inability, failure or refusal of our clients to make required payments.\nWe analyze historical percentages of uncollectible accounts and changes in payment history when evaluating the adequacy of the allowance for doubtful accounts. We use an internal collection effort, which may include our sales and services groups as we deem appropriate. Although we believe that our allowances are adequate, if the financial condition of our clients deteriorates, resulting in an impairment of their ability to make payments, or if we underestimate the allowances required, additional allowances may be necessary, resulting in increased expense in the period in which such determination is made.\nAccounting for Goodwill and Intangible Assets\nGoodwill is tested for impairment annually during the fourth quarter of every fiscal year and more frequently if events and circumstances indicate that the asset might be impaired. The purpose of an impairment test is to identify any potential impairment by comparing the carrying value of a reporting unit including goodwill to its fair value. An impairment charge is recognized for the amount by which the carrying amount exceeds the reporting units fair value; however, the loss recognized should not exceed the total amount of goodwill allocated to that reporting unit.\nFactors that could lead to a future impairment include material uncertainties such as operational, economic and competitive factors specific to the key assumptions underlying the fair value estimate we use in our impairment testing that have a reasonable possibility of changing. This could include a significant reduction in projected revenues, a deterioration of projected financial performance, future acquisitions and/or mergers, and a decline in our market value as a result of a significant decline in our stock price.\nAccounting for Business Combinations\nThe Company allocates the amount it pays for each acquisition to the assets acquired and liabilities assumed based on their fair values at the date of acquisition, including identifiable intangible assets which arise from a contractual or legal right or are separable from goodwill. The Company bases the fair value of identifiable intangible assets acquired in a business combination on detailed valuations that use information and assumptions provided by management, which consider managements best estimates of inputs and assumptions that a market participant would use. The Company allocates any excess purchase price that exceeds the fair value of the net tangible and identifiable intangible assets acquired to goodwill. The use of alternative valuation assumptions, including estimated growth rates, cash flows and discounts rates and estimated useful lives could result in different purchase price allocations and amortization expense in current and future periods. Transaction costs associated with these acquisitions are expensed as incurred through general and administrative expense on the consolidated statements of operations. In those circumstances where an acquisition involves a contingent consideration arrangement, the Company recognizes a liability equal to the fair value of the contingent payments expected to be made as of the acquisition date. The Company re-measures this liability each reporting period and recognizes changes in the fair value through income (loss) before income taxes within the consolidated statements of operations.\nAccounting for Common Stock Purchase Warrants\nThe Company evaluates common stock warrants as they are issued to determine whether they should be classified as an equity instrument or a liability. Those warrants that are classified as a liability are carried at fair value at each reporting period, with changes in their fair value recognized in change in fair value of warrant liabilities in the consolidated statements of operations. The fair value of the Companys warrant liabilities are valued utilizing Level 3 inputs. Warrant liabilities are valued using a Monte Carlo option-pricing model, which takes into consideration the volatilities of comparable public companies, due to the relatively low trading volume of the Companys common stock. The Monte Carlo option-pricing model uses certain assumptions, including expected life and annual volatility.\nAccounting for Stock-Based Compensation\nAt September 30, 2023, we maintained two stock-based compensation plans, one of which has expired but still contains vested stock options. The two plans are more fully described in Note 12 - Stockholders Equity of these consolidated financial statements.\nThe Company accounts for stock-based compensation awards in accordance with ASC 718, Compensation-Stock Compensation. Share-based payments (to the extent they are compensatory) are recognized in our consolidated statements of operations based on their fair values.\nWe recognize stock-based compensation expense for share-based payments issued that are expected to vest on a straight-line basis over the service period of the award, which is generally three years. In determining whether an award is expected to vest, we use an estimated, forward-looking forfeiture rate based upon our historical forfeiture rate and reduce the expense over the recognition period. Estimated forfeiture rates are updated for actual forfeitures quarterly. We also consider, each quarter, whether there have been any significant changes in facts and circumstances that would affect our forfeiture rate. Although we estimate forfeitures based on historical experience, actual forfeitures in the future may differ. In addition, to the extent our actual forfeitures are different than our estimates, we recognize a true-up for the difference in the period that the awards vest, and such true-ups could materially affect our operating results.\nWe estimate the fair value of stock options using the Black-Scholes-Merton option valuation model. The fair value of an award is affected by our stock price on the date of grant as well as other assumptions, including the estimated volatility of our stock price over the term of the awards and the estimated period of time that we expect employees to hold their stock options. The risk-free interest rate assumption we use is based upon United States Treasury interest rates appropriate for the expected life of the awards. We use the historical volatility of our publicly traded options in order to estimate future stock price trends. In order to determine the estimated period of time that we expect employees to hold their stock options, we use historical trends of employee turnovers. Our expected dividend rate is zero since we do not currently pay cash dividends on our common stock and do not anticipate doing so in the foreseeable future. The aforementioned inputs entered into the option valuation model we use to fair value our stock awards are subjective estimates and changes to these estimates will cause the fair value of our stock awards and related stock-based compensation expense we recognize to vary.\nWe recognize deferred tax assets for stock-based awards that result in deductions on our income tax returns, based on the amount of stock-based compensation recognized and the statutory tax rate in the jurisdiction in which we will receive a tax deduction. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot required. Item 8. Financial Statements and Supplementary Data.\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of September 30, 2023 and 2022\nConsolidated Statements of Operations for the years ended September 30, 2023 and 2022\nConsolidated Statements of Comprehensive Income/(Loss) for the years ended September 30, 2023 and 2022\nConsolidated Statements of Stockholders Equity for the years ended September 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended September 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nBridgeline Digital, Inc.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheet of Bridgeline Digital, Inc. and Subsidiaries (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of operations, comprehensive income/(loss), stockholders equity and cash flows for each of the two years in the period ended September 30, 2023, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the two years in the period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing a separate opinion on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of Goodwill and Intangible Assets\nAs described in Notes 6 and 7 to the consolidated financial statements, the carrying values of the Companys goodwill and intangible assets, net of accumulated amortization, was $8.5 million and $4.9 million, respectively, as of September 30, 2023.\nThe carrying value of goodwill is not amortized, but is tested for impairment annually as of September 30, as well as whenever events or changes in circumstances indicate that the carrying amount of a reporting unit may not be recoverable. Goodwill is assessed at the consolidated level as one reporting unit. The Company periodically reviews its long-lived assets, which includes its finite-lived intangible assets, for impairment whenever events or changes in circumstances indicate the carrying amount of such assets may exceed their fair value. During the quarter ended September 30, 2023, due to macro-economic conditions and a sustained decline in the Company's market capitalization, management determined a quantitative impairment test should be performed. Therefore management, with the assistance of an independent valuation expert, performed a quantitative test of impairment on goodwill and finite-lived intangible assets as of September 30, 2023. As a result, based on the quantitative assessment performed, the Company recognized a goodwill impairment charge of $7.5 million during the year ended September 30, 2023, and concluded that its finite-lived intangible assets were not impaired.\nGiven the determination of the fair value of goodwill and finite-lived intangible assets required significant judgment by management when developing the fair value estimate of the consolidated reporting unit and estimating the recoverability of the asset group, performing audit procedures to evaluate the reasonableness of these estimates and assumptions required a high degree of auditor judgment and an increased extent of effort, and including the need to involve professionals in our firm having the expertise in the valuation of long-lived assets.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included:\n●\nobtaining an independent third-party valuation report to gain an understanding of managements key assumptions used in determining the fair value of goodwill and finite-lived intangible assets.\n●\nevaluating the mathematical accuracy of the calculations including the completeness and accuracy of underlying data used in the models.\n●\nevaluating the reasonableness of significant assumptions used by management related to growth rates, including managements ability to accurately forecast future revenue and cash flows by comparing actual results to managements historical forecasts and evidence obtained in other areas of the audit.\n●\nusing professionals with specialized skills and knowledge to assist in evaluating the appropriateness of the Companys undiscounted and discounted cash flow models including key assumptions used by management.\n●\nassessing the appropriateness of the disclosures in the consolidated financial statements.\nWarrant Liabilities\nAs described in Note 5 to the consolidated financial statements, the Company classifies warrants on its Series A, C and D convertible preferred stock as liabilities that are subject to re-measurement on a quarterly basis. Management, with the assistance of an independent valuation expert, estimates the fair value of the warrant liabilities using the Monte Carlo option-pricing model, which takes into consideration the volatilities of the Company and comparable public companies.\nGiven the determination of the fair value of warrant liabilities requires management to make significant estimates and assumptions regarding the relevant valuation calculations, performing audit procedures to evaluate the reasonableness of these estimates and assumptions required a high degree of auditor judgment and an increased extent of effort, including the need to involve professionals in our firm having the expertise in the valuation of financial instruments.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included:\n●\nevaluating managements assessment and accounting analysis as to the classification of warrant liabilities.\n●\nobtaining independent third-party valuation reports to gain an understanding of managements key assumptions used in determining the fair value of warrant liabilities.\n●\nwith the assistance of our valuation specialists, evaluating the methodologies and key assumptions used by management to assess the Companys fair value of warrant liabilities, including assessing the reasonableness of the source information underlying the valuation assumptions.\n●\nperforming independent shadow calculations to test the reasonableness of the fair values for warrant liabilities concluded on by the Companys specialist.\n●\nassessing the appropriateness of the disclosures in the consolidated financial statements.\n/s/ PKF O'Connor Davies, LLP\nNew York, New York\nDecember 27, 2023\nWe have served as the Companys auditor since 2021.\nPCAOB ID No. 127\nBRIDGELINE DIGITAL, INC.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except share and per share data)\nAs of September 30,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$ 2,377 $ 2,856\nAccounts receivable, net\n1,004 1,182\nPrepaid expenses and other current assets\n278 242\nTotal current assets\n3,659 4,280\nProperty and equipment, net\n151 268\nOperating lease assets\n390 589\nIntangible assets, net\n4,890 6,268\nGoodwill, net\n8,468 15,985\nOther assets\n73 123\nTotal assets\n$ 17,631 $ 27,513\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities:\nCurrent portion of long-term debt\n$ 267 $ 429\nCurrent portion of operating lease liabilities\n148 199\nAccounts payable\n1,255 972\nAccrued liabilities\n995 995\nPurchase price and contingent consideration payable, current portion\n- 250\nDeferred revenue\n2,084 1,943\nTotal current liabilities\n4,749 4,788\nLong-term debt, net of current portion\n435 588\nOperating lease liabilities, net of current portion\n241 390\nWarrant liabilities\n174 749\nOther long-term liabilities\n572 646\nTotal liabilities\n6,171 7,161\nCommitments and contingencies (Note 14)\nStockholders equity:\nPreferred stock - $0.001 par value; 1,000,000 shares authorized;\nSeries C Convertible Preferred stock: 11,000 shares authorized; 350 shares issued and outstanding at September 30, 2023 and 2022\n- -\nSeries D Convertible Preferred stock: 4,200 shares authorized; no shares issued and outstanding at September 30, 2023 and 2022\n- -\nCommon stock - $0.001 par value; 50,000,000 shares authorized; 10,417,609 shares issued and outstanding at September 30, 2023 and September 30, 2022\n10 10\nAdditional paid-in capital\n101,275 100,704\nAccumulated deficit\n(89,577 ) (80,142 )\nAccumulated other comprehensive loss\n(248 ) (220 )\nTotal stockholders equity\n11,460 20,352\nTotal liabilities and stockholders equity\n$ 17,631 $ 27,513\nThe accompanying notes are an integral part of these consolidated financial statements.\nBRIDGELINE DIGITAL, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except share and per share data)\nYears Ended September 30,\nNet revenue:\nSubscription and perpetual licenses\n$ 12,742\n$ 13,560\nDigital engagement services\n3,143\n3,259\nTotal net revenue\n15,885\n16,819\nCost of revenue:\nSubscription and perpetual licenses\n3,364\n3,358\nDigital engagement services\n1,650\n1,759\nTotal cost of revenue\n5,014\n5,117\nGross profit\n10,871\n11,702\nOperating expenses:\nSales and marketing\n4,757\n5,232\nGeneral and administrative\n3,173\n3,387\nResearch and development\n3,679\n3,217\nDepreciation and amortization\n1,528\n1,599\nGoodwill impairment\n7,517\n-\nRestructuring and acquisition related expenses\nTotal operating expenses\n20,786\n13,599\nLoss from operations\n(9,915 )\n(1,897 )\nInterest (income) expense and other, net\n(189 )\nChange in fair value of warrant liabilities\n3,655\nIncome (loss) before income taxes\n(9,529 )\n2,175\nProvision for (benefit from) income taxes\n(94 )\nNet (loss) income\n$ (9,435 )\n$ 2,145\nNet (loss) income per share attributable to common stockholders:\nBasic\n$ (0.91 )\n$ 0.21\nDiluted\n$ (0.91 )\n$ 0.20\nNumber of weighted average shares outstanding:\nBasic\n10,417,609\n10,232,862\nDiluted\n10,424,187\n10,366,907\nThe accompanying notes are an integral part of these consolidated financial statements.\nBRIDGELINE DIGITAL, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME/(LOSS)\n(in thousands)\nYear Ended September 30,\nNet income (loss)\n$ (9,435 )\n$ 2,145\nOther comprehensive income (loss):\nNet change in foreign currency translation adjustment\n(28 )\nComprehensive income (loss)\n$ (9,463 )\n$ 2,278\nThe accompanying notes are an integral part of these consolidated financial statements.\nBRIDGELINE DIGITAL, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\n(in thousands, except share data)\nAccumulated\nPreferred Stock\nCommon Stock\nAdditional\nOther\nTotal\nPaid-in\nAccumulated\nComprehensive\nStockholders\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nLoss\nEquity\nBalance at September 30, 2021\n$ -\n10,187,128\n$\n$ 100,207\n$ (82,287 )\n$ (353 )\n$ 17,577\nStock-based compensation expense\n-\n-\n-\n-\n-\n-\nIssuance of common stock - stock options exercised\n-\n-\n13,333\n-\n-\n-\nIssuance of common stock - warrants exercised\n-\n-\n17,148\n-\n-\n-\n-\n-\nIssuance of restricted common stock\n-\n-\n200,000\n-\n-\n-\n-\n-\nNet income\n-\n-\n-\n-\n-\n2,145\n-\n2,145\nForeign currency translation\n-\n-\n-\n-\n-\n-\nBalance at September 30, 2022\n$ -\n10,417,609\n$\n$ 100,704\n$ (80,142 )\n$ (220 )\n$ 20,352\nStock-based compensation expense\n-\n-\n-\n-\n-\n-\nNet loss\n-\n-\n-\n-\n-\n(9,435 )\n-\n(9,435 )\nForeign currency translation\n-\n-\n-\n-\n-\n-\n(28 )\n(28 )\nBalance at September 30, 2023\n$ -\n10,417,609\n$\n$ 101,275\n$ (89,577 )\n$ (248 )\n$ 11,460\nThe accompanying notes are an integral part of these consolidated financial statements.\nBRIDGELINE DIGITAL, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nYear Ended September 30,\nCash flows from operating activities:\nNet (loss) income\n$ (9,435 )\n$ 2,145\nAdjustments to reconcile net (loss) income to net cash provided by (used in) operating activities:\nAmortization of intangible assets\n1,378\n1,487\nDepreciation and other amortization\nChange in fair value of contingent consideration\n-\n(631 )\nChange in fair value of warrant liabilities\n(575 )\n(3,655 )\nStock-based compensation\nDeferred income taxes\n(63 )\n(45 )\nGoodwill impairment\n7,517\n-\nChanges in operating assets and liabilities\nAccounts receivable\nPrepaid expenses and other current assets\n(39 )\n(20 )\nOther assets\n-\nAccounts payable and accrued liabilities\nDeferred revenue\n(223 )\nOther liabilities\n(37 )\nTotal adjustments\n9,712\n(2,279 )\nNet cash provided by (used in) operating activities\n(134 )\nCash flows from investing activities:\nPurchase of property and equipment\n(25 )\n(117 )\nSoftware development capitalization costs\n-\n(78 )\nNet cash (used in) investing activities\n(25 )\n(195 )\nCash flows from financing activities:\nPayments of long-term debt\n(399 )\n(611 )\nPayments of contingent consideration and deferred cash payable\n(250 )\n(4,891 )\nProceeds from stock option and warrant exercises\n-\nNet cash (used in) financing activities\n(649 )\n(5,483 )\nEffect of exchange rate changes on cash and cash equivalents\n(82 )\n(184 )\nNet (decrease) in cash and cash equivalents\n(479 )\n(5,996 )\nCash and cash equivalents at beginning of year\n2,856\n8,852\nCash and cash equivalents at end of year\n$ 2,377\n$ 2,856\nSupplemental disclosures of cash flow information:\nCash paid for:\nInterest\n$\n$\nIncome taxes\n$\n$\nNon-cash investing and financing activities:\nRight-of-use asset obtained in exchange for new operating lease liability\n$ -\n$\nThe accompanying notes are an integral part of these consolidated financial statements.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\n1. Description of Business\nOverview\nBridgeline Digital is a marketing technology company that offers a suite of products that help companies grow online revenue by driving more traffic to their websites, converting more visitors to purchasers, and increasing average order value.\nAll of Bridgelines software is available through a cloud-based Software as a Service (SaaS) model, whose flexible architecture provides customers hosting and support. Additionally, Unbound and HawkSearch have the option to be available via a traditional perpetual licensing business model, in which the software can reside on a dedicated infrastructure either on premise at the customers facility, or manage-hosted by Bridgeline via a cloud-based, dedicated hosted services model.\nBridgeline's product offerings include:\nHawkSearch: a site search, recommendation, and personalization software application, built for marketers, merchandisers, and developers to enhance, normalize, and enrich an online customer's content search and product discovery experience.\nCelebros Search: a commerce-oriented site search product that provides Natural Language Processing with artificial intelligence to present relevant search results based on long-tail keyword searches.\nWoorank: a Search Engine Optimization (SEO) audit tool that generates an instant performance audit of the sites technical, on-page, and off-page SEO.\nUnbound: a Digital Experience Platform that includes Web Content Management, eCommerce, Digital Marketing, and Web Analytics.\nTruPresence: a web content management and eCommerce platform that supports the needs of multi-unit organizations and franchises.\nOrchestraCMS: the only content and digital experience platform built 100% native on Salesforce and helps customers create websites and intranets for their customers, partners, and employees.\nBridgeline Digital was incorporated under the laws of the State of Delaware on August 28, 2000.\nLocations\nThe Companys corporate headquarters is located in Woburn, Massachusetts. The Company maintains regional field offices serving the following geographical locations: Woodbury, New York; Rosemont, Illinois; Atascadero, California; Ontario, Canada; and Brussels, Belgium.\nThe Company has four wholly-owned subsidiaries: Bridgeline Digital Pvt. Ltd., located in Bangalore, India; Bridgeline Digital Canada, Inc., located in Ontario, Canada; Hawk Search Inc. located in Rosemont, Illinois and Bridgeline Digital Belgium BV, located in Brussels, Belgium.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\n2. Summary of Significant Accounting Policies\nBasis of Presentation and Principles of Consolidation\nThe Companys fiscal year end is September 30th. The consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries. All significant inter-company balances and transactions have been eliminated in consolidation.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with United States generally accepted accounting principles (GAAP) requires management to make certain estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reported periods. The most significant estimates included in these consolidated financial statements are the valuation of accounts receivable, including the adequacy of the allowance for doubtful accounts, valuation of long-lived assets, recognition and measurement of deferred revenues, fair value of contingent consideration and fair value measurements related to the valuation of warrants. The complexity of the estimation process and factors relating to assumptions, risks and uncertainties inherent with the use of the estimates affect the amount of revenue and related expenses reported in the Companys consolidated financial statements. Internal and external factors can affect the Companys estimates. Actual results could differ from these estimates under different assumptions or conditions.\nCash and Cash Equivalents\nThe Company considers all highly liquid instruments with original maturity of three months or less from the date of purchase to be cash equivalents.\nThe Companys cash is maintained with what management believes to be high-credit quality financial institutions. At times, deposits held at these banks may exceed the insured limits. Management believes that the financial institutions that hold the Companys deposits are financially sound and have minimal credit risk. Risks associated with cash and cash equivalents are mitigated by the Companys investment policy, which limits the Companys investing of excess cash into only money market mutual funds.\nConcentration of Credit Risk, Significant Customers, and Off-Balance Sheet Risk\nFinancial instruments which potentially expose the Company to concentrations of credit risk consist primarily of cash, cash equivalents, and accounts receivable.\nThe Company extends credit to customers on an unsecured basis in the normal course of business. Management performs ongoing credit evaluations of its customers financial condition and limits the amount of credit when deemed necessary. Accounts receivable are carried at original invoice amount, less an estimate for doubtful accounts based on a review of all outstanding amounts.\nThe Company has no off-balance sheets risks such as foreign exchange contracts, interest rate swaps, option contracts or other foreign hedging agreements.\nAllowance for Doubtful Accounts\nThe Company maintains allowances for doubtful accounts for estimated losses resulting from the inability of its customers to make required payments. For all customers, the Company recognizes allowances for doubtful accounts based on the length of time that the receivables are past due, current business environment and its historical experience. If the financial condition of the Companys customers were to deteriorate, resulting in impairment of their ability to make payments, additional allowances may be required.\nRevenue Recognition\nThe Company derives its revenue from two sources: (i) Subscription and Perpetual Licenses, which are comprised of software subscription fees (SaaS), perpetual software licenses, and maintenance for post-customer support (PCS) on perpetual licenses, and (ii) Digital Engagement Services, which are professional services to implement our products such as web development, digital strategy, information architecture and usability engineering search. Customers who license the software on a subscription basis, which can be described as Software as a Service or SaaS, do not take possession of the software.\nRevenue is recognized when control of these services is transferred to the Companys customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those services. If the consideration promised in a contract includes a variable amount, for example, overage fees, contingent fees or service level penalties, the Company includes an estimate of the amount it expects to receive for the total transaction price if it is probable that a significant reversal of cumulative revenue recognized will not occur. The Companys subscription service arrangements are non-cancelable and do not contain refund-type provisions. Revenue is reported net of applicable sales and use tax.\nThe Company recognizes revenue from contracts with customers using a five-step model, which is described below:\n1.\nIdentify the customer contract;\n2.\nIdentify performance obligations that are distinct;\n3.\nDetermine the transaction price;\n4.\nAllocate the transaction price to the distinct performance obligations; and\n5.\nRecognize revenue as the performance obligations are satisfied.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\n1.\nIdentify the customer contract - A customer contract is generally identified when there is approval and commitment from both the Company and its customer, the rights have been identified, payment terms are identified, the contract has commercial substance and collectability and consideration is probable.\n2.\nIdentify performance obligations that are distinct - A performance obligation is a promise to provide a distinct good or service or a series of distinct goods or services. A good or service that is promised to a customer is distinct if the customer can benefit from the good or service either on its own or together with other resources that are readily available to the customer, and the Companys promise to transfer the good or service to the customer is separately identifiable from other promises in the contract.\n3.\nDetermine the transaction price - The transaction price is the amount of consideration to which the Company expects to be entitled in exchange for transferring goods or services to a customer, excluding sales taxes that are collected on behalf of government agencies.\n4.\nAllocate the transaction price to distinct performance obligations - The transaction price is allocated to each performance obligation based on the relative standalone selling prices (SSP) of the goods or services being provided to the customer. The Company determines the SSP of its goods and services based upon the historical average sales prices for each type of software license and professional services sold.\n5.\nRecognize revenue as the performance obligations are satisfied - Revenue is recognized when or as control of the promised goods or services is transferred to customers. Revenue from SaaS licenses is recognized ratably over the subscription period beginning on the date the license is made available to customers. Most subscription contracts are three-year terms. Customers who license the software on a perpetual basis receive rights to use the software for an indefinite time period and an option to purchase post-customer support (PCS). PCS revenue is recognized ratably on a straight-line basis over the period of performance and the perpetual license is recognized upon delivery. The Company also offers hosting services for those customers who purchase a perpetual license and do not want to run the software in their environment. Revenue from hosting is recognized ratably over the service period, ranging from one to three-year terms. The Company recognizes revenue from professional services as the services are provided.\nDisaggregation of Revenue\nThe Company provides disaggregation of revenue based on geography and product groupings (see Note 15) as it believes this best depicts how the nature, amount, timing and uncertainty of revenue and cash flows are affected by economic factors.\nCustomer Payment Terms\nPayment terms with customers typically require payment 30 days from invoice date. Payment terms may vary by customer but generally do not exceed 45 days from invoice date. Invoicing for digital engagement services is either monthly or upon achievement of milestones and payment terms for such billings are within the standard terms described above. Invoices for subscriptions and hosting are typically issued monthly and are generally due in the month of service.\nWarranty\nCertain arrangements include a warranty period, which is generally 30 days from the completion of work. In hosting arrangements, the Company provides warranties of up-time reliability. The Company continues to monitor the conditions that are subject to the warranties to identify if a warranty claim may arise. If it is determined that a warranty claim is probable, then any related cost to satisfy the warranty obligation is estimated and accrued. Warranty claims to date have been immaterial.\nProperty and Equipment\nThe components of property and equipment are stated at cost, net of accumulated depreciation and amortization. Depreciation and amortization are computed using the straight-line method over the estimated useful lives of the related assets (three to five years). Leasehold improvements are amortized using the straight-line method over the lesser of the estimated useful life of the asset or the lease term. Repairs and maintenance costs are expensed as incurred.\nInternal-Use Software\nCosts incurred in the preliminary stages of development were expensed as incurred. Once an application had reached the development stage, internal and external costs, if direct and incremental, were capitalized until the software was substantially complete and ready for its intended use. Capitalization ceased upon completion of all substantial testing. The Company also capitalized costs related to specific upgrades and enhancements when it was probable that the expenditures would result in additional functionality. Capitalized costs were recognized as part of equipment and improvements. Training costs were expensed as incurred. Internal use software was amortized on a straight-line basis over its estimated useful life, generally three years.\nImplementation costs incurred in cloud-computing arrangements that are a service contract are capitalized and amortized over the life of the arrangement.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nResearch and Development and Software Development Costs\nCosts for research and development of a software product to sell, lease or otherwise market are charged to operations as incurred until technological feasibility has been established. Once technological feasibility has been established, certain software development costs incurred during the application development stage are eligible for capitalization. Based on the Companys software product development process, technological feasibility is established upon completion of a working model.\nSoftware development costs that are capitalized are amortized to cost of sales over the estimated useful life of the software, typically three years. Capitalization ceases when a product is available for general release to customers. Capitalization costs are included in other assets in the consolidated financial statements. The Company did not incur any development costs during fiscal 2023 and incurred $0.1 of development costs in fiscal 2022.\nIntangible Assets\nAll intangible assets have finite lives and are stated at cost, net of amortization. Amortization is computed over the estimated useful life of the related assets on a straight-line method as follows:\nDescription\nEstimated Useful Life (in years)\nTechnology\n3 - 5\nCustomer related\n3 - 10\nDomain and trade names\n1 - 15\nGoodwill\nGoodwill represents the excess of the purchase price over the fair value of the net assets acquired in each business combination. Goodwill is not amortized, but it is subject to an annual assessment for impairment, which the Company performs during the fourth quarter, or more frequently if events occur or circumstances change such that it is more likely than not that an impairment may exist. Goodwill is assessed at the consolidated level as one reporting unit.\nIn applying the goodwill impairment test, the Company has the option to perform a qualitative test (also known as Step 0) or a quantitative test (Step 1). Under the Step 0 test, the Company first assesses qualitative factors to determine whether it is more likely than not that the fair value of the reporting unit is less than its carrying value. Qualitative factors may include, but are not limited to, economic conditions, industry and market considerations, cost factors, overall financial performance of the reporting unit and other entity and reporting unit specific events. If after assessing these qualitative factors, the Company determines it is more-likely-than-not that the fair value of the reporting unit is less than the carrying value, then performing the Step 1 quantitative test is necessary.\nStep 1 of the quantitative test requires comparison of the fair value of the reporting unit to the respective carrying value. If the carrying value of the reporting unit is less than the fair value, no impairment exists. Otherwise, the Company would recognize an impairment charge for the amount by which the carrying amount of the reporting unit exceeds its fair value up to the amount of goodwill.\nThe Company generally estimates the fair value using a weighting of the income and market approaches. The Company uses industry accepted valuation models. Under the income approach, the Company uses a discounted cash flow methodology which requires management to make significant estimates and assumptions related to forecasted revenues, gross profit margins, operating income margins, working capital cash flow, perpetual growth rates, and long-term discount rates, among others. For the market approach, the Company uses the guideline public company method. Under this method, the Company utilizes information from comparable publicly traded companies with similar operating and investment characteristics as the reporting unit, to create valuation multiples that are applied to the operating performance of the reporting unit being tested, in order to obtain their respective fair values. The Company also reconciles the aggregate fair values of its reporting unit to its current market capitalization, allowing for a reasonable control premium. See Note 6.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nValuation of Long-Lived Assets\nThe Company periodically reviews its long-lived assets, which consist primarily of property and equipment and intangible assets with finite lives, for impairment whenever events or changes in circumstances indicate the carrying amount of such assets may exceed their fair value. Recoverability of these assets is assessed using a number of factors, including operating results, business plans, budgets, economic projections and undiscounted cash flows.\nIn addition, the Companys evaluation considers non-financial data such as market trends, product development cycles and changes in managements market emphasis. For the definite-lived intangible asset impairment review, the carrying value of the intangible assets is compared against the estimated undiscounted cash flows to be generated over the remaining life of the intangible assets. To the extent that the undiscounted future cash flows are less than the carrying value, the fair value of the asset is determined. If such fair value is less than the current carrying value, the asset is written down to the estimated fair value. There were no impairments of long-lived assets, other than impairment of goodwill, in fiscal 2023 or 2022.\nBusiness Combinations\nThe Company allocates the amount it pays for each acquisition to the assets acquired and liabilities assumed based on their fair values at the date of acquisition, including identifiable intangible assets which arise from a contractual or legal right or are separable from goodwill. The Company bases the fair value of identifiable intangible assets acquired in a business combination on detailed valuations that use information and assumptions provided by management, which consider managements best estimates of inputs and assumptions that a market participant would use. The Company allocates any excess purchase price that exceeds the fair value of the net tangible and identifiable intangible assets acquired to goodwill. The use of alternative valuation assumptions, including estimated growth rates, cash flows and discounts rates and estimated useful lives could result in different purchase price allocations and amortization expense in current and future periods. Transaction costs associated with these acquisitions are expensed as incurred through acquisition related expenses on the consolidated statements of operations. In those circumstances where an acquisition involves a contingent consideration arrangement, the Company recognizes a liability equal to the fair value of the contingent payments expected to be made as of the acquisition date. The Company re-measures this liability each reporting period and recognizes changes in the fair value through income (loss) before income taxes within the consolidated statements of operations.\nForeign Currency\nThe Company determines the appropriate method of measuring assets and liabilities as to whether the method should be based on the functional currency of the entity in the environment in which it operates or the reporting currency of the Company, the U.S. dollar. The Company has determined that the functional currency of its foreign subsidiaries are the local currencies of their respective jurisdictions. Assets and liabilities are translated into U.S. dollars at exchange rates in effect at the balance sheet date. Equity accounts are translated at historical rates, except for the change in retained earnings as a result of the income statement translation process. Revenue and expense items are translated into U.S. dollars at average exchange rates for the period. The adjustments are recognized as a separate component of stockholders equity and are included in accumulated other comprehensive income (loss). The Companys foreign currency translation net gains (losses) for fiscal 2023 and 2022 were ($28) and $133, respectively. Transaction gains and losses related to monetary assets and liabilities denominated in a currency different from a subsidiarys functional currency are included in the consolidated statements of operations.\nSegment Information\nThe Company has one reportable segment.\nStock-Based Compensation\nThe Company accounts for stock-based compensation in the consolidated statements of operations based on the fair values of the awards on the date of grant on a straight-line basis over their vesting term. Compensation expense is recognized only for share-based payments expected to vest. The Company estimates forfeitures at the date of grant based on the Companys historical experience and future expectations.\nCommon Stock Purchase Warrants\nThe Company estimates the fair value of common stock warrants issued to non-employees using a binomial options pricing model. The Company evaluates common stock warrants as they are issued to determine whether they should be classified as an equity instrument or a liability. Those warrants that are classified as a liability are carried at fair value at each reporting period, with changes in their fair value recognized in change in fair value of warrant liabilities in the consolidated statements of operations.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nAdvertising Costs\nAdvertising costs are expensed when incurred. Such costs were $112 and $169 for fiscal 2023 and 2022, respectively.\nEmployee Benefits\nThe Company sponsors a contributory 401(k) plan allowing all full-time employees who meet prescribed service requirements to participate. The Company is not required to make matching contributions, although the plan provides for discretionary contributions by the Company. The Company made no contributions in either fiscal 2023 or fiscal 2022.\nIncome Taxes\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cuts and Jobs Act (the Tax Act). The Tax Act made broad and complex changes to the U.S. tax code that affected the Companys fiscal year ended September 30, 2018, including, but not limited to, reducing the U.S. federal corporate tax rate. For taxable years after December 31, 2017, the Tax Act reduced the federal corporate tax rate to 21 percent. The Tax Act repealed the Corporate Alternative Minimum Tax (AMT).\nThe Tax Act required the Company to pay a one-time transition tax on earnings of the Company's foreign subsidiaries that were previously tax deferred for U.S. income taxes and created new taxes on the Company's foreign-sourced earnings. The Company determined that the repatriation tax was zero because the foreign subsidiary had no positive retained earnings, and no current income.\nOn March 27, 2020, the Coronavirus Aid, Relief and Economic Security Act (the CARES Act) was enacted in response to the COVID-19 pandemic. The CARES Act, among other things, contains modifications on the limitation of business interest for tax years beginning in 2019 and 2020, and permits net operating loss carryovers and carrybacks to offset 100% of taxable income for taxable years beginning before 2021. In addition, the CARES Act allows net operating losses incurred in 2018, 2019, and 2020 to be carried back to each of the five preceding taxable years to generate a refund of previously paid income taxes. These provisions of the CARES Act did not have a material effect on the Companys estimated effective tax rate.\nThe Company recognizes deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the Companys consolidated financial statements and tax returns. Deferred income taxes are recognized based on temporary differences between the financial statement and tax basis of assets and liabilities using enacted tax rates in effect for the year in which the temporary differences are expected to reverse. Valuation allowances are provided if based upon the weight of available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized.\nThe Company provides for reserves for potential payments of taxes to various tax authorities related to uncertain tax positions. Reserves are based on a determination of whether and how much of a tax benefit taken by the Company in its tax filings or positions is more likely than not to be realized following resolution of any uncertainty related to the tax benefit, assuming that the matter in question will be raised by the tax authorities. Interest and penalties associated with uncertain tax positions are included in the provision for benefit from income taxes.\nThe Company does not provide for U.S. income taxes on the undistributed earnings of its foreign subsidiaries, which the Company considers to be permanent investments.\nNet Income (Loss) Per Share\nThe Company presents basic and diluted income (loss) per share information for its common stock. Basic net income (loss) per share is computed by dividing net income (loss) attributable to common stockholders by the weighted average number of common shares outstanding. Diluted net income (loss) per share attributable to common stockholders is computed using the weighted average number of common shares outstanding during the period plus the dilutive effect of outstanding stock options and warrants using the treasury stock method and convertible preferred stock using the as-if-converted method. The computation of diluted earnings per share does not include the effect of outstanding stock options, warrants and convertible preferred stock that are considered anti-dilutive.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nRecently Adopted Accounting Standards\nDebt-Debt with Conversion and Other Options\nIn August 2020, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815- 40) (ASU 2020-06). The ASU 2020-06 simplifies the accounting for convertible instruments and application of the equity classification guidance and made certain disclosure amendments. In addition, this ASU also amends certain aspects of the earnings per share (EPS) guidance. ASU 2020-06 is effective for financial reporting periods beginning after December 15, 2021, except smaller reporting companies for which this ASU is effective for financial reporting periods beginning after December 15, 2023. Early adoption is permitted, and an entity should adopt this ASU as of the beginning of its annual fiscal year. The Company elected to early adopt ASU 2020-06 as of the first day of the fiscal year ending September 30, 2023, using the modified retrospective approach which allows for a cumulative-effect adjustment to the opening balance of retained earnings or accumulated deficit in the period of adoption. The adoption of ASU 2020-06 did not have any impact on the accumulated deficit or any other components of the consolidated balance sheet as of October 1, 2022 nor did it have a material impact on earnings per share for the year ended September 30, 2023.\nRecently Issued Accounting Pronouncements Not Yet Effective\nFinancial Instruments - Credit Losses\nIn June 2016, the FASB issued ASU No. 2016-13, Financial Instruments-Credit Losses (Topic 326), which requires entities to measure all expected credit losses for financial assets held at the reporting date based on historical experience, current conditions, and reasonable and supportable forecasts. This replaces the existing incurred loss model and is applicable to the measurement of credit losses on financial assets measured at amortized cost. ASU 2016-13 is effective for smaller reporting companies for annual reporting periods beginning after December 15, 2022, including interim periods within those annual reporting periods, with early adoption permitted. The adoption of ASU 2016-13 during the Company's fiscal 2024 first quarter did not have a material impact on its consolidated financial statements and related disclosures.\nBusiness Combinations\nIn October 2021, the FASB issued ASU No. 2021-08, Business Combinations (Topic 606): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers, which requires that an entity recognize and measure contract assets and contract liabilities acquired in a business combination in accordance with Topic 606 as if it had originated the contracts. Generally, this should result in an acquirer recognizing and measuring the acquired contract assets and contract liabilities consistent with how they were recognized and measured in the acquirees financial statements, if the acquiree prepared financial statements in accordance with U.S. GAAP. The amendment in this update is effective for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. Early adoption is permitted, including adoption in an interim period. The guidance should be applied prospectively to business combinations occurring on or after the effective date of the amendment in this update. The adoption of ASU 2021-08 during the Company's fiscal 2024 first quarter did not have a material impact on its consolidated financial statements and related disclosures.\nSegment Reporting\nIn November 2023, the FASB issued ASU No. 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures, which requires that an entity report segment information in accordance with Topic 280, Segment Reporting. The amendment in the ASU is intended to improve reportable segment disclosure requirements primarily through enhanced disclosures about significant segment expenses. The amendments in this Update are effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024. The Company is currently evaluating the impact of the new standard on its consolidated financial statements which is expected to result in enhanced disclosures.\nIncome Taxes\nIn December 2023, the FASB issued ASU No. 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures, which requires that an entity, on an annual basis, disclose additional income tax information, primarily related to the rate reconciliation and income taxes paid. The amendment in the ASU is intended to enhance the transparency and decision usefulness of income tax disclosures. The amendments in this Update are effective for annual periods beginning after December 15, 2024. The Company is currently evaluating the impact of the new standard on its consolidated financial statements which is expected to result in enhanced disclosures.\nAll other Accounting Standards Updates issued but not yet effective are not expected to have a material effect on the Companys future consolidated financial statements or related disclosures.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\n3. Accounts Receivable\nAccounts receivable consist of the following:\nAs of September 30,\nAccounts receivable\n$ 1,184 $ 1,332\nAllowance for doubtful accounts\n(180 ) (150 )\nAccounts receivable, net\n$ 1,004 $ 1,182\nAs of and for the years ended September 30, 2023 and 2022 no customers exceeded 10% of accounts receivable and no customers exceeded 10% of the Companys total revenues.\n4. Property and equipment\nProperty and equipment consist of the following:\nAs of September 30,\nFurniture and fixtures\n$ 166 $ 166\nPurchased software\n18 18\nComputer equipment\n217 195\nLeasehold improvements\n206 202\nTotal cost\n607 581\nLess accumulated depreciation and amortization\n(456 ) (313 )\nProperty and equipment, net\n$ 151 $ 268\nDepreciation and amortization on the above assets were $144 and $102 in fiscal 2023 and 2022, respectively.\n5. Fair Value Measurement and Fair Value of Financial Instruments\nThe Companys financial instruments consist principally of accounts receivable, accounts payable, warrant liabilities, contingent consideration and long-term debt arrangements. The Company measures its financial assets and liabilities at fair value. Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability (i.e., exit price) in an orderly transaction between market participants at the measurement date. Additionally, under U.S. GAAP, companies are required to provide disclosure and categorize assets and liabilities measured at fair value into one of three different levels depending on the assumptions (i.e., inputs) used in the valuation. Level 1 provides the most reliable measure of fair value while Level 3 generally requires significant management judgment. Financial assets and liabilities are classified in their entirety based on the lowest level of input significant to the fair value measurement. The fair value hierarchy is defined as follows:\nLevel 1-Valuations are based on unadjusted quoted prices in active markets for identical assets or liabilities.\nLevel 2-Valuations are based on quoted prices for similar assets or liabilities in active markets, or quoted prices in markets that are not active for which significant inputs are observable, either directly or indirectly.\nLevel 3-Valuations are based on prices or valuation techniques that require inputs that are both unobservable and significant to the overall fair value measurement. Inputs reflect managements best estimate of what market participants would use in valuing the asset or liability at the measurement date.\nThe carrying value of the Companys accounts receivable and accounts payable approximate their fair value due to their short-term nature. As of September 30, 2023 and 2022, the aggregate fair values of long-term debts were $0.6 million and $0.9 million, respectively, with an aggregate carrying value of $0.7 million and $1.0 million, respectively. The fair value is based on interest rates that are currently available to the Company for issuance of debt with similar terms and remaining maturities. If measured at fair value in the consolidated financial statements, the debt would be classified as Level 2 in the fair value hierarchy.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nThe Companys warrant liabilities are measured at fair value at each reporting period with changes in fair value recognized in earnings during the period. The fair value of the Companys warrant liabilities are valued utilizing Level 3 inputs. Warrant liabilities are valued using a Monte Carlo option-pricing model, which takes into consideration the volatilities of comparable public companies, due to the relatively low trading volume of the Companys common stock. The Monte Carlo option-pricing model uses certain assumptions, including expected life and annual volatility. The range and weighted average volatilities of comparable public companies utilized was 27.7% - 84.5% and 45.5%, respectively, as of September 30, 2023, and 26.6% - 64.3% and 55.3%, respectively, as of September 30, 2022. The volatility utilized in the Monte Carlo option-pricing model was determined by weighing 60% to the Company-specific volatility and 40% on comparable public companies. The significant inputs and assumptions utilized were as follows:\nAs of September 30, 2023\nAs of September 30, 2022\nMontage Capital\nSeries C Preferred\nSeries D Preferred\nMontage Capital\nSeries C Preferred\nSeries D Preferred\nVolatility\n60.7 % 51.7 % 73.6 % 82.0 % 83.9 % 84.7 %\nRisk-free rate\n5.0 % 5.5 % 4.8 % 4.2 % 4.2 % 4.1 %\nStock price\n$ 0.83 $ 0.83 $ 0.83 $ 1.31 $ 1.31 $ 1.31\nThe Company recognized a gain $0.6 million and $3.7 million for the years ended September 30, 2023 and 2022, respectively, related to the change in fair value of warrant liabilities. The changes in fair value of warrant liabilities were due to changes in inputs, primarily a change in the stock price and the risk-free rate, to the Monte Carlo option-pricing model.\nThe Companys goodwill (see Note 6) and contingent consideration obligations were from arrangements resulting from acquisitions, completed in prior periods not presented. The contingent consideration was a result of former potential future payments of consideration that were contingent upon the achievement of revenue targets and operational goals. Contingent consideration is recognized at its estimated fair value at the date of acquisition based on the Companys expected probability of future payment, discounted using a weighted average cost of capital in accordance with accepted valuation methodologies.\nThe Company reviews and re-assesses the estimated fair value of contingent consideration liabilities at each reporting period and the updated fair value could differ materially from the initial estimates. The Company measures contingent consideration recognized in connection with acquisitions at fair value on a recurring basis using significant unobservable inputs classified as Level 3 inputs. The Company uses a simulation-based model to estimate the fair value of contingent consideration on the acquisition date and at each reporting period. The simulation model uses certain inputs and assumptions, including revenue projections, an estimate of revenue discount and volatility rate based on comparable public companies data, and risk-free rate. Significant increases or decreases to either of these inputs in isolation could result in a significantly higher or lower liability with a higher liability limited to the contractual maximum of the contingent consideration liabilities. Ultimately, the liability will be equivalent to the amount paid, and the difference between the fair value estimate on the acquisition date and each reporting period and the amount paid will be recognized in earnings.\nThe fair value of contingent consideration was $250 thousand on September 30, 2022, all of which was paid in October 2022. There were no contingent consideration amounts remaining thereafter.\nAssets and liabilities of the Company measured at fair value on a recurring basis as of September 30, 2023 and 2022, are as follows:\nAs of September 30, 2023\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\nGoodwill, net\n$ - $ - $ 8,468 $ 8,468\nLiabilities:\nWarrant liabilities:\nMontage\n- - 12 12\nSeries A and C\n- - 11 11\nSeries D\n- - 151 151\nTotal warrant liabilities\n$ - $ - $ 174 $ 174\nAs of September 30, 2022\nLevel 1\nLevel 2\nLevel 3\nTotal\nLiabilities:\nWarrant liabilities:\nMontage\n$ - $ - $ 12 $ 12\nSeries A and C\n- - 234 234\nSeries D\n- - 503 503\nTotal warrant liabilities\n- - 749 749\nContingent consideration obligations\n- - 250 250\nTotal Liabilities\n$ - $ - $ 999 $ 999\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nThe following table provides a roll forward of the fair value, as determined by Level 3 inputs, as follows:\nContingent Consideration Obligations\nWarrant Liabilities\nBalance at beginning of period, October 1, 2021\n$ 3,649 $ 4,404\nAdditions\n- -\nExercises or payments\n(2,768 ) -\nAdjustment to fair value\n(631 ) (3,655 )\nBalance at end of period, September 30, 2022\n$ 250 $ 749\nAdditions\n- -\nExercises or payments\n(250 ) -\nAdjustment to fair value\n- (575 )\nBalance at end of period, September 30, 2023\n$ - $ 174\n6. Goodwill\nThe carrying value of goodwill is not amortized, but is tested for impairment annually as of September 30th, as well as whenever events or changes in circumstances indicate that the carrying amount of a reporting unit may not be recoverable. The purpose of an impairment test is to identify any potential impairment by comparing the carrying value of a reporting unit including goodwill to its fair value. An impairment charge is recognized for the amount by which the carrying amount exceeds the reporting units fair value; however, the loss recognized should not exceed the total amount of goodwill allocated to that reporting unit. Impairment charges are reflected as a reduction in goodwill in the Companys consolidated balance sheets and an expense in the Companys consolidated statements of operations.\nAnnual tests were performed at September 30, 2023 and 2022. Due to the current inflationary macro-economic conditions and a sustained decline in the Company's market capitalization, for the 2023 test, the Company elected to forgo the qualitative test and performed a quantitative goodwill impairment test by comparing the fair value of its reporting unit to its respective carrying value. The Company estimated the fair value of the reporting unit using a 75% and 25% weighting to the market approach and income approach, respectively, and a discount rate of 22.9%. The Company used industry accepted valuation models. Under the income approach (level 3 inputs), the Company used a discounted cash flow methodology which required management to make significant estimates and assumptions related to forecasted revenues, gross profit margins, operating income margins, working capital cash flow, perpetual growth rates, and long-term discount rates, among others. For the market approach, the Company used the guideline public company method. Under this method, the Company utilized information from comparable publicly traded companies with similar operating and investment characteristics as the reporting unit, to create valuation multiples that were applied to the operating performance of the reporting unit being tested, in order to obtain their respective fair values. The Company also reconciled the aggregate fair value of its reporting unit to its current market capitalization, allowing for a reasonable control premium.\nBased on the impairment assessment performed, the Company recognized a goodwill impairment charge of $7.5 million, all of which was attributable to goodwill, during fiscal 2023. The Company concluded that the definite-lived and other long-lived assets were not impaired.\nFor fiscal 2022 management performed a qualitative assessment that did not result in any impairment indicators at September 30, 2022.\nChanges in the carrying value of goodwill are as follows:\nAs of September 30,\nBalance at beginning of period\n$ 15,985 $ 15,985\nImpairments\n(7,517 ) -\nBalance at end of period\n$ 8,468 $ 15,985\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\n7. Intangible Assets\nThe components of intangible assets, net of accumulated amortization, are as follows:\nAs of September 30,\nDomain and trade names\n$ 629 $ 682\nCustomer related\n3,678 4,522\nTechnology\n583 1,064\nIntangible, assets net\n$ 4,890 $ 6,268\nTotal amortization expense related to intangible assets was $1,378 and $1,487 for the years ended September 30, 2023 and 2022, respectively, and is reflected in Operating expenses on the consolidated statements of operations. The estimated amortization expense for fiscal years 2024, 2025, 2026, 2027, 2028 and thereafter is $990, $730, $671, $557, $557 and $1,385, respectively.\n8. Accrued Liabilities\nAccrued liabilities consist of the following:\nAs of September 30,\nCompensation and benefits\n$ 517 $ 477\nProfessional fees\n260 186\nTaxes\n4 98\nOther\n214 234\nAccrued liabilities\n$ 995 $ 995\n9. Restructuring and Acquisition Related Expenses\nThe Company incurred restructuring and acquisition related expenses of $0.1 million and $0.2 million during the year ended September 30, 2023 and 2022, which are included in Restructuring and acquisition related expenses in the consolidated statements of operations.\n10. Long-term Debt\nOn March 1, 2021, the Company assumed the outstanding long-term debt obligations of an acquired business and issued a seller note to one of the selling stockholders. The assumed debt obligations and seller note are denominated in Euros.\nLong-term debt consists as follows:\nAs of September 30,\nTerm loan payable, accruing interest at 3-Month EURIBOR plus 1.3% per annum, payable in quarterly installments starting in April 2023 and matures in July 2028.\n$ 385 $ 389\nSellers note payable (Sellers note), due to one of the selling stockholders, accruing interest at a fixed rate of 4.0% per annum. The Sellers note is payable over 5 installments and matures in September 2025.\n317 292\nVendor loan payable (Vendor loan), accruing interest at 3.0% per annum. Principal and interest are payable in one remaining installment in March 2023.\n- 292\nTerm loan payable, accruing interest at fixed rates ranging between 0.99% to 1.5% per annum, payable in monthly or quarterly payments of interest and principal and matured in October 2022.\n- 44\nTotal debt\n702 1,017\nLess current portion:\n(267 ) (429 )\nLong-term debt, net of current portion\n$ 435 $ 588\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nAt September 30, 2023, future maturities of long-term debt are as follows:\nFiscal year:\n$\nTotal debt\n$\n11. Leases\nThe Company leases facilities in the United States for its corporate and regional field offices. During the years ended September 30, 2023 and 2022, the Company was also a lessee/sublessor for certain office locations.\nDetermination of Whether a Contract Contains a Lease\nWe determine if an arrangement is a lease at inception, or upon modification of a contract and classify each lease as either an operating or finance lease at commencement. The Company reassesses lease classification subsequent to commencement upon a change to the expected lease term or a modification to the contract. Operating leases represent the Companys right to use an underlying asset as lessee for the lease term and lease obligations represent the Companys obligation to make lease payments arising from the lease.\nA contract contains a lease if the contract conveys the right to control the use of the identified property or equipment, explicitly or implicitly, for a period of time in exchange for consideration. Control of an underlying asset is conveyed if we obtain the rights to direct the use of and obtain substantially all of the economic benefit from the use of the underlying asset. At commencement, contracts containing a lease are further evaluated for classification as an operating lease or finance lease based on their terms.\nROU Model and Determination of Lease Term\nThe Company uses the Right-of-Use (ROU) model to account for leases, which requires an entity to recognize a lease liability and ROU asset on the lease commencement date. A lease liability is measured equal to the present value of the remaining lease payments over the lease term and is discounted using the incremental borrowing rate, as the rates implicit in the Companys leases are not readily determinable. The incremental borrowing rate is the rate of interest that the Company would have to pay to borrow, on a collateralized basis over a similar term, an amount equal to the lease payments in a similar economic environment. Lease payments include payments made before the commencement date and any residual value guarantees, if applicable. The initial ROU asset consists of the initial measurement of the lease liability, adjusted for any payments made before the commencement date, initial direct costs and lease incentives earned. When determining the lease term, the Company includes option periods when it is reasonably certain that those options will be exercised.\nLease Costs\nFor operating leases, minimum lease payments, including minimum scheduled rent increases, are recognized as operating lease costs on a straight-line basis over the applicable lease terms. Some operating lease arrangements include variable lease costs, including real estate taxes, insurance, common area maintenance or increases in rental costs related to inflation. Such variable payments, other than those dependent upon a market index or rate, are excluded from the measurement of the lease liability and are expensed when the obligation for those payments is incurred.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nSignificant Assumptions and Judgments\nManagement makes certain estimates and assumptions regarding each new lease and sublease agreement, renewal and amendment, including, but not limited to, property values, market rents, useful life of the underlying property, discount rate and probable term, all of which can impact (1) the classification as either an operating or finance lease, (2) measurement of lease liabilities and ROU assets and (3) the term over which the ROU asset and leasehold improvements are amortized. The amount of depreciation and amortization, interest and rent expense would vary if different estimates and assumptions were used.\nThe components of net lease costs were as follows:\nAs of September 30,\nOperating lease cost\n$ 260 $ 258\nVariable lease cost\n145 97\nLess: Sublease income, net\n(156 ) (170 )\nTotal\n$ 249 $ 185\nCash paid for amounts included in the measurement of lease liabilities was $233 thousand and $108 thousand for the years ended September 30, 2023 and 2022, respectively, all of which represents operating cash flows from operating leases. As of September 30, 2023 and 2022, the weighted average remaining lease term was 3.1 and 3.4 years, respectively, and the weighted average discount rate was 7.0% for both periods.\nAt September 30, 2023, future minimum rental commitments under non-cancelable leases with initial or remaining terms in excess of one year, which have commenced, were as follows:\nPayments Operating Leases Receipts Subleases Net Leases\nFiscal year:\n$ 177 $ 25 $ 152\n151 - 151\n72 - 72\n61 - 61\n11 - 11\nTotal lease commitments\n472 $ 25 $ 447\nLess: Amount representing interest\n(83 )\nPresent value of lease liabilities\nLess: Current portion\n(148 )\nOperating lease liabilities, net of current portion\n$ 241\nAs of September 30, 2023, the Company had no lease commitments that extend past fiscal 2028.\nStarting October 1, 2023, the Company has subleased its office space in Rosemont, Illinois. The sublease is for $6 thousand per month, through August 31, 2025.\nAt September 30, 2022, future minimum rental commitments under non-cancelable leases with initial or remaining terms in excess of one year were as follows:\nPayments Operating Leases Receipts Subleases Net Leases\nFiscal year:\n$ 233 $ 101 $ 132\n177 34 143\n151 - 151\n72 - 72\n61 - 61\nThereafter\n11 - 11\nTotal lease commitments\n705 $ 135 $ 570\nLess: Amount representing interest\n(116 )\nPresent value of lease liabilities\nLess: Current portion\n(199 )\nOperating lease liabilities, net of current portion\n$ 390\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\n12. Stockholders Equity\nUnder our Certificate of Incorporation, we are authorized, subject to limitations prescribed by Delaware law and our Charter, to issue up to 1,000,000 shares of preferred stock in one or more series, to establish from time to time the number of shares to be included in each series and to fix the designation, powers, preferences and rights of the shares of each series and any of its qualifications, limitations or restrictions. Our Board of Directors can increase or decrease the number of shares of any series, but not below the number of shares of that series then outstanding, without any further vote or action by our stockholders. Our Board of Directors may authorize the issuance of preferred stock with voting or conversion rights that could adversely affect the voting power or other rights of the holders of the common stock.\nSeries A Convertible Preferred Stock\nThe Company has designated 264,000 shares of its preferred stock as Series A Convertible Preferred Stock (Series A Preferred Stock). The shares of Series A Preferred Stock may be converted, at the option of the holder at any time, into such number of shares of common stock equal to (i) the number of shares of Series A Preferred Stock to be converted, multiplied by the stated value of $10 and (ii) divided by the conversion price in effect at the time of conversion. As of September 30, 2023 and 2022, the Company had no shares of Series A Preferred Stock outstanding.\nSeries B Convertible Preferred Stock\nThe Company has designated 5,000 shares of its preferred stock as Series B Convertible Preferred Stock (Series B Preferred Stock). The shares of Series B Preferred Stock may be converted, at the option of the holder at any time, into such number of shares of common stock equal to (i) the number of shares of Series B Preferred Stock to be converted, multiplied by the stated value of $1,000 and (ii) divided by the conversion price in effect at the time of conversion. As of September 30, 2023 and 2022, the Company had no shares of Series B Preferred Stock outstanding.\nSeries C Convertible Preferred Stock\nThe Company has designated 11,000 shares of its preferred stock as Series C Convertible Preferred Stock (Series C Preferred Stock). The shares of Series C Preferred Stock may be converted, at the option of the holder at any time, into such number of shares of common stock equal to (i) the number of shares of Series C Preferred Stock to be converted, multiplied by the stated value of $1,000 and (ii) divided by the conversion price in effect at the time of conversion. Series C Preferred Stock vote on an as-converted basis along with shares of the Companys common stock, are not entitled to receive dividends, unless specifically declared by our Board of Directors, and in the event of any liquidation, dissolution or winding up of the Company the holders of Series C Preferred Stock are entitled to receive in preference to the holders of common stock, Series A Preferred Stock, Series B Preferred Stock and any other stock, the amount equal to the stated value per share of Series C Preferred Stock. The Company may not effect, and a holder will not be entitled to, convert the Series C Preferred Stock or exercise any Series C Preferred Warrants, which, upon giving effect to such conversion or exercise, would cause the aggregate number of shares of common stock beneficially owned by the Purchaser (together with its affiliates) to exceed 4.99% (or, at the election of the holder, 9.99%) of the number of shares of common stock outstanding immediately after giving effect to the exercise. As of September 30, 2023 and 2022, the Company had 350 shares of Series C Preferred Stock outstanding, which were convertible into an aggregate of 38,889 shares of the Companys common stock.\nSeries D Convertible Preferred Stock\nThe Company has designated 4,200 shares of its preferred stock as Series D Convertible Preferred Stock (Series D Preferred Stock). The shares of Series D Preferred Stock may be converted, at the option of the holder at any time, into such number of shares of common stock equal to (i) the number of shares of Series D Preferred Stock to be converted, multiplied by the stated value of $1,000 and (ii) divided by the conversion price in effect at the time of conversion. The Company may not effect, and a holder will not be entitled to convert, the Series D Preferred Stock or exercise any Series D Preferred Warrants, which, upon giving effect to such conversion or exercise, would cause (i) the aggregate number of shares of common stock beneficially owned by the Purchaser (together with its affiliates) to exceed 4.99% (or, at the election of the holder, 9.99%) of the number of shares of common stock outstanding immediately after giving effect to the exercise. As of September 30, 2023 and 2022, the Company had no shares of Series D Preferred Stock outstanding.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nAmended and Restated Stock Incentive Plan\nThe Company has granted common stock, common stock warrants, and common stock option awards (the Equity Awards) to employees, consultants, advisors and former debt holders of the Company and to former owners and employees of acquired companies that have become employees of the Company. The Companys Amended and Restated Stock Incentive Plan (the Plan) provided for the issuance of up to 5,000 shares of common stock. This Plan expired in August 2016. On April 29, 2016, the stockholders approved a new stock incentive plan, the 2016 Stock Incentive Plan (the 2016 Plan). The 2016 Plan authorizes the award of incentive stock options, non-statutory stock options, restricted stock, unrestricted stock, performance shares, stock appreciation rights and any combination thereof to employees, officers, directors, consultants, independent contractors and advisors of the Company. The 2016 Plan provides for the issuance in the aggregate of up to 2,400,000 shares of common stock associated with awards granted under the Stock Incentive Plan. As of September 30, 2023, there were 1,831,515 options outstanding and approximately 315,422 shares available for future issuance under the 2016 Plan.\nCompensation Expense\nCompensation expense is generally recognized on a graded accelerated basis over the vesting period of grants. Compensation expense is recorded in the consolidated statements of operations with a portion charged to Cost of revenue and a portion to Operating expenses, depending on the employees department.\nDuring the years ended September 30, 2023 and 2022, compensation expense related to share-based payments was as follows:\nYear Ended September 30,\nCost of revenue\n$ 7 $ 26\nOperating expenses\n395 295\nChange in fair value of contingent consideration, interest expense and other, net\n169 157\nTotal $ 571 $ 478\nChange in fair value of contingent consideration, interest expense and other, net includes compensation expense related to the fair value of fully-vested stock options granted to directors in August 2023 and April 2022. As of September 30, 2023, the Company had approximately $0.7 million of unrecognized compensation costs related to unvested shared-based payments, which is expected to be recognized over a weighted-average period of 1.9 years.\nCommon Stock Warrants\nThe Company typically issues warrants to individual investors and placement agents to purchase shares of the Companys common stock in connection with public and private placement fund raising activities. Warrants may also be issued to individuals or companies in exchange for services provided to the Company. The warrants are typically exercisable six months after the issue date, expire in five years, and contain a cashless exercise provision and piggyback registration rights.\nMontage Warrant - As additional consideration for a prior loan arrangement which was paid in full in a prior period not presented, the Company issued to Montage Capital an eight-year warrant (the Montage Warrant) to purchase the Companys common stock at a price equal to $132.50 per share. The Montage Warrant contains an equity buy-out provision upon the earlier of (1) dissolution or liquidation of the Company, (2) any sale or distribution of all or substantially all of the assets of the Company, or (3) a Change in Control as defined within the meaning of Sections 13(d) and 14(d)(2) of the Securities Exchange Act of 1934. Montage Capital has the right to receive an equity buy-out of $250. If the equity buy-out is exercised, the Montage Warrant will be surrendered to the Company for cancellation.\nSeries A and B and C Preferred Warrants - In March 2019, in connection with the issuance of the Companys Series C Preferred Stock, the Company issued warrants to purchase the Companys common stock. These warrants were designated as (i) Series A Warrants with an initial term of 5.5 years and an exercise price of $4.00; (ii) Series B Warrants, which expired unexercised during the Companys 2021 fiscal year, with an initial term of 24 months and an exercise price of $4.00; and (iii) Series C Warrants with an initial term of 5.5 years and an exercise price of $0.05 (collectively, hereinafter referred to as the Series C Preferred Warrants). The Company also issued warrants with an exercise price of $4.00 to purchase shares of the Companys common stock to the Placement Agents. The Company may not effect, and a holder will not be entitled to convert, the Series C Preferred Stock or exercise any Series C Preferred Warrants, which, upon giving effect to such conversion or exercise, would cause (i) the aggregate number of shares of common stock beneficially owned by the Purchaser (together with its affiliates) to exceed 4.99% (or, at the election of the holder, 9.99%) of the number of shares of common stock outstanding immediately after giving effect to the exercise.\nAs of September 30, 2023, the number of shares issuable upon exercise of the (i) Series A Warrants were 872,625 shares; (ii) Series C Warrants were 13,738 shares; (iii) the Placement Agent Warrants issued in connection with the Series C Preferred Stock were 11,992 shares; and (iv) Investor Warrants were 41,621 shares.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nSeries D Preferred Warrants - In May 2021, in connection with the issuance of the Companys Series D Preferred Stock, the Company issued warrants to purchase the Companys common stock. These warrants consisted of (i) warrants issued to investors in Series D Preferred Stock to purchase in the aggregate up to 592,106 shares of common stock with an initial term of five and a half years which ends on November 16, 2026 and an initial exercise price of $2.51 and (ii) Placement Agents warrants to purchase an aggregate of 179,536 shares of common stock with an initial term of five years which ends on May 12, 2026 and an initial exercise price of $2.85. Collectively, these warrants are referred to as the Series D Preferred Warrants.\nThe Company may not effect, and a holder will not be entitled to convert, the Series D Preferred Stock or exercise any Series D Preferred Warrants, which, upon giving effect to such conversion or exercise, would cause (i) the aggregate number of shares of common stock beneficially owned by the Purchaser (together with its affiliates) to exceed 4.99% (or, at the election of the holder, 9.99%) of the number of shares of common stock outstanding immediately after giving effect to the exercise. As of September 30, 2023, no Series D Warrants have been exercised and the aggregate number of shares issuable upon exercise was 592,106 and 179,536 shares for investors and placement agents, respectively.\nThe Montage Warrants, Series A and C Preferred Warrants, the Placement Agent Warrants issued in connection with the Series C Preferred Stock, and the Series D Warrants were all determined to be derivative liabilities and are subject to remeasurement each reporting period (see Note 5).\nDuring years ended September 30, 2023 and 2022, there were 0 and 26,605 Placement Agent Warrants exercised, respectively.\nTotal warrants outstanding as September 30, 2023, were as follows:\nType\nIssue\nDate\nShares\nPrice\nExpiration\nFinancing (Montage)\n10/10/2017\n1,327 $ 132.50 10/10/2025\nInvestors\n10/19/2018\n3,120 $ 25.00 10/19/2023\nPlacement Agent\n10/16/2018\n10,000 $ 31.25 10/16/2023\nInvestors\n3/12/2019\n41,621 $ 4.00 10/19/2023\nInvestors\n3/12/2019\n872,625 $ 4.00 9/12/2024\nInvestors\n3/12/2019\n13,738 $ 0.05 9/12/2024\nPlacement Agent\n3/12/2019\n11,992 $ 4.00 9/12/2024\nPlacement Agent\n2/4/2021\n31,564 $ 3.88 2/4/2026\nInvestors\n5/14/2021\n592,106 $ 2.51 11/16/2026\nPlacement Agent\n5/14/2021\n179,536 $ 2.85 5/12/2026\nTotal\n1,757,629\nWarrant Issuances\nThe Company did not issue warrants to purchase common stock during the years ended September 30, 2023 and 2022.\nSummary of Option and Warrant Activity and Outstanding Shares\nDuring the year ended September 30, 2023, the Company, (i) issued 300,000 total options to its Chief Executive Officer at an exercise price of $1.18, which vest in 36 equal monthly installments over a three-year period, (ii) issued 50,000 total options to employees at an exercise price of $1.34, which vest ratably over a three-year period in equal quarterly installments, (iii) issued 152,000 total options to employees at an exercise price of $1.18, which vest ratably over a three-year period in equal quarterly installments, and (iv) issued 200,000 total options to the Board of Directors at an exercise price of $1.18, which vested immediately.\nDuring the year ended September 30, 2022,the Company, (i) issued 5,000 total options at an exercise price of $3.99, which vest ratably over a 3-year period, (ii) issued 120,000 total options to Board members at an exercise price of $1.85, which vested immediately upon issuance, (iii) issued 362,000 total options to its Chief Executive Officer at an exercise price of $1.85, which vest ratably over a 3-year period, (iv) issued 48,000 total options to employees at an exercise price of $1.27, which vest ratably over a 3-year period and (v) issued 200,000 total shares of restricted stock to its Chief Executive Officer at grant-date fair value of $1.29, based upon the closing price of the Companys common stock on the grant date, which vest quarterly over a 3-year period. All such options granted expire ten years from date of grant.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nThe weighted-average option fair values, as determined using the Black-Scholes option valuation model, and the assumptions used to estimate these values for stock options granted during the year ended September 30, 2023 and 2022 are as follows:\nBoard\nNon-Board\nBoard\nNon-Board\nWeighted-average fair value per share option\n$ 0.84 $ 0.90 $ 1.30 $ 1.40\nExpected life (in years)\n5.0 5.8 5.0 6.0\nVolatility\n88.5 % 90.7 % 89.2 % 95.0 %\nRisk-free interest rate\n4.1 % 4.0 % 2.8 % 2.8 %\nDividend yield\n0.0 % 0.0 % 0.0 % 0.0 %\nThe expected option term is the number of years the Company estimates the options will be outstanding prior to exercise. Expected volatility is based on historical daily price changes of the Companys common stock for a period equal to the expected life. The risk-free interest rate is based on the U.S. Treasury yield in effect at the time of grant. The expected dividend yield is zero since the Company does not currently pay cash dividends on its common stock and does not anticipate doing so in the foreseeable future.\nA summary of combined restricted stock, stock option and warrant activity is as follows:\nRestricted Stock\nStock Options\nStock Warrants\nWeighted Average\nWeighted Average\nAwards\nAwards\nExercise Price\nWarrants\nExercise Price\nOutstanding, October 1, 2021\n- 750,232 $ 4.84 1,788,745 $ 4.18\nGranted\n200,000 535,000 1.82 - -\nExercised\n- (13,334 ) 1.40 (26,605 ) 3.88\nForfeited\n- (113,838 ) 3.69 - -\nExpired\n- (133 ) 937.88 (4,511 ) 218.89\nOutstanding, September 30, 2022\n200,000 1,157,927 $ 3.49 1,757,629 $ 3.64\nGranted\n- 702,000 1.19 - -\nExercised\n- - - - -\nForfeited\n- (28,348 ) 2.49 - -\nExpired\n- (64 ) 1,873.44 - -\nOutstanding, September 30, 2023\n200,000 1,831,515 $ 2.56 1,757,629 $ 3.64\nThere were 1,148,097 and 619,461 options vested and exercisable as of September 30, 2023 and 2022, respectively. The options outstanding at September 30, 2023 and 2022 had an aggregate intrinsic value of $0 and $2, respectively.\nA summary of the status of unvested options is as follows:\nWeighted Average\nGrant-Date\nShares\nFair Value\nUnvested at October 1, 2022\n538,466 $ 1.37\nGranted\n702,000 0.89\nVested\n(541,048 ) 1.08\nForfeited/Cancelled\n(16,000 ) 1.75\nUnvested at September 30, 2023\n683,418 $ 1.10\nThe following table summarizes information about outstanding stock options at September 30, 2023:\nExercise Price\nNumber of Options\nWeighted Average Remaining Contractual Life (Years)\nWeighted Average Exercise Price\nAggregate Intrinsic Value\nOptions outstanding\n1,831,515 8.3 $ 2.56 $ -\nOptions exercisable\n1,148,097 7.8 $ 3.23 $ -\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\n13. Net Income (Loss) Per Share Attributable to Common Stockholders\nBasic and diluted net income (loss) per share is computed as follows:\n(in thousands, except share and per share data)\nYears Ended September 30,\nNumerator:\nNet income (loss) applicable to common stockholders - basic earnings per share\n$ (9,435 )\n$ 2,145\nEffect of dilutive securities:\nChange in fair value of in-the-money warrant derivative liabilities\n(6 )\n(39 )\nNet income (loss) applicable to common stockholders - diluted earnings per share\n$ (9,441 )\n$ 2,106\nDenominator:\nWeighted-average shares outstanding for basic earnings per share\n10,417,609\n10,232,862\nEffect of dilutive securities:\nOptions\n-\n81,765\nWarrants\n6,578\n13,391\nPreferred stock\n-\n38,889\nWeighted-average shares outstanding for diluted earnings per share\n10,424,187\n10,366,907\nBasic net income (loss) per share\n$ (0.91 )\n$ 0.21\nDiluted net income (loss) per share\n$ (0.91 )\n$ 0.20\nPotential common stock equivalents excluded from the computation of diluted net income (loss) per share because their inclusion would have been anti-dilutive were as follows (in shares):\nAs of September 30,\nStock options\n1,831,515\n712,907\nWarrants\n1,743,891\n1,743,891\nConvertible preferred stock\n-\n14. Commitments and Contingencies\nThe Company leases certain of its buildings under noncancelable lease agreements. Refer to the Leases footnote (Note 11) of the Notes to the Consolidated Financial Statements for additional information.\nThe Company frequently warrants that the technology solutions it develops for its clients will operate in accordance with the project specifications without defects for a specified warranty period, subject to certain limitations that the Company believes are standard in the industry. In the event that defects are discovered during the warranty period, and none of the limitations apply, the Company is obligated to remedy the defects until the solution that the Company provided operates within the project specifications. The Company is not typically obligated by contract to provide its clients with any refunds of the fees they have paid, although a small number of its contracts provide for the payment of liquidated damages upon default. The Company has purchased insurance policies covering professional errors and omissions, property damage and general liability that reduce its monetary exposure for warranty-related claims and enable it to recover a portion of any future amounts paid.\nThe Companys contracts typically provide for testing and client acceptance procedures that are designed to mitigate the likelihood of warranty-related claims, although there can be no assurance that such procedures will be effective for each project. The Company has not paid any material amounts related to warranties for its solutions. The Company sometimes commits unanticipated levels of effort to projects to remedy defects covered by its warranties. The Companys estimate of its exposure to warranties on contracts is immaterial as of September 30, 2023 and 2022.\nThe Companys agreements with customers generally require the Company to indemnify the customer against claims in which the Companys products infringe third-party patents, copyrights, or trademarks and indemnify against product liability matters. As of September 30, 2023 and 2022, the Company has not experienced any losses related to the indemnification obligations and no significant claims with respect thereto were outstanding. The Company does not expect significant claims related to the indemnification obligations and, consequently, concluded that the fair value of these obligations is negligible, and no related reserves were established.\nLitigation\nThe Company is subject to ordinary routine litigation and claims incidental to its business. As of September 30, 2023, the Company was not engaged in any material legal proceedings.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\n15. Revenues and Other Related Items\nDisaggregated Revenues\nThe Company disaggregates revenue from contracts with customers by geography and product grouping, as it believes this best depicts how the nature, amount, timing and uncertainty of revenue and cash flows are affected by economic factors.\nThe Companys revenue by geography (based on customer address) is as follows:\nYear Ended September 30,\nRevenues:\nUnited States\n$ 12,828 $ 13,202\nInternational\n3,057 3,617\n$ 15,885 $ 16,819\nThe largest concentration within the Companys international revenue geography is within Canada.\nLong-lived assets located in foreign jurisdictions aggregated approximately $1.3 million and $2.3 million as of September 30, 2023 and 2022, respectively.\nThe Companys revenue by type is as follows:\nYears Ended September 30,\nRevenues:\nDigital Engagement Services\n$ 3,146 $ 3,259\nSubscription\n11,182 11,995\nPerpetual Licenses\n- 136\nMaintenance\n541 501\nHosting\n1,016 928\n$ 15,885 $ 16,819\nDeferred Revenue\nAmounts that have been invoiced are recognized in accounts receivable, deferred revenue or revenue, depending on whether the revenue recognition criteria have been met. Deferred revenue represents amounts billed for which revenue has not yet been recognized. Deferred revenue that will be recognized during the succeeding 12-month period is recognized as current deferred revenue and the remaining portion is recognized as noncurrent deferred revenue and is included in Other long-term liabilities.\nThe following table summarizes the classification and net change in deferred revenue as of and for the years ended September 30, 2023 and 2022:\nDeferred Revenue\nCurrent\nLong Term\nBalance as of October 1, 2021\n$ 2,097 $ 418\nIncrease (decrease)\n(154 ) (34 )\nBalance as of September 30, 2022\n1,943 384\nIncrease (decrease)\n141 (39 )\nBalance as of September 30, 2023\n$ 2,084 $ 345\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\n16. Income Taxes\nThe components of the Companys tax provision (benefit) as of September 30, 2023 and 2022, is as follows:\nYear Ended September 30,\nCurrent:\nFederal\n$ - $ (11 )\nState\n6 49\nForeign\n(37 ) 37\nTotal current\n(31 ) 75\nDeferred:\nFederal\n- -\nState\n- -\nForeign\n(63 ) (45 )\nTotal deferred\n(63 ) (45 )\nGrand total\n$ (94 ) $ 30\nThe Companys income tax provision was computed using the federal statutory rate and average state statutory rates, net of related federal benefit. The provision differs from the amount computed by applying the statutory federal income tax rate to pretax income, as follows:\nYear Ended September 30,\nIncome tax provision/(benefit) at the federal statutory rate of 21%\n$ (1,995 ) $ 457\nPermanent differences, net\n1,498 (691 )\nState income tax provision/(benefit)\n(30 ) 39\nForeign income taxed at different rates\n91 (55 )\nChange in valuation allowance on deferred tax assets\n260 407\nTrue up adjustments\n82 (127 )\nTotal\n$ (94 ) $ 30\nAs of September 30, 2023, the Company has federal net operating loss (NOL) carryforwards of approximately $37.3 million of which $29.6 million is subject to the 20-year carryforward and expire on various dates through 2038. The remaining federal NOL carryforward of $7.7 million is indefinite. Internal Revenue Code Section 382 places a limitation on the amount of taxable income which can be offset by NOL carryforwards after a change in control of a loss corporation. Due to these change of ownership provisions, utilization of NOL carryforwards may be subject to an annual limitation in future periods. The Company has not performed a Section 382 analysis. However, if performed, Section 382 may be found to limit potential future utilization of the Companys NOL carryforwards. The Company also has approximately $45.4 million in state NOLs which expire on various dates through 2041.\nThe Company has deferred tax assets that are available to offset future taxable income. A valuation allowance is established if it is more likely than not that all or a portion of the deferred tax assets will not be realized. Management believes that it is more likely than not that all deferred tax assets will not be realized. Accordingly, the Company has established a valuation allowance against a portion of its deferred tax assets at September 30, 2023 and 2022. For the years ended September 30, 2023 and 2022, the valuation allowance for deferred tax assets increased by $0.3 million and $0.4 million, respectively.\nThe acquisition of HawkSearch during the third quarter of fiscal 2021 resulted in the recognition of deferred tax liabilities of approximately $1.2 million related to intangible assets. Prior to the business combination, the Company had a full valuation allowance on its net deferred tax assets. The deferred tax liabilities generated from the business combination netted against the Companys pre-existing deferred tax assets. Consequently, the impact of such resulted in the release of $1.2 million of the pre-existing valuation allowance against the deferred tax assets and corresponding deferred tax benefit recognized during fiscal 2021.\nWe recognize deferred tax assets for stock-based awards that result in deductions on our income tax returns, based on the amount of stock-based compensation recognized and the statutory tax rate in the jurisdiction in which we will receive a tax deduction. We also recognize interest accrued related to unrecognized tax benefits in interest expense. Penalties, if incurred, are recognized as a component of tax expense.\nThe Company is subject to U.S. federal income tax as well as income tax of certain state jurisdictions. The Company has not been audited by the Internal Revenue Service (IRS) or any states in connection with income taxes. The tax periods from 2020 - 2023 generally remain open to examination by the IRS and state authorities.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\nSignificant components of the Companys deferred tax assets and liabilities are as follows:\nSeptember 30,\nDeferred tax assets:\nBad debt reserve\n$ 46 $ 37\nAccrued expenses\n78 80\nNet operating loss carryforwards\n10,627 10,456\nRight of use liability\n248 146\nStock options\n379 309\nOther\n17 17\nTotal deferred tax assets\n11,395 11,045\nValuation allowance\n(10,802 ) (10,542 )\nNet deferred tax assets\n593 503\nDeferred tax liabilities:\nRight of use asset\n248 146\nDepreciation\n47 47\nIntangibles\n525 572\nTotal deferred tax liabilities\n820 765\nNet deferred tax liabilities\n$ (227 ) $ (262 )\nNet deferred tax assets are reflected in Other assets and net deferred tax liabilities are reflected in Other long-term liabilities on the consolidated balance sheets. There were no undistributed earnings of the Companys foreign subsidiaries at September 30, 2023 and 2022. The 2017 Tax Act subjects a U.S. stockholder to tax on global intangible low-taxed income (GILTI) earned by certain foreign subsidiaries. The FASB Staff Q&A, Topic 740, No. 5, Accounting for Global Intangible Low-Taxed Income, provides that an entity may make an accounting policy election to either recognize deferred taxes for temporary basis differences expected to reverse as GILTI in future years, or provide for the tax expense related to GILTI in the year the tax is incurred as a period expense only. Additionally, the 2017 Tax Act provides for a tax benefit to U.S. taxpayers that sell goods or services to foreign customers under the new Foreign Derived Intangible Income Deduction (FDII) rules. As of September 30, 2023, the Company did not have GILTI to be reported and as of September 30, 2022, the Company reported GILTI of $0.4 million, which resulted in $0.1 million of tax expense for the year ended September 30, 2022. When accounting for uncertain income tax positions, the impact of uncertain tax positions is recognized in the consolidated financial statements if they are more likely than not of being sustained upon examination, based on the technical merits of the position. The Companys management has determined that the Company has no uncertain tax positions requiring recognition as of September 30, 2023 and 2022. The Company does not expect any change to this determination in the next twelve months.\nBRIDGELINE DIGITAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands, except share and per share data)\n17. Related Party Transactions\nIn October 2013, Mr. Michael Taglich joined the Board of Directors. Michael Taglich is the Chairman and President of Taglich Brothers, Inc. (Taglich Brothers), a New York based securities firm. Taglich Brothers acted as placement agents for many of the Companys private offerings and debt issuances.\nIn connection with previous private offerings and debt issuances which occurred prior to the fiscal years presented in these consolidated financial statements, Taglich Brothers were granted Placement Agent Warrants to purchase 4,246 shares of common stock at a weighted average price of $321.00 per share and were granted Placement Agent Warrants to purchase 10,926 shares of common stock at a weighted average price of $761.61 per share.\nIn consideration of previous loans made by Michael Taglich to the Company and the personal guaranty on a former third-party credit facility no longer maintained by the Company, Mr. Taglich has been issued warrants to purchase common stock totaling 1,080 shares at an exercise price of $1,000 per share.\nIn November 2018, the Company engaged Taglich Brothers Inc, on a non-exclusive basis, to perform advisory and investment banking services to identify possible acquisition target possibilities. Fees for the services were $8 thousand per month for three months and $5 thousand per month thereafter, cancellable at any time. Taglich Brothers Inc. could also earn a success fee ranging from $200 thousand for a revenue target acquisition of under $5 million up to $1 million for an acquisition target over $200 million. In connection with the asset purchase of Stantive, Taglich Brothers earned a success fee of $200,000.\nMichael Taglich purchased 350 units in the amount of $350 of Series C Preferred Stock and associated warrants in the private transaction consummated on March 13, 2019. Mr. Taglichs purchase was subject to stockholder approval pursuant to the Nasdaq Stock Market Rule 5635(c), for which approval by the stockholders of the Company was obtained on April 26, 2019.\nIn connection with the Companys registered direct offering completed in February 2021, the Company issued Taglich Brothers 29,084 Investors warrants. Each warrant to purchase common stock expires five years from the date of issuance and is non-cash exercisable for $3.875 per share beginning six-months from the date of issuance, or February 4, 2021. The warrants expire February 4, 2026.\nIn connection with the Companys Series D Preferred Stock registered direct offering and PIPE completed in May 2021, the Company issued Taglich Brothers 53,861 Investors warrants. Each warrant to purchase common stock expires five years from the date of issuance and is non-cash exercisable for $2.850 per share beginning six-months from the date of issuance, or May 14, 2021. The warrants expire May 12, 2026.\n18. Subsequent Events\nThe Company evaluated subsequent events through the date of this filing and concluded there were no material subsequent events requiring adjustment to or disclosure in these consolidated financial statements. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nManagements Report on Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports filed under the Securities Exchange Act of 1934, as amended, is recognized, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms, and that such information is accumulated and communicated to our management, including our President and Chief Executive Officer (Principal Executive Officer) and our Chief Financial Officer (Principal Financial and Accounting Officer), as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, as ours are designed to do, and management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nAs of September 30, 2023, the end of our fiscal year covered by this report, we carried out an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures. Based on the foregoing, we concluded that our disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act) were effective as of the end of the period covered by this annual report.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Responsibility estimates and judgments by management are required to assess the expected benefits and related costs of control procedures. The objectives of internal control include providing management with reasonable, but not absolute, assurance that assets are safeguarded against loss from unauthorized use or disposition, and that transactions are executed in accordance with managements authorization and recognized properly to permit the preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States. Our management assessed the effectiveness of our internal control over financial reporting as of September 30, 2023. In making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in the 2013 Internal Control-Integrated Framework. Our management has concluded that as of September 30, 2023, our internal control over financial reporting (as defined in Rule 15d-15(e) under the Exchange Act) was effective in providing reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. Our management reviewed the results of its assessment with our Board of Directors.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to a permanent exemption from the internal control audit requirements of Section 404(b) of the Sarbanes-Oxley Act of 2002.\nInherent Limitations on Effectiveness of Controls\nInternal control over financial reporting has inherent limitations which include but are not limited to the use of independent professionals for advice and guidance, interpretation of existing and/or changing rules and principles, segregation of management duties, scale of organization, and personnel factors. Internal control over financial reporting is a process which involves human diligence and compliance and is subject to lapses in judgment and breakdowns resulting from human failures. Internal control over financial reporting also can be circumvented by collusion or improper management override. Provided its inherent limitations, internal control over financial reporting may not prevent or detect misstatements on a timely basis; however, these inherent limitations are known features of the financial reporting process and it is possible to design into the process safeguards to reduce, though not eliminate, this risk. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control over Financial Reporting\nThere have been no significant changes in our internal controls over financial reporting that occurred during the fiscal year ended September 30, 2023 that have materially, or are reasonably likely to materially affect, our internal controls over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9 C . Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe following table sets forth information regarding our directors and executive officers:\nName\nAge\nPosition\nDirector Class Expiration of\nClass Term\nJoni Kahn\nChairperson (1)(2)(3)(4)\nClass I 2024 Annual Meeting\nKenneth Galaznik\nDirector (1)(2)(4)\nClass II 2025 Annual Meeting\nScott Landers\nDirector (1)(2)(3)(4)\nClass II 2025 Annual Meeting\nMichael Taglich\nDirector\nClass III 2023 Annual Meeting\nRoger Kahn\nDirector, President and Chief Executive Officer\nClass I 2024 Annual Meeting\nThomas R. Windhausen\nChief Financial Officer, Treasurer and Secretary\n(1)\nMember of the Audit Committee.\n(2)\nMember of the Compensation Committee.\n(3)\nMember of the Nominating and Governance Committee.\n(4)\nIndependent director.\nBiographies\nJoni Kahn has been a member of our Board of Directors since April 2012. In May 2015, Ms. Kahn was appointed Chairperson of the Board of Directors. She also serves as the Chair of the Compensation Committee and is a member of the Audit and Nominating and Governance Committees. Ms. Kahn has over thirty years of operating experience with high growth software and services companies with specific expertise in the SaaS (Software as a Service), ERP (Enterprise Resource Planning) Applications, Business Intelligence and Analytics and Cybersecurity segments. From 2013 to 2015, Ms. Kahn was the Senior Vice President of Global Services for Big Machines, Inc., which was acquired by Oracle in October 2013. From 2007 to 2012, Ms. Kahn was Vice President of Services for HPs Enterprise Security Software group. From 2005 to 2007, Ms. Kahn was the Executive Vice President at BearingPoint where she managed a team of over 3,000 professionals and was responsible for North American delivery of enterprise applications, systems integration and managed services solutions. Ms. Kahn also oversaw global development centers in India, China and the U.S. From 2002 to 2005, Ms. Kahn was the Senior Group Vice President for worldwide professional services for Business Objects, a business intelligence and analytics software maker based in San Jose, CA, where she led the applications and services division that supported that company's transformation from a products company to an enterprise solutions company. Business Objects was acquired by SAP in 2007. From 2000 to 2007, Ms. Kahn was a Member of the Board of Directors for MapInfo, a global location intelligence solutions company. She was a member of MapInfos Audit Committee and the Compensation Committee. MapInfo was acquired by Pitney Bowes in 2007. From 1993 to 2000, Ms. Kahn was an Executive Vice President and Partner of KPMG Consulting, where she helped grow the firms consulting business from $700 million to $2.5 billion. Ms. Kahn received her B.B.A in Accounting from the University of Wisconsin - Madison. Ms. Kahn brings extensive leadership experience to our Board and our Audit Committee as an experienced senior executive. Ms. Kahn has over thirty years of executive level managerial, operational, and strategic planning experience leading world-class sales, service and support technology organizations. Her service on prior boards also provides financial and governance experience.\nThe Board of Directors has determined that Ms. Kahns vast experience in the technology industry and finance, as well as her executive leadership, makes her qualified to continue as the Chairperson and member of our Board of Directors. In addition, Ms. Kahn also brings extensive leadership experience to our Board and our Audit Committee as an experienced senior executive.\nKenneth Galaznik has been a member of our Board of Directors since 2006. Mr. Galaznik is the Chairman of the Companys Audit Committee and serves as a member of the Compensation Committee. From 2005 to 2016, Mr. Galaznik was the Senior Vice President, Chief Financial Officer and Treasurer of American Science and Engineering, Inc., a publicly held supplier of X-ray inspection and screening systems with a public market cap of over $200 million. Mr. Galaznik retired from his position at American Science and Engineering on March 31, 2016. From August 2002 to February 2005, Mr. Galaznik was Vice President of Finance of American Science and Engineering, Inc. From November 2001 to August 2002, Mr. Galaznik was self-employed as a consultant. From March 1999 to September 2001, he served as Vice President of Finance at Spectro Analytical Instruments, Inc. and has more than 35 years of experience in accounting and finance positions. Mr. Galaznik holds a B.B.A. degree in accounting from The University of Houston. Mr. Galaznik brings extensive experience to our Board and our Audit Committee as an experienced senior executive, a financial expert, and as a chief financial officer of a publicly-held company.\nThe Board of Directors has determined that Mr. Galazniks deep experience in finance and his executive leadership make him qualified to continue as a member of our Board of Directors.\nScott Landers has been a member of our Board of Directors since 2010. Mr. Landers is the Chair of the Nominating and Corporate Governance Committee and serves as a member of the Audit and Compensation Committees. Mr. Landers was the Chief Executive Officer of Harver, a volume hiring solution enabling global enterprises to hire at scale, from January 2022 to October 2023. From 2016 to July 2021, he was President and Chief Executive Officer of Monotype Imaging Holdings, Inc., and he also held the positions of Chief Operating Officer and Chief Financial Officer from 2008 to 2015. Monotype is a leading provider of fonts and font software, and the company was under both public and private ownership during his tenure. Prior to joining Monotype, from September 2007 until July 2008, Mr. Landers was the Vice President of Global Finance at Pitney Bowes Software, a leading global provider of location intelligence solutions. From 1997 until September 2007, Mr. Landers held several senior finance positions at MapInfo, a publicly held company which was acquired by Pitney Bowes in April 2007. Earlier in his career, Mr. Landers was a Business Assurance Manager with Coopers & Lybrand. Mr. Landers holds a bachelor's degree in accounting from Le Moyne College in Syracuse, N.Y. and a masters degree in business administration from The College of Saint Rose in Albany, N.Y. Mr. Landers brings extensive experience to our Board and our Audit Committee as an experienced senior executive, a financial expert, and a chief executive officer and a chief financial officer of a publicly-held company.\nOur Board of Directors has determined that Mr. Landers financial skills, public-company experience, strategic business acumen and executive leadership make him qualified to continue as a member of our Board of Directors.\nMichael Taglich has been a member of our Board of Directors since 2013. He is the Chairman and President of Taglich Brothers, Inc., a New York City based securities firm which he co-founded in 1992 with his brother Robert Taglich. Taglich Brothers, Inc. focuses on public and private micro-cap companies in a wide variety of industries. He is currently the Chairman of the Board of Air Industries Group Inc., a publicly traded aerospace and defense company (NYSE AIRI), and Mare Island Dry Dock Inc., a privately-held company. He also serves as a director of a number of other private companies. Michael Taglich brings extensive professional experience which spans various aspects of senior management, including finance, operations and strategic planning. Mr. Taglich has more than 30 years of financial industry experience and served on his first public company board over 20 years ago.\nOur Board of Directors has determined that Mr. Taglichs executive strategic business skills in both private and public companies, as well as his experience leading and advising high-growth companies, make him qualified to continue as a member of our Board of Directors.\nRoger Kahn has been a member of our Board of Directors since December 2017. Mr. Kahn joined the Company as the Chief Operating Officer in August 2015 and has been our President and Chief Executive Officer since May 2016. Prior to joining Bridgeline Digital, Mr. Kahn co-founded FatWire, a leading content management and digital engagement company. As the General Manager and Chief Technology Officer of FatWire, Mr. Kahn built the company into a global corporation with offices in thirteen countries. FatWire was acquired by Oracle in 2011. Mr. Kahn received his Ph.D. in Computer Science and Artificial Intelligence from the University of Chicago.\nOur Board of Directors has determined that Mr. Kahns vast experience as a successful entrepreneur in the technology space, as well as his technical and leadership acumen, make him qualified to continue as a member of our Board of Directors.\nThomas Windhausen has served as the Companys Chief Financial Officer and Treasurer since November 2021. Prior to that he served as the Companys VP of Finance since October 2021. Mr. Windhausen came to Bridgeline with more than 20 years of experience in both public accounting and industry. Prior to joining the Company, Mr. Windhausen served as a VP of Finance with Comtech Telecommunications Corp. from July 2019 to September 2021, and from June 2011 to June 2019, Mr. Windhausen held various accounting and finance roles with Dealertrack Technologies, Inc., and its successor Cox Automotive Inc. Mr. Windhausen started his career at PricewaterhouseCoopers, where he spent more than 10 years. He received his Bachelors of Science degree in Accounting from Le Moyne College in Syracuse, N.Y. and he is a member of the American Institute of Certified Public Accountants and New York State Society of Certified Public Accountants.\nThere are no family relationships between any of the directors and the Companys executive officers, including between Ms. Joni Kahn and Mr. Roger Kahn, the Companys President and Chief Executive Officer.\nSection 16(A) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Exchange Act requires the Companys executive officers, directors and persons who beneficially own more than 10% of a registered class of the Companys equity securities to file certain reports regarding ownership of, and transactions in, the Companys securities with the Securities and Exchange Commission. These officers, directors and stockholders are also required by SEC rules to furnish the Company with copies of all Section 16(a) reports that they file with the SEC. Based solely on a review of the copies of such forms and amendments thereto received by it, the Company believes that during the fiscal year ended September 30, 2023, all Section 16(a) filing requirements applicable to our officers, directors, and greater than 10% beneficial owners have been met, with the exception of two Form 4s for Roger Kahn that were both inadvertently filed untimely, disclosing four transactions and three transactions, respectively.\nCode of Conduct and Ethics\nThe Companys Board of Directors has adopted a Code of Ethics within the meaning of Item 406(b) of Regulation S-K of the Securities Act that applies to all of the Companys officers and employees, including its principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions. The Code of Ethics codifies the business and ethical principles that govern the Companys business. A copy of the Code of Ethics is available on the Company's website www.bridgeline.com. The Company intends to post amendments to or waivers from its Code of Ethics (to the extent applicable to its principal executive officer, principal financial officer or principal accounting officer) on its website. The Companys website is not incorporated herein by reference.\nMeetings of the Board of Directors\nDuring fiscal 2023, the Board of Directors met 6 times.\nCommittees of the Board of Directors\nThe Company has an Audit Committee, a Compensation Committee and a Nominating and Corporate Governance Committee.\nAudit Committee\nThe Audit Committee assists the Board in the oversight of the audit of our consolidated financial statements and the quality and integrity of our accounting, auditing and financial reporting processes. The Audit Committee is responsible for making recommendations to the Board concerning the selection and engagement of independent registered public accountants and for reviewing the scope of the annual audit, audit fees, results of the audit and auditor independence. The Audit Committee also reviews and discusses with management and the Board such matters as accounting policies, internal accounting controls and procedures for preparation of financial statements. Our Audit Committee is comprised of Mr. Galaznik (Chair), Ms. Kahn and Mr. Landers. Our Board has determined that each of the members of the Audit Committee meet the criteria for independence under the standards provided by the Nasdaq Stock Market. The Board of Directors has adopted a written charter for the Audit Committee. A copy of such charter is available on the Companys website, www.bridgeline.com. During fiscal 2023, the Audit Committee met 4 times. Each member of the Audit Committee attended each such meeting. The Chairman of the Audit Committee was present at all meetings.\nOur Board has also determined that Mr. Galaznik and Mr. Landers both qualify as an audit committee financial expert as defined under Item 407(d)-(5) of Regulation S-K and as an independent director as defined by the Nasdaq listing standards.\nCompensation Committee\nThe Compensation Committee evaluates the performance of our senior executives, considers the design and competitiveness of our compensation plans, including the review of independent research and data regarding compensation paid to executives of public companies of similar size and geographic location, reviews and approves senior executive compensation and administers our equity compensation plans. In addition, the Committee also conducts reviews of executive compensation to ensure compliance with Section 162(m) of the Internal Revenue Code of 1986, as amended. Our Compensation Committee is comprised of Ms. Kahn (Chair), Mr. Galaznik and Mr. Landers, all of whom are independent directors. The Board of Directors has adopted a written charter for the Compensation Committee. A copy of such charter is available on the Companys website, www.bridgeline.com. During fiscal 2023, the Compensation Committee met 2 times and acted 1 time by unanimous written consent.\nNominating and Corporate Governance Committee\nThe Nominating and Governance Committee identifies candidates for future Board membership and proposes criteria for Board candidates and candidates to fill Board vacancies, as well as a slate of directors for election by the stockholders at each annual meeting. The Nominating and Governance Committee also annually assesses and reports to the Board on Board and Board Committee performance and effectiveness and reviews and makes recommendations to the Board concerning the composition, size and structure of the Board and its committees. A copy of such charter is available on the Company's website, www.bridgeline.com. Our Nominating and Governance Committee is comprised of Mr. Landers (Chair) and Ms. Kahn, each of whom are independent directors. During fiscal 2023, the Nominating and Governance Committee met 3 times. Item 11. Executive Compensation.\nSummary Compensation Table\nThe following Summary Compensation Table sets forth the total compensation paid or accrued for the fiscal years ended September 30, 2023 and September 30, 2022 for our principal executive officer and our other two most highly compensated executive officers who were serving as executive officers as of September 30, 2023. We refer to these officers as our named executive officers.\nName and Principal Position\nFiscal Year End\nSalary\nBonus\nTotal\nRoger Kahn - President and Chief Executive Officer\n$ 400,000\n$ 99,188\n$ 499,188\n$ 339,333\n$ 114,411\n$ 453,744\nThomas R. Windhausen - Chief Financial Officer, Treasurer, and Secretary\n$ 251,250\n$ 42,534\n$ 293,784\n$ 240,000\n$ 16,818\n$ 256,818\nEmployment Agreements\nRoger Kahn\nOn August 24, 2015, Mr. Roger Ari Kahn joined Bridgeline Digital, Inc. as the Companys Chief Operating Officer. On December 1, 2015, Mr. Kahn and another were named Co-Interim Chief Executive Officers and Presidents and assumed the responsibilities of the Office of the Chief Executive Officer and President. On May 6, 2016, the Company appointed Mr. Kahn as President and Chief Executive Officer, effective May 10, 2016. Mr. Kahns employment agreement was amended and reported on Form 8-K filed with the SEC on May 13, 2016.\nA new employment agreement was entered into on September 13, 2019 by and between the Company and Mr. Kahn. The principal change to Mr. Kahns employment agreement, is that it will automatically renew each fiscal year unless the Company provides written notice of its intent not to renew such employment agreement at least sixty (60) days in advance of the Companys fiscal year rather than the employment agreement only renewing upon notice from the Company. In furtherance of Mr. Kahns employment with the Company, a first amendment to Mr. Kahn, which amended the September 12, 2019 employment agreement, entitles Mr. Kahn to an annual salary of $330,000 starting on the date of the amendment and an annual bonus of $137,500.\nOn August 18, 2022, an amendment to the employment agreement between the Company and Mr. Kahn was made, effective August 14, 2022 (theSecond Amendment). The Second Amendment provides for the following: (i) an increase in Mr. Kahns annual salary to $400,000; (ii) the opportunity for Mr. Kahn to earn a periodic incentive bonus, subject to his satisfaction of certain performance metrics; and (iii) the Companys right, but not its obligation, to issue discretionary equity incentive awards to Mr. Kahn, subject to applicable award agreements, equity incentive plans, and other such applicable terms, restrictions, and provisions. In connection with the Second Amendment, Mr. Kahn was given the opportunity to earn a $100,000 bonus with respect to the second half of fiscal 2022 and was awarded 200,000 shares of restricted stock (the Restricted Stock Award), pursuant to the Companys 2016 Stock Incentive Plan. Mr. Kahns Restricted Stock Award vests in quarterly installments over a three year period. Mr. Kahn will also have the opportunity to earn one or more future incentive bonuses aggregating $200,000 for each year. All other terms of Mr. Kahns employment agreement, as amended are unchanged.\nThomas R. Windhausen\nEffective November 30, 2021, Thomas R. Windhausen was appointed by the Companys Board of Directors as Chief Financial Officer and Treasurer of the Company. The Company and Mr. Windhausen entered into an employment agreement (the Employment Agreement), effective November 30, 2021 through September 30, 2022, unless extended by mutual agreement of the Company and Mr. Windhausen, whereby he will receive $240,000 base salary and the ability to earn a bi-annual incentive bonus of $22,500, which incentive bonus may be awarded to Mr. Windhausen at the discretion of the Companys Compensation Committee. The Employment Agreement also provides that Mr. Windhausen will be eligible to participate in all other employee benefits plans and programs, and, in the event Mr. Windhausens employment is terminated by the Company without cause, he is entitled to receive severance benefits.\nOutstanding Equity Awards at Fiscal 2023 Year-End\nThe following table sets forth information concerning outstanding stock options for each named executive officer as of September 30, 2023.\nName\nGrant Date\nNumber of Securities Underlying Unexercised Options Exercisable (1)\nNumber of Securities Underlying Unexercised Options Unexercisable (1)\nExercise Price ($/sh)\nOption Expiration Date\nRoger Kahn\n8/24/2015\n(1)\n-\n$ 287.50\n8/24/2025\n8/19/2016\n(1)\n4,446\n-\n$ 205.00\n8/19/2026\n11/20/2019\n(1)\n249,353\n-\n$ 1.40\n11/20/2029\n4/14/2022\n(2)\n181,000\n181,000\n$ 1.85\n4/14/2032\n6/30/2023\n(2)\n25,000\n275,000\n$ 1.18\n6/30/2033\nTotal\n460,599\n456,000\nThomas R. Windhausen\n9/30/2021\n(1)\n20,000\n10,000\n$ 4.11\n9/30/2031\n6/30/2023\n(3)\n2,500\n27,500\n$ 1.18\n6/30/2033\nTotal\n22,500\n37,500\n(1) Shares vest in equal installments upon the anniversary date of the grant over three years.\n(2)\nShares vest in equal installments on a monthly basis over three years.\n(3) Shares vest in equal installments on a quarterly basis over three years.\nRoger Kahn also holds 200,000 shares of restricted stock granted which were granted in August 2022 and which vest in quarterly installments over a three year period. As of September 30, 2023, 133,336 shares remained restricted.\nDirector Compensation\nThe non-employee members of our Board of Directors are compensated as follows:\n●\nCompensation. Each outside director receives an annual retainer of $12,000 and is compensated $1,500 for each meeting such director attends in person. Members of the Audit Committee receive additional annual compensation of $3,000.\n●\nCommittee Chair Bonus. The Chair of the Board of Directors receives an additional annual fee of $15,000. The Chair of the Audit Committee receives an additional annual fee of $10,000. The Chairs of the Compensation Committee and Nominating and Corporate Governance Committee each receive an additional annual fee of $5,000. These fees are payable in lump sums in advance. Other directors who serve on our standing committees, other than the Audit Committee, do not receive additional compensation for their committee services.\nDirector Compensation Table\nThe following table sets forth information concerning the compensation paid to our non-employee directors during the fiscal year ended September 30, 2023.\nDirector\nAnnual\nRetainer\nBoard\nMeetings\nChairman\nAdditional\nTotal\nKen Galaznik\n$ 12,000\n$ 6,000\n$ 10,000\n$ -\n$ 28,000\nJoni Kahn\n12,000\n6,000\n15,000\n3,000\n36,000\nScott Landers\n12,000\n6,000\n5,000\n3,000\n26,000\nMichael Taglich\n12,000\n6,000\n-\n-\n18,000\n$ 48,000\n$ 24,000\n$ 30,000\n$ 6,000\n$ 108,000 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nBeneficial ownership is determined in accordance with Rule 13d-3 under the Exchange Act. In computing the number of shares beneficially owned by a person or a group and the percentage ownership of that person or group, shares of our common stock subject to options or warrants currently exercisable or exercisable within 60 days after December 22, 2023 are deemed outstanding, but are not deemed outstanding for the purpose of computing the percentage ownership of any other person. Unless otherwise indicated, the address of each individual named below is our address, 100 Sylvan Road, Suite G-700, Woburn, Massachusetts 01801.\nThe following tables set forth, as of December 22, 2023, the beneficial ownership of our Series C Preferred and Common Stock by (i) each person or group of persons known to us to beneficially own more than 5% of the outstanding shares of each class of the outstanding securities, (ii) each of our directors and named executive officers, and (iii) all of our executive officers and directors as a group. At the close of business on December 22, 2023, there were 350 shares of our Series C Preferred and 10,417,609 shares of our Common Stock issued and outstanding.\nExcept as indicated in the footnotes to the tables below, each stockholder named in the table has sole voting and investment power with respect to the shares shown as beneficially owned by such stockholder.\nThis information is based upon information received from or on behalf of the individuals named herein.\nSeries C Preferred Stock\nName and Address\nNumber of Shares Owned\nPercent of Shares Outstanding\nMichael and Claudia Taglich, 790 New York Avenue, Huntington, NY 11743\n(A)\n100%\nAll current executive officers and directors as a group\n*\n(A)\nHolder of Series C Preferred are entitled to vote on all matters presented to our stockholders on an as-converted basis. Each share of Series C Preferred Stock is convertible, at the option of each respective holder, into approximately 111.11 shares of Common Stock.\nCommon Stock\nName and Address\nNumber of Shares Owned\nPercent of Shares Outstanding\nRoger Kahn President - Chief Executive Officer, Director\n1,488,397\n(1)\n13.57%\nMichael Taglich - Director\n318,934\n(2)\n2.99%\nJoni Kahn - Director\n118,153\n(3)\n1.12%\nScott Landers - Director\n118,150\n(4)\n1.12%\nKenneth Galaznik - Director\n118,187\n(5)\n1.12%\nThomas R. Windhausen - Chief Financial Officer, Treasurer, and Secretary\n25,000\n(6)\n0.24%\nAll current executive officers and directors as a group\n2,186,821\n(7)\n18.84%\n(1)\nIncludes 552,544 shares of Common Stock subject to currently exercisable options (includes options that will become exercisable within 60 days of December 22, 2023). Includes 200,000 shares of restricted stock. Includes 545 shares of common stock owned by Mr. Kahns spouse.\n(2)\nIncludes 117,668 shares of Common Stock subject to currently exercisable options (includes options that will become exercisable within 60 days of December 22, 2023) and 100,500 shares issuable upon the exercise of warrants, and 38,889 shares issuable upon the exercise of Series C preferred stock Also includes 35 shares of Common Stock and 2 shares issuable upon the exercise of warrants owned by Mr. Taglichs spouse.\n(3)\nIncludes 117,588 shares of Common Stock subject to currently exercisable options (includes options that will become exercisable within 60 days of December 22, 2023).\n(4)\nIncludes 117,588 shares of Common Stock subject to currently exercisable options (includes options that will become exercisable within 60 days of December 22, 2023). Includes 8 shares of Common Stock owned by Mr. Landers children.\n(5)\nIncludes 117,588 shares of Common Stock subject to currently exercisable options (includes options that will become exercisable within 60 days of December 22, 2023).\n(6)\nIncludes 25,000 shares of Common Stock subject to currently exercisable options (includes options that will become exercisable within 60 days of December 22, 2023).\n(7)\nIncludes 1,047,976 shares of Common Stock subject to currently exercisable options (includes options that will become exercisable within 60 days of December 22, 2023), and 139,389 other issuable shares including warrants and preferred stock.\nWe maintain a number of equity compensation plans for employees, officers, directors and other entities and individuals whose efforts contribute to our success. The table below sets forth certain information as of our fiscal year ended September 30, 2023, regarding the shares of our common stock available for grant or granted under our equity compensation plans.\nEquity Compensation Plan Information\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights\nWeighted average exercise price of outstanding options, warrants and rights\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\nPlan category\n(a)\n(b)\n(c)\nEquity compensation plans approved by security holders\n1,831,515\n$ 2.56\n315,422\nEquity compensation plans not approved by security holders (1)\n1,757,629\n3.64\n-\nTotal\n3,589,144\n$ -\n315,422\n(1)\nAt September 30, 2023, there were 1,757,629 total warrants outstanding. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nItem 404(d) of Regulation S-K requires the Company to disclose any transaction or proposed transaction which occurred since the beginning of the two most recently completed fiscal years in which the amount involved exceeds the lesser of $120,000 or one percent (1%) of the average of the Companys total assets as of the end of the last two completed fiscal years in which the Company is a participant and in which any related person has or will have a direct or indirect material interest. A related person is any executive officer, director, nominee for director, or holder of 5% or more of the Company's Common Stock, or an immediate family member of any of those persons.\nIn accordance with our Audit Committee charter, our Audit Committee is responsible for reviewing and approving the terms of any related-party transactions. Therefore, any material financial transaction between the Company and any related person would need to be approved by our Audit Committee prior to the Company entering into such transaction.\nIn October 2013, Mr. Michael Taglich joined the Board of Directors. Michael Taglich is the Chairman and President of Taglich Brothers, Inc., a New York based securities firm. Taglich Brothers, Inc. acted as placement agents for many of the Companys private offerings and debt issuances. In consideration of previous loans made by Michael Taglich to the Company and the personal guaranty on a former third-party credit facility no longer maintained by the Company, Mr. Taglich has been issued warrants to purchase common stock totaling 1,080 shares at an exercise price of $1,000.00 per share.\nIn connection with previous private offerings and debt issuances, which occurred prior to the fiscal years presented in these consolidated financial statements, Taglich Brothers, Inc. was granted Placement Agent Warrants to purchase 4,246 shares of common stock at a weighted average price of $321.00 per share and were granted Placement Agent Warrants to purchase 10,926 shares of common stock at a weighted average price of $761.61 per share.\nIn November 2018, the Company engaged Taglich Brothers, on a non-exclusive basis, to perform advisory and investment banking services to identify possible acquisition target possibilities. Fees for the services were $8 thousand per month for three months and $5 thousand thereafter, cancellable at any time. Taglich Brothers could also earn a success fee ranging from $200,000 for a revenue target acquisition of under $5 million up to $1 million for an acquisition target over $200 million. In connection with the asset purchase of Stantive, Taglich Brothers earned a success fee of $200,000.\nMichael Taglich purchased 350 units in the amount of $350,000 of Series C Preferred Stock and associated warrants in the private transaction consummated on March 13, 2019. Mr. Taglichs purchase was subject to stockholder approval pursuant to the Nasdaq Stock Market Listing 5635(c), for which approval by the stockholders of the Company was obtained on April 26, 2019.\nIn connection with the Companys registered direct offering completed in February 2021, the Company issued Taglich Brothers 29,084 Investors warrants. Each warrant to purchase common stock expires five years from the date of issuance and is non-cash exercisable for $3.875 per share beginning six-months from the date of issuance, or February 4, 2021. The warrants expire February 4, 2026.\nIn connection with the Companys Series D Preferred Stock registered direct offering and PIPE completed in May 2021, the Company issued Taglich Brothers 53,861 Investors warrants. Each warrant to purchase common stock expires five years from the date of issuance and is non-cash exercisable for $2.850 per share beginning six-months from the date of issuance, or May 14, 2021. The warrants expire May 12, 2026. Item 14. Principal Accounting Fees and Services.\nAudit Fees\nThe firm of PKF OConnor Davies LLP acts as our principal independent registered public accounting firm (PCAOB ID No. 127). They have served as our independent auditors since February 27, 2021.\nThe table below shows the aggregate fees that the Company paid or accrued for the audit and other services provided by PKF OConnor Davies LLP for the fiscal year ended September 30, 2023 and 2022. The Company did not engage its independent registered public accounting firm during either of the fiscal years ended September 30, 2023 or September 30, 2022 for any other non-audit services.\nType of Service\nAmount of Fee for Fiscal Year Ended\nSeptember 30, 2023\nSeptember 30, 2022\nAudit Fees\n$ 245,500\n$ 243,050\nAudit-Related Fees\n-\n-\nTax Fees\n-\n-\nTotal\n$ 245,500\n$ 243,050\nAudit Fees. This category includes fees for the audits of the Company's annual financial statements, review of financial statements included in the Company's Form 10-Q Quarterly Reports and services that are normally provided by the independent auditors in connection with statutory and regulatory filings or engagements for the relevant fiscal years.\nAudit-Related Fees. This category consists of audits performed in connection with certain acquisitions.\nTax Fees. This category consists of professional services rendered for tax compliance, tax planning and tax advice. The services for the fees disclosed under this category include tax return preparation, research and technical tax advice.\nThere were no other fees paid or accrued to PKF OConnor Davies, LLP in the fiscal years ended September 30, 2023 or September 30, 2022.\nAudit Committee Pre-Approval Policies and Procedures.\nBefore an independent public accounting firm is engaged by the Company to render audit or non-audit services, the engagement is approved by the Audit Committee. Our Audit Committee has the sole authority to approve the scope of the audit and any audit-related services as well as all audit fees and terms. Our Audit Committee must pre-approve any audit and non-audit related services by our independent registered public accounting firm. During our fiscal year ended September 30, 2023, no services were provided to us by our independent registered public accounting firm other than in accordance with the pre-approval procedures described herein.\nPART IV Item 15. Exhibits and Financial Statement Schedules.\n(a) Documents Filed as Part of this Form 10-K\n1. Financial Statements (included in Item 8 of this report on Form 10-K):\n- Reports of Independent Registered Public Accounting Firm\n-Consolidated Balance Sheets as of September 30, 2023 and 2022\n-Consolidated Statements of Operations for the years ended September 30, 2023 and 2022\n-Consolidated Statements of Comprehensive Income/(Loss) for the years ended September 30, 2023 and 2022\n-Consolidated Statements of Stockholders Equity for the years ended September 30, 2023 and 2022\n-Consolidated Statements of Cash Flows for the years ended September 30, 2023 and 2022\n-Notes to Consolidated Financial Statements\n2. Financial Statement Schedules\n-Not applicable\n(b) Exhibits\nDocuments listed below, except for documents followed by a parenthetical, are being filed as exhibits. Documents followed by a parenthetical are not being filed herewith and, pursuant to Rule 12b-32 of the General Rules and Regulations promulgated by the SEC under the Securities Exchange Act of 1934 (the Act), reference is made to such documents as previously filed as exhibits with the SEC.\nIncorporated by Reference\nExhibit\nNo.\nExhibit\nForm\nFiling\nDate\nExhibit\nNo.\nFiled\nHerewith\n3.1\nAmended and Restated Certificate of Incorporation, as amended\n10-Q\nMay 15, 2013\n3.1\n3.2\nAmended and Restated By-Laws\n8-K\nDecember 14, 2018\n3.1\n3.3\nAmendment to the Amended and Restated Bylaws of Bridgeline Digital, Inc., dated September 9, 2021\n8-K\nSeptember 10, 2021\n3.1\n3.4\nCertificate of Designation of the Series A Convertible Preferred Stock\n8-K\nNovember 4, 2014\n3.1\n3.5\nCertificate of Designation of the Series B Convertible Preferred Stock\n8-K\nOctober 19, 2018\n3.1\n4.1\nRegistration Rights Agreement, dated November 3, 2016, by and between Bridgeline Digital, Inc. and the Investors party thereto\n8-K\nNovember 4, 2016\n10.3\n10.1\nAmended and Restated Stock Incentive Plan, as amended\nDEF 14 A\nJuly 14, 2014\nAppendix C\n10.2\nForm of Common Stock Purchase Warrant Issued to Placement Agent\n8-K\nNovember 4, 2014\n10.2\n10.3\nForm of Common Stock Purchase Warrant Issued by Company to Michael Taglich dated January 7, 2015\n8-K\nJanuary 9, 2015\n10.2\n10.4\nForm of Common Stock Purchase Warrant Issued by Company to Michael Taglich dated February 17, 2015\n10-Q\nFebruary 17, 2015\n10.2\n10.5\nForm of Restricted Stock Agreement\n10-Q\nMay 15, 2015\n10.6\n10.6\nForm of Common Stock Purchase Warrant Issued by Company to Michael Taglich dated May 12, 2015\n10-Q\nMay 15, 2015\n10.9\n10.7\nForm of Common Stock Purchase Warrant Issued by Company to Michael Taglich dated July 21, 2015\n8-K\nJuly 24, 2015\n10.2\n10.8\nBridgeline Digital Inc. 2016 Stock Incentive Plan\nDEF 14 A\nMarch 22, 2016\nAppendix B\n10.9\nForm of Common Stock Purchase Warrant issued to Placement Agent\n8-K\nMay 17, 2016\n10.3\n10.10\nPlacement Agreement between Bridgeline Digital, Inc and Taglich Brothers, Inc dated March 31, 2016\n8-K\nJune 15, 2016\n10.3\n10.11\nForm of Securities Purchase Agreement dated November 3, 2016\n8-K\nNovember 4, 2016\n10.1\n10.12\nForm of Purchaser Warrant\n8-K\nNovember 4, 2016\n10.2\n10.13\nForm of Registration Rights Agreement dated November 3, 2016\n8-K\nNovember 4, 2016\n10.3\n10.14\nForm of Insider Securities Purchase Agreement dated November 3, 2016\n8-K\nNovember 4, 2016\n10.4\n10.15\nLoan and Security Agreement between Bridgeline Digital, Inc and Montage Capital II, L.P. dated October 10, 2017\n8-K\nOctober 13, 2017\n10.1\n10.16\nForm of Warrant to Purchase Stock issued to Montage Capital II, L.P\n8-K\nOctober 13, 2017\n10.2\n10.17\nIntercreditor Agreement between Heritage Bank of Commerce and Montage Capital II, L.P dated October 10, 2017\n8-K\nOctober 13, 2017\n10.3\n10.18\nFirst Amendment to the Loan and Security Agreement between Bridgeline Digital, Inc and Montage Capital II. LP, dated May 10, 2018\n10-Q\nMay 15, 2018\n10.2\n10.19\nForm of Note Purchase Agreement\n8-K\nSeptember 11, 2018\n10.1\n10.20\nForm of Promissory Note\n8-K\nSeptember 11, 2018\n10.2\n10.21\nForm of Subordination Agreement\n8-K\nSeptember 11, 2018\n10.3\n10.22\nSecond Amendment to the Loan and Security Agreement between Bridgeline Digital, Inc and Montage Capital II, L.P., dated October 22, 2018\n8-K\nOctober 24, 2018\n10.1\n10.23\nFirst Amendment to the Bridgeline Digital, Inc. 2016 Stock Incentive Plan\nDEF 14-A\nAugust 23, 2019\nAppendix B\n10.24\nShare Purchase Agreement, by and between the Company and WooRank SRL., dated February 2, 2021\n8-K\nFebruary 3, 2021\n10.1\n10.25\nForm of Securities Purchase Agreement, dated February 4, 2021\n8-K\nFebruary 9, 2021\n10.1\n10.26\nForm of Placement Agent Warrant, dated February 4, 2021\n8-K\nFebruary 9, 2021\n10.2\n10.27\nEmployment Agreement dated September 13, 2019 between Bridgeline Digital, Inc. and Roger Ari Kahn\n8-K\nSeptember 19, 2018\n10.1\n10.28\nFirst Amendment to Roger Ari Kahns Employment Agreement dated February 25, 2021\n8-K\nMarch 2, 2021\n10.1\n10.29\nShare Purchase Agreement, by and between the Company, Svanaco, Inc., an Illinois corporation, Svanawar, Inc., an Illinois corporation, and HawkSearch Inc., an Illinois corporation, dated May 11, 2021\n8-K\nMay 12, 2021\n10.1\n10.30\nEmployment Agreement dated November 30, 2021 between Bridgeline Digital, Inc. and Thomas R. Windhausen\n10-K\nDecember 20, 2021\n10.29\n10.31\nSecond Amendment to the Bridgeline Digital, Inc. 2016 Stock Incentive Plan\nDEF 14-A\nFebruary 14, 2022\nAppendix A\n10.32\nAmendment to Stock Purchase Agreement, among Bridgeline Digital, Inc., Svanaco, Inc., Svanawar, Inc., and HawkSearch Inc., dated June 15, 2022.\n8-K\nJune 22, 2022\n10.1\n10.33\nSecond Amendment to Roger Ari Kahns Employment Agreement, effective August 14, 2022\n8-K\nAugust 24, 2022\n10.1\n10.34\nThird Amendment to the Bridgeline Digital, Inc. 2016 Stock Incentive Plan\nDEF 14-A\nApril 17, 2023\nAppendix A\nExhibit\nIncorporated by Reference\nFiled\nNo.\nExhibit\nForm\nFiling Date\nExhibit No.\nHerewith\n21.1\nSubsidiaries of the Registrant\nX\n23.1\nConsent of PKF OConnor Davies, LLP\nX\n31.1\nCEO Certification, Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n31.2\nCFO Certification, Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n32.1\nCEO Certification, Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2\nCFO Certification, Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\nClawback Policy\nX\n101.INS**\nInline XBRL Instance\nX\n101.SCH**\nInline XBRL Taxonomy Extension Schema\nX\n101.CAL**\nInline XBRL Taxonomy Extension Calculation\nX\n101.DEF**\nInline XBRL Taxonomy Extension Definition\nX\n101.LAB**\nInline XBRL Taxonomy Extension Labels\nX\n101.PRE**\nInline XBRL Taxonomy Extension Presentation\nX\nCover Page Interactive Data File (embedded within the Inline XBRL and contained in Exhibit 101)\nX\n(c) Financial Statement Schedules\nNot applicable\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nBRIDGELINE DIGITAL, INC.\na Delaware corporation\nBy:\n/s/ Roger Kahn\nName: Roger Kahn\nDecember 27, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Roger Kahn\nPresident and Chief Executive Officer, Director\n(Principal Executive Officer)\nDecember 27, 2023\nRoger Kahn\n/s/ Thomas R. Windhausen\nChief Financial Officer\nDecember 27, 2023\nThomas R. Windhausen\n(Principal Financial Officer)\n/s/Kenneth Galaznik\nDirector\nDecember 27, 2023\nKenneth Galaznik\n/s/ Joni Kahn\nDirector\nDecember 27, 2023\nJoni Kahn\n/s/ Scott Landers\nDirector\nDecember 27, 2023\nScott Landers\n/s/ Michael Taglich\nDirector\nDecember 27, 2023\nMichael Taglich"
}