{
    "cik": "1378992",
    "company": "BERRY GLOBAL GROUP, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-11-17",
    "period_of_report": "2023-09-30",
    "sic": "3089",
    "state_of_inc": "DE",
    "state_location": "IN",
    "fiscal_year_end": "1001",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1378992/0001140361-23-053869-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1378992/000114036123053869/form10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1378992/0001140361-23-053869.txt",
    "filename": "1378992_10K_2023_0001140361-23-053869.htm",
    "content": "Item\n1. BUSINESS\n(In millions of dollars, except as otherwise noted)\nGeneral\nBerry Global Group, Inc. (Berry, we, or the Company) is a leading global supplier of a broad range of innovative rigid, flexible and non-woven products. We sell our products predominantly into stable, consumer-oriented end markets, such as healthcare, personal care, and food and beverage. Our customers consist of a diverse mix of global, national, regional and local specialty businesses. For the fiscal year ended September 30, 2023 (fiscal 2023),\nno single customer represented more than 5% of net sales and our top ten customers represented 15% of net sales. We believe our manufacturing processes, manufacturing footprint and our ability to leverage our scale to reduce costs, positions us as a low-cost manufacturer relative to our competitors.\nAdditional financial information about our segments is provided in Managements Discussion and Analysis of Financial Condition and Results of Operations and the Notes to Consolidated Financial Statements sections of this report.\nSegment Overview\nThe Companys operations are organized into four reporting segments: Consumer Packaging International, Consumer Packaging North America, Engineered Materials, and Health, Hygiene & Specialties. The structure is designed to align us with our customers, provide optimal service, drive future growth, and to facilitate synergy realization.\nConsumer Packaging International\nThe Consumer Packaging International segment is a manufacturer of rigid products that primarily services non-North American markets. Product groups within the segment include Closures and Dispensing Systems, Pharmaceutical Devices and Packaging, Bottles and Canisters, Containers, and Technical Components. In fiscal 2023, Consumer Packaging International accounted for 32% of our consolidated net sales.\nConsumer Packaging North America\nThe Consumer Packaging North America segment is a manufacturer of rigid products that primarily services North American markets. Product groups within the segment include Containers and Pails, Foodservice, Closures, Bottles and Prescription Vials, and Tubes. In fiscal 2023, Consumer Packaging North America accounted for 24% of our consolidated net sales.\nEngineered Materials\nThe Engineered Materials segment is a manufacturer of flexible products that services primarily North American and European markets. Product groups within the segment include Stretch and Shrink Films, Converter Films, Institutional Can Liners, Food and Consumer Films, Retail Bags, and Agriculture Films. In fiscal 2023, Engineered Materials accounted for 23% of our consolidated net sales.\nHealth, Hygiene & Specialties\nThe Health, Hygiene & Specialties segment is a manufacturer of non-woven and related products that services global markets. Product groups within the segment include Healthcare, Hygiene, Specialties, and Tapes. In fiscal 2023, Health, Hygiene & Specialties accounted for 21% of our consolidated net sales.\nDuring fiscal 2023, the Company announced that it has initiated a formal process to evaluate strategic alternatives for its Health, Hygiene and Specialties segment and has determined the segment does not meet the criteria of Held for Sale as of year end.\nMarketing, Sales, and Competition\nWe reach our large and diversified customer base through a direct sales force of dedicated professionals and the strategic use of distributors. Our scale enables us to dedicate certain sales and marketing efforts to particular products or customers, when applicable, which enables us to develop expertise that we believe is valued by our customers.\nThe major markets in which the Company sells its products are highly competitive. Areas of competition include service, innovation, quality, and price. This competition is significant as to both the size and the number of competing firms. Competitors include but are not limited to Amcor, Silgan, Aptar, Pactiv Evergreen, 3M, and Fitesa.\nRaw Materials\nOur primary raw material is polymer resin. In addition, we use other materials such as butyl rubber, adhesives, paper and packaging materials, linerboard, rayon, polyester fiber, and foil, in various manufacturing processes. While temporary industry-wide shortages of raw materials have occurred, we have historically been able to manage the supply chain disruption by working closely with our suppliers and customers. Changes in the price of raw materials are generally passed on to customers through contractual price mechanisms over time, during contract renewals and other means.\nIntellectual Property\nWhile important to our business in the aggregate, the loss of any single patent or license alone would not have a material adverse effect on our results of operations as a whole or those of our reportable segments.\nEnvironmental and Sustainability\nWe believe there will always be a leading role for Berrys product offerings due to our ability to promote customer brands by providing superior clarity, protection, design versatility, consumer safety, convenience, cost efficiency, barrier properties, and environmental performance. We collaborate with customers, suppliers, and innovators to create industry-leading solutions which offer lighter weight products, enable longer shelf-life, and protect products throughout supply chains.\nSustainability is comprehensively embedded across our business, from how we run our manufacturing operations more efficiently to the investments we are making in sustainable packaging. We believe responsible packaging is the answer to achieving less waste and that responsible packaging requires four things - innovative design, continued development of renewable and advanced raw materials, waste management infrastructure, and consumer participation. Berry is committed to responsible packaging and has (1) targeted 100% reusable, recyclable, or compostable packaging by 2025, (2) significantly increased our use of circular materials in order to meet our targeted 10% recycled content by 2025, and (3) worked to drive greater recycling rates around the world. With our global scale, deep industry experience, and strong capabilities, we are uniquely positioned to assist our customer in the design and development of more sustainable packaging.\nWe also work globally on continuous improvement of employee safety, energy usage, water efficiency, waste reduction, recycling and reducing our Green house Gas (GHG) emissions. Our teams focus on improving the circularity and reducing the carbon footprint of our products. We anticipate higher demand for products with lower emissions intensity where polymer resin based products are inherently well positioned since they typically have lower GHG emissions per functional unit compared to heavier alternatives such as paper, metal and glass. Additionally, there is also significant work being done on the use of recycled and bio-based content, which typically has lower associated GHG emissions compared to other virgin materials.\nHuman Capital and Employees\nOverview\nBerrys mission of ‘Always Advancing to Protect Whats Important has never been more critical as we are proud to work alongside our customers to supply products that are essential to everyday life. We continue to prioritize the health and well-being of the communities we serve as well as our employees and their families.\nHealth and Safety\nEmployee safety is our number one core value. We believe when it comes to employee safety, our best should always be our standard. It is through the adherence to our global Environment, Health, and Safety principles we have been able to identify and mitigate operational risks and drive continuous improvement, resulting in an OSHA incident rate below 1.0 which is significantly lower than the industry average.\nTalent and Development\nWe seek to attract, develop and retain talent throughout the company. Our succession management strategy focuses on a structured succession framework and multiple years of performance. Our holistic approach to developing key managers and identifying future leaders includes challenging assignments, formal development plans and professional coaching. Resources to support employee development include operational programs, university partnerships, internal e-learning requirements, tuition reimbursement programs, and apprenticeships.\nEmployee Engagement\nWe seek to ensure that everyone is motivated to perform every day. To further that objective, our engagement approach focuses on clear communication and recognition. We communicate through regular employee meetings, at both the corporate and operating division levels, with business and market updates and information on production, safety, quality and other operating metrics. We have many recognition-oriented awards throughout our company and conduct company-wide engagement surveys which have generally indicated high levels of engagement and trust in Berrys leadership.\nInclusion and Diversity\nWe strive to build a safe and inclusive culture where employees feel valued and treated with respect. We believe inclusion helps drive engagement, innovation and organizational growth. We provide annual training to our diversified global workforce on the importance of having a culture of inclusion.\nEthics\nOur employees are expected to act with integrity and we maintain a Global Code of Business Ethics which is attested by every Berry employee and provides the Company's framework for ethical business. We provide targeted annual training across the globe to reinforce our commitment to ethics and drive adherence to the laws in each jurisdiction in which we operate.\nAvailable Information\nWe make available, free of charge, our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments, if any, to those reports through our internet website as soon as reasonably practicable after they have been electronically filed with the SEC. Our internet address is www.berryglobal.com. The information contained on our website is not being incorporated herein. Item 1A. RISK FACTORS\nOperational Risks\nGlobal economic conditions may negatively impact our business operations and financial results.\nChallenging global conditions, including inflation or military conflicts, may negatively impact our business operations and financial results. When challenging economic conditions exist, our customers may delay, decrease or cancel purchases from us, and may also delay payment or fail to pay us altogether. Suppliers may have difficulty filling our orders and distributors may have difficulty getting our products to customers, which may affect our ability to meet customer demands, and result in a loss of business. Weakened global economic conditions may also result in unfavorable changes in our product prices, product mix and profit margins. Although we take measures to mitigate the impact of inflation, including through pricing actions and productivity programs, if these actions are not effective our cash flow, financial condition, and results of operations could be adversely impacted. In addition, there could be a time lag between recognizing the benefit of our mitigating actions versus when the challenge occurs and there is no assurance that our mitigating measures will be able to fully mitigate the negative impacts.\nPolitical volatility may also contribute to the general economic conditions and regulatory uncertainty in regions in which we operate. Future unrest and changing policies could result in an adverse impact to our financial condition. Political developments can also disrupt the markets we serve and the tax jurisdictions in which we operate and may affect our business, financial condition and results of operations.\nRaw material inflation or shortage of available materials could harm our financial condition and results of operations.\nRaw materials are subject to price fluctuations and availability, due to external factors, which are beyond our control. Temporary industry-wide shortages of raw materials have occurred in the past, which can lead to increased raw material price volatility. Additionally, our suppliers could experience cost increases to produce raw material due to increases in carbon pricing. Historically we have been able to manage the impact of higher costs by increasing our selling prices. We have generally been well positioned to capture additional market share as our primary raw material, polymer resin, is typically a lower cost and more versatile substrate compared to alternatives. However, raw material shortages or our inability to timely pass-through increased costs to our customers may adversely affect our business, financial condition and results of operations.\nWeather related events could negatively impact our results of operations.\nWeather related events could adversely impact on our business and those of our customers, suppliers, and partners. Such events may have a physical impact on our facilities, inventory, suppliers, and equipment and any unplanned downtime at any of our facilities could result in unabsorbed costs that could negatively impact our results of operations for the period in which it experienced the downtime. Longer-term changes in climate patterns could alter future customer demand, impact supply chains and increase operating costs. However, any such changes are uncertain and we cannot predict the net impact from such events.\nWe may not be able to compete successfully and our customers may not continue to purchase our products.\nWe compete with multiple companies in each of our product lines on the basis of a number of considerations, including price, service, quality, product characteristics and the ability to supply products to customers in a timely manner. Our products also compete with various other substrates. Some of these competitive products are not subject to the impact of changes in resin prices, which may have a significant and negative impact on our competitive position versus substitute products. Additionally, consumer views on environmental considerations could potentially impact demand for our products that utilize fossil fuel based materials in their manufacturing. Our competitors may have financial and other resources that are substantially greater than ours and may be better able than us to withstand higher costs. Competition and product preference changes could result in our products losing market share or our having to reduce our prices, either of which could have a material adverse effect on our business, financial condition and results of operations. In addition, since we do not have long-term arrangements with many of our customers, these competitive factors could cause our customers to shift suppliers and/or packaging material quickly.\nWe may pursue and execute acquisitions or divestitures, which could adversely affect our business.\nTransactions involve special risks, including the potential assumption of unanticipated liabilities and contingencies as well as difficulties in integrating acquired businesses or carving-out divested businesses, which may result in substantial costs, delays or other problems that could adversely affect our business, financial condition and results of operations. Furthermore, we may not realize all of the synergies we expect to achieve from our current strategic initiatives due to a variety of risks. If we are unable to achieve the benefits that we expect to achieve from our strategic initiatives, it could adversely affect our business, financial condition and results of operations.\nIn the event of a catastrophic loss of one of our key manufacturing facilities, our business would be adversely affected.\nWhile we manufacture our products in a large number of diversified facilities and maintain insurance covering our facilities, including business interruption insurance, a catastrophic loss of the use of all or a portion of one of our key manufacturing facilities due to accident, labor issues, weather conditions, natural disaster, pandemic or otherwise, whether short or long-term, could result in future losses.\nEmployee retention, labor cost inflation or the failure to renew collective bargaining agreements could disrupt our business.\nOur relations with employees under collective bargaining agreements remain satisfactory and there have been no significant work stoppages or other labor disputes during the past four years. However, we may not be able to maintain constructive relationships with labor unions or trade councils and may not be able to successfully negotiate new collective bargaining agreements on satisfactory terms in the future.\nLabor is subject to cost inflation, availability and workforce participation rates, all of which could be impacted by factors beyond our control. As a result, there can be no assurance we will be able to recruit, train, assimilate, motivate and retain employees in the future. The loss of a substantial number of these employees or a prolonged labor dispute could disrupt our business and result in future losses.\nWe depend on information technology systems and infrastructure to operate our business, and increased cybersecurity threats, system inadequacies, and failures could disrupt our operations, compromise customer, employee, vendor and other data which could negatively affect our business.\nWe rely on the efficient and uninterrupted operation of information technology systems and networks. These systems and networks are vulnerable to increased threats and more sophisticated computer crime, energy interruptions, telecommunications failures, breakdowns, natural disasters, terrorism, war, computer malware or other malicious intrusions.\nWe also maintain and have access to data and information that is subject to privacy and security laws, regulations, and customer controls. Despite our efforts to protect such information, breaches, misplaced or lost data and programming damages could result in a negative impact on the business. While we have not had material system interruptions historically associated with these risks, there can be no assurance from future interruptions that could result in future losses.\nFinancial and Legal Risks\nOur substantial indebtedness could affect our ability to meet our obligations and may otherwise restrict our activities.\nWe have a significant amount of indebtedness, which requires significant interest payments. The amount of interest charges could increase materially due to rising interest rates as indebtedness is refinanced, interest rate swaps expire, or accounts receivable supply chain finance factoring grows. Our inability to generate sufficient cash flow to satisfy our debt obligations, or to refinance our obligations on commercially reasonable terms, would have a material adverse effect on our business, financial condition and results of operations. Additionally, servicing the interest obligations of our existing indebtedness could limit our ability to respond to business opportunities, including growing our business through acquisitions or increased levels of capital expenditures.\nGoodwill and other intangibles represent a significant amount of our net worth, and a future write-off could result in lower reported net income and a reduction of our net worth.\nWe have a substantial amount of goodwill. Future changes in market multiples, cost of capital, expected cash flows, or other external factors, may adversely affect our business and cause our goodwill to be impaired, resulting in a non-cash charge against results of operations to write off goodwill or indefinite lived intangible assets for the amount of impairment. If a future write-off is required, the charge could result in significant losses.\nOur international operations pose risks to our business that may not be present with our domestic operations.\nWe are subject to foreign exchange rate risk, both transactional and translational, which may negatively affect our financial performance. Exchange rates between transactional currencies may change rapidly due to a variety of factors. In particular, our translational exposure may be impacted by movements in the exchange rate of the euro or the British pound sterling against the U.S. dollar.\nForeign operations are also subject to certain risks that are unique to doing business in foreign countries including supply chain challenges, disruption of energy, changes in applicable laws, including assessments of income and non-income related taxes, inability to readily repatriate cash to the U.S. effectively, and regulatory policies and various trade restrictions including potential changes to taxes or duties. We are also subject to the Foreign Corrupt Practices Act and other anti-bribery and anti-corruption laws that generally bar bribes or unreasonable gifts to foreign governments or officials. We have implemented safeguards, training and policies to discourage these practices by our employees and agents. However, if employees violate our policies, we may be subject to regulatory sanctions. Any of these risks could disrupt our business and result in significant losses.\nCurrent and future environmental and other governmental requirements could adversely affect our financial condition and our ability to conduct our business.\nWhile we have not been required historically to make significant capital expenditures in order to comply with applicable environmental laws and regulations, we cannot predict our future capital expenditure requirements because of continually changing compliance standards and environmental technology. Furthermore, violations or contaminated sites that we do not know about (including contamination caused by prior owners and operators of such sites or newly discovered information) could result in additional compliance or remediation costs or other liabilities. In addition, federal, state, local, and foreign governments could enact laws or regulations concerning environmental matters, such as greenhouse gas (carbon) emissions, that increase the cost of producing, or otherwise adversely affect the demand for our products. Additionally, several governmental bodies in jurisdictions where we operate have introduced, or are contemplating introducing, regulatory change to address the potential impacts of changes in climate and global warming, which may have adverse impacts on our operations or financial results. We believe that any such laws promulgated to date have not had a material adverse effect on us, as we have historically been able to manage the impact of higher costs by increasing our selling prices. However, there can be no assurance that future legislation or regulation would not have a material adverse effect on us.\nChanges in tax laws or changes in our geographic mix of earnings could have a material impact on our financial condition and results of operation.\nWe are subject to income and other taxes in the many jurisdictions in which we operate. Tax laws and regulations are complex and the determination of our global provision for income taxes and current and deferred tax assets and liabilities requires judgment and estimation. We are subject to routine examinations of our income tax returns, and tax authorities may disagree with our tax positions and assess additional tax. Our future income taxes could also be negatively impacted by our mix of earnings in the jurisdictions in which we operate being different than anticipated given differences in statutory tax rates in the countries in which we operate. In addition, tax policy efforts to raise global corporate tax rates could adversely impact our tax rate and subsequent tax expense.\nWe may not be successful in protecting our intellectual property rights, including our unpatented proprietary know-how and trade secrets, or in avoiding claims that we infringed on the intellectual property rights of others.\nIn addition to relying on patent and trademark rights, we rely on unpatented proprietary know-how and trade secrets, and employ various methods, including confidentiality agreements with employees and consultants, customers and suppliers to protect our know-how and trade secrets. However, these methods and our patents and trademarks may not afford complete protection and there can be no assurance that others will not independently develop the know-how and trade secrets or develop better production methods than us. Further, we may not be able to deter current and former employees, contractors and other parties from breaching agreements and misappropriating proprietary information and it is possible that third parties may copy or otherwise obtain and use our information and proprietary technology without authorization or otherwise infringe on our intellectual property rights. Furthermore, no assurance can be given that we will not be subject to claims asserting the infringement of the intellectual property rights of third parties seeking damages, the payment of royalties or licensing fees and/or injunctions against the sale of our products. Any such litigation could be protracted and costly and could result in significant losses.\nWe may be subject to litigation and regulatory investigations and proceedings, including product liability claims, that could adversely affect our business operations and financial performance.\nIn the ordinary course of our business, we are involved in legal proceedings, including product liability claims, which may lead to financial or reputational damages. See Note 5. Commitments, Leases and Contingencies. We may also be subject to inquiries, inspections, investigations and proceedings by relevant regulatory and other governmental agencies. Given our global footprint, we are exposed to more uncertainty regarding the regulatory environment. The timing of the final resolutions to lawsuits, regulatory inquiries, and governmental and other legal proceedings is typically uncertain, and any such proceedings or claims, regardless of merit, could be time consuming and expensive to defend and could divert managements attention and resources. The possible outcomes of these proceedings could include adverse judgments, settlements, injunctions, fines, penalties or other results adverse to us that could harm our business, financial condition, results of operations and reputation and result in significant losses. Even if we are successful in defending ourselves against these actions, the costs of such defense may be significant to us. Item 1B. UNRESOLVED STAFF COMMENTS\nNone. Item 2. PROPERTIES\nOur primary manufacturing facilities by geographic area were as follows:\nGeographic Region\nTotal Facilities\nLeased Facilities\nUS and Canada\nEurope\nRest of world Item 3. LEGAL PROCEEDINGS\nFor information see Note 5. Commitments, Leases and Contingencies Item 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II Item\n5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock BERY is listed on the New York Stock Exchange. As of the date of this filing there were fewer than 550 active record holders of the common stock, but we estimate the number of beneficial stockholders to be much higher as a number of our shares are held by brokers or dealers for their customers in street name. During fiscal 2023 the Company declared and paid cash dividends of $0.25 per share for each quarter. During fiscal 2022 we did not declare or pay any cash dividends on our common stock.\nIssuer Purchases of Equity Securities\nThe following table summarizes the Company's repurchases of its common stock during the Quarterly Period ended September 30, 2023.\nFiscal Period\nTotal Number of\nShares Purchased\nAverage Price\nPaid Per Share\nTotal Number of Shares\nPurchased as Part of Publicly\nAnnounced Programs\nDollar Value of Shares that\nMay Yet be Purchased Under\nthe Program (in millions) (a)\nJuly\n-\n$\n-\n-\n$\nAugust\n1,600,861\n63.96\n1,600,861\nSeptember\n1,313,690\n62.88\n1,313,690\nTotal\n2,914,551\n$\n63.47\n2,914,551\n$\n(a)\nAll open market purchases during the quarter were made under the fiscal 2023 authorization from our board of directors to purchase up to $1 billion of shares of common stock. See Note 9. Stockholders' Equity. Item 6. RESERVED Item 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOutlook\nThe Company is affected by general economic and industrial growth, raw material availability, cost inflation, supply chain disruptions, and general consumption levels. Our business has both geographic and end market diversity, which reduces the effect of any one of these factors on our overall performance. Our results are affected by our ability to pass through raw material and other cost changes to our customers, improve manufacturing productivity and adapt to volume changes of our customers. Despite global macro-economic challenges in the short-term attributed to continued rising inflation and general market softness, we continue to believe our underlying long-term fundamentals in all divisions remain strong. For fiscal 2024, we project cash flow from operations between $1.35 to $1.45 billion and free cash flow between $800 to $900 million. Projected fiscal 2024 free cash flow assumes $550 million of capital spending. For the definition of free cash flow and further information related to free cash flow as a non-GAAP financial measure, see Liquidity and Capital Resources.\nDiscussion of Results of Operations for Fiscal 2023 Compared to Fiscal 2022\nThe Company's U.S. based results for fiscal 2023 and fiscal 2022 are based on fifty-two week periods. Business integration expenses consist of restructuring and impairment charges, divestiture related costs, and other business optimization costs. Tables present dollars in millions. A discussion and analysis regarding our results of operations for fiscal year 2022 compared to fiscal year 2021 can be found on Form 10-K, filed with the SEC in November 2022.\nConsolidated Overview\nFiscal Year\n$ Change\n% Change\nNet sales\n$\n12,664\n$\n14,495\n$\n(1,831\n)\n(13\n)%\nCost of goods sold\n10,354\n12,123\n(1,769\n)\n(15\n)%\nOther operating expenses\n1,231\n1,130\n%\nOperating income\n$\n1,079\n$\n1,242\n$\n(163\n)\n(13\n)%\nNet sales: The net sales decline is primarily attributed to decreased selling prices of $856 million primarily due to the pass-through of lower resin costs, a 6% volume decline, an $84 million unfavorable impact from foreign currency changes, and fiscal 2022 divestiture sales of $107 million. The volume decline is primarily attributed to general market softness and customer destocking.\nCost of goods sold: The cost of goods sold decrease is primarily attributed to lower raw material prices, the volume decline, fiscal 2022 divestiture cost of goods sold, and an unfavorable impact from foreign currency changes.\nOther operating expenses: The other operating expenses increase is primarily attributed to an increase in business integration costs and incentive-based compensation.\nOperating Income: The operating income decrease is primarily attributed to a $134 million unfavorable impact from the volume decline, a $79 million unfavorable impact from increased business integration costs, a $33 million unfavorable impact from foreign currency changes, and a $49 million unfavorable impact from increased selling, general, and administrative expenses primarily attributed to increased incentive-based compensation. These declines are partially offset by a $139 million favorable impact from price cost spread.\nConsumer Packaging International\nFiscal Year\n$ Change\n% Change\nNet sales\n$\n4,031\n$\n4,293\n$\n(262\n)\n(6\n)%\nOperating income\n$\n$\n$\n(73\n)\n(21\n)%\nNet sales: The net sales decline is primarily attributed to a 5% volume decline, fiscal 2022 divestiture sales of $107 million, and a $60 million unfavorable impact from foreign currency changes, partially offset by increased selling prices of $102 million due to the pass-through of European inflation. The volume decline is primarily attributed to general market softness.\nOperating Income: The operating income decrease is primarily attributed to a $39 million unfavorable impact from increased business integration costs, a $36 million unfavorable impact from the volume decline, a $17 million unfavorable impact from foreign currency changes, an unfavorable impact from increased selling, general, and administrative expenses, and an unfavorable impact from fiscal 2022 divestiture. These declines were partially offset by a $44 million favorable impact from price cost spread.\nConsumer Packaging North America\nFiscal Year\n$ Change\n% Change\nNet sales\n$\n3,122\n$\n3,548\n$\n(426\n)\n(12\n)%\nOperating income\n$\n$\n$\n%\nNet sales: The net sales decline is primarily attributed to decreased selling prices of $344 million and a 3% volume decline. The volume decline is primarily attributed to general market softness partially offset by growth in our foodservice market.\nOperating Income: The operating income increase is primarily attributed to a $67 million favorable impact from price cost spread, partially offset by a $21 million unfavorable impact from the volume decline, an $18 million unfavorable impact from increased business integration costs, and an unfavorable impact from increased selling, general, and administrative expenses.\nEngineered Materials\nFiscal Year\n$ Change\n% Change\nNet sales\n$\n2,884\n$\n3,488\n$\n(604\n)\n(17\n)%\nOperating income\n$\n$\n$\n%\nNet sales: The net sales decline is primarily attributed to decreased selling prices of $292 million, an 8% volume decline, and a $31 million unfavorable impact from foreign currency changes. The volume decline is primarily attributed to general market softness and destocking.\nOperating Income: The operating income increase is primarily attributed to an $81 million favorable impact from price cost spread, partially offset by a $48 million unfavorable impact from the volume decline, and an unfavorable impact from increased selling, general, and administrative expenses.\nHealth, Hygiene & Specialties\nFiscal Year\n$ Change\n% Change\nNet sales\n$\n2,627\n$\n3,166\n$\n(539\n)\n(17\n)%\nOperating income\n$\n$\n$\n(103\n)\n(45\n)%\nNet sales: The net sales decline is primarily attributed to decreased selling prices of $322 million and a 7% volume decline. The volume decline is primarily attributed to general market softness and customer destocking.\nOperating Income: The operating income decrease is primarily attributed to a $52 million unfavorable impact from price cost spread, a $30 million unfavorable impact from the volume decline, and an unfavorable impact from increased business integration costs.\nOther expense\nFiscal Year\n$ Change\n% Change\nOther expense\n$\n$\n$\n%\nThe Other expense increase is primarily attributed to an adverse impact from our hyperinflationary Argentina subsidiaries.\nInterest expense\nFiscal Year\n$ Change\n% Change\nInterest expense\n$\n$\n$\n%\nThe interest expense increase is primarily the result of higher interest rates partially offset by an increased benefit from the amortization of settled interest rate swaps in fiscal 2022.\nComprehensive Income\nFiscal Year\n$ Change\n% Change\nComprehensive Income\n$\n$\n$\n%\nThe increase in comprehensive income is primarily attributed to a $416 million favorable change in currency translation, partially offset by a $157 million decrease in net income, a $155 million unfavorable change in the fair value of interest rate hedges, and an $87 million unfavorable change from unrealized losses on the Company's pension plans. Currency translation changes are primarily related to non-U.S. subsidiaries with a functional currency other than the U.S. dollar whereby assets and liabilities are translated from the respective functional currency into U.S. dollars using period-end exchange rates. The change in currency translation was primarily attributed to locations utilizing the euro and British pound sterling as their functional currency. As part of the overall risk management, the Company uses derivative instruments to (i) reduce our exposure to changes in interest rates attributed to the Companys borrowings and (ii) reduce foreign currency exposure to translation of certain foreign operations. The Company records changes to the fair value of these instruments in Accumulated other comprehensive income (loss). The change in fair value of these instruments in fiscal 2023 versus fiscal 2022 is primarily attributed to a change in the forward interest and foreign exchange curves between measurement dates.\nLiquidity and Capital Resources\nSenior Secured Credit Facility\nWe manage our global cash requirements considering (i) available funds among the many subsidiaries through which we conduct our business, (ii) the geographic location of our liquidity needs, and (iii) the cost to access international cash balances. At the end of fiscal 2023, the Company had no outstanding balance on its $1.0 billion asset-based revolving line of credit that matures in June 2028. The Company was in compliance with all covenants at the end of fiscal 2023. See Note 3. Long-Term Debt.\nCash Flows from Operating Activities\nNet cash provided by operating activities increased $52 million from fiscal 2022 primarily attributed to working capital improvement, partially offset by a decline in net income and derivative settlements.\nCash Flows from Investing Activities\nNet cash used in investing activities increased $293 million from fiscal 2022 primarily attributed to the acquisition of Pro-Western in fiscal 2023 compared to the proceeds from business divestitures and the settlement of net investment hedges in fiscal 2022. See Note 2. Acquisition.\nCash Flows from Financing Activities\nNet cash used in financing activities increased $367 million from fiscal 2022 primarily attributed to higher net repayments on long-term borrowings and initiation of a quarterly dividend in fiscal 2023, partially offset by lower share repurchases.\nDividends\nThe Company declared and paid cash dividends of $127 million during fiscal 2023.\nShare Repurchases\nThe Company repurchased approximately 9.8 million shares for $601 million and approximately 12.2 million shares for $709 million in fiscal 2023 and fiscal 2022, respectively. See Note 9. Stockholders' Equity.\nFree Cash Flow\nWe define \"free cash flow\" as cash flow from operating activities less net additions to property, plant and equipment. Based on our definition, our consolidated free cash flow is summarized as follows:\nFiscal years ended\nSeptember 30,\nOctober 1,\nCash flow from operating activities\n$\n1,615\n$\n1,563\nAdditions to property, plant and equipment, net\n(689\n)\n(687\n)\nFree cash flow\n$\n$\nWe use free cash flow as a supplemental measure of liquidity as it assists us in assessing our ability to fund growth through generation of cash. Free cash flow may be calculated differently by other companies, including other companies in our industry or peer group, limiting its usefulness. Free cash flow is not a generally accepted accounting principles (GAAP) financial measure and should not be considered as an alternative to any other measure determined in accordance with GAAP.\nLiquidity Outlook\nAt the end of fiscal 2023, our cash balance was $1,203 million, of which approximately 45% was located outside the U.S. We believe our existing U.S. based cash and cash flow from U.S. operations, together with available borrowings under our senior secured credit facilities, will be adequate to meet our short-term and long-term liquidity needs with the exception of funds needed to cover all long-term debt obligations which we intend to refinance prior to maturity. The Company has the ability to repatriate the cash located outside the U.S. to the extent not needed to meet operational and capital needs without significant restrictions. Our unremitted foreign earnings were $1.6 billion at the end of fiscal 2023. The computation of the deferred tax liability associated with unremitted earnings is not practicable.\nSummarized Guarantor Financial Information\nBerry Global, Inc. (Issuer) has notes outstanding which are fully, jointly, severally, and unconditionally guaranteed by its parent, Berry Global Group, Inc. (for purposes of this section, Parent) and substantially all of Issuers domestic subsidiaries. Separate narrative information or financial statements of the guarantor subsidiaries have not been included because they are 100% owned by Parent and the guarantor subsidiaries unconditionally guarantee such debt on a joint and several basis. A guarantee of a guarantor subsidiary of the securities will terminate upon the following customary circumstances: the sale of the capital stock of such guarantor if such sale complies with the indentures, the designation of such guarantor as an unrestricted subsidiary, the defeasance or discharge of the indenture or in the case of a restricted subsidiary that is required to guarantee after the relevant issuance date, if such guarantor no longer guarantees certain other indebtedness of the issuer. The guarantees of the guarantor subsidiaries are also limited as necessary to prevent them from constituting a fraudulent conveyance under applicable law and any guarantees guaranteeing subordinated debt are subordinated to certain other of the Companys debts. Parent also guarantees the Issuers term loans and revolving credit facilities. The guarantor subsidiaries guarantee our term loans and are co-borrowers under our revolving credit facility.\nPresented below is summarized financial information for the Parent, Issuer and guarantor subsidiaries on a combined basis, after intercompany transactions have been eliminated.\nYear Ended\nSeptember 30, 2023\nNet sales\n$\n6,660\nGross profit\n1,611\nEarnings from continuing operations\nNet income (a)\n$\n(a) Includes $39 million of income associated with intercompany activity with non-guarantor subsidiaries.\nSeptember 30, 2023\nOctober 1, 2022\nAssets\nCurrent assets\n$\n1,975\n$\n2,432\nNoncurrent assets\n5,997\n6,137\nLiabilities\nCurrent liabilities\n$\n1,363\n$\n1,536\nIntercompany payable\nNoncurrent liabilities\n10,271\n10,630\nCritical Accounting Estimates\nWe disclose those accounting policies that we consider to be significant in determining the amounts to be utilized for communicating our consolidated financial position, results of operations and cash flows in the first note to our consolidated financial statements included elsewhere herein. Our discussion and analysis of our financial condition and results of operations are based on our consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of financial statements in conformity with these principles requires management to make estimates and assumptions that affect amounts reported in the financial statements and accompanying notes. Actual results may differ from these estimates under different assumptions or conditions.\nPensions. The accounting for our pension plans requires us to recognize the overfunded or underfunded status of the pension plans on our balance sheet. We believe that the accounting estimates related to our pension plans are critical accounting estimates because they are highly susceptible to change from period to period based on the performance of plan assets, actuarial valuations, market conditions and contracted benefit changes. See Note 1. Basis of Presentation and Summary of Significant Accounting Policies and Note 7. Retirement Plans.\nDeferred Taxes and Effective Tax Rates. We estimate the effective tax rate (ETR) and associated liabilities or assets for each of our legal entities in accordance with authoritative guidance. We utilize tax planning to minimize or defer tax liabilities to future periods. In recording ETRs and related liabilities and assets, we rely upon estimates, which are based upon our interpretation of U.S. and local tax laws as they apply to our legal entities and our overall tax structure. Audits by local tax jurisdictions, including the U.S. Government, could yield different interpretations from our own and cause the Company to owe more taxes than originally recorded. See Note 1. Basis of Presentation and Summary of Significant Accounting Policies and Note 6. Income Taxes. Item 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nInterest Rate Risk\nWe are exposed to market risk from changes in interest rates primarily through our senior secured credit facilities and accounts receivable supply chain finance factoring programs. As of September 30, 2023, our senior secured credit facilities are comprised of (i) $3.1 billion term loans and (ii) a $1.0 billion revolving credit facility with no borrowings outstanding. Borrowings under our senior secured credit facilities bear interest at a rate equal to an applicable margin plus SOFR. The applicable margin for SOFR rate borrowings under the revolving credit facility ranges from 1.25% to 1.50%, and the margin for the term loans is 1.75% per annum. As of September 30, 2023, the SOFR rate of approximately 5.54% was applicable to the term loans. A change of 0.25% on these floating interest rate exposures would increase interest expense by approximately $2 million.\nWe seek to minimize interest rate volatility risk through regular operating and financing activities and, when deemed appropriate, through the use of derivative financial instruments. These financial instruments are not used for trading or other speculative purposes. See Note 4. Financial Instruments and Fair Value Measurements.\nForeign Currency Risk\nAs a global company, we face foreign currency risk exposure from fluctuating currency exchange rates, primarily the U.S. dollar against the euro, British pound sterling, Brazilian real, Chinese renminbi, Canadian dollar and Mexican peso. Significant fluctuations in currency rates can have a substantial impact, either positive or negative, on our revenue, cost of sales, and operating expenses. Currency translation gains and losses are primarily related to non-U.S. subsidiaries with a functional currency other than U.S. dollars whereby assets and liabilities are translated from the respective functional currency into U.S. dollars using period-end exchange rates and impact our Comprehensive income. A 10% decline in foreign currency exchange rates would have had a $31 million unfavorable impact on fiscal 2023 Net income. See Note 4. Financial Instruments and Fair Value Measurements. Item 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Berry Global Group, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Berry Global Group, Inc. (the Company) as of September 30, 2023 and October 1, 2022, the related consolidated statements of income, comprehensive income, changes in stockholders equity and cash flows for each of the three years in the period ended September 30, 2023, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 30, 2023 and October 1, 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated November 17, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosures to which it relates.\nUnited Kingdom Defined Benefit Pension Obligation\nDescription of the Matter\nAt September 30, 2023 the aggregate United Kingdom (UK) defined benefit pension obligation was $505 million. As disclosed in Notes 1 and 7 to the consolidated financial statements, the obligation for these plans are actuarially determined and affected by assumptions, including discount rates and mortality rates.\nAuditing the UK defined benefit pension obligation is complex and required the involvement of our actuarial specialists due to the highly judgmental nature of actuarial assumptions (e.g., discount rates and mortality rates) used in the measurement process. These assumptions have a significant effect on the projected benefit obligation.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls that address the measurement and valuation of the UK defined benefit pension obligation. This included managements review of the UK defined benefit pension obligation calculations and the significant actuarial assumptions used by management.\nTo test the UK defined benefit pension obligation, we performed audit procedures that included, among others, evaluating the methodology used and the significant actuarial assumptions described above. We involved our actuarial specialists to assist with our audit procedures. We compared the actuarial assumptions used by management to historical trends and evaluated the change in the defined benefit pension obligation from prior year due to the change in service cost, interest cost, actuarial gains and losses, benefit payments, contributions and other activities. In addition, we evaluated managements methodology for determining the discount rate that reflects the maturity and duration of the benefit payments and is used to measure the defined benefit pension obligation. As part of this assessment, we compared managements selected discount rate to an independently developed range of reasonable discount rates. To evaluate the mortality rate assumption, we assessed whether the information is consistent with publicly available information, and whether any market data adjusted for entity-specific factors were applied.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 1991.\nIndianapolis, Indiana\nNovember 17, 2023\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Berry Global Group, Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited Berry Global Group, Inc.s internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Berry Global Group, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of September 30, 2023 and October 1, 2022, the related consolidated statements of income, comprehensive income, changes in stockholders equity and cash flows for each of the three years in the period ended September 30, 2023, and the related notes and our report dated November 17, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nIndianapolis, Indiana\nNovember 17, 2023\nBerry Global Group, Inc.\nConsolidated Statements of Income\n(in millions of dollars)\nFiscal years ended\nSeptember 30,\nOctober 1,\nOctober 2,\nNet sales\n$\n12,664\n$\n14,495\n$\n13,850\nCosts and expenses:\nCost of goods sold\n10,354\n12,123\n11,352\nSelling, general and administrative\nAmortization of intangibles\nRestructuring and transaction activities\nOperating income\n1,079\n1,242\n1,292\nOther expense\nInterest expense\nIncome before income taxes\nIncome tax expense\nNet income\n$\n$\n$\nNet income per share (see Note 11):\nBasic\n$\n5.07\n$\n5.87\n$\n5.45\nDiluted\n$\n4.95\n$\n5.77\n$\n5.30\nBerry Global Group, Inc.\nConsolidated Statements of Comprehensive Income\n(in millions of dollars)\nFiscal years ended\nSeptember 30,\nOctober 1,\nOctober 2,\nNet income\n$\n$\n$\nCurrency translation\n(301\n)\nPension and postretirement benefits\n(52\n)\nDerivative instruments\nOther comprehensive (loss) income\n(107\n)\nComprehensive income\n$\n$\n$\nSee notes to consolidated financial statements.\nBerry Global Group, Inc.\nConsolidated Balance Sheets\n(in millions of dollars)\nSeptember 30,\nOctober 1,\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n1,203\n$\n1,410\nAccounts receivable\n1,568\n1,777\nInventories\n1,557\n1,802\nPrepaid expenses and other current assets\nTotal current assets\n4,533\n5,164\nProperty, plant and equipment\n4,576\n4,342\nGoodwill and intangible assets\n6,684\n6,685\nRight-of-use assets\nOther assets\nTotal assets\n$\n16,587\n$\n16,956\nLiabilities and Stockholders Equity\nCurrent liabilities:\nAccounts payable\n$\n1,528\n$\n1,795\nAccrued employee costs\nOther current liabilities\nCurrent portion of long-term debt\nTotal current liabilities\n2,713\n2,844\nLong-term debt\n8,970\n9,242\nDeferred income taxes\nEmployee benefit obligations\nOperating lease liabilities\nOther long-term liabilities\nTotal liabilities\n13,371\n13,760\nStockholders equity:\nCommon stock (115.5 and 124.2 shares issued, respectively)\nAdditional paid-in capital\n1,231\n1,177\nRetained earnings\n2,320\n2,421\nAccumulated other comprehensive loss\n(336\n)\n(403\n)\nTotal stockholders equity\n3,216\n3,196\nTotal liabilities and stockholders equity\n$\n16,587\n$\n16,956\nSee notes to consolidated financial statements.\nBerry Global Group, Inc.\nConsolidated Statements of Cash Flows\n(in millions of dollars)\nFiscal years ended\nSeptember 30,\nOctober 1,\nOctober 2,\nCash Flows from Operating Activities:\nNet income\n$\n$\n$\nAdjustments to reconcile net cash from operating activities:\nDepreciation\nAmortization of intangibles\nNon-cash interest expense\n(61\n)\nShare-based compensation expense\nDeferred income tax\n(117\n)\n(48\n)\n(73\n)\nOther non-cash operating activities, net\n(22\n)\nSettlement of derivatives\n-\nChanges in operating assets and liabilities:\nAccounts receivable\n(86\n)\n(331\n)\nInventories\n(3\n)\n(639\n)\nPrepaid expenses and other assets\n(30\n)\nAccounts payable and other liabilities\n(372\n)\n(120\n)\nNet cash from operating activities\n1,615\n1,563\n1,580\nCash Flows from Investing Activities:\nAdditions to property, plant and equipment, net\n(689\n)\n(687\n)\n(676\n)\nAcquisition of businesses\n(87\n)\n-\n-\nDivestiture of businesses\n-\nSettlement of net investment hedges\n-\n-\nNet cash from investing activities\n(776\n)\n(483\n)\n(511\n)\nCash Flows from Financing Activities:\nProceeds from long-term borrowings\n-\n2,716\nRepayment of long-term borrowings\n(869\n)\n(22\n)\n(3,496\n)\nProceeds from issuance of common stock\nRepurchase of common stock\n(601\n)\n(709\n)\n-\nDividends paid\n(127\n)\n-\n-\nDebt financing costs\n(6\n)\n-\n(21\n)\nNet cash from financing activities\n(1,071\n)\n(704\n)\n(741\n)\nEffect of currency translation on cash\n(57\n)\nNet change in cash and cash equivalents\n(207\n)\nCash and cash equivalents at beginning of period\n1,410\n1,091\nCash and cash equivalents at end of period\n$\n1,203\n$\n1,410\n$\n1,091\nSee notes to consolidated financial statements.\nBerry\nGlobal Group, Inc.\nConsolidated Statements of Changes in Stockholders Equity\n(in millions of dollars)\nCommon\nStock\nAdditional\nPaid-in Capital\nAccumulated Other\nComprehensive Loss\nRetained\nEarnings\nTotal\nBalance at September 26, 2020\n$\n$\n1,034\n$\n(551\n)\n$\n1,608\n$\n2,092\nNet income\n-\n-\n-\nOther comprehensive income\n-\n-\n-\nShare-based compensation\n-\n-\n-\nProceeds from issuance of common stock\n-\n-\n-\nBalance at October 2, 2021\n$\n$\n1,134\n$\n(296\n)\n$\n2,341\n$\n3,180\nNet income\n-\n-\n-\nOther comprehensive loss\n-\n-\n(107\n)\n-\n(107\n)\nShare-based compensation\n-\n-\n-\nProceeds from issuance of common stock\n-\n-\n-\nCommon stock repurchased and retired\n-\n(23\n)\n-\n(686\n)\n(709\n)\nBalance at October 1, 2022\n$\n$\n1,177\n$\n(403\n)\n$\n2,421\n$\n3,196\nNet income\n-\n-\n-\nOther comprehensive income\n-\n-\n-\nShare-based compensation\n-\n-\n-\nProceeds from issuance of common stock\n-\n-\n-\nCommon stock repurchased, retired and other\n-\n(24\n)\n-\n(583\n)\n(607\n)\nDividends paid\n-\n-\n-\n(127\n)\n(127\n)\nBalance at September 30, 2023\n$\n$\n1,231\n$\n(336\n)\n$\n2,320\n$\n3,216\nSee notes to consolidated financial statements.\nBerry Global Group, Inc.\nNotes to Consolidated Financial Statements\n(in millions of dollars, except as otherwise noted)\n1. Basis of Presentation and Summary of Significant Accounting Policies\nBasis of Presentation\nBerry Global Group, Inc.s (Berry, we, or the Company) consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the U.S. (GAAP) pursuant to the rules and regulations of the Securities and Exchange Commissions. Periods presented in these financial statements include fiscal periods ending September 30, 2023 (fiscal 2023), October 1, 2022 (fiscal 2022), and October 2, 2021 (fiscal 2021). The Companys U.S. based results for fiscal 2023 and fiscal 2022 are based on a fifty-two week period. Fiscal 2021 was based on a fifty-three week period. The Company has evaluated subsequent events through the date the financial statements were issued.\nThe consolidated financial statements include the accounts of Berry and its subsidiaries, all of which includes our wholly owned and majority owned subsidiaries. The Company has certain foreign subsidiaries that report on a calendar period basis which we consolidate into our respective fiscal period. Intercompany accounts and transactions have been eliminated in consolidation.\nDuring fiscal 2023, the Company announced that it has initiated a formal process to evaluate strategic alternatives for its Health, Hygiene and Specialties segment and has determined the segment does not meet the criteria of Held for Sale as of year end.\nRevenue Recognition and Accounts Receivable\nOur revenues are primarily derived from the sale of non-woven, flexible and rigid products. Revenue is recognized when performance obligations are satisfied, in an amount reflecting the consideration to which the Company expects to be entitled. We consider the promise to transfer products to be our sole performance obligation. If the consideration agreed to in a contract includes a variable amount, we estimate the amount of consideration we expect to be entitled to in exchange for transferring the promised goods to the customer using the most likely amount method. Our main sources of variable consideration are customer rebates. There are no material instances where variable consideration is constrained and not recorded at the initial time of sale. Generally, our revenue is recognized at a point in time for standard promised goods at the time of shipment, when title and risk of loss pass to the customer. The accrual for customer rebates was $106 million and $103 million at September 30, 2023 and October 1, 2022, respectively, and is included in Other current liabilities on the Consolidated Balance Sheets. The Company disaggregates revenue based on reportable business segment, geography, and significant product line. See Note 10. Segment and Geographic Data.\nAccounts receivable are presented net of allowance for credit losses of $19 million and $18 million at September 30, 2023 and October 1, 2022, respectively. The Company records current expected credit losses based on a variety of factors including historical loss experience and current customer financial condition. The changes to our current expected credit losses, write-off activity, and recoveries were not material for any of the periods presented.\nThe Company has entered into various factoring agreements, primarily customer-based supply chain financing programs, to sell certain receivables to third-party financial institutions. Agreements which result in true sales of the transferred receivables, which occur when receivables are transferred without recourse to the Company, are reflected as a reduction of trade receivables, net on the consolidated balance sheets and the proceeds are included in the cash flows from operating activities in the consolidated statements of cash flows.\nResearch and Development\nResearch and development costs are expensed when incurred. The Company incurred research and development expenditures of $82 million, $81 million, and $90 million in fiscal 2023, 2022, and 2021, respectively.\nShare-Based Compensation\nThe Company recognized total share-based compensation expense of $42 million, $39 million, and $40 million for fiscal 2023, 2022, and 2021, respectively. The share-based compensation plan is more fully described in Note 9. Stockholders Equity.\nForeign Currency\nFor the non-U.S. subsidiaries that account in a functional currency other than U.S. dollars, assets and liabilities are translated into U.S. dollars using period-end exchange rates. Sales and expenses are translated at the average exchange rates in effect during the period. Foreign currency translation gains and losses are included as a component of Accumulated other comprehensive loss within Stockholders equity. Gains and losses resulting from foreign currency transactions are included in the Consolidated Statements of Income.\nCash and Cash Equivalents\nAll highly liquid investments purchased with a maturity of three months or less from the time of purchase are considered to be cash equivalents.\nInventories\nInventories are stated at the lower of cost or net realizable value and are valued using the first-in, first-out method. Management periodically reviews inventory balances, using recent and future expected sales to identify slow-moving and/or obsolete items. The cost of spare parts is charged to cost of goods sold when purchased. We evaluate our reserve for inventory obsolescence on a quarterly basis and review inventory on-hand to determine future salability. We base our determinations on the age of the inventory and the experience of our personnel. We reserve inventory that we deem to be not salable in the quarter in which we make the determination. We believe, based on past history and our policies and procedures, that our net inventory is salable. Inventory as of fiscal 2023 and 2022 was:\nInventories:\nFinished goods\n$\n$\n1,010\nRaw materials\n$\n1,557\n$\n1,802\nProperty, Plant and Equipment\nProperty, plant and equipment are stated at cost. Depreciation is computed primarily by the straight-line method over the estimated useful lives of the assets ranging from 15 to 40 years for buildings and improvements, 2 to 20 years for machinery, equipment, and tooling, and over the term of the agreement for capital leases. Leasehold improvements are depreciated over the shorter of the useful life of the improvement or the lease term. Repairs and maintenance costs are charged to expense as incurred. Property, plant and equipment as of fiscal 2023 and 2022 was:\nProperty, plant and equipment:\nLand, buildings and improvements\n$\n1,693\n$\n1,602\nEquipment and construction in progress\n7,570\n6,916\n9,263\n8,518\nLess accumulated depreciation\n(4,687\n)\n(4,176\n)\n$\n4,576\n$\n4,342\nLong-lived Assets\nLong-lived assets, including property, plant and equipment and definite lived intangible assets are reviewed for impairment in accordance with ASC 360, Property, Plant and Equipment, whenever facts and circumstances indicate that the carrying amount may not be recoverable. Specifically, this process involves comparing an assets carrying value to the estimated undiscounted future cash flows the asset is expected to generate over its remaining life. If this process were to result in the conclusion that the carrying value of a long-lived asset would not be recoverable, a write-down of the asset to fair value would be recorded through a charge to operations.\nGoodwill\nThe changes in the carrying amount of goodwill by reportable segment are as follows:\nConsumer\nPackaging\nInternational\nConsumer\nPackaging\nNorth America\nEngineered\nMaterials\nHealth,\nHygiene\n& Specialties\nTotal\nBalance as of fiscal 2021\n$\n2,016\n$\n1,541\n$\n$\n$\n5,192\nForeign currency translation adjustment\n(250\n)\n(1\n)\n(37\n)\n(18\n)\n(306\n)\nDispositions\n(54\n)\n-\n-\n-\n(54\n)\nBalance as of fiscal 2022\n$\n1,712\n$\n1,540\n$\n$\n$\n4,832\nForeign currency translation adjustment\nPro-Western acquisition (See Note 2.)\n-\n-\n-\nBalance as of fiscal 2023\n$\n1,793\n$\n1,579\n$\n$\n$\n4,981\nIn fiscal year 2023, the Company completed a qualitative analysis to evaluate impairment of goodwill and concluded that it was more likely than not that the fair value for each reporting unit exceeded the carrying amount. We reached this conclusion based on the stable valuations within the packaging industry and operating results of our reporting units, in addition to value indications provided from third parties related to the Company's evaluation of strategic alternatives for the Health, Hygiene & Specialties segment. As a result of our annual impairment evaluations the Company concluded that no impairment existed in fiscal 2023.\nDeferred Financing Fees\nDeferred financing fees are amortized to interest expense using the effective interest method over the lives of the respective debt agreements. Pursuant to ASC 835-30, the Company presents $34 million and $60 million as of fiscal 2023 and fiscal 2022, respectively, of debt issuance and deferred financing costs on the balance sheet as a deduction from the carrying amount of the related debt liability, instead of a deferred charge.\nIntangible Assets\nThe changes in the carrying amount of intangible assets are as follows:\nCustomer\nRelationships\nTrademarks\nOther\nIntangibles\nAccumulated\nAmortization\nTotal\nBalance as of fiscal 2021\n$\n3,329\n$\n$\n$\n(1,734\n)\n$\n2,242\nForeign currency translation adjustment\n(172\n)\n(31\n)\n(1\n)\n(138\n)\nAmortization expense\n-\n-\n-\n(257\n)\n(257\n)\nAdditions\n-\n-\n-\nBalance as of fiscal 2022\n$\n3,157\n$\n$\n$\n(1,925\n)\n$\n1,853\nForeign currency translation adjustment\n(27\n)\nAmortization expense\n-\n-\n-\n(243\n)\n(243\n)\nPro-Western acquisition (See Note 2.)\n-\n-\nBalance as of fiscal 2023\n$\n3,261\n$\n$\n$\n(2,195\n)\n$\n1,703\nCustomer relationships are being amortized using an accelerated amortization method which corresponds with the customer attrition rates used in the initial valuation of the intangibles over the estimated life of the relationships which range from 5 to 17 years. Definite lived trademarks are being amortized using the straight-line method over the estimated life of the assets which are not more than 15 years. Other intangibles, which include technology and licenses, are being amortized using the straight-line method over the estimated life of the assets which range from 5 to 14 years.\nThe Company has trademarks that total $248 million that are indefinite lived and we test annually for impairment on the first day of the fourth quarter. We completed the annual impairment test of our indefinite lived trade names utilizing the qualitative method in 2023, 2022, and 2021 and noted no impairment.\nFuture amortization expense for definite lived intangibles as of fiscal 2023 for the next five fiscal years is $232 million, $219 million, $204 million, $171 million, and $147 million each year for fiscal years ending 2024, 2025, 2026, 2027, and 2028, respectively.\nInsurable Liabilities\nThe Company records liabilities for the self-insured portion of workers compensation, health, product, general and auto liabilities. The determination of these liabilities and related expenses is dependent on claims experience. For most of these liabilities, claims incurred but not yet reported are estimated based upon historical claims experience.\nLeases\nThe Company leases certain manufacturing facilities, warehouses, office space, manufacturing equipment, office equipment, and automobiles. We recognize right-of-use assets and lease liabilities for leases with original lease terms greater than one year based on the present value of lease payments over the lease term using our incremental borrowing rate on a collateralized basis. Short-term leases, with original lease terms of less than one year, are not recognized on the balance sheet. We are party to certain leases, namely for manufacturing facilities, which offer renewal options to extend the original lease term. Renewal options are included in the right-of-use asset and lease liability based on our assessment of the probability that the options will be exercised. See Note 5. Commitments, Leases and Contingencies.\nAt September 30, 2023, annual lease commitments were as follows:\nFiscal Year\nOperating Leases\nFinance Leases\n$\n$\nThereafter\nTotal lease payments\nLess: Interest\n(141\n)\n(3\n)\nPresent value of lease liabilities\n$\n$\nIncome Taxes\nThe Company accounts for income taxes under the asset and liability approach, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequence of events that have been recognized in the Companys financial statements or income tax returns. Income taxes are recognized during the period in which the underlying transactions are recorded. Deferred taxes, with the exception of non-deductible goodwill, are provided for temporary differences between amounts of assets and liabilities as recorded for financial reporting purposes and such amounts as measured by tax laws. If the Company determines that a deferred tax asset arising from temporary differences is not likely to be utilized, the Company will establish a valuation allowance against that asset to record it at its expected realizable value. The Company recognizes uncertain tax positions when it is more likely than not that the tax position will be sustained upon examination by relevant taxing authorities, based on the technical merits of the position. The amount recognized is measured as the largest amount of benefit that is greater than 50% likely of being realized upon ultimate settlement. The Companys effective tax rate is dependent on many factors including: the impact of enacted tax laws in jurisdictions in which the Company operates; the amount of earnings by jurisdiction, due to varying tax rates in each country; and the Companys ability to utilize foreign tax credits related to foreign taxes paid on foreign earnings that will be remitted to the U.S.\nComprehensive Income (Loss)\nComprehensive income (loss) is comprised of net income and other comprehensive income (loss). Other comprehensive income (loss) includes net unrealized gains or losses resulting from currency translations of foreign subsidiaries, changes in the value of our derivative instruments and adjustments to the pension liability.\nThe accumulated balances related to each component of other comprehensive income (loss), net of tax before reclassifications were as follows:\nCurrency\nTranslation\nDefined Benefit\nPension and Retiree\nHealth Benefit Plans\nDerivative\nInstruments\nAccumulated Other\nComprehensive Loss\nBalance as of fiscal 2020\n$\n(278\n)\n$\n(116\n)\n$\n(157\n)\n$\n(551\n)\nOther comprehensive income (loss)\n(5\n)\nNet amount reclassified from accumulated other comprehensive income (loss)\n-\nBalance as of fiscal 2021\n$\n(154\n)\n$\n(67\n)\n$\n(75\n)\n$\n(296\n)\nOther comprehensive income (loss)\n(301\n)\n(111\n)\nNet amount reclassified from accumulated other comprehensive income (loss)\n-\nBalance as of fiscal 2022\n$\n(455\n)\n$\n(32\n)\n$\n$\n(403\n)\nOther comprehensive income (loss)\n(53\n)\nNet amount reclassified from accumulated other comprehensive income (loss)\n-\n(35\n)\n(34\n)\nBalance as of fiscal 2023\n$\n(340\n)\n$\n(84\n)\n$\n$\n(336\n)\nPension\nThe accounting for our pension plans requires us to recognize the overfunded or underfunded status of the pension plans on our balance sheet. The selection of assumptions is based on historical trends and known economic and market conditions at the time of valuation, as well as independent studies of trends performed by our actuaries. Pension benefit costs include assumptions for the discount rate, mortality rate, retirement age, and expected return on plan assets. Retiree medical plan costs include assumptions for the discount rate, retirement age, and health-care-cost trend rates. We review annually the discount rate used to calculate the present value of pension plan liabilities. The discount rate used at each measurement date is set based on a high-quality corporate bond yield curve, derived based on bond universe information sourced from reputable third-party indices, data providers, and rating agencies. In countries where there is no deep market in corporate bonds, we have used a government bond approach to set the discount rate. In evaluating other assumptions, the Company considers many factors, including an evaluation of expected return on plan assets and the health-care-cost trend rates of other companies; historical assumptions compared with actual results; an analysis of current market conditions and asset allocations; and the views of advisers.\nNet Income Per Share\nThe Company calculates basic net income per share based on the weighted-average number of outstanding common shares. The Company calculates diluted net income per share based on the weighted-average number of outstanding common shares plus the effect of dilutive securities.\nUse of Estimates\nThe preparation of the financial statements in conformity with U.S. generally accepted accounting principles requires management to make extensive use of estimates and assumptions that affect the reported amount of assets and liabilities and disclosure of contingent assets and liabilities and the reported amounts of sales and expenses. Actual results could differ materially from these estimates. Changes in estimates are recorded in results of operations in the period that the event or circumstances giving rise to such changes occur.\nRecently Issued Accounting Pronouncements\nReference Rate Reform\nDuring fiscal 2023, the Company adopted ASU 2020-04, Reference Rate Reform - Facilitation of the Effects of Reference Rate Reform on Financial Reporting (Topic 848). The Company's adoption did not result in a material change to our consolidated financial statements or disclosures.\n2. Acquisition\nPro-Western Plastics\nDuring fiscal 2023, the Company acquired Pro-Western Plastics Ltd. (Pro-Western), a leading plastics injection molding company, for a purchase price of $87 million. The acquired business is operated within the Consumer Packaging North America segment. To finance the purchase, the Company used existing liquidity. The acquisition has been accounted for under the purchase method of accounting and accordingly, the purchase price has been allocated to the identifiable assets and liabilities based on preliminary estimates of fair value at the acquisition date. The results of Pro-Western have been included in the consolidated results of the Company since the date of acquisition. The Company has recognized goodwill on this transaction primarily as a result of expected cost synergies and expects goodwill to be deductible for tax purposes.\n3. Long-Term Debt\nLong-term debt consists of the following:\nFacility\nMaturity Date\nTerm loan (a)\nJuly 2026 (d)\n$\n3,090\n$\n3,440\nRevolving line of credit\nJune 2028\n-\n-\n0.95% First Priority Senior Secured Notes (b)\nFebruary 2024\n1.00% First Priority Senior Secured Notes (c)\nJuly 2025\n1.57% First Priority Senior Secured Notes\nJanuary 2026\n1,525\n1,525\n4.875% First Priority Senior Secured Notes\nJuly 2026\n1,250\n1,250\n1.65% First Priority Senior Secured Notes\nJanuary 2027\n1.50% First Priority Senior Secured Notes (c)\nJuly 2027\n5.50% First Priority Senior Secured Notes\nApril 2028\n-\n4.50% Second Priority Senior Secured Notes\nFebruary 2026\n5.625% Second Priority Senior Secured Notes\nJuly 2027\nDebt discounts and deferred fees\n(34\n)\n(60\n)\nFinance leases and other\nVarious\nTotal long-term debt\n8,980\n9,255\nCurrent portion of long-term debt\n(10\n)\n(13\n)\nLong-term debt, less current portion\n$\n8,970\n$\n9,242\n(a)\nEffectively 88% fixed interest rate with interest rate swaps (see Note 4).\n(b)\nIndicates debt which has been classified as long-term debt in accordance with the Company's ability and intention to refinance such obligations on a long-term basis.\n(c)\nEuro denominated\n(d)\nIn October 2023, the Company extended the maturity date of $1,550 million of the Term Loans to 2029.\nDuring fiscal 2023, the Company issued $500 million aggregate principal amount of 5.50% first priority senior secured notes due 2028. The proceeds were used to repurchase a portion of the Company's 0.95% first priority senior secured notes due 2024.\nDebt discounts and deferred financing fees are presented net of Long-term debt, less the current portion on the Consolidated Balance Sheets and are amortized to Interest expense on the Consolidated Statements of Income through maturity.\nBerry Global, Inc. Senior Secured Credit Facility\nOur wholly owned subsidiary Berry Global, Inc.s senior secured credit facilities consist of $3.1 billion of term loans and a $1.0 billion asset-based revolving line of credit. The availability under the revolving line of credit is the lesser of $1.0 billion or based on a defined borrowing base which is calculated based on available accounts receivable and inventory. At the end of fiscal 2023, the Company had unused borrowing capacity of $760 million under the revolving line of credit.\nThe term loan facility is payable upon maturity. The Company may voluntarily repay outstanding loans under the senior secured credit facilities at any time without premium or penalty, other than customary breakage costs with respect to eurodollar loans. All obligations under the senior secured credit facilities are unconditionally guaranteed by the Company and, subject to certain exceptions, each of the Companys existing and future direct and indirect domestic subsidiaries. The guarantees of those obligations are secured by substantially all of the Companys assets as well as those of each domestic subsidiary guarantor.\nDespite not having financial maintenance covenants, our debt agreements contain certain negative covenants. We are in compliance with all covenants as of September 30, 2023. The failure to comply with these negative covenants could restrict our ability to incur additional indebtedness, effect acquisitions, enter into certain significant business combinations, make distributions or redeem indebtedness.\nFuture maturities of long-term debt as of fiscal year end 2023 are as follows:\nFiscal Year\nMaturities\n$\n6,167\n1,299\nThereafter\n$\n9,014\nNet cash interest was $377 million, $281 million, and $311 million in fiscal 2023, 2022, and 2021, respectively.\n4. Financial Instruments and Fair Value Measurements\nIn the normal course of business, the Company is exposed to certain risks arising from business operations and economic factors. The Company may use derivative financial instruments to help manage exposure to fluctuations in interest rates and foreign currencies. These financial instruments are not used for trading or other speculative purposes. For those derivative instruments that are designated and qualify as hedging instruments, the Company must designate the hedging instrument, based upon the exposure being hedged, as a fair value hedge, cash flow hedge, or a hedge of a net investment in a foreign operation.\nTo the extent hedging relationships are found to be effective, changes in the fair value of the derivatives are offset by changes in the fair value of the related hedged item and recorded to Accumulated other comprehensive loss. Changes in the fair value of a derivative not designated as a hedge, are recorded to the Consolidated Statements of Income.\nCross-Currency Swaps\nThe Company is party to certain cross-currency swaps to hedge a portion of our foreign currency risk. The swap agreements mature June 2024 (€1,625 million) and July 2027 (£700 million). In addition to cross-currency swaps, we hedge a portion of our foreign currency risk by designating foreign currency denominated long-term debt as net investment hedges of certain foreign operations. As of September 30, 2023, we had outstanding long-term debt of €379 million that was designated as a hedge of our net investment in certain euro-denominated foreign subsidiaries. When valuing cross-currency swaps the Company utilizes Level 2 inputs (substantially observable).\nInterest Rate Swaps\nThe primary purpose of the Companys interest rate swap activities is to manage interest expense fluctuations associated with our outstanding variable rate term loan debt. When valuing interest rate swaps the Company utilizes Level 2 inputs (substantially observable).\nDuring fiscal 2023, the Company elected to cash settle existing interest rate swaps and received net proceeds of $36 million. The offset is included in Accumulated other comprehensive loss and is being amortized to Interest expense through the term of the original swaps. Following the settlement, the Company entered into interest rate swaps with matching notional amounts with expiration in June 2026.\nAs of September 30, 2023, the Company effectively had (i) a $450 million interest rate swap transaction that swaps a one-month variable SOFR contract for a fixed annual rate of 4.043%, (ii) a $400 million interest rate swap transaction that swaps a one-month variable SOFR contract for a fixed annual rate of 4.451%, (iii) an $884 million interest rate swap transaction that swaps a one-month variable SOFR contract for a fixed annual rate of 4.451%, (iv) a $473 million interest rate swap transaction that swaps a one-month variable SOFR contract for a fixed annual rate of 3.869%, and (v) a $500 million interest rate swap transaction that swaps a one-month variable SOFR contract for a fixed annual rate of 3.602%%. The Company's interest rate swap transactions all expire in June 2026. See Note 12. Subsequent Events.\nBalances of our derivative instruments on a gross basis are as follows:\nDerivative Instruments\nHedge Designation\nBalance Sheet Location\nCross-currency swaps\nDesignated\nOther assets\n$\n-\n$\nCross-currency swaps\nDesignated\nOther current liabilities\n-\nCross-currency swaps\nDesignated\nOther long-term liabilities\n-\nInterest rate swaps\nDesignated\nOther assets\nInterest rate swaps\nNot designated\nOther assets\n-\nInterest rate swaps\nDesignated\nOther long-term liabilities\n-\nInterest rate swaps\nNot designated\nOther long-term liabilities\nThe effect of the Companys derivative instruments on the Consolidated Statements of Income is as follows:\nDerivative instruments\nStatements of Income Location\nCross-currency swaps\nInterest expense\n$\n(41\n)\n$\n(21\n)\n$\n(8\n)\nInterest rate swaps\nInterest expense\n(59\n)\nThe amortization related to unrealized losses in Accumulated other comprehensive loss is expected to be $36 million in the next 12 months. The Companys financial instruments consist primarily of cash and cash equivalents, long-term debt, interest rate swap agreements, cross-currency swap agreements and capital lease obligations. The book value of our long-term indebtedness exceeded fair value by $381 million as of fiscal 2023 and by $561 million as of fiscal 2022. The Companys long-term debt fair values were determined using Level 2 inputs as other significant observable inputs were not available.\nNon-recurring Fair Value Measurements\nThe Company has certain assets that are measured at fair value on a non-recurring basis when impairment indicators are present or when the Company completes an acquisition. The Company adjusts certain long-lived assets to fair value only when the carrying values exceed the fair values. The categorization of the framework used to value the assets is considered Level 3, due to the subjective nature of the unobservable inputs used to determine the fair value.\nIncluded in the following tables are the major categories of assets and their current carrying values, along with the impairment loss recognized on the fair value measurement for the fiscal years then ended:\nLevel 1\nLevel 2\nLevel 3\nTotal\nImpairment\nIndefinite lived trademarks\n$\n-\n$\n-\n$\n$\n$\n-\nGoodwill\n-\n-\n4,981\n4,981\n-\nDefinite lived intangible assets\n-\n-\n1,455\n1,455\n-\nProperty, plant and equipment\n-\n-\n4,576\n4,576\nTotal\n$\n-\n$\n-\n$\n11,260\n$\n11,260\n$\nLevel 1\nLevel 2\nLevel 3\nTotal\nImpairment\nIndefinite lived trademarks\n$\n-\n$\n-\n$\n$\n$\n-\nGoodwill\n-\n-\n4,832\n4,832\n-\nDefinite lived intangible assets\n-\n-\n1,606\n1,606\n-\nProperty, plant and equipment\n-\n-\n4,342\n4,342\n-\nTotal\n$\n-\n$\n-\n$\n11,027\n$\n11,027\n$\n-\n5. Commitments, Leases and Contingencies\nThe Company has various purchase commitments for raw materials, supplies and property and equipment incidental to the ordinary conduct of business.\nCollective Bargaining Agreements\nAt the end of fiscal 2023, we employed approximately 44,000 employees, and approximately 20% of those employees were covered by collective bargaining agreements. The majority of these agreements are due for renegotiation annually.\nLeases\nSupplemental lease information is as follows:\nLeases\nClassification\nOperating leases:\nOperating lease right-of-use assets\nRight-of-use asset\n$\n$\nCurrent operating lease liabilities\nOther current liabilities\nNoncurrent operating lease liabilities\nOperating lease liability\nFinance leases:\nFinance lease right-of-use assets\nProperty, plant, and equipment, net\n$\n$\nCurrent finance lease liabilities\nCurrent portion of long-term debt\nNoncurrent finance lease liabilities\nLong-term debt, less current portion\nLease Type\nCash Flow Classification\nLease Expense Category\nOperating leases\nOperating cash flows\nLease cost\n$\n$\nFinance leases\nOperating cash flows\nInterest expense\nFinance leases\nFinancing cash flows\n-\nFinance leases\n-\nAmortization of right-of-use assets\nWeighted-average remaining lease term - operating leases\n9 years\n7 years\nWeighted-average remaining lease term - finance leases\n2 years\n3 years\nWeighted-average discount rate - operating leases\n5.0\n%\n4.5\n%\nWeighted-average discount rate - finance leases\n4.5\n%\n4.5\n%\nRight-of-use assets obtained in exchange for new operating lease liabilities were $109 million for fiscal 2023.\nLitigation\nThe Company is party to various legal proceedings involving routine claims which are incidental to its business. Although the Companys legal and financial liability with respect to such proceedings cannot be estimated with certainty, the Company believes that any ultimate liability would not be material to its financial position, results of operations or cash flows.\n6. Income Taxes\nThe Company is being taxed at the U.S. corporate level as a C-Corporation and has provided U.S. Federal, State and foreign income taxes. Significant components of income tax expense for the fiscal years ended are as follows:\nCurrent\nU.S.\nFederal\n$\n$\n$\nState\nNon-U.S.\nTotal current\nDeferred:\nU.S.\nFederal\n(26\n)\nState\n(26\n)\n(7\n)\n(6\n)\nNon-U.S.\n(65\n)\n(45\n)\n(84\n)\nTotal deferred\n(117\n)\n(48\n)\n(73\n)\nExpense for income taxes\n$\n$\n$\nU.S. income from continuing operations before income taxes was $375 million, $449 million, and $276 million for fiscal 2023, 2022, and 2021, respectively. Non-U.S. income from continuing operations before income taxes was $367 million, $485 million, and $629 million for fiscal 2023, 2022, and 2021, respectively. The Company paid cash taxes of $240 million, $186 million, and $200 million in fiscal 2023, 2022, and 2021, respectively.\nThe reconciliation between U.S. Federal income taxes at the statutory rate and the Companys benefit for income taxes on continuing operations for fiscal years ended are as follows:\nU.S. Federal income tax expense at the statutory rate\n$\n$\n$\nAdjustments to reconcile to the income tax provision:\nU.S. state income tax expense\nFederal and state credits\n(18\n)\n(15\n)\n(10\n)\nShare-based compensation\n-\n(3\n)\n(8\n)\nTax law changes\n-\n(17\n)\nWithholding taxes\nChanges in foreign valuation allowance\n(5\n)\n(14\n)\nForeign income taxed in the U.S.\nRate differences between U.S. and foreign\n(22\n)\n(8\n)\n(8\n)\nSale of subsidiary\n-\n-\nPermanent foreign currency differences\n-\n-\n(30\n)\nUncertain tax positions, net\n(20\n)\n(19\n)\n(5\n)\nOther\n(2\n)\n(6\n)\nExpense for income taxes\n$\n$\n$\nDeferred income taxes result from temporary differences between the amount of assets and liabilities recognized for financial reporting and tax purposes. The components of the net deferred income tax liability as of fiscal years ended are as follows:\nDeferred tax assets:\nAccrued liabilities and reserves\n$\n$\nInventories\nNet operating loss carryforward\nInterest expense carryforward\nLease liability\nResearch and development credit carryforward\nFederal and state tax credits\nCapitalization research and development expenditures\n-\nOther\nTotal deferred tax assets\nValuation allowance\n(114\n)\n(104\n)\nTotal deferred tax assets, net of valuation allowance\nDeferred tax liabilities:\nProperty, plant and equipment\nIntangible assets\nDerivatives\nLeased asset\nOther\nTotal deferred tax liabilities\n1,107\n1,170\nNet deferred tax liability\n$\n(481\n)\n$\n(642\n)\nThe Company had $92 million of net deferred tax assets recorded in Other assets, and $573 million of net deferred tax liabilities recorded in Deferred income taxes on the Consolidated Balance Sheets.\nAs of September 30, 2023, the Company has recorded deferred tax assets related to federal, state, and foreign net operating losses, interest expense, and tax credits. These attributes are spread across multiple jurisdictions and generally have expiration periods beginning in 2021 while a portion remains available indefinitely. Each attribute has been assessed for realization and a valuation allowance is recorded against the deferred tax assets to bring the net amount recorded to the amount more likely than not to be realized. The valuation allowance against deferred tax assets was $114 million and $104 million as of the fiscal years ended 2023 and 2022, respectively, related to the foreign and U.S. federal and state operations.\nThe Company is permanently reinvested except to the extent the foreign earnings are previously taxed or to the extent that we have sufficient basis in our non-U.S. subsidiaries to repatriate earnings on an income tax free basis.\nUncertain Tax Positions\nThe following table summarizes the activity related to our gross unrecognized tax benefits for fiscal years ended:\nBeginning unrecognized tax benefits\n$\n$\nGross increases - tax positions in prior periods\nGross decreases - tax positions in prior periods\n(11\n)\n(19\n)\nGross increases - current period tax positions\nSettlements\n-\n(9\n)\nLapse of statute of limitations\n(32\n)\n(25\n)\nEnding unrecognized tax benefits\n$\n$\nAs of fiscal year end 2023, the amount of unrecognized tax benefit that, if recognized, would affect our effective tax rate was $105 million and we had $33 million accrued for payment of interest and penalties related to our uncertain tax positions. Our penalties and interest related to uncertain tax positions are included in income tax expense.\nAs a result of global operations, we file income tax returns in the U.S. federal, various state and local, and foreign jurisdictions and are routinely subject to examination by taxing authorities throughout the world. Excluding potential adjustments to net operating losses, the U.S. federal and state income tax returns are no longer subject to income tax assessments for years before 2019. With few exceptions, the major foreign jurisdictions are no longer subject to income tax assessments for year before 2016.\n7. Retirement Plans\nThe Company sponsors defined contribution retirement plans covering substantially all employees. Contributions are based upon a fixed dollar amount for employees who participate and percentages of employee contributions at specified thresholds. Contribution expense for these plans was $40 million, $42 million, and $45 million for fiscal 2023, 2022, and 2021, respectively.\nThe majority of the North American and UK defined benefit pension plans, which cover certain manufacturing facilities, are closed to future entrants. The assets of all the plans are held in a separate trustee administered fund to meet long-term liabilities for past and present employees. The majority, $63 million, of Mainland Europes total underfunded status relates to non-contributory pension plans within our German operations. There is no external funding for these plans although they are secured by insolvency insurance required under German law. In general, the plans provide a fixed retirement benefit not related to salaries and are closed to new entrants.\nThe net amount of liability recognized is included in Employee Benefit Obligations on the Consolidated Balance Sheets. The Company uses fiscal year end as a measurement date for the retirement plans.\nChange in Projected\nBenefit Obligations (PBO)\nNorth\nAmerica\nUK\nMainland\nEurope\nTotal\nNorth\nAmerica\nUK\nMainland\nEurope\nTotal\nBeginning of period\n$\n$\n$\n$\n$\n$\n$\n$\n1,422\nService cost\n-\n-\n-\nInterest cost\nCurrency\n-\n(1\n)\n(152\n)\n(30\n)\n(183\n)\nActuarial loss (gain)\n(10\n)\n(26\n)\n(5\n)\n(41\n)\n(77\n)\n(244\n)\n(37\n)\n(358\n)\nBenefit settlements\n(20\n)\n-\n(1\n)\n(21\n)\n-\n-\n(5\n)\n(5\n)\nBenefits paid\n(16\n)\n(29\n)\n(7\n)\n(52\n)\n(16\n)\n(30\n)\n(7\n)\n(53\n)\nEnd of period\n$\n$\n$\n$\n$\n$\n$\n$\nChange in Fair\nValue of Plan Assets\nNorth\nAmerica\nUK\nMainland\nEurope\nTotal\nNorth\nAmerica\nUK\nMainland\nEurope\nTotal\nBeginning of period\n$\n$\n$\n$\n$\n$\n$\n$\n1,167\nCurrency\n-\n(1\n)\n(146\n)\n(7\n)\n(154\n)\nReturn on assets\n(73\n)\n(43\n)\n(41\n)\n(225\n)\n(2\n)\n(268\n)\nContributions\n-\n-\nBenefit settlements\n(20\n)\n-\n(1\n)\n(21\n)\n-\n-\n(5\n)\n(5\n)\nBenefits paid\n(16\n)\n(29\n)\n(7\n)\n(52\n)\n(16\n)\n(30\n)\n(7\n)\n(53\n)\nEnd of period\n$\n$\n$\n$\n$\n$\n$\n$\nUnderfunded status\n$\n$\n(91\n)\n$\n(88\n)\n$\n(176\n)\n$\n(24\n)\n$\n(34\n)\n$\n(84\n)\n$\n(142\n)\nAt the end of fiscal 2023, the Company had $112 million of net unrealized losses recorded in Accumulated other comprehensive loss on the Consolidated Balance Sheets. The Company expects less than $1 million to be realized in fiscal 2024.\nThe following table presents significant weighted-average assumptions used to determine benefit obligation and benefit cost for the fiscal years ended:\n(Percentages)\nNorth America\nUK\nMainland Europe\nWeighted-average assumptions:\nDiscount rate for benefit obligation\n5.6\n5.5\n4.1\nDiscount rate for net benefit cost\n5.1\n5.2\n3.7\nExpected return on plan assets for net benefit costs\n6.1\n5.7\n2.6\n(Percentages)\nNorth America\nUK\nMainland Europe\nWeighted-average assumptions:\nDiscount rate for benefit obligation\n5.1\n5.2\n3.6\nDiscount rate for net benefit cost\n2.5\n2.1\n1.0\nExpected return on plan assets for net benefit costs\n6.1\n4.2\n2.1\nIn evaluating the expected return on plan assets, Berry considered its historical assumptions compared with actual results, an analysis of current market conditions, asset allocations, and the views of advisors. The return on plan assets is derived from target allocations and historical yield by asset type. A one quarter of a percentage point reduction of expected return on pension assets, mortality rate or discount rate applied to the pension liability would result in an immaterial change to the Companys pension expense.\nIn accordance with the guidance from the FASB for employers disclosure about postretirement benefit plan assets the table below discloses fair values of each pension plan asset category and level within the fair value hierarchy in which it falls. There were no material changes or transfers between level 3 assets and the other levels.\nFiscal 2023 Asset Category\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash and cash equivalents\n$\n$\n-\n$\n-\n$\nU.S. large cap comingled equity funds\n-\n-\nU.S. mid cap equity mutual funds\n-\n-\nU.S. small cap equity & Corporate bond mutual funds\n-\n-\nInternational equity mutual funds\n-\nReal estate equity investment funds\n-\nCorporate bonds\n-\nInternational fixed income funds\n-\nInternational insurance policies\n-\n-\nTotal\n$\n$\n$\n$\nFiscal 2022 Asset Category\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash and cash equivalents\n$\n$\n-\n$\n-\n$\nU.S. large cap comingled equity funds\n-\n-\nU.S. mid cap equity mutual funds\n-\n-\nU.S. small cap equity & Corporate bond mutual funds\n-\n-\nInternational equity mutual funds\n-\nReal estate equity investment funds\nCorporate bonds\n-\nInternational fixed income funds\n-\nInternational insurance policies\n-\n-\nTotal\n$\n$\n$\n$\nThe following benefit payments, which reflect expected future service, as appropriate, are expected to be paid for the fiscal year end:\nNorth America\nUK\nMainland Europe\nTotal\n$\n$\n$\n$\n2029-2033\nNet pension expense is recorded in Cost of goods sold and included the following components as of fiscal years ended:\nService cost\n$\n$\n$\nInterest cost\nAmortization of net actuarial loss\nExpected return on plan assets\n(46\n)\n(51\n)\n(51\n)\nNet periodic benefit expense (income)\n$\n$\n(15\n)\n$\n(13\n)\nOur defined benefit pension plan asset allocations as of fiscal years ended are as follows:\nAsset Category\nEquity securities and equity-like instruments\n%\n%\nDebt securities and debt-like\nInternational insurance policies\nOther\nTotal\n%\n%\nThe Companys retirement plan assets are invested with the objective of providing the plans the ability to fund current and future benefit payment requirements while minimizing annual Company contributions. The retirement plans held $31 million of the Companys stock at the end of fiscal 2023. The Company re-addresses the allocation of its investments on a regular basis.\n8. Restructuring and Transaction Activities\nIn the current fiscal year, the Company initiated cost savings initiatives including plant rationalization in all four segments as part of the 2023 restructuring plan. The Company expects total cash and non-cash expense to be approximately $200 million, with the operations savings intended to counter general economic softness. The initiatives are expected to be fully implemented by the end of fiscal 2025. During fiscal 2021 and 2022, the Company did not shut down any facilities with significant net sales.\nThe table below includes the significant components of our restructuring and transaction activities recognized for the fiscal years ended, by reporting segment:\nConsumer Packaging International\n$\n$\n$\nConsumer Packaging North America\n-\nEngineered Materials\n(4\n)\nHealth, Hygiene & Specialties\n(1\n)\nConsolidated\n$\n$\n$\nTransaction activities consist of acquisition, divestiture and other business optimization related costs. The table below sets forth the activity with respect to the restructuring charges and the impact on our accrued restructuring reserves:\nRestructuring (a)\nEmployee Severance\nand Benefits\nFacility\nExit Costs\nNon-cash\nImpairment Charges\nTransaction\nActivities\nTotal\nBalance as of fiscal 2021\n$\n$\n$\n-\n$\n-\n$\nCharges\n-\nCash\n(11\n)\n(11\n)\n-\n(7\n)\n(29\n)\nBalance as of fiscal 2022\n$\n$\n$\n-\n$\n-\n$\nCharges\nNon-cash items\n-\n-\n(8\n)\n-\n(8\n)\nCash\n(31\n)\n(25\n)\n-\n(32\n)\n(88\n)\nBalance as of fiscal 2023\n$\n$\n$\n-\n$\n-\n$\n(a) Since 2021, cumulative costs attributed to restructuring programs total $105 million.\n9. Stockholders Equity\nShare Repurchases\nDuring fiscal 2023, the Company repurchased approximately 9.8 million shares for $601 million, at an average price of $61.00. During fiscal 2022, the Company repurchased approximately 12.2 million shares for $709 million, at an average price of $58.30. No shares were repurchased during fiscal 2021.\nAll share repurchases were immediately retired. Common stock was reduced by the number of shares retired at $0.01 par value per share. The Company allocates the excess purchase price over par value between additional paid-in capital and retained earnings. As of fiscal 2023, authorized repurchases of $442 million remain available to the Company.\nEquity Incentive Plans\nThe Company has shareholder-approved stock plans under which options and restricted stock units have been granted to employees at the market value of the Company's stock on the date of grant. In fiscal 2021, the Company amended the 2015 Berry Global Group, Inc. Long-Term Incentive Plan to authorize the issuance of 20.8 million shares, an increase of 8.3 million shares from the previous authorization. The intrinsic value of options exercised in fiscal 2023 was $27 million.\nInformation related to the equity incentive plans as of the fiscal years ended are as follows:\nNumber of Shares\n(in thousands)\nWeighted Average\nExercise Price\nNumber of Shares\n(in thousands)\nWeighted Average\nExercise Price\nOptions outstanding, beginning of period\n11,656\n$\n47.33\n11,302\n$\n44.54\nOptions granted\n1,343\n56.93\n1,192\n66.47\nOptions exercised\n(1,041\n)\n35.85\n(752\n)\n35.31\nOptions forfeited or cancelled\n(122\n)\n53.96\n(86\n)\n51.72\nOptions outstanding, end of period\n11,836\n$\n49.36\n11,656\n$\n47.33\nOption price range at end of period\n$\n21.00-66.47\n$\n16.00-66.47\nOptions exercisable at end of period\n7,349\n6,718\nWeighted average fair value of options granted during period\n$\n17.53\n$\n20.73\nGenerally, options vest annually in equal installments commencing one year from the date of grant and have a vesting term of either four or five years, depending on the grant date, and an expiration term of 10 years from the date of grant. The fair value for options granted has been estimated at the date of grant using a Black-Scholes model using the following key assumptions:\nRisk-free interest rate\n3.8\n%\n1.3\n%\n0.5\n%\nDividend yield\n1.7\n%\n0.0\n%\n0.0\n%\nVolatility factor\n31.0\n%\n29.7\n%\n30.4\n%\nThe following table summarizes information about the options outstanding as of fiscal 2023:\nIntrinsic Value\nof Outstanding\n(in millions)\nWeighted\nRemaining\nContractual Life\nNumber\nExercisable\n(in thousands)\nIntrinsic Value\nof Exercisable\n(in millions)\nUnrecognized\nCompensation\n(in millions)\nWeighted\nRecognition\nPeriod\n$\n5.7 years\n7,349\n$\n$\n1.4 years\nThe Company's issued restricted stock units generally vest in equal installments over four years. Compensation cost is recorded based upon the fair value of the shares at the grant date.\nNumber of Shares\n(in thousands)\nWeighted Average\nGrant Price\nNumber of Shares\n(in thousands)\nWeighted Average\nGrant Price\nAwards outstanding, beginning of period\n$\n61.99\n$\n54.22\nAwards granted\n56.93\n66.47\nAwards vested\n(105\n)\n61.46\n(64\n)\n54.70\nAwards forfeited or cancelled\n(23\n)\n59.75\n(10\n)\n60.30\nAwards outstanding, end of period\n$\n58.82\n$\n61.99\nThe Company had equity incentive shares available for grant of 5.0 million and 7.1 million as of September 30, 2023 and October 1, 2022, respectively.\n10. Segment and Geographic Data\nBerrys operations are organized into four reporting segments: Consumer Packaging International, Consumer Packaging North America, Engineered Materials, and Health, Hygiene & Specialties. The structure is designed to align us with our customers, provide improved service, and drive future growth in a cost efficient manner.\nSelected information by reportable segment is presented in the following tables:\nNet sales\nConsumer Packaging International\n$\n4,031\n$\n4,293\n$\n4,242\nConsumer Packaging North America\n3,122\n3,548\n3,141\nEngineered Materials\n2,884\n3,488\n3,309\nHealth, Hygiene & Specialties\n2,627\n3,166\n3,158\nTotal\n$\n12,664\n$\n14,495\n$\n13,850\nOperating income\nConsumer Packaging International\n$\n$\n$\nConsumer Packaging North America\nEngineered Materials\nHealth, Hygiene & Specialties\nTotal\n$\n1,079\n$\n1,242\n$\n1,292\nDepreciation and amortization\nConsumer Packaging International\n$\n$\n$\nConsumer Packaging North America\nEngineered Materials\nHealth, Hygiene & Specialties\nTotal\n$\n$\n$\nTotal assets:\nConsumer Packaging International\n$\n6,217\n$\n6,993\nConsumer Packaging North America\n4,312\n3,992\nEngineered Materials\n2,476\n2,236\nHealth, Hygiene & Specialties\n3,582\n3,735\nTotal assets\n$\n16,587\n$\n16,956\nSelected information by geographical region is presented in the following tables:\nNet sales:\nUnited States and Canada\n$\n6,893\n$\n7,907\n$\n7,351\nEurope\n4,559\n5,065\n4,898\nRest of world\n1,212\n1,523\n1,601\nTotal net sales\n$\n12,664\n$\n14,495\n$\n13,850\nLong-lived assets:\nUnited States and Canada\n$\n6,893\n$\n6,826\nEurope\n3,800\n3,616\nRest of world\n1,361\n1,350\nTotal long-lived assets\n$\n12,054\n$\n11,792\nSelected information by product line is presented in the following tables:\n(in percentages)\nNet sales:\nPackaging\n%\n%\n%\nNon-packaging\nConsumer Packaging International\n%\n%\n%\nRigid Open Top\n%\n%\n%\nRigid Closed Top\nConsumer Packaging North America\n%\n%\n%\nCore Films\n%\n%\n%\nRetail & Industrial\nEngineered Materials\n%\n%\n%\nHealth\n%\n%\n%\nHygiene\nSpecialties\nHealth, Hygiene & Specialties\n%\n%\n%\n11. Net Income per Share\nBasic net income or earnings per share (\"EPS\") is calculated by dividing the net income attributable to common stockholders by the weighted-average number of common shares outstanding during the period, without consideration for common stock equivalents. Diluted EPS includes the effects of options and restricted stock units, if dilutive.\nThe following tables provide a reconciliation of the numerator and denominator of the basic and diluted EPS calculations:\n(in millions, except per share amounts)\nNumerator\nConsolidated net income\n$\n$\n$\nDenominator\nWeighted average common shares outstanding - basic\n120.1\n130.6\n134.6\nDilutive shares\n2.9\n2.2\n3.7\nWeighted average common and common equivalent shares outstanding - diluted\n123.0\n132.8\n138.3\nPer common share earnings\nBasic\n$\n5.07\n$\n5.87\n$\n5.45\nDiluted\n$\n4.95\n$\n5.77\n$\n5.30\n1 million shares were excluded from the fiscal 2023 and 2022 diluted EPS calculation, respectively, as their effect would be anti-dilutive. No shares were excluded from the fiscal 2021 calculation.\n12. Subsequent Events\nIn October 2023, the Company extended the maturity date of $1,550 million of the Term Loans and $950 million of outstanding interest rate swaps to July 2029.\nIn November 2023, the Company's Board of Directors authorized a quarterly cash dividend of $0.275 per share. The first fiscal quarter payment will be paid on December 15, 2023 to shareholders of record as of December 1, 2023. Item 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. Item 9A. CONTROLS AND PROCEDURES\nEvaluation of disclosure controls and procedures\nWe maintain disclosure controls and procedures, as such term is defined in Rule 13a-15(e) under the Exchange Act, that are designed to ensure that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nIn connection with the preparation of this Form 10-K, management evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of September 30, 2023.\nBased on this evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that the Companys disclosure controls and procedures were effective as of September 30, 2023.\nManagements Report on Internal Controls over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting. Under the supervision and with the participation of our management, the Company conducted an evaluation of the effectiveness of our internal control over financial reporting using the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework). Based on this evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that the Companys internal controls over financial reporting were effective as of September 30, 2023.\nThe effectiveness of our internal control over financial reporting as of September 30, 2023, has been audited by the Companys independent registered public accounting firm, as stated in their report, which is included herein.\nChanges in Internal Controls over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during the quarter ended September 30, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. OTHER INFORMATION\nRule 10b5-1 Trading Plans\nNo officers or directors, as defined in Rule 16a-1(f), adopted, modified and/or terminated a \"Rule 10b5-1 trading arrangement\" or a \"non-Rule 10b5-1 trading arrangement,\" as defined in Regulation S-K Item 408, during the fourth quarter of fiscal 2023.\nItem 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNone.\nPART III Item 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nExcept as set forth below, the information required by this Item is incorporated herein by reference to our definitive Proxy Statement to be filed in connection with the 2024 Annual Meeting of Stockholders.\nWe have a Global Code of Business Ethics that applies to all directors and employees, including our Chief Executive Officer and senior financial officers. We also have adopted a Supplemental Code of Ethics, which is in addition to the standards set by our Global Code of Business Ethics, in order to establish a higher level of expectation for the most senior leaders of the Company. Our Global Code of Business Ethics and Supplemental Code of Ethics can be obtained, free of charge, by contacting our corporate headquarters or can be obtained from the Corporate Governance section of the Investors page on the Companys internet site. In the event that we make changes in, or provide waivers from, the provision of the Code of Business Ethics that the SEC requires us to disclose, we will disclose these events in the corporate governance section of our website within four business days following the date of such amendment or waiver. Item 11. EXECUTIVE COMPENSATION\nThe information required by this Item is incorporated herein by reference to our definitive Proxy Statement to be filed in connection with the 2024 Annual Meeting of Stockholders. Item 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item, is incorporated herein by reference to our definitive Proxy Statement to be filed in connection with the 2024 Annual Meeting of Stockholders. Item 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated herein by reference to our definitive Proxy Statement to be filed in connection with the 2024 Annual Meeting of Stockholders. Item 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item is incorporated herein by reference to our definitive Proxy Statement to be filed in connection with the 2024 Annual Meeting of Stockholders.\nPART IV Item 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n1.\nFinancial Statements\nThe financial statements listed under Item 8 are filed as part of this report.\n2.\nFinancial Statement Schedules\nSchedules have been omitted because they are either not applicable or the required information has been disclosed in the financial statements or notes thereto.\n3.\nExhibits\nThe exhibits listed on the Exhibit Index immediately following the signature page of this annual report are filed as part of this report.\nItem 16. FORM 10-K SUMMARY\nNone.\nExhibit No\nDescription of Exhibit\n2.1\nRule 2.7 Announcement, dated as of March 8, 2019 (incorporated by reference to Exhibit 2.1 to the Companys Current Report on Form 8-K filed on March 14, 2019).\n2.2\nCo-Operation Agreement, dated as of March 8, 2019, by and among Berry Global Group, Inc., Berry Global International Holdings Limited and RPC Group Plc (incorporated by reference to Exhibit 2.2 to the Companys Current Report on Form 8-K filed on March 14, 2019).\n3.1\n*\nAmended and Restated Certificate of Incorporation of Berry Global Group, Inc., as amended through February 24, 2021.\n3.2\nAmended and Restated Bylaws of Berry Global Group, Inc., as amended and restated effective as of February 24, 2021 (incorporated by reference to Exhibit 3.2 to the Companys Current Report on Form 8-K filed on February 25, 2021).\n4.1\nForm of common stock certificate of Berry Plastics Group, Inc. (incorporated by reference to Exhibit 4.27 of Amendment No. 5 to the Companys Registration Statement on Form S-1 filed on September 19, 2012).\n4.2\nIndenture, by and between Berry Global Escrow Corporation and U.S. Bank Trust Company National Association (as successor to U.S. Bank National Association), as Trustee and Collateral Agent, relating to the 4.875% First Priority Senior Secured Notes due 2026, dated June 5, 2019 (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on June 6, 2019).\n4.2A\nSupplemental Indenture, among Berry Global Group, Inc., Berry Global, Inc., Berry Global Escrow Corporation, each of the parties identified as a Subsidiary Guarantor thereon, and U.S. Bank Trust Company National Association (as successor to U.S. Bank National Association), as Trustee, relating to the 4.875% First Priority Senior Secured Notes due 2026, dated July 1, 2019 (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on July 2, 2019).\n4.3\nIndenture, by and between Berry Global Escrow Corporation and U.S. Bank Trust Company National Association (as successor to U.S. Bank National Association), as Trustee and Collateral Agent, relating to the 5.625% Second Priority Senior Secured Notes due 2027, dated June 5, 2019 (incorporated by reference to Exhibit 4.2 to the Companys Current Report on Form 8-K filed on June 6, 2019).\n4.3A\nSupplemental Indenture, among Berry Global Group, Inc., Berry Global, Inc., Berry Global Escrow Corporation, each of the parties identified as a Subsidiary Guarantor thereon, and U.S. Bank Trust Company National Association (as successor to U.S. Bank National Association), as Trustee, relating to the 5.625% Second Priority Senior Secured Notes due 2027, dated July 1, 2019 (incorporated by reference to Exhibit 4.2 to the Companys Current Report on Form 8-K filed on July 2, 2019).\n4.4\nIndenture, among Berry Global, Inc., certain guarantors party thereto, U.S. Bank Trust Company National Association (as successor to U.S. Bank National Association), as Trustee and Collateral Agent, and Elavon Financial Services DAC, as Paying Agent, Transfer Agent and Registrar, relating to the 1.00% First Priority Senior Secured Notes due 2025 and 1.50% First Priority Senior Secured Notes due 2027, dated January 2, 2020 (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on January 2, 2020).\n4.5\nIndenture among Berry Global, Inc., certain guarantors party thereto, U.S. Bank Trust Company National Association (as successor to U.S. Bank National Association), as Trustee and Collateral Agent, relating to the 1.57% First Priority Senior Secured Notes due 2026, dated December 22, 2020 (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on December 23, 2020).\n4.5A\nFirst Supplemental Indenture, among Berry Global, Inc., certain guarantors party thereto, U.S. Bank Trust Company National Association (as successor to U.S. Bank National Association), as Trustee and Collateral Agent, relating to the 1.57% First Priority Senior Secured Notes due 2026, dated March 4, 2021 (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on March 4, 2021).\n4.6\nIndenture among Berry Global, Inc., certain guarantors party thereto, U.S. Bank Trust Company National Association (as successor to U.S. Bank National Association), as Trustee and Collateral Agent, relating to the 0.95% First Priority Senior Secured Notes due 2024, dated January 15, 2021 (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on January 15, 2021).\n4.7\nIndenture, among Berry Global, Inc., certain guarantors party thereto, U.S. Bank Trust Company National Association (as successor to U.S. Bank National Association), as Trustee and Collateral Agent, relating to the 1.65% First Priority Senior Secured Notes due 2027, dated June 14, 2021 (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on June 14, 2021).\n4.8\nIndenture, among Berry Global, Inc., certain guarantors party thereto, U.S. Bank Trust Company, National Association, as Trustee and Collateral Agent, relating to the 5.50% First Priority Senior Secured Notes due 2028, dated March 30, 2023 (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on March 30, 2023).\n4.9\nRegistration Rights Agreement, by and between Berry Global, Inc., Berry Global Group, Inc., each subsidiary of Berry Global, Inc. identified therein, and Citigroup Global Markets Inc. and J.P. Morgan Securities LLC, on behalf of themselves and as representatives of the initial purchasers, relating to the 1.57% First Priority Senior Secured Notes due 2026 (incorporated by reference to Exhibit 4.2 to the Companys Current Report on Form 8-K filed on December 23, 2020).\n4.10\nRegistration Rights Agreement, by and between Berry Global, Inc., Berry Global Group, Inc., each subsidiary of Berry Global, Inc. identified therein, and Citigroup Global Markets Inc. and J.P. Morgan Securities LLC, on behalf of themselves and as representatives of the initial purchasers, relating to the 0.95% First Priority Senior Secured Notes due 2024 (incorporated by reference to Exhibit 4.2 to the Companys Current Report on Form 8-K filed on January 15, 2021).\n4.11\nRegistration Rights Agreement, dated March 4, 2021, by and between Berry Global, Inc., Berry Global Group, Inc., each subsidiary of Berry Global, Inc. identified therein, and Citigroup Global Markets Inc. Goldman Sachs & Co. LLC and Wells Fargo Securities, LLC, on behalf of themselves and as representatives of the initial purchasers, relating to the 1.57% First Priority Senior Secured Notes due 2026 (incorporated by reference to Exhibit 4.2 to the Companys Current Report on Form 8-K filed on March 5, 2021).\n4.12\nRegistration Rights Agreement, by and between Berry Global, Inc., Berry Global Group, Inc., each subsidiary of Berry Global, Inc. identified therein, and J.P. Morgan Securities LLC, Citigroup Global Markets Inc. and Goldman Sachs & Co. LLC, on behalf of themselves and as representatives of the initial purchasers, relating to the 1.65% First Priority Senior Secured Notes due 2027 (incorporated by reference to Exhibit 4.2 to the Companys Current Report on Form 8-K filed on June 14, 2021).\n4.13\nRegistration Rights Agreement, by and between Berry Global, Inc., Berry Global Group, Inc., each subsidiary of Berry Global, Inc. identified therein, and Citigroup Global Markets Inc., J.P. Morgan Securities LLC and Wells Fargo Securities, LLC, on behalf of themselves and as representatives of the initial purchasers, relating to the 5.50% First Priority Senior Secured Notes due 2028 (incorporated by reference to Exhibit 4.2 to the Companys Current Report on Form 8-K filed on March 30, 2023).\n4.14\nDescription of Securities (incorporated by reference to Exhibit 4.9 to the Companys Annual Report on Form 10-K filed on November 11, 2019).\n10.1\n$1,000,000,000 Fourth Amended and Restated Revolving Credit Agreement, dated as of June 22, 2023, by and among Berry Global, Inc., Berry Global Group, Inc., Berry Plastics Canada Inc., RPC Group Limited, the lenders party thereto, Bank of America, N.A., as collateral agent and administrative agent, and the financial institutions party thereto (incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q filed on August 9, 2023).\n10.2\nU.S. $1,200,000,000 Second Amended and Restated Credit Agreement, dated as of April 3, 2007, by and among Berry Plastics Corporation formerly known as Berry Plastics Holding Corporation, Berry Plastics Group, Inc., Credit Suisse, Cayman Islands Branch, as collateral and administrative agent, the lenders party thereto from time to time, and the other financial institutions party thereto (incorporated by reference to Exhibit 10.1(b) to Berry Plastics Corporations Current Report on Form 8-K filed on April 10, 2007).\n10.3\nSecond Amended and Restated Intercreditor Agreement, dated as of February 5, 2008, by and among Berry Plastics Group, Inc., Berry Plastics Corporation, certain subsidiaries identified as parties thereto, Bank of America, N.A. and Credit Suisse, Cayman Islands Branch as first lien agents, and U.S. Bank Trust Company National Association, as successor in interest to Wells Fargo Bank, N.A., as trustee (incorporated by reference to Exhibit 10.3 to the Companys Annual Report on Form 10-K filed on November 23, 2015).\n10.4\nU.S. $1,147,500,000 and $814,375,000 Incremental Assumption Agreement, dated as of February 10, 2017 by and among Berry Plastics Group, Inc., Berry Plastics Corporation and certain of its subsidiaries referenced therein, Credit Suisse AG, Cayman Islands Branch, as administrative agent for the lenders under the term loan credit agreement referenced therein, Citibank, N.A., as initial Term K lender and Citibank, N.A., as incremental term L lender therein. (incorporated by reference to Exhibit 10.7 to the Companys Annual Report on Form 10-K filed on November 21, 2017).\n10.5\nU.S. $1,644,750,000 and $498,750,000 Incremental Assumption Agreement, dated as of August 10, 2017, by and among Berry Plastics Group, Inc., Berry Plastics Corporation and certain of its subsidiaries referenced therein, Credit Suisse AG, Cayman Islands Branch, as administrative agent for the lenders under the term loan credit agreement referenced therein, Wells Fargo Bank, National Association, as initial Term M lender and Wells Fargo Bank, National Association, as initial Term N lender therein (incorporated by reference to Exhibit 10.8 to the Companys Annual Report on Form 10-K filed on November 21, 2017).\n10.6\nU.S. $900,000,000 and $814,375,000 Incremental Assumption Agreement, dated as of November 27, 2017, by and among Berry Global Group, Inc., Berry Global, Inc. and certain of its subsidiaries referenced therein, Credit Suisse AG, Cayman Islands Branch, as administrative agent for the lenders under the term loan credit agreement referenced therein, Citibank, N.A., as initial Term O Lender, and Citibank, N.A., as initial Term P Lender therein. (incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q filed on February 7, 2018).\n10.7\nU.S. $ 1,644,750,000 and $496,250,000 Incremental Assumption Agreement and Amendment, dated as of February 12, 2018, by and among Berry Global Group, Inc., Berry Global, Inc. and certain of its subsidiaries referenced therein, Credit Suisse AG, Cayman Islands Branch, as administrative agent for the lenders under the term loan credit agreement referenced therein, Citibank, N.A., as initial Term Q lender, and Citibank, N.A., as initial Term R lender therein (incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q filed on May 3, 2018).\n10.8\nU.S. $800,000,000 and $814,375,000 Incremental Assumption Agreement, dated as of May 16, 2018, by and among Berry Global Group, Inc., Berry Global, Inc. and certain of its subsidiaries referenced therein, Credit Suisse AG, Cayman Islands Branch, as administrative agent for the lenders under the term loan credit agreement referenced therein, Citibank, N.A., as initial Term S lender, and Citibank, N.A., as initial Term T lender therein (incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q filed on August 3, 2018).\n10.9\nCooperation Agreement, dated November 22, 2022, by and among Berry Global Group, Inc., Ancora Catalyst Institutional, LP, Eminence Capital, L.P. and the other persons and entities listed thereto (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on November 23, 2022).\n10.10\nAmended and Restated Cooperation Agreement, dated October 18, 2023, by and among Berry Global Group, Inc., Ancora Catalyst Institutional, LP, Eminence Capital, L.P. and the other persons and entities listed thereto (incorporated\nby reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on October 20, 2023).\n10.11\nAmendment and Waiver to Equipment Lease Agreement, dated as of January 19, 2011, between Chicopee, Inc., as Lessee and Gossamer Holdings, LLC, as Lessor (incorporated by reference to Exhibit 10.16 to AVINTIV Specialty Materials Inc.s Registration Statement Form S-4 filed on October 25, 2011).\n10.12\nSecond Amendment to Equipment Lease Agreement, dated as of October 7, 2011, between Chicopee, Inc., as Lessee and Gossamer Holdings, LLC, as Lessor (incorporated by reference to Exhibit 10.17 to AVINTIV Specialty Materials Inc.s Registration Statement Form S-4 filed on October 25, 2011).\n10.13\nThird Amendment to Equipment Lease Agreement, dated as of February 28, 2012, between Chicopee, Inc., as Lessee and Gossamer Holdings, LLC, as Lessor (incorporated by reference to Exhibit 10.1 to AVINTIV Specialty Materials Inc.s Quarterly Report on Form 10-Q filed on May 15, 2012).\n10.14\nFourth Amendment to Equipment Lease Agreement, dated as of March 22, 2013, between Chicopee, Inc., as Lessee and Gossamer Holdings, LLC, as Lessor (incorporated by reference to Exhibit 10.1 to AVINTIV Specialty Materials Inc.s Quarterly Report on Form 10-Q filed on May 9, 2013).\n10.15\nEmployment Agreement of Thomas E. Salmon (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on February 6, 2017).\n10.16\nBerry Plastics Group, Inc. Executive Bonus Plan, amended and restated December 22, 2015, effective as of September 27, 2015 (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on December 28, 2015).\n10.17\nBerry Plastics Group, Inc. 2012 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.27 to the Companys Annual Report on Form 10-K filed on December 17, 2012).\n10.18\nAmendment No. 1 to the Berry Plastics Group, Inc., 2012 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.31 to the Companys Annual Report on Form 10-K filed on December 11, 2013).\n10.19\nOmnibus amendment to awards granted under the Berry Plastics Group, Inc., 2012 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.32 to the Companys Annual Report on Form 10-K filed on December 11, 2013).\n10.20\nAmendment No. 2 to the Berry Plastics Group, Inc. 2012 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on March 10, 2015).\n10.21\nForm of 2016 Omnibus Amendment to Awards Granted Under the Berry Plastics Group, Inc. 2012 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed on July 22, 2016).\n10.22\n2015 Berry Plastics Group, Inc. Long-Term Incentive Plan (incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed on March 10, 2015).\n10.23\nFirst Amendment to 2015 Berry Plastics Group, Inc. Long-Term Incentive Plan (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on March 6, 2018).\n10.24\nForm of 2016 Omnibus Amendment to Awards Granted Under the Berry Plastics Group, Inc. 2015 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.4 to the Companys Current Report on Form 8-K filed on July 22, 2016).\n10.25\nFourth Amended and Restated Stockholders Agreement, by and among Berry Plastics Group, Inc., and the stockholders of the Corporation listed on schedule A thereto, dated as of January 15, 2015 (incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q filed on January 30, 2015).\n10.26\nEmployment Agreement, dated January 1, 2002, between the Berry Plastics Corporation and Curtis Begle (incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q filed on January 31, 2014).\n10.27\nAmendment No. 1 to Employment Agreement, dated as of September 13, 2006, by and between the Berry Plastics Corporation and Curtis Begle (incorporated by reference to Exhibit 10.3 to the Companys Quarterly Report on Form 10-Q filed on January 31, 2014).\n10.28\nAmendment No. 2 to Employment Agreement, dated December 31, 2008, by and between the Berry Plastics Corporation and Curtis Begle (incorporated by reference to Exhibit 10.4 to the Companys Quarterly Report on Form 10-Q filed on January 31, 2014).\n10.29\nAmendment No. 3 to Employment Agreement, dated August 1, 2010, by and between the Berry Plastics Corporation and Curtis L. Begle (incorporated by reference to Exhibit 10.5 to the Companys Quarterly Report on Form 10-Q filed on January 31, 2014).\n10.30\nAmendment No. 4 to Employment Agreement, dated December 16, 2011, by and between the Berry Plastics Corporation and Curtis L. Begle (incorporated by reference to Exhibit 10.6 to the Companys Quarterly Report on Form 10-Q filed on January 31, 2014).\n10.31\nEmployment Agreement, dated February 28, 1998, between Berry Plastics Corporation and Mark Miles, together with amendments dated February 28, 2003, September 13, 2006, December 31, 2008, and December 31, 2011 (incorporated by reference to Exhibit 10.40 to the Companys Annual Report on Form 10-K filed on November 30, 2016).\n10.32\nForm of Amendment to Employment Agreement by and between Berry Plastics Corporation and each of Curtis L Begle, Mark W. Miles, and Thomas E. Salmon (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on July 22, 2016).\n10.33\nSenior Executive Employment Contract dated as of September 30, 2015 by and between PGI Specialty Materials Inc. and Jean Marc Galvez, together with the International Assignment Letter dated December 18, 2016 from Berry Global, Inc. (f/k/a Berry Plastics Corporation) (incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q filed on February 7, 2018).\n10.34\nEmployment Agreement, dated December 16, 2010, between Berry Plastics Corporation and Jason Greene, together with amendments dated December 31, 2011 and July 20, 2016 (incorporated by reference to Exhibit 10.43 to the Companys Annual Report on Form 10-K filed on November 23, 2020).\n10.35\nAmended and Restated Berry Global Group, Inc. 2015 Long-Term Incentive Plan, effective February 24, 2021 (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on February 25, 2021).\n10.36\nForm of Employee Non-Qualified Stock Option Award Agreement (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on November 30, 2020).\n10.37\nForm of Employee Performance-Based Stock Unit Award Agreement (incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on November 30, 2020).\n10.38\nForm of Director Non-Qualified Stock Option Award Agreement (incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed on November 30, 2020).\n10.39\nEmployment Agreement, dated August 11, 2023, among Kevin Kwilinski, Berry Global Group, Inc., and Berry Global, Inc. (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on August 17, 2023).\n10.40\nMemorandum of Understanding, dated August 11, 2023, among Thomas E. Salmon, Berry Global Group, Inc., and Berry Global, Inc. (incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on August 17, 2023).\n10.41\nBerry Global Group, Inc. 2022 Dividend Equivalent Rights Plan (incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q filed on February 2, 2023).\n10.42\nForm of Notice of Dividend Equivalent Rights Award under the Berry Global Group, Inc. 2022 Dividend Equivalent Rights Plan (incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q filed on February 2, 2023).\n21.1\n*\nSubsidiaries of the Registrant.\n22.1\n*\nList of Subsidiary Guarantors.\n23.1\n*\nConsent of Independent Registered Public Accounting Firm.\n31.1\n*\nRule 13a-14(a)/15d-14(a) Certification of the Chief Executive Officer.\n31.2\n*\nRule 13a-14(a)/15d-14(a) Certification of the Chief Financial Officer.\n32.1\n*\nSection 1350 Certification of the Chief Executive Officer.\n32.2\n*\nSection 1350 Certification of the Chief Financial Officer.\n97.1\n*\nBerry Global Group, Inc. Amended and Restated Compensation Recovery Policy\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Date File (formatted as Inline XBRL and contained in Exhibit 101).\n*\nFiled or furnished herewith, as applicable.\nManagement contract or compensatory plan or arrangement.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on the 17th day of November, 2023.\nBERRY GLOBAL GROUP, INC.\nBy\n/s/ Kevin Kwilinski\nKevin Kwilinski\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nSignature\nTitle\nDate\n/s/ Kevin Kwilinski\nChief Executive Officer and Director (Principal Executive Officer)\nNovember 17, 2023\nKevin Kwilinski\n/s/ Mark W. Miles\nChief Financial Officer (Principal Financial Officer)\nNovember 17, 2023\nMark W. Miles\n/s/ James M. Till\nExecutive Vice President and Controller (Principal Accounting Officer)\nNovember 17, 2023\nJames M. Till\n/s/ B. Evan Bayh\nDirector\nNovember 17, 2023\nB. Evan Bayh\n/s/ Jonathan F. Foster\nDirector\nNovember 17, 2023\nJonathan F. Foster\n/s/ Meredith R. Harper\nDirector\nNovember 17, 2023\nMeredith R. Harper\n/s/ Idalene F. Kesner\nDirector\nNovember 17, 2023\nIdalene F. Kesner\n/s/ Jill A. Rahman\nDirector\nNovember 17, 2023\nJill A. Rahman\n/s/ Carl J. Rickertsen\nDirector\nNovember 17, 2023\nCarl J. Rickertsen\n/s/ Chaney M. Sheffield, Jr.\nDirector\nNovember 17, 2023\nChaney M. Sheffield Jr.\n/s/ Robert A. Steele\nDirector\nNovember 17, 2023\nRobert A. Steele\n/s/ Stephen E. Sterrett\nChairman of the Board and Director\nNovember 17, 2023\nStephen E. Sterrett\n/s/ Peter T. Thomas\nDirector\nNovember 17, 2023\nPeter T. Thomas\n/s/ Scott B. Ullem\nDirector\nNovember 17, 2023\nScott B. Ullem"
}