{
    "cik": "1381668",
    "company": "TFS Financial CORP",
    "filing_type": "10-K",
    "filing_date": "2023-11-21",
    "period_of_report": "2023-09-30",
    "sic": "6035",
    "state_of_inc": "DE",
    "state_location": "OH",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1381668/0001381668-23-000092-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1381668/000138166823000092/tfsl-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1381668/0001381668-23-000092.txt",
    "filename": "1381668_10K_2023_0001381668-23-000092.htm",
    "content": "Item 1. Business\nForward Looking Statements\nThis report contains forward-looking statements, which can be identified by the use of such words as estimate, project, believe, intend, anticipate, plan, seek, expect and similar expressions. These forward-looking statements include, among other things:\n● statements of our goals, intentions and expectations;\n● statements regarding our business plans and prospects and growth and operating strategies;\n● statements concerning trends in our provision for credit losses and charge-offs on loans and off-balance sheet exposures;\n● statements regarding the trends in factors affecting our financial condition and results of operations, including credit quality of our loan and investment portfolios; and\n● estimates of our risks and future costs and benefits.\nThese forward-looking statements are subject to significant risks, assumptions and uncertainties, including, among other things, the following important factors that could affect the actual outcome of future events:\n● significantly increased competition among depository and other financial institutions, including with respect to our ability to charge overdraft fees;\n● inflation and changes in the interest rate environment that reduce our interest margins or reduce the fair value of financial instruments, or our ability to originate loans;\n● general economic conditions, either globally, nationally or in our market areas, including employment prospects, real estate values and conditions that are worse than expected;\n● the strength or weakness of the real estate markets and of the consumer and commercial credit sectors and its impact on the credit quality of our loans and other assets, and changes in estimates of the allowance for credit losses;\n● decreased demand for our products and services and lower revenue and earnings because of a recession or other events;\n● changes in consumer spending, borrowing and savings habits;\n● adverse changes and volatility in the securities markets, credit markets or real estate markets;\n● our ability to manage market risk, credit risk, liquidity risk, reputational risk, regulatory risk and compliance risk;\n● our ability to access cost-effective funding;\n● legislative or regulatory changes that adversely affect our business, including changes in regulatory costs and capital requirements and changes related to our ability to pay dividends and the ability of Third Federal Savings, MHC to waive dividends;\n● changes in accounting policies and practices, as may be adopted by the bank regulatory agencies, the Financial Accounting Standards Board or the Public Company Accounting Oversight Board;\n● the adoption of implementing regulations by a number of different regulatory bodies, and uncertainty in the exact nature, extent and timing of such regulations and the impact they will have on us;\n● our ability to enter new markets successfully and take advantage of growth opportunities;\n● future adverse developments concerning Fannie Mae or Freddie Mac;\n● changes in monetary and fiscal policy of the U.S. Government, including policies of the U.S. Treasury, the Federal Reserve System, Fannie Mae, the OCC, FDIC, and others;\n● the continuing governmental efforts to restructure the U.S. financial and regulatory system;\n● the ability of the U.S. Government to remain open, function properly and manage federal debt limits;\n● changes in policy and/or assessment rates of taxing authorities that adversely affect us or our customers;\n● changes in accounting and tax estimates;\n● changes in our organization and changes in expense trends, including but not limited to trends affecting non-performing assets, charge-offs and provisions for credit losses;\n● changes in the value of our goodwill or other intangible assets;\n● the inability of third-party providers to perform their obligations to us;\n● our ability to retain key employees;\n● civil unrest;\n● cyber-attacks, computer viruses and other technological risks that may breach the security of our websites or other systems to obtain unauthorized access to confidential information, destroy data or disable our systems; and\n● the impact of wide-spread pandemic, including COVID-19, and related government action, on our business and the economy.\nBecause of these and other uncertainties, our actual future results may be materially different from the results indicated by any forward-looking statements. Any forward-looking statement made by us in this report speaks only as of the date on which it is made. We undertake no obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise, except as may be required by law. Please see Item 1A. Risk Factors\nThe material risks and uncertainties that management believes affect us are described below. You should carefully consider the risks and uncertainties described below, together with all of the other information included or incorporated by reference herein, as well as in other documents we file with the SEC. The risks and uncertainties described below are not the only ones facing us. Additional risks and uncertainties that management is not aware of or focused on, or that management currently deems immaterial may also impair our business operations. This report is qualified in its entirety by these risk factors. See also, Forward-Looking Statements.\nRisks Related to Economic Conditions\nOur financial condition, results of operation, and stock price may be negatively impacted by unrelated bank failures and negative depositor confidence in depository institutions. Further, if we are unable to adequately manage our liquidity, deposits, capital levels, and interest rate risk, which have come under greater scrutiny in light of recent bank failures, it may have a material adverse effect on our financial condition and results of operations.\nOn March 8, 2023, Silvergate Bank, La Jolla, CA, announced its decision to voluntarily liquidate its assets and wind down operations. On March 10, 2023, Silicon Valley Bank, Santa Clara, CA, was closed by the California Department of Financial Protection and Innovation, and on March 12, 2023, Signature Bank, New York, NY, was closed by the New York State Department of Financial Services. Additionally, on May 1, 2023, First Republic Bank, San Francisco, CA, was closed by the FDIC and sold to JP Morgan Chase & Co. These events led to volatility and declines in the market for bank stocks and questions about depositor confidence in depository institutions.\nNotably, the liquidation of Silvergate Bank and the failures of Silicon Valley Bank and Signature Bank were not generally related to the credit quality of their assets, but to poor liquidity management, mismatched funding of long-term assets with short-term funds, and unique business models. The financial distress these banks experienced appears to have been caused in large part by high exposure to certain industries, including cryptocurrency and venture capital and start-up companies operating in the technology space, which have experienced significant volatility and fluctuations in cash flows over the past several years. These banks also had high levels of uninsured deposits, which may be less likely to remain at the bank over time and less stable as a source of funding than insured deposits. Silicon Valley Bank in particular appears to have experienced a severe lack of liquidity, forcing it to sell long-term investment securities at significant losses. Ultimately, it was unable to meet its financial commitments and satisfy the cash requirements of its customers.\nThese bank failures led to volatility and declines in the market for bank stocks and questions about depositor confidence in depository institutions, which in turn led to a greater focus by institutions, investors, and regulators on the on-balance sheet liquidity of and funding sources for financial institutions and the composition of its deposits. Notwithstanding, our efforts to promote deposit insurance coverage with our customers and otherwise effectively manage our liquidity, deposit portfolio retention, and other related matters, our financial condition, results of operation, and stock price may be adversely affected by future negative events within the banking sector and adverse customer or investor responses to such events.\nInflation can have an adverse impact on our business and on our customers.\nInflation risk is the risk that the value of assets or income from investments will be worth less in the future as inflation decreases the value of money. Recently, there has been a rise in inflation and the Federal Reserve Board has raised certain benchmark interest rates in an effort to combat inflation. As inflation increases, the value of our investment securities, particularly those with longer maturities, would decrease, although this effect can be less pronounced for floating rate instruments. In addition, inflation increases the cost of goods and services we use in our business operations, such as electricity and other utilities, which increases our non-interest expense. Furthermore, our customers are also affected by inflation and the rising costs of goods and services used in their households and businesses, which could have a negative impact on their ability to repay their loans with us.\nThe reversal of the historically low interest rate environment may further adversely affect our net interest income and profitability.\nThe Federal Reserve Board decreased benchmark interest rates significantly, to near zero, in response to the COVID-19 pandemic. The Federal Reserve Board is reversing its policy of near zero interest rates given its concerns over inflation. Market interest rates have risen in response to the Federal Reserve Board's recent rate increases. The increase in market interest rates has had and, as discussed below, is expected to continue to have an adverse effect on our net interest income and profitability.\nFuture changes in interest rates could reduce our net income.\nOur net income largely depends on our net interest income, which could be negatively affected by changes in interest rates. Net interest income is the difference between the interest income we earn on our interest-earning assets, such as loans and securities, and the interest we pay on our interest-bearing liabilities, such as deposits and borrowings.\nGenerally, during a period of rising interest rates, the interest income earned on our assets may not increase as rapidly as the interest paid on our liabilities because, like many savings institutions, our liabilities generally have shorter contractual maturities than our assets. An example of this occurs when interest rates paid on certificates of deposit experience a significant increase. In this circumstance, a CD customer may determine that it is in his/her best interest to incur the existing penalty for early withdrawal, tender the certificate for cash and either reinvest the proceeds in a new CD with us, or withdraw the funds and leave us. As a result, we either establish a new, higher rate certificate (if the customer stays with us), or we must fund the customers withdrawal by: (1) reducing our cash reserves; (2) selling assets to generate cash to fund the withdrawal; (3) attracting deposits from another customer at the then-higher interest rate; or (4) borrowing from a wholesale lender like the FHLB of Cincinnati, again at the then-higher interest rate. Each of these alternatives can have an unfavorable impact on us.\nChanges in interest rates can also have an unfavorable impact on our net interest income if mortgage interest rates decline. Our customers may seek to refinance, without penalty, their mortgage loans with us or repay their mortgage loans with us and borrow from another lender. When that happens, either the yield that we earn on the customers loan is reduced (if the customer refinances with us), or the mortgage is paid off and we are faced with the challenge of reinvesting the cash received to repay the mortgage in a lower interest rate environment. This is frequently referred to as reinvestment risk, which is the risk that we may not be able to reinvest the proceeds of loan prepayments at rates that are comparable to the rates we earned on the loans prior to receipt of the repayment. Reinvestment risk also exists with the securities in our investment portfolio that are backed by mortgage loans.\nOur net interest income can also be negatively impacted when assets and funding sources with seemingly similar, but not identical re-pricing characteristics, react differently to changing interest rates. An example is our home equity lines of credit loan portfolio and our interest-bearing checking and savings deposit products. Interest rates charged on our home equity lines of credit loans are linked to the prime rate of interest, which generally adjusts in a direct relationship to changes in the FRSs Federal Funds target rate. Similarly, our interest-bearing checking and savings deposit products are generally expected to adjust when changes are made to the Federal Funds target rate. However, to the extent that increases or decreases are made to the Federal Funds target rate, and those increases or decreases translate into increases or decreases of the prime rate and the rate charged on our home equity lines of credit loans, but do not extend to equivalent adjustments to our interest-bearing checking and savings deposit products, we can experience a reduction in our net interest income. At September 30, 2023, we held $2.70 billion of home equity lines of credit loans and $2.61 billion of interest-bearing checking and savings deposits.\nOur net income can also be reduced by the impact that changes in interest rates can have on the value of our capitalized mortgage servicing rights. As of September 30, 2023, we serviced $1.93 billion of loans sold to third parties, and the mortgage servicing rights associated with such loans had an amortized cost of $7.4 million and an estimated fair value, at that date, of $15.9 million. Because the estimated life and estimated income to be derived from servicing the underlying mortgage loans generally increase with rising interest rates and decrease with falling interest rates, the value of mortgage servicing rights generally increases as interest rates rise and decreases as interest rates fall. If interest rates fall and the value of our capitalized servicing rights decrease, we may be required to recognize an additional impairment charge against income for the amount by which amortized cost exceeds estimated fair market value.\nOur securities portfolio may be impacted by fluctuations in market value, potentially reducing AOCI and/or earnings. Fluctuations in market value may be caused by changes in market interest rates, lower market prices for securities and limited investor demand. Changes in interest rates can also have an adverse effect on our financial condition, as our available for sale securities are reported at their estimated fair value, and therefore are impacted by fluctuations in interest rates. We increase or decrease our stockholders equity by the amount of change in the estimated fair value of the available for sale securities, net of taxes. The declines in market value could result in other-than-temporary impairments of these assets, which would lead to accounting charges that could have a material adverse effect on our net income and capital levels.\nIn general, changes in market and competitive interest rates result from events that we do not control and over which we generally have little or no influence. As a result, mitigation of the adverse effects of changing interest rates is generally limited to controlling the composition of the assets and liabilities that we hold. To monitor our positions, we maintain an interest rate risk modeling system which is designed to measure our interest rate risk sensitivity. Using customized modeling software, the Association prepares periodic estimates of the amounts by which the net present value of its cash flows from assets, liabilities and off balance sheet items (the institutions EVE) would change in the event of a range of assumed changes in market interest rates. The simulation model uses a discounted cash flow analysis and an option-based pricing approach in measuring the interest rate sensitivity of EVE. At September 30, 2023, in the event of an immediate 200 basis point increase in all interest rates, our model projects that we would experience a $324.7 million, or 31.45%, decrease in EVE. Our calculations further\nproject that, at September 30, 2023, in the event that market interest rates used in the simulation were adjusted in equal monthly amounts (termed a \"ramped\" format) during the twelve month measurement period to an aggregate increase in 200 basis points, we would expect our projected net interest income for the twelve months ended September 30, 2024 to decrease by 2.71%. See Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nA worsening of economic conditions could reduce demand for our products and services and/or result in increases in our level of non-performing loans, which could have an adverse effect on our results of operations.\nOur performance is significantly impacted by the general economic conditions in our primary markets in Ohio and Florida, and surrounding areas. We also originate loans in other states which will be impacted by national or regional economic conditions. A deterioration in economic conditions is likely to result in high levels of unemployment, which would weaken local economies and could result in additional defaults of mortgage loans. Most of the loans in our loan portfolio are secured by real estate located in our primary market areas. Negative conditions, such as layoffs, in the markets where collateral for a mortgage loan is located could adversely affect a borrowers ability to repay the loan and the value of the collateral securing the loan. Declines in the U.S. housing market, falling home prices and increasing foreclosures, as well as unemployment and under-employment, all negatively impact the credit performance of mortgage loans and can result in significant write-downs of asset values by financial institutions.\nIn response to a significant decline in general economic conditions, many lenders and institutional investors may reduce or cease providing funding to borrowers, including other financial institutions. This market turmoil and tightening of credit could lead to an increased level of commercial and consumer delinquencies, lack of consumer confidence, increased market volatility and widespread reduction of general business activity. The resulting economic pressure on consumers and lack of confidence in the financial markets could adversely affect our business, financial condition and results of operations. In response, we would expect to face the following risks in connection with these events:\nIncreased regulation of our industry, heightened supervisory scrutiny related to the USA PATRIOT Act, Bank Secrecy Act, Fair Lending and other laws and regulations, along with enhanced monitoring of compliance with such regulation. Each aspect of amplified supervision and regulation will in all likelihood increase our costs, may be accompanied by the risk of unexpected fines, sanctions, penalties, litigation and corresponding management diversion and may limit our ability to pursue business opportunities and return capital to our shareholders.\nOur ability to assess the creditworthiness of our customers may be impaired if the models and approaches we use to select, manage, and underwrite our customers become less predictive of future behaviors.\nThe processes we use to estimate losses inherent in our credit exposure require difficult, subjective, and complex judgments, including forecasts of economic conditions and how these economic predictions might impair the ability of our borrowers to repay their loans, which may no longer be capable of viable estimation and which may, in turn, impact the reliability of our evaluation processes, the comfort of our regulators with respect to the adequacy of our allowance for credit losses and who may require adjustments thereto, and ultimately could result in increased provisions for loan losses and reduced levels of earnings and capital.\nOur ability to engage in sales of mortgage loans to third parties (including mortgage loan securitization transactions with governmental entities) on favorable terms or at all could be adversely affected by further disruptions in the capital markets or other events, including deteriorating investor expectations.\nCompetition in our industry could intensify as a result of increasing consolidation of financial services companies in connection with current market conditions.\nRisks Related to Laws and Regulations\nChanges in laws and regulations and the cost of compliance with new laws and regulations may adversely affect our operations and our income.\nWe are subject to extensive regulation, supervision and examination by the FRS, the OCC, the CFPB and the FDIC. These regulatory authorities have extensive discretion in connection with their supervisory and enforcement activities, including the ability to impose restrictions on a banks operations, reclassify assets, determine the adequacy of a banks allowance for credit losses and determine the level of deposit insurance premiums assessed. Because our business is highly regulated, the laws and applicable regulations are subject to frequent change. Any change in these regulations and oversight, whether in the form of regulatory policy, new regulations or legislation or additional deposit insurance premiums could have a material impact on our operations.\nThe potential exists for additional federal or state laws and regulations, or changes in policy, affecting lending and funding practices and liquidity standards. Moreover, bank regulatory agencies have been active in responding to concerns and trends identified in examinations, and have issued many formal enforcement orders requiring capital ratios in excess of regulatory requirements. Bank regulatory agencies, such as the FRS, the OCC, the CFPB and the FDIC, govern the activities in\nwhich we may engage, primarily for the protection of depositors, and not for the protection or benefit of potential investors. In addition, new laws and regulations may increase our costs of regulatory compliance and of doing business, and otherwise affect our operations. New laws and regulations may significantly affect the markets in which we do business, the markets for and value of our loans and investments, the fees we can charge and our ongoing operations, costs and profitability.\nWe received a Needs to Improve Community Reinvestment Act rating in our most recent federal examination. This could, at a minimum, result in denial of certain corporate applications such as those related to branches, mergers, minority stock offerings or a second-step conversion.\nAll savings associations have a responsibility under the Community Reinvestment Act and federal regulations to help meet the credit needs of their communities, including low- and moderate-income neighborhoods. In connection with its examination of a federal savings association, the OCC is required to assess the savings associations record of compliance with the Community Reinvestment Act. The Association received a Needs to Improve Community Reinvestment Act rating in its most recent federal examination that analyzed home mortgage lending data for the period January 1, 2015 through December 31, 2019. A savings associations failure to comply with the provisions of the Community Reinvestment Act could, at a minimum, result in denial of certain corporate applications such as those related to branches, mergers, minority stock offerings or a second-step conversion, or in restrictions on its activities.\nThe FRS may require the Company to commit capital resources to support the Association, and we may not have sufficient access to such capital resources.\nFederal law requires that a holding company act as a source of financial and managerial strength to its subsidiary bank and to commit resources to support such subsidiary bank. Under the source of strength doctrine, the FRS may require a holding company to make capital injections into a troubled subsidiary bank and may charge the holding company with engaging in unsafe and unsound practices for failure to commit resources to a subsidiary bank. A capital injection may be required at times when the holding company may not have the resources to provide it and therefore may be required to attempt to borrow the funds or raise capital. Thus, any borrowing of funds needed to raise capital required to make a capital injection becomes more difficult and expensive, and could have an adverse effect on our business, financial condition and results of operations. Moreover, it is possible that we will be unable to borrow funds when we need to do so.\nMonetary policies and regulations of the FRS could adversely affect our business, financial condition and results of operations.\nIn addition to being affected by general economic conditions, our earnings and growth are affected by the policies of the FRS. An important function of the FRS is to regulate the money supply and credit conditions. Among the instruments used by the FRS to implement these objectives are open market purchases and sales of U.S. government securities, adjustments of the discount rate and changes in banks reserve requirements against bank deposits. These instruments are used in varying combinations to influence overall economic growth and the distribution of credit, bank loans, investments and deposits. Their use also affects interest rates charged on loans or paid on deposits.\nThe monetary policies and regulations of the FRS have had a significant effect on the operating results of financial institutions in the past and are expected to continue to do so in the future. The effects of such policies upon our business, financial condition and results of operations cannot be predicted.\nRisks Related to our Lending Activities\nOur lending activities provide lower interest rates than financial institutions that originate more commercial loans.\nOur principal lending activity consists of originating, and essentially all of our loan portfolio consists of, residential real estate mortgage loans. We originate our loans with a focus on limiting credit risk exposure and not necessarily to generate the highest return possible or maximize our interest rate spread. In addition, residential real estate mortgage loans generally have lower interest rates than commercial business loans, commercial real estate loans and consumer loans. As a result, we may generate lower interest rate spreads and rates of return when compared to our competitors who originate more consumer or commercial loans than we do. We intend to continue our focus on residential real estate lending.\nSecondary mortgage market conditions could have a material impact on our financial condition and results of operations.\nLoan sales provide a significant portion of our non-interest income. In addition to being affected by interest rates, the secondary mortgage markets are also subject to investor demand for residential real estate loans and increased investor yield requirements for these loans. These conditions may fluctuate or worsen in the future. A prolonged period of secondary market illiquidity could have a material adverse effect on our financial condition and results of operations.\nIf we are required to repurchase mortgage loans that we have previously sold, it would negatively affect our earnings.\nWe sell mortgage loans in the secondary market under agreements that contain representations and warranties related to, among other things, the origination, characteristics of the mortgage loans and subsequent servicing. We may be required to repurchase mortgage loans that we have sold in cases of borrower default or breaches of these representations and warranties, and we would be subject to increased risk of disputes and repurchase demands as our volume of loan sales increases. If we are required to repurchase mortgage loans or provide indemnification or other recourse, this could significantly increase our costs and thereby affect our future earnings.\nIf our allowance for credit losses is not sufficient to cover actual loan losses, our earnings could decrease.\nWe make various assumptions and judgments about the collectability of our loan portfolio, including the creditworthiness of our borrowers and the value of the real estate and other assets serving as collateral for the repayment of many of our loans. In determining the amount of the allowance for credit losses, we review our loans, our loss and delinquency experience, and evaluate economic conditions. If our assumptions or the results of our analyses are incorrect, our allowance for credit losses may not be sufficient to cover future losses, resulting in additions to our allowance. Material additions to our allowance would materially decrease our net income. See Note 5. LOANS AND ALLOWANCES FOR CREDIT LOSSES for additional information on the CECL methodology.\nIn addition, bank regulators periodically review our allowance for credit losses and, as a result of such reviews, we may decide to increase our provision for loans losses or recognize further loan charge-offs. Any increase in our allowance for credit losses or loan charge-offs as a result of such review or otherwise, may have a material adverse effect on our financial condition and results of operation.\nRisks Related to Competitive Matters\nStrong competition within our market areas may limit our growth and profitability.\nCompetition in the banking and financial services industry is intense. In our market areas, we compete with commercial banks, savings institutions, mortgage brokerage firms, credit unions, finance companies, mutual funds, money market funds, insurance companies, and brokerage and investment banking firms operating locally and elsewhere. Some of our competitors have greater name recognition and market presence that benefit them in attracting business, and offer certain services that we do not or cannot provide. In addition, larger competitors may be able to price loans and deposits more aggressively than we do. Competitive factors driven by consumer sentiment or otherwise can also reduce our ability to generate fee income, such as through overdraft fees. Troubled financial institutions may not significantly increase the interest rates paid to depositors in pursuit of retail deposits when wholesale funding sources are not available to them. Furthermore, the wide acceptance of Internet-based commerce has resulted in a number of alternative payment processing systems and lending platforms in which banks play only minor roles. Customers can now maintain funds in prepaid debit cards or digital currencies, and pay bills and transfer funds directly without the direct assistance of banks. Our profitability depends upon our continued ability to successfully compete in our market areas. For additional information see PART 1 Item 1. Business-THIRD FEDERAL SAVINGS AND LOAN ASSOCIATION OF CLEVELAND-Competition.\nWe continually encounter technological change, and may have fewer resources than many of our larger competitors to continue to invest in technological improvements.\nThe financial services industry is undergoing rapid technological changes, with frequent introductions of new technology-driven products and services. The effective use of technology increases efficiency and enables financial institutions to better serve customers and to reduce costs. Our future success will depend, in part, upon our ability to address the needs of our customers by using technology to provide products and services that will satisfy customer demands for convenience, as well as to create additional efficiencies in our operations. Many of our competitors have substantially greater resources to invest in technological improvements. We also may not be able to effectively implement new technology-driven products and services or be successful in marketing these products and services to our customers.\nRisks Related to Our Operations\nCyber-attacks, other security breaches or failure or interruption of information systems could adversely affect our operations, net income or reputation.\nWe rely heavily on communications and information systems to conduct our business. We regularly collect, process, transmit and store significant amounts of data and confidential information regarding our customers, associates and others and concerning our own business, operations, plans and strategies. In some cases, this confidential or proprietary information is collected, compiled, processed, transmitted or stored by third parties on our behalf. A number of our associates work at remote locations, increasing the number of surfaces that require protection.\nInformation security risks have generally increased in recent years because of the proliferation of new technologies, the use of the Internet and telecommunications technologies to conduct financial and other transactions and the increased sophistication and activities of perpetrators of cyber-attacks and mobile phishing. Mobile phishing, a means for identity thieves to obtain sensitive personal information through fraudulent e-mail, text or voice mail, is an on-going threat targeting the customers of popular financial entities. A failure in or breach of our operational or information security systems, or those of our third-party service providers, as a result of cyber-attacks or information security breaches or due to associate error, malfeasance or other disruptions could adversely affect our business, result in the disclosure or misuse of confidential or proprietary information, damage our reputation, increase our costs and/or cause losses.\nIf this confidential or proprietary information were to be mishandled, misused or lost, we could be exposed to significant regulatory consequences, reputational damage, civil litigation and financial loss.\nAlthough we employ a variety of physical, procedural and technological safeguards to protect this confidential and proprietary information from mishandling, misuse or loss, these safeguards do not provide absolute assurance that mishandling, misuse or loss of the information will not occur. If mishandling, misuse or loss of the information did occur, the Company would make all commercially reasonable efforts to detect and address any such event. Similarly, when confidential or proprietary information is collected, compiled, processed, transmitted or stored by third parties on our behalf, our policies and procedures require that the third party agree to maintain the confidentiality of the information, establish and maintain policies and procedures designed to preserve the confidentiality of the information, and permit us to confirm the third partys compliance with the terms of the agreement. As information security risks and cyber threats continue to evolve, we may be required to expend additional resources to continue to enhance our information security measures and/or to investigate and remediate any information security vulnerabilities.\nWe believe that we have not experienced any material breaches.\nCustomer or associate fraud subjects us to additional operational risks.\nAssociate errors, as well as associate and customer misconduct, could subject us to financial losses or regulatory sanctions and seriously harm our reputation. Our loans to individuals, our deposit relationships and related transactions are also subject to exposure to the risk of loss due to fraud and other financial crimes. Misconduct by our associates could include hiding unauthorized activities from us, improper or unauthorized activities on behalf of our customers or improper use of confidential information. It is not always possible to prevent associate errors and misconduct, and the precautions we take to prevent and detect this activity may not be effective in all cases. Associate errors could also subject us to financial claims for negligence. We have not experienced any material financial losses from associate errors, misconduct or fraud. However, if our internal controls fail to prevent or promptly detect an occurrence, or if any resulting loss is not insured or exceeds applicable insurance limits, it could have a material adverse effect on our financial condition and results of operations.\nIf our enterprise risk management framework is not effective at mitigating risk and loss to us, we could suffer unexpected losses and our results of operations could be materially adversely affected.\nOur enterprise risk management framework seeks to achieve an appropriate balance between risk and return, which is critical to optimizing stockholder value. We have established processes and procedures intended to identify, measure, monitor, report and analyze the types of risk to which we are subject to, including credit, liquidity, operational, regulatory compliance and reputational. However, as with any risk management framework, there are inherent limitations to our risk management strategies as risks may exist, or develop in the future, that we have not appropriately anticipated or identified. If our risk management framework proves ineffective, we could suffer unexpected losses and our business and results of operations could be materially adversely affected.\nOur operations rely on numerous external vendors.\nWe rely on numerous external vendors to provide us with products and services necessary to maintain our day-to-day operations. Accordingly, our operations are exposed to risk that these vendors will not perform in accordance with the\ncontracted arrangements under service level agreements. The failure of an external vendor to perform in accordance with the contracted arrangements under service level agreements because of changes in the vendor's organizational structure, financial condition, support for existing products and services or strategic focus or for any other reason, could be disruptive to our operations, which in turn could have a material negative impact on our financial condition and results of operations. We also could be adversely affected to the extent that such an agreement is not renewed by the third-party vendor, or is renewed on terms less favorable to us. Our Vendor Management program helps mitigate risks and is structured to minimize the cost and time required to replace a vendor in the event of a failure or the vendor's inability to meet service level agreements.\nOur board of directors relies to a large degree on management and outside consultants in overseeing cybersecurity risk management.\nThe Association has a standing Technology Steering Committee, consisting of several senior managers (CFO, CIO, CSO, CXO, and CRO/ISO). The Committee meets quarterly, or more frequently if needed, and reports to the Board of Directors after each meeting through Committee minutes. The Association also engages outside consultants to support its cybersecurity efforts. The directors of the Association do not have significant experience in cybersecurity risk management in other business entities comparable to the Association and rely on the Information Security Officer (ISO) and Chief Information Officer (CIO) for cybersecurity guidance.\nOur funding sources may prove insufficient to replace deposits at maturity and support our future growth. A lack of liquidity could adversely affect our financial condition and results of operations and result in regulatory limits being placed on us.\nWe must maintain funds to respond to the needs of depositors and borrowers. As a part of our liquidity management, we use a number of funding sources in addition to core deposit growth and repayments and maturities of loans and investments. These sources may include FHLB advances, federal funds purchased, and brokered certificates of deposits. While we emphasize the generation of low-cost core deposits as a source of funding, there is strong competition for such deposits in our market area. Additionally, deposit balances can decrease if customers perceive alternative investments as providing a better risk/return trade-off. Adverse operating results or changes in industry conditions could lead to difficulty or an inability to access these additional funding sources. Our financial flexibility will be severely constrained if we are unable to maintain our access to funding or if adequate financing is not available to accommodate future growth at acceptable interest rates.\nFurther, if we are required to rely more heavily on more expensive funding sources to support liquidity and future growth, our revenues may not increase proportionately to cover our increased costs. In this case, our operating margins and profitability would be adversely affected. Alternatively, we may need to sell a portion or our investment and/or loan portfolio in order to raise funds, which, depending upon market conditions, could result in us realizing a loss on the sale of such assets.\nA lack of liquidity could also attract increased regulatory scrutiny and potential restraints imposed on us by regulators. Depending on the capitalization status and regulatory treatment of depository institutions, including whether an institution is subject to a supervisory prompt corrective action directive, certain additional regulatory restrictions and prohibitions may apply, including restrictions on growth, restrictions on interest rates paid on deposits, restrictions or prohibitions on payment of dividends, and restrictions on the acceptance of brokered deposits.\nRisk Related to Our Corporate Structure\nOur sources of funds are limited because of our holding company structure.\nThe Company is a separate legal entity from its subsidiaries and does not have significant operations of its own. Dividends from the Association provide a significant source of cash for the Company. The availability of dividends from the Association is limited by various statutes and regulations. Under these statutes and regulations, the Association is not permitted to pay dividends on its capital stock to the Company, its sole stockholder, if the dividend would reduce the stockholders' equity of the Association below the amount of the liquidation account established in connection with the mutual-to-stock conversion. Federal savings associations may pay dividends without the approval of its primary federal regulator only if they meet applicable regulatory capital requirements before and after the payment of the dividends and total dividends do not exceed net income to date over the calendar year plus its retained net income over the preceding two years. If in the future, the Company utilizes its available cash and the Association is unable to pay dividends to the Company, the Company may not have sufficient funds to pay dividends or fund stock repurchases.\nRestrictions on our ability to pay dividends to stockholders could adversely affect the value of our common stock.\nThe value of the Companys common stock is significantly affected by our ability to pay dividends to our public stockholders. The Companys ability to pay dividends to our stockholders is subject to the availability of cash at the Company,\nwhich is dependent on the Association having sufficient earnings to make capital distributions to the Company. Moreover, our ability to pay dividends, and the amount of such dividends, is affected by the ability of Third Federal Savings, MHC, our mutual holding company, to waive the receipt of dividends declared by the Company.\nFederal regulations require Third Federal Savings, MHC, to notify the FRS of any proposed waiver of its receipt of dividends from the Company. In August 2011, the FRS issued an interim final rule pursuant to the DFA, providing that the FRS may not object to dividend waivers by grandfathered mutual holding companies, such as Third Federal Savings, MHC, under standards substantially similar to those previously required by the OTS. However, the interim final rule added a requirement that a majority of the mutual holding companys members eligible to vote must approve a dividend waiver by a mutual holding company within twelve months prior to the declaration of the dividend being waived. As part of its rule making process, the FRS is reviewing comments on the interim final rule and there can be no assurance that the final rule will not require such a member vote. Third Federal Savings, MHC, has received the approval of its members in 10 separate meetings (held in either July or August of each year from 2014 through 2023) to waive the receipt of dividends for a twelve-month period, and the FRS has non-objected to Third Federal Savings, MHCs waiver each time. However, future approvals of members and non-objections from the FRS are not assured and if not obtained, the discontinuance of dividend payments would adversely affect the value of our common stock.\nPublic stockholders own a minority of the outstanding shares of our common stock and are not able to exercise voting control over most matters put to a vote of stockholders.\nThird Federal Savings, MHC, as our majority shareholder, is able to control the outcome of virtually all matters presented to our shareholders for their approval, including any proposal to acquire us. The same directors and officers who manage the Association also manage the Company and Third Federal Savings, MHC. The board of directors of Third Federal Savings, MHC must ensure that the interests of depositors of the Association (as members of Third Federal Savings, MHC) are represented and considered in matters put to a vote of stockholders of the Company. Therefore, Third Federal Savings, MHC, may take action that the public stockholders believe to be contrary to their interests. For example, Third Federal Savings, MHC, may exercise its voting control to defeat a stockholder nominee for election to the board of directors of the Company. Additionally, Third Federal Savings, MHC, may prevent the sale of control or merger of the Company or its subsidiaries, or a second-step conversion of Third Federal Savings, MHC, even if such a transaction were favored by a majority of the public shareholders of the Company.\nRisks Related to Accounting Matters\nChanges in managements estimates and assumptions may have a material impact on our consolidated financial statements and on our financial condition and/or operating results.\nIn preparing periodic reports we are required to file under the Securities Exchange Act of 1934, including our consolidated financial statements, our management is and will be required under applicable rules and regulations to make estimates and assumptions as of a specified date. These estimates and assumptions are based on managements best estimates and experience as of that date and are subject to substantial risk and uncertainty. Materially different results may occur as circumstances change and additional information becomes known. Areas requiring significant estimates and assumptions by management include our evaluation of the adequacy of our allowance for credit losses and the determination of pension obligations.\nChanges in accounting standards could affect reported earnings.\nThe bodies responsible for establishing accounting standards, including the Financial Accounting Standards Board, the Securities and Exchange Commission and other regulatory bodies, periodically change the financial accounting and reporting guidance that governs the preparation of our financial statements. These changes can be hard to predict and can materially impact how we record and report our financial condition and results of operations. In some cases, we could be required to apply new or revised guidance retroactively.\nOther Risks Related to Our Business\nHurricanes or other adverse weather events could negatively affect the economy in our Florida market area or cause disruptions to our branch office locations, which could have an adverse effect on our business or results of operations.\nA significant portion of our branch operations are conducted in Florida, a geographic region with coastal areas that are susceptible to hurricanes and tropical storms. Such weather events can disrupt our operations, result in damage to our branch office locations and negatively affect the local economy in which we operate. We cannot predict whether or to what extent damage caused by future hurricanes or tropical storms will affect our operations or the economy in our market area, but such\nweather events could result in fewer loan originations and greater delinquencies, foreclosures or loan losses. These, and other negative effects of future hurricanes or tropical storms may adversely affect our business or results of operations.\nWe are subject to environmental liability risk associated with lending activities or properties we own.\nA significant portion of our loan portfolio is secured by real estate, and we could become subject to environmental liabilities with respect to one or more of these properties, or with respect to properties that we own in operating our business. During the ordinary course of business, we may foreclose on and take title to properties securing defaulted loans. In doing so, there is a risk that hazardous or toxic substances could be found on these properties. If hazardous conditions or toxic substances are found on these properties, we may be liable for remediation costs, as well as for personal injury and property damage, civil fines and criminal penalties regardless of when the hazardous conditions or toxic substances first affected any particular property. Environmental laws may require us to incur substantial expenses to address unknown liabilities and may materially reduce the affected propertys value or limit our ability to use or sell the affected property. In addition, future laws or more stringent interpretations or enforcement policies with respect to existing laws may increase our exposure to environmental liability. Our policies, which require us to perform an environmental review before initiating any foreclosure action on non-residential real property, may not be sufficient to detect all potential environmental hazards. The remediation costs and any other financial liabilities associated with an environmental hazard could have a material adverse effect on us.\nSocietal responses to climate change could adversely affect our business and performance, including indirectly through impacts on our customers.\nConcerns over the long-term impacts of climate change have led and will continue to lead to governmental efforts around the world to mitigate those impacts. Consumers and businesses also may change their behavior on their own as a result of these concerns. We and our customers will need to respond to new laws and regulations, as well as consumer and business preferences resulting from climate change concerns. We and our customers may face cost increases, asset value reductions, operating process changes, and the like. The impact on our customers will likely vary depending on their specific attributes, including reliance on or role in carbon intensive activities. Among the impacts to us could be a drop in demand for our products and services, particularly in certain sectors. In addition, we could face reductions in creditworthiness on the part of some customers or in the value of assets securing loans. Our efforts to take these risks into account in making lending and other decisions, including increasing our business with climate-friendly companies, may not be effective in protecting us from the negative impact of new laws and regulations or changes in consumer or business behavior.\nOur ability to maintain our reputation is critical to the success of our business, and the failure to do so may materially adversely affect our performance.\nOur reputation is one of the most valuable components of our business and is critical to our success. The ability to attract and retain customers, investors, employees and advisors may depend upon external perceptions of the Company. Damage to the Company's reputation could cause significant harm to our business and prospects and may arise from numerous sources, including litigation or regulatory actions, failing to deliver minimum standards of service and quality, compliance failures, unethical behavior and the misconduct of employees, advisors and counterparties. Adverse developments with respect to the financial services industry may also, by association, negatively impact the Company's reputation or result in greater regulatory or legislative scrutiny or litigation against the Company.\nFurthermore, shareholders, customers and other stakeholders have begun to consider how corporations are addressing ESG issues. Governments, investors, customers and the general public are increasingly focused on ESG practices and disclosures, and views about ESG are diverse and rapidly changing. These shifts in investing priorities may result in adverse effects on the trading price of the Companys common stock if investors determine that the Company has not made sufficient progress on ESG matters. We could also face potential negative ESG-related publicity in traditional media or social media if shareholders or other stakeholders determine that we have not adequately considered or addressed ESG matters. If the Company, or our relationships with certain customers, vendors or suppliers, became the subject of negative publicity, our ability to attract and retain customers and employees, and our financial condition and results of operations, could be adversely impacted.\nA protracted government shutdown may result in reduced loan originations and related gains on sales and could negatively affect our financial condition and results of operations.\nDuring any protracted federal government shutdown, we may not be able to close certain loans and we may not be able to recognize non-interest income on the sale of loans. Some of the loans we originate are sold directly to government agencies, and some of these sales may be unable to be consummated during a shutdown. In addition, we believe that some borrowers may decide not to proceed with their home purchase and not close on their loans, which would result in a permanent loss of the related non-interest income. A federal government shutdown could also result in reduced income for government employees or\nemployees of companies that engage in business with the federal government, which could result in greater loan delinquencies, increased in our non-performing, criticized, and classified assets, and a decline in demand for our products and services. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nWe operate from our main office in Cleveland, Ohio, our 37 full-service branch offices located in Ohio and Florida and our four loan production offices located in Ohio. Our branch offices are located in the Ohio counties of Cuyahoga, Lake, Lorain, Medina and Summit and in the Florida counties of Broward, Collier, Hillsborough, Lee, Palm Beach, Pasco, Pinellas and Sarasota. Our loan production offices are located in the Ohio counties of Butler, Delaware and Hamilton. The Company owns the building in which its home office and executive offices are located, and six other office locations. The net book value of our land, premises, equipment and software was $34.7 million at September 30, 2023, a $177 thousand increase from September 30, 2022 due to a $2.0 million increase in DP equipment and a $479 thousand increase in building improvements. These increases were primarily offset by depreciation. Item 3. Legal Proceedings\nThe Company and its subsidiaries are subject to various legal actions arising in the normal course of business. In the opinion of management, the resolution of these legal actions is not expected to have a material adverse effect on the Companys consolidated financial condition, results of operation, or statements of cash flows. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is listed and traded on the NASDAQ Global Select Market under the symbol TFSL. As of November 14, 2023, we had 6,044 shareholders of record, which does not include persons or entities holding shares in nominee or street name through brokerage firms.\nThrough September 30, 2010, Third Federal Savings, MHC, waived its right to receive dividends. The waivers complied with regulatory authorizations (in the form of non-objection) obtained by Third Federal Savings, MHC. Any requests for future regulatory authorizations to waive receipts of dividends will be submitted to the FRS. Please refer to the preceding discussion of dividend waivers presented in Part I, Item 1. Business-SUPERVISION AND REGULATION-Holding Company Regulation-Waivers of Dividends by Third Federal Savings, MHC. Regulatory non-objection is subject to periodic regulatory review and no assurances can be given regarding future regulatory non-objection. In addition, interim final rules issued by the FRS in 2011 require that a majority of the mutual holding company's members eligible to vote must approve a dividend waiver by a mutual holding company within 12 months prior to the declaration of the dividend being waived. There can be no assurance that a final rule will not require such a member vote.\nAt a special meeting of members of Third Federal Savings, MHC, the members (depositors and certain loan customers of the Association) voted to approve Third Federal Savings, MHC's proposed waiver of dividends aggregating up to $1.13 per share on the common stock of the Company for the 12 months following the special meeting of members held on July 11, 2023. The members approved the waiver by casting 60% of the eligible votes, with 97% of the votes cast, or 58% of the total eligible votes, in favor of the waiver. Third Federal Savings, MHC is the 81% majority shareholder of the Company.\nFollowing the receipt of the members approval at the July 11, 2023 special meeting, Third Federal Savings, MHC filed a notice with, and subsequently received the non-objection of, the FRB-Cleveland for the proposed dividend waivers.\nIn the table and graph that follow, we have provided summary information regarding the performance of the cumulative total return of our common stock from September 30, 2018 through September 30, 2023, relative to the cumulative total return on stocks included in the S&P U.S. BMI Banks Index, KBW NASDAQ Bank Index and NASDAQ Composite, in each case for the same period. The cumulative return data is presented in dollars, based on starting investments of $100 and assuming the reinvestment of dividends.\nMeasurement Date\nIndex (with base price at 9/30/2018) 9/30/2018 9/30/2019 9/30/2020 9/30/2021 9/30/2022 9/30/2023\nTFS Financial Corporation 100.00 127.48 110.47 151.61 111.00 110.02\nS&P U.S. BMI Banks Index 100.00 100.32 73.65 134.01 102.95 99.73\nKBW NASDAQ Bank Index\n100.00 98.25 74.43 136.50 103.11 87.45\nNASDAQ Composite Index 100.00 100.52 141.70 184.58 136.12 171.65\nSource: S&P Global Market Intelligence\nWe did not sell any equity securities during the fiscal year ended September 30, 2023.\nWe did not purchase any stock during the quarter ended September 30, 2023. On October 27, 2016, the Company announced that the Board of Directors approved the Company's eighth stock repurchase program, which authorizes the repurchase of up to 10,000,000 shares of the Company's outstanding common stock. Purchases under the program will be on an ongoing basis and subject to the availability of stock, general market conditions, the trading price of the stock, alternative uses of capital, and our financial performance. Repurchased shares will be held as treasury stock and be available for general corporate use. For the fiscal year ended September 30, 2023, stock repurchases totaled 361,869 shares at an average price per share of $13.82. The program has 5,191,951 shares yet to be purchased as of September 30, 2023. The program has no expiration date. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nOur business strategy is to operate as a well-capitalized and profitable financial institution dedicated to providing exceptional personal service to our customers.\nSince being organized in 1938, we grew to become, at the time of our initial public offering of stock in April 2007, the nations largest mutually-owned savings and loan association based on total assets. We credit our success to our continued emphasis on our primary values: Love, Trust, Respect, and a Commitment to Excellence, along with Having Fun. Our values are reflected in the design and pricing of our loan and deposit products, as described below. Our values are further reflected in a long-term revitalization program encompassing the three-mile corridor of the Broadway-Slavic Village neighborhood in Cleveland, Ohio where our main office was established and continues to be located and where the educational programs we have established and/or support are located. We intend to continue to adhere to our primary values and to support our customers and the communities in which we operate, as we pursue our mission to help people achieve the dream of home ownership and financial security while creating value for our customers, our communities, our associates and our shareholders.\nThe bank failures of three large domestic regional banks during the first half of 2023 negatively impacted consumer confidence and increased stress across the banking sector. The unprecedented implications of 2022 and 2023 fiscal policy coupled with geopolitics impacting energy markets and supply-chain constraints from global shutdowns culminated into high levels of inflation. The subsequent restrictive monetary policy approach has resulted in a heightened exposure of certain banking industry practices. Taking all of this into consideration, we remain confident that our business model and strategic approach remain appropriate. Specifically, (1) our capital ratios remain a primary source of financial strength; (2) our core deposits remain stable and the majority of our deposit accounts fall within FDIC insurance limits; (3) we maintain adequate access to contingent sources of liquidity; and (4) our risk management practices around an array of financial disciplines are robust and commensurate to an institution of our size and complexity.\nThe following tables present select financial data of the Company for the five most recent fiscal years.\nAt September 30,\n2023 2022 2021 2020 2019\n(In thousands)\nSelected Financial Condition Data:\nTotal assets $ 16,917,979 $ 15,789,879 $ 14,057,450 $ 14,642,221 $ 14,542,356\nCash and cash equivalents 466,746 369,564 488,326 498,033 275,143\nInvestment securities - available for sale 508,324 457,908 421,783 453,438 547,864\nLoans held for sale 3,260 9,661 8,848 36,871 3,666\nLoans, net 15,165,747 14,257,067 12,509,035 13,103,062 13,195,745\nBank owned life insurance 312,072 304,040 297,332 222,919 217,481\nPrepaid expenses and other assets 117,270 95,428 91,586 104,832 87,957\nDeposits 9,449,820 8,921,017 8,993,605 9,225,554 8,766,384\nBorrowed funds 5,273,637 4,793,221 3,091,815 3,521,745 3,902,981\nShareholders equity 1,927,361 1,844,339 1,732,280 1,671,853 1,696,754\nFor the Years Ended September 30,\n2023 2022 2021 2020 2019\n(In thousands, except per share amounts)\nSelected Operating Data:\nInterest income $ 611,919 $ 409,333 $ 389,351 $ 455,298 $ 482,087\nInterest expense 328,352 141,937 157,721 213,030 216,666\nNet interest income 283,567 267,396 231,630 242,268 265,421\nProvision (release) for credit losses on loans (1,500) 1,000 (9,000) 3,000 (10,000)\nNet interest income after provision (release) for credit losses on loans 285,067 266,396 240,630 239,268 275,421\nNon-interest income 21,429 23,804 55,299 53,251 20,464\nNon-interest expenses 213,129 198,146 195,835 192,274 193,673\nEarnings before income tax 93,367 92,054 100,094 100,245 102,212\nIncome tax expense 18,117 17,489 19,087 16,928 21,975\nNet earnings after income tax expense $ 75,250 $ 74,565 $ 81,007 $ 83,317 $ 80,237\nEarnings per share\nBasic $ 0.27 $ 0.26 $ 0.29 $ 0.30 $ 0.29\nDiluted $ 0.26 $ 0.26 $ 0.29 $ 0.29 $ 0.28\nCash dividends declared per share $ 1.13 $ 1.13 $ 1.12 $ 1.11 $ 1.02\nAt or For The Years Ended September 30,\n2023 2022 2021 2020 2019\nSelected Financial Ratios and Other Data:\nPerformance Ratios:\nReturn on average assets 0.46 % 0.51 % 0.56 % 0.56 % 0.56 %\nReturn on average equity 4.00 % 4.14 % 4.77 % 4.88 % 4.58 %\nInterest rate spread(1) 1.57 % 1.75 % 1.52 % 1.52 % 1.73 %\nNet interest margin(2) 1.80 % 1.88 % 1.66 % 1.69 % 1.92 %\nEfficiency ratio(3) 69.88 % 68.04 % 68.25 % 65.06 % 67.75 %\nNon-interest expense to average total assets 1.31 % 1.34 % 1.35 % 1.29 % 1.36 %\nAverage interest-earning assets to average interest-bearing\nliabilities 111.36 % 112.42 % 111.92 % 111.41 % 112.28 %\nAsset Quality Ratios:\nNon-performing assets as a percent of total assets 0.20 % 0.23 % 0.32 % 0.37 % 0.50 %\nNon-accruing loans as a percent of total loans 0.21 % 0.25 % 0.35 % 0.41 % 0.54 %\nAllowance for credit losses on loans as a percent of\nnon-accruing loans 242.26 % 204.73 % 145.96 % 87.95 % 54.60 %\nAllowance for credit losses on loans as a percent of total loans 0.51 % 0.51 % 0.51 % 0.36 % 0.29 %\nCapital Ratios:\nAssociation\nTotal capital to risk-weighted assets(4) 17.87 % 18.84 % 21.00 % 19.96 % 19.56 %\nTier 1 (leverage) capital to net average assets(4) 9.82 % 10.33 % 11.15 % 10.39 % 10.54 %\nTier 1 capital to risk-weighted assets(4) 17.15 % 18.25 % 20.43 % 19.37 % 19.07 %\nCommon equity tier 1 capital to risk-weighted assets(4) 17.15 % 18.25 % 20.43 % 19.37 % 19.07 %\nTFS Financial Corporation\nTotal capital to risk-weighted assets(4) 19.85 % 21.18 % 23.75 % 22.71 % 22.22 %\nTier 1 (leverage) capital to net average assets(4) 10.96 % 11.66 % 12.65 % 11.88 % 12.05 %\nTier 1 capital to risk-weighted assets(4) 19.13 % 20.59 % 23.18 % 22.13 % 21.73 %\nCommon equity tier 1 capital to risk-weighted assets(4) 19.13 % 20.59 % 23.18 % 22.13 % 21.73 %\nAverage equity to average total assets 11.58 % 12.23 % 11.72 % 11.50 % 12.30 %\nOther Data:\nAssociation:\nNumber of full service offices 37 37 37 37 37\nLoan production offices 4 5 7 7 8\n______________________\n(1)Represents the difference between the weighted-average yield on interest-earning assets and the weighted-average cost of interest-bearing liabilities for the year.\n(2)The net interest margin represents net interest income as a percent of average interest-earning assets for the year.\n(3)The efficiency ratio represents non-interest expense divided by the sum of net interest income and non-interest income.\n(4)In April 2020, the Simplifications to the Capital Rule (\"Rule\") was adopted, which simplified certain aspects of the capital rule under Basel III. The impact of the Rule was not material to previously reported regulatory capital ratios.\nManagement believes that the following matters are those most critical to our success: (1) controlling our interest rate risk exposure; (2) monitoring and limiting our credit risk; (3) maintaining access to adequate liquidity and diverse funding sources to support our growth; and (4) monitoring and controlling our operating expenses.\nControlling Our Interest Rate Risk Exposure. Historically, our greatest risk has been our exposure to changes in interest rates. When we hold longer-term, fixed-rate assets, funded by liabilities with shorter-term re-pricing characteristics, we are exposed to potentially adverse impacts from changing interest rates, and most notably rising interest rates. Generally, and particularly over extended periods of time that encompass full economic cycles, interest rates associated with longer-term\nassets, like fixed-rate mortgages, have been higher than interest rates associated with shorter-term funding sources, like deposits. This difference has been an important component of our net interest income and is fundamental to our operations.\nA challenge to our business model occurs when there is a rapid and substantial increase in short-term rates or there is an extended inverted yield curve, which have both occurred over recent periods. This economic environment has resulted in a decrease in our net interest margin.\nTo mitigate our interest rate risk in general and to address the current rate environment specifically, we utilize a variety of strategies that include:\nMaintaining regulatory capital in excess of levels required to be considered well capitalized;\nPromoting adjustable-rate loans and shorter-term fixed-rate loans;\nMarketing home equity lines of credit, which carry an adjustable rate of interest, indexed to the prime rate;\nOpportunistically extending the duration of our funding sources;\nUtilizing interest rate swaps to convert short-term FHLB advances and brokered certificates of deposit into long-term, fixed-rate borrowings; and\nSelectively selling a portion of our long-term, fixed-rate mortgage loans in the secondary market.\nLevels of Regulatory Capital\nAt September 30, 2023, the Companys Tier 1 (leverage) capital totaled $1.83 billion, or 10.96% of net average assets and 19.13% of risk-weighted assets, while the Associations Tier 1 (leverage) capital totaled $1.64 billion, or 9.82% of net average assets and 17.15% of risk-weighted assets. Each of these measures is in excess of the requirements currently in effect for the Association for designation as well capitalized under regulatory prompt corrective action provisions, which set minimum levels of 5.00% of net average assets and 8.00% of risk-weighted assets. Beginning this fiscal year, the Company entered into the final three years of the five-year transitional period, as provided by a final rule, after CECL was adopted in fiscal year 2021. Refer to the Liquidity and Capital Resources section of this Item 7 for additional discussion regarding regulatory capital requirements.\nPromotion of Adjustable-Rate Loans and Shorter-Term, Fixed-Rate Loans\nWe offer our \"Smart Rate\" adjustable-rate mortgage loan, which provides us with improved interest rate risk characteristics when compared to a 30-year, fixed-rate mortgage loan.\nWe also offer a 10-year, fully amortizing fixed-rate, first mortgage loan. The 10-year, fixed-rate loan has a more desirable interest rate risk profile when compared to loans with fixed-rate terms of 15 to 30 years and can help to more effectively manage interest rate risk exposure, yet provides our borrowers with the certainty of a fixed interest rate throughout the life of the obligation.\nThe following tables set forth our first mortgage loan production and balances segregated by loan structure at origination.\nFor the Years Ended September 30,\n2023 2022\nAmount Percent Amount Percent\nFirst Mortgage Loan Originations and Purchases:\n(Dollars in thousands)\nARM (all Smart Rate) production $ 624,773 33.7 % $ 1,029,156 28.2 %\nFixed-rate production:\nTerms less than or equal to 10 years 34,710 1.9 470,806 12.9\nTerms greater than 10 years 1,195,562 64.4 2,146,021 58.9\nTotal fixed-rate production 1,230,272 66.3 2,616,827 71.8\nTotal First Mortgage Loan Originations and Purchases:\n$ 1,855,045 100.0 % $ 3,645,983 100.0 %\nSeptember 30, 2023 September 30, 2022\nAmount Percent Amount Percent\nBalances of First Mortgage Loans Held For Investment: (Dollars in thousands)\nARM (primarily Smart Rate) Loans $ 4,760,843 39.2 % $ 4,668,089 40.3 %\nFixed-rate Loans:\nTerms less than or equal to 10 years 1,088,048 9.0 1,350,436 11.6\nTerms greater than 10 years 6,275,775 51.8 5,574,589 48.1\nTotal fixed-rate loans 7,363,823 60.8 6,925,025 59.7\nTotal First Mortgage Loans Held For Investment: $ 12,124,666 100.0 % $ 11,593,114 100.0 %\nThe following table sets forth the balances as of September 30, 2023 for all ARM loans segregated by the next scheduled interest rate reset date.\nCurrent Balance of ARM Loans Scheduled for Interest Rate Reset\nDuring the Fiscal Years Ending September 30, (in thousands)\n2024 $381,797\n2025 699,104\n2026 1,464,792\n2027 1,650,442\n2028 510,582\n2029 54,126\nTotal $4,760,843\nAt September 30, 2023 and September 30, 2022, mortgage loans held for sale, all of which were long-term, fixed-rate first mortgage loans and all of which were held for sale to Fannie Mae, totaled $3.3 million and $9.7 million, respectively.\nLoan Portfolio Yield\nThe following tables set forth the principal balance and interest yield as of September 30, 2023 for the portfolio of loans held for investment, by type of loan, structure and geographic location.\nSeptember 30, 2023\nBalance Percent Yield\n(Dollars in thousands)\nTotal Loans:\nFixed-Rate\nTerms less than or equal to 10 years $ 1,088,048 7.2 % 2.67 %\nTerms greater than 10 years 6,275,775 41.3 3.85 %\nTotal Fixed-Rate loans 7,363,823 48.5 3.68 %\nARMs 4,760,843 31.3 3.11 %\nHome Equity Loans and Lines of Credit 3,030,526 19.9 7.39 %\nConstruction and Other loans 52,817 0.3 5.11 %\nTotal Loans Receivable $ 15,208,009 100.0 % 4.25 %\nSeptember 30, 2023\nBalance Fixed-Rate Balance\nPercent Yield\n(Dollars in thousands)\nResidential Mortgage Loans\nOhio $ 6,938,036 $ 5,322,695 45.6 % 3.65 %\nFlorida 2,137,804 1,032,002 14.1 3.29 %\nOther 3,048,826 1,009,126 20.0 3.15 %\nTotal Residential Mortgage Loans 12,124,666 7,363,823 79.7 3.46 %\nHome Equity Loans and Lines of Credit\nOhio 773,324 88,340 5.1 7.33 %\nFlorida 666,517 68,801 4.4 7.31 %\nCalifornia 513,904 47,129 3.4 7.34 %\nOther 1,076,781 43,231 7.1 7.52 %\nTotal Home Equity Loans and Lines of Credit 3,030,526 247,501 20.0 7.39 %\nConstruction and Other loans 52,817 52,817 0.3 5.11 %\nTotal Loans Receivable $ 15,208,009 $ 7,664,141 100.0 % 4.25 %\nMarketing of Home Equity Lines of Credit\nWe actively market home equity lines of credit, which carry an adjustable rate of interest indexed to the prime rate which provides interest rate sensitivity to that portion of our assets and is a meaningful strategy to manage our interest rate risk profile. Increasing our investments in loans with variable rates of interest help to better match the maturities and interest rates of our assets and liabilities, thereby reducing the exposure of our net interest income to changes in market interest rates. We strive to grow the home equity line of credit portfolio through offering competitive rates, marketing efforts, and by utilizing partners to attract more home equity line of credit customers. At September 30, 2023, the principal balance of home equity lines of credit totaled $2.63 billion. Our home equity lending is discussed in the preceding Lending Activities section of Item 1. Business in Part I. THIRD FEDERAL SAVINGS AND LOAN ASSOCIATION OF CLEVELAND.\nExtending the Duration of Funding Sources\nAs a complement to our strategies to shorten the duration of our interest-earning assets, as described above, we also seek to lengthen the duration of our interest-bearing funding sources. These efforts include monitoring the relative costs of alternative funding sources such as retail certificates of deposit, brokered certificates of deposit, longer-term (e.g. four to six\nyears) fixed-rate advances from the FHLB of Cincinnati, and shorter-term (e.g. three months) funding, the durations of which are extended by correlated interest rate exchange contracts (\"swap\"). All of our swaps are subject to collateral pledges and require specific structural features to qualify for hedge accounting treatment. Hedge accounting treatment directs that periodic mark-to-market adjustments be recorded in other comprehensive income (loss) in the equity section of the balance sheet, rather than being included in operating results of the income statement. The Association's intent is that any swap to which it may be a party will qualify for hedge accounting treatment.\nThe Association is a party to interest rate swap agreements. Each of the Association's swap agreements is registered on the Chicago Mercantile Exchange and involves the exchange of interest payment amounts based on a notional principal balance. No exchange of principal amounts occur and the notional principal amount does not appear on our balance sheet. The Association uses swaps to extend the duration of its funding sources. In each of the Association's agreements, interest paid is based on a fixed rate of interest throughout the term of each agreement while interest received is based on an interest rate that resets and compounds daily over a specified interval (generally three months) throughout the term of each agreement. On the initiation date of the swap, the agreed upon exchange interest rates reflect market conditions at that point in time. Swaps generally require counterparty collateral pledges that ensure the counterparties' ability to comply with the conditions of the agreement. Concurrent with the execution of each swap, the Association enters into a short-term borrowing in an amount equal to the notional amount of the swap and with interest rate resets aligned with the reset interval of the swap. Each individual swap agreement has been designated as a cash flow hedge of interest rate risk associated with either the Company's variable rate borrowings from the FHLB of Cincinnati or brokered CD's. In these challenging economic times with an extended inverted yield curve, the Association has found it financially beneficial to increase the use of swaps to lower our borrowing costs and extend the duration of our liabilities. For more details, refer to Notes 10. BORROWED FUNDS and 17. DERIVATIVE INSTRUMENTS to the unaudited consolidated financial statements.\nEach funding alternative is monitored and evaluated based on its effective interest payment rate, options exercisable by the creditor (early withdrawal, right to call, etc.), and collateral requirements. Refer to Notes 10. DEPOSITS and 17. BORROWED FUNDS for additional details on balances. The interest payment rate is a function of market influences that are specific to the nuances and market competitiveness/breadth of each funding source. Generally, early withdrawal options, subject to a fee, are available to our retail CD customers but not to holders of brokered CDs; issuer call options are not provided on our advances from the FHLB of Cincinnati; and we are not subject to early termination options with respect to our interest rate exchange contracts. Additionally, collateral pledges are not provided with respect to our retail CDs or our brokered CDs, but are required for our advances from the FHLB of Cincinnati as well as for our interest rate exchange contracts. We will continue to evaluate the structure of our funding sources based on current needs.\nOther Interest Rate Risk Management Tools\nWe also manage interest rate risk by selectively selling a portion of our long-term, fixed-rate mortgage loans in the secondary market. First mortgage loans (primarily fixed-rate, mortgage refinances with terms of 15 years or more and Home Ready) are originated under Fannie Mae procedures and are eligible for sale to Fannie Mae either as whole loans or within mortgage-backed securities. Currently, certain types of loans (i.e. our Smart Rate adjustable-rate loans, home purchase fixed-rate loans and 10-year fixed-rate loans) are originated under our legacy procedures, which are not eligible for sale to Fannie Mae. We can also manage interest rate risk by selling non-Fannie Mae compliant mortgage loans to private investors, although those transactions may be limited to loans that have established payment histories, strong borrower credit profiles and are supported by adequate collateral. Additionally, sales to private investors are dependent upon favorable market conditions, including motivated buyers, and involve more complicated negotiations and longer settlement timelines. Loan sales are discussed in more detail within the Liquidity and Capital Resources section of this Item 7.\nDuring the fiscal year ended September 30, 2023, $77.2 million of agency-compliant, long-term (15 to 30 years), fixed-rate mortgage loans were sold, or committed to be sold, to Fannie Mae on a servicing retained basis. Of these sold loans, $43.5 million were originated through Mortgage Passport, and $33.7 million were originated as other agency-compliant first mortgage loans. At September 30, 2023, loans that are classified as held for sale total $3.3 million. As of September 30, 2023, we serviced $1.93 billion of loans we originated and later sold to investors.\nWe continue to consider liquidity and balance sheet management, as well as secondary market pricing, in evaluating the opportunity to sell loans. Additionally, we are expanding our ability to sell certain fixed-rate loans to Fannie through the use of more traditional mortgage banking activities, including a proprietary approach to risk-based pricing and loan-level pricing adjustments. This approach is concentrated in markets outside of Ohio and Florida. Some additional startup and marketing costs have been incurred, but are not expected to significantly impact our financial results in fiscal year 2023. Loan sales are discussed in more detail within the Liquidity and Capital Resources section of this Item 7.\nMonitoring and Limiting Our Credit Risk. While, historically, we had been successful in limiting our credit risk exposure by generally imposing high credit standards with respect to lending, the memory of the 2008 housing market collapse and financial crisis is a constant reminder to focus on credit risk. In response to the evolving economic landscape, we continuously revise and update our quarterly analysis and evaluation procedures, as needed, for each category of our lending with the objective of identifying and recognizing all appropriate credit losses. At September 30, 2023, 90% of our assets consisted of residential real estate loans (both held for sale and held for investment) and home equity loans and lines of credit. Our analytic procedures and evaluations include specific reviews of all home equity loans and lines of credit that become 90 or more days past due, as well as specific reviews of all first mortgage loans that become 180 or more days past due. We transfer performing home equity lines of credit subordinate to first mortgages delinquent greater than 90 days to non-accrual status. We also charge-off performing loans to collateral value and classify those loans as non-accrual within 60 days of notification of all borrowers filing Chapter 7 bankruptcy, that have not reaffirmed or been dismissed, regardless of how long the loans have been performing.\nIn an effort to align our credit risk exposure with the low risk appetite approved by the Board of Directors, the credit eligibility criteria is evaluated to ensure a successful homeowner has the primary source of repayment, followed by a collateral position that allows for a secondary source of repayment, if needed. Products that do not result in an effective mix of repayment ability are not offered. We use stringent, conservative lending standards for underwriting to reduce our credit risk. For first mortgage loans originated or purchased during the current fiscal year, the average credit score was 774, and the average LTV was 71% at origination. The delinquency level related to loan originations prior to 2009, compared to originations or purchases in 2009 and after, reflect the higher credit standards to which we have subjected all new originations. As of September 30, 2023, loans originated prior to 2009 had a balance of $276.5 million, of which $5.5 million, or 2.0%, were delinquent, while loans originated or purchased in 2009 and after had a balance of $15.0 billion, of which $17.8 million, or 0.1%, were delinquent.\nOne aspect of our credit risk concern relates to high concentrations of our loans that are secured by residential real estate in specific states, particularly Ohio and Florida, where a large portion of our historical lending has occurred. At September 30, 2023, approximately 57.2% and 17.7% of the combined total of our residential Core and construction loans held for investment and approximately 25.5% and 22.0% of our home equity loans and lines of credit were secured by properties in Ohio and Florida, respectively. In an effort to moderate the concentration of our credit risk exposure in individual states, we have utilized direct mail marketing, our internet site and our customer service call center to extend our lending activities to other attractive geographic locations. Currently, in addition to Ohio and Florida, we are actively lending in 23 other states and the District of Columbia, and as a result of that activity, the concentration ratios of the combined total of our residential Core and construction loans held for investment in Ohio and Florida have trended downward from their September 30, 2010 levels when the concentrations were 79.1% in Ohio and 19.0% in Florida. Of the total mortgage loan originations and purchases for the year ended September 30, 2023, 25.8% are secured by properties in states other than Ohio or Florida.\nMaintaining Access to Adequate Liquidity and Diverse Funding Sources to Support our Growth. For most insured depositories, customer and community confidence are critical to their ability to maintain access to adequate liquidity and to conduct business in an orderly manner. We believe that a well capitalized institution is one of the most important factors in nurturing customer and community confidence. Accordingly, we plan to manage the pace of our growth in a manner that reflects our emphasis on high capital levels. At September 30, 2023, the Associations ratio of Tier 1 (leverage) capital to net average assets (a basic industry measure that deems 5.00% or above to represent a well capitalized status) was 9.82%. The Association's Tier 1 (leverage) capital ratio at September 30, 2023 included the negative impact of a $40 million cash dividend payment that the Association made to the Company, its sole shareholder, in December 2022. Because of its intercompany nature, this dividend payment did not impact the Company's consolidated capital ratios. We expect to continue to remain a well capitalized institution.\nIn managing its level of liquidity, the Company monitors available funding sources, which include attracting new deposits (including brokered deposits), borrowing from others, the conversion of assets to cash and the generation of funds through profitable operations. The Company has traditionally relied on retail deposits as its primary means in meeting its funding needs. To attract deposits, we typically offer rates that are competitive with the rates on similar products offered by other financial institutions. At September 30, 2023, deposits totaled $9.45 billion (including $1.16 billion of brokered CDs), while borrowings totaled $5.27 billion and borrowers advances and servicing escrows totaled $154.2 million, combined. In evaluating funding sources, we consider many factors, including cost, collateral, duration and optionality, current availability, expected sustainability, impact on operations and capital levels.\nWe preserve the availability of alternative funding sources through various mechanisms. First, by maintaining high capital levels, we retain the flexibility to increase our balance sheet size without jeopardizing our capital adequacy. Effectively, this permits us to increase the rates that we offer on our deposit products thereby attracting more potential customers. Second, we pledge available real estate mortgage loans with the FHLB of Cincinnati and the FRB-Cleveland. At September 30, 2023, the\nAssociation had the ability to borrow a maximum of $6.63 billion from the FHLB of Cincinnati and $126.4 million from the FRB-Cleveland Discount Window. As of September 30, 2023, our capacity for additional borrowing from FHLB of Cincinnati was $1.38 billion, Third, we have the ability to purchase overnight Fed Funds up to $585.0 million through various arrangements with other institutions. Fourth, we invest in high quality marketable securities that exhibit limited market price variability and, to the extent that they are not needed as collateral for borrowings, can be sold in the institutional market and converted to cash. At September 30, 2023, our investment securities portfolio totaled $508.3 million. Finally, cash flows from operating activities have been a regular source of funds. During the fiscal years ended September 30, 2023 and 2022, cash flows from operations totaled $90.7 million and $38.9 million, respectively.\nOverall, while customer and community confidence can never be assured, the Company believes that our liquidity is adequate and that we have adequate access to alternative funding sources.\nMonitoring and Controlling Our Operating Expenses. We continue to focus on managing operating expenses. Our ratio of non-interest expense to average assets was 1.31% for the fiscal year ended September 30, 2023 and 1.34% for the fiscal year ended September 30, 2022. As of September 30, 2023, our average assets per full-time associate and our average deposits per full-time associate were $17.1 million and $9.5 million, respectively. We believe that each of these measures compares favorably with industry averages. Our relatively high average deposits (exclusive of brokered accounts) held at our branch offices ($224.0 million per branch office as of September 30, 2023) contributes to our expense management efforts by limiting the overhead costs of serving our customers. We will continue our efforts to control operating expenses as we grow our business.\nCritical Accounting Policies and Estimates\nCritical accounting policies and estimates are defined as those that involve significant judgments and uncertainties, and could potentially give rise to materially different results under different assumptions and conditions. We believe that the most critical accounting policies and estimates upon which our financial condition and results of operations depend, and which involve the most complex subjective decisions or assessments, relate to the allowance for credit losses, income taxes and pension benefits.\nAllowance for Credit Losses. The allowance for credit losses is the amount estimated by management as necessary to absorb credit losses related to both the loan portfolio and off-balance sheet commitments based on a life of loan methodology. The amount of the allowance is based on significant estimates and the ultimate losses may vary from such estimates as more information becomes available or conditions change. The methodology for determining the allowance for credit losses is considered a critical accounting policy by management due to the high degree of judgment involved, the subjectivity of the assumptions used and the potential for changes in the economic environment that could result in changes to the amount of the recorded allowance for credit losses. At September 30, 2023, the allowance for credit losses was $102.6 million or 0.67% of total loans. An increase or decrease of 10% in the allowance at September 30, 2023 would result in a $10.3 million charge or release, respectively, to income before income taxes.\nAs a substantial percentage of our loan portfolio is collateralized by real estate, appraisals of the underlying value of property securing loans are critical in determining the charge-offs for specific loans. Assumptions are instrumental in determining the value of properties. Overly optimistic assumptions or negative changes to assumptions could significantly affect the valuation of a property securing a loan and the related allowance determined. Management carefully reviews the assumptions supporting such appraisals to determine that the resulting values reasonably reflect amounts realizable on the related loans.\nManagement performs a quarterly evaluation of the adequacy of the allowance for credit losses. We consider a variety of factors in establishing this estimate including, but not limited to, current economic conditions, delinquency statistics, geographic concentrations, economic forecasts and how they correlate to management's view of the future, the adequacy of the underlying collateral, the financial strength of the borrower, results of internal loan reviews and other relevant factors. This evaluation is inherently subjective as it requires material estimates by management that may be susceptible to significant change based on changes in economic and real estate market conditions. Refer to Note 5. LOANS AND ALLOWANCES FOR CREDIT LOSSES of the NOTES TO CONSOLIDATED FINANCIAL STATEMENTS and the Lending Activities section of Item 1. Business in Part I. for further discussion.\nActual loan losses may be significantly more than the allowances we have established, which would have a materially adverse effect on our financial results.\nIncome Taxes. Accounting for income taxes involves critical accounting policies and estimates due to the subjective nature of certain estimates that are involved in the calculation. We use the asset/liability method of accounting for income taxes in which deferred tax assets and liabilities are established for the temporary differences between the financial reporting basis\nand the tax basis of our assets and liabilities. We must assess the realization of the deferred tax asset and, to the extent that we believe that recovery is not likely, a valuation allowance is established. Adjustments to increase or decrease existing valuation allowances, if any, are charged or credited, respectively, to income tax expense. At September 30, 2023, no valuation allowances were outstanding. Even though we have determined a valuation allowance is not required for deferred tax assets at September 30, 2023, there is no guarantee that those assets will be recognizable in the future.\nPension Benefits. The determination of our obligations and expense for pension benefits is dependent upon certain assumptions used in calculating such amounts. Key assumptions used in the actuarial valuations include the discount rate and expected long-term rate of return on plan assets. Actual results could differ from the assumptions and market driven rates may fluctuate. Significant differences in actual experience or significant changes in the assumptions could materially affect future pension obligations and expense.\nComparison of Financial Condition at September 30, 2023 and September 30, 2022\nTotal assets increased $1.13 billion, or 7.1%, to $16.92 billion at September 30, 2023, from $15.79 billion at September 30, 2022. This increase was mainly due to new loan originations exceeding the total of loan sales and principal repayments.\nCash and cash equivalents increased $97.1 million, or 26.3%, to $466.7 million at September 30, 2023, from $369.6 million at September 30, 2022. Cash is managed to maintain the level of liquidity described later in the Liquidity and Capital Resources section of the Overview.\nInvestment securities, all of which are classified as available for sale, increased $50.4 million, or 11.0%, to $508.3 million at September 30, 2023, from $457.9 million at September 30, 2022. Investment securities increased as $144.7 million in purchases exceeded the combined effect of $83.6 million in principal repayments, a $9.7 million increase in unrealized losses and $1.0 million of premium amortization that occurred during the year ended September 30, 2023. There were no sales of investment securities during the year ended September 30, 2023.\nLoans held for investment, net of deferred loan fees and allowance for credit losses, increased $908.7 million, or 6.4%, to $15.17 billion at September 30, 2023, from $14.26 billion at September 30, 2022, as new originations and additional draws on existing accounts exceeded loan sales and repayments. Residential mortgage loans increased $531.6 million, or 4.6%, to $12.12 billion at September 30, 2023. In addition, there was a $396.6 million increase in the balance of home equity loans and lines of credit during the year ended September 30, 2023. During the fiscal year ended September 30, 2023, $624.8 million of three- and five-year Smart Rate loans were originated while $1.23 billion of 10-, 15-, and 30-year fixed-rate first mortgage loans were originated or purchased. Of the total $1.86 billion in first mortgage loans originated and purchased for the fiscal year ended September 30, 2023, 11% were refinance transactions and 89% were purchases, while 34% were adjustable-rate mortgages and 66% were fixed-rate mortgages. Fixed-rate loans with terms of 10 years or less accounted for 2% of total first mortgage loan originations and purchases. During the fiscal year ended September 30, 2023, we completed $77.2 million in loan sales to Fannie Mae, which included $43.5 million of loans originated through our Mortgage Passport program and $33.7 million of agency-compliant first mortgage loans originated through our traditional lending programs.\nCommitments originated for home equity lines of credit and equity and bridge loans were $1.70 billion for the year ended September 30, 2023, compared to $2.16 billion for the year ended September 30, 2022. At September 30, 2023, pending commitments to originate new home equity lines of credit were $64.2 million and equity and bridge loans were $80.9 million. Refer to the Controlling Our Interest Rate Risk Exposure section of the Overview for additional information.\nThe allowance for credit losses was $104.8 million, or 0.69% of total loans receivable, at September 30, 2023, and included a $27.5 million liability for unfunded commitments. At September 30, 2022, the allowance for credit losses was $99.9 million, or 0.70% of total loans receivable and included a $27.0 million liability for unfunded commitments. Refer to Note 5. LOANS AND ALLOWANCE FOR CREDIT LOSSES of the NOTES TO CONSOLIDATED FINANCIAL STATEMENTS for additional discussion.\nThe amount of FHLB stock owned increased $34.8 million, or 16.4%, to $247.1 million at September 30, 2023, from $212.3 million at September 30, 2022. FHLB stock ownership requirements dictate the amount of stock owned at any given time.\nTotal bank owned life insurance contracts increased $8.0 million, to $312.0 million at September 30, 2023, from $304.0 million at September 30, 2022, primarily due to changes in cash surrender value.\nDeposits increased $528.8 million, or 5.9%, to $9.45 billion at September 30, 2023, from $8.92 billion at September 30, 2022. The increase in deposits resulted primarily from a $786.7 million increase in CDs, partially offset by a $22.9 million\ndecrease in savings accounts (consisting of an $135.2 million decrease in money market accounts in the state of Florida and a $95.8 million increase in our high yield savings accounts) and a $226.6 million decrease in interest-bearing checking accounts. The balance of brokered CDs at September 30, 2023 was $1.16 billion, which is an increase of $587.4 million from the balance of $575.2 million at September 30, 2022. Based on FDIC insurance limits by ownership structure, the total uninsured deposits were $322.5 million and $366.7 million at September 30, 2023 and September 30, 2022, respectively.\nBorrowed funds increased $480.4 million, or 10.0%, to $5.27 billion at September 30, 2023, from $4.79 billion at September 30, 2022. The increase was primarily used to fund loan growth. The total balance of borrowed funds at September 30, 2023, all from the FHLB, included $592.0 million of overnight advances, $1.51 billion of term advances with a weighted average maturity of approximately 2.2 years, and $3.15 billion of short-term advances aligned with interest rate swap contracts. Interest rate swaps have been used to extend the duration of short-term borrowings at inception by paying a fixed rate of interest and receiving a variable rate. Refer to the Extending the Duration of Funding Sources section of the Overview and Part II, Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nGeneral. The majority of our assets and liabilities are monetary in nature. Consequently, our most significant form of market risk has historically been interest rate risk. In general, our assets, consisting primarily of mortgage loans, have longer maturities than our liabilities, consisting primarily of deposits and advances from the FHLB of Cincinnati. As a result, a fundamental component of our business strategy is to manage interest rate risk and limit the exposure of our net interest income to changes in market interest rates. Accordingly, our Board of Directors has established risk parameter limits deemed appropriate given our business strategy, operating environment, capital, liquidity and performance objectives. Additionally, our Board of Directors has authorized the formation of an Asset/Liability Management Committee comprised of key operating personnel, which is responsible for managing this risk in a manner that is consistent with the guidelines and risk limits approved by the Board of Directors. Further, the Board has established the Directors Risk Committee, which, among other responsibilities, conducts regular oversight and review of the guidelines, policies and deliberations of the Asset/Liability Management Committee. We manage our interest rate risk in order to control the exposure of our earnings and capital to changes in interest rates. Refer to the Overview section of Item 7 for additional discussion on how we manage interest rate risk.\nEconomic Value of Equity. Using customized modeling software, the Company and Association prepare periodic estimates of the amounts by which the net present value of cash flows from assets, liabilities and off-balance sheet items (the institutions economic value of equity or EVE) would change in the event of a range of assumed changes in market interest rates. The simulation model uses a discounted cash flow analysis and an option-based pricing approach in measuring the interest rate sensitivity of EVE. The model estimates the economic value of each type of asset, liability and off-balance sheet contract under the assumption that instantaneous changes (measured in basis points) occur at all maturities along the United States Treasury yield curve and other relevant market interest rates. A basis point equals one, one-hundredth of one percent, and 100 basis points equals one percent. An increase in interest rates from 2% to 3% would mean, for example, a 100 basis point increase in the Change in Interest Rates column below. The model is tailored specifically to our organization, which, we believe, improves its predictive accuracy. Computations of prospective effects of hypothetical interest rate changes are based on numerous assumptions, including relative levels of market interest rates, loan prepayments and deposit decay, and should not be relied upon as indicative of actual results.\nThe following table presents the estimated changes in the Company's EVE at September 30, 2023 that would result from the indicated instantaneous changes in the United States Treasury yield curve and other relevant market interest rates.\nTFS Financial Corporation\nChange in\nInterest Rates\n(basis points) (1) Estimated\nEVE (2) Estimated Increase\n(Decrease) in EVE EVE as a Percentage\nof Present Value of\nAssets (3)\nEVE\nRatio (4) Increase\n(Decrease)\n(basis points)\nAmount Percent\n(Dollars in thousands)\n+300 $ 740,527 $ (513,451) (40.95) % 5.28 % (293)\n+200 928,976 (325,002) (25.92) % 6.44 % (177)\n+100 1,111,172 (142,806) (11.39) % 7.49 % (72)\n0 1,253,978 - - % 8.21 % -\n-100 1,365,669 111,691 8.91 % 8.70 % 49\n-200 1,422,575 168,597 13.44 % 8.83 % 62\n-300 1,411,363 157,385 12.55 % 8.56 % 35\nThe following table presents the estimated changes in the Association's EVE at September 30, 2023 that would result from the indicated instantaneous changes in the United States Treasury yield curve and other relevant market interest rates.\nThird Federal Savings and Loan Association\nChange in\nInterest Rates\n(basis points) (1) Estimated\nEVE (2) Estimated Increase\n(Decrease) in EVE EVE as a Percentage\nof Present Value of\nAssets (3)\nEVE\nRatio (4) Increase\n(Decrease)\n(basis points)\nAmount Percent\n(Dollars in thousands)\n+300 $ 519,419 $ (512,967) (49.69) % 3.71 % (306)\n+200 707,707 (324,679) (31.45) % 4.91 % (186)\n+100 889,739 (142,647) (13.82) % 6.00 % (77)\n0 1,032,386 - - % 6.77 % -\n-100 1,143,898 111,512 10.80 % 7.30 % 53\n-200 1,200,628 168,242 16.30 % 7.46 % 69\n-300 1,189,237 156,851 15.19 % 7.22 % 45\n_________________\n(1)Assumes an instantaneous uniform change in interest rates at all maturities.\n(2)EVE is the discounted present value of expected cash flows from assets, liabilities and off-balance sheet contracts.\n(3)Present value of assets represents the discounted present value of incoming cash flows on interest-earning assets.\n(4)EVE Ratio represents EVE divided by the present value of assets.\nThe tables above indicate that at September 30, 2023, in the event of an increase of 200 basis points in all interest rates, the Company and Association would experience a 25.92% and 31.45% decrease in EVE, respectively. In the event of a 100 basis point decrease in interest rates, the Company and Association would experience a 8.91% and 10.80% increase in EVE, respectively.\nThe following tables are based on the calculations contained in the previous tables, and set forth the change in the EVE at a +200 basis point rate of shock at September 30, 2023, with comparative information as of September 30, 2022. By regulation, the Association must measure and manage its interest rate risk for interest rate shocks relative to established risk tolerances in EVE.\nTFS Financial Corporation\nAt September 30,\nRisk Measure (+200 bp Rate Shock) 2023 2022\nPre-Shock EVE Ratio 8.21 % 11.00 %\nPost-Shock EVE Ratio 6.44 % 9.25 %\nSensitivity Measure in basis points (177) (175)\nPercentage Change in EVE Ratio (25.92) % (20.25) %\nThird Federal Savings and Loan Association\nAt September 30,\nRisk Measure (+200 bp Rate Shock) 2023 2022\nPre-Shock EVE Ratio 6.77 % 9.08 %\nPost-Shock EVE Ratio 4.91 % 6.71 %\nSensitivity Measure in basis points (186) (237)\nPercentage Change in EVE Ratio (31.45) % (29.92) %\nThe manner in which actual yields, costs and consumer behavior respond to changes in market interest rates may vary from the inherent methodologies used to measure interest rate risk through changes in EVE. In this regard, the EVE tables presented above assume:\nno new growth or business volumes;\nthat the composition of our interest-sensitive assets and liabilities existing at the beginning of a period remains constant over the period being measured, except for reductions to reflect mortgage loan principal repayments along with modeled prepayments and defaults, and deposit decays; and\nthat a particular change in interest rates is reflected uniformly across the yield curve regardless of the duration or repricing of specific assets and liabilities.\nAccordingly, although the EVE tables provide an indication of our interest rate risk exposure as of the indicated dates, such measurements are not intended to and do not provide a precise forecast of the effect of changes in market interest rates on our EVE and will differ from actual results. In addition to our core business activities, which seek to originate Smart Rate (adjustable) loans, home equity lines of credit (adjustable) and 10-year fixed-rate loans funded by borrowings from the FHLB and intermediate term CDs (including brokered CDs), and which are intended to have a favorable impact on our IRR profile, the impact of several other items and events resulted in the 279 and 231 basis point deterioration in the Pre-Shock EVE Ratio (base valuation) measures at September 30, 2023, when compared to the measures at September 30, 2022 for the Company and Association, respectively. Factors contributing to these deteriorations included increases in market interest rates, capital actions by the Association, and changes due to business activity. While our core business activities, as described at the beginning of this paragraph, are generally intended to have a positive impact on our IRR profile, the actual impact is determined by a number of factors, including the pace of mortgage asset additions to our balance sheet (including consideration of outstanding commitments to originate those assets), in comparison to the pace of the addition of duration extending funding sources.\nOur simulation model possesses random patterning capabilities and accommodates extensive regression analytics applicable to the prepayment and decay profiles of our borrower and depositor portfolios. The model facilitates the generation of alternative modeling scenarios and provides us with timely decision making data that is integral to our IRR management processes. Modeling our IRR profile and measuring our IRR exposure are processes that are subject to continuous revision, refinement, modification, enhancement, back testing and validation. We continually evaluate, challenge and update the methodology and assumptions used in our IRR model, including behavioral equations that have been derived based on third-party studies of our customers' historical performance patterns. Changes to the methodology and/or assumptions used in the model will result in reported IRR profiles and reported IRR exposures that will be different, and perhaps significantly, from the results reported above.\nEarnings at Risk. In addition to EVE calculations, we use our simulation model to analyze the sensitivity of our net interest income to changes in interest rates (the institutions EaR). Net interest income is the difference between the interest income that we earn on our interest-earning assets, such as loans and securities, and the interest that we pay on our interest-\nbearing liabilities, such as deposits and borrowings. In our model, we estimate what our net interest income would be for prospective 12 and 24 month periods using customized (based on our portfolio characteristics) assumptions with respect to loan prepayment rates, default rates and deposit decay rates, and the implied forward yield curve as of the market date for assumptions related to projected interest rates. We then calculate what the estimated net interest income would be for the same period under numerous interest rate scenarios. The simulation process is subject to continual enhancement, modification, refinement and adaptation. As of September 30, 2023, the estimated EaR for the 12 months ending September 30, 2024 would decrease by 1.75% for the Company and 2.71% for the Association in the event that market interest rates used in the simulation were adjusted in incremental amounts (termed a \"ramped\" format) during the 12 month measurement period to an aggregate increase in 200 basis points. The Company and Association use the \"ramped\" assumption in preparing the EaR simulation estimates for use in its public disclosures. The Company and Association continue to calculate instantaneous scenarios, and as of September 30, 2023, the estimated EaR for the 12 months ending September 30, 2024, would decrease by 5.16% and 6.91%, respectively, in the event of an instantaneous 200 basis point increase in market interest rates.\nThe manner in which actual yields, costs and consumer behavior respond to changes in market interest rates may vary from the inherent methodologies used to measure interest rate risk through EaR. In this regard, the interest rate risk information presented above assumes that a particular change in interest rates is reflected uniformly across the yield curve regardless of the duration or repricing of specific assets and liabilities. Accordingly, although interest rate risk calculations provide an indication of our interest rate risk exposure at a particular point in time, such measurements are not intended to and do not provide a precise forecast of the effect of changes in market interest rates on our net interest income and will differ from actual results. In addition to the preparation of computations as described above, we also formulate simulations based on a variety of non-linear changes in interest rates and a variety of non-constant balance sheet composition scenarios.\nOther Considerations. The EVE and EaR analyses are similar in that they both start with the same month end balance sheet amounts, weighted average coupon and maturity. The underlying prepayment, decay and default assumptions are also the same and they both start with the same month end \"markets\" (Treasury and FHLB yield curves, etc.). From that similar starting point, the models follow divergent paths. EVE is a stochastic model using 150 different interest rate paths to compute market value at the account level for each of the categories on the balance sheet whereas EaR uses the implied forward curve to compute interest income/expense at the account level for each of the categories on the balance sheet.\nEVE is considered as a point in time calculation with a \"liquidation\" view of the Company and Association where all the cash flows (including interest, principal and prepayments) are modeled and discounted using discount factors derived from the current market yield curves. It provides a long term view and helps to define changes in equity and duration as a result of changes in interest rates. On the other hand, EaR is based on balance sheet projections going one year and two years forward and assumes new business volume and pricing to calculate net interest income under different interest rate environments. EaR is calculated to determine the sensitivity of net interest income under different interest rate scenarios. With each of these models, specific policy limits have been established for the Association that are compared with the actual month end results. These limits have been approved by the Association's Board of Directors and are used as benchmarks to evaluate and moderate interest rate risk. In the event that there is a breach of policy limits that extends beyond two consecutive quarter end measurement periods, management is responsible for taking such action, similar to those described under the preceding heading of General, as may be necessary in order to return the Association's interest rate risk profile to a position that is in compliance with the policy. Item 8. Financial Statements and Supplementary Data\nThe Financial Statements are included in Part IV, Item 15 of this Form 10-K. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable. Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nUnder the supervision of and with the participation of the Companys management, including our principal executive officer and principal financial officer, we have evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act) as of the end of the period covered by this report. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Act is accumulated and communicated to the issuers management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. Based upon that\nevaluation, our principal executive officer and principal financial officer concluded that, as of the end of the period covered by this report, our disclosure controls and procedures were effective to ensure that information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms.\nChanges in Internal Control Over Financial Reporting\nNo change in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) occurred during the most recently completed fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nManagements Report Regarding Internal Control Over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting as such terms are defined in Rule 13a-15(f) of the Exchange Act of 1934. Our system of internal controls is designed to provide reasonable assurance that the financial statements that we provide to the public are fairly presented.\nOur internal control over financial reporting includes policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect transactions and dispositions of assets, (ii) provide reasonable assurances that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America and that receipts and expenditures are being made only in accordance with authorizations of management and the directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on our financial statements.\nAll internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Accordingly, absolute assurance cannot be provided that the effectiveness of the internal control systems may not become inadequate in future periods because of changes in conditions, or because the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of September 30, 2023. In making this assessment, the criteria set forth by the COSO in Internal Control-Integrated Framework (2013) was utilized. Management concluded that the Company's internal control over financial reporting was effective as of September 30, 2023, based on those criteria.\nThe effectiveness of the Company's internal control over financial reporting as of September 30, 2023 has been audited by Deloitte & Touche LLP, an independent registered public accounting firm, as stated in their report which appears herein.\nThe Sarbanes-Oxley Act Section 302 Certifications have been filed as Exhibit 31.1 and Exhibit 31.2 to this Annual Report on Form 10-K.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of TFS Financial Corporation\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of TFS Financial Corporation and subsidiaries (the Company) as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended September 30, 2023, of the Company and our report dated November 21, 2023, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report Regarding Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nCleveland, Ohio\nNovember 21, 2023 Item 9B. Other Information\nSecurities Trading Plans of Directors and Executive Officers\nTransactions in our securities by our executive officers are required to be made in accordance with our Insider Trading Policy and Guidelines with Respect to Certain Transactions in Company Securities, which, among other things, requires that the transaction be in accordance with applicable U.S. federal securities laws that prohibit trading while in the possession of material nonpublic information. Rule 10b5-1 under the Securities Exchange Act of 1934 provides an affirmative defense that enables prearranged transactions in securities in a manner that avoids concerns about initiating transactions at a future date while possibly in possession of material nonpublic information.\nDuring this quarter, Marc A. Stefanski, Chairman, CEO, and President of the Company, completed the transactions that were contemplated in the Trading Plan adopted on June 14, 2023 that was intended to satisfy the affirmative defense conditions of the Exchange Act Rule 10b5-1(c) and authorized a designated option for 286,500 shares of common stock be exercised, after a 90-day cooling off period, in the event that the Company's stock equals or exceeds a predetermined share amount.\nOn September 18, 2023, Daniel F. Weir, Director of the Company, adopted a Trading Plan that is intended to satisfy the affirmative defense conditions of the Exchange Act Rule 10b5-1(c) and authorizes a sale of a total of 100,000 shares of common stock on designated days, each for designated amount of shares, to be exercised, after a 90-day cooling off period, without regard to a predetermined share trading value. The Trading Plan expires upon the earlier of (1) February 08, 2024, (2) the execution of all of the orders relating to such trades as specified in the plan, (3) the date Broker receives notice of liquidation, dissolution, bankruptcy, or insolvency of the client, (4) the date the Broker receives notice of the Client's death, or (5) the termination of the Trading Plan in accordance with Section 9(b) or Section 16.\nItem 9C.\nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nIncorporated by reference from the Notice of Annual Meeting and Proxy Statement for the 2024 Annual Meeting of Shareholders (the Proxy Statement) sections entitled Proposal One: Election of Directors, Executive Compensation, Delinquent Section 16(a) Reports and Corporate Governance. Such information will be filed with the SEC no later than 120 days after the end of the fiscal year covered by this report.\nThe table below sets forth information, as of September 30, 2023, regarding our executive officers other than Marc A. Stefanski and Meredith S. Weil.\nName Title Age\nKathleen (Kitty) M. Danckers Chief Risk Officer 61\nRussell C. Holmes Chief Retail Officer, the Association 60\nSusanne N. Miller Chief Accounting Officer 58\nTimothy W. Mulhern Chief Financial Officer (1)\nAndrew J. Rubino Chief Information Officer, the Association 48\nBradley T. Stefanski Chief Strategy Officer, the Association 35\nGavin B. Stefanski Chief Experience Officer, the Association\nCathy W. Zbanek Chief Synergy Officer, the Association 50\n(1) On October 26, 2023, the Board of Directors appointed Mr. Mulhern to the role of Chief Innovation Officer of the Association and appointed Ms. Weil as Chief Financial Officer effective January 1, 2024.\nThe executive officers of the Company and the Association are elected annually and hold office until their respective successors are elected or until death, resignation, retirement or removal by the Board of Directors.\nThe Business Background of Our Executive Officers\nThe business experience for the past five years of each of our executive officers other than Mr. Stefanski and Ms. Weil is set forth below. Unless otherwise indicated, executive officers have held their positions for the past five years.\nKathleen (Kitty) M. Danckers has been with the Association since 1997, and was named Chief Risk Officer in June 2020. During her time with the Association, Ms. Danckers has served in various management roles including as a Regional Manager of Retail Operations, Manager of Information Services and Operations Support, and continues to serve as the Chief Information Security Officer. Ms. Danckers holds a BA in Computer Science, Mathematics and German from St. Catherine University. Ms. Danckers is a Fulbright Scholar.\nRussell C. Holmes has been with the Association since 2013 in retail delivery management and was named Chief Retail Officer in 2020. He most recently served as Ohio regional manager, managing all branch and loan production offices in the state. With 35 years in the banking business, Mr. Holmes joined Third Federal from Key Bank where he served as SVP District Retail Leader for Eastern Ohio. He holds a BS in Business Administration from the University of Akron, and received a Distinguished Business Alumni Award in 2009, and a Distinguished Alumni Award from the Universitys multicultural department in 2013.\nSusanne N. Miller joined the Association in 1998 and was appointed Chief Accounting Officer in 2020. During her time with the Association, Ms. Miller has held various retail and accounting roles, and served on company-wide strategic project teams. Since 2007, she has worked as a manager in the Accounting Department, overseeing procedure implementation, corporate tax reporting and financial statement preparation. Ms. Miller holds a BS in Accounting from the University of Akron.\nTimothy W. Mulhern was named the Chief Financial Officer in January 2022. Mr. Mulhern joined the Association in 2003 as a project manager where he led key strategic business initiatives including a state loan expansion project, and IT projects to replace the companys front-end servicing application, and implementation of an updated loan origination system. Mr. Mulhern moved to IT management, then to operations where he managed various departments including Loan Servicing, Default Servicing and Deposit Operations. He was named the Chief Credit Officer in August 2018, and Director of Internal Audit in June 2019, where he earned his CIA credentials. Mr. Mulhern joined the Finance Department in February 2021. He holds a Bachelors Degree in Accounting from John Carroll University and an MBA from the Weatherhead School of Management at Case Western Reserve University. Prior to joining Third Federal, Mr. Mulhern was in public accounting with Coopers & Lybrand where he earned his CPA credentials, and more than a decade as a small business owner.\nAndrew J. Rubino has been with the Association since 2000, joining the company as a business analyst. He was named Chief Information Officer in 2021. Mr. Rubino has held a variety of leadership positions throughout the company, serving as Information Security Officer and managing several strategic areas of the company, including: Loan Production, Customer Care, Internet Services, Operations Support and Marketing, most recently serving as Chief Marketing Officer. He holds both a BS in Management Information Systems and an MBA from the University of Akron.\nBradley T. Stefanski has been with the Association since 2014, and was named Chief Strategy Officer in March 2022. He began his career at Third Federal in the Risk Management Department, working on the development of the companys Market Risk Management Program, including modeling and testing; before moving to Loan Production and the branch system, where he spent four years in roles in Underwriting, retail management, and Operations Support project development. Mr. Stefanski then joined the Finance Department in 2021 to help drive strategic initiatives. He holds a BA in Sociology and Economics from Colgate University. Bradley T. Stefanski is the son of our Chairman of the Board, Chief Executive Officer and President, Marc A. Stefanski, and brother of our Vice Chairman of the Board, Ashley H. Williams.\nGavin B. Stefanski joined the Association in 2018 in the Management Training Program, supporting the companys branch system in Southern and Northeast Ohio. Mr. Stefanski was named Underwriting Manager in 2019, Loan Production Manager in 2021, and became Chief Lending Officer in March 2022. He was named Chief Experience Officer in May 2023. Prior to Third Federal, he managed multi-billion dollar and strategic clients for ODW Logistics, a national supply chain solutions company in Hamilton, Ohio, where he was responsible for developing and maintaining customized total freight management solutions driving high revenue growth for ODW. Mr. Stefanski holds a BS in Business from the Farmer School of Business at Miami University. Gavin B. Stefanski is the nephew of our Chairman of the Board, Chief Executive Officer and President, Marc A. Stefanski, and cousin of our Vice Chairman of the Board, Ashley H. Williams.\nCathy W. Zbanek joined the Association in 2001, and was named Chief Synergy Officer in 2020. In her role, Ms. Zbanek is responsible for fostering the internal synergy of the organization as well as customer engagement. She most recently served as Chief Marketing and Human Resources Officer since 2013. Prior to her roles on the executive team, Ms. Zbanek directed several of the companys key strategic business projects as well as systems design and development. She also managed several Third Federal departments, including Customer Service and Marketing. Before joining the Association, Ms. Zbanek served as a senior consultant with Waterstone Consulting, working in their Management Consulting Group. Her experience also includes working with the consulting group, Price Waterhouse Coopers. She holds a BA in Economics and Psychology from the University of Pennsylvania.\nThe Company has adopted a policy statement entitled CODE OF ETHICS FOR SENIOR FINANCIAL OFFICERS that applies to our chief executive officer and our senior financial officers. A copy of the CODE OF ETHICS FOR SENIOR FINANCIAL OFFICERS is available on our website, www.thirdfederal.com. Item 11. Executive Compensation\nIncorporated by reference from the sections of the Proxy Statement entitled Executive Compensation, Report of the Compensation Committee, and Director Compensation. Such information will be filed with the SEC no later than 120 days after the end of the fiscal year covered by this report. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nIncorporated by reference from the section of the Proxy Statement entitled Security Ownership of Certain Beneficial Owners and Management. Such information will be filed with the SEC no later than 120 days after the end of the fiscal year covered by this report.\nThe Companys only equity compensation program that was not approved by shareholders is its employee stock ownership plan, which was established in conjunction with our initial stock offering completed in 2007.\nThe following table provides information as of September 30, 2023 regarding our Amended and Restated 2008 Equity Incentive Plan that was approved by shareholders on February 22, 2018. The original plan was approved by shareholders on May 29, 2008.\nPlan Category Number of Shares to be\nIssued Upon Exercise of\nOutstanding Options,\nRights and Warrants Weighted-Average\nExercise Price of\nOutstanding Options,\nRights and Warrants Number of Shares\nRemaining Available\nfor Future Issuance\nUnder the Plan\nEquity Compensation Plans\nApproved by Stockholders 3,549,879 $ 8.81 (1) 7,138,688\nEquity Compensation Plans\nNot Approved by Stockholders N/A N/A N/A\nTotal 3,549,879 $ 8.81 (1) 7,138,688\n______________________\n(1)Weighted-Average Exercise Price of Outstanding Options, Rights and Warrants is calculated using 1,339,833 shares of restricted stock awards at $0.00, 218,071 shares of performance share units at $0.00, and 1,991,975 shares of stock option awards at $15.69. Item 13. Certain Relationships and Related Transactions, and Director Independence\nIncorporated by reference from the sections of the Proxy Statement entitled Certain Relationships and Related Transactions and Corporate Governance. Such information will be filed with the SEC no later than 120 days after the end of the fiscal year covered by this report. Item 14. Principal Accounting Fees and Services\nIncorporated by reference from the section of the Proxy Statement entitled Fees Paid to Deloitte & Touche LLP (PCAOB ID No. 34). Such information will be filed with the SEC no later than 120 days after the end of the fiscal year covered by this report.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a)(1) Financial Statements\nThe following documents are filed as part of this Annual Report on Form 10-K:\na.The consolidated financial statements of TFS Financial Corporation and subsidiaries contained in Part II, Item 8 of this Annual Report on Form 10-K:\nConsolidated Statements of Condition as of September 30, 2023 and 2022;\nConsolidated Statements of Income for the years ended September 30, 2023, 2022 and 2021;\nConsolidated Statements of Comprehensive Income for the years ended September 30, 2023, 2022 and 2021;\nConsolidated Statements of Shareholders' Equity for the years ended September 30, 2023, 2022 and 2021;\nConsolidated Statements of Cash Flows for the years ended September 30, 2023, 2022 and 2021; and\nNotes to the Consolidated Financial Statements\nb. The exhibits listed in the Exhibits Index beginning on Page 121 of this Annual Report on Form 10-K.\nItem 16. Form 10-K Summary\nNot applicable.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of TFS Financial Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated statements of condition of TFS Financial Corporation and subsidiaries (the \"Company\") as of September 30, 2023 and 2022, the related consolidated statements of income, comprehensive income (loss), shareholders' equity, and cash flows, for each of the three years in the period ended September 30, 2023, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated November 21, 2023, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAllowance for Credit Losses - Refer to Notes 1 and 5 to the financial statements\nCritical Audit Matter Description\nThe allowance for credit losses (ACL) is managements estimate of expected credit losses in the loan portfolio, including off-balance sheet commitments. As discussed in Notes 1 and 5 of the consolidated financial statements, the ACL is an amount which represents managements best estimate of expected credit losses over the contractual life of the Companys loan portfolio as of the balance sheet date. We have identified the general valuation allowance (\"GVA\"), which is a component of ACL, for both the loan portfolio and off-balance sheet commitments, as a critical audit matter. GVA for the loan portfolio is comprised of quantitative general valuation allowances for credit losses based on historical loan loss, and qualitative adjustments to the quantitative general valuation allowances to cover uncertainties that affect the estimate of expected credit losses. GVA for off-balance sheet commitments is comprised of expected lifetime losses on unfunded loan commitments to extend credit where the obligations are not unconditionally cancellable.\nAs of September 30, 2023, the Company's loan portfolio totaled $15.2 billion, and the related ACL was $77.3 million, including $67.8 million GVA. The Company's off-balance sheet commitments totaled $5.1 billion, and the related GVA was $27.5 million. The GVA is established using relevant available information, relating to past events, current conditions, and reasonable and supportable forecasts. The Company utilizes loan level regression models with forecasted economic data to derive the probability of default and loss given default factors. These factors are used to calculate the loan level credit loss over a 24-month reasonable and supportable period with an immediate reversion to historical mean loss rates for the remaining life of the loans. Qualitative adjustments are then made to account for factors that management does not believe are captured in the Current Expected Credit Losses (\"CECL\") quantitative models. The determination of the appropriate level of the allowance for\nthe loan portfolio inherently involves a high degree of subjectivity and requires significant estimates of current credit risks using both quantitative and qualitative analyses.\nAuditing certain aspects of the GVA, including the (1) model methodology, (2) model accuracy, (3) model assumptions, (4) selection of relevant risk characteristics, (5) interpretation of the results, and (6) use of qualitative adjustments, involves especially subjective and complex judgment. Given the significant judgment in determining the GVA estimate, performing audit procedures to evaluate the reasonableness of managements estimate of the GVA requires a high degree of auditor judgment and an increased extent of effort, including the need to involve our credit specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the GVA included the following, among others:\nWe tested the effectiveness of controls over the Companys (1) model methodology, (2) model accuracy, (3) model assumptions, (4) selection of relevant risk characteristics, (5) interpretation of the results, and (6) use of qualitative adjustments.\nWith the assistance of our credit specialists, we evaluated the reasonableness of the (1) model methodology, (2) model accuracy, (3) model assumptions, (4) selection of relevant risk characteristics, and (5) interpretation of the results.\nWe evaluated trends in the total GVA for consistency with trends in loan portfolio growth and credit performance.\nWe tested the accuracy and completeness of key risk characteristics input into the model by agreeing to source information.\nWe assessed the Company's method for determining the qualitative factor adjustments and the effect of those factors on the GVA compared with relevant credit risk factors and credit trends.\n/s/ Deloitte & Touche LLP\nCleveland, Ohio\nNovember 21, 2023\nWe have served as the Company's auditor since 2000.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CONDITION\nAs of September 30, 2023 and 2022\n(In thousands, except share data)\n2023 2022\nASSETS\nCash and due from banks $ 29,134 $ 18,961\nOther interest-earning cash equivalents 437,612 350,603\nCash and cash equivalents 466,746 369,564\nInvestment securities available for sale (amortized cost $561,715 and $501,597, respectively)\n508,324 457,908\nMortgage loans held for sale\n3,260 9,661\nLoans held for investment, net:\nMortgage loans 15,177,844 14,276,478\nOther loans 4,411 3,263\nDeferred loan expenses, net 60,807 50,221\nAllowance for credit losses on loans (77,315) (72,895)\nLoans, net 15,165,747 14,257,067\nMortgage loan servicing assets, net 7,400 7,943\nFederal Home Loan Bank stock, at cost 247,098 212,290\nReal estate owned, net 1,444 1,191\nPremises, equipment, and software, net 34,708 34,531\nAccrued interest receivable 53,910 40,256\nBank owned life insurance contracts 312,072 304,040\nOther assets 117,270 95,428\nTOTAL ASSETS $ 16,917,979 $ 15,789,879\nLIABILITIES AND SHAREHOLDERS EQUITY\nDeposits $ 9,449,820 $ 8,921,017\nBorrowed funds 5,273,637 4,793,221\nBorrowers advances for insurance and taxes 124,417 117,250\nPrincipal, interest, and related escrow owed on loans serviced 29,811 29,913\nAccrued expenses and other liabilities 112,933 84,139\nTotal liabilities 14,990,618 13,945,540\nCommitments and contingent liabilities\nPreferred stock, $0.01 par value, 100,000,000 shares authorized, none issued and outstanding\n- -\nCommon stock, $0.01 par value, 700,000,000 shares authorized; 332,318,750 shares issued; 280,359,173 and 280,582,741 outstanding at September 30, 2023 and September 30, 2022, respectively\n3,323 3,323\nPaid-in capital 1,755,027 1,751,223\nTreasury stock, at cost; 51,959,577 and 51,736,009 shares at September 30, 2023 and September 30, 2022, respectively\n(776,101) (771,986)\nUnallocated ESOP shares (27,084) (31,417)\nRetained earnings-substantially restricted 886,984 870,047\nAccumulated other comprehensive income\n85,212 23,149\nTotal shareholders equity 1,927,361 1,844,339\nTOTAL LIABILITIES AND SHAREHOLDERS EQUITY $ 16,917,979 $ 15,789,879\nSee accompanying notes to consolidated financial statements.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\nFor each of the three years in the period ended September 30, 2023\n(In thousands, except share and per share data)\n2023 2022 2021\nINTEREST AND DIVIDEND INCOME:\nLoans, including fees $ 565,610 $ 395,691 $ 381,887\nInvestment securities available for sale 14,370 5,501 3,822\nOther interest and dividend earning assets 31,939 8,141 3,642\nTotal interest and dividend income 611,919 409,333 389,351\nINTEREST EXPENSE:\nDeposits 174,201 76,943 97,319\nBorrowed funds 154,151 64,994 60,402\nTotal interest expense 328,352 141,937 157,721\nNET INTEREST INCOME 283,567 267,396 231,630\nPROVISION (RELEASE) FOR CREDIT LOSSES (1,500) 1,000 (9,000)\nNET INTEREST INCOME AFTER PROVISION (RELEASE) FOR CREDIT LOSSES 285,067 266,396 240,630\nNON-INTEREST INCOME:\nFees and service charges, net of amortization 7,840 9,934 9,602\nNet gain on the sale of loans 498 1,136 33,082\nIncrease in and death benefits from bank owned life insurance contracts 9,355 9,984 9,961\nOther 3,736 2,750 2,654\nTotal non-interest income 21,429 23,804 55,299\nNON-INTEREST EXPENSE:\nSalaries and employee benefits 112,785 109,339 108,867\nMarketing services 25,288 21,263 19,174\nOffice property, equipment, and software 27,734 26,783 25,710\nFederal insurance premium and assessments 13,452 9,361 9,085\nState franchise tax 4,891 4,859 4,663\nOther expenses 28,979 26,541 28,336\nTotal non-interest expense 213,129 198,146 195,835\nINCOME BEFORE INCOME TAXES 93,367 92,054 100,094\nINCOME TAX EXPENSE 18,117 17,489 19,087\nNET INCOME $ 75,250 $ 74,565 $ 81,007\nEarnings per share\nBasic $ 0.27 $ 0.26 $ 0.29\nDiluted $ 0.26 $ 0.26 $ 0.29\nWeighted average shares outstanding\nBasic 277,436,382 277,370,762 276,694,594\nDiluted 278,583,454 278,686,365 278,576,254\nSee accompanying notes to consolidated financial statements.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nFor each of the three years in the period ended September 30, 2023\n(In thousands)\n2023 2022 2021\nNet income $ 75,250 $ 74,565 $ 81,007\nOther comprehensive income (loss), net of tax:\nNet change in unrealized (losses) gains on securities available for sale (7,274) (34,860) (3,733)\nNet change in cash flow hedges 66,649 127,093 56,096\nNet change in defined benefit plan obligation 2,688 (1,283) 11,801\nTotal other comprehensive income (loss) 62,063 90,950 64,164\nTotal comprehensive income $ 137,313 $ 165,515 $ 145,171\nSee accompanying notes to consolidated financial statements.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\nFor each of the three years in the period ended September 30, 2023\n(In thousands, except share and per share data)\nCommon\nstock Paid-in\ncapital Treasury\nstock Unallocated\ncommon stock\nheld by ESOP Retained\nearnings Accumulated other\ncomprehensive income (loss) Total\nshareholders'equity\nBalance at September 30, 2020 $ 3,323 $ 1,742,714 $ (767,649) $ (40,084) $ 865,514 $ (131,965) $ 1,671,853\nComprehensive income\nCumulative effect from changes in accounting principle, net of tax1\n- - - - (35,763) - (35,763)\nNet income\n- - - - 81,007 - 81,007\nOther comprehensive income net of tax\n- - - - - 64,164 64,164\nESOP shares allocated or committed to be released - 3,936 - 4,333 - - 8,269\nCompensation costs for equity incentive plans - 5,442 - - - - 5,442\nTreasury stock allocated to (from) equity incentive plan - (5,205) (386) - - - (5,591)\nDividends declared to common shareholders ($1.1225 per common share)\n- - - - (57,101) - (57,101)\nBalance at September 30, 2021 3,323 1,746,887 (768,035) (35,751) 853,657 (67,801) 1,732,280\nComprehensive income\nNet income\n- - - - 74,565 - 74,565\nOther comprehensive income, net of tax - - - - - 90,950 90,950\nESOP shares allocated or committed to be released - 2,729 - 4,334 - - 7,063\nCompensation costs for equity incentive plans - 3,946 - - - - 3,946\nPurchase of treasury stock (337,259 shares)\n- - (5,049) - - - (5,049)\nTreasury stock allocated to (from) equity incentive plan - (2,339) 1,098 - - - (1,241)\nDividends declared to common shareholders ($1.13 per common share)\n- - - - (58,175) - (58,175)\nBalance at September 30, 2022 3,323 1,751,223 (771,986) (31,417) 870,047 23,149 1,844,339\nComprehensive income\nNet income\n- - - - 75,250 - 75,250\nOther comprehensive income, net of tax - - - - - 62,063 62,063\nESOP shares allocated or committed to be released - 1,427 - 4,333 - - 5,760\nCompensation costs for equity incentive plans - 4,240 - - - - 4,240\nPurchase of treasury stock (361,869 shares)\n- - (5,000) - - - (5,000)\nTreasury stock allocated to (from) equity incentive plan - (1,863) 885 - - - (978)\nDividends declared to common shareholders ($1.13 per common share)\n- - - - (58,313) - (58,313)\nBalance at September 30, 2023 $ 3,323 $ 1,755,027 $ (776,101) $ (27,084) $ 886,984 $ 85,212 $ 1,927,361\n1 Related to ASU 2016-13 adopted October 1, 2020.\nSee accompanying notes to consolidated financial statements.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor each of the three years in the period ended September 30, 2023\n2023 2022 2021\nCASH FLOWS FROM OPERATING ACTIVITIES: (In thousands)\nNet income $ 75,250 $ 74,565 $ 81,007\nAdjustments to reconcile net income to net cash provided by operating activities:\nESOP and stock-based compensation expense 10,000 11,009 13,711\nDepreciation and amortization 18,115 27,035 32,568\nDeferred income taxes 3,732 (26,876) (14,249)\nProvision (release) for credit losses (1,500) 1,000 (9,000)\nNet gain on the sale of loans (498) (1,136) (33,082)\nNet gain on sale of commercial property - (181) -\nOther net (gains) losses (199) 810 689\nProceeds from sales of loans held for sale 43,124 41,495 63,913\nLoans originated and principal repayments on loans held for sale (45,082) (66,162) (67,024)\nIncrease in bank owned life insurance contracts (9,355) (8,432) (7,979)\nNet (increase) decrease in interest receivable and other assets (39,360) (13,043) 7,697\nNet increase (decrease) in accrued expenses and other liabilities 36,495 (1,155) 14,904\nNet cash provided by operating activities 90,722 38,929 83,155\nCASH FLOWS FROM INVESTING ACTIVITIES:\nLoans originated or purchased\n(3,549,306) (5,273,730) (4,874,761)\nPrincipal repayments on loans 2,605,262 3,447,529 4,756,761\nProceeds from sales, principal repayments and maturities of:\nSecurities available for sale 83,567 163,568 317,066\nProceeds from sale of:\nLoans 33,635 87,671 739,699\nReal estate owned 484 429 206\nPremises, equipment and other assets - 389 -\nPurchases of:\nBank-owned life insurance - - (70,000)\nFHLB stock (34,808) (49,507) (25,990)\nSecurities available for sale (144,663) (250,022) (297,466)\nPremises, equipment, and software, net (5,101) (2,700) (1,337)\nOther 2,299 1,278 3,178\nNet cash (used in) provided by investing activities (1,008,631) (1,875,095) 547,356\nCASH FLOWS FROM FINANCING ACTIVITIES:\nNet increase (decrease) in deposits 520,029 (72,511) (231,949)\nNet increase (decrease) in borrowers' advances for insurance and taxes 7,167 7,617 (1,903)\nNet decrease in principal and interest owed on loans serviced (101) (11,563) (4,419)\nNet increase (decrease) in short-term borrowed funds 417,000 875,000 (525,000)\nProceeds/(Repayments) from Fed Funds purchased (225,000) 225,000 -\nProceeds from long-term borrowed funds 350,000 600,000 100,000\nRepayment of long-term borrowed funds (77,876) (3,646) (4,689)\nCash collateral/settlements received from (provided to) derivative counterparties 88,144 162,094 89,970\nAcquisition of treasury shares (5,978) (6,290) (5,591)\nDividends paid to common shareholders (58,294) (58,297) (56,637)\nNet cash provided by (used in) financing activities 1,015,091 1,717,404 (640,218)\nNET INCREASE (DECREASE) IN CASH AND CASH EQUIVALENTS 97,182 (118,762) (9,707)\nCASH AND CASH EQUIVALENTS-Beginning of year 369,564 488,326 498,033\nCASH AND CASH EQUIVALENTS-End of year $ 466,746 $ 369,564 $ 488,326\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid for interest on deposits $ 169,153 $ 76,558 $ 98,535\nCash paid for interest on borrowed funds 194,601 37,120 16,043\nCash (received)/ paid for interest on interest rate swaps\n(50,416) 29,138 45,031\nCash paid for income taxes 21,776 39,602 25,772\nSUPPLEMENTAL SCHEDULES OF NONCASH INVESTING AND FINANCING ACTIVITIES:\nTransfer of loans to real estate owned 869 1,283 330\nTransfer of loans from held for investment to held for sale 33,543 86,077 698,917\nTransfer of loans from held for sale to held for investment 8,433 22,741 -\nTreasury stock issued for stock benefit plans 1,863 2,412 5,310\nSee accompanying notes to consolidated financial statements.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAs of and for the years ended September 30, 2023, 2022, and 2021\n(Dollars in thousands unless otherwise indicated)\n1. DESCRIPTION OF BUSINESS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBusiness-TFS Financial Corporation, a federally chartered stock holding company, conducts its principal activities through its wholly owned subsidiaries. The principal line of business of the Company is retail consumer banking, including mortgage lending, deposit gathering, and other financial services. Third Federal Savings and Loan Association of Cleveland, MHC, its federally chartered mutual holding company parent, owned 81.01% of the outstanding shares of common stock of the Company at September 30, 2023.\nThe Companys primary operating subsidiaries include the Association and Third Capital, Inc. The Association is a federal savings association, which provides retail loan and savings products to its customers in Ohio and Florida, through its 37 full-service branches, four loan production offices, customer service call center and internet site. The Association also provides savings products, purchase mortgages, first mortgage refinance loans, home equity lines of credit, and home equity loans in states outside of its branch footprint. The Association also acquires first mortgage loans through a correspondent lending partnership. Third Capital, Inc. was formed to hold non-thrift investments and subsidiaries.\nThe accounting and reporting policies of TFS Financial Corporation and its subsidiaries conform to accounting principles generally accepted in the United States of America and to general practices within the banking industry.\nNo material subsequent events have occurred requiring recognition in the consolidated financial statements or disclosure in the notes to the consolidated financial statements.\nThe following is a description of the significant accounting and reporting policies, which the Company follows in preparing and presenting its consolidated financial statements.\nBasis of Consolidation and Reporting-The consolidated financial statements of the Company include the accounts of TFS Financial Corporation and its wholly owned subsidiaries. Intercompany balances and transactions have been eliminated in consolidation.\nEstimates-The preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from these estimates.\nCash and Cash Equivalents-Cash and cash equivalents consist of working cash on hand, and demand and interest bearing deposits at other financial institutions with maturities of three months or less. For purposes of reporting cash flows, cash and cash equivalents also includes federal funds sold, when applicable. The Company has acknowledged informal agreements with banks where it maintains deposits. Under these agreements, service fees charged to the Company are waived provided certain average compensating balances are maintained throughout each month.\nInvestment Securities-Our fixed-maturity securities are accounted for on an available-for-sale basis. Securities held as available-for-sale are reported at fair value, with the corresponding unrealized gains and (losses), net of deferred income taxes, reported in AOCI. Management determines the appropriate classification of investment securities based on its intent and ability to hold at the time of purchase. Purchases of securities are accounted for on a trade-date or settlement-date basis, depending on the settlement terms.\nRealized gains and (losses) on securities are computed on a specific identification basis. Realized gains and (losses) also include changes in fair value on derivatives not designated as hedging instruments. Sales of securities are accounted for on a trade-date or settlement-date basis, depending on the settlement terms.\nA decline in the fair value of any available for sale security, below cost, is evaluated for credit loss. Credit loss is recognized in earnings if management intends, or will more likely than not be required, to sell the security before the recovery of its amortized cost basis. If the present value of cash flows expected to be collected is less than the amortized cost basis of the security, then a credit loss exists and an allowance would be recognized as a credit loss expense, limited to the difference between fair value and amortized cost. Non-credit related loss is recognized in OCI, net of applicable deferred income taxes.\nTo determine whether a credit loss exists, the Company considers, among other things, adverse conditions related to the security, industry, geographic area, the payment schedule of the debt security and likelihood that the issuer will be able to make\npayments that increase in the future, failure of the issuer to make scheduled payments and all available information relevant to the securities collectability, changes in ratings assigned by a rating agency, and other credit enhancements that affect the securities expected performance.\nInvestment income consist of interest and accretion (net of amortization). Interest is recognized on an accrual basis using the level-yield method. Premiums and discounts are amortized using the level-yield method.\nDerivative Instruments-Derivative instruments are carried at fair value in the Company's financial statements. For derivative instruments that are designated and qualify as cash flow hedges, changes in the fair value of the derivative instrument are reported as a component of OCI, net of tax, and reclassified into earnings in the same period during which the hedged transaction affects earnings. The earnings effect of the hedging instrument will be presented in the same income statement line item as the earnings effect of the hedged item. AOCI will be adjusted to a balance that reflects the cumulative change in the fair value of the hedging instrument. At the inception of a hedge, the Company documents certain items, including the relationship between the hedging instrument and the hedged item, the risk management objective and the nature of the risk being hedged, a description of how effectiveness will be measured, an evaluation of hedge transaction effectiveness and the benchmark interest rate or contractually specified interest rate being hedged.\nHedge accounting is discontinued prospectively when (1) a derivative is no longer highly effective in offsetting changes in the fair value or cash flow of a hedged item, (2) a derivative expires or is sold, (3) a derivative is de-designated as a hedge, because it is unlikely that a forecasted transaction will occur, or (4) it is determined that designation of a derivative as a hedge is no longer appropriate. When hedge accounting is discontinued, the Company would continue to carry the derivative on the statement of condition at its fair value; however, changes in its fair value would be recorded in earnings instead of through OCI.\nFor derivative instruments not designated as hedging instruments, the Company recognizes gains and (losses) on the derivative instrument in current earnings during the period of change.\nMortgage Banking Activity-Mortgage loans originated or purchased and intended for sale in the secondary market are carried at the lower of cost or estimated fair value in the aggregate. Mortgage loans included in pending agency contracts to sell and securitize loans are carried at fair value. Fair value is based on quoted secondary market pricing for loan portfolios with similar characteristics and includes consideration of deferred fees (costs). Net unrealized gains or losses on loans carried at fair value, are recognized in a valuation allowance by charges to income.\nThe Company retains servicing on loans that are sold and initially recognizes an asset for mortgage loan servicing rights based on the fair value of the servicing rights. Residential mortgage loans represent the single class of servicing rights and are measured at the lower of cost or fair value on a recurring basis. Mortgage loan servicing rights are reported net of accumulated amortization, which is recorded in proportion to, and over the period of, estimated net servicing revenues. The Company monitors prepayments and changes amortization of mortgage servicing rights accordingly. Fair values are estimated using discounted cash flows based on current interest rates and prepayment assumptions, and impairment is monitored each quarterly reporting period. The impairment analysis is based on predominant risk characteristics of the loans serviced, such as type, fixed- and adjustable-rate loans, original terms and interest rates. The amount of impairment recognized is the amount by which the mortgage loan servicing assets exceed their fair value.\nServicing fee income net of amortization and other loan fees collected on loans serviced for others are included in Fees and service charges, net of amortization on the CONSOLIDATED STATEMENTS OF INCOME.\nLoans and Related Deferred Loan Expenses, net-Loans originated or purchased with the intent to hold into the foreseeable future are carried at unpaid principal balances adjusted for partial charge-offs, the allowance for credit losses and net deferred loan expenses. Interest on loans is accrued and credited to income as earned. Interest on loans is not recognized in income when collectability is uncertain.\nLoan fees and certain direct loan origination costs are deferred and recognized as an adjustment to interest income using the level-yield method over the contractual lives of related loans, if the loans are held for investment. If the loans are held for sale, net deferred fees (costs) are generally not amortized, but rather are recognized when the related loans are sold.\nLoans are classified as TDRs when the original contractual terms are restructured to provide a concession to a borrower experiencing financial difficulty under terms that would not otherwise be available and the restructuring is the result of an agreement between the Company and the borrower or is imposed by a court or law. Concessions granted in TDRs may include a reduction of the stated interest rate, a reduction or forbearance of principal, an extension of the maturity date, a significant delay in payments, the removal of one or more borrowers from the obligation, or any combination of these.\nAllowance for Credit Losses-The allowance for credit losses represents the estimate of lifetime losses in our loan portfolio and off-balance sheet commitments. The allowance for credit losses is assessed on a quarterly basis and provisions (releases) for credit losses are made accordingly. The allowance is established using relevant available information, relating to past events, current conditions and supportable economic forecasts. Historical credit loss experience provides the basis for the estimation of expected credit losses. Qualitative adjustments to historical loss information are made for differences in current loan-specific risk characteristics such as differences in underwriting standards, portfolio mix, delinquency status or likely recovery of previous loan charge-offs. The allowance for credit losses is increased by recoveries and decreased by charge-offs. Also, qualitative adjustments were made to reflect expected recovery of loan amounts previously charged-off, beyond what the model is able to project.\nFor further discussion on the allowance for credit losses, non-accrual, and TDRs, see Note 5. LOANS AND ALLOWANCE FOR CREDIT LOSSES.\nReal Estate Owned, net-Real estate owned, net represents real estate acquired through foreclosure or deed in lieu of foreclosure and is initially recorded at fair value, less estimated costs to sell. Subsequent to acquisition, real estate owned is carried at the lower of cost or fair value, less estimated selling costs. Management performs periodic valuations and a valuation allowance is established by a charge to income for any excess of the carrying value over the fair value, less estimated costs to sell the property. Recoveries in fair value during the holding period are recognized until the valuation allowance is reduced to zero. Costs related to holding and maintaining the property are charged to expense.\nPremises, Equipment, and Software, net-Depreciation and amortization of premises, equipment and software is computed on a straight-line basis over the estimated useful lives of the related assets. Estimated lives are 31.5 years for office facilities and three to 10 years for equipment and software. Amortization of leasehold or building improvements is computed on a straight-line basis over the lesser of the economic useful life of the improvement or term of the lease, typically 10 years.\nLeases-At inception, all contracts are evaluated to determine if the arrangement contains a lease based on the terms and conditions. As a lessee, the Company recognizes leases with terms greater than one year on the CONSOLIDATED STATEMENTS OF CONDITION as lease assets (a right-of-use asset) and lease liabilities (a liability to make lease payments), measured on a discounted basis. For further discussion on leases, see Note 8. LEASES.\nBank Owned Life Insurance Contracts-Life insurance is provided under both whole and split dollar life insurance agreements. Policy premiums were prepaid and the Company will recover the premiums paid from the proceeds of the policies. The Company recognizes death benefits and growth in the cash surrender value of the policies in other non-interest income.\nGoodwill-The excess of purchase price over the fair value of net assets of acquired companies is classified as goodwill and reported in Other Assets. Goodwill was $9,732 at September 30, 2023 and 2022. Goodwill is reviewed for impairment on an annual basis as of September 30. No impairment was identified as of September 30, 2023 or 2022.\nTaxes on Income-Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Additional information about policies related to income taxes is included in Note 12. INCOME TAXES.\nDeposits-Interest on deposits is accrued and charged to expense monthly and is paid or credited in accordance with the terms of the accounts.\nTreasury Stock-Acquisitions of treasury stock through stock repurchases are recorded at cost using the cost method of accounting. Repurchases may be made through open market purchases, block trades and in negotiated private transactions, subject to the availability of stock, general market conditions, the trading price of the stock, alternative uses for capital, and the Companys financial performance. Repurchased shares will be available for general corporate purposes.\nAccumulated Other Comprehensive Income (Loss)-AOCI consists of changes in pension obligations, changes in unrealized gains (losses) on securities available for sale and cash flow hedges, each of which is net of the related income tax effects. The Company's policy is to release income tax effects from AOCI only when the entire portfolio to which the underlying transactions relate to is liquidated, sold or extinguished.\nRevenue from Contracts with Customers-The core principle of the guidance requires an entity to recognize revenue to depict the transfer of goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled to receive in exchange for those goods or services. Three of the Company's revenue streams within scope of Topic\n606 are the sales of REO, interchange income, and deposit account and other transaction-based service fee income. Those streams are immaterial and therefore quantitative information regarding these streams is not disclosed.\nPension Benefits-The determination of our obligations and expense for pension benefits is dependent upon certain assumptions used in calculating such amounts. Key assumptions used in the actuarial valuations include the discount rate and expected long-term rate of return on plan assets. Actual results could differ from the assumptions and market driven rates may fluctuate. Significant differences in actual experience or significant changes in the assumptions could materially affect future pension obligations and expense.\nShare-Based Compensation-Compensation expense for awards of equity instruments is recognized on a straight-line basis over the requisite service period based on the grant date fair value estimated in accordance with the provisions of FASB ASC 718 Compensation-Stock Compensation. All vested equity instruments are settled in stock. Forfeitures are recognized as they occur. Share-based compensation expense is included in Salaries and employee benefits in the CONSOLIDATED STATEMENTS OF INCOME. Tax benefits or deficiencies recognized for the difference between realized deductions and cumulative book compensation cost on share-based compensation awards are included in operating cash flows on the CONSOLIDATED STATEMENTS OF CASH FLOW.\nThe grant date fair value of stock options is estimated using the Black-Scholes option-pricing model using assumptions for the expected option term, expected stock price volatility, risk-free interest rate, and expected dividend yield. Due to limited historical data on exercise of share options, the simplified method is used to estimate expected option term.\nMarketing Costs-Marketing costs are expensed as incurred.\nEarnings per Share-Basic EPS is computed by dividing net income by the weighted-average number of shares of common stock outstanding. Outstanding shares include shares sold to subscribers, shares held by the Third Federal Foundation, shares of the Employee Stock Ownership Plan which have been allocated or committed to be released for allocation to participants, and shares held by Third Federal Savings, MHC. Unvested shares awarded in the Company's share-based compensation plan are treated as participating securities for purposes of the two-class method when they contain nonforfeitable rights to dividends, but are not included in the number of shares in the computation of basic EPS. The two-class method is an earnings allocation that determines EPS for each class of common stock and participating security.\nDiluted EPS is computed using the same method as basic EPS, but the weighted-average number of shares reflects the potential dilution, if any, of unexercised stock options, unvested shares of performance share units and unvested shares of restricted stock units that could occur if stock options were exercised and performance share units and restricted stock units were issued and converted into common stock. These potentially dilutive shares would then be included in the number of weighted-average shares outstanding for the period using the treasury stock method. At September 30, 2023, 2022 and 2021, potentially dilutive shares include stock options, restricted stock units and performance share units issued through share-based compensation plans.\n2. STOCK TRANSACTIONS\nTFS Financial Corporation completed its initial public stock offering on April 20, 2007 and sold 100,199,618 shares, or 30.16% of its post-offering outstanding common stock, to subscribers in the offering. Third Federal Savings, MHC, the Companys mutual holding company parent, holds 227,119,132 shares of TFS Financial Corporations outstanding common stock. TFS Financial Corporation issued 5,000,000 shares of common stock, or 1.50% of its post-offering outstanding common stock, to Third Federal Foundation.\nPursuant to the eighth repurchase program for the repurchase of 10,000,000 shares authorized by the Board of Directors in October, 2016, 361,869 shares were repurchased during the year ended September 30, 2023, 337,259 shares were repurchased during the year ended September 30, 2022, and no shares were repurchased during the year ended September 30, 2021. At September 30, 2023, there were 5,191,951 shares remaining to be purchased under the eighth repurchase program. The Company previously repurchased 51,300,000 shares of the Companys common stock as part of the previous seven Board of Directors-approved share repurchase programs. In total, the Company has repurchased 56,108,049 shares of the Company's common stock as of September 30, 2023.\n3. REGULATORY MATTERS\nThe Association is subject to various regulatory capital requirements administered by the federal banking agencies. Failure to meet minimum capital requirements can initiate certain mandatory and possibly additional discretionary actions by regulators that, if undertaken, could have a direct material effect on the financial statements of the Association. Under capital adequacy guidelines and the regulatory framework for prompt corrective action, the Association must meet specific capital\nguidelines that involve quantitative measures of its assets, liabilities, and certain off-balance-sheet items as calculated under regulatory accounting practices. The capital amounts and classifications are also subject to qualitative judgments by the regulators about components, risk weightings, and other factors.\nQuantitative measures established by regulation to ensure capital adequacy require the Association to maintain minimum amounts and ratios (set forth in table below) of common equity Tier 1, Tier 1, and Total capital (as defined in the regulations) to risk-weighted assets (as defined) and Tier 1 capital (as defined) to net average assets (as defined). The risk-based capital guidelines include both a definition of capital and a framework for calculating risk-weighted assets by assigning balance sheet assets and off-balance sheet assets to broad risk categories.\nIn 2019, a final rule adopted by the federal banking agencies provided banking organizations with the option to phase in, over a three-year period, the adverse day-one regulatory capital effects of the adoption of the CECL accounting standard. In 2020, as part of its response to the impact of COVID-19, U.S. federal banking regulatory agencies issued a final rule which provides banking organizations that implement CECL during the 2020 calendar year the option to delay for two years an estimate of CECLs effect on regulatory capital, relative to the incurred loss methodologys effect on regulatory capital, followed by a three-year transition period, which the Association and Company have adopted. During the two-year delay, the Association and Company added back to CET1 100% of the initial adoption impact of CECL plus 25% of the cumulative quarterly changes in the allowance for credit losses. Beginning this fiscal year, the cumulative transitional amounts became fixed and will be phased out of CET1 capital over the subsequent three-year period. At September 30, 2023, the Association exceeded all regulatory capital requirements and is considered well capitalized under regulatory guidelines.\nThe Association operates under the capital requirements for the standardized approach of the Basel III capital framework for U.S. banking organizations (Basel III Rules), which limits capital distributions and certain discretionary bonus payments to management if the institution does not hold a \"capital conservation buffer\" consisting of 2.5% in addition to the minimum capital requirements. At September 30, 2023, the Association exceeded the fully phased-in regulatory requirement for the \"capital conservation buffer\".\nThe following table summarizes the actual capital amounts and ratios of the Association as of September 30, 2023 and 2022, compared to the minimum capital adequacy requirements and the requirements for classification as a well capitalized institution.\nMinimum Requirements\nActual For Capital\nAdequacy Purposes To be Well Capitalized\nUnder Prompt Corrective\nAction Provision\nAmount Ratio Amount Ratio Amount Ratio\nSeptember 30, 2023\nTotal Capital to Risk-Weighted Assets $ 1,709,596 17.87 % $ 765,410 8.00 % $ 956,762 10.00 %\nTier 1 (Leverage) Capital to Net Average Assets 1,640,657 9.82 % 667,958 4.00 % 834,948 5.00 %\nTier 1 Capital to Risk-Weighted Assets 1,640,657 17.15 % 574,057 6.00 % 765,410 8.00 %\nCommon Equity Tier 1 Capital to Risk-Weighted Assets\n1,640,657 17.15 % 430,543 4.50 % 621,896 6.50 %\nSeptember 30, 2022\nTotal Capital to Risk-Weighted Assets $ 1,666,677 18.84 % $ 707,788 8.00 % $ 884,734 10.00 %\nTier 1 (Leverage) Capital to Net Average Assets 1,614,615 10.33 % 625,020 4.00 % 781,275 5.00 %\nTier 1 Capital to Risk-Weighted Assets 1,614,615 18.25 % 530,841 6.00 % 707,788 8.00 %\nCommon Equity Tier 1 Capital to Risk-Weighted Assets\n1,614,615 18.25 % 398,130 4.50 % 575,077 6.50 %\nThe Association paid dividends of $40,000 and $56,000 to the Company during the fiscal years ended September 30, 2023 and 2022, respectively.\nAs permitted under interim final rules issued by the FRS on August 12, 2011, a majority of Third Federal Savings, MHC's members eligible to vote approved Third Federal Savings, MHC waiving dividends aggregating up to $1.13 per share on the common stock of the Company for the 12 month following the special meeting of members held on July 11 2023. Unless the FRS amends its interim rule, a member vote will be required for Third Federal Savings, MHC to waive its right to receive dividends beyond July 11, 2024.\n4. INVESTMENT SECURITIES\nAvailable-for-sale securities are summarized in the tables below.\nSeptember 30, 2023\nAmortized\nCost Gross\nUnrealized Fair\nValue\nGains Losses\nREMICs $ 495,874 $ - $ (52,867) $ 443,007\nFannie Mae certificates 834 1 (21) 814\nFreddie Mac certificates 1,141 - (97) 1,044\nU.S. Government and agency obligations 63,866 - (407) 63,459\nTotal $ 561,715 $ 1 $ (53,392) $ 508,324\nSeptember 30, 2022\nAmortized\nCost Gross\nUnrealized Fair\nValue\nGains Losses\nREMICs $ 496,529 $ 1 $ (43,262) $ 453,268\nFannie Mae certificates 1,011 14 (4) 1,021\nU.S. Government and agency obligations 4,057 - (438) 3,619\nTotal $ 501,597 $ 15 $ (43,704) $ 457,908\nAt September 30, 2023, and September 30, 2022, investment securities included $59,813 and $0, respectively, of U.S. government obligations pledged as collateral on our open swap positions to meet requirements established by the clearing organization. Accrued interest on investment securities is $1,907 and $1,122 at September 30, 2023, and September 30, 2022, respectively, and is reported in accrued interest receivable on the CONSOLIDATED STATEMENTS OF CONDITION.\nThe following is a summary of our securities portfolio by remaining period to contractual maturity and yield at September 30, 2023. Maturities are based on the final contractual payment dates, and do not reflect the impact of prepayments or early redemptions that may occur. Weighted average yields are not presented on a tax-equivalent basis and are calculated by multiplying each carry value by its yield and dividing the sum of these results by the total carry values. We did not hold any tax-free securities.\nSeptember 30, 2023 September 30, 2022\nAmortized Cost Fair Value Weighted Average Yield Amortized Cost Fair Value Weighted Average Yield\nDue in one year or less $ 59,948 $ 59,936 5.13 % $ - $ - - %\nDue after one to five years 10,529 9,929 2.00 % 15,476 14,775 2.06 %\nDue after five to 10 years\n31,372 29,381 2.42 % 38,927 37,204 2.30 %\n10 years or greater\n459,866 409,078 2.82 % 447,194 405,929 2.25 %\nTotal $ 561,715 $ 508,324 3.03 % $ 501,597 $ 457,908 2.25 %\nGross unrealized losses on available- for- sale securities and the estimated fair value of the related securities, aggregated by the length of time the securities have been in a continuous unrealized loss position, at September 30, 2023 and 2022, were as follows:\nSeptember 30, 2023\nLess Than 12 Months 12 Months or More Total\nEstimated\nFair Value Unrealized\nLoss Estimated\nFair Value Unrealized\nLoss Estimated\nFair Value Unrealized\nLoss\nAvailable for sale-\nREMICs $ 80,452 $ 1,749 $ 362,555 $ 51,118 $ 443,007 $ 52,867\nFannie Mae certificates 578 21 - - 578 21\nFreddie Mac certificates 1,045 97 - - 1,045 97\nU.S. Government and agency obligations 59,813 11 3,646 396 63,459 407\nTotal $ 141,888 $ 1,878 $ 366,201 $ 51,514 $ 508,089 $ 53,392\nSeptember 30, 2022\nLess Than 12 Months 12 Months or More Total\nEstimated\nFair Value Unrealized\nLoss Estimated\nFair Value Unrealized\nLoss Estimated\nFair Value Unrealized\nLoss\nAvailable for sale-\nREMICs $ 261,795 $ 17,260 $ 190,739 $ 26,002 $ 452,534 $ 43,262\nFannie Mae certificates 217 4 - - 217 4\nU.S. Government and agency obligations 3,619 438 - - 3,619 438\nTotal $ 265,631 $ 17,702 $ 190,739 $ 26,002 $ 456,370 $ 43,704\nThe unrealized losses on investment securities were primarily attributable to an increase in market interest rates. The investment portfolio is comprised entirely of securities issued by U.S. government entities and agencies, which support the expectation of zero, other than temporary, loss estimates since principal and interest payments due on these securities carry the full faith and credit guaranty of the U.S. government. In addition, the U.S. Treasury Department established financing agreements in 2008 to ensure Fannie Mae and Freddie Mac meet their obligations to holders of mortgage-backed securities that they have issued or guaranteed.\nSince the decline in value is primarily attributable to an increase in market interest rates and not credit quality and because the Company has neither the intent to sell the securities nor is it more likely than not the Company will be required to sell the securities prior to recovery of the amortized cost, the Company did not record an allowance for credit losses as of September 30, 2023.\n5. LOANS AND ALLOWANCE FOR CREDIT LOSSES\nLOAN PORTFOLIOS\nLoans held for investment consist of the following:\nSeptember 30, September 30,\n2023 2022\nReal estate loans:\nResidential Core $ 12,078,158 $ 11,539,859\nResidential Home Today 46,508 53,255\nHome equity loans and lines of credit 3,030,526 2,633,878\nConstruction 48,406 121,759\nReal estate loans 15,203,598 14,348,751\nOther loans 4,411 3,263\nAdd (deduct):\nDeferred loan expenses, net 60,807 50,221\nLoans-in-process (25,754) (72,273)\nAllowance for credit losses on loans (77,315) (72,895)\nLoans held for investment, net $ 15,165,747 $ 14,257,067\nLoans are carried at amortized cost, which includes outstanding principal balance adjusted for any unamortized premiums or discounts, net of deferred fees and expenses. Accrued interest is $51,989 and $39,124 as of September 30, 2023 and September 30, 2022, respectively, and is reported in accrued interest receivable on the CONSOLIDATED STATEMENTS OF CONDITION.\nA large concentration of the Companys lending is in Ohio and Florida. As of September 30, 2023, and September 30, 2022, the percentage of aggregate Residential Core, Home Today and Construction loans secured by properties in Ohio was 57% and 56%, respectively, and the percentage of loans secured by properties in Florida was 18% as of both dates. As of September 30, 2023 and September 30, 2022, home equity loans and lines of credit were concentrated in the states of Ohio (26% and 27%, respectively), Florida (22% and 20%, respectively), and California (17% and 16%, respectively).\nResidential Core mortgage loans represent the largest portion of the residential real estate portfolio. The Company believes overall credit risk is low based on the nature, composition, collateral, products, lien position and performance of the portfolio. The portfolio does not include loan types or structures that have experienced severe performance problems at other financial institutions (sub-prime, no documentation or pay-option adjustable-rate mortgages). The portfolio contains \"Smart Rate\" adjustable-rate mortgage loans whereby the interest rate is locked initially for three or five years then resets annually, subject to periodic rate adjustments caps and various re-lock options available to the borrower. Although the borrower is qualified for its loan at a higher rate than the initial rate offered, the adjustable-rate feature may impact a borrower's ability to afford the higher payments upon rate reset during periods of rising interest rates while this repayment risk may be reduced in a declining or low rate environment. With limited historical loss experience compared to other types of loans in the portfolio, judgment is required by management in assessing the allowance required on adjustable-rate mortgage loans. The principal amount of adjustable-rate mortgage loans included in the Residential Core portfolio was $4,760,843 and $4,668,089 at September 30, 2023 and September 30, 2022, respectively.\nHome Today was an affordable housing program targeted to benefit low- and moderate-income home buyers. Most loans under the program were originated prior to 2009. No new loans were originated under the Home Today program after September 30, 2016. Home Today loans have greater credit risk than traditional residential real estate mortgage loans.\nHome equity loans and lines of credit, which are comprised primarily of home equity lines of credit, represent a significant portion of the residential real estate portfolio and include monthly principal and interest payments throughout the entire term. Once the draw period on lines of credit has expired, the accounts are included in the home equity loan balance. The full credit exposure on home equity lines of credit is secured by the value of the collateral real estate at the time of origination.\nThe Company originates construction loans to individuals for the construction of their personal single-family residence by a qualified builder (construction/permanent loans). The Companys construction/permanent loans generally provide for disbursements to the builder or sub-contractors during the construction phase as work progresses. During the construction phase, the borrower only pays interest on the drawn balance. Upon completion of construction, the loan converts to a permanent\namortizing loan without the expense of a second closing. The Company offers construction/permanent loans with fixed or adjustable-rates, and a current maximum loan-to-completed-appraised value ratio of 85%.\nOther loans are comprised of loans secured by certificate of deposit accounts, which are fully recoverable in the event of non-payment, and forgivable down payment assistance loans, which are unsecured loans used as down payment assistance to borrowers qualified through partner housing agencies. The Company records a liability for the down payment assistance loans which are forgiven in equal increments over a pre-determined term, subject to residency requirements.\nLoans held for sale include loans originated with the intent to sell which are generally priced in alignment with secondary market pricing and may be subject to loan level pricing adjustments. Additionally, loans originated or purchased for the held for investment portfolio may later be identified for sale and transferred to the held for sale portfolio, which may include loans originated or purchased within the parameters of programs established by Fannie Mae. During the years ended September 30, 2023 and September 30, 2022, reclassifications to the held for sale portfolio included loans that were sold during the period, including those in contracts pending settlement at the end of the period, and loans originated for the held for investment portfolio that were later identified for sale. At September 30, 2023 and September 30, 2022, mortgage loans held for sale totaled $3,260 and $9,661, respectively. During the years ended September 30, 2023 and September 30, 2022, the principal balance of loans sold was $77,205 and $128,118, respectively. During the years ended September 30, 2023 and September 30, 2022, the amortized cost of loans classified as held for sale that were subsequently transferred to the held for investment portfolio was $8,433 and $22,741, respectively. These transfers were due to changes in market pricing, affected by the rise in long-term interest rates, and managements' intent to hold the loans in portfolio until maturity for the foreseeable future. During the year ended September 30, 2021, there were no transfers to the held for investment portfolio.\nDELINQUENCY and NON-ACCRUAL\nAn aging analysis of the amortized cost in loan receivables that are past due at September 30, 2023 and September 30, 2022 is summarized in the following tables. When a loan is more than one month past due on its scheduled payments, the loan is considered 30 days or more past due, regardless of the number of days in each month. Balances are adjusted for deferred loan fees and expenses and any applicable loans-in-process.\n30-59 Days\nPast Due 60-89 Days\nPast Due 90 Days\nor More\nPast Due Total Past\nDue Current Total\nSeptember 30, 2023\nReal estate loans:\nResidential Core $ 3,680 $ 1,763 $ 8,268 $ 13,711 $ 12,089,228 $ 12,102,939\nResidential Home Today 666 323 855 1,844 44,186 46,030\nHome equity loans and lines of credit 3,271 690 3,876 7,837 3,059,444 3,067,281\nConstruction - - - - 22,401 22,401\nTotal real estate loans 7,617 2,776 12,999 23,392 15,215,259 15,238,651\nOther loans - - - - 4,411 4,411\nTotal $ 7,617 $ 2,776 $ 12,999 $ 23,392 $ 15,219,670 $ 15,243,062\n30-59\nDays\nPast Due 60-89\nDays\nPast Due 90 Days\nor More\nPast Due Total Past\nDue Current Total\nSeptember 30, 2022\nReal estate loans:\nResidential Core $ 2,725 $ 1,491 $ 9,281 $ 13,497 $ 11,545,784 $ 11,559,281\nResidential Home Today 1,341 770 861 2,972 49,836 52,808\nHome equity loans and lines of credit 1,599 796 2,321 4,716 2,661,416 2,666,132\nConstruction - - - - 48,478 48,478\nTotal real estate loans 5,665 3,057 12,463 21,185 14,305,514 14,326,699\nOther loans - - - - 3,263 3,263\nTotal $ 5,665 $ 3,057 $ 12,463 $ 21,185 $ 14,308,777 $ 14,329,962\nLoans are placed in non-accrual status when they are contractually 90 days or more past due. The number of days past due is determined by the number of scheduled payments that remain unpaid, assuming a period of 30 days between each scheduled payment. Loans with a partial charge-off are placed in non-accrual and will remain in non-accrual status until, at a minimum, the loss is recovered. Loans restructured in TDRs that were in non-accrual status prior to the restructurings and loans with forbearance plans that were subsequently modified are reported in non-accrual status for a minimum of six months after restructuring. Loans restructured in TDRs with a high debt-to-income ratio at the time of modification are placed in non-accrual status for a minimum of 12 months. Additionally, home equity loans and lines of credit where the customer has a severely delinquent first mortgage loan and loans in Chapter 7 bankruptcy status where all borrowers have filed, and not reaffirmed or been dismissed, are placed in non-accrual status.\nThe amortized cost of loan receivables in non-accrual status is summarized in the following table. Non-accrual with no ACL describes non-accrual loans which have no quantitative or individual valuation allowance, primarily because they have already been collaterally reviewed and any required charge-offs have been taken, but may be included in consideration of qualitative allowance factors. Balances are adjusted for deferred loan fees and expenses. There are no loans 90 or more days past due and still accruing at September 30, 2023 or September 30, 2022.\nSeptember 30, 2023 September 30, 2022\nNon-accrual with No ACL Total\nNon-accrual Non-accrual with No ACL Total\nNon-accrual\nReal estate loans:\nResidential Core $ 15,691 $ 19,414 $ 20,995 $ 22,644\nResidential Home Today 4,511 4,623 5,753 6,037\nHome equity loans and lines of credit 7,035 7,877 6,668 6,925\nTotal non-accrual loans $ 27,237 $ 31,914 $ 33,416 $ 35,606\nAt September 30, 2023 and September 30, 2022, the amortized cost in non-accrual loans includes $18,915 and $23,159, respectively, which are performing according to the terms of their agreement, of which $11,508 and $13,526, respectively, are loans in Chapter 7 bankruptcy status, primarily where all borrowers have filed, and have not reaffirmed or been dismissed. At September 30, 2023 and September 30, 2022, real estate loans include $9,144 and $9,833, respectively, of loans that are in the process of foreclosure.\nInterest on loans in accrual status is recognized in interest income as it accrues, on a daily basis. Accrued interest on loans in non-accrual status is reversed by a charge to interest income and income is subsequently recognized only to the extent cash payments are received. The Company has elected not to measure an allowance for credit losses on accrued interest receivable amounts since amounts are written off timely. Cash payments on loans in non-accrual status are applied to the oldest scheduled, unpaid payment first. The amount of interest income recognized on non-accrual loans was $663 and $740 for the years ended September 30, 2023 and September 30, 2022, respectively. Cash payments on loans with a partial charge-off are applied fully to principal, then to recovery of the charged off amount prior to interest income being recognized, except cash payments may be applied to interest capitalized in a restructuring when collection of remaining amounts due is considered probable. A non-accrual loan is generally returned to accrual status when contractual payments are less than 90 days past due. However, a loan may remain in non-accrual status when collectability is uncertain, such as a TDR that has not met minimum payment requirements, a loan with a partial charge-off, a home equity loan or line of credit with a delinquent first mortgage greater than 90 days past due, or a loan in Chapter 7 bankruptcy status where all borrowers have filed, and have not reaffirmed or been dismissed.\nALLOWANCE FOR CREDIT LOSSES\nFor all classes of loans, a loan is considered collateral-dependent when, based on current information and events, the borrower is experiencing financial difficulty and repayment is expected to be provided substantially through the sale of the collateral or foreclosure is probable. Factors considered in determining that a loan is collateral-dependent may include the deteriorating financial condition of the borrower indicated by missed or delinquent payments, a pending legal action, such as bankruptcy or foreclosure, or the absence of adequate security for the loan.\nCharge-offs on residential mortgage loans, home equity loans and lines of credit, and construction loans are recognized when triggering events, such as foreclosure actions, short sales, or deeds accepted in lieu of repayment, result in less than full repayment of the amortized cost in the loans.\nPartial or full charge-offs are also recognized for the amount of credit losses on loans considered collateral-dependent when the borrower is experiencing financial difficulty as described by meeting the conditions below.\nFor residential mortgage loans, payments are greater than 180 days delinquent;\nFor home equity loans and lines of credit, and residential loans restructured in a TDR, payments are greater than 90 days delinquent;\nFor all classes of loans restructured in a TDR with a high debt-to-income ratio at time of modification;\nFor all classes of loans, a sheriff sale is scheduled within 60 days to sell the collateral securing the loan;\nFor all classes of loans, all borrowers have been discharged of their obligation through a Chapter 7 bankruptcy;\nFor all classes of loans, within 60 days of notification, all borrowers obligated on the loan have filed Chapter 7 bankruptcy and have not reaffirmed or been dismissed;\nFor all classes of loans, a borrower obligated on a loan has filed bankruptcy and the loan is greater than 30 days delinquent; and\nFor all classes of loans, it becomes evident that a loss is probable.\nCollateral-dependent residential mortgage loans and construction loans are charged-off to the extent the amortized cost in the loan, net of anticipated mortgage insurance claims, exceeds the fair value, less estimated costs to dispose of the underlying property. Management can determine if the loan is uncollectible for reasons such as foreclosures exceeding a reasonable time frame and recommend a full charge-off. Home equity loans or lines of credit are charged-off to the extent the amortized cost in the loan plus the balance of any senior liens exceeds the fair value, less estimated costs to dispose of the underlying property, or management determines the collateral is not sufficient to satisfy the loan. A loan in any portfolio identified as collateral-dependent will continue to be reported as such until it is no longer considered collateral-dependent, is less than 30 days past due and does not have a prior charge-off. A loan in any portfolio that has a partial charge-off will continue to be individually evaluated for credit loss until, at a minimum, the loss has been recovered.\nResidential mortgage loans, home equity loans and lines of credit and construction loans restructured in TDRs that are not evaluated based on collateral are separately evaluated for credit losses on a loan by loan basis at each reporting date for as long as they are reported as TDRs. The credit loss evaluation is based on the present value of expected future cash flows discounted at the effective interest rate of the original loan. Expected future cash flows include a discount factor representing a potential for default. Valuation allowances are recorded for the excess of the amortized costs over the result of the cash flow analysis. Loans discharged in Chapter 7 bankruptcy are reported as TDRs and also evaluated based on the present value of expected future cash flows unless evaluated based on collateral. These loans are evaluated using expected future cash flows because the borrower, not liquidation of the collateral, is expected to be the source of repayment for the loan. Other loans are not considered for restructuring.\nAt September 30, 2023 and September 30, 2022, allowances on individually reviewed TDRs (IVAs), evaluated for credit losses based on the present value of cash flows were $9,546 and $10,284, respectively. All other individually evaluated loans received a charge-off, if applicable.\nThe allowance for credit losses represents the estimate of lifetime losses in the loan portfolio and unfunded loan commitments. The allowance is estimated at each reporting date using relevant available information relating to past events, current conditions and supportable forecasts. The Company utilizes loan level regression models with forecasted economic data to derive the probability of default and loss given default factors. These factors are used to calculate the loan level credit loss over a 24-month period with an immediate reversion to historical mean loss rates for the remaining life of the loans.\nHistorical credit loss experience provides the basis for the estimation of expected credit losses. Qualitative adjustments to historical loss information are made for differences in current loan-specific risk characteristics such as differences in underwriting standards, portfolio mix, delinquency status or likely recovery of previous loan charge-offs. Qualitative adjustments for expected changes in environmental conditions, such as changes in unemployment rates, property values or other relevant factors, are recognized when forecasted economic data used in the model differs from management's view or contains significant unobservable changes within a short period, particularly when those changes are directionally positive. Identifiable model limitations may also lead to qualitative adjustments, such as those made to reflect the expected recovery of loan amounts previously charged-off, beyond what the model is able to project. The qualitative adjustments resulted in a negative ending balance on the allowance for credit losses for the Home Today portfolio, where recoveries are expected to exceed charge-offs over the remaining life of that portfolio.The net qualitative adjustment at September 30, 2023 was a net reduction of $13,425, compared to a net reduction of $7,085 at September 30, 2022. Adjustments are evaluated quarterly based on current facts and circumstances.\nActivity in the allowance for credit losses by portfolio segment is summarized as follows. See Note 15. COMMITMENTS AND CONTINGENT LIABILITIES for further details on the allowance for unfunded commitments.\nFor the Year Ended September 30, 2023\nBeginning\nBalance Provisions (Releases) Charge-offs Recoveries Ending\nBalance\nReal estate loans:\nResidential Core $ 53,506 $ 1,000 $ (257) $ 1,126 $ 55,375\nResidential Home Today (997) (2,370) (320) 2,451 (1,236)\nHome equity loans and lines of credit 20,032 (399) (665) 4,079 23,047\nConstruction 354 (225) - - 129\nTotal real estate loans\n$ 72,895 $ (1,994) $ (1,242) $ 7,656 $ 77,315\nTotal Unfunded Loan Commitments (1)\n$ 27,021 $ 494 $ - $ - $ 27,515\nTotal Allowance for Credit Losses $ 99,916 $ (1,500) $ (1,242) $ 7,656 $ 104,830\nFor the Year Ended September 30, 2022\nBeginning\nBalance Provisions (Releases) Charge-offs Recoveries Ending\nBalance\nReal estate loans:\nResidential Core $ 44,523 $ 6,298 $ (247) $ 2,932 $ 53,506\nResidential Home Today 15 (3,411) (249) 2,648 (997)\nHome equity loans and lines of credit 19,454 (3,820) (954) 5,352 20,032\nConstruction 297 (118) - 175 354\nTotal real estate loans\n$ 64,289 $ (1,051) $ (1,450) $ 11,107 $ 72,895\nTotal Unfunded Loan Commitments (1)\n$ 24,970 $ 2,051 $ - $ - $ 27,021\nTotal Allowance for Credit Losses $ 89,259 $ 1,000 $ (1,450) $ 11,107 $ 99,916\n(1) Total allowance for unfunded loan commitments is recorded in other liabilities on the CONSOLIDATED STATEMENTS OF CONDITION and primarily relates to undrawn home equity lines of credit.\nCLASSIFIED LOANS\nThe following tables provide information about the credit quality of residential loan receivables by an internally assigned grade as of the dates presented. Revolving loans reported at amortized cost include home equity lines of credit currently in their draw period. Revolving loans converted to term are home equity lines of credit that are in repayment. Home equity loans and bridge loans are segregated by origination year. Loans, or the portions of loans, classified as loss are fully charged-off in the period in which they are determined to be uncollectible; therefore they are not included in the following table. No Home Today loans are classified Special Mention and all construction loans are classified Pass for both periods presented. Balances are adjusted for deferred loan fees and expenses and any applicable loans-in-process.\nRevolving Loans Revolving Loans\nBy fiscal year of origination Amortized Converted\n2023 2022 2021 2020 2019 Prior Cost Basis To Term Total\nSeptember 30, 2023\nReal estate loans:\nResidential Core\nPass $ 1,667,029 $ 3,169,609 $ 2,054,744 $ 1,342,854 $ 563,955 $ 3,275,978 $ - $ - $ 12,074,169\nSpecial Mention - - 612 - 106 1,025 - - 1,743\nSubstandard 185 823 1,285 1,806 721 22,207 - - 27,027\nTotal Residential Core 1,667,214 3,170,432 2,056,641 1,344,660 564,782 3,299,210 - - 12,102,939\nResidential Home Today (1)\nPass - - - - - 40,335 - - 40,335\nSubstandard - - - - - 5,695 - - 5,695\nTotal Residential Home Today - - - - - 46,030 - - 46,030\nHome equity loans and lines of credit\nPass 210,131 72,229 23,989 6,965 6,192 13,704 2,657,028 63,399 3,053,637\nSpecial Mention - 129 - 52 32 102 2,830 370 3,515\nSubstandard - - 140 96 - 120 4,849 4,924 10,129\nTotal Home equity loans and lines of credit 210,131 72,358 24,129 7,113 6,224 13,926 2,664,707 68,693 3,067,281\nTotal Construction 11,646 10,755 - - - - - - 22,401\nTotal real estate loans\nPass 1,888,806 3,252,593 2,078,733 1,349,819 570,147 3,330,017 2,657,028 63,399 15,190,542\nSpecial Mention - 129 612 52 138 1,127 2,830 370 5,258\nSubstandard 185 823 1,425 1,902 721 28,022 4,849 4,924 42,851\nTotal real estate loans $ 1,888,991 $ 3,253,545 $ 2,080,770 $ 1,351,773 $ 571,006 $ 3,359,166 $ 2,664,707 $ 68,693 $ 15,238,651\n(1) No new originations of Home Today loans since fiscal 2016.\nRevolving Loans Revolving Loans\nBy fiscal year of origination Amortized Converted\n2022 2021 2020 2019 2018 Prior Cost Basis To Term Total\nSeptember 30, 2022\nReal estate loans:\nResidential Core\nPass $ 3,349,200 $ 2,251,075 $ 1,488,763 $ 629,090 $ 665,116 $ 3,141,907 $ - $ - $ 11,525,151\nSpecial Mention - 292 - 108 464 816 - - 1,680\nSubstandard - 1,195 3,188 1,142 1,883 25,042 - - 32,450\nTotal Residential Core 3,349,200 2,252,562 1,491,951 630,340 667,463 3,167,765 - - 11,559,281\nResidential Home Today (1)\nPass - - - - - 45,408 - - 45,408\nSubstandard - - - - - 7,400 - - 7,400\nTotal Residential Home Today - - - - - 52,808 - - 52,808\nHome equity loans and lines of credit\nPass 98,904 30,614 9,204 8,036 6,965 11,247 2,400,095 89,448 2,654,513\nSpecial Mention - 191 - - - - 898 640 1,729\nSubstandard - - 54 20 19 127 2,996 6,674 9,890\nTotal Home equity loans and lines of credit 98,904 30,805 9,258 8,056 6,984 11,374 2,403,989 96,762 2,666,132\nTotal Construction 37,810 10,668 - - - - - - 48,478\nTotal real estate loans\nPass 3,485,914 2,292,357 1,497,967 637,126 672,081 3,198,562 2,400,095 89,448 14,273,550\nSpecial Mention - 483 - 108 464 816 898 640 3,409\nSubstandard - 1,195 3,242 1,162 1,902 32,569 2,996 6,674 49,740\nTotal real estate loans $ 3,485,914 $ 2,294,035 $ 1,501,209 $ 638,396 $ 674,447 $ 3,231,947 $ 2,403,989 $ 96,762 $ 14,326,699\n(1) No new originations of Home Today loans since fiscal 2016.\nThe home equity lines of credit converted from revolving to term loans during the years ended September 30, 2023 and September 30, 2022, totaled $2,492 and $436, respectively. The amount of conversions to term loans is expected to remain low for several years since the length of the draw period on new originations changed from five to 10 years in 2016.\nResidential loans are internally assigned a grade that complies with the guidelines outlined in the OCCs Handbook for Rating Credit Risk. Pass loans are assets well protected by the current paying capacity of the borrower. Special Mention loans have a potential weakness, as evaluated based on delinquency status or nature of the product, that the Company deems to deserve managements attention and may result in further deterioration in their repayment prospects and/or the Companys credit position. Substandard loans are inadequately protected by the current payment capacity of the borrower or the collateral pledged with a defined weakness that jeopardizes the liquidation of the debt. Also included in Substandard are performing home equity loans and lines of credit where the customer has a severely delinquent first mortgage to which the performing home equity loan or line of credit is subordinate and all loans in Chapter 7 bankruptcy status where all borrowers have filed, and have not reaffirmed or been dismissed. Loss loans are considered uncollectible and are charged-off when identified. Loss loans are of such little value that their continuance as bankable assets is not warranted even though partial recovery may be effected in the future.\nAt September 30, 2023 and September 30, 2022, respectively, $73,172 and $75,904 of TDRs individually evaluated for credit loss have adequately performed under the terms of the restructuring and are classified as Pass loans.\nOther loans are internally assigned a grade of non-performing when they become 90 days or more past due. At September 30, 2023 and September 30, 2022, no other loans were graded as non-performing.\nTROUBLED DEBT RESTRUCTURINGS\nInitial concessions granted for loans restructured as TDRs may include reduction of interest rate, extension of amortization period, capitalization of delinquent amounts, forbearance or other actions. Some TDRs have experienced a combination of concessions. TDRs also may occur as a result of bankruptcy proceedings. Loans discharged in Chapter 7 bankruptcy are classified as multiple restructurings if the loan's original terms had also been restructured by the Company. The amortized cost in TDRs by category as of September 30, 2023 and September 30, 2022 is shown in the tables below.\nSeptember 30, 2023 Initial Restructuring Multiple\nRestructurings Bankruptcy Total\nResidential Core $ 28,546 $ 15,730 $ 9,577 $ 53,853\nResidential Home Today 9,390 10,114 1,691 21,195\nHome equity loans and lines of credit 21,063 2,460 879 24,402\nTotal $ 58,999 $ 28,304 $ 12,147 $ 99,450\nSeptember 30, 2022 Initial Restructuring Multiple\nRestructurings Bankruptcy Total\nResidential Core $ 30,071 $ 17,583 $ 10,896 $ 58,550\nResidential Home Today 10,359 11,485 1,995 23,839\nHome equity loans and lines of credit 22,636 2,743 1,268 26,647\nTotal $ 63,066 $ 31,811 $ 14,159 $ 109,036\nTDRs may be restructured more than once. Among other requirements, a subsequent restructuring may be available for a borrower upon the expiration of temporary restructuring terms if the borrower is unable to resume contractually scheduled loan payments. If the borrower is experiencing an income curtailment that temporarily has reduced their capacity to repay, such as loss of employment, reduction of work hours, non-paid leave or short-term disability, a temporary restructuring is considered. If the borrower lacks the capacity to repay the loan at the current terms due to a permanent condition, a permanent restructuring is considered. In evaluating the need for a subsequent restructuring, the borrowers ability to repay is generally assessed utilizing a debt to income and cash flow analysis.\nFor all TDRs restructured during the years ended September 30, 2023 and September 30, 2022 (set forth in the tables below), the pre-restructured outstanding amortized cost was not materially different from the post-restructured outstanding amortized cost.\nThe following tables set forth the amortized cost in TDRs restructured during the periods presented.\nFor the Year Ended September 30, 2023\nInitial Restructuring Multiple\nRestructurings Bankruptcy Total\nResidential Core $ 2,866 $ 1,784 $ 1,037 $ 5,687\nResidential Home Today 356 342 31 729\nHome equity loans and lines of credit 1,289 233 1 1,523\nTotal $ 4,511 $ 2,359 $ 1,069 $ 7,939\nFor the Year Ended September 30, 2022\nInitial Restructuring Multiple\nRestructurings Bankruptcy Total\nResidential Core $ 3,823 $ 1,533 $ 1,142 $ 6,498\nResidential Home Today 202 1,071 45 1,318\nHome equity loans and lines of credit 510 175 163 848\nTotal $ 4,535 $ 2,779 $ 1,350 $ 8,664\nFor the Year Ended September 30, 2021\nInitial Restructuring Multiple\nRestructurings Bankruptcy Total\nResidential Core $ 9,364 $ 1,981 $ 1,614 $ 12,959\nResidential Home Today 362 1,432 103 1,897\nHome equity loans and lines of credit 1,466 1,223 417 3,106\nTotal $ 11,192 $ 4,636 $ 2,134 $ 17,962\nThe table below summarizes information about TDRs restructured within 12 months of the period presented for which there was a subsequent payment default (at least 30 days past due on one scheduled payment) during the periods presented.\nFor the Year Ended September 30, 2023 For the Year Ended September 30, 2022 For the Year Ended September 30, 2021\nTDRs That Subsequently Defaulted Number of\nContracts Recorded\nInvestment Number of\nContracts Recorded\nInvestment Number of\nContracts Recorded\nInvestment\nResidential Core 6 $ 575 5 $ 780 6 $ 948\nResidential Home Today 5 207 5 90 7 194\nHome equity loans and lines of credit 1 46 2 108 1 42\nTotal 12 $ 828 12 $ 978 14 $ 1,184\n6. MORTGAGE LOAN SERVICING RIGHTS\nThe Company sells certain types of loans through whole loan sales and through securitizations. In each case, the Company retains a servicing interest in the loans or securitized loans. Certain assumptions and estimates are used to determine the fair value allocated to these retained interests at the date of transfer and at subsequent measurement dates. These assumptions and estimates include loan repayment rates and discount rates.\nChanges in interest rates can affect the average life of loans and mortgage-backed securities and the related servicing rights. A reduction in interest rates normally results in increased prepayments, as borrowers refinance their debt in order to reduce their borrowing costs. This creates reinvestment risk, which is the risk that the Company may not be able to reinvest the proceeds of loan and securities prepayments at rates that are comparable to the rates earned on the loans or securities prior to receipt of the repayment.\nDuring 2023, 2022 and 2021, $77,206, $128,118 and $796,512, respectively, of mortgage loans were securitized and/or sold including accrued interest thereon. In these transactions, the Company retained residual interests in the form of mortgage loan servicing rights. Primary economic assumptions used to measure the value of the Companys retained interests at the date of sale resulting from the completed transactions were as follows (per annum):\n2023 2022\nPrimary prepayment speed assumptions (weighted average annual rate) 17.6 % 11.9 %\nWeighted average life (years) 25.3 24.1\nAmortized cost to service loans (weighted average) 0.12 % 0.12 %\nWeighted average discount rate 12 % 12 %\nKey economic assumptions and the sensitivity of the current fair value of mortgage loan servicing rights to immediate 10% and 20% adverse changes in those assumptions are as presented in the following table. The three key economic assumptions that impact the valuation of the mortgage loan servicing rights are: (1) the prepayment speed, or how long the mortgage servicing right will be outstanding; (2) the estimate of servicing costs that will be incurred in fulfilling the mortgage servicing right responsibilities; and (3) the discount factor applied to future net cash flows to convert them to present value. The Company established these factors based on independent analysis of our portfolio and reviews these assumptions periodically to ensure that they reasonably reflect current market conditions and our loan portfolio experience.\nSeptember 30, 2023\nFair value of mortgage loan servicing rights $ 15,916\nPrepayment speed assumptions (weighted average annual rate) 9.4 %\nImpact on fair value of 10% adverse change $ (629)\nImpact on fair value of 20% adverse change $ (1,180)\nEstimated prospective annual cost to service loans (weighted average) 0.12 %\nImpact on fair value of 10% adverse change $ (1,446)\nImpact on fair value of 20% adverse change $ (2,869)\nDiscount rate 12.0 %\nImpact on fair value of 10% adverse change $ (590)\nImpact on fair value of 20% adverse change $ (1,114)\nThese sensitivities are hypothetical and should be used with caution. As indicated in the table above, changes in fair value based on a 10% variation in assumptions generally cannot be extrapolated because the relationship in the change in assumption to the change in fair value may not be linear. Also, the effect of a variation in a particular assumption on the fair value of the retained interest is calculated without changing any other assumption. In reality, changes in one factor may result in changes in another (for example, increases in market interest rates may result in lower prepayments), which could magnify or counteract the sensitivities.\nServicing rights are evaluated periodically for impairment based on the fair value of those rights. Twenty-one risk tranches are used in evaluating servicing rights for impairment, segregated primarily by interest rate stratum within original term to maturity categories with additional strata for less uniform account types.\nActivity in mortgage servicing rights is summarized as follows:\nYear Ended September 30,\n2023 2022 2021\nBalance-beginning of year $ 7,943 $ 8,941 $ 7,860\nAdditions from loan securitizations/sales 322 657 3,836\nAmortization (1)\n(865) (1,655) (2,764)\nNet change in valuation allowance - - 9\nBalance-end of year $ 7,400 $ 7,943 $ 8,941\nFair value of capitalized amounts $ 15,916 $ 15,288 $ 17,454\n(1) Year ended September 30, 2021, amounts include $199 related to the repurchase of loans previously sold and serviced by the Company.\nThe Company receives annual servicing fees ranging from 0.02% to 0.84% of the outstanding loan balances. Servicing income, net of amortization of capitalized servicing rights, included in non-interest income, amounted to $4,516 in 2023, $4,251 in 2022 and $3,260 in 2021. The unpaid principal balance of mortgage loans serviced for others was approximately $1,933,249, $2,051,110 and $2,262,875 at September 30, 2023, 2022 and 2021, respectively. The ratio of capitalized servicing rights to the unpaid principal balance of mortgage loans serviced for others was 0.38%, 0.39%, and 0.40% at September 30, 2023, 2022 and 2021, respectively.\n7. PREMISES, EQUIPMENT AND SOFTWARE, NET\nPremises, equipment and software at cost are summarized as follows:\nSeptember 30,\n2023 2022\nLand $ 8,610 $ 8,610\nOffice buildings 62,090 61,312\nFurniture, fixtures and equipment 40,634 39,899\nSoftware 21,591 20,048\nLeasehold improvements 11,018 11,071\n143,943 140,940\nLess: accumulated depreciation and amortization (109,235) (106,409)\nTotal $ 34,708 $ 34,531\nDuring the years ended September 30, 2023, 2022 and 2021, depreciation and amortization expense on premises, equipment, and software was $4,921, $5,393 and $5,422, respectively.\n8. LEASES\nAs a lessee, the Company enters into operating leases of buildings and land. The Company occupies certain banking branches, loan production and customer service offices and a disaster recovery site through non-cancellable operating leases with remaining terms from less than one year to 13 years. Most of the leases have fixed payment terms with annual fixed-escalation clauses. Certain leases have annual rent escalations based on subsequent year-to-year changes in the consumer price index. These year-to-year changes in the consumer price index are excluded from the calculation of right-of-use assets and lease liabilities and recognized as expense in the period in which they are incurred. Additionally, all variable lease costs that are not based on an index or rate, such as \"common area maintenance\" costs, are expensed as incurred. Most of the Company's leases include options to extend for periods that range from three to five years. The leases do not have early-termination options. The Company has not included term extensions in the calculation of the lease term, as the Company does not consider it reasonably certain that the options will be exercised. As the interest rate implicit in all of the Company's lease contracts is not readily determinable, the Company utilized its incremental borrowing rate, which is the rate that would be incurred to borrow on a collateralized basis over a similar term on an amount equal to the total contractual lease payments in a similar economic environment. The incremental borrowing rate utilized for all the Company's leases is the FHLB Advance rate based on the lease term at commencement in determining the present value of lease payments.\nOperating lease expense for the years ended September 30, 2023 and 2022, totaled $5,573 and $5,576, respectively. Variable lease expense for the years ended September 30, 2023 and 2022, totaled $1,514 and $1,479, respectively. During the years ended September 30, 2023 and 2022, the Company paid $5,556 and $5,572, respectively, in cash for amounts included in the measurement of lease liabilities. As of September 30, 2023 and 2022, the Company has not entered into any material leases that have not yet commenced.\nThe following table summarizes information relating to the Company's operating leases:\nSeptember 30,\n2023 2022\nRight-of-use assets (a) $37,517 $30,189\nLease liabilities (b) $18,209 $15,775\nWeighted Average Remaining Lease Term 5.10 years 5.06 years\nWeighted Average Discount Rate 2.44% 1.49%\n(a) Included in Other assets in the CONSOLIDATED STATEMENTS OF CONDITION\n(b) Included in Accrued expenses and other liabilities in the CONSOLIDATED STATEMENTS OF CONDITION\nThe following table summarizes the maturities of lease liabilities at the periods presented:\nSeptember 30,\n2023 2022\nMaturing in:\n12 months or less $ 5,478 $ 4,953\n13 to 24 months 4,763 3,903\n25 to 36 months 3,288 3,044\n37 to 48 months 2,067 1,810\n49 to 60 months 1,347 591\nover 60 months 2,577 2,230\nTotal minimum lease payments 19,520 16,531\nLess imputed interest 1,311 756\nTotal lease liabilities $ 18,209 $ 15,775\n9. DEPOSITS\nDeposit account balances are summarized by interest rate as follows:\nStated\nInterest\nRate September 30,\n2023 2022\nAmount Percent Amount Percent\nChecking accounts 0.00-1.00%\n$ 983,396 10.4 % $ 1,210,035 13.6 %\nSavings accounts, excluding money market accounts 0.00-4.22\n1,460,601 15.5 1,364,821 15.3\nMoney market accounts 0.00-3.93\n346,479 3.7 481,650 5.4\nSubtotal 2,790,476 29.6 3,056,506 34.3\nCertificates of deposit 0.00-0.99\n981,728 10.4 3,157,495 35.4\n1.00-1.99\n685,170 7.2 1,002,227 11.2\n2.00-2.99\n941,842 10.0 1,320,579 14.8\n3.00-3.99\n1,173,211 12.4 378,587 4.2\n4.00-4.99\n1,346,720 14.3 3,386 0.1\n5.00 and above\n1,520,311 16.1 - -\n6,648,982 70.4 5,862,274 65.7\nSubtotal 9,439,458 100.0 8,918,780 100.0\nAccrued interest 10,362 - 2,237 -\nTotal deposits $ 9,449,820 100.0 % $ 8,921,017 100.0 %\nAt September 30, 2023 and 2022, the weighted average interest rate was 0.05% and 0.81% on checking accounts; 1.49% and 0.79% on savings accounts; 2.62% and 0.95% on money market accounts; 3.47% and 1.37% on certificates of deposit, respectively; and 2.77% and 1.18% on total deposits, respectively.\nThe aggregate amount of CD's in denominations of $250 or more was $845,375 and $733,301 at September 30, 2023 and 2022, respectively. In accordance with the DFA, the maximum amount of deposit insurance is $250 per depositor.\nBrokered CD's (exclusive of acquisition costs and subsequent amortization), which are used as an additional funding alternative, totaled $1,162,601 and $575,236 at September 30, 2023 and 2022, respectively. The FDIC places restrictions on banks with regard to issuing brokered deposits based on the bank's capital classification. As a well-capitalized institution at September 30, 2023 and September 30, 2022, the Association may accept brokered deposits without FDIC restrictions.\nThe scheduled maturity of certificates of deposit is as follows:\nSeptember 30, 2023\nAmount Percent Weighted\nAverage\nRate\n12 months or less $ 3,419,349 51.4 % 3.46 %\n13 to 24 months 764,512 11.5 % 2.01 %\n25 to 36 months 1,506,491 22.7 % 4.07 %\n37 to 48 months 501,945 7.5 % 2.92 %\n49 to 60 months 440,012 6.6 % 4.22 %\nOver 60 months 16,673 0.3 % 1.72 %\nTotal $ 6,648,982 100.0 % 3.44 %\nInterest expense on deposits is summarized as follows:\nYear Ended September 30,\n2023 2022 2021\nCertificates of deposit $ 143,434 $ 68,204 $ 93,187\nChecking accounts 6,081 4,186 1,140\nSavings and money market accounts\n24,686 4,553 2,992\nTotal $ 174,201 $ 76,943 $ 97,319\n10. BORROWED FUNDS\nAt September 30, 2023, the Association had a maximum borrowing capacity of $7,344,253, of which $5,273,637 was outstanding. Borrowings from the FHLB of Cincinnati are secured by the Associations investment in the common stock of the FHLB of Cincinnati, as well as by a blanket pledge of its mortgage portfolio not otherwise pledged. The Association also has the ability to purchase Fed Funds through arrangements with other institutions. Finally, the ability to borrow from the FRB-Cleveland Discount Window is available to the Association and is secured by a pledge of specific loans in the Associations mortgage portfolio.\nTotal borrowings at September 30, 2023 are summarized in the table below:\nBorrowing Capacity Borrowings Available Borrowings Outstanding\nFHLB $ 6,632,811 $ 1,381,951 $ 5,250,860\nFRB Cleveland 126,442 126,442 -\nFed Funds purchased\n585,000 585,000 -\nSubtotal $ 7,344,253 $ 2,093,393 5,250,860\nAccrued interest\n22,777\nTotal borrowings\n$ 5,273,637\nMaturities of borrowings at September 30, 2023 are summarized in the table below:\nAmount Weighted Average Rate\nMaturing in:\n12 months or less $ 1,417,000 3.19 %\n13 to 24 months 700,000 2.26 %\n25 to 36 months 775,548 2.74 %\n37 to 48 months 725,000 2.90 %\n49 to 60 months\n577,273 3.80 %\nover 60 months 1,056,039 3.36 %\nTotal advances\n$ 5,250,860 3.06 %\nAccrued interest 22,777\nTotal $ 5,273,637\nAll borrowings have fixed rates during their term ranging up to 240 months. Interest is payable monthly for long-term advances and at maturity for FHLB three-month advances and overnight advances. The table above reflects the effective maturities and fixed interest rates of the $3,150,000 of short-term FHLB advances that are tied to interest rate swaps discussed in Note 17. DERIVATIVE INSTRUMENTS.\nFor the years ended September 30, 2023, 2022 and 2021, net interest expense related to short-term borrowings was $115,329, $49,828 and $50,975, respectively.\n11. OTHER COMPREHENSIVE INCOME (LOSS)\nThe change in AOCI by component is as follows:\nUnrealized Gains (Losses) on Securities Available for Sale Cash Flow Hedges Defined Benefit Plan Total\nFiscal year 2021 activity\nBalance at September 30, 2020 $ 4,694 $ (114,306) $ (22,353) $ (131,965)\nOther comprehensive income (loss) before reclassifications, net of tax expense (benefit) of $8,656\n(3,733) 20,914 9,937 27,118\nAmounts reclassified, net of tax expense (benefit) of $9,907\n- 35,182 1,864 37,046\nOther comprehensive income (loss) (3,733) 56,096 11,801 64,164\nBalance at September 30, 2021 $ 961 $ (58,210) $ (10,552) $ (67,801)\nFiscal year 2022 activity\nOther comprehensive income (loss) before reclassifications, net of tax expense (benefit) of $21,242\n(34,860) 109,452 (1,665) 72,927\nAmounts reclassified, net of tax expense (benefit) of $5,212\n- 17,641 382 18,023\nOther comprehensive income (loss) (34,860) 127,093 (1,283) 90,950\nBalance at September 30, 2022 $ (33,899) $ 68,883 $ (11,835) $ 23,149\nFiscal year 2023 activity\nOther comprehensive income (loss) before reclassifications, net of tax expense (benefit) of $31,998\n(7,274) 112,851 1,904 107,481\nAmounts reclassified, net of tax expense (benefit) of $(13,383)\n- (46,202) 784 (45,418)\nOther comprehensive income (loss) (7,274) 66,649 2,688 62,063\nBalance at September 30, 2023 $ (41,173) $ 135,532 $ (9,147) $ 85,212\nThe following table presents the reclassification adjustment out of AOCI included in net income and the corresponding line item on the CONSOLIDATED STATEMENTS OF INCOME for the periods indicated:\nDetails about AOCI Components For the Years Ended September 30, Line Item in the Statement of Income\n2023 2022 2021\nCash flow hedges:\nInterest (income) expense $ (59,821) $ 22,740 $ 44,534 Interest expense\nNet income tax effect 13,619 (5,099) (9,352) Income tax expense\nNet of income tax expense (benefit) $ (46,202) $ 17,641 $ 35,182\nAmortization of defined benefit plan:\nActuarial loss $ 1,020 $ 495 $ 2,419 (a)\nNet income tax effect (236) (113) (555) Income tax expense\nNet of income tax expense 784 382 1,864\nTotal reclassifications for the period $ (45,418) $ 18,023 $ 37,046\n(a) These items are included in the computation of net period pension cost. See Note 13. EMPLOYEE BENEFIT PLANS for additional disclosure.\n12. INCOME TAXES\nThe components of the income tax provision are as follows:\nYear Ended September 30,\n2023 2022 2021\nCurrent tax expense (benefit):\nFederal $ 13,602 $ 41,812 $ 31,043\nState 781 2,553 2,230\nDeferred tax expense (benefit):\nFederal 3,681 (24,691) (13,548)\nState 53 (2,185) (638)\nIncome tax provision $ 18,117 $ 17,489 $ 19,087\nReconciliation from tax at the federal statutory rate to the income tax provision is as follows:\nYear Ended September 30,\n2023 2022 2021\nTax at statutory rate 21.0 % 21.0 % 21.0 %\nState tax, net 0.7 0.3 1.3\nNon-taxable income from bank owned life insurance contracts (2.1) (2.3) (2.1)\nNon-deductible compensation 1.0 1.4 0.9\nEquity based compensation 0.2 (0.1) (1.3)\nEmployee (Associate) Stock Ownership Plan\n(1.5) (1.2) (0.8)\nOther, net 0.1 (0.1) 0.1\nIncome tax provision 19.4 % 19.0 % 19.1 %\nTemporary differences between the financial statement carrying amounts and tax basis of assets and liabilities that gave rise to significant portions of net deferred taxes relate to the following:\nSeptember 30,\n2023 2022\nDeferred tax assets:\nLoan loss reserve $ 29,390 $ 27,659\nDeferred compensation 4,215 4,198\nLease liability 4,251 3,599\nProperty, equipment and software basis difference 975 1,413\nOther 2,099 2,220\nTotal deferred tax assets 40,930 39,089\nDeferred tax liabilities:\nFHLB stock basis difference 5,135 5,017\nMortgage servicing rights 1,514 1,551\nPension 2,843 2,119\nGoodwill 2,158 2,132\nLease ROU asset 4,160 3,514\nFair value adjustment\n20,969 -\nDeferred loan costs, net of fees 15,005 13,371\nOther 2,328 2,219\nTotal deferred tax liabilities 54,112 29,923\nNet deferred tax asset (liability)\n$ (13,182) $ 9,166\nIn the accompanying CONSOLIDATED STATEMENTS OF CONDITION the net deferred tax asset or liability is included in Accrued expenses and other liabilities, and Other assets for September 30, 2023 and 2022, respectively.\nA valuation allowance is established to reduce deferred tax assets if it is more likely than not that the related tax benefits will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. There was no valuation allowance required at September 30, 2023 or 2022.\nRetained earnings at September 30, 2023 and 2022 included approximately $104,861, for which no provision for federal or state income tax has been made. This amount represents allocations of income during years prior to 1988 to bad debt deductions for tax purposes only. These qualifying and non-qualifying base year reserves and supplemental reserves will be recaptured into income in the event of certain distributions and redemptions. Such recapture would create income for tax purposes only, which would be subject to the then current corporate income tax rate. However, recapture would not occur upon the reorganization, merger, or acquisition of the Association, nor if the Association is merged or liquidated tax-free into a bank or undergoes a charter change. If the Association fails to qualify as a bank or merges into a non-bank entity, these reserves will be recaptured into income.\nThe provisions of Accounting for Uncertainty in Income Taxes, codified within FASB ASC 740 Income Taxes, prescribe a recognition threshold and measurement attribute for the financial statement recognition and measurement for a tax position taken or expected to be taken in a tax return. FASB ASC 740 also provides guidance on derecognition, classification, interest and penalties, accounting in interim periods, disclosure and transition. Tax positions must meet a more-likely-than-not recognition threshold in order for the related tax benefit to be recognized or continue to be recognized. As of September 30, 2023 and 2022, the Company had no unrecognized tax benefits. The Company does not anticipate the total amount of unrecognized tax benefits to significantly change within the next twelve months.\nThe Company recognizes interest and penalties on income tax assessments or income tax refunds, where applicable, in the financial statements as a component of its provision for income taxes. The Company recognized $0, $0, and $9 of interest expense or penalties on income tax assessments, and $0, $34, and $116 of interest on income tax refunds related to net operating loss carrybacks during the years ended September 30, 2023, 2022 and 2021, respectively. There was no interest related to income tax assessments accrued at September 30, 2023 or 2022.\nThe Companys effective income tax rate was 19.4%, 19.0% and 19.1% for the years ended September 30, 2023, 2022 and 2021, respectively.\nThe Company and its subsidiaries file income tax returns in the U.S. federal jurisdiction and various state and city jurisdictions. With few exceptions, the Company is no longer subject to income tax examinations in its major jurisdictions for tax years prior to 2020.\nThe Company makes certain investments in limited partnerships which invest in affordable housing projects that qualify for the LIHTC. The Company acts as a limited partner in these investments and does not exert control over the operating or financial policies of the partnership. The Company accounts for its interests in LIHTCs using the proportional amortization method. The impact of the Company's investments in tax credit entities on the provision for income taxes was not material for the years ended September 30, 2023, 2022 and 2021.\n13. EMPLOYEE BENEFIT PLANS\nDefined Benefit Plan-The Third Federal Savings Retirement Plan (the Plan) is a defined benefit pension plan. Effective December 31, 2002, the Plan was amended to limit participation to employees who met the Plans eligibility requirements on that date. Effective December 31, 2011, the Plan was amended to freeze future benefit accruals for participants in the Plan. After December 31, 2002, employees not participating in the Plan, upon meeting the applicable eligibility requirements, and those eligible participants who no longer receive service credits under the Plan, participate in a separate tier of the Companys defined contribution 401(k) Savings Plan. Benefits under the Plan are based on years of service and the employees average annual compensation (as defined in the Plan) through December 31, 2011. The funding policy of the Plan is consistent with the funding requirements of U.S. federal and other governmental laws and regulations. During fiscal year 2022, a settlement adjustment was recognized as a result of lump sum payments exceeding the interest costs for the year. There were no settlement adjustments made during fiscal year 2023.\nThe following table sets forth the change in projected benefit obligation for the defined benefit plan:\nSeptember 30,\n2023 2022\nProjected benefit obligation at beginning of year $ 65,015 $ 88,276\nInterest cost 3,324 2,628\nActuarial (gain) loss and other (3,764) (19,783)\nSettlement - (4,292)\nBenefits paid (4,140) (1,814)\nProjected benefit obligation at end of year $ 60,435 $ 65,015\nThe following table reconciles the beginning and ending balances of the fair value of Plan assets and presents the funded status of the Plan recognized in the CONSOLIDATED STATEMENTS OF CONDITION at the September 30 measurement dates. There were no employer contributions in the years ending September 30, 2023 and 2022.\nSeptember 30,\n2023 2022\nFair value of plan assets at beginning of year $ 74,042 $ 97,971\nActual return on plan assets 2,481 (17,823)\nBenefits paid (4,140) (1,814)\nSettlement - (4,292)\nFair value of plan assets at end of year $ 72,383 $ 74,042\nFunded status of the plan-asset (liability) $ 11,948 $ 9,027\nThe components of net periodic cost recognized in other non-interest expense in the CONSOLIDATED STATEMENTS OF INCOME are as follows:\nYear Ended September 30,\n2023 2022 2021\nInterest Cost $ 3,324 $ 2,628 $ 2,536\nExpected return on plan assets (3,872) (4,987) (4,997)\nAmortization of net loss and other 1,020 576 1,466\nRecognized net loss due to settlement - 882 792\nNet periodic benefit (income) cost $ 472 $ (901) $ (203)\nThere were no contributions, required minimum or voluntary, made during the fiscal year ended September 30, 2023.\nAs of September 30, 2023, the Plan had $0 invested in pooled separate accounts due to the Plan moving to an LDI strategy. The LDI strategy derisks the Plan by allocating more to long-duration, fixed income assets. The Plan's target asset allocation is now 80% in LDI fixed income and 20% in equity. At September 30, 2022, $43.8 million were invested in pooled separate accounts with a redemption notice of 7 days.\nThe following table summarizes Plan assets measured at fair value on a recurring basis as of September 30, 2023 and 2022. See FN 16. FAIR VALUE for more information on how our fair value hierarchy is evaluated:\nRecurring Fair Value Measurements at Reporting Date Using\nSeptember 30, 2023 Total Fair Value Quoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable Inputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nCash equivalents\n$ 1,001 $ 1,001 $ - $ -\nFixed income:\nU.S. government obligations\n2,550 2,550 - -\nCorporate debt securities\n42,573 - 42,573 -\nGovernment strips\n8,617 - 8,617 -\nTotal fixed income\n53,740 2,550 51,190 -\nMutual equity funds\n15,791 15,791 - -\nTotal (1)\n$ 70,532 $ 19,342 $ 51,190 $ -\n(1) Plan assets measured at fair value on a recurring basis excludes approximately $1,851 of unsettled security transactions.\nRecurring Fair Value Measurements at Reporting Date Using\nSeptember 30, 2022 Total Fair Value Quoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable Inputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nMutual equity funds $ 30,271 $ 30,271 $ - $ -\nTotal $ 30,271 $ 30,271 $ - $ -\nThere are no redemption restrictions on Plan assets at September 30, 2023. Redemptions may be deferred for a longer period if conditions do not permit an orderly transfer or for certain investments of an illiquid nature.\nThe following additional information is provided with respect to the Plan:\nSeptember 30,\n2023 2022 2021\nAssumptions and dates used to determine benefit obligations:\nDiscount rate 5.75 % 5.35 % 2.85 %\nRate of compensation increase n/a n/a n/a\nAssumptions used to determine net periodic benefit cost:\nDiscount rate 5.35 % 4.60 % 2.80 %\nLong-term rate of return on plan assets 5.50 % 5.50 % 5.50 %\nRate of compensation increase (graded scale) n/a n/a n/a\nThe expected long-term return on plan assets assumption was developed as a weighted average rate based on the target asset allocation of the Plan and the Long-Term Capital Market Assumptions for the corresponding fiscal year end. Management evaluates the historical performance of the various asset categories, as well as current expectations in determining the adequacy of the assumed rates of return in meeting Plan obligations. If warranted, the assumption is modified.\nThe following table provides estimates of expected future benefit payments during each of the next five fiscal years, as well as in the aggregate for years six through 10. Additionally, the table includes the minimum employer contributions expected during the next fiscal year:\nExpected Benefit Payments During the Fiscal Years Ending September 30:\n2024 $ 5,870\n2025 3,890\n2026 4,060\n2027 4,260\n2028 4,210\nAggregate expected benefit payments during the five fiscal year period beginning October 1, 2028, and ending September 30, 2033 23,330\nMinimum employer contributions expected to be paid during the fiscal year ending September 30, 2024 -\nFor the fiscal years ended September 30, 2023, 2022, and 2021, AOCI includes pretax net actuarial losses of $11,862, $15,255, and $13,686, respectively, which have not been recognized as components of net periodic benefit costs as of the measurement date. The Company expects that $628 of net actuarial losses will be recognized as AOCI components of net periodic benefit cost during the fiscal year ended September 30, 2024.\n401(k) Savings Plan-The Company maintains a 401(k) savings plan that is comprised of three tiers. The first tier allows eligible employees to contribute up to 75% of their compensation to the plan, subject to limitations established by the Internal Revenue Service, with the Company matching 100% of up to 4% on funds contributed. The second tier permits the Company to make a profit-sharing contribution at its discretion. The first and second tiers cover substantially all employees who have reached age 18 and have worked 30 days of service in one year of service. The third tier permits the Company to make discretionary contributions allocable to eligible employees including those eligible employees who are participants, but no longer receiving service credits, under the Companys defined benefit pension plan. Voluntary contributions made by employees are vested at all times whereas Company contributions and Company matching contributions are subject to various vesting periods which range from immediately vested to fully vesting upon five years of service.\nThe total of the Companys matching and discretionary contributions related to the 401(k) savings plan for the years ended September 30, 2023, 2022 and 2021 was $4,297, $4,295 and $4,187, respectively.\nEmployee (Associate) Stock Ownership Plan-The Company established an ESOP for its employees effective January 1, 2006. The ESOP is a tax-qualified plan designed to invest primarily in the Companys common stock and provides employees with an opportunity to receive a funded retirement benefit, based on the value of the Companys common stock. The ESOP covers all eligible employees of the Company and its wholly-owned subsidiaries. Employees are eligible to participate in the ESOP after attainment of age 18, completion of 1,000 hours of service, and employment on the last day of the plans calendar year. Company contributions to the plan are at the discretion of the Board of Directors. The ESOP is accounted for in accordance with the provisions for stock compensation in FASB ASC 718. Compensation expense for the ESOP is based on the market price of the Companys stock and is recognized as shares are committed to be released to participants. The total compensation expense related to this plan in the 2023, 2022 and 2021 fiscal years was $5,761, $7,063 and $8,270, respectively.\nThe ESOP was authorized to purchase, and did purchase, 11,605,824 shares of the Companys common stock at a price of $10 per share with a 2006 plan year cash contribution and the proceeds of a loan from the Company to the ESOP. The outstanding loan principal balance as of September 30, 2023 and 2022 was $37,254 and $41,927, respectively. Shares of the Companys common stock pledged as collateral for the loan are released from the pledge for allocation to participants as loan payments are made. At September 30, 2023, 8,897,453 shares have been allocated to participants and 325,005 shares were committed to be released. Shares that are committed to be released will be allocated to participants at the end of the plan year (December 31). ESOP shares that are unallocated or not yet committed to be released totaled 2,708,371 at September 30, 2023, and had a fair market value of $32,013. Participants have the option to receive dividends on allocated shares in cash or leave the dividend in the ESOP. Dividends are reinvested in Company stock for those participants who choose to leave their dividends in the ESOP or who do not make an election. The purchase of Company stock for reinvestment of dividends is made in the open market on or about the date of the cash disbursement to the participants who opt to take dividends in cash. Dividends on unallocated shares held in the Employer Stock fund were paid to the trustee to be used to make payments on the outstanding loan obligation.\n14. EQUITY INCENTIVE PLAN\nThe TFS Financial Corporation Amended and Restated 2008 Equity Incentive Plan, approved by shareholders in February 2018 and the 2008 Equity Incentive Plan, approved by shareholders in May 2008, are collectively referred to as the \"Equity Plan. The amended and restated plan is substantially similar to the previous plan, except that the number of future shares eligible to be granted has been reduced to 8,450,000 shares, of which 7,138,688 shares remain available for future award, and the term to grant shares has been extended to February 21, 2028.\nThe Company recorded excess tax benefits (expense) of $(224), $109, and $1,331 related to share-based compensation awards for the years ended September 2023, 2022 and 2021, respectively.\nThe following table presents share-based compensation expense and the related tax benefit recognized during the periods presented:\nYear Ended September 30,\n2023 2022 2021\nRestricted stock units expense $ 3,366 $ 3,206 $ 4,160\nPerformance share units expense 874 739 1,214\nStock option expense - - 68\nTotal stock-based compensation expense $ 4,240 $ 3,945 $ 5,442\nTax benefit related to share-based compensation expense $ 778 $ 677 $ 999\nRestricted stock units vest over a one to 10 year service period. The product of the number of units granted and the grant date market price of the Companys common stock determines the fair value of restricted stock units under the Equity Plan. The Company recognizes compensation expense for the fair value of restricted stock units on a straight-line basis over the requisite service period.\nThe following is a summary of the status of the Companys restricted stock units as of September 30, 2023, and changes therein during the year then ended:\nNumber of\nShares\nAwarded Weighted\nAverage\nGrant Date\nFair Value\nOutstanding at September 30, 2022 1,257,898 $ 14.17\nGranted 174,550 $ 13.69\nReleased (91,765) $ 17.86\nForfeited (850) $ 17.77\nOutstanding at September 30, 2023 (1) 1,339,833 $ 13.85\n(1) Includes 765,748 shares with a weighted average grant date fair value of $11.87 that have vested but will not be issued until the recipients are no longer employed by the Company.\nThe weighted average grant date fair value of restricted stock units granted during the years ended September 30, 2023, 2022 and 2021 was $13.69, $17.80 and $17.77 per share, respectively. The total fair value of restricted stock units vested during the years ended September 30, 2023, 2022 and 2021 was $1,639, $2,058, and $6,981, respectively. Expected future compensation expense relating to the non-vested restricted stock units at September 30, 2023, is $2,606 over a weighted average period of 2.43 years.\nPerformance share units vest in the form of Company common stock issued at the end of a three-year period, based on the pro-rata achievement of performance based metrics over a two-year period. The range of payout is 0% to 150% of the number of share units granted. For performance stock units, fair value is estimated as the product of the number of performance units granted, adjusted for the probability of achievement, and the grant date market price of the Companys common stock. The Company recognizes compensation expense for the fair value of performance share units on a straight-line basis over the requisite service period, based on the performance condition that is probable of achievement. Probability of achievement is reassessed at each reporting period and the cumulative effect of a change in estimate, if any, is recognized in the period of change. Cash dividend equivalents are accrued and paid only if and when the underlying units become vested and payable.\nThe following is a summary of the status of the Companys performance share units as of September 30, 2023, and changes therein during the year then ended. No awards were forfeited during the year ended September 30, 2023.\nNumber of\nShares\nAwarded Weighted\nAverage\nGrant Date\nFair Value\nOutstanding at September 30, 2022 169,954 18.46\nGranted 102,000 13.69\nReleased (58,277) 19.76\nPerformance adjustment 4,394 17.77\nOutstanding at September 30, 2023 218,071 15.87\nThe weighted average grant date fair value of performance share units granted during the year ended September 30, 2023, 2022 and 2021 was $13.69, $17.80, and $17.77, respectively. The total fair value of performance share units vested during the years ended September 30, 2023, 2022 and 2021, totaled $1,152, $1,112, and $14, respectively. Expected future compensation expense relating to the non-vested performance share units at September 30, 2023, is $1,196 over a weighted average period of 1.81 years.\nStock options have a contractual term of 10 years and vest over a one to seven year service period. The Company recognizes compensation expense for the fair values of these awards, which have installment vesting, on a straight-line basis over the requisite service period of the awards.\nThe following is a summary of the Companys stock option activity and related information for the Equity Plan for the year ended September 30, 2023. There were no stock options granted during 2023, 2022 and 2021.\nNumber of\nStock Options Weighted\nAverage\nExercise\nPrice Weighted\nAverage\nRemaining\nContractual\nLife (years) Aggregate\nIntrinsic\nValue\nOutstanding at September 30, 2022 2,361,175 $ 15.14 3.32 $ 429\nExercised (315,200) $ 11.64 $ 820\nForfeited or expired\n(54,000) $ 14.94 $ -\nOutstanding at September 30, 2023 1,991,975 $ 15.69 2.66 $ -\nVested and exercisable, at September 30, 2023 1,991,975 $ 15.69 2.66 $ -\nVested or expected to vest, at September 30, 2023 1,991,975 $ 15.69 2.66 $ -\nThe total intrinsic value of options exercised during the years ended September 30, 2023, 2022 and 2021 was $820, $551 and $8,605, respectively. There were no non-vested options outstanding as of September 30, 2023. Upon exercise of vested options, management expects to draw on treasury stock as the source of the shares.\n15. COMMITMENTS AND CONTINGENT LIABILITIES\nIn the normal course of business, the Company enters into commitments with off-balance-sheet risk to meet the financing needs of its customers. Commitments to extend credit are agreements to lend to a customer as long as there is no violation of any condition established in the contract. Commitments to originate or purchase loans generally have fixed expiration dates of 60 to 360 days or other termination clauses and may require payment of a fee. Unfunded commitments related to home equity lines of credit generally expire from five to 10 years following the date that the line of credit was established, subject to various conditions including compliance with payment obligation, adequacy of collateral securing the line and maintenance of a satisfactory credit profile by the borrower. Since some of the commitments may expire without being drawn upon, the total commitment amounts do not necessarily represent future cash requirements.\nOff-balance sheet commitments to extend credit involve elements of credit risk and interest rate risk in excess of the amount recognized in the CONSOLIDATED STATEMENTS OF CONDITION. The Companys exposure to credit loss in the event of nonperformance by the other party to the commitment is represented by the contractual amount of the commitment. The Company generally uses the same credit policies in making commitments as it does for on-balance-sheet instruments. The allowance for credit losses related to off-balance sheet commitments is recorded in other liabilities in the CONSOLIDATED STATEMENTS OF CONDITION. Refer to Note 5. LOANS AND ALLOWANCES FOR CREDIT LOSSES for discussion on\ncredit loss methodology. Interest rate risk on commitments to extend credit results from the possibility that interest rates may have moved unfavorably from the position of the Company since the time the commitment was made.\nAt September 30, 2023, the Company had commitments to originate or purchase loans and related allowances as follows:\nCommitment Allowance\nFixed-rate mortgage loans $ 130,448 $ 673\nAdjustable-rate mortgage loans\n44,034 232\nHome equity loans and lines of credit\n174,942 2,547\nTotal $ 349,424 $ 3,452\nAt September 30, 2023, the Company had unfunded commitments outstanding and related allowances as follows:\nCommitment Allowance\nHome equity lines of credit $ 4,696,512 $ 23,811\nConstruction loans 25,754 252\nTotal $ 4,722,266 $ 24,063\nAt September 30, 2023, the unfunded commitment on home equity lines of credit, including commitments for accounts suspended as a result of material default or a decline in equity, is $4,728,215.\nAt September 30, 2023 and September 30, 2022, the Company had $2,094 and $0, respectively, in commitments to sell mortgage loans. At September 30, 2023 and September 30, 2022, the Company had $51,275 and $0, respectively, in commitments to purchase mortgage loans, which are included in mortgage loan commitments above.\nThe above commitments are expected to be funded through normal operations.\nThe Company is undergoing an escheat audit covering Ohio, Kentucky and Florida. Any potential loss that may result from this matter is not reasonably estimable at September 30, 2023.\nThe Company and its subsidiaries are subject to various legal actions arising in the normal course of business. In the opinion of management, the resolution of these legal actions is not expected to have a material adverse effect on the Companys consolidated financial condition, results of operation, or statements of cash flows.\n16. FAIR VALUE\nUnder U.S. GAAP, fair value is defined as the price that would be received to sell an asset, or paid to transfer a liability, in an orderly transaction between market participants at the measurement date under current market conditions. A fair value framework is established whereby assets and liabilities measured at fair value are grouped into three levels of a fair value hierarchy, based on the transparency of inputs and the reliability of assumptions used to estimate fair value.\nAs permitted under the fair value guidance in U.S. GAAP, the Company elects to measure at fair value, mortgage loans classified as held for sale that are subject to pending agency contracts to securitize and sell loans. This election is expected to reduce volatility in earnings related to market fluctuations between the contract trade and settlement dates. At September 30, 2023 and September 30, 2022, there were no pending agency contracts held for sale. For the years ended September 30, 2023, 2022, and 2021, net gain (loss) on the sale of loans includes $0, $0 and $134, respectively, related to unrealized gains or losses during the period due to changes in the fair value of loans held for sale subject to pending agency contracts.\nPresented below is a discussion of the methods and significant assumptions used by the Company to estimate fair value.\nInvestment Securities Available for Sale-Investment securities available for sale are recorded at fair value on a recurring basis. At September 30, 2023 and 2022, this includes $508,324 and $457,908, respectively, of investments in U.S. government and agency obligations including U.S. Treasury notes and investments in highly liquid collateralized mortgage obligations, that can include items issued by Fannie Mae, Freddie Mac, and Ginnie Mae, measured using the market approach. The fair values of investment securities represent unadjusted price estimates obtained from third party independent nationally recognized pricing services using pricing models or quoted prices of securities with similar characteristics and are included in Level 2 of the hierarchy. Third party pricing is reviewed on a monthly basis for reasonableness based on the market knowledge and experience of company personnel that interact daily with the markets for these types of securities.\nMortgage Loans Held for Sale-The fair value of mortgage loans held for sale is estimated on an aggregate basis using a market approach based on quoted secondary market pricing for loan portfolios with similar characteristics. Loans held for sale are carried at the lower of cost or fair value except, as described above, the Company elects the fair value measurement option for mortgage loans held for sale subject to pending agency contracts to securitize and sell loans. Loans held for sale are included in Level 2 of the hierarchy. At September 30, 2023 and 2022, there were $3,260 and $9,661, respectively, of loans held for sale measured at fair value. At September 30, 2023 and 2022 there were no loans held for sale carried at cost. Interest income on mortgage loans held for sale is recorded in interest income on loans.\nCollateral-Dependent Loans-Collateral-dependent loans represent certain loans held for investment that are subject to a fair value measurement under U.S. GAAP because they are individually evaluated using a fair value measurement, such as the fair value of the underlying collateral. Credit loss is measured using a market approach based on the fair value of the collateral, less estimated costs to dispose, for loans the Company considers to be collateral-dependent due to a delinquency status or other adverse condition severe enough to indicate that the borrower can no longer be relied upon as the continued source of repayment. These conditions are described more fully in Note 5. LOANS AND ALLOWANCES FOR CREDIT LOSSES. To calculate the credit loss of collateral-dependent loans, the fair market values of the collateral, estimated using third-party appraisals in the majority of instances, are reduced by calculated estimated costs to dispose, derived from historical experience and recent market conditions. Any indicated credit loss is recognized by a charge to the allowance for credit losses. Subsequent increases in collateral values or principal pay downs on loans with recognized credit loss could result in a collateral-dependent loan being carried below its fair value. When no credit loss is indicated, the carrying amount is considered to approximate the fair value of that loan to the Company because contractually that is the maximum repayment the Company can expect. The amortized cost of loans individually evaluated for credit loss based on the fair value of the collateral are included in Level 3 of the hierarchy with assets measured at fair value on a non-recurring basis. The range and weighted average impact of estimated costs to dispose on fair values is determined at the time of credit loss or when additional credit loss is recognized and is included in quantitative information about significant unobservable inputs later in this note.\nLoans held for investment that have been restructured in TDRs, are performing according to the restructured terms of the loan agreement and are not evaluated based on collateral, are individually evaluated for credit loss using the present value of future cash flows based on the loans effective interest rate, which is not a fair value measurement. At September 30, 2023 and 2022, this included $74,691 and $76,692, respectively, in amortized costs of TDRs with related allowances for loss of $9,546 and $10,284.\nReal Estate Owned-Real estate owned includes real estate acquired as a result of foreclosure, or by deed in lieu of foreclosure, and is carried at the lower of the cost basis or fair value, less estimated costs to dispose. The carrying amounts of real estate owned at September 30, 2023 and September 30, 2022 were $1,444 and $1,191, respectively. Fair value is estimated under the market approach using independent third party appraisals. As these properties are actively marketed, estimated fair values may be adjusted by management to reflect current economic and market conditions. At September 30, 2023 and 2022, these adjustments were not significant to reported fair values. At September 30, 2023 and 2022, respectively, $1,413 and $1,192 of real estate owned is included in Level 3 of the hierarchy with assets measured at fair value on a non-recurring basis where the cost basis equals or exceeds the estimated fair values, less estimated costs to dispose, of $163 and $156, respectively. Real estate owned includes $194 and $155 of properties carried at their original or adjusted cost basis at September 30, 2023 and 2022, respectively.\nDerivatives-Derivative instruments include interest rate locks on commitments to originate loans for the held for sale portfolio, forward commitments on contracts to deliver mortgage loans, and interest rate swaps designated as cash flow hedges. Derivatives not designated as cash flow hedges are reported at fair value in Other assets or Other liabilities on the CONSOLIDATED STATEMENT OF CONDITION with changes in value recorded in current earnings. Derivatives qualifying as cash flow hedges are settled daily, bringing their fair value to $0. Refer to Note 17. DERIVATIVE INSTRUMENTS for additional information on cash flow hedges and other derivative instruments. The fair value of interest rate lock commitments is adjusted by a closure rate based on the estimated percentage of commitments that will result in closed loans. The range and weighted average impact of the closure rate is included in quantitative information about significant unobservable inputs later in this note. A significant change in the closure rate may result in a significant change in the ending fair value measurement of these derivatives relative to their total fair value. Because the closure rate is a significantly unobservable assumption, interest rate lock commitments are included in Level 3 of the hierarchy. Forward commitments on contracts to deliver mortgage loans are included in Level 2 of the hierarchy.\nAssets and liabilities carried at fair value on a recurring basis in the CONSOLIDATED STATEMENTS OF CONDITION at September 30, 2023 and 2022 are summarized below.\nRecurring Fair Value Measurements at Reporting Date Using\nSeptember 30,\n2023 Quoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable Inputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nAssets\nInvestment securities available for sale:\nREMICs $ 443,007 $ - $ 443,007 $ -\nFannie Mae certificates 814 - 814 -\nFreddie Mac certificates\n1,044 - 1,044 -\nU.S. government and agency obligations 63,459 - 63,459 -\nDerivatives:\nForward commitments for the sale of mortgage loans\n11 - 11 -\nTotal $ 508,335 $ - $ 508,335 $ -\nLiabilities\nDerivatives:\nInterest rate lock commitments 1 - - 1\nTotal $ 1 $ - $ - $ 1\nRecurring Fair Value Measurements at Reporting Date Using\nSeptember 30,\n2022 Quoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable Inputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nAssets\nInvestment securities available for sale:\nREMICs $ 453,268 $ - $ 453,268 $ -\nFannie Mae certificates 1,021 - 1,021 -\nU.S. government and agency obligations\n3,619 - 3,619 -\nTotal\n$ 457,908 $ - $ 457,908 $ -\nLiabilities\nDerivatives:\nInterest rate lock commitments 333 - - 333\nTotal $ 333 $ - $ - $ 333\nThe table below presents a reconciliation of the beginning and ending balances and the location within the CONSOLIDATED STATEMENTS OF INCOME where gains (losses) due to changes in fair value are recognized on interest rate lock commitments which are measured at fair value on a recurring basis using significant unobservable inputs (Level 3).\nInterest Rate Lock Commitments\nYear Ended September 30,\n2023 2022 2021\nBeginning balance $ (333) $ 525 $ 1,194\n(Loss)/Gain during the period due to changes in fair value:\nIncluded in other non-interest income 332 (858) (669)\nEnding balance $ (1) $ (333) $ 525\nChange in unrealized gains for the period included in earnings for\nassets held at end of the reporting date $ (1) $ (333) $ 525\nSummarized in the tables below are those assets measured at fair value on a nonrecurring basis.\nNonrecurring Fair Value Measurements at Reporting Date Using\nSeptember 30,\n2023 Quoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable Inputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nCollateral-dependent loans, net of allowance $ 38,289 $ - $ - $ 38,289\nMortgage loans held for sale 3,260 - 3,260 -\nReal estate owned(1)\n1,413 - - 1,413\nTotal $ 42,962 $ - $ 3,260 $ 39,702\n______________________\n(1) Amounts represent fair value measurements of properties before deducting estimated costs to dispose.\nNonrecurring Fair Value Measurements at Reporting Date Using\nSeptember 30,\n2022 Quoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable Inputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nCollateral-dependent loans, net of allowance $ 47,121 $ - $ - $ 47,121\nMortgage loans held for sale 9,661 - 9,661 -\nReal estate owned(1)\n1,192 - - 1,192\nTotal $ 57,974 $ - $ 9,661 $ 48,313\n______________________\n(1) Amounts represent fair value measurements of properties before deducting estimated costs to dispose.\nThe following provides quantitative information about significant unobservable inputs categorized within Level 3 of the Fair Value Hierarchy. The interest rate lock commitments include mortgage origination applications.\nFair Value\nSeptember 30, 2023 Valuation Technique(s) Unobservable Input Range Weighted Average\nCollateral-dependent loans, net of allowance $38,289 Market comparables of collateral discounted to estimated net proceeds Discount appraised value to estimated net proceeds based on historical experience:\nResidential Properties 0 - 30% 4.8%\nInterest rate lock commitments $(1) Quoted Secondary Market pricing Closure rate 0 - 100% 99.5%\nFair Value\nSeptember 30, 2022 Valuation Technique(s) Unobservable Input Range Weighted Average\nCollateral-dependent loans, net of allowance $47,121 Market comparables of collateral discounted to estimated net proceeds Discount appraised value to estimated net proceeds based on historical experience:\nResidential Properties 0 - 28% 4.7%\nInterest rate lock commitments ($333) Quoted Secondary Market pricing Closure rate 0 - 100% 93.7%\nThe following tables present the estimated fair value of the Company's financial instruments and their carrying amounts as reported in the CONSOLIDATED STATEMENTS OF CONDITION.\nSeptember 30, 2023\nCarrying Estimated Fair Value\nAmount Total Level 1 Level 2 Level 3\nAssets:\nCash and due from banks $ 29,134 $ 29,134 $ 29,134 $ - $ -\nInterest earning cash equivalents 437,612 437,612 437,612 - -\nInvestment securities available for sale 508,324 508,324 - 508,324 -\nMortgage loans held for sale 3,260 3,260 - 3,260 -\nLoans, net:\nMortgage loans held for investment 15,161,336 13,262,711 - - 13,262,711\nOther loans 4,411 4,411 - - 4,411\nFederal Home Loan Bank stock 247,098 247,098 N/A - -\nAccrued interest receivable 53,910 53,910 - 53,910 -\nCash collateral received from or held by counterparty 24,887 24,887 24,887 - -\nDerivatives 11 11 - 11 -\nLiabilities:\nChecking and passbook accounts $ 2,790,476 $ 2,790,476 $ - $ 2,790,476 $ -\nCertificates of deposit 6,659,344 6,571,674 - 6,571,674 -\nBorrowed funds 5,273,637 5,256,278 - 5,256,278 -\nBorrowers advances for taxes and insurance 124,417 124,417 - 124,417 -\nPrincipal, interest and escrow owed on loans serviced 29,811 29,811 - 29,811 -\nDerivatives 1 1 - - 1\nSeptember 30, 2022\nCarrying Estimated Fair Value\nAmount Total Level 1 Level 2 Level 3\nAssets:\nCash and due from banks $ 18,961 $ 18,961 $ 18,961 $ - $ -\nInterest earning cash equivalents 350,603 350,603 350,603 - -\nInvestment securities available for sale 457,908 457,908 - 457,908 -\nMortgage loans held for sale 9,661 9,661 - 9,661 -\nLoans, net:\nMortgage loans held for investment 14,253,804 13,106,346 - - 13,106,346\nOther loans 3,263 3,263 - - 3,263\nFederal Home Loan Bank stock 212,290 212,290 N/A - -\nAccrued interest receivable 40,256 40,256 - 40,256 -\nCash collateral received from or held by counterparty 26,045 26,045 26,045 - -\nLiabilities:\nChecking and passbook accounts $ 3,056,506 $ 3,056,506 $ - $ 3,056,506 $ -\nCertificates of deposit 5,864,511 5,733,418 - 5,733,418 -\nBorrowed funds 4,793,221 4,734,377 - 4,734,377 -\nBorrowers advances for taxes and insurance 117,250 117,250 - 117,250 -\nPrincipal, interest and escrow owed on loans serviced 29,913 29,913 - 29,913 -\nDerivatives 333 333 - - 333\n17. DERIVATIVE INSTRUMENTS\nThe Company enters into interest rate swaps to add stability to interest expense and manage exposure to interest rate movements as part of an overall risk management strategy. For hedges of the Company's borrowing and deposit program, interest rate swaps designated as cash flow hedges involve the receipt of variable amounts from a counterparty in exchange for the Company making fixed payments. These derivatives are used to hedge the forecasted cash outflows associated with the Company's FHLB borrowings and brokered certificates of deposit.\nCash flow hedges are initially assessed for effectiveness using regression analysis. Changes in the fair value of derivatives designated and that qualify as cash flow hedges is recorded in OCI and is subsequently reclassified into earnings during the period in which the hedged forecasted transaction affects earnings. Quarterly, a quantitative analysis is preformed to monitor the ongoing effectiveness of the hedging instrument. All derivative positions were initially, and continue to be, highly effective at September 30, 2023.\nThe Company enters into forward commitments for the sale of mortgage loans primarily to protect against the risk of lost revenue from adverse interest rate movements on net income. The Company recognizes the fair value of such contracts when the characteristics of those contracts meet the definition of a derivative. These derivatives are not designated in a hedging relationship; therefore, gains and losses are recognized immediately in the CONSOLIDATED STATEMENTS OF INCOME.\nIn addition, the Company is party to derivative instruments when it enters into interest rate lock commitments to originate a portion of its loans, which when funded, are classified as held for sale. Such commitments are not designated in a hedging relationship; therefore, gains and losses are recognized immediately in the CONSOLIDATED STATEMENTS OF INCOME.\nIn accordance with the reference rate reform, for every LIBOR referenced interest rate swap with a reset date after the LIBOR cessation date, counterparties received a LIBOR referenced instrument maturing on the first reset date after the LIBOR cessation date, and a forward starting SOFR instrument. At September 30, 2023, all previous LIBOR referenced swaps have transitioned to a SOFR-based rate. Additionally, under previously adopted ASU 2020-04, Reference Rate Reform (Topic 848), the Company has elected and applied certain optional expedients for eligible hedging relationships impacted by the LIBOR cessation.\nThe following tables provide the locations within the CONSOLIDATED STATEMENTS OF CONDITION, notional values and fair values, at the reporting dates, for all derivative instruments.\nSeptember 30, 2023\nWeighted Average\nNotional Value Fair Value Term (years) Fixed-Rate Payments\nDerivatives designated as hedging instruments\nCash flow hedges: Interest rate swaps\nOther Assets\nSOFR swaps\n$ 3,815,000 - 3.7 2.91 %\nTotal cash flow hedges: Interest rate swaps\n$ 3,815,000 $ - 3.7 2.91 %\nSeptember 30, 2022\nWeighted Average\nNotional Value Fair Value Term (years) Fixed-Rate Payments\nCash flow hedges: Interest rate swaps\nOther Assets\nLIBOR swaps\n$ 1,550,000 $ - 2.7 1.88 %\nTotal cash flow hedges: Interest rate swaps $ 1,550,000 $ - 2.7 1.88 %\nSeptember 30, 2023 September 30, 2022\nNotional Value Fair Value Notional Value Fair Value\nDerivatives not designated as hedging instruments\nInterest rate lock commitments\nOther Liabilities $ 1,830 $ (1) $ 9,170 $ (333)\nForward Commitments for the sale of mortgage loans\nOther Assets 2,094 11 - -\nTotal derivatives not designated as hedging instruments $ 3,924 $ 10 $ 9,170 $ (333)\nThe following tables present the net gains and losses recorded within the CONSOLIDATED STATEMENTS OF INCOME and the CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME relating to derivative instruments.\nLocation of Gain or (Loss)\nRecognized in Income Year Ended September 30,\n2023 2022 2021\nCash flow hedges\nAmount of gain/(loss) recognized Other comprehensive income $ 146,807 $ 141,163 $ 27,848\nAmount of gain/(loss) reclassified from AOCI Interest expense: Borrowed funds and Deposits\n59,821 (22,740) (44,534)\nDerivatives not designated as hedging instruments\nInterest rate lock commitments Other non-interest income $ 332 $ (858) $ (669)\nForward commitments for the sale of mortgage loans Net gain/(loss) on the sale of loans 11 - 134\nThe Company estimates that $90,257 of the amounts reported in AOCI will be reclassified as a reduction to interest expense during the fiscal year ending September 30, 2024.\nDerivatives contain an element of credit risk which arises from the possibility that the Company will incur a loss because a counterparty fails to meet its contractual obligations. The Company's exposure is limited to the replacement value of the contracts rather than the notional or principal amounts. Credit risk is minimized through counterparty margin payments, transaction limits and monitoring procedures. All of the Company's swap transactions are cleared through a registered clearing broker to a central clearing organization. The clearing organization establishes daily cash and upfront cash or securities margin requirements to cover potential exposure in the event of default. This process shifts the risk away from the counterparty, since the clearing organization acts as an intermediary on each cleared transaction. At September 30, 2023 and 2022, there was $24,887 and $26,045, respectively, of cash collateral included in other assets, and $59,813 and $0, respectively, included in investment securities related to initial margin requirements that are held by the central clearing organization. For derivative transactions cleared through certain clearing parties, variation margin payments are recognized as settlements on a daily basis. The fair value of derivative instruments are presented on a gross basis, even when the derivative instruments are subject to master netting arrangements.\n18. PARENT COMPANY ONLY FINANCIAL STATEMENTS\nThe following condensed financial statements for TFS Financial Corporation (parent company only) reflect the investments in, and transactions with, its wholly-owned subsidiaries. Intercompany activity is eliminated in the consolidated financial statements.\nSeptember 30,\n2023 2022\nStatements of Condition\nAssets:\nCash and due from banks $ 1,424 $ 1,341\nInvestment securities - available for sale 3,646 3,619\nOther loans:\nDemand loan due from Third Federal Savings and Loan 172,307 184,772\nESOP loan receivable 37,254 41,927\nInvestments in:\nThird Federal Savings and Loan 1,704,315 1,605,306\nNon-thrift subsidiaries 8,268 8,104\nPrepaid federal and state taxes 738 -\nDeferred income taxes 200 296\nAccrued receivables and other assets 9,786 9,158\nTotal assets $ 1,937,938 $ 1,854,523\nLiabilities and shareholders equity:\nLine of credit due non-thrift subsidiary $ 8,132 $ 7,485\nAccrued expenses and other liabilities 2,445 2,532\nAccrued federal and state income taxes - 167\nTotal liabilities 10,577 10,184\nPreferred stock, $0.01 par value, 100,000,000 shares authorized, none issued and outstanding\n- -\nCommon stock, 0.01 par value, 700,000,000 shares authorized; 332,318,750 shares issued; 280,359,173 and 280,582,741 outstanding at September 30, 2023 and September 30, 2022, respectively\n3,323 3,323\nPaid-in capital 1,755,027 1,751,223\nTreasury stock, at cost; 51,959,577 and 51,736,009 shares at September 30, 2023 and September 30, 2022, respectively\n(776,101) (771,986)\nUnallocated ESOP shares (27,084) (31,417)\nRetained earnings-substantially restricted 886,984 870,047\nAccumulated other comprehensive income\n85,212 23,149\nTotal shareholders equity 1,927,361 1,844,339\nTotal liabilities and shareholders equity $ 1,937,938 $ 1,854,523\nYears Ended September 30,\n2023 2022 2021\nStatements of Comprehensive Income (Loss)\nInterest income:\nDemand loan due from Third Federal Savings and Loan $ 9,047 $ 1,600 $ 164\nESOP loan 2,433 1,400 1,732\nOther interest income 54 6 1\nInvestment securities available for sale 45 43 -\nTotal interest income 11,579 3,049 1,897\nInterest expense:\nBorrowed funds from non-thrift subsidiaries 351 97 7\nTotal interest expense 351 97 7\nNet interest income 11,228 2,952 1,890\nNon-interest income:\nIntercompany service charges 30 30 85\nDividend from Third Federal Savings and Loan 40,000 56,000 55,000\nTotal other income 40,030 56,030 55,085\nNon-interest expenses:\nSalaries and employee benefits 4,825 4,534 4,917\nProfessional services 1,253 1,456 1,566\nOffice property and equipment 13 13 3\nOther operating expenses 217 223 176\nTotal non-interest expenses 6,308 6,226 6,662\nIncome before income tax benefit 44,950 52,756 50,313\nIncome tax benefit (1,294) (2,826) (3,848)\nIncome before undistributed earnings of subsidiaries 46,244 55,582 54,161\nEquity in undistributed earnings of subsidiaries (dividend in excess of earnings):\nThird Federal Savings and Loan 28,843 17,260 24,738\nNon-thrift subsidiaries 163 1,723 2,108\nNet income 75,250 74,565 81,007\nChange in net unrealized gain (loss) on securities available for sale (7,273) (34,860) (3,733)\nChange in cash flow hedges 66,649 127,093 56,096\nChange in pension obligation 2,688 (1,283) 11,801\nTotal other comprehensive income (loss) 62,064 90,950 64,164\nTotal comprehensive income $ 137,314 $ 165,515 $ 145,171\nYears Ended September 30,\n2023 2022 2021\nStatements of Cash Flows\nCash flows from operating activities:\nNet income $ 75,250 $ 74,565 $ 81,007\nAdjustments to reconcile net income to net cash provided by operating activities:\n(Equity in undistributed earnings of subsidiaries) dividend in excess of earnings:\nThird Federal Savings and Loan (28,843) (17,260) (24,738)\nNon-thrift subsidiaries (163) (1,723) (2,108)\nDeferred income taxes 87 81 204\nESOP and stock-based compensation expense 1,863 1,543 1,843\nNet decrease (increase) in interest receivable and other assets (1,351) 908 12,593\nNet increase (decrease) in accrued expenses and other liabilities (273) 48 (200)\nNet cash provided by operating activities 46,570 58,162 68,601\nCash flows from investing activities:\nPurchase of securities available for sale - (4,071) -\n(Increase) decrease in balances lent to Third Federal Savings and Loan 12,465 304 (12,222)\nNet cash provided by (used in) investing activities 12,465 (3,767) (12,222)\nCash flows from financing activities:\nPrincipal reduction of ESOP loan 4,673 4,527 4,063\nPurchase of treasury shares (5,000) (5,049) -\nDividends paid to common shareholders (58,294) (58,297) (56,637)\nAcquisition of treasury shares through net settlement (978) (1,241) (5,591)\nNet increase (decrease) in borrowings from non-thrift subsidiaries 647 1,649 1,787\nNet cash used in financing activities (58,952) (58,411) (56,378)\nNet increase (decrease) in cash and cash equivalents 83 (4,016) 1\nCash and cash equivalents-beginning of year 1,341 5,357 5,356\nCash and cash equivalents-end of year $ 1,424 $ 1,341 $ 5,357\n19. EARNINGS PER SHARE\nBasic earnings per share is the amount of earnings available to each share of common stock outstanding during the reporting period. Diluted earnings per share is the amount of earnings available to each share of common stock outstanding during the reporting period adjusted to include the effect of potentially dilutive common shares. For purposes of computing earnings per share amounts, outstanding shares include shares held by the public, shares held by the ESOP that have been allocated to participants or committed to be released for allocation to participants and the 227,119,132 shares held by Third Federal Savings, MHC. For purposes of computing dilutive earnings per share, stock options and restricted and performance share units with a dilutive impact are added to the outstanding shares used in the basic earnings per share calculation. Unvested shares awarded pursuant to the Company's restricted stock plans are treated as participating securities in the computation of EPS pursuant to the two-class method as they contain nonforfeitable rights to dividends. The two-class method is an earnings allocation that determines EPS for each class of common stock and participating security. Performance share units, determined to be contingently issuable and not participating securities, are excluded from the calculation of basic EPS. At September 30, 2023 and 2022, the ESOP held 2,708,371 and 3,141,711 shares, respectively, that were neither allocated to participants nor committed to be released to participants.\nThe following is a summary of the Companys EPS calculations.\nFor the Year Ended September 30, 2023\nIncome Shares Per share\namount\n(Dollars in thousands, except per share data)\nNet income $ 75,250\nLess: income allocated to restricted stock units 1,569\nBasic earnings per share:\nIncome available to common shareholders 73,681 277,436,382 $ 0.27\nDiluted earnings per share:\nEffect of dilutive potential common shares 1,147,072\nIncome available to common shareholders $ 73,681 278,583,454 $ 0.26\nFor the Year Ended September 30, 2022\nIncome Shares Per share\namount\n(Dollars in thousands, except per share data)\nNet income $ 74,565\nLess: income allocated to restricted stock units 1,510\nBasic earnings per share:\nIncome available to common shareholders 73,055 277,370,762 $ 0.26\nDiluted earnings per share:\nEffect of dilutive potential common shares 1,315,603\nIncome available to common shareholders $ 73,055 278,686,365 $ 0.26\nFor the Year Ended September 30, 2021\nIncome Shares Per share\namount\n(Dollars in thousands, except per share data)\nNet income $ 81,007\nLess: income allocated to restricted stock units 1,555\nBasic earnings per share:\nIncome available to common shareholders 79,452 276,694,594 $ 0.29\nDiluted earnings per share:\nEffect of dilutive potential common shares 1,881,660\nIncome available to common shareholders $ 79,452 278,576,254 $ 0.29\nThe following is a summary of outstanding stock options and restricted and performance share units that are excluded from the computation of diluted EPS because their inclusion would be anti-dilutive.\nFor the Year Ended September 30,\n2023 2022 2021\nOptions to purchase shares 1,991,975 407,100 133,800\nRestricted and performance share units 57,669 50,000 -\n20. RECENT ACCOUNTING PRONOUNCEMENTS\nAdopted in fiscal year ended September 30, 2023\nIn December of 2022, the FASB issued ASU 2022-06, Reference Rate Reform (Topic 848): Deferral of the Sunset Date of Topic 848. This ASU deferred the period of time entities can utilize the reference rate reform relief guidance from ASU 2020-04, Reference Rate Reform (Topic 848): Facilitation of the Effect of Reference Rate Reform on Financial Reporting, to December 31, 2024 instead of the original December 31, 2022. This amendment is a result of the expectation that the LIBOR would cease to be published as of June 30, 2023. The FASB Board decided that this amendment would be effective for all entities upon issuance of ASU 2022-06. This update did not have a material impact on the Company's consolidated financial condition or results of operation.\nIn March 2023, the FASB issued ASU 2023-02, Investments - Equity Method and Joint Ventures (Topic 323). The amendments in this update expand the proportional amortization method, by election, to account for all investments made primarily for the purpose of receiving income tax credits or other tax benefits. Previously, this accounting method was only allowed for low-income housing tax credit investments. This update is effective for fiscal years beginning after December 15, 2023, with early adoption permitted in any interim period. The Company adopted this update effective April 1, 2023 and will consider the provisions on future tax credit investments, should they occur. This update did not have an immediate impact on our consolidated financial condition or results of operations.\nIssued but not yet adopted as of September 30, 2023\nIn March 2022, the FASB issued ASU 2022-02, Financial Instruments - Credit Losses (Topic 326). The amendments in this Update eliminate the accounting guidance for TDR by creditors in Subtopic 310-40, while enhancing disclosure requirements for certain loan refinancings and restructurings by creditors when the borrower is experiencing financial difficulty. This will be done by applying the loan refinancing and restructuring guidance to determine whether a modification results in a new loan or a continuation of an existing loan. Additionally, this amendment requires that an entity disclose current-period gross write-offs by year of origination for financing receivables and net investments in leases within the scope of Subtopic 326-20. This update is effective for fiscal years beginning after December 15, 2022, with early adoption permitted. The Company plans to adopt this guidance as of October 1, 2023 and apply the modified retrospective transition method that will evaluate loans previously identified as TDRs for credit loss under the Companys current ACL policy. We expect to recognize an increase to opening retained earnings of $7,898, net of income taxes resulting from a pretax decrease to the allowance for credit losses on loans and unfunded commitments of $10,262 upon adoption. The enhanced disclosure requirements provided for by the ASU will be adopted on a prospective basis.\nThe Company has determined that all other recently issued accounting pronouncements will not have a material impact on the Company's consolidated financial statements or do not apply to its operations.\n21. RELATED PARTY TRANSACTIONS\nThe Company has periodically made loans and extensions of credit, in the ordinary course of business, to certain directors and executive officers. These loans were originated with normal credit terms, including interest rate and collateralization, and do not represent more than the normal risk of collection. The aggregate amount of loans to such related parties at both September 30, 2023 and 2022 was $0.\nFORM 10-K EXHIBIT INDEX\nExhibit\nNumber\nDescription of Exhibit If Incorporated by Reference, Documents with\nWhich Exhibit was Previous Filed with SEC\n3.1\nAmended and Restated Charter of TFS Financial Corporation, dated January 16, 2007\nAmendment No. 2 to Registration Statement on Form S-1 No. 333-139295 (filed with the SEC on February 9, 2006; Exhibit 3.2 therein)\n3.2\nAmended and Restated Bylaws of TFS Financial Corporation\nCurrent Report on Form 8-K No. 001-33390 (filed with the SEC on April 28, 2008; Exhibit 3.2 therein)\n3.3\nAmendment to Bylaws of TFS Financial Corporation\nCurrent Report on Form 8-K No. 001-33390 (filed with the SEC on October 29, 2018; Exhibit 3 therein)\n3.4\nAmendment to Bylaws of TFS Financial Corporation\nCurrent Report on Form 8-K No. 001-33390 (filed with the SEC on July 1, 2022; Exhibit 3 therein)\n4.1\nForm of Common Stock Certificate of TFS Financial Corporation\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 4 therein)\n4.2\nDescription of Registrant's Securities\nAnnual Report on Form 10-K No. 001-33390 (filed with the SEC on November 24, 2020; Exhibit 4.2 therein)\n10.1 [Intentionally omitted]\n10.2\nFinancial, Retirement & Estate Planning Program as amended and restated January 1, 2006\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.2 therein)\n10.3\nResolution Regarding Executive Physical Program, dated May 16, 2002\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.3 therein)\n10.4\nCompany Car Program, dated February 24, 1995\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.4 therein)\n10.5\nExecutive Retirement Benefit Plan I, dated January 1, 2006\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.5 therein)\n10.6\nBenefit Equalization Plan, dated January 1, 2005\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.6 therein)\n10.7\nSplit Dollar Agreement, dated January 29, 2002\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.7 therein)\n10.8\nResolution Regarding Supplemental Split Dollar Life Insurance Plan, dated August 22, 2002\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.8 therein)\n10.9 [Intentionally omitted]\n10.10\nTFS Financial Corporation Amended and Restated 2008 Equity Incentive Plan (incorporated by reference to Appendix B to the definitive proxy statement for the 2018 Annual Meeting of Stockholders)\nProxy Statement on Schedule 14A, No. 001-33390 (filed with the SEC on January 9, 2018)\n10.11\nTFS Financial Corporation Management Incentive Compensation Plan (incorporated by reference to Appendix A to the definitive proxy statement for the 2018 Annual Meeting of Stockholders)\nProxy Statement on Schedule 14A, No. 001-33390 (filed with the SEC on January 9, 2018)\nExhibit\nNumber\nDescription of Exhibit If Incorporated by Reference, Documents with\nWhich Exhibit was Previous Filed with SEC\n10.12\nFirst Amendment to the Restricted Stock Unit Award Agreement (August 11, 2008 award), dated August 9, 2012\nCurrent Report on Form 8-K No. 001-33390 (filed with the SEC on August 9, 2012; Exhibit 10.1 therein)\n10.13\nFirst Amendment to the Restricted Stock Unit Award Agreement (May 12, 2009 award), dated August 9, 2012\nCurrent Report on Form 8K No. 001-33390 (filed with the SEC on August 9, 2012; Exhibit 10.2 therein)\n10.14\nFirst Amendment to the Restricted Stock Unit Award Agreement (May 14, 2010 award), dated August 9, 2012\nCurrent Report on Form 8K No. 001-33390 (filed with the SEC on August 9, 2012; Exhibit 10.3 therein)\n14 Code of Ethics Available on our website, www.thirdfederal.com\nInsider trading policies and procedures\nFiled herewith\n21.1\nSubsidiaries of the registrant\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 21 therein)\n23.1\nConsent of Independent Registered Public Accounting Firm\nFiled herewith\n31.1\nCertification of chief executive officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934\nFiled herewith\n31.2\nCertification of chief financial officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934\nFiled herewith\nCertification of chief executive officer and chief financial officer pursuant to Rule 13a-14(b) of the Securities Exchange Act of 1934 and 18 U.S.C. Section 1350\nFiled herewith\nPolicy relating to recovery of erroneously awarded compensation\nFiled herewith\n100 XBRL related documents The following financial statements from TFS Financial Corporations Annual Report on Form 10-K for the year ended September 30, 2023 filed on November 21, 2023 formatted in Inline XBRL (Extensible Business Reporting Language) includes: (i) Consolidated Statements of Condition, (ii) Consolidated Statements of Income, (iii) Consolidated Statements of Comprehensive Income, (iv) Consolidated Statements of Shareholders' Equity, (v) Consolidated Statements of Cash Flows, (vi) Notes to Consolidated Financial Statements.\n101.INS Interactive datafile XBRL Instance Document\n101.SCH Interactive datafile XBRL Taxonomy Extension Schema Document\n101.CAL Interactive datafile XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF Interactive datafile XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB Interactive datafile XBRL Taxonomy Extension Label Linkbase Document\n101.PRE Interactive datafile XBRL Taxonomy Extension Presentation Linkbase Document\n104 Interactive datafile Cover Page Interactive Datafile (embedded within the Inline XBRL document and included in Exhibit 101)\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nTFS Financial Corporation\nDated: November 21, 2023 /S/ MARC A. STEFANSKI\nMarc A. Stefanski\nChairman of the Board, President\nand Chief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nDated: November 21, 2023 /S/ MARC A. STEFANSKI\nMarc A. Stefanski\nChairman of the Board, President\nand Chief Executive Officer\n(Principal Executive Officer)\nDated: November 21, 2023 /S/ TIMOTHY W. MULHERN\nTimothy W. Mulhern\nChief Financial Officer\n(Principal Financial Officer)\nDated: November 21, 2023 /S/ SUSANNE N. MILLER\nSusanne N. Miller\nChief Accounting Officer\n(Principal Accounting Officer)\nDated: November 21, 2023 /S/ BARBARA J. ANDERSON\nBarbara J. Anderson, Director\nDated: November 21, 2023 /S/ ANTHONY J. ASHER\nAnthony J. Asher, Director\nDated: November 21, 2023 /S/ MARTIN J. COHEN\nMartin J. Cohen, Director\nDated: November 21, 2023 /S/ ROBERT A. FIALA\nRobert A. Fiala, Director\nDated: November 21, 2023 /S/ WILLIAM C. MULLIGAN\nWilliam C. Mulligan, Director\nDated: November 21, 2023 /S/ TERRENCE R. OZAN\nTerrence R. Ozan, Director\nDated: November 21, 2023 /S/ JOHN P. RINGENBACH\nJohn P. Ringenbach, Director\nDated: November 21, 2023 /S/ MEREDITH S. WEIL\nMeredith S. Weil, Director\nDated: November 21, 2023 /S/ DANIEL F. WEIR\nDaniel F. Weir, Director\nDated: November 21, 2023 /S/ ASHLEY H. WILLIAMS\nAshley H. Williams, Director"
}