{
    "cik": "1381668",
    "company": "TFS Financial CORP",
    "filing_type": "10-K",
    "filing_date": "2022-11-22",
    "period_of_report": "2022-09-30",
    "sic": "6035",
    "state_of_inc": "DE",
    "state_location": "OH",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1381668/0001381668-22-000128-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1381668/000138166822000128/tfsl-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1381668/0001381668-22-000128.txt",
    "filename": "1381668_10K_2022_0001381668-22-000128.htm",
    "content": "Item 1. Business\nForward Looking Statements\nThis report contains forward-looking statements, which can be identified by the use of such words as estimate, project, believe, intend, anticipate, plan, seek, expect and similar expressions. These forward-looking statements include, among other things:\n● statements of our goals, intentions and expectations;\n● statements regarding our business plans and prospects and growth and operating strategies;\n● statements concerning trends in our provision for credit losses and charge-offs on loans and off-balance sheet exposures;\n● statements regarding the trends in factors affecting our financial condition and results of operations, including credit quality of our loan and investment portfolios; and\n● estimates of our risks and future costs and benefits.\nThese forward-looking statements are subject to significant risks, assumptions and uncertainties, including, among other things, the following important factors that could affect the actual outcome of future events:\n● significantly increased competition among depository and other financial institutions, including with respect to our ability to charge overdraft fees;\n● inflation and changes in the interest rate environment that reduce our interest margins or reduce the fair value of financial instruments, or our ability to originate loans;\n● general economic conditions, either globally, nationally or in our market areas, including employment prospects, real estate values and conditions that are worse than expected;\n● the strength or weakness of the real estate markets and of the consumer and commercial credit sectors and its impact on the credit quality of our loans and other assets, and changes in estimates of the allowance for credit losses;\n● decreased demand for our products and services and lower revenue and earnings because of a recession or other events;\n● changes in consumer spending, borrowing and savings habits;\n● adverse changes and volatility in the securities markets, credit markets or real estate markets;\n● our ability to manage market risk, credit risk, liquidity risk, reputational risk, and regulatory and compliance risk;\n● our ability to access cost-effective funding;\n● legislative or regulatory changes that adversely affect our business, including changes in regulatory costs and capital requirements and changes related to our ability to pay dividends and the ability of Third Federal Savings, MHC to waive dividends;\n● changes in accounting policies and practices, as may be adopted by the bank regulatory agencies, the Financial Accounting Standards Board or the Public Company Accounting Oversight Board;\n● the adoption of implementing regulations by a number of different regulatory bodies, and uncertainty in the exact nature, extent and timing of such regulations and the impact they will have on us;\n● our ability to enter new markets successfully and take advantage of growth opportunities, and the possible short-term dilutive effect of potential acquisitions or de novo branches, if any;\n● our ability to retain key employees;\n● future adverse developments concerning Fannie Mae or Freddie Mac;\n● changes in monetary and fiscal policy of the U.S. Government, including policies of the U.S. Treasury and the FRS and changes in the level of government support of housing finance;\n● the continuing governmental efforts to restructure the U.S. financial and regulatory system;\n● the ability of the U.S. Government to remain open, function properly and manage federal debt limits;\n● changes in policy and/or assessment rates of taxing authorities that adversely affect us or our customers;\n● changes in accounting and tax estimates;\n● changes in our organization, or compensation and benefit plans and changes in expense trends (including, but not limited to trends affecting non-performing assets, charge-offs and provisions for credit losses);\n● the inability of third-party providers to perform their obligations to us;\n● the effects of global or national war, conflict or acts of terrorism;\n● civil unrest;\n● cyber-attacks, computer viruses and other technological risks that may breach the security of our websites or other systems to obtain unauthorized access to confidential information, destroy data or disable our systems; and\n● the impact of wide-spread pandemic, including COVID-19, and related government action, on our business and the economy.\nBecause of these and other uncertainties, our actual future results may be materially different from the results indicated by any forward-looking statements. Any forward-looking statement made by us in this report speaks only as of the date on which it is made. We undertake no obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise, except as may be required by law. Please see Item 1A. Risk Factors\nThe material risks and uncertainties that management believes affect us are described below. You should carefully consider the risks and uncertainties described below, together with all of the other information included or incorporated by reference herein, as well as in other documents we file with the SEC. The risks and uncertainties described below are not the only ones facing us. Additional risks and uncertainties that management is not aware of or focused on, or that management currently deems immaterial may also impair our business operations. This report is qualified in its entirety by these risk factors. See also, Forward-Looking Statements.\nRisks Related to the COVID-19 Pandemic\nThe economic impact of the COVID-19 outbreak could continue to adversely affect our financial condition and results of operations.\nAlthough U.S. and global economies have begun to recover from the COVID-19 pandemic as many health and safety restrictions have been lifted and vaccine distribution has increased, certain adverse consequences of the pandemic continue to impact the macroeconomic environment and may persist for some time, including labor shortages and disruptions of global supply chains. The growth in economic activity and demand for goods and services, alongside labor shortages and supply chain complications, has also contributed to rising inflationary pressures. The extent to which the COVID-19 pandemic impacts our business, financial condition, liquidity, and results of operations will depend on future developments, which are highly uncertain and cannot be predicted. We continue to have many associates working hybrid schedules and may take further actions as may be required by government authorities or that we determine are in the best interests of our associates, customers and business partners. We did not participate in, or offer loans, as part of the Payroll Protection Program.\nThe length of the adverse consequences of the pandemic and the impact to the macroeconomic environment are unknown. Until the consequences subside, we could be subject to any of the following risks, any of which could have a material, adverse effect on our business, financial condition, liquidity, and results of operations:\ndemand for our products and services may decline, making it difficult to grow assets and income;\nloan delinquencies, problem assets, and foreclosures may increase, resulting in increased charges and reduced income;\ncollateral for loans, especially real estate, may decline in value, which could cause loan losses to increase;\nour allowance for credit losses may have to be increased if borrowers experience financial difficulties beyond forbearance periods, which will adversely affect our net income;\nthe net worth and liquidity of loan guarantors may decline, impairing their ability to honor commitments to us;\na material decrease in net income or a net loss over several quarters could result in a decrease in the rate of our quarterly cash dividend;\nour cyber security risks are increased as the result of an increase in the number of associates working remotely;\nthe unanticipated loss or unavailability of key associates due to the outbreak, which could harm our ability to operate our business or execute our business strategy, especially as we may not be successful in finding and integrating suitable successors;\nwe rely on third party vendors for certain services and the unavailability of a critical service due to the COVID-19 outbreak could have an adverse effect on us;\nFederal Deposit Insurance Corporation premiums may increase if the agency experiences additional resolution costs; and\nas a result of the temporary recession experienced by the U.S. due to the pandemic, our business could be materially and adversely affected by another recession should the effects of the pandemic continue for a period of time or worsen.\nRisks Related to Laws and Regulations\nChanges in laws and regulations and the cost of compliance with new laws and regulations may adversely affect our operations and our income.\nWe are subject to extensive regulation, supervision and examination by the FRS, the OCC, the CFPB and the FDIC. These regulatory authorities have extensive discretion in connection with their supervisory and enforcement activities, including the ability to impose restrictions on a banks operations, reclassify assets, determine the adequacy of a banks allowance for credit losses and determine the level of deposit insurance premiums assessed. Because our business is highly regulated, the laws and applicable regulations are subject to frequent change. Any change in these regulations and oversight, whether in the form of regulatory policy, new regulations or legislation or additional deposit insurance premiums could have a material impact on our operations.\nThe potential exists for additional federal or state laws and regulations, or changes in policy, affecting lending and funding practices and liquidity standards. Moreover, bank regulatory agencies have been active in responding to concerns and trends identified in examinations, and have issued many formal enforcement orders requiring capital ratios in excess of regulatory requirements. Bank regulatory agencies, such as the FRS, the OCC, the CFPB and the FDIC, govern the activities in which we may engage, primarily for the protection of depositors, and not for the protection or benefit of potential investors. In addition, new laws and regulations may increase our costs of regulatory compliance and of doing business, and otherwise affect our operations. New laws and regulations may significantly affect the markets in which we do business, the markets for and value of our loans and investments, the fees we can charge and our ongoing operations, costs and profitability.\nWe received a Needs to Improve Community Reinvestment Act rating in our most recent federal examination. This could, at a minimum, result in denial of certain corporate applications such as those related to branches, mergers, minority stock offerings or a second-step conversion.\nAll savings associations have a responsibility under the Community Reinvestment Act and federal regulations to help meet the credit needs of their communities, including low- and moderate-income neighborhoods. In connection with its examination of a federal savings association, the OCC is required to assess the savings associations record of compliance with the Community Reinvestment Act. The Association received a Needs to Improve Community Reinvestment Act rating in its most recent federal examination that analyzed home mortgage lending data for the period January 1, 2015 through December 31, 2019. A savings associations failure to comply with the provisions of the Community Reinvestment Act could, at a\nminimum, result in denial of certain corporate applications such as those related to branches, mergers, minority stock offerings or a second-step conversion, or in restrictions on its activities.\nThe FRS may require the Company to commit capital resources to support the Association, and we may not have sufficient access to such capital resources.\nFederal law requires that a holding company act as a source of financial and managerial strength to its subsidiary bank and to commit resources to support such subsidiary bank. Under the source of strength doctrine, the FRS may require a holding company to make capital injections into a troubled subsidiary bank and may charge the holding company with engaging in unsafe and unsound practices for failure to commit resources to a subsidiary bank. A capital injection may be required at times when the holding company may not have the resources to provide it and therefore may be required to attempt to borrow the funds or raise capital. Thus, any borrowing of funds needed to raise capital required to make a capital injection becomes more difficult and expensive, and could have an adverse effect on our business, financial condition and results of operations. Moreover, it is possible that we will be unable to borrow funds when we need to do so.\nMonetary policies and regulations of the FRS could adversely affect our business, financial condition and results of operations.\nIn addition to being affected by general economic conditions, our earnings and growth are affected by the policies of the FRS. An important function of the FRS is to regulate the money supply and credit conditions. Among the instruments used by the FRS to implement these objectives are open market purchases and sales of U.S. government securities, adjustments of the discount rate and changes in banks reserve requirements against bank deposits. These instruments are used in varying combinations to influence overall economic growth and the distribution of credit, bank loans, investments and deposits. Their use also affects interest rates charged on loans or paid on deposits.\nThe monetary policies and regulations of the FRS have had a significant effect on the operating results of financial institutions in the past and are expected to continue to do so in the future. The effects of such policies upon our business, financial condition and results of operations cannot be predicted.\nRisks Related to our Lending Activities\nOur lending activities provide lower interest rates than financial institutions that originate more commercial loans.\nOur principal lending activity consists of originating, and essentially all of our loan portfolio consists of, residential real estate mortgage loans. We originate our loans with a focus on limiting credit risk exposure and not necessarily to generate the highest return possible or maximize our interest rate spread. In addition, residential real estate mortgage loans generally have lower interest rates than commercial business loans, commercial real estate loans and consumer loans. As a result, we may generate lower interest rate spreads and rates of return when compared to our competitors who originate more consumer or commercial loans than we do. We intend to continue our focus on residential real estate lending.\nSecondary mortgage market conditions could have a material impact on our financial condition and results of operations.\nLoan sales provide a significant portion of our non-interest income. In addition to being affected by interest rates, the secondary mortgage markets are also subject to investor demand for residential real estate loans and increased investor yield requirements for these loans. These conditions may fluctuate or worsen in the future. A prolonged period of secondary market illiquidity could have a material adverse effect on our financial condition and results of operations.\nIf we are required to repurchase mortgage loans that we have previously sold, it would negatively affect our earnings.\nWe sell mortgage loans in the secondary market under agreements that contain representations and warranties related to, among other things, the origination, characteristics of the mortgage loans and subsequent servicing. We may be required to repurchase mortgage loans that we have sold in cases of borrower default or breaches of these representations and warranties, and we would be subject to increased risk of disputes and repurchase demands as our volume of loan sales increases. If we are required to repurchase mortgage loans or provide indemnification or other recourse, this could significantly increase our costs and thereby affect our future earnings.\nFinal regulations could restrict our ability to originate and sell loans.\nThe Consumer Financial Protection Bureau issued a rule designed to clarify for lenders how they can avoid legal liability under the Dodd-Frank Act, which holds lenders accountable for ensuring a borrowers ability to repay a mortgage. Loans that meet this qualified mortgage definition will be presumed to have complied with the ability-to-repay standard. A qualified mortgage must be made to a borrower whose total monthly debt-to-income ratio does not exceed 43%. Lenders must also verify and document the income and financial resources relied upon to qualify the borrower on the loan and underwrite the loan based on a fully amortizing payment schedule and maximum interest rate during the first five years, taking into account all applicable taxes, insurance and assessments. Under the rule, a qualified mortgage loan must not contain certain specified features, including:\nnot be higher-priced as defined by the FRB in 2008;\nexcessive upfront points and fees (those exceeding 3% of the total loan amount, less bona fide discount points for prime loans);\ninterest-only payments;\nnegative amortization;\nballoon payments;\nterms of longer than 30 years; and\ncannot be a 'no doc' loan where the creditor does not verify income or assets.\nIn addition to the above exclusions, a newly defined \"qualified mortgage\" APR must be within a certain tolerance of APOR in order to qualify as a \"qualified mortgage\" loan under the final rule. These tolerances have the ability to impact certain products, but does not preclude TFS from originating non-qualified mortgage loans. TFS has been delivering fixed-rate loans to government sponsored entities over the past year, which required implementation of the Final \"Qualified Mortgage\" General Rule that went into effect on October 1, 2022. In September of 2022, internal systems were updated at TFS in order to calculate \"qualified mortgage\" status for all closed end products (i.e. Fixed, ARM, HELOANs).\nThe regulatory agencies have issued a rule in response to requirements within the Dodd-Frank Act that requires securitizers of loans to retain not less than 5% of the credit risk for any asset that is not a qualified residential mortgage. The final rule also provides that the definition of qualified residential mortgage includes loans that meet the definition of qualified mortgage issued by the Consumer Financial Protection Bureau.\nThe General Qualified Mortgage Final Rule could have a significant effect on the secondary market for loans. The Consumer Financial Protection Bureau's rule on qualified mortgages could limit our desire to make certain types of loans or loan to certain borrowers, which could limit our growth or profitability.\nThe foreclosure process may adversely impact our recoveries on non-performing loans\nThe judicial foreclosure process is protracted, which delays our ability to resolve non-performing loans through the sale of the underlying collateral. The longer timelines have been the result of the economic crisis, additional consumer protection initiatives related to the foreclosure process, increased documentary requirements and judicial scrutiny, and both voluntary and mandatory programs under which lenders may consider loan modifications or other alternatives to foreclosure. These reasons, as well as the legal and regulatory responses, have impacted the foreclosure process and completion time of foreclosures for residential mortgage lenders. This may result in a material adverse effect on collateral values and our ability to minimize its losses.\nRisks Related to Competitive Matters\nStrong competition within our market areas may limit our growth and profitability.\nCompetition in the banking and financial services industry is intense. In our market areas, we compete with commercial banks, savings institutions, mortgage brokerage firms, credit unions, finance companies, mutual funds, money market funds, insurance companies, and brokerage and investment banking firms operating locally and elsewhere. Some of our competitors have greater name recognition and market presence that benefit them in attracting business, and offer certain services that we do not or cannot provide. In addition, larger competitors may be able to price loans and deposits more aggressively than we do. Competitive factors driven by consumer sentiment or otherwise can also reduce our ability to generate fee income, such as through overdraft fees. Troubled financial institutions may not significantly increase the interest rates paid to depositors in pursuit of retail deposits when wholesale funding sources are not available to them. Furthermore, the wide acceptance of Internet-based commerce has resulted in a number of alternative payment processing systems and lending platforms in which banks play only minor roles. Customers can now maintain funds in prepaid debit cards or digital currencies, and pay bills and\ntransfer funds directly without the direct assistance of banks. Our profitability depends upon our continued ability to successfully compete in our market areas. For additional information see PART 1 Item 1. Business-THIRD FEDERAL SAVINGS AND LOAN ASSOCIATION OF CLEVELAND-Competition.\nWe continually encounter technological change, and may have fewer resources than many of our larger competitors to continue to invest in technological improvements.\nThe financial services industry is undergoing rapid technological changes, with frequent introductions of new technology-driven products and services. The effective use of technology increases efficiency and enables financial institutions to better serve customers and to reduce costs. Our future success will depend, in part, upon our ability to address the needs of our customers by using technology to provide products and services that will satisfy customer demands for convenience, as well as to create additional efficiencies in our operations. Many of our competitors have substantially greater resources to invest in technological improvements. We also may not be able to effectively implement new technology-driven products and services or be successful in marketing these products and services to our customers.\nRisks Related to Our Operations\nCyber-attacks, other security breaches or failure or interruption of information systems could adversely affect our operations, net income or reputation.\nWe rely heavily on communications and information systems to conduct our business. We regularly collect, process, transmit and store significant amounts of data and confidential information regarding our customers, associates and others and concerning our own business, operations, plans and strategies. In some cases, this confidential or proprietary information is collected, compiled, processed, transmitted or stored by third parties on our behalf.\nInformation security risks have generally increased in recent years because of the proliferation of new technologies, the use of the Internet and telecommunications technologies to conduct financial and other transactions and the increased sophistication and activities of perpetrators of cyber-attacks and mobile phishing. Mobile phishing, a means for identity thieves to obtain sensitive personal information through fraudulent e-mail, text or voice mail, is an on-going threat targeting the customers of popular financial entities. A failure in or breach of our operational or information security systems, or those of our third-party service providers, as a result of cyber-attacks or information security breaches or due to associate error, malfeasance or other disruptions could adversely affect our business, result in the disclosure or misuse of confidential or proprietary information, damage our reputation, increase our costs and/or cause losses.\nIf this confidential or proprietary information were to be mishandled, misused or lost, we could be exposed to significant regulatory consequences, reputational damage, civil litigation and financial loss.\nAlthough we employ a variety of physical, procedural and technological safeguards to protect this confidential and proprietary information from mishandling, misuse or loss, these safeguards do not provide absolute assurance that mishandling, misuse or loss of the information will not occur. If mishandling, misuse or loss of the information did occur, the Company would make all commercially reasonable efforts to detect and address any such event. Similarly, when confidential or proprietary information is collected, compiled, processed, transmitted or stored by third parties on our behalf, our policies and procedures require that the third party agree to maintain the confidentiality of the information, establish and maintain policies and procedures designed to preserve the confidentiality of the information, and permit us to confirm the third partys compliance with the terms of the agreement. As information security risks and cyber threats continue to evolve, we may be required to expend additional resources to continue to enhance our information security measures and/or to investigate and remediate any information security vulnerabilities.\nWe believe that we have not experienced any material breaches.\nCustomer or associate fraud subjects us to additional operational risks.\nAssociate errors and associate and customer misconduct could subject us to financial losses or regulatory sanctions and seriously harm our reputation. Our loans to individuals and our deposit relationships and related transactions are also subject to exposure to the risk of loss due to fraud and other financial crimes. Misconduct by our associates could include hiding unauthorized activities from us, improper or unauthorized activities on behalf of our customers or improper use of confidential information. It is not always possible to prevent associate errors and misconduct, and the precautions we take to prevent and detect this activity may not be effective in all cases. Associate errors could also subject us to financial claims for negligence. We have not experienced any material financial losses from associate errors, misconduct or fraud. However, if our internal controls fail to prevent or promptly detect an occurrence, or if any resulting loss is not insured or exceeds applicable insurance limits, it could have a material adverse effect on our financial condition and results of operations.\nIf our enterprise risk management framework is not effective at mitigating risk and loss to us, we could suffer unexpected losses and our results of operations could be materially adversely affected.\nOur enterprise risk management framework seeks to achieve an appropriate balance between risk and return, which is critical to optimizing stockholder value. We have established processes and procedures intended to identify, measure, monitor, report and analyze the types of risk to which we are subject, including credit, liquidity, operational, regulatory compliance and reputational. However, as with any risk management framework, there are inherent limitations to our risk management strategies as there may exist, or develop in the future, risks that we have not appropriately anticipated or identified. If our risk management framework proves ineffective, we could suffer unexpected losses and our business and results of operations could be materially adversely affected.\nOur operations rely on numerous external vendors.\nWe rely on numerous external vendors to provide us with products and services necessary to maintain our day-to-day operations. Accordingly, our operations are exposed to risk that these vendors will not perform in accordance with the contracted arrangements under service level agreements. The failure of an external vendor to perform in accordance with the contracted arrangements under service level agreements because of changes in the vendor's organizational structure, financial condition, support for existing products and services or strategic focus or for any other reason, could be disruptive to our operations, which in turn could have a material negative impact on our financial condition and results of operations. We also could be adversely affected to the extent such an agreement is not renewed by the third-party vendor or is renewed on terms less favorable to us. Our Vendor Management program helps mitigate risks and is structured to minimize the cost and time required to replace a vendor in the event of a failure or the vendor's inability to meet service level agreements.\nRisk Related to Our Corporate Structure\nOur sources of funds are limited because of our holding company structure.\nThe Company is a separate legal entity from its subsidiaries and does not have significant operations of its own. Dividends from the Association provide a significant source of cash for the Company. The availability of dividends from the Association is limited by various statutes and regulations. Under these statutes and regulations, the Association is not permitted to pay dividends on its capital stock to the Company, its sole stockholder, if the dividend would reduce the stockholders' equity of the Association below the amount of the liquidation account established in connection with the mutual-to-stock conversion. Federal savings associations may pay dividends without the approval of its primary federal regulator only if they meet applicable regulatory capital requirements before and after the payment of the dividends and total dividends do not exceed net income to date over the calendar year plus its retained net income over the preceding two years. If in the future, the Company utilizes its available cash and the Association is unable to pay dividends to the Company, the Company may not have sufficient funds to pay dividends or fund stock repurchases.\nRestrictions on our ability to pay dividends to stockholders could adversely affect the value of our common stock.\nThe value of the Companys common stock is significantly affected by our ability to pay dividends to our public stockholders. The Companys ability to pay dividends to our stockholders is subject to the availability of cash at the Company which is dependent on the Association having sufficient earnings to make capital distributions to the Company. Moreover, our ability to pay dividends and the amount of such dividends is affected by the ability of Third Federal Savings, MHC, our mutual holding company, to waive the receipt of dividends declared by the Company.\nFederal regulations require Third Federal Savings, MHC to notify the FRS of any proposed waiver of its receipt of dividends from the Company. In August 2011, the FRS issued an interim final rule pursuant to the DFA, providing that the FRS may not object to dividend waivers by grandfathered mutual holding companies, such as Third Federal Savings, MHC, under standards substantially similar to those previously required by the OTS. However, the interim final rule added a requirement that a majority of the mutual holding companys members eligible to vote must approve a dividend waiver by a mutual holding company within twelve months prior to the declaration of the dividend being waived. As part of its rulemaking process, the FRS is reviewing comments on the interim final rule and there can be no assurance that the final rule will not require such a member vote. Third Federal Savings, MHC has received the approval of its members in nine separate meetings (held in either July or August of each year from 2014 through 2022) to waive the receipt of dividends for a twelve-month period, and the FRS has non-objected to Third Federal Savings, MHCs waiver each time. However, future approvals of members and non-objections from the FRS are not assured and if not obtained, the discontinuance of dividend payments would adversely affect the value of our common stock.\nPublic stockholders own a minority of the outstanding shares of our common stock and will not be able to exercise voting control over most matters put to a vote of stockholders.\nThird Federal Savings, MHC, as our majority shareholder, is able to control the outcome of virtually all matters presented to our shareholders for their approval, including any proposal to acquire us. The same directors and officers who manage the Association also manage the Company and Third Federal Savings, MHC. The board of directors of Third Federal Savings, MHC must ensure that the interests of depositors of the Association (as members of Third Federal Savings, MHC) are represented and considered in matters put to a vote of stockholders of the Company. Therefore, Third Federal Savings, MHC may take action that the public stockholders believe to be contrary to their interests. For example, Third Federal Savings, MHC may exercise its voting control to defeat a stockholder nominee for election to the board of directors of the Company. Additionally, Third Federal Savings, MHC may prevent the sale of control or merger of the Company or its subsidiaries, or a second-step conversion of Third Federal Savings, MHC, even if such a transaction were favored by a majority of the public shareholders of the Company.\nRisks Related to Accounting Matters\nChanges in managements estimates and assumptions may have a material impact on our consolidated financial statements and on our financial condition and/or operating results.\nIn preparing periodic reports we are required to file under the Securities Exchange Act of 1934, including our consolidated financial statements, our management is and will be required under applicable rules and regulations to make estimates and assumptions as of a specified date. These estimates and assumptions are based on managements best estimates and experience as of that date and are subject to substantial risk and uncertainty. Materially different results may occur as circumstances change and additional information becomes known. Areas requiring significant estimates and assumptions by management include our evaluation of the adequacy of our allowance for credit losses and the determination of pension obligations.\nChanges in accounting standards could affect reported earnings.\nThe bodies responsible for establishing accounting standards, including the Financial Accounting Standards Board, the Securities and Exchange Commission and other regulatory bodies, periodically change the financial accounting and reporting guidance that governs the preparation of our financial statements. These changes can be hard to predict and can materially impact how we record and report our financial condition and results of operations. In some cases, we could be required to apply new or revised guidance retroactively.\nRisks Related to Economic Conditions\nFuture changes in interest rates could reduce our net income.\nOur net income largely depends on our net interest income, which could be negatively affected by changes in interest rates. Net interest income is the difference between the interest income we earn on our interest-earning assets, such as loans and securities, and the interest we pay on our interest-bearing liabilities, such as deposits and borrowings.\nGenerally, in a period of rising interest rates, the interest income earned on our assets may not increase as rapidly as the interest paid on our liabilities because, like many savings institutions, our liabilities generally have shorter contractual maturities than our assets. An example of this occurs when, interest rates paid on certificates of deposit experience a significant increase. In this circumstance, a CD customer may determine that it is in his/her best interest to incur the existing penalty for early withdrawal, tender the certificate for cash and either reinvest the proceeds in a new CD with us, or withdraw the funds and leave us. As a result, we either establish a new, higher rate certificate (if the customer stays with us) or we must fund the customers withdrawal by: (1) reducing our cash reserves; (2) selling assets to generate cash to fund the withdrawal; (3) attracting deposits from another customer at the then-higher interest rate; or (4) borrowing from a wholesale lender like the FHLB of Cincinnati, again at the then-higher interest rate. Each of these alternatives can have an unfavorable impact on us.\nAs another example of changes in interest rates that can have an unfavorable impact on our net interest income, if mortgage interest rates decline, our customers may seek to refinance, without penalty, their mortgage loans with us or repay their mortgage loans with us and borrow from another lender. When that happens, either the yield that we earn on the customers loan is reduced (if the customer refinances with us) or the mortgage is paid off and we are faced with the challenge of reinvesting the cash received to repay the mortgage in a lower interest rate environment. This is frequently referred to as reinvestment risk, which is the risk that we may not be able to reinvest the proceeds of loan prepayments at rates that are comparable to the rates we earned on the loans prior to receipt of the repayment. Reinvestment risk also exists with the securities in our investment portfolio that are backed by mortgage loans.\nOur net interest income can also be negatively impacted when assets and funding sources with seemingly similar, but not identical re-pricing characteristics react differently to changing interest rates. An example is our home equity lines of credit loan portfolio and our interest-bearing checking and savings deposit products. Interest rates charged on our home equity lines of credit loans are linked to the prime rate of interest, which generally adjusts in a direct relationship to changes in the FRSs Federal Funds target rate. Similarly, our interest-bearing checking and savings deposit products are generally expected to adjust when changes are made to the Federal Funds target rate. However, to the extent that increases or decreases are made to the Federal Funds target rate, and those increases or decreases translate into increases or decreases of the prime rate and the rate charged on our home equity lines of credit loans, but do not extend to equivalent adjustments to our interest-bearing checking and savings deposit products, we can experience a reduction in our net interest income. At September 30, 2022, we held $2.47 billion of home equity lines of credit loans and $2.85 billion of interest-bearing checking and savings deposits.\nOur net income can also be reduced by the impact that changes in interest rates can have on the value of our capitalized mortgage servicing rights. As of September 30, 2022, we serviced $2.05 billion of loans sold to third parties, and the mortgage servicing rights associated with such loans had an amortized cost of $7.9 million and an estimated fair value, at that date, of $15.3 million. Because the estimated life and estimated income to be derived from servicing the underlying mortgage loans generally increase with rising interest rates and decrease with falling interest rates, the value of mortgage servicing rights generally increases as interest rates rise and decreases as interest rates fall. If interest rates fall and the value of our capitalized servicing rights decrease, we may be required to recognize an additional impairment charge against income for the amount by which amortized cost exceeds estimated fair market value.\nOur securities portfolio may be impacted by fluctuations in market value, potentially reducing accumulated other comprehensive income and/or earnings. Fluctuations in market value may be caused by changes in market interest rates, lower market prices for securities and limited investor demand. Changes in interest rates can also have an adverse effect on our financial condition, as our available for sale securities are reported at their estimated fair value, and therefore are impacted by fluctuations in interest rates. We increase or decrease our stockholders equity by the amount of change in the estimated fair value of the available for sale securities, net of taxes. The declines in market value could result in other-than-temporary impairments of these assets, which would lead to accounting charges that could have a material adverse effect on our net income and capital levels.\nIn general, changes in market and competitive interest rates result from events that we do not control and over which we generally have little or no influence. As a result, mitigation of the adverse affects of changing interest rates is generally limited to controlling the composition of the assets and liabilities that we hold. To monitor our positions, we maintain an interest rate risk modeling system which is designed to measure our interest rate risk sensitivity. Using customized modeling software, the Association prepares periodic estimates of the amounts by which the net present value of its cash flows from assets, liabilities and off balance sheet items (the institutions economic value of equity) would change in the event of a range of assumed changes in market interest rates. The simulation model uses a discounted cash flow analysis and an option-based pricing approach in measuring the interest rate sensitivity of EVE. At September 30, 2022, in the event of an immediate 200 basis point increase in all interest rates, our model projects that we would experience a $397.3 million, or 29.92%, decrease in EVE. Our calculations further project that, at September 30, 2022, in the event that market interest rates used in the simulation were adjusted in equal monthly amounts (termed a \"ramped\" format) during the twelve month measurement period to an aggregate increase in 200 basis points, we would expect our projected net interest income for the twelve months ended September 30, 2023 to decrease by 0.29%. See Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nA worsening of economic conditions could reduce demand for our products and services and/or result in increases in our level of non-performing loans, which could have an adverse effect on our results of operations.\nOur performance is significantly impacted by the general economic conditions in our primary markets in Ohio and Florida, and surrounding areas. We also originate loans in other states which will be impacted by national or regional economic conditions. A deterioration in economic conditions is likely to result in high levels of unemployment, which would weaken local economies and could result in additional defaults of mortgage loans. Most of the loans in our loan portfolio are secured by real estate located in our primary market areas. Negative conditions, such as layoffs, in the markets where collateral for a mortgage loan is located could adversely affect a borrowers ability to repay the loan and the value of the collateral securing the loan. Declines in the U.S. housing market, falling home prices and increasing foreclosures, as well as unemployment and under-employment, all negatively impact the credit performance of mortgage loans and can result in significant write-downs of asset values by financial institutions.\nIn response to a significant decline in general economic conditions, many lenders and institutional investors may reduce or cease providing funding to borrowers, including other financial institutions. This market turmoil and tightening of credit could lead to an increased level of commercial and consumer delinquencies, lack of consumer confidence, increased market volatility and widespread reduction of general business activity. The resulting economic pressure on consumers and lack of\nconfidence in the financial markets could adversely affect our business, financial condition and results of operations. In response, we would expect to face the following risks in connection with these events:\nIncreased regulation of our industry, heightened supervisory scrutiny related to the USA PATRIOT Act, Bank Secrecy Act, Fair Lending and other laws and regulations, along with enhanced monitoring of compliance with such regulation. Each aspect of amplified supervision and regulation will in all likelihood increase our costs, may be accompanied by the risk of unexpected fines, sanctions, penalties, litigation and corresponding management diversion and may limit our ability to pursue business opportunities and return capital to our shareholders.\nOur ability to assess the creditworthiness of our customers may be impaired if the models and approaches we use to select, manage, and underwrite our customers become less predictive of future behaviors.\nThe processes we use to estimate losses inherent in our credit exposure require difficult, subjective, and complex judgments, including forecasts of economic conditions and how these economic predictions might impair the ability of our borrowers to repay their loans, which may no longer be capable of viable estimation and which may, in turn, impact the reliability of our evaluation processes, the comfort of our regulators with respect to the adequacy of our allowance for credit losses and who may require adjustments thereto, and ultimately could result in increased provisions for loan losses and reduced levels of earnings and capital.\nOur ability to engage in sales of mortgage loans to third parties (including mortgage loan securitization transactions with governmental entities) on favorable terms or at all could be adversely affected by further disruptions in the capital markets or other events, including deteriorating investor expectations.\nCompetition in our industry could intensify as a result of increasing consolidation of financial services companies in connection with current market conditions.\nOther Risks Related to Our Business\nHurricanes or other adverse weather events could negatively affect the economy in our Florida market area or cause disruptions to our branch office locations, which could have an adverse effect on our business or results of operations.\nA significant portion of our branch operations are conducted in Florida, a geographic region with coastal areas that are susceptible to hurricanes and tropical storms. Such weather events can disrupt our operations, result in damage to our branch office locations and negatively affect the local economy in which we operate. We cannot predict whether or to what extent damage caused by future hurricanes or tropical storms will affect our operations or the economy in our market area, but such weather events could result in fewer loan originations and greater delinquencies, foreclosures or loan losses. These and other negative effects of future hurricanes or tropical storms may adversely affect our business or results of operations.\nWe are subject to environmental liability risk associated with lending activities or properties we own.\nA significant portion of our loan portfolio is secured by real estate, and we could become subject to environmental liabilities with respect to one or more of these properties, or with respect to properties that we own in operating our business. During the ordinary course of business, we may foreclose on and take title to properties securing defaulted loans. In doing so, there is a risk that hazardous or toxic substances could be found on these properties. If hazardous conditions or toxic substances are found on these properties, we may be liable for remediation costs, as well as for personal injury and property damage, civil fines and criminal penalties regardless of when the hazardous conditions or toxic substances first affected any particular property. Environmental laws may require us to incur substantial expenses to address unknown liabilities and may materially reduce the affected propertys value or limit our ability to use or sell the affected property. In addition, future laws or more stringent interpretations or enforcement policies with respect to existing laws may increase our exposure to environmental liability. Our policies, which require us to perform an environmental review before initiating any foreclosure action on non-residential real property, may not be sufficient to detect all potential environmental hazards. The remediation costs and any other financial liabilities associated with an environmental hazard could have a material adverse effect on us.\nWe are required to transition from the use of the LIBOR interest rate index in the future.\nWe have certain interest rate swap contracts indexed to LIBOR to calculate the interest rate. The LIBOR index will be discontinued for U.S. Dollar settings effective June 30, 2023. The language in our LIBOR-based contracts and financial instruments has developed over time and may have various events that trigger when a successor rate to the designated rate would be selected. If a trigger is satisfied, contracts and financial instruments may give the calculation agent discretion over the substitute index or indices for the calculation of interest rates to be selected. Additionally, since alternative rates are calculated differently, the transition may change our market risk profile, requiring changes to risk and pricing models.\nSocietal responses to climate change could adversely affect our business and performance, including indirectly through impacts on our customers.\nConcerns over the long-term impacts of climate change have led and will continue to lead to governmental efforts around the world to mitigate those impacts. Consumers and businesses also may change their behavior on their own as a result of these concerns. We and our customers will need to respond to new laws and regulations as well as consumer and business preferences resulting from climate change concerns. We and our customers may face cost increases, asset value reductions, operating process changes, and the like. The impact on our customers will likely vary depending on their specific attributes, including reliance on or role in carbon intensive activities. Among the impacts to us could be a drop in demand for our products and services, particularly in certain sectors. In addition, we could face reductions in creditworthiness on the part of some customers or in the value of assets securing loans. Our efforts to take these risks into account in making lending and other decisions, including increasing our business with climate-friendly companies, may not be effective in protecting us from the negative impact of new laws and regulations or changes in consumer or business behavior.\nOur ability to maintain our reputation is critical to the success of our business, and the failure to do so may materially adversely affect our performance.\nOur reputation is one of the most valuable components of our business and is critical to our success. The ability to attract and retain customers, investors, employees and advisors may depend upon external perceptions of the Company. Damage to the Company's reputation could cause significant harm to our business and prospects and may arise from numerous sources, including litigation or regulatory actions, failing to deliver minimum standards of service and quality, compliance failures, unethical behavior and the misconduct of employees, advisors and counterparties. Adverse developments with respect to the financial services industry may also, by association, negatively impact the Company's reputation or result in greater regulatory or legislative scrutiny or litigation against the Company.\nFurthermore, shareholders, customers and other stakeholders have begun to consider how corporations are addressing environmental, social and governance (ESG) issues. Governments, investors, customers and the general public are increasingly focused on ESG practices and disclosures, and views about ESG are diverse and rapidly changing. These shifts in investing priorities may result in adverse effects on the trading price of the Companys common stock if investors determine that the Company has not made sufficient progress on ESG matters. We could also face potential negative ESG-related publicity in traditional media or social media if shareholders or other stakeholders determine that we have not adequately considered or addressed ESG matters. If the Company, or our relationships with certain customers, vendors or suppliers, became the subject of negative publicity, our ability to attract and retain customers and employees, and our financial condition and results of operations, could be adversely impacted. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nWe operate from our main office in Cleveland, Ohio, our 37 full-service branch offices located in Ohio and Florida and our five loan production offices located in Ohio. Our branch offices are located in the Ohio counties of Cuyahoga, Lake, Lorain, Medina and Summit and in the Florida counties of Broward, Collier, Hillsborough, Lee, Palm Beach, Pasco, Pinellas and Sarasota. Our loan production offices are located in the Ohio counties of Franklin, Butler, Delaware and Hamilton. The Company owns the building in which its home office and executive offices are located, and six other office locations. The net book value of our land, premises, equipment and software was $34.5 million at September 30, 2022, a $2.9 million reduction from September 30, 2021, primarily due to depreciation. Item 3. Legal Proceedings\nThe Company and its subsidiaries are subject to various legal actions arising in the normal course of business. In the opinion of management, the resolution of these legal actions is not expected to have a material adverse effect on the Companys consolidated financial condition, results of operation, or statements of cash flows. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is listed and traded on the NASDAQ Global Select Market under the symbol TFSL. As of November 16, 2022, we had 6,221 shareholders of record, which does not include persons or entities holding shares in nominee or street name through brokerage firms.\nThrough September 30, 2010, Third Federal Savings, MHC, waived its right to receive dividends. The waivers complied with regulatory authorizations (in the form of non-objection) obtained by Third Federal Savings, MHC. Any requests for future regulatory authorizations to waive receipts of dividends will be submitted to the FRS. Please refer to the preceding discussion of dividend waivers presented in Part I, Item 1. Business-SUPERVISION AND REGULATION-Holding Company Regulation-Waivers of Dividends by Third Federal Savings, MHC. Regulatory non-objection is subject to periodic regulatory review and no assurances can be given regarding future regulatory non-objection. In addition, interim final rules issued by the FRS in 2011 require that a majority of the mutual holding company's members eligible to vote must approve a dividend waiver by a mutual holding company within 12 months prior to the declaration of the dividend being waived. There can be no assurance that a final rule will not require such a member vote.\nAt a special meeting of members of Third Federal Savings, MHC, the members (depositors and certain loan customers of the Association) voted to approve Third Federal Savings, MHC's proposed waiver of dividends aggregating up to $1.13 per share on the common stock of the Company for the 12 months following the special meeting of members held on July 12, 2022. The members approved the waiver by casting 61% of the eligible votes, with 97% of the votes cast, or 60% of the total eligible votes, in favor of the waiver. Third Federal Savings, MHC is the 81% majority shareholder of the Company.\nFollowing the receipt of the members approval at the July 12, 2022 special meeting, Third Federal Savings, MHC filed a notice with, and subsequently received the non-objection of, the FRB-Cleveland for the proposed dividend waivers.\nIn the table and graph that follow, we have provided summary information regarding the performance of the cumulative total return of our common stock from September 30, 2017 through September 30, 2022, relative to the cumulative total return on stocks included in the S&P U.S. BMI Banks Index, S&P Composite 1500 Thrifts & Mortgage Finance Index and NASDAQ Composite, in each case for the same period. The cumulative return data is presented in dollars, based on starting investments of $100 and assuming the reinvestment of dividends.\nMeasurement Date\nIndex (with base price at 9/30/2017) 9/30/2017 9/30/2018 9/30/2019 9/30/2020 9/30/2021 9/30/2022\nTFS Financial Corporation 100.00 97.76 124.62 107.99 148.21 108.51\nS&P U.S. BMI Banks Index 100.00 108.42 108.77 79.86 145.30 111.62\nS&P Composite 1500 Thrifts & Mortgage Finance Index 100.00 98.18 111.54 80.62 131.86 107.52\nNASDAQ Composite Index 100.00 125.17 125.82 177.36 231.30 170.38\nSource: S&P Global Market Intelligence\nWe did not sell any securities for the fiscal year ended September 30, 2022.\nThe following table summarizes our stock repurchase activity during the three months ended September 30, 2022 and the\nstock repurchase plans approved by our Board of Directors.\nAverage Total Number of Maximum Number\nTotal Number Price Shares Purchased of Shares that May\nof Shares Paid per as Part of Publicly Yet be Purchased\nPeriod Purchased Share Announced Plans (1) Under the Plans\nJuly 1, 2022 through July 31, 2022 25,000 $ 13.59 25,000 5,553,820\nAugust 1, 2022 through August 31, 2022 - - - 5,553,820\nSeptember 1, 2022 through September 30, 2022 - - - 5,553,820\n25,000 $13.59 25,000\n(1) On October 27, 2016, the Company announced that the Board of Directors approved the Company's eighth stock repurchase program, which authorizes the repurchase of up to 10,000,000 shares of the Company's outstanding common stock. Purchases under the program will be on an ongoing basis and subject to the availability of stock, general market conditions, the trading price of the stock, alternative uses of capital, and our financial performance. Repurchased shares will be held as treasury stock and be available for general corporate use. For the fiscal year ended September 30, 2022, stock repurchases totaled 337,259 shares at an average price per share of $14.97. The program has 5,553,820 shares yet to be purchased as of September 30, 2022. The program has no expiration date. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nOur business strategy is to operate as a well-capitalized and profitable financial institution dedicated to providing exceptional personal service to our customers.\nSince being organized in 1938, we grew to become, at the time of our initial public offering of stock in April 2007, the nations largest mutually-owned savings and loan association based on total assets. We credit our success to our continued emphasis on our primary values: Love, Trust, Respect, and a Commitment to Excellence, along with Having Fun. Our values are reflected in the design and pricing of our loan and deposit products, as described below. Our values are further reflected in a long-term revitalization program encompassing the three-mile corridor of the Broadway-Slavic Village neighborhood in Cleveland, Ohio where our main office was established and continues to be located and where the educational programs we have established and/or support are located. We intend to continue to adhere to our primary values and to support our customers and the communities in which we operate, as we pursue our mission to help people achieve the dream of home ownership and financial security while creating value for our shareholders, our customers, our communities and our associates.\nThe following tables present select financial data of the Company for the five most recent fiscal years.\nAt September 30,\n2022 2021 2020 2019 2018\n(In thousands)\nSelected Financial Condition Data:\nTotal assets $ 15,789,879 $ 14,057,450 $ 14,642,221 $ 14,542,356 $ 14,137,331\nCash and cash equivalents 369,564 488,326 498,033 275,143 269,775\nInvestment securities - available for sale 457,908 421,783 453,438 547,864 531,965\nLoans held for sale 9,661 8,848 36,871 3,666 659\nLoans, net 14,257,067 12,509,035 13,103,062 13,195,745 12,871,294\nBank owned life insurance 304,040 297,332 222,919 217,481 212,021\nPrepaid expenses and other assets 95,428 91,586 104,832 87,957 44,344\nDeposits 8,921,017 8,993,605 9,225,554 8,766,384 8,491,583\nBorrowed funds 4,793,221 3,091,815 3,521,745 3,902,981 3,721,699\nShareholders equity 1,844,339 1,732,280 1,671,853 1,696,754 1,758,404\nFor the Years Ended September 30,\n2022 2021 2020 2019 2018\n(In thousands, except per share amounts)\nSelected Operating Data:\nInterest income $ 409,333 $ 389,351 $ 455,298 $ 482,087 $ 443,045\nInterest expense 141,937 157,721 213,030 216,666 162,104\nNet interest income 267,396 231,630 242,268 265,421 280,941\nProvision (release) for credit losses on loans 1,000 (9,000) 3,000 (10,000) (11,000)\nNet interest income after provision (release) for credit losses on loans 266,396 240,630 239,268 275,421 291,941\nNon-interest income 23,804 55,299 53,251 20,464 21,536\nNon-interest expenses 198,146 195,835 192,274 193,673 192,313\nEarnings before income tax 92,054 100,094 100,245 102,212 121,164\nIncome tax expense 17,489 19,087 16,928 21,975 35,757\nNet earnings after income tax expense $ 74,565 $ 81,007 $ 83,317 $ 80,237 $ 85,407\nEarnings per share\nBasic $ 0.26 $ 0.29 $ 0.30 $ 0.29 $ 0.31\nDiluted $ 0.26 $ 0.29 $ 0.29 $ 0.28 $ 0.30\nCash dividends declared per share $ 1.13 $ 1.12 $ 1.11 $ 1.02 $ 0.760\nAt or For The Years Ended September 30,\n2022 2021 2020 2019 2018\nSelected Financial Ratios and Other Data:\nPerformance Ratios:\nReturn on average assets 0.51 % 0.56 % 0.56 % 0.56 % 0.62 %\nReturn on average equity 4.14 % 4.77 % 4.88 % 4.58 % 4.91 %\nInterest rate spread(1) 1.75 % 1.52 % 1.52 % 1.73 % 1.93 %\nNet interest margin(2) 1.88 % 1.66 % 1.69 % 1.92 % 2.08 %\nEfficiency ratio(3) 68.04 % 68.25 % 65.06 % 67.75 % 63.58 %\nNon-interest expense to average total assets 1.34 % 1.35 % 1.29 % 1.36 % 1.39 %\nAverage interest-earning assets to average interest-bearing\nliabilities 112.42 % 111.92 % 111.41 % 112.28 % 112.96 %\nAsset Quality Ratios:\nNon-performing assets as a percent of total assets 0.23 % 0.32 % 0.37 % 0.50 % 0.57 %\nNon-accruing loans as a percent of total loans 0.25 % 0.35 % 0.41 % 0.54 % 0.60 %\nAllowance for credit losses on loans as a percent of\nnon-accruing loans 204.73 % 145.96 % 87.95 % 54.60 % 54.56 %\nAllowance for credit losses on loans as a percent of total loans 0.51 % 0.51 % 0.36 % 0.29 % 0.33 %\nCapital Ratios:\nAssociation\nTotal capital to risk-weighted assets(4) 18.84 % 21.00 % 19.96 % 19.56 % 20.47 %\nTier 1 (leverage) capital to net average assets(4) 10.33 % 11.15 % 10.39 % 10.54 % 10.87 %\nTier 1 capital to risk-weighted assets(4) 18.25 % 20.43 % 19.37 % 19.07 % 19.91 %\nCommon equity tier 1 capital to risk-weighted assets(4) 18.25 % 20.43 % 19.37 % 19.07 % 19.91 %\nTFS Financial Corporation\nTotal capital to risk-weighted assets(4) 21.18 % 23.75 % 22.71 % 22.22 % 22.94 %\nTier 1 (leverage) capital to net average assets(4) 11.66 % 12.65 % 11.88 % 12.05 % 12.25 %\nTier 1 capital to risk-weighted assets(4) 20.59 % 23.18 % 22.13 % 21.73 % 22.39 %\nCommon equity tier 1 capital to risk-weighted assets(4) 20.59 % 23.18 % 22.13 % 21.73 % 22.39 %\nAverage equity to average total assets 12.23 % 11.72 % 11.50 % 12.30 % 12.56 %\nOther Data:\nAssociation:\nNumber of full service offices 37 37 37 37 38\nLoan production offices 5 7 7 8 8\n______________________\n(1)Represents the difference between the weighted-average yield on interest-earning assets and the weighted-average cost of interest-bearing liabilities for the year.\n(2)The net interest margin represents net interest income as a percent of average interest-earning assets for the year.\n(3)The efficiency ratio represents non-interest expense divided by the sum of net interest income and non-interest income.\n(4)In April 2020, the Simplifications to the Capital Rule (\"Rule\") was adopted, which simplified certain aspects of the capital rule under Basel III. The impact of the Rule was not material to the regulatory capital ratios.\nManagement believes that the following matters are those most critical to our success: (1) controlling our interest rate risk exposure; (2) monitoring and limiting our credit risk; (3) maintaining access to adequate liquidity and diverse funding sources to support our growth; and (4) monitoring and controlling our operating expenses.\nControlling Our Interest Rate Risk Exposure. Historically, our greatest risk has been our exposure to changes in interest rates. When we hold longer-term, fixed-rate assets, funded by liabilities with shorter-term re-pricing characteristics, we are exposed to potentially adverse impacts from changing interest rates, and most notably rising interest rates. Generally, and particularly over extended periods of time that encompass full economic cycles, interest rates associated with longer-term\nassets, like fixed-rate mortgages, have been higher than interest rates associated with shorter-term funding sources, like deposits. This difference has been an important component of our net interest income and is fundamental to our operations. We manage the risk of holding longer-term, fixed-rate mortgage assets primarily by maintaining regulatory capital in excess of levels required to be well capitalized, by promoting adjustable-rate loans and shorter-term fixed-rate loans, by marketing home equity lines of credit, which carry an adjustable rate of interest indexed to the prime rate, by opportunistically extending the duration of our funding sources and selectively selling a portion of our long-term, fixed-rate mortgage loans in the secondary market.\nLevels of Regulatory Capital\nFor most insured depositories, customer and community confidence are critical to their ability to maintain access to adequate liquidity and to conduct business in an orderly manner. We believe that a well capitalized institution is one of the most important factors in nurturing customer and community confidence. At September 30, 2022, the Companys Tier 1 (leverage) capital totaled $1.82 billion, or 11.66% of net average assets and 20.59% of risk-weighted assets, while the Associations Tier 1 (leverage) capital totaled $1.61 billion, or 10.33% of net average assets and 18.25% of risk-weighted assets. Each of these measures was more than twice the requirements currently in effect for the Association for designation as well capitalized under regulatory prompt corrective action provisions, which set minimum levels of 5.00% of net average assets and 8.00% of risk-weighted assets. Refer to the Liquidity and Capital Resources section of this Item 7 for additional discussion regarding regulatory capital requirements.\nPromotion of Adjustable-Rate Loans and Shorter-Term, Fixed-Rate Loans\nWe market an adjustable-rate mortgage loan that provides us with improved interest rate risk characteristics when compared to a 30-year, fixed-rate mortgage loan. Our Smart Rate adjustable-rate mortgage offers borrowers an interest rate lower than that of a 30-year, fixed-rate loan. The interest rate of the Smart Rate mortgage is locked for three or five years then resets annually. The Smart Rate mortgage contains a feature to re-lock the rate an unlimited number of times at our then-current interest rate and fee schedule, for another three or five years (which must be the same as the original lock period) without having to complete a full refinance transaction. Re-lock eligibility is subject to a satisfactory payment performance history by the borrower (current at the time of re-lock, and no foreclosures or bankruptcies since the Smart Rate application was taken). In addition to a satisfactory payment history, re-lock eligibility requires that the property continues to be the borrowers primary residence. The loan term cannot be extended in connection with a re-lock nor can new funds be advanced. All interest rate caps and floors remain as originated.\nWe also offer a ten-year, fully amortizing fixed-rate, first mortgage loan. The ten-year, fixed-rate loan has a more desirable interest rate risk profile when compared to loans with fixed-rate terms of 15 to 30 years and can help to more effectively manage interest rate risk exposure, yet provides our borrowers with the certainty of a fixed interest rate throughout the life of the obligation.\nThe following tables set forth our first mortgage loan production and balances segregated by loan structure at origination.\nFor the Years Ended September 30,\n2022 2021\nAmount Percent Amount Percent\nFirst Mortgage Loan Originations: (Dollars in thousands)\nARM (all Smart Rate) production $ 1,029,156 28.2 % $ 1,089,410 30.0 %\nFixed-rate production:\nTerms less than or equal to 10 years 470,806 12.9 540,723 14.9\nTerms greater than 10 years 2,146,021 58.9 1,997,694 55.1\nTotal fixed-rate production 2,616,827 71.8 2,538,417 70.0\nTotal First Mortgage Loan Originations: $ 3,645,983 100.0 % $ 3,627,827 100.0 %\nSeptember 30, 2022 September 30, 2021\nAmount Percent Amount Percent\nBalances of First Mortgage Loans Held For Investment: (Dollars in thousands)\nARM (primarily Smart Rate) Loans $ 4,668,089 40.3 % $ 4,646,760 45.2 %\nFixed-rate Loans:\nTerms less than or equal to 10 years 1,350,436 11.6 1,309,407 12.7\nTerms greater than 10 years 5,574,589 48.1 4,322,931 42.1\nTotal fixed-rate loans 6,925,025 59.7 5,632,338 54.8\nTotal First Mortgage Loans Held For Investment: $ 11,593,114 100.0 % $ 10,279,098 100.0 %\nThe following table sets forth the balances as of September 30, 2022 for all ARM loans segregated by the next scheduled interest rate reset date.\nCurrent Balance of ARM Loans Scheduled for Interest Rate Reset\nDuring the Fiscal Years Ending September 30, (in thousands)\n2023 $207,932\n2024 354,614\n2025 708,993\n2026 1,525,895\n2027 1,770,027\n2028 100,628\nTotal $4,668,089\nAt September 30, 2022 and September 30, 2021, mortgage loans held for sale, all of which were long-term, fixed-rate first mortgage loans and all of which were held for sale to Fannie Mae, totaled $9.7 million and $8.8 million, respectively.\nLoan Portfolio Yield\nThe following tables set forth the balance and interest yield as of September 30, 2022 for the portfolio of loans held for investment, by type of loan, structure and geographic location.\nSeptember 30, 2022\nBalance Percent Yield\n(Dollars in thousands)\nTotal Loans:\nFixed Rate\nTerms less than or equal to 10 years $ 1,350,436 9.4 % 2.62 %\nTerms greater than 10 years 5,574,589 38.8 % 3.51 %\nTotal Fixed-Rate loans 6,925,025 48.2 % 3.34 %\nARMs 4,668,089 32.5 % 2.75 %\nHome Equity Loans and Lines of Credit 2,633,878 18.4 % 5.30 %\nConstruction and Other loans 125,022 0.9 % 3.32 %\nTotal Loans Receivable $ 14,352,014 100.0 % 3.51 %\nSeptember 30, 2022\nBalance Fixed Rate Balance Percent Yield\n(Dollars in thousands)\nResidential Mortgage Loans\nOhio $ 6,483,740 $ 4,932,438 45.2 % 3.30 %\nFlorida 2,123,113 1,027,910 14.8 3.00 %\nOther 2,986,261 964,677 20.7 2.73 %\nTotal Residential Mortgage Loans 11,593,114 6,925,025 80.7 3.11 %\nHome Equity Loans and Lines of Credit\nOhio 706,641 60,228 5.0 5.30 %\nFlorida 537,724 39,968 3.7 5.25 %\nCalifornia 432,540 27,708 3.0 5.25 %\nOther 956,973 22,832 6.7 5.35 %\nTotal Home Equity Loans and Lines of Credit 2,633,878 150,736 18.4 5.30 %\nConstruction and Other loans 125,022 125,022 0.9 3.32 %\nTotal Loans Receivable $ 14,352,014 $ 7,200,783 100.0 % 3.51 %\nMarketing of Home Equity Lines of Credit\nWe actively market home equity lines of credit, which carry an adjustable rate of interest indexed to the prime rate which provides interest rate sensitivity to that portion of our assets and is a meaningful strategy to manage our interest rate risk profile. We plan to enhance our ability to grow the home equity line of credit portfolio by utilizing partners to attract more home equity line of credit customers. At September 30, 2022, the principal balance of home equity lines of credit totaled $2.37 billion. Our home equity lending is discussed in the preceding Lending Activities section of Item 1. Business in Part I. THIRD FEDERAL SAVINGS AND LOAN ASSOCIATION OF CLEVELAND.\nExtending the Duration of Funding Sources\nAs a complement to our strategies to shorten the duration of our interest earning assets, as described above, we also seek to lengthen the duration of our interest bearing funding sources. These efforts include monitoring the relative costs of alternative funding sources such as retail deposits, brokered deposits, longer-term (e.g. four to six years) fixed rate advances from the FHLB of Cincinnati, and shorter-term (e.g. three months) advances from the FHLB of Cincinnati, the durations of which are extended by correlated interest rate exchange contracts. Each funding alternative is monitored and evaluated based on\nits effective interest payment rate, options exercisable by the creditor (early withdrawal, right to call, etc.), and collateral requirements. The interest payment rate is a function of market influences that are specific to the nuances and market competitiveness/breadth of each funding source. Generally, early withdrawal options are available to our retail CD customers but not to holders of brokered CDs; issuer call options are not provided on our advances from the FHLB of Cincinnati; and we are not subject to early termination options with respect to our interest rate exchange contracts. Additionally, collateral pledges are not provided with respect to our retail CDs or our brokered CDs; but are required for our advances from the FHLB of Cincinnati as well as for our interest rate exchange contracts. Our funding sources are discussed in the Sources of Funds section of Item 1. Business in Part I. THIRD FEDERAL SAVINGS AND LOAN ASSOCIATION OF CLEVELAND.\nOther Interest Rate Risk Management Tools\nWe also manage interest rate risk by selectively selling a portion of our long-term, fixed-rate mortgage loans in the secondary market. At September 30, 2022, we serviced $2.05 billion of loans for others. In deciding whether to sell loans to manage interest rate risk, we also consider the level of gains to be recognized in comparison to the impact to our net interest income. We began expanding our ability to sell certain fixed rate loans to Fannie Mae in fiscal 2022 and beyond, through the use of more traditional mortgage banking activities, including risk-based pricing and loan-level pricing adjustments. This concept is being tested in markets outside of Ohio and Florida, and some additional startup and marketing costs have been incurred, but have not significantly impacted our financial results. We can also manage interest rate risk by selling non-Fannie Mae compliant mortgage loans to private investors, although those transactions are dependent upon favorable market conditions, including motivated private investors, and involve more complicated negotiations and longer settlement timelines. Loan sales are discussed later in this Part II, Item 7. under the heading Liquidity and Capital Resources, and in Part II, Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nGeneral. The majority of our assets and liabilities are monetary in nature. Consequently, our most significant form of market risk has historically been interest rate risk. In general, our assets, consisting primarily of mortgage loans, have longer maturities than our liabilities, consisting primarily of deposits and advances from the FHLB of Cincinnati. As a result, a fundamental component of our business strategy is to manage interest rate risk and limit the exposure of our net interest income to changes in market interest rates. Accordingly, our Board of Directors has established risk parameter limits deemed appropriate given our business strategy, operating environment, capital, liquidity and performance objectives. Additionally, our Board of Directors has authorized the formation of an Asset/Liability Management Committee comprised of key operating personnel, which is responsible for managing this risk in a manner that is consistent with the guidelines and risk limits approved by the Board of Directors. Further, the Board has established the Directors Risk Committee, which, among other responsibilities, conducts regular oversight and review of the guidelines, policies and deliberations of the Asset/Liability Management Committee. We have sought to manage our interest rate risk in order to control the exposure of our earnings and capital to changes in interest rates. As part of our ongoing asset-liability management, we use the following strategies to manage our interest rate risk:\n(i)marketing adjustable-rate and shorter-maturity (10-year, fixed-rate mortgage) loan products;\n(ii)lengthening the weighted average remaining term of major funding sources, primarily by offering attractive interest rates on deposit products, particularly longer-term certificates of deposit, and through the use of longer-term advances from the FHLB of Cincinnati (or shorter-term advances converted to longer-term durations via the use of interest rate exchange contracts that qualify as cash flow hedges) and longer-term brokered certificates of deposit;\n(iii)investing in shorter- to medium-term investments and mortgage-backed securities;\n(iv)maintaining the levels of capital in excess of what is required for \"well capitalized\" designation; and\n(v)securitizing and/or selling long-term, fixed-rate residential real estate mortgage loans.\nDuring the fiscal year ended September 30, 2022, $128.1 million of agency-compliant, long-term, fixed-rate mortgage loans were sold to Fannie Mae on a servicing retained basis. At September 30, 2022, $9.7 million of agency-compliant, long-term, fixed-rate residential first mortgage loans were classified as \"held for sale\". Of the agency compliant loan sales during the fiscal year ended September 30, 2022, $28.8 million was comprised of long-term, (15 to 30 years), fixed-rate first mortgage loans which were sold under Fannie Mae's Home Ready program; and $99.3 million was comprised of long-term (15 to 30 years), fixed-rate first mortgage refinance loans which were sold to Fannie Mae, as described in the next paragraph.\nFirst mortgage loans (primarily fixed-rate, mortgage refinances with terms of 15 years or more, and Home Ready) are generally originated under Fannie Mae procedures and are eligible for sale to Fannie Mae either as whole loans or within mortgage-backed securities. We expect that certain loan types (i.e. our Smart Rate adjustable-rate loans, home purchase fixed-rate loans and 10-year fixed-rate loans) will continue to be originated under our legacy procedures, which are not eligible for sale to Fannie Mae. For loans that are not originated under Fannie Mae procedures, the Associations ability to reduce interest rate risk via loan sales is limited to those loans that have established payment histories, strong borrower credit profiles and are supported by adequate collateral values that meet the requirements of the FHLB's Mortgage Purchase Program or of private third-party investors.\nThe Association actively markets home equity lines of credit, an adjustable-rate mortgage loan product and a 10-year fixed-rate mortgage loan product. Each of these products provides us with improved interest rate risk characteristics when compared to longer-term, fixed-rate mortgage loans. Shortening the average maturity of our interest-earning assets by increasing our investments in shorter-term loans and investments, as well as loans and investments with variable rates of interest, helps to better match the maturities and interest rates of our assets and liabilities, thereby reducing the exposure of our net interest income to changes in market interest rates.\nThe Association evaluates funding source alternatives as it seeks to extend its liability duration. Extended duration funding sources that are currently considered include: retail certificates of deposit (which, subject to a fee, generally provide depositors with an early withdrawal option, but do not require pledged collateral); brokered certificates of deposit (which generally do not provide an early withdrawal option and do not require collateral pledges); collateralized borrowings which are not subject to creditor call options (generally advances from the FHLB of Cincinnati); and interest rate exchange contracts (\"swaps\") which are subject to collateral pledges and which require specific structural features to qualify for hedge accounting treatment (hedge accounting treatment directs that periodic mark-to-market adjustments be recorded in other comprehensive income (loss) in the equity section of the balance sheet rather than being included in operating results of the income statement). The Association's intent is that any swap to which it may be a party will qualify for hedge accounting treatment. The Association attempts to be opportunistic in the timing of its funding duration deliberations and when evaluating alternative funding sources, compares effective interest rates, early withdrawal/call options and collateral requirements.\nThe Association is a party to interest rate swap agreements. Each of the Association's swap agreements is registered on the Chicago Mercantile Exchange and involves the exchange of interest payment amounts based on a notional principal balance. No exchange of principal amounts occurs and the notional principal amount does not appear on our balance sheet. The Association uses swaps to extend the duration of its funding sources. In each of the Association's agreements, interest paid is based on a fixed rate of interest throughout the term of each agreement while interest received is based on an interest rate that resets at a specified interval (generally three months) throughout the term of each agreement. On the initiation date of the swap, the agreed upon exchange interest rates reflect market conditions at that point in time. Swaps generally require counterparty collateral pledges that ensure the counterparties' ability to comply with the conditions of the agreement. The notional amount of the Association's swap portfolio at September 30, 2022 was $1.55 billion. The swap portfolio's weighted average fixed pay rate was 1.88% and the weighted average remaining term was 2.7 years. Concurrent with the execution of each swap, the Association entered into a short-term borrowing from the FHLB of Cincinnati in an amount equal to the notional amount of the swap and with interest rate resets aligned with the reset interval of the swap. Each individual swap agreement has been designated as a cash flow hedge of interest rate risk associated with the Company's variable rate borrowings from the FHLB of Cincinnati.\nEconomic Value of Equity. Using customized modeling software, the Association prepares periodic estimates of the amounts by which the net present value of its cash flows from assets, liabilities and off-balance sheet items (the institutions economic value of equity or EVE) would change in the event of a range of assumed changes in market interest rates. The simulation model uses a discounted cash flow analysis and an option-based pricing approach in measuring the interest rate sensitivity of EVE. The model estimates the economic value of each type of asset, liability and off-balance sheet contract under the assumption that instantaneous changes (measured in basis points) occur at all maturities along the United States Treasury yield curve and other relevant market interest rates. A basis point equals one, one-hundredth of one percent, and 100 basis points equals one percent. An increase in interest rates from 2% to 3% would mean, for example, a 100 basis point increase in the Change in Interest Rates column below. The model is tailored specifically to our organization, which, we believe, improves its predictive accuracy. The following table presents the estimated changes in the Associations EVE at September 30,\n2022 that would result from the indicated instantaneous changes in the United States Treasury yield curve and other relevant market interest rates. Computations of prospective effects of hypothetical interest rate changes are based on numerous assumptions, including relative levels of market interest rates, loan prepayments and deposit decay, and should not be relied upon as indicative of actual results.\nChange in\nInterest Rates\n(basis points) (1) Estimated\nEVE (2) Estimated Increase\n(Decrease) in EVE EVE as a Percentage\nof Present Value of\nAssets (3)\nEVE\nRatio (4) Increase\n(Decrease)\n(basis points)\nAmount Percent\n(Dollars in thousands)\n+300 $ 698,469 $ (629,633) (47.41) % 5.18 % (390)\n+200 930,754 (397,348) (29.92) % 6.71 % (237)\n+100 1,141,216 (186,886) (14.07) % 8.01 % (107)\n0 1,328,102 - - % 9.08 % -\n-100 1,479,861 151,759 11.43 % 9.86 % 78\n_________________\n(1)Assumes an instantaneous uniform change in interest rates at all maturities.\n(2)EVE is the discounted present value of expected cash flows from assets, liabilities and off-balance sheet contracts.\n(3)Present value of assets represents the discounted present value of incoming cash flows on interest-earning assets.\n(4)EVE Ratio represents EVE divided by the present value of assets.\nThe table above indicates that at September 30, 2022, in the event of an increase of 200 basis points in all interest rates, the Association would experience a 29.92% decrease in EVE. In the event of a 100 basis point decrease in interest rates, the Association would experience a 11.43% increase in EVE.\nThe following table is based on the calculations contained in the previous table, and sets forth the change in the EVE at a +200 basis point rate of shock at September 30, 2022, with comparative information as of September 30, 2021. By regulation, the Association must measure and manage its interest rate risk for interest rate shocks relative to established risk tolerances in EVE.\nAt September 30,\nRisk Measure (+200 bp Rate Shock) 2022 2021\nPre-Shock EVE Ratio 9.08 % 12.97 %\nPost-Shock EVE Ratio 6.71 % 12.46 %\nSensitivity Measure in basis points (237) (51)\nPercentage Change in EVE Ratio (29.92) % (8.21) %\nCertain shortcomings are inherent in the methodologies used in measuring interest rate risk through changes in EVE. Modeling changes in EVE require making certain assumptions that may or may not reflect the manner in which actual yields and costs respond to changes in market interest rates. In this regard, the EVE tables presented above assume:\nno new growth or business volumes;\nthat the composition of our interest-sensitive assets and liabilities existing at the beginning of a period remains constant over the period being measured, except for reductions to reflect mortgage loan principal repayments along with modeled prepayments and defaults; and\nthat a particular change in interest rates is reflected uniformly across the yield curve regardless of the duration or repricing of specific assets and liabilities.\nAccordingly, although the EVE table provides an indication of our interest rate risk exposure as of the indicated dates, such measurements are not intended to and do not provide a precise forecast of the effect of changes in market interest rates on our EVE and will differ from actual results. In addition to our core business activities, which primarily sought to originate Smart Rate (adjustable), home equity lines of credit (adjustable) and 10-year fixed-rate loans funded by borrowings from the FHLB and intermediate term CDs (including brokered CDs) and which are intended to have a favorable impact on our IRR profile, the net impact of several other items resulted in the 21.70% deterioration in the Pre-Shock EVE Ratio (base valuation) measure at September 30, 2022, when compared to the measure at September 30, 2021. Factors contributing to this decline\nincluded changes in market rates, capital actions by the Association, and changes due to business activity. Negatively impacting the Percentage Change in EVE was a $56.0 million cash dividend that the Association paid to the Company in December 2021. Because of its intercompany nature, this payment had no impact on the Company's capital position, or the Company's overall IRR profile, but reduced the Association's regulatory capital and regulatory capital ratios and negatively impacted the Association's Percentage Change in EVE. While our core business activities, as described at the beginning of this paragraph, are generally intended to have a positive impact on our IRR profile, the actual impact is determined by a number of factors, including the pace of mortgage asset additions to our balance sheet (including consideration of outstanding commitments to originate those assets), in comparison to the pace of the addition of duration extending funding sources. The IRR simulation results presented above were in line with management's expectations and were within the risk limits established by our Board of Directors.\nOur simulation model possesses random patterning capabilities and accommodates extensive regression analytics applicable to the prepayment and decay profiles of our borrower and depositor portfolios. The model facilitates the generation of alternative modeling scenarios and provides us with timely decision making data that is integral to our IRR management processes. Modeling our IRR profile and measuring our IRR exposure are processes that are subject to continuous revision, refinement, modification, enhancement, back testing and validation. We continually evaluate, challenge and update the methodology and assumptions used in our IRR model, including behavioral equations that have been derived based on third-party studies of our customers' historical performance patterns. Changes to the methodology and/or assumptions used in the model will result in reported IRR profiles and reported IRR exposures that will be different, and perhaps significantly, from the results reported above.\nEarnings at Risk. In addition to EVE calculations, we use our simulation model to analyze the sensitivity of our net interest income to changes in interest rates (the institutions EaR). Net interest income is the difference between the interest income that we earn on our interest-earning assets, such as loans and securities, and the interest that we pay on our interest-bearing liabilities, such as deposits and borrowings. In our model, we estimate what our net interest income would be for prospective 12 and 24 month periods using customized (based on our portfolio characteristics) assumptions with respect to loan prepayment rates, default rates and deposit decay rates, and the implied forward yield curve as of the market date for assumptions as to projected interest rates. We then calculate what the estimated net interest income would be for the same period under numerous interest rate scenarios. The simulation process is subject to continual enhancement, modification, refinement and adaptation in order that it might most accurately reflect our current circumstances, factors and expectations. As of September 30, 2022, we estimated that our EaR for the 12 months ending September 30, 2023 would decrease by 0.29% in the event that market interest rates used in the simulation were adjusted in equal monthly amounts (termed a \"ramped\" format) during the 12 month measurement period to an aggregate increase in 200 basis points. The Association uses the \"ramped\" assumption in preparing the EaR simulation estimates for use in its public disclosures. In addition to conforming to predominate industry practice, the Association also believes that the ramped assumption provides a more probable/plausible scenario for net interest income simulations than instantaneous shocks which provide a theoretical analysis but a much less credible economic scenario. The Association continues to calculate instantaneous scenarios, and as of September 30, 2022, we estimated that our EaR for the 12 months ending September 30, 2023, would decrease by 15.06% in the event of an instantaneous 200 basis point increase in market interest rates.\nCertain shortcomings are also inherent in the methodologies used in determining interest rate risk through changes in EaR. Modeling changes in EaR require making certain assumptions that may or may not reflect the manner in which actual yields and costs respond to changes in market interest rates. In this regard, the interest rate risk information presented above assumes that a particular change in interest rates is reflected uniformly across the yield curve regardless of the duration or repricing of specific assets and liabilities. Accordingly, although interest rate risk calculations provide an indication of our interest rate risk exposure at a particular point in time, such measurements are not intended to and do not provide a precise forecast of the effect of changes in market interest rates on our net interest income and will differ from actual results. In addition to the preparation of computations as described above, we also formulate simulations based on a variety of non-linear changes in interest rates and a variety of non-constant balance sheet composition scenarios.\nOther Considerations. The EVE and EaR analyses are similar in that they both start with the same month end balance sheet amounts, weighted average coupon and maturity. The underlying prepayment, decay and default assumptions are also the same and they both start with the same month end \"markets\" (Treasury and LIBOR yield curves, etc.). From that similar starting point, the models follow divergent paths. EVE is a stochastic model using 150 different interest rate paths to compute market value at the account level for each of the categories on the balance sheet whereas EaR uses the implied forward curve to compute interest income/expense at the account level for each of the categories on the balance sheet.\nEVE is considered as a point in time calculation with a \"liquidation\" view of the Association where all the cash flows (including interest, principal and prepayments) are modeled and discounted using discount factors derived from the current market yield curves. It provides a long term view and helps to define changes in equity and duration as a result of changes in\ninterest rates. On the other hand, EaR is based on balance sheet projections going one year and two years forward and assumes new business volume and pricing to calculate net interest income under different interest rate environments. EaR is calculated to determine the sensitivity of net interest income under different interest rate scenarios. With each of these models, specific policy limits have been established that are compared with the actual month end results. These limits have been approved by the Association's Board of Directors and are used as benchmarks to evaluate and moderate interest rate risk. In the event that there is a breach of policy limits that extends beyond two consecutive quarter end measurement periods, management is responsible for taking such action, similar to those described under the preceding heading of General, as may be necessary in order to return the Association's interest rate risk profile to a position that is in compliance with the policy. At September 30, 2022 the IRR profile as disclosed above was within our internal limits. Item 8. Financial Statements and Supplementary Data\nThe Financial Statements are included in Part IV, Item 15 of this Form 10-K. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable. Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nUnder the supervision of and with the participation of the Companys management, including our principal executive officer and principal financial officer, we have evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act) as of the end of the period covered by this report. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Act is accumulated and communicated to the issuers management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. Based upon that evaluation, our principal executive officer and principal financial officer concluded that, as of the end of the period covered by this report, our disclosure controls and procedures were effective to ensure that information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms.\nChanges in Internal Control Over Financial Reporting\nNo change in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) occurred during the most recently completed fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nManagements Report Regarding Internal Control Over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting as such terms are defined in Rule 13a-15(f) of the Exchange Act of 1934. Our system of internal controls is designed to provide reasonable assurance that the financial statements that we provide to the public are fairly presented.\nOur internal control over financial reporting includes policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect transactions and dispositions of assets, (ii) provide reasonable assurances that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America and that receipts and expenditures are being made only in accordance with authorizations of management and the directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on our financial statements.\nAll internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Accordingly, absolute assurance cannot be provided that the effectiveness of the internal control systems may not become inadequate in future periods because of changes in conditions, or because the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of September 30, 2022. In making this assessment, the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework (2013) was utilized. Management concluded that the Company's internal control over financial reporting was effective as of September 30, 2022, based on those criteria.\nThe effectiveness of the Company's internal control over financial reporting as of September 30, 2022 has been audited by Deloitte & Touche LLP, an independent registered public accounting firm, as stated in their report which appears therein.\nThe Sarbanes-Oxley Act Section 302 Certifications have been filed as Exhibit 31.1 and Exhibit 31.2 to this Annual Report on Form 10-K.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of TFS Financial Corporation\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of TFS Financial Corporation and subsidiaries (the Company) as of September 30, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended September 30, 2022, of the Company and our report dated November 22, 2022, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report Regarding Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nCleveland, Ohio\nNovember 22, 2022 Item 9B. Other Information\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nIncorporated by reference from the Notice of Annual Meeting and Proxy Statement for the 2023 Annual Meeting of Shareholders (the Proxy Statement) sections entitled Proposal One: Election of Directors, Executive Compensation, Delinquent Section 16(a) Reports and Corporate Governance. Such information will be filed with the SEC no later than 120 days after the end of the fiscal year covered by this report.\nThe table below sets forth information, as of September 30, 2022, regarding our executive officers other than Mr. Stefanski and Ms. Weil.\nName Title Age\nKathleen (Kitty) M. Danckers Chief Risk Officer 60\nRussell C. Holmes Chief Retail Officer, the Association 59\nSusanne N. Miller Chief Accounting Officer 57\nTimothy W. Mulhern Chief Financial Officer 56\nAndrew J. Rubino Chief Information Officer, the Association 47\nBradley T. Stefanski Chief Strategy Officer, the Association 34\nGavin B. Stefanski Chief Lending Officer, the Association 34\nCathy W. Zbanek Chief Synergy Officer, the Association 49\nOn March 28, 2022, Bradley T. Stefanski was appointed as Chief Strategy Officer of the Association and Gavin B. Stefanski was appointed Chief Lending Officer of the Association. Paul J. Huml retired from his position as Chief Financial Officer of the Company, effective January 14, 2022. In connection with his retirement, the Board of Directors appointed Mr. Timothy W. Mulhern, who was a manager of Finance for the Association, to the position of Chief Financial Officer of the Company. Ben S. Stefanski III resigned from the Board of Directors of the Association and the Company and from his position as Chief Marketing Officer of the Association in January 2022. The executive officers of the Company and the Association are elected annually and hold office until their respective successors are elected or until death, resignation, retirement or removal by the Board of Directors.\nThe Business Background of Our Executive Officers\nThe business experience for the past five years of each of our executive officers other than Mr. Stefanski and Ms. Weil is set forth below. Unless otherwise indicated, executive officers have held their positions for the past five years.\nKathleen (Kitty) M. Danckers has been with the Association since 1997, and was named Chief Risk Officer in June 2020. During her time with the Association, Ms. Danckers has served in various management roles including as a Regional Manager of Retail Operations, Manager of Information Services and Operations Support, and continues to serve as the Chief Information Security Officer. Ms. Danckers holds a BA in Computer Science, Mathematics and German from St. Catherine University. Ms. Danckers is a Fulbright Scholar.\nRussell C. Holmes has been with the Association since 2013 in retail delivery management and was named Chief Retail Officer in 2020. He most recently served as Ohio regional manager, managing all branch and loan production offices in the state. With 35 years in the banking business, Mr. Holmes joined Third Federal from Key Bank where he served as SVP District Retail Leader for Eastern Ohio. He holds a BBA in Business Administration from the University of Akron, and received a Distinguished Business Alumni Award in 2009, and a Distinguished Alumni Award from the Universitys multicultural department in 2013.\nSusanne N. Miller joined the Association in 1998 and was appointed Chief Accounting Officer in 2020. During her time with the Association, Ms. Miller has held various retail and accounting roles, and served on company-wide strategic project teams. Since 2007, she has worked as a manager in the Accounting Department, overseeing procedure implementation, corporate tax reporting and financial statement preparation. Ms. Miller holds a BS in Accounting from the University of Akron.\nTimothy W. Mulhern was named the Chief Financial Officer in January 2022. Mr. Mulhern joined the Association in 2003 as a project manager where he led key strategic business initiatives including a state loan expansion project, and IT projects to replace the companys front-end servicing application, and implementation of an updated loan origination system. Mr. Mulhern moved to IT management, then to operations where he managed various departments including Loan Servicing, Default Servicing and Deposit Operations. He was named the Chief Credit Officer in August 2018, and Director of Internal Audit in June 2019, where he earned his CIA credentials. Mr. Mulhern joined the Finance Department in February 2021. He holds a Bachelors Degree in Accounting from John Carroll University and an MBA from the Weatherhead School of Management at Case Western Reserve University. Prior to joining Third Federal, Mr. Mulhern was in public accounting with Coopers & Lybrand where he earned his CPA credentials (no longer active), and more than a decade as a small business owner.\nAndrew J. Rubino has been with the Association since 2000, joining the company as a business analyst. He was named Chief Marketing Officer in 2020 and served in that role until being named Chief Information Officer on September 30, 2021. Mr. Rubino has held a variety of leadership positions throughout the company, including manager of loan production, customer service, internet services, and operations support. Additionally, he served as Information Security Officer. Mr. Rubino joined the marketing department in 2016, presiding over strategic initiatives and continued expansion of service areas and product offerings. He holds both a BS in Management Information Systems and an MBA from the University of Akron.\nBradley T. Stefanski has been with the Association since 2014, and was named Chief Strategy Officer in March 2022. He began his career at Third Federal in the Risk Management Department, working on the development of the companys Market Risk Management Program, including modeling and testing; before moving to Loan Production and the branch system, where he spent four years in roles in Underwriting, retail management, and Operations Support project development. Mr. Stefanski then joined the Finance Department in 2021 to help drive strategic initiatives. He holds a BA in Sociology and Economics from Colgate University.\nGavin B. Stefanski joined the Association in 2018 in the Management Training Program, supporting the companys branch system in Southern and Northeast Ohio. Mr. Stefanski was named Underwriting Manager in 2019, became Loan Production Manager in 2021, and was named Chief Lending Officer in March 2022. Prior to Third Federal, he managed multi-billion dollar and strategic clients for ODW Logistics, a national supply chain solutions company in Hamilton, Ohio, where he was responsible for developing and maintaining customized total freight management solutions driving high revenue growth for ODW. Mr. Stefanski holds a BS in Business from the Farmer School of Business at Miami University.\nCathy W. Zbanek joined the Association in 2001 and was named the Chief Marketing Officer in 2013 and the Chief Synergy Officer in 2020, and also serves as the Human Resources Officer for the Association. Prior to her current role, she directed several key strategic business projects as well as systems design and development. She also managed several departments, including Customer Service. Before joining the Association, Ms. Zbanek served as a senior consultant with Waterstone Consulting, working in their Management Consulting Group. Her experience also includes working with the consulting group, Price Waterhouse Coopers.\nThe Company has adopted a policy statement entitled CODE OF ETHICS FOR SENIOR FINANCIAL OFFICERS that applies to our chief executive officer and our senior financial officers. A copy of the CODE OF ETHICS FOR SENIOR FINANCIAL OFFICERS is available on our website, www.thirdfederal.com. Item 11. Executive Compensation\nIncorporated by reference from the sections of the Proxy Statement entitled Executive Compensation, Report of the Compensation Committee, and Director Compensation. Such information will be filed with the SEC no later than 120 days after the end of the fiscal year covered by this report. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nIncorporated by reference from the section of the Proxy Statement entitled Security Ownership of Certain Beneficial Owners and Management. Such information will be filed with the SEC no later than 120 days after the end of the fiscal year covered by this report.\nThe Companys only equity compensation program that was not approved by shareholders is its employee stock ownership plan, which was established in conjunction with our initial stock offering completed in 2007.\nThe following table provides information as of September 30, 2022 regarding our Amended and Restated 2008 Equity Incentive Plan that was approved by shareholders on February 22, 2018. The original plan was approved by shareholders on May 29, 2008.\nPlan Category Number of Shares to be\nIssued Upon Exercise of\nOutstanding Options,\nRights and Warrants Weighted-Average\nExercise Price of\nOutstanding Options,\nRights and Warrants Number of Shares\nRemaining Available\nfor Future Issuance\nUnder the Plan\nEquity Compensation Plans\nApproved by Stockholders 3,789 $ 9.43 (1) 7,418,782\nEquity Compensation Plans\nNot Approved by Stockholders N/A N/A N/A\nTotal 3,789 $ 9.43 (1) 7,418,782\n______________________\n(1)Weighted-Average Exercise Price of Outstanding Options, Rights and Warrants is calculated using 1,257,898 shares of restricted stock awards at $0.00, 169,954 shares of performance share units at $0.00, and 2,361,175 shares of stock option awards at $15.14. Item 13. Certain Relationships and Related Transactions, and Director Independence\nIncorporated by reference from the sections of the Proxy Statement entitled Certain Relationships and Related Transactions and Corporate Governance. Such information will be filed with the SEC no later than 120 days after the end of the fiscal year covered by this report. Item 14. Principal Accounting Fees and Services\nIncorporated by reference from the section of the Proxy Statement entitled Fees Paid to Deloitte & Touche LLP (PCAOB ID No. 34). Such information will be filed with the SEC no later than 120 days after the end of the fiscal year covered by this report.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a)(1) Financial Statements\nThe following documents are filed as part of this Annual Report on Form 10-K:\na.The consolidated financial statements of TFS Financial Corporation and subsidiaries contained in Part II, Item 8 of this Annual Report on Form 10-K:\nConsolidated Statements of Condition as of September 30, 2022 and 2021;\nConsolidated Statements of Income for the years ended September 30, 2022, 2021 and 2020;\nConsolidated Statements of Comprehensive Income for the years ended September 30, 2022, 2021 and 2020;\nConsolidated Statements of Shareholders' Equity for the years ended September 30, 2022, 2021 and 2020;\nConsolidated Statements of Cash Flows for the years ended September 30, 2022, 2021 and 2020; and\nNotes to the Consolidated Financial Statements\nb. The exhibits listed in the Exhibits Index beginning on Page 122 of this Annual Report on Form 10-K.\nItem 16. Form 10-K Summary\nNot applicable.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of TFS Financial Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated statements of condition of TFS Financial Corporation and subsidiaries (the \"Company\") as of September 30, 2022 and 2021, the related consolidated statements of income, comprehensive income (loss), shareholders' equity, and cash flows, for each of the three years in the period ended September 30, 2022, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated November 22, 2022, expressed an unqualified opinion on the Company's internal control over financial reporting.\nChange in Accounting Principle\nAs discussed in Note 1 to the financial statements, the Company has changed its method of accounting for credit losses in 2021 due to the adoption of Accounting Standards Update No. 2016-13, Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAllowance for Credit Losses - Refer to Notes 1 and 5 to the financial statements\nCritical Audit Matter Description\nThe allowance for credit losses (ACL) is managements estimate of expected credit losses in the loan portfolio, including off-balance sheet commitments. As of September 30, 2022, the Companys loan portfolio totaled $14.3 billion, and the related ACL was $72.9 million. The Companys off-balance sheet commitments totaled $4.7 billion, and the related ACL was $27.0 million. As described in Note 1 of the consolidated financial statements, as of October 1, 2020, the Company adopted Accounting Standards Update (ASU) 2016-13, Financial Instruments - Credit Losses (Topic 326), which introduces a forward-looking expected loss model (the Current Expected Credit Losses (CECL) model) to estimate credit losses over the remaining expected life of the Companys loan portfolio. As discussed in Notes 1 and 5 of the consolidated financial statements, the ACL is an amount which represents managements best estimate of expected credit losses over the contractual life of the Companys loan portfolio as of the balance sheet date. The ACL is established using relevant available information, relating to past events, current conditions and reasonable and supportable forecasts. The Company utilizes loan level regression models with forecasted economic data to derive the probability of default and loss given default factors. These factors are used to calculate the loan level credit loss over a 24-month reasonable and supportable period with an immediate reversion to historical mean loss rates\nfor the remaining life of the loans. Qualitative adjustments are then made to account for factors that management does not believe are captured in the CECL quantitative models. The determination of the appropriate level of the allowance for the loan portfolio inherently involves a high degree of subjectivity and requires significant estimates of current credit risks using both quantitative and qualitative analyses.\nAuditing certain aspects of the ACL, including the (1) model methodology, (2) model accuracy, (3) model assumptions, (4) selection of relevant risk characteristics, (5) interpretation of the results, and (6) use of qualitative adjustments, involves especially subjective and complex judgment. Given the significant judgment in determining the ACL estimate, performing audit procedures to evaluate the reasonableness of managements estimate of the ACL requires a high degree of auditor judgment and an increased extent of effort, including the need to involve our credit specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Allowance for Credit Losses included the following, among others:\nWe tested the effectiveness of controls over the Companys (1) model methodology, (2) model accuracy, (3) model assumptions, (4) selection of relevant risk characteristics, (5) interpretation of the results, and (6) use of qualitative adjustments.\nWith the assistance of our credit specialists, we evaluated the reasonableness of the (1) model methodology, (2) model accuracy, (3) model assumptions, (4) selection of relevant risk characteristics, and (5) interpretation of the results.\nWe evaluated trends in the total ACL for consistency with trends in loan portfolio growth and credit performance.\nWe tested the accuracy and completeness of key risk characteristics input into the model by agreeing to source information.\nWe assessed the Company's method for determining the qualitative factor adjustments and the effect of those factors on the ACL compared with relevant credit risk factors and credit trends.\n/s/ Deloitte & Touche LLP\nCleveland, Ohio\nNovember 22, 2022\nWe have served as the Company's auditor since 2000.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CONDITION\nAs of September 30, 2022 and 2021\n(In thousands, except share data)\n2022 2021\nASSETS\nCash and due from banks $ 18,961 $ 27,346\nOther interest-earning cash equivalents 350,603 460,980\nCash and cash equivalents 369,564 488,326\nInvestment securities available for sale (amortized cost $501,597 and $420,542, respectively)\n457,908 421,783\nMortgage loans held for sale ($9,661 and $0 measured at fair value, respectively)\n9,661 8,848\nLoans held for investment, net:\nMortgage loans 14,276,478 12,525,687\nOther loans 3,263 2,778\nDeferred loan expenses, net 50,221 44,859\nAllowance for credit losses on loans (72,895) (64,289)\nLoans, net 14,257,067 12,509,035\nMortgage loan servicing assets, net 7,943 8,941\nFederal Home Loan Bank stock, at cost 212,290 162,783\nReal estate owned, net 1,191 289\nPremises, equipment, and software, net 34,531 37,420\nAccrued interest receivable 40,256 31,107\nBank owned life insurance contracts 304,040 297,332\nOther assets 95,428 91,586\nTOTAL ASSETS $ 15,789,879 $ 14,057,450\nLIABILITIES AND SHAREHOLDERS EQUITY\nDeposits $ 8,921,017 $ 8,993,605\nBorrowed funds 4,793,221 3,091,815\nBorrowers advances for insurance and taxes 117,250 109,633\nPrincipal, interest, and related escrow owed on loans serviced 29,913 41,476\nAccrued expenses and other liabilities 84,139 88,641\nTotal liabilities 13,945,540 12,325,170\nCommitments and contingent liabilities\nPreferred stock, $0.01 par value, 100,000,000 shares authorized, none issued and outstanding\n- -\nCommon stock, $0.01 par value, 700,000,000 shares authorized; 332,318,750 shares issued; 280,582,741 and 280,761,299 outstanding at September 30, 2022 and September 30, 2021, respectively\n3,323 3,323\nPaid-in capital 1,751,223 1,746,887\nTreasury stock, at cost; 51,736,009 and 51,557,451 shares at September 30, 2022 and September 30, 2021, respectively\n(771,986) (768,035)\nUnallocated ESOP shares (31,417) (35,751)\nRetained earnings-substantially restricted 870,047 853,657\nAccumulated other comprehensive income (loss) 23,149 (67,801)\nTotal shareholders equity 1,844,339 1,732,280\nTOTAL LIABILITIES AND SHAREHOLDERS EQUITY $ 15,789,879 $ 14,057,450\nSee accompanying notes to consolidated financial statements.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\nFor each of the three years in the period ended September 30, 2022\n(In thousands, except share and per share data)\n2022 2021 2020\nINTEREST AND DIVIDEND INCOME:\nLoans, including fees $ 395,691 $ 381,887 $ 440,697\nInvestment securities available for sale 5,501 3,822 9,707\nOther interest and dividend earning assets 8,141 3,642 4,894\nTotal interest and dividend income 409,333 389,351 455,298\nINTEREST EXPENSE:\nDeposits 76,943 97,319 140,242\nBorrowed funds 64,994 60,402 72,788\nTotal interest expense 141,937 157,721 213,030\nNET INTEREST INCOME 267,396 231,630 242,268\nPROVISION (RELEASE) FOR CREDIT LOSSES 1,000 (9,000) 3,000\nNET INTEREST INCOME AFTER PROVISION (RELEASE) FOR CREDIT LOSSES 266,396 240,630 239,268\nNON-INTEREST INCOME:\nFees and service charges, net of amortization 9,934 9,602 8,798\nNet gain on the sale of loans 1,136 33,082 28,443\nIncrease in and death benefits from bank owned life insurance contracts 9,984 9,961 7,153\nOther 2,750 2,654 8,857\nTotal non-interest income 23,804 55,299 53,251\nNON-INTEREST EXPENSE:\nSalaries and employee benefits 109,339 108,867 104,008\nMarketing services 21,263 19,174 16,512\nOffice property, equipment, and software 26,783 25,710 25,296\nFederal insurance premium and assessments 9,361 9,085 10,625\nState franchise tax 4,859 4,663 4,690\nOther expenses 26,541 28,336 31,143\nTotal non-interest expense 198,146 195,835 192,274\nINCOME BEFORE INCOME TAXES 92,054 100,094 100,245\nINCOME TAX EXPENSE 17,489 19,087 16,928\nNET INCOME $ 74,565 $ 81,007 $ 83,317\nEarnings per share\nBasic $ 0.26 $ 0.29 $ 0.30\nDiluted $ 0.26 $ 0.29 $ 0.29\nWeighted average shares outstanding\nBasic 277,370,762 276,694,594 275,859,660\nDiluted 278,686,365 278,576,254 277,803,058\nSee accompanying notes to consolidated financial statements.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nFor each of the three years in the period ended September 30, 2022\n(In thousands)\n2022 2021 2020\nNet income $ 74,565 $ 81,007 $ 83,317\nOther comprehensive income (loss), net of tax:\nNet change in unrealized (losses) gains on securities available for sale (34,860) (3,733) 6,859\nNet change in cash flow hedges 127,093 56,096 (69,391)\nNet change in defined benefit plan obligation (1,283) 11,801 (54)\nTotal other comprehensive income (loss) 90,950 64,164 (62,586)\nTotal comprehensive income $ 165,515 $ 145,171 $ 20,731\nSee accompanying notes to consolidated financial statements.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\nFor each of the three years in the period ended September 30, 2022\n(In thousands, except share and per share data)\nCommon\nstock Paid-in\ncapital Treasury\nstock Unallocated\ncommon stock\nheld by ESOP Retained\nearnings Accumulated other\ncomprehensive income (loss) Total\nshareholders'equity\nBalance at September 30, 2019 $ 3,323 $ 1,734,154 $ (764,589) $ (44,417) $ 837,662 $ (69,379) $ 1,696,754\nComprehensive income\nNet income\n- - - - 83,317 - 83,317\nOther comprehensive (loss), net of tax - - - - - (62,586) (62,586)\nESOP shares allocated or committed to be released - 3,033 - 4,333 - - 7,366\nCompensation costs for equity incentive plans - 4,751 - - - - 4,751\nPurchase of treasury stock (20,500 shares)\n- - (377) - - - (377)\nTreasury stock allocated to (from) equity incentive plan - 776 (2,683) - - - (1,907)\nDividends declared to common shareholders ($1.11 per common share)\n- - - - (55,465) - (55,465)\nBalance at September 30, 2020 3,323 1,742,714 (767,649) (40,084) 865,514 (131,965) 1,671,853\nComprehensive income\nCumulative effect from changes in\naccounting principle, net of tax1\n- - - - (35,763) - (35,763)\nNet income\n- - - - 81,007 - 81,007\nOther comprehensive income, net of tax - - - - - 64,164 64,164\nESOP shares allocated or committed to be released - 3,936 - 4,333 - - 8,269\nCompensation costs for equity incentive plans - 5,442 - - - - 5,442\nTreasury stock allocated to (from) equity incentive plan - (5,205) (386) - - - (5,591)\nDividends declared to common shareholders ($1.1225 per common share)\n- - - - (57,101) - (57,101)\nBalance at September 30, 2021 3,323 1,746,887 (768,035) (35,751) 853,657 (67,801) 1,732,280\nComprehensive income\nNet income\n- - - - 74,565 - 74,565\nOther comprehensive income, net of tax - - - - - 90,950 90,950\nESOP shares allocated or committed to be released - 2,729 - 4,334 - - 7,063\nCompensation costs for equity incentive plans - 3,946 - - - - 3,946\nPurchase of treasury stock (337,259 shares)\n- - (5,049) - - - (5,049)\nTreasury stock allocated to (from) equity incentive plan - (2,339) 1,098 - - - (1,241)\nDividends declared to common shareholders ($1.13 per common share)\n- - - - (58,175) - (58,175)\nBalance at September 30, 2022 $ 3,323 $ 1,751,223 $ (771,986) $ (31,417) $ 870,047 $ 23,149 $ 1,844,339\n1 Related to ASU 2016-13 adopted October 1, 2020.\nSee accompanying notes to consolidated financial statements.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor each of the three years in the period ended September 30, 2022\n2022 2021 2020\nCASH FLOWS FROM OPERATING ACTIVITIES: (In thousands)\nNet income $ 74,565 $ 81,007 $ 83,317\nAdjustments to reconcile net income to net cash provided by operating activities:\nESOP and stock-based compensation expense 11,009 13,711 12,117\nDepreciation and amortization 27,035 32,568 32,820\nDeferred income taxes (26,876) (14,249) 21,802\nProvision (release) for credit losses 1,000 (9,000) 3,000\nNet gain on the sale of loans (1,136) (33,082) (28,443)\nNet gain on sale of commercial property (181) - (4,665)\nOther net (gains) losses 810 689 (955)\nProceeds from sales of loans held for sale 41,495 63,913 62,398\nLoans originated and principal repayments on loans held for sale (66,162) (67,024) (60,256)\nIncrease in bank owned life insurance contracts (8,432) (7,979) (6,289)\nNet (increase) decrease in interest receivable and other assets (13,043) 7,697 (17,970)\nNet (decrease) increase in accrued expenses and other liabilities (1,155) 14,904 24,922\nNet cash provided by operating activities 38,929 83,155 121,798\nCASH FLOWS FROM INVESTING ACTIVITIES:\nLoans originated (5,273,730) (4,874,761) (4,255,580)\nPrincipal repayments on loans 3,447,529 4,756,761 3,549,803\nProceeds from sales, principal repayments and maturities of:\nSecurities available for sale 163,568 317,066 268,565\nProceeds from sale of:\nLoans 87,671 739,699 765,874\nReal estate owned 429 206 3,679\nPremises, equipment and other assets 389 - 23,920\nPurchases of:\nBank-owned life insurance - (70,000) -\nFHLB stock (49,507) (25,990) (34,935)\nSecurities available for sale (250,022) (297,466) (171,464)\nPremises, equipment, and software, net (2,700) (1,337) (3,207)\nOther 1,278 3,178 921\nNet cash (used in) provided by investing activities (1,875,095) 547,356 147,576\nCASH FLOWS FROM FINANCING ACTIVITIES:\nNet (decrease) increase in deposits (72,511) (231,949) 459,170\nNet increase (decrease) in borrowers' advances for insurance and taxes 7,617 (1,903) 8,208\nNet (decrease) increase in principal and interest owed on loans serviced (11,563) (4,419) 12,986\nNet increase (decrease) in short-term borrowed funds 875,000 (525,000) (281,126)\nProceeds from Fed Funds purchased 225,000 - -\nProceeds from long-term borrowed funds 600,000 100,000 250,000\nRepayment of long-term borrowed funds (3,646) (4,689) (350,110)\nCash collateral/settlements received from (provided to) derivative counterparties 162,094 89,970 (87,827)\nAcquisition of treasury shares (6,290) (5,591) (2,320)\nDividends paid to common shareholders (58,297) (56,637) (55,465)\nNet cash provided by (used in) financing activities 1,717,404 (640,218) (46,484)\nNET (DECREASE) INCREASE IN CASH AND CASH EQUIVALENTS (118,762) (9,707) 222,890\nCASH AND CASH EQUIVALENTS-Beginning of year 488,326 498,033 275,143\nCASH AND CASH EQUIVALENTS-End of year $ 369,564 $ 488,326 $ 498,033\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid for interest on deposits $ 76,558 $ 98,535 $ 140,887\nCash paid for interest on borrowed funds 37,120 16,043 53,676\nCash paid for interest on interest rate swaps 29,138 45,031 18,436\nCash paid for income taxes 39,602 25,772 1,673\nSUPPLEMENTAL SCHEDULES OF NONCASH INVESTING AND FINANCING ACTIVITIES:\nTransfer of loans to real estate owned 1,283 330 1,751\nTransfer of loans from held for investment to held for sale 86,077 698,917 778,059\nTransfer of loans from held for sale to held for investment 22,741 - -\nTreasury stock issued for stock benefit plans 2,412 5,310 776\nSee accompanying notes to consolidated financial statements.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAs of and for the years ended September 30, 2022, 2021, and 2020\n(Dollars in thousands unless otherwise indicated)\n1. DESCRIPTION OF BUSINESS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBusiness-TFS Financial Corporation, a federally chartered stock holding company, conducts its principal activities through its wholly owned subsidiaries. The principal line of business of the Company is retail consumer banking, including mortgage lending, deposit gathering, and other financial services. Third Federal Savings and Loan Association of Cleveland, MHC, its federally chartered mutual holding company parent, owned 80.95% of the outstanding shares of common stock of the Company at September 30, 2022.\nThe Companys primary operating subsidiaries include the Association and Third Capital, Inc. The Association is a federal savings association, which provides retail loan and savings products to its customers in Ohio and Florida, through its 37 full-service branches, five loan production offices, customer service call center and internet site. The Association also provides savings products, purchase mortgages, first mortgage refinance loans, home equity lines of credit, and home equity loans in states outside of its branch footprint. The Association also acquires first mortgage loans through a correspondent lending partnership. Third Capital, Inc. was formed to hold non-thrift investments and subsidiaries, which included a limited liability company that acquires and manages commercial real estate. On October 31, 2019, the limited liability company sold the remaining two commercial office buildings it owned, for which the Company recorded pre-tax income of $4,665 in 2020, representing its share of the gain on sale.\nThe accounting and reporting policies of TFS Financial Corporation and its subsidiaries conform to accounting principles generally accepted in the United States of America and to general practices within the thrift industry.\nNo material subsequent events have occurred requiring recognition in the consolidated financial statements or disclosure in the notes to the consolidated financial statements.\nThe following is a description of the significant accounting and reporting policies, which the Company follows in preparing and presenting its consolidated financial statements.\nBasis of Consolidation and Reporting -The consolidated financial statements of the Company include the accounts of TFS Financial Corporation and its wholly owned subsidiaries. Intercompany balances and transactions have been eliminated in consolidation.\nEstimates-The preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from these estimates.\nCash and Cash Equivalents-Cash and cash equivalents consist of working cash on hand, and demand and interest bearing deposits at other financial institutions with maturities of three months or less. For purposes of reporting cash flows, cash and cash equivalents also includes federal funds sold, when applicable. The Company has acknowledged informal agreements with banks where it maintains deposits. Under these agreements, service fees charged to the Company are waived provided certain average compensating balances are maintained throughout each month.\nInvestment Securities-Our fixed-maturity securities are accounted for on an available-for-sale basis. Securities held as available-for-sale are reported at fair value, with the corresponding unrealized gains and (losses), net of deferred income taxes, reported in accumulated other comprehensive income. Management determines the appropriate classification of investment securities based on its intent and ability to hold at the time of purchase. Purchases of securities are accounted for on a trade-date or settlement-date bases, depending on the settlement terms.\nRealized gains and (losses) on securities are computed on a specific identification basis. Realized gains and (losses) also include changes in fair value on derivatives not designated as hedging instruments. Sales of securities are accounted for on a trade-date or settlement-date basis, depending on the settlement terms.\nA decline in the fair value of any available for sale security, below cost, is evaluated for credit loss. Credit loss is recognized in earnings if management intends, or will more likely than not be required, to sell the security before the recovery of its amortized cost basis. If the present value of cash flows expected to be collected is less than the amortized cost basis of the security, then a credit loss exists and an allowance would be recognized as a credit loss expense, limited to the difference\nbetween fair value and amortized cost. Non-credit related loss is recognized in other comprehensive income, net of applicable deferred income taxes.\nTo determine whether a credit loss exists, the Company considers, among other things, adverse conditions related to the security, industry, geographic area, the payment schedule of the debt security and likelihood that the issuer will be able to make payments that increase in the future, failure of the issuer to make scheduled payments and all available information relevant to the securities collectability, changes in ratings assigned by a rating agency, and other credit enhancements that affect the securities expected performance.\nInvestment income consist of interest and accretion (net of amortization). Interest is recognized on an accrual basis using the level-yield method. Premiums and discounts are amortized using the level-yield method.\nDerivative Instruments-Derivative instruments are carried at fair value in the Company's financial statements. For derivative instruments that are designated and qualify as cash flow hedges, changes in the fair value of the derivative instrument are reported as a component of other comprehensive income, net of tax, and reclassified into earnings in the same period during which the hedged transaction affects earnings. The earnings effect of the hedging instrument will be presented in the same income statement line item as the earnings effect of the hedged item. Accumulated other comprehensive income will be adjusted to a balance that reflects the cumulative change in the fair value of the hedging instrument. At the inception of a hedge, the Company documents certain items, including the relationship between the hedging instrument and the hedged item, the risk management objective and the nature of the risk being hedged, a description of how effectiveness will be measured, an evaluation of hedge transaction effectiveness and the benchmark interest rate or contractually specified interest rate being hedged.\nHedge accounting is discontinued prospectively when (1) a derivative is no longer highly effective in offsetting changes in the fair value or cash flow of a hedged item, (2) a derivative expires or is sold, (3) a derivative is de-designated as a hedge, because it is unlikely that a forecasted transaction will occur, or (4) it is determined that designation of a derivative as a hedge is no longer appropriate. When hedge accounting is discontinued, the Company would continue to carry the derivative on the statement of condition at its fair value; however, changes in its fair value would be recorded in earnings instead of through OCI.\nFor derivative instruments not designated as hedging instruments, the Company recognizes gains and (losses) on the derivative instrument in current earnings during the period of change.\nMortgage Banking Activity-Mortgage loans originated and intended for sale in the secondary market are carried at the lower of cost or estimated fair value in the aggregate. Mortgage loans included in pending agency contracts to sell and securitize loans are carried at fair value. Fair value is based on quoted secondary market pricing for loan portfolios with similar characteristics and includes consideration of deferred fees (costs). Net unrealized gains or losses on loans carried at fair value, are recognized in a valuation allowance by charges to income.\nThe Company retains servicing on loans that are sold and initially recognizes an asset for mortgage loan servicing rights based on the fair value of the servicing rights. Residential mortgage loans represent the single class of servicing rights and are measured at the lower of cost or fair value on a recurring basis. Mortgage loan servicing rights are reported net of accumulated amortization, which is recorded in proportion to, and over the period of, estimated net servicing revenues. The Company monitors prepayments and changes amortization of mortgage servicing rights accordingly. Fair values are estimated using discounted cash flows based on current interest rates and prepayment assumptions, and impairment is monitored each quarterly reporting period. The impairment analysis is based on predominant risk characteristics of the loans serviced, such as type, fixed- and adjustable-rate loans, original terms and interest rates. The amount of impairment recognized is the amount by which the mortgage loan servicing assets exceed their fair value.\nServicing fee income net of amortization and other loan fees collected on loans serviced for others are included in Fees and service charges, net of amortization on the CONSOLIDATED STATEMENTS OF INCOME.\nLoans and Related Deferred Loan Expenses, net-Loans originated with the intent to hold into the foreseeable future are carried at unpaid principal balances adjusted for partial charge-offs, the allowance for credit losses and net deferred loan expenses. Interest on loans is accrued and credited to income as earned. Interest on loans is not recognized in income when collectability is uncertain.\nLoan fees and certain direct loan origination costs are deferred and recognized as an adjustment to interest income using the level-yield method over the contractual lives of related loans, if the loans are held for investment. If the loans are held for sale, net deferred fees (costs) are generally not amortized, but rather are recognized when the related loans are sold.\nLoans are classified as TDRs when the original contractual terms are restructured to provide a concession to a borrower experiencing financial difficulty under terms that would not otherwise be available and the restructuring is the result of an agreement between the Company and the borrower or is imposed by a court or law. Concessions granted in TDRs may include a reduction of the stated interest rate, a reduction or forbearance of principal, an extension of the maturity date, a significant delay in payments, the removal of one or more borrowers from the obligation, or any combination of these.\nAllowance for Credit Losses-The allowance for credit losses represents the estimate of lifetime losses in our loan portfolio and off-balance sheet commitments. The allowance for credit losses is assessed on a quarterly basis and provisions (releases) for credit losses are made accordingly. The allowance is established using relevant available information, relating to past events, current conditions and supportable economic forecasts. Historical credit loss experience provides the basis for the estimation of expected credit losses. Qualitative adjustments to historical loss information are made for differences in current loan-specific risk characteristics such as differences in underwriting standards, portfolio mix, delinquency status or likely recovery of previous loan charge-offs. The allowance for credit losses is increased by recoveries and decreased by charge-offs. Also, qualitative adjustments were made to reflect expected recovery of loan amounts previously charged-off, beyond what the model is able to project.\nFor further discussion on the allowance for credit losses, non-accrual, impairment, and TDRs, see Note 5. LOANS AND ALLOWANCE FOR CREDIT LOSSES.\nReal Estate Owned, net-Real estate owned, net represents real estate acquired through foreclosure or deed in lieu of foreclosure and is initially recorded at fair value, less estimated costs to sell. Subsequent to acquisition, real estate owned is carried at the lower of cost or fair value, less estimated selling costs. Management performs periodic valuations and a valuation allowance is established by a charge to income for any excess of the carrying value over the fair value, less estimated costs to sell the property. Recoveries in fair value during the holding period are recognized until the valuation allowance is reduced to zero. Costs related to holding and maintaining the property are charged to expense.\nPremises, Equipment, and Software, net-Depreciation and amortization of premises, equipment and software is computed on a straight-line basis over the estimated useful lives of the related assets. Estimated lives are 31.5 years for office facilities and three to 10 years for equipment and software. Amortization of leasehold or building improvements is computed on a straight-line basis over the lesser of the economic useful life of the improvement or term of the lease, typically 10 years.\nLeases-At inception, all contracts are evaluated to determine if the arrangement contains a lease based on the terms and conditions. As a lessee, the Company recognizes leases with terms greater than one year on the CONSOLIDATED STATEMENTS OF CONDITION as lease assets (a right-of-use asset) and lease liabilities (a liability to make lease payments), measured on a discounted basis. For further discussion on leases, see Note 8. LEASES.\nBank Owned Life Insurance Contracts-Life insurance is provided under both whole and split dollar life insurance agreements. Policy premiums were prepaid and the Company will recover the premiums paid from the proceeds of the policies. The Company recognizes death benefits and growth in the cash surrender value of the policies in other non-interest income.\nGoodwill-The excess of purchase price over the fair value of net assets of acquired companies is classified as goodwill and reported in Other Assets. Goodwill was $9,732 at September 30, 2022 and 2021. Goodwill is reviewed for impairment on an annual basis as of September 30. No impairment was identified as of September 30, 2022 or 2021.\nTaxes on Income-Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Additional information about policies related to income taxes is included in Note 12. INCOME TAXES.\nDeposits-Interest on deposits is accrued and charged to expense monthly and is paid or credited in accordance with the terms of the accounts.\nTreasury Stock-Acquisitions of treasury stock through stock repurchases are recorded at cost using the cost method of accounting. Repurchases may be made through open market purchases, block trades and in negotiated private transactions, subject to the availability of stock, general market conditions, the trading price of the stock, alternative uses for capital, and the Companys financial performance. Repurchased shares will be available for general corporate purposes.\nAccumulated Other Comprehensive Income (Loss)-AOCI consists of changes in pension obligations, changes in unrealized gains (losses) on securities available for sale and cash flow hedges, each of which is net of the related income tax\neffects. The Company's policy is to release income tax effects from AOCI only when the entire portfolio to which the underlying transactions relate to is liquidated, sold or extinguished.\nRevenue from Contracts with Customers- The core principle of the guidance requires an entity to recognize revenue to depict the transfer of goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled to receive in exchange for those goods or services. Three of the Company's revenue streams within scope of Topic 606 are the sales of REO, interchange income and deposit account and other transaction-based service fee income. Those streams are immaterial and therefore quantitative information regarding these streams is not disclosed.\nPension Benefits-The determination of our obligations and expense for pension benefits is dependent upon certain assumptions used in calculating such amounts. Key assumptions used in the actuarial valuations include the discount rate and expected long-term rate of return on plan assets. Actual results could differ from the assumptions and market driven rates may fluctuate. Significant differences in actual experience or significant changes in the assumptions could materially affect future pension obligations and expense.\nShare-Based Compensation-Compensation expense for awards of equity instruments is recognized on a straight-line basis over the requisite service period based on the grant date fair value estimated in accordance with the provisions of FASB ASC 718 Compensation-Stock Compensation. All vested equity instruments are settled in stock. Forfeitures are recognized as they occur. Share-based compensation expense is included in Salaries and employee benefits in the CONSOLIDATED STATEMENTS OF INCOME. Tax benefits or deficiencies recognized for the difference between realized deductions and cumulative book compensation cost on share-based compensation awards are included in operating cash flows on the CONSOLIDATED STATEMENTS OF CASH FLOW.\nThe grant date fair value of stock options is estimated using the Black-Scholes option-pricing model using assumptions for the expected option term, expected stock price volatility, risk-free interest rate, and expected dividend yield. Due to limited historical data on exercise of share options, the simplified method is used to estimate expected option term.\nMarketing Costs-Marketing costs are expensed as incurred.\nEarnings per Share-Basic EPS is computed by dividing net income by the weighted-average number of shares of common stock outstanding. Outstanding shares include shares sold to subscribers, shares held by the Third Federal Foundation, shares of the Employee Stock Ownership Plan which have been allocated or committed to be released for allocation to participants, and shares held by Third Federal Savings, MHC. Unvested shares awarded in the Company's share-based compensation plan are treated as participating securities for purposes of the two-class method when they contain nonforfeitable rights to dividends, but are not included in the number of shares in the computation of basic EPS. The two-class method is an earnings allocation that determines EPS for each class of common stock and participating security.\nDiluted EPS is computed using the same method as basic EPS, but the weighted-average number of shares reflects the potential dilution, if any, of unexercised stock options, unvested shares of performance share units and unvested shares of restricted stock units that could occur if stock options were exercised and performance share units and restricted stock units were issued and converted into common stock. These potentially dilutive shares would then be included in the number of weighted-average shares outstanding for the period using the treasury stock method. At September 30, 2022, 2021 and 2020, potentially dilutive shares include stock options, restricted stock units and performance share units issued through share-based compensation plans.\n2. STOCK TRANSACTIONS\nTFS Financial Corporation completed its initial public stock offering on April 20, 2007 and sold 100,199,618 shares, or 30.16% of its post-offering outstanding common stock, to subscribers in the offering. Third Federal Savings, MHC, the Companys mutual holding company parent, holds 227,119,132 shares of TFS Financial Corporations outstanding common stock. TFS Financial Corporation issued 5,000,000 shares of common stock, or 1.50% of its post-offering outstanding common stock, to Third Federal Foundation.\nPursuant to the eighth repurchase program for the repurchase of 10,000,000 shares authorized by the Board of Directors in October, 2016, 337,259 shares were repurchased during the year ended September 30, 2022, no shares were repurchased during the year ended September 30, 2021 and 20,500 shares were repurchased during the year ended September 30, 2020. At September 30, 2022, there were 5,553,820 shares remaining to be purchased under the eighth repurchase program. The Company previously repurchased 51,300,000 shares of the Companys common stock as part of the previous seven Board of Directors-approved share repurchase programs. In total, the Company has repurchased 55,746,180 shares of the Company's common stock as of September 30, 2022.\n3. REGULATORY MATTERS\nThe Association is subject to various regulatory capital requirements administered by the federal banking agencies. Failure to meet minimum capital requirements can initiate certain mandatory and possibly additional discretionary actions by regulators that, if undertaken, could have a direct material effect on the financial statements of the Association. Under capital adequacy guidelines and the regulatory framework for prompt corrective action, the Association must meet specific capital guidelines that involve quantitative measures of its assets, liabilities, and certain off-balance-sheet items as calculated under regulatory accounting practices. The capital amounts and classifications are also subject to qualitative judgments by the regulators about components, risk weightings, and other factors.\nQuantitative measures established by regulation to ensure capital adequacy require the Association to maintain minimum amounts and ratios (set forth in table below) of common equity Tier 1, Tier 1, and Total capital (as defined in the regulations) to risk-weighted assets (as defined) and Tier 1 capital (as defined) to net average assets (as defined). The risk-based capital guidelines include both a definition of capital and a framework for calculating risk-weighted assets by assigning balance sheet assets and off-balance sheet assets to broad risk categories.\nIn 2019, a final rule adopted by the federal banking agencies provided banking organizations with the option to phase in, over a three-year period, the adverse day-one regulatory capital effects of the adoption of the CECL accounting standard. In 2020, as part of its response to the impact of COVID-19, U.S. federal banking regulatory agencies issued a final rule which provides banking organizations that implement CECL during the 2020 calendar year the option to delay for two years an estimate of CECLs effect on regulatory capital, relative to the incurred loss methodologys effect on regulatory capital, followed by a three-year transition period, which the Association and Company have adopted. During the two-year delay, the Association and Company added back to common equity tier 1 capital (CET1) 100% of the initial adoption impact of CECL plus 25% of the cumulative quarterly changes in the allowance for credit losses. Subsequent to the two-year delay, the quarterly transitional amounts along with the initial adoption impact of CECL will be phased out of CET1 capital over the three-year period. At September 30, 2022, the Association exceeded all regulatory capital requirements and is considered well capitalized under regulatory guidelines.\nThe Association operates under the capital requirements for the standardized approach of the Basel III capital framework for U.S. banking organizations (Basel III Rules), which limits capital distributions and certain discretionary bonus payments to management if the institution does not hold a \"capital conservation buffer\" consisting of 2.5% in addition to the minimum capital requirements. At September 30, 2022, the Association exceeded the fully phased-in regulatory requirement for the \"capital conservation buffer\".\nThe following table summarizes the actual capital amounts and ratios of the Association as of September 30, 2022 and 2021, compared to the minimum capital adequacy requirements and the requirements for classification as a well capitalized institution.\nMinimum Requirements\nActual For Capital\nAdequacy Purposes To be Well Capitalized\nUnder Prompt Corrective\nAction Provision\nAmount Ratio Amount Ratio Amount Ratio\nSeptember 30, 2022\nTotal Capital to Risk-Weighted Assets $ 1,666,677 18.84 % $ 707,788 8.00 % $ 884,734 10.00 %\nTier 1 (Leverage) Capital to Net Average Assets 1,614,615 10.33 % 625,020 4.00 % 781,275 5.00 %\nTier 1 Capital to Risk-Weighted Assets 1,614,615 18.25 % 530,841 6.00 % 707,788 8.00 %\nCommon Equity Tier 1 Capital to Risk-Weighted Assets\n1,614,615 18.25 % 398,130 4.50 % 575,077 6.50 %\nSeptember 30, 2021\nTotal Capital to Risk-Weighted Assets $ 1,629,192 21.00 % $ 620,637 8.00 % $ 775,796 10.00 %\nTier 1 (Leverage) Capital to Net Average Assets 1,585,124 11.15 % 568,751 4.00 % 710,939 5.00 %\nTier 1 Capital to Risk-Weighted Assets 1,585,124 20.43 % 465,478 6.00 % 620,637 8.00 %\nCommon Equity Tier 1 Capital to Risk-Weighted Assets\n1,585,124 20.43 % 349,108 4.50 % 504,268 6.50 %\nThe Association paid dividends of $56,000 and $55,000 to the Company during the years ended September 30, 2022 and 2021, respectively.\nAs permitted under interim final rules issued by the FRS on August 12, 2011, a majority of Third Federal Savings, MHC's members eligible to vote approved Third Federal Savings, MHC waiving dividends aggregating up to $1.13 per share on the common stock of the Company for the 12 month following the special meeting of members held on July 12, 2022. Unless the FRS amends its interim rule, a member vote will be required for Third Federal Savings, MHC to waive its right to receive dividends beyond July 12, 2023.\n4. INVESTMENT SECURITIES\nAvailable-for-sale securities are summarized in the tables below. Accrued interest in the periods presented is $1,122 and $852 as of September 30, 2022 and September 30, 2021, respectively, and is reported in accrued interest receivable on the CONSOLIDATED STATEMENTS OF CONDITION.\nSeptember 30, 2022\nAmortized\nCost Gross\nUnrealized Fair\nValue\nGains Losses\nREMICs $ 496,529 $ 1 $ (43,262) $ 453,268\nFannie Mae certificates 1,011 14 (4) 1,021\nU.S. Government and agency obligations 4,057 - (438) 3,619\nTotal $ 501,597 $ 15 $ (43,704) $ 457,908\nSeptember 30, 2021\nAmortized\nCost Gross\nUnrealized Fair\nValue\nGains Losses\nREMICs $ 415,149 $ 2,420 $ (1,328) $ 416,241\nFannie Mae certificates 5,393 149 - 5,542\nTotal $ 420,542 $ 2,569 $ (1,328) $ 421,783\nThe following is a summary of our securities portfolio by remaining period to contractual maturity and yield at September 30, 2022. Maturities are based on the final contractual payment dates, and do not reflect the impact of prepayments or early redemptions that may occur. There were no securities with a maturity of one year or less for either year presented. Weighted average yields are not presented on a tax-equivalent basis and are calculated by multiplying each carry value by its yield and dividing the sum of these results by the total carry values. We did not hold any tax-free securities.\nSeptember 30, 2022 September 30, 2021\nAmortized Cost Fair Value Weighted Average Yield Amortized Cost Fair Value Weighted Average Yield\nOne to five years 15,476 14,775 2.06 % 18,373 18,680 1.83 %\nFive to ten years 38,927 37,204 2.30 % 34,904 35,364 1.22 %\nTen years or greater 447,194 405,929 2.25 % 367,265 367,739 0.90 %\nTotal $ 501,597 $ 457,908 2.25 % $ 420,542 $ 421,783 0.96 %\nGross unrealized losses on available- for- sale securities and the estimated fair value of the related securities, aggregated by the length of time the securities have been in a continuous loss position, at September 30, 2022 and 2021, were as follows:\nSeptember 30, 2022\nLess Than 12 Months 12 Months or More Total\nEstimated\nFair Value Unrealized\nLoss Estimated\nFair Value Unrealized\nLoss Estimated\nFair Value Unrealized\nLoss\nAvailable for sale-\nREMICs $ 261,795 $ 17,260 $ 190,739 $ 26,002 $ 452,534 $ 43,262\nFannie Mae certificates 217 4 - - 217 4\nU.S. Government and agency obligations 3,619 438 - - 3,619 438\nTotal $ 265,631 $ 17,702 $ 190,739 $ 26,002 $ 456,370 $ 43,704\nSeptember 30, 2021\nLess Than 12 Months 12 Months or More Total\nEstimated\nFair Value Unrealized\nLoss Estimated\nFair Value Unrealized\nLoss Estimated\nFair Value Unrealized\nLoss\nAvailable for sale-\nREMICs $ 201,279 $ 1,290 $ 6,261 $ 38 $ 207,540 $ 1,328\nThe unrealized losses on investment securities were primarily attributable to an increase in interest rates. The contractual cash flows of REMICs are guaranteed by Fannie Mae, Freddie Mac and Ginnie Mae, and the U.S. Treasury Department established financing agreements in 2008 to ensure Fannie Mae and Freddie Mac meet their obligations to holders of mortgage-backed securities that they have issued or guaranteed.\nSince the decline in value is primarily attributable to an increase in interest rates, and the financing agreements established by the U.S. Treasury Department ensures contractual cash flows obligations will be met, we did not record an allowance for credit losses with respect to securities as of September 30, 2022.\n5. LOANS AND ALLOWANCE FOR CREDIT LOSSES\nLOAN PORTFOLIOS\nLoans held for investment consist of the following:\nSeptember 30, September 30,\n2022 2021\nReal estate loans:\nResidential Core $ 11,539,859 $ 10,215,275\nResidential Home Today 53,255 63,823\nHome equity loans and lines of credit 2,633,878 2,214,252\nConstruction 121,759 80,537\nReal estate loans 14,348,751 12,573,887\nOther loans 3,263 2,778\nAdd (deduct):\nDeferred loan expenses, net 50,221 44,859\nLoans-in-process (72,273) (48,200)\nAllowance for credit losses on loans (72,895) (64,289)\nLoans held for investment, net $ 14,257,067 $ 12,509,035\nLoans are carried at amortized cost, which includes outstanding principal balance adjusted for any unamortized premiums or discounts, net of deferred fees and expenses. Accrued interest is $39,124 and $30,255 as of September 30, 2022 and September 30, 2021, respectively, and is reported in accrued interest receivable on the CONSOLIDATED STATEMENTS OF CONDITION.\nA large concentration of the Companys lending is in Ohio and Florida. As of September 30, 2022 and September 30, 2021, the percentage of aggregate Residential Core, Home Today and Construction loans secured by properties in Ohio was\n56% and 55%, respectively, and the percentage of loans secured by properties in Florida was 18% as of both dates. As of September 30, 2022 and September 30, 2021, home equity loans and lines of credit were concentrated in the states of Ohio (27% and 29%, respectively), Florida (20% as of both dates), and California (16% and 15%, respectively).\nResidential Core mortgage loans represent the largest portion of the residential real estate portfolio. The Company believes overall credit risk is low based on the nature, composition, collateral, products, lien position and performance of the portfolio. The portfolio does not include loan types or structures that have experienced severe performance problems at other financial institutions (sub-prime, no documentation or pay-option adjustable-rate mortgages). The portfolio contains \"Smart Rate\" adjustable-rate mortgage loans whereby the interest rate is locked initially for three or five years then resets annually, subject to periodic rate adjustments caps and various re-lock options available to the borrower. Although the borrower is qualified for its loan at a higher rate than the initial rate offered, the adjustable-rate feature may impact a borrower's ability to afford the higher payments upon rate reset during periods of rising interest rates while this repayment risk may be reduced in a declining or low rate environment. With limited historical loss experience compared to other types of loans in the portfolio, judgment is required by management in assessing the allowance required on adjustable-rate mortgage loans. The principal amount of adjustable-rate mortgage loans included in the Residential Core portfolio was $4,668,089 and $4,646,760 at September 30, 2022 and September 30, 2021, respectively.\nHome Today was an affordable housing program targeted to benefit low- and moderate-income home buyers. Most loans under the program were originated prior to 2009. No new loans were originated under the Home Today program after September 30, 2016. Home Today loans have greater credit risk than traditional residential real estate mortgage loans.\nHome equity loans and lines of credit, which are comprised primarily of home equity lines of credit, represent a significant portion of the residential real estate portfolio and include monthly principal and interest payments throughout the entire term. Once the draw period on lines of credit has expired, the accounts are included in the home equity loan balance. The full credit exposure on home equity lines of credit is secured by the value of the collateral real estate at the time of origination.\nThe Company originates construction loans to individuals for the construction of their personal single-family residence by a qualified builder (construction/permanent loans). The Companys construction/permanent loans generally provide for disbursements to the builder or sub-contractors during the construction phase as work progresses. During the construction phase, the borrower only pays interest on the drawn balance. Upon completion of construction, the loan converts to a permanent amortizing loan without the expense of a second closing. Construction/permanent loans have a fixed or adjustable-rate and a current maximum loan-to-completed-appraised value ratio of 85%.\nOther loans are comprised of loans secured by certificate of deposit accounts, which are fully recoverable in the event of non-payment, and forgivable down payment assistance loans, which are unsecured loans used as down payment assistance to borrowers qualified through partner housing agencies. The Company records a liability for the loans which are forgiven in equal increments over a pre-determined term, subject to residency requirements.\nLoans held for sale include loans originated within the parameters of programs established by Fannie Mae, for sale to Fannie Mae, and loans originated for the held for investment portfolio that are later identified for sale. During the years ended September 30, 2022 and September 30, 2021, reclassifications to the held for sale portfolio included loans that were sold during the period, including those in contracts pending settlement at the end of the period, and loans originated for the held for investment portfolio that were later identified for sale. At September 30, 2022 and September 30, 2021, respectively, mortgage loans held for sale totaled $9,661 and $8,848. During the years ended September 30, 2022 and September 30, 2021, respectively, the principal balance of loans sold was $128,118 and $762,332. During the year ended September 30, 2022, the amortized cost of loans originated as held for sale that were subsequently transferred to the held for investment portfolio was $22,741. This transfer was due to changes in market pricing, affected by the rise in long-term interest rates, and managements' intent to hold the loans in portfolio until maturity or for the foreseeable future. During the years ended September 30, 2021 and September 30, 2020, there were no transfers to the held for investment portfolio.\nDELINQUENCY and NON-ACCRUAL\nAn aging analysis of the amortized cost in loan receivables that are past due at September 30, 2022 and September 30, 2021 is summarized in the following tables. When a loan is more than one month past due on its scheduled payments, the loan is considered 30 days or more past due, regardless of the number of days in each month. Balances are adjusted for deferred loan fees and expenses and any applicable loans-in-process.\n30-59 Days\nPast Due 60-89 Days\nPast Due 90 Days\nor More\nPast Due Total Past\nDue Current Total\nSeptember 30, 2022\nReal estate loans:\nResidential Core $ 2,725 $ 1,491 $ 9,281 $ 13,497 $ 11,545,784 $ 11,559,281\nResidential Home Today 1,341 770 861 2,972 49,836 52,808\nHome equity loans and lines of credit 1,599 796 2,321 4,716 2,661,416 2,666,132\nConstruction - - - - 48,478 48,478\nTotal real estate loans 5,665 3,057 12,463 21,185 14,305,514 14,326,699\nOther loans - - - - 3,263 3,263\nTotal $ 5,665 $ 3,057 $ 12,463 $ 21,185 $ 14,308,777 $ 14,329,962\n30-59\nDays\nPast Due 60-89\nDays\nPast Due 90 Days\nor More\nPast Due Total Past\nDue Current Total\nSeptember 30, 2021\nReal estate loans:\nResidential Core $ 3,642 $ 2,263 $ 9,370 $ 15,275 $ 10,218,347 $ 10,233,622\nResidential Home Today 948 961 2,068 3,977 59,432 63,409\nHome equity loans and lines of credit 938 300 4,231 5,469 2,236,449 2,241,918\nConstruction - - - - 31,597 31,597\nTotal real estate loans 5,528 3,524 15,669 24,721 12,545,825 12,570,546\nOther loans - - - - 2,778 2,778\nTotal $ 5,528 $ 3,524 $ 15,669 $ 24,721 $ 12,548,603 $ 12,573,324\nLoans are placed in non-accrual status when they are contractually 90 days or more past due. The number of days past due is determined by the number of scheduled payments that remain unpaid, assuming a period of 30 days between each scheduled payment. Loans with a partial charge-off are placed in non-accrual and will remain in non-accrual status until, at a minimum, the loss is recovered. Loans restructured in TDRs that were in non-accrual status prior to the restructurings and loans with forbearance plans that were subsequently modified are reported in non-accrual status for a minimum of six months after restructuring. Loans restructured in TDRs with a high debt-to-income ratio at the time of modification are placed in non-accrual status for a minimum of 12 months. Additionally, home equity loans and lines of credit where the customer has a severely delinquent first mortgage loan and loans in Chapter 7 bankruptcy status where all borrowers have filed, and not reaffirmed or been dismissed, are placed in non-accrual status.\nThe amortized cost of loan receivables in non-accrual status is summarized in the following table. Non-accrual with no ACL describes non-accrual loans which have no quantitative or individual valuation allowance, primarily because they have already been collaterally reviewed and any required charge-offs have been taken, but may be included in consideration of qualitative allowance factors. Balances are adjusted for deferred loan fees and expenses. There are no loans 90 or more days past due and still accruing at September 30, 2022 or September 30, 2021.\nSeptember 30, 2022 September 30, 2021\nNon-accrual with No ACL Total\nNon-accrual Non-accrual with No ACL Total\nNon-accrual\nReal estate loans:\nResidential Core $ 20,995 $ 22,644 $ 23,748 $ 24,892\nResidential Home Today 5,753 6,037 7,730 8,043\nHome equity loans and lines of credit 6,668 6,925 9,992 11,110\nTotal non-accrual loans $ 33,416 $ 35,606 $ 41,470 $ 44,045\nAt September 30, 2022 and September 30, 2021, respectively, the amortized cost in non-accrual loans includes $23,159 and $28,385 which are performing according to the terms of their agreement, of which $13,526 and $16,495 are loans in Chapter 7 bankruptcy status, primarily where all borrowers have filed, and have not reaffirmed or been dismissed. At September 30, 2022 and September 30, 2021, real estate loans include $9,833 and $2,296, respectively, of loans that were in the process of foreclosure.\nInterest on loans in accrual status is recognized in interest income as it accrues, on a daily basis. Accrued interest on loans in non-accrual status is reversed by a charge to interest income and income is subsequently recognized only to the extent cash payments are received. The Company has elected not to measure an allowance for credit losses on accrued interest receivable amounts since amounts are written off timely. Cash payments on loans in non-accrual status are applied to the oldest scheduled, unpaid payment first. The amount of interest income recognized on non-accrual loans was $740, and $929 for the years ended September 30, 2022 and September 30, 2021, respectively. Cash payments on loans with a partial charge-off are applied fully to principal, then to recovery of the charged off amount prior to interest income being recognized, except cash payments may be applied to interest capitalized in a restructuring when collection of remaining amounts due is considered probable. A non-accrual loan is generally returned to accrual status when contractual payments are less than 90 days past due. However, a loan may remain in non-accrual status when collectability is uncertain, such as a TDR that has not met minimum payment requirements, a loan with a partial charge-off, a home equity loan or line of credit with a delinquent first mortgage greater than 90 days past due, or a loan in Chapter 7 bankruptcy status where all borrowers have filed, and have not reaffirmed or been dismissed.\nALLOWANCE FOR CREDIT LOSSES\nFor all classes of loans, a loan is considered collateral-dependent when, based on current information and events, the borrower is experiencing financial difficulty and repayment is expected to be provided substantially through the sale of the collateral or foreclosure is probable. Factors considered in determining that a loan is collateral-dependent may include the deteriorating financial condition of the borrower indicated by missed or delinquent payments, a pending legal action, such as bankruptcy or foreclosure, or the absence of adequate security for the loan.\nCharge-offs on residential mortgage loans, home equity loans and lines of credit, and construction loans are recognized when triggering events, such as foreclosure actions, short sales, or deeds accepted in lieu of repayment, result in less than full repayment of the amortized cost in the loans.\nPartial or full charge-offs are also recognized for the amount of credit losses on loans considered collateral-dependent when the borrower is experiencing financial difficulty as described by meeting the conditions below.\nFor residential mortgage loans, payments are greater than 180 days delinquent;\nFor home equity loans and lines of credit, and residential loans restructured in a TDR, payments are greater than 90 days delinquent;\nFor all classes of loans in a TDR COVID-19 forbearance plan, original contractual payments are greater than 150 days delinquent;\nFor all classes of loans restructured in a TDR with a high debt-to-income ratio at time of modification;\nFor all classes of loans, a sheriff sale is scheduled within 60 days to sell the collateral securing the loan;\nFor all classes of loans, all borrowers have been discharged of their obligation through a Chapter 7 bankruptcy;\nFor all classes of loans, within 60 days of notification, all borrowers obligated on the loan have filed Chapter 7 bankruptcy and have not reaffirmed or been dismissed;\nFor all classes of loans, a borrower obligated on a loan has filed bankruptcy and the loan is greater than 30 days delinquent;\nFor all classes of loans, a COVID-19 forbearance plan has been extended greater than 12 months;\nFor all classes of loans in a COVID-19 repayment plan, modified contractual payments are greater than 90 days delinquent; and\nFor all classes of loans, it becomes evident that a loss is probable.\nCollateral-dependent residential mortgage loans and construction loans are charged-off to the extent the amortized cost in the loan, net of anticipated mortgage insurance claims, exceeds the fair value, less estimated costs to dispose of the underlying property. Management can determine if the loan is uncollectible for reasons such as foreclosures exceeding a reasonable time frame and recommend a full charge-off. Home equity loans or lines of credit are charged-off to the extent the amortized cost in the loan plus the balance of any senior liens exceeds the fair value, less estimated costs to dispose of the underlying property, or management determines the collateral is not sufficient to satisfy the loan. A loan in any portfolio identified as collateral-dependent will continue to be reported as such until it is no longer considered collateral-dependent, is less than 30 days past due and does not have a prior charge-off. A loan in any portfolio that has a partial charge-off will continue to be individually evaluated for credit loss until, at a minimum, the loss has been recovered.\nResidential mortgage loans, home equity loans and lines of credit and construction loans restructured in TDRs that are not evaluated based on collateral are separately evaluated for credit losses on a loan by loan basis at each reporting date for as long as they are reported as TDRs. The credit loss evaluation is based on the present value of expected future cash flows discounted at the effective interest rate of the original loan. Expected future cash flows include a discount factor representing a potential for default. Valuation allowances are recorded for the excess of the amortized costs over the result of the cash flow analysis. Loans discharged in Chapter 7 bankruptcy are reported as TDRs and also evaluated based on the present value of expected future cash flows unless evaluated based on collateral. These loans are evaluated using expected future cash flows because the borrower, not liquidation of the collateral, is expected to be the source of repayment for the loan. Other loans are not considered for restructuring.\nAt September 30, 2022 and September 30, 2021, respectively, allowances on individually reviewed TDRs (IVAs), evaluated for credit losses based on the present value of cash flows were $10,284 and $12,073. All other individually evaluated loans received a charge-off, if applicable.\nThe allowance for credit losses represents the estimate of lifetime losses in the loan portfolio and unfunded loan commitments. An allowance is established using relevant available information relating to past events, current conditions and supportable forecasts. The Company utilizes loan level regression models with forecasted economic data to derive the probability of default and loss given default factors. These factors are used to calculate the loan level credit loss over a 24-month period with an immediate reversion to historical mean loss rates for the remaining life of the loans.\nHistorical credit loss experience provides the basis for the estimation of expected credit losses. Qualitative adjustments to historical loss information are made for differences in current loan-specific risk characteristics such as differences in underwriting standards, portfolio mix, delinquency status or likely recovery of previous loan charge-offs. Qualitative adjustments for expected changes in environmental conditions, such as changes in unemployment rates, property values or other relevant factors, are recognized when forecasted economic data used in the model differs from management's view or contains significant unobservable changes within a short period, particularly when those changes are directionally positive. Identifiable model limitations may also lead to qualitative adjustments, such as those made to reflect the expected recovery of loan amounts previously charged-off, beyond what the model is able to project. The qualitative adjustments resulted in a negative ending balance on the allowance for credit losses for the Home Today portfolio, where recoveries are expected to exceed charge-offs over the remaining life of that portfolio.The net qualitative adjustment at September 30, 2022 was a net reduction of $7,085. Adjustments are evaluated quarterly based on current facts and circumstances.\nActivity in the allowance for credit losses by portfolio segment is summarized as follows. See Note 15. COMMITMENTS AND CONTINGENT LIABILITIES for further details on the allowance for unfunded commitments.\nFor the Year Ended September 30, 2022\nBeginning\nBalance Provisions (Releases) Charge-offs Recoveries Ending\nBalance\nReal estate loans:\nResidential Core $ 44,523 $ 6,298 $ (247) $ 2,932 $ 53,506\nResidential Home Today 15 (3,411) (249) 2,648 (997)\nHome equity loans and lines of credit 19,454 (3,820) (954) 5,352 20,032\nConstruction 297 (118) - 175 354\nTotal real estate loans\n64,289 (1,051) (1,450) 11,107 72,895\nTotal Unfunded Loan Commitments (1)\n24,970 2,051 - - 27,021\nTotal Allowance for Credit Losses $ 89,259 $ 1,000 $ (1,450) $ 11,107 $ 99,916\nFor the Year Ended September 30, 2021\nBeginning\nBalance Adoption of ASU 2016-13 Provisions (Releases) Charge-offs Recoveries Ending\nBalance\nReal estate loans:\nResidential Core $ 22,381 $ 23,927 $ (2,205) $ (1,965) $ 2,385 $ 44,523\nResidential Home Today 5,654 (5,217) (2,232) (552) 2,362 15\nHome equity loans and lines of credit 18,898 5,258 (7,627) (2,696) 5,621 19,454\nConstruction 4 127 146 - 20 297\nTotal real estate loans\n46,937 24,095 (11,918) (5,213) 10,388 64,289\nTotal Unfunded Loan Commitments (1)\n$ - $ 22,052 $ 2,918 $ - $ - $ 24,970\nTotal Allowance for Credit Losses $ 46,937 $ 46,147 $ (9,000) $ (5,213) $ 10,388 $ 89,259\n(1) Total allowance for unfunded loan commitments is recorded in other liabilities on the CONSOLIDATED STATEMENTS OF CONDITION and primarily relates to undrawn home equity lines of credit.\nCLASSIFIED LOANS\nThe following tables provide information about the credit quality of residential loan receivables by an internally assigned grade. Revolving loans reported at amortized cost include home equity lines of credit currently in their draw period. Revolving loans converted to term are home equity lines of credit that are in repayment. Equity loans and bridge loans are segregated by origination year. Loans, or the portions of loans, classified as loss are fully charged-off in the period in which they are determined to be uncollectible; therefore they are not included in the following table. No Home Today loans are classified Special Mention. All construction loans are classified Pass. Balances are adjusted for deferred loan fees and expenses and any applicable loans-in-process.\nRevolving Loans Revolving Loans\nBy fiscal year of origination Amortized Converted\n2022 2021 2020 2019 2018 Prior Cost Basis To Term Total\nSeptember 30, 2022\nReal estate loans:\nResidential Core\nPass $ 3,349,200 $ 2,251,075 $ 1,488,763 $ 629,090 $ 665,116 $ 3,141,907 $ - $ - $ 11,525,151\nSpecial Mention - 292 - 108 464 816 - - 1,680\nSubstandard - 1,195 3,188 1,142 1,883 25,042 - - 32,450\nTotal Residential Core 3,349,200 2,252,562 1,491,951 630,340 667,463 3,167,765 - - 11,559,281\nResidential Home Today (1)\nPass - - - - - 45,408 - - 45,408\nSubstandard - - - - - 7,400 - - 7,400\nTotal Residential Home Today - - - - - 52,808 - - 52,808\nHome equity loans and lines of credit\nPass 98,904 30,614 9,204 8,036 6,965 11,247 2,400,095 89,448 2,654,513\nSpecial Mention - 191 - - - - 898 640 1,729\nSubstandard - - 54 20 19 127 2,996 6,674 9,890\nTotal Home equity loans and lines of credit 98,904 30,805 9,258 8,056 6,984 11,374 2,403,989 96,762 2,666,132\nTotal Construction 37,810 10,668 - - - - - - 48,478\nTotal real estate loans\nPass 3,485,914 2,292,357 1,497,967 637,126 672,081 3,198,562 2,400,095 89,448 14,273,550\nSpecial Mention - 483 - 108 464 816 898 640 3,409\nSubstandard - $ 1,195 $ 3,242 $ 1,162 $ 1,902 $ 32,569 $ 2,996 $ 6,674 $ 49,740\nTotal real estate loans $ 3,485,914 $ 2,294,035 $ 1,501,209 $ 638,396 $ 674,447 $ 3,231,947 $ 2,403,989 $ 96,762 $ 14,326,699\n(1) No new originations of Home Today loans since fiscal 2016.\nRevolving Loans Revolving Loans\nBy fiscal year of origination Amortized Converted\n2021 2020 2019 2018 2017 Prior Cost Basis To Term Total\nSeptember 30, 2021\nReal estate loans:\nResidential Core\nPass $ 2,637,782 $ 1,807,652 $ 784,462 $ 860,150 $ 1,016,853 $ 3,042,398 $ - $ - $ 10,149,297\nSpecial Mention 22,711 703 110 709 300 759 - - 25,292\nSubstandard - 4,029 4,470 4,860 4,813 40,861 - - 59,033\nTotal Residential Core 2,660,493 1,812,384 789,042 865,719 1,021,966 3,084,018 - - 10,233,622\nResidential Home Today (1)\nPass - - - - - 53,076 - - 53,076\nSubstandard - - - - - 10,333 - - 10,333\nTotal Residential Home Today - - - - - 63,409 - - 63,409\nHome equity loans and lines of credit\nPass 48,427 14,488 12,325 11,891 10,423 6,478 1,990,195 129,336 2,223,563\nSpecial Mention - - 13 - - 10 1,182 292 1,497\nSubstandard - - 148 57 304 33 4,746 11,570 16,858\nTotal Home equity loans and lines of credit 48,427 14,488 12,486 11,948 10,727 6,521 1,996,123 141,198 2,241,918\nConstruction\nPass 26,587 3,890 - - - - - - 30,477\nSpecial Mention 1,120 - - - - - - - 1,120\nTotal Construction 27,707 3,890 - - - - - - 31,597\nTotal real estate loans\nPass 2,712,796 1,826,030 796,787 872,041 1,027,276 3,101,952 1,990,195 129,336 12,456,413\nSpecial Mention 23,831 703 123 709 300 769 1,182 292 27,909\nSubstandard - 4,029 4,618 4,917 5,117 51,227 4,746 11,570 86,224\nTotal real estate loans $ 2,736,627 $ 1,830,762 $ 801,528 $ 877,667 $ 1,032,693 $ 3,153,948 $ 1,996,123 $ 141,198 $ 12,570,546\n(1) No new originations of Home Today loans since fiscal 2016.\nThe home equity lines of credit converted from revolving to term loans during the years ended September 30, 2022 and September 30, 2021 totaled $436 and $6,088.\nResidential loans are internally assigned a grade that complies with the guidelines outlined in the OCCs Handbook for Rating Credit Risk. Pass loans are assets well protected by the current paying capacity of the borrower. Special Mention loans have a potential weakness, as evaluated based on delinquency status or nature of the product, that the Company deems to deserve managements attention and may result in further deterioration in their repayment prospects and/or the Companys credit position. Substandard loans are inadequately protected by the current payment capacity of the borrower or the collateral pledged with a defined weakness that jeopardizes the liquidation of the debt. Also included in Substandard are performing home equity loans and lines of credit where the customer has a severely delinquent first mortgage to which the performing home equity loan or line of credit is subordinate and all loans in Chapter 7 bankruptcy status where all borrowers have filed, and have not reaffirmed or been dismissed. Loss loans are considered uncollectible and are charged-off when identified. Loss loans are of such little value that their continuance as bankable assets is not warranted even though partial recovery may be affected in the future.\nAt September 30, 2022 and September 30, 2021, respectively, $75,904 and $83,708 of TDRs individually evaluated for credit loss have adequately performed under the terms of the restructuring and are classified as Pass loans. At September 30, 2022 and September 30, 2021, respectively, $102 and $24,042 of loans classified as Special Mention are residential mortgage loans and home equity lines of credit identified, after origination, as being underwritten with altered income documentation, that have not yet demonstrated repayment performance over a minimum period. Substandard loans decreased between the periods presented primarily due to loans with forbearance plans extended greater than 12 months that are considered collateral dependent and classified substandard, for a minimum of one year, until a sustained period of repayment performance is satisfied. Loans classified substandard includes $5,381 and $28,029 of loans that had their forbearance term extended greater than 12 months regardless of forbearance plan status at September 30, 2022 and September 30, 2021, respectively.\nOther loans are internally assigned a grade of non-performing when they become 90 days or more past due. At September 30, 2022 and September 30, 2021, no other loans were graded as non-performing.\nTROUBLED DEBT RESTRUCTURINGS\nInitial concessions granted for loans restructured as TDRs may include reduction of interest rate, extension of amortization period, forbearance or other actions. Some TDRs have experienced a combination of concessions. TDRs also may occur as a result of bankruptcy proceedings. Loans discharged in Chapter 7 bankruptcy are classified as multiple restructurings if the loan's original terms had also been restructured by the Company. The amortized cost in TDRs by category as of September 30, 2022 and September 30, 2021 is shown in the tables below.\nSeptember 30, 2022 Initial Restructuring Multiple\nRestructurings Bankruptcy Total\nResidential Core $ 30,071 $ 17,583 $ 10,896 $ 58,550\nResidential Home Today 10,359 11,485 1,995 23,839\nHome equity loans and lines of credit 22,636 2,743 1,268 26,647\nTotal $ 63,066 $ 31,811 $ 14,159 $ 109,036\nSeptember 30, 2021 Initial Restructuring Multiple\nRestructurings Bankruptcy Total\nResidential Core $ 33,394 $ 20,499 $ 12,962 $ 66,855\nResidential Home Today 12,640 13,409 2,556 28,605\nHome equity loans and lines of credit 26,550 3,424 1,675 31,649\nTotal $ 72,584 $ 37,332 $ 17,193 $ 127,109\nTDRs may be restructured more than once. Among other requirements, a subsequent restructuring may be available for a borrower upon the expiration of temporary restructuring terms if the borrower is unable to resume contractually scheduled loan payments. If the borrower is experiencing an income curtailment that temporarily has reduced their capacity to repay, such as loss of employment, reduction of work hours, non-paid leave or short-term disability, a temporary restructuring is considered. If the borrower lacks the capacity to repay the loan at the current terms due to a permanent condition, a permanent restructuring is considered. In evaluating the need for a subsequent restructuring, the borrowers ability to repay is generally assessed utilizing a debt to income and cash flow analysis.\nFor all TDRs restructured during the years ended September 30, 2022 and September 30, 2021 (set forth in the tables below), the pre-restructured outstanding amortized cost was not materially different from the post-restructured outstanding amortized cost.\nNew TDRs decreased during recent periods as forbearance plan resolutions and subsequent modifications due to COVID-19 have become insignificant. The following tables set forth the amortized cost in TDRs restructured during the periods presented.\nFor the Year Ended September 30, 2022\nInitial Restructuring Multiple\nRestructurings Bankruptcy Total\nResidential Core $ 3,823 $ 1,533 $ 1,142 $ 6,498\nResidential Home Today 202 1,071 45 1,318\nHome equity loans and lines of credit 510 175 163 848\nTotal $ 4,535 $ 2,779 $ 1,350 $ 8,664\nFor the Year Ended September 30, 2021\nInitial Restructuring Multiple\nRestructurings Bankruptcy Total\nResidential Core $ 9,364 $ 1,981 $ 1,614 $ 12,959\nResidential Home Today 362 1,432 103 1,897\nHome equity loans and lines of credit 1,466 1,223 417 3,106\nTotal $ 11,192 $ 4,636 $ 2,134 $ 17,962\nFor the Year Ended September 30, 2020\nInitial Restructuring Multiple\nRestructurings Bankruptcy Total\nResidential Core $ 4,334 $ 3,233 $ 1,831 $ 9,398\nResidential Home Today 1,112 1,962 610 3,684\nHome equity loans and lines of credit 1,984 815 454 3,253\nTotal $ 7,430 $ 6,010 $ 2,895 $ 16,335\nThe table below summarizes information about TDRs restructured within 12 months of the period presented for which there was a subsequent payment default, at least 30 days past due on one scheduled payment, during the periods presented.\nFor the Year Ended September 30, 2022 For the Year Ended September 30, 2021 For the Year Ended September 30, 2020\nTDRs That Subsequently Defaulted Number of\nContracts Recorded\nInvestment Number of\nContracts Recorded\nInvestment Number of\nContracts Recorded\nInvestment\nResidential Core 5 $ 780 6 $ 948 9 $ 1,394\nResidential Home Today 5 90 7 194 9 441\nHome equity loans and lines of credit 2 108 1 42 4 282\nTotal 12 $ 978 14 $ 1,184 22 $ 2,117\n6. MORTGAGE LOAN SERVICING RIGHTS\nThe Company sells certain types of loans through whole loan sales and through securitizations. In each case, the Company retains a servicing interest in the loans or securitized loans. Certain assumptions and estimates are used to determine the fair value allocated to these retained interests at the date of transfer and at subsequent measurement dates. These assumptions and estimates include loan repayment rates and discount rates.\nChanges in interest rates can affect the average life of loans and mortgage-backed securities and the related servicing rights. A reduction in interest rates normally results in increased prepayments, as borrowers refinance their debt in order to reduce their borrowing costs. This creates reinvestment risk, which is the risk that the Company may not be able to reinvest the proceeds of loan and securities prepayments at rates that are comparable to the rates earned on the loans or securities prior to receipt of the repayment.\nDuring 2022, 2021 and 2020, $128,118, $796,512 and $810,116, respectively, of mortgage loans were securitized and/or sold including accrued interest thereon. In these transactions, the Company retained residual interests in the form of mortgage loan servicing rights. Primary economic assumptions used to measure the value of the Companys retained interests at the date of sale resulting from the completed transactions were as follows (per annum):\n2022 2021\nPrimary prepayment speed assumptions (weighted average annual rate) 11.9 % 13.9 %\nWeighted average life (years) 24.1 22.9\nAmortized cost to service loans (weighted average) 0.12 % 0.12 %\nWeighted average discount rate 12 % 12 %\nKey economic assumptions and the sensitivity of the current fair value of mortgage loan servicing rights to immediate 10% and 20% adverse changes in those assumptions are as presented in the following table. The three key economic assumptions that impact the valuation of the mortgage loan servicing rights are: (1) the prepayment speed, or how long the mortgage servicing right will be outstanding; (2) the estimate of servicing costs that will be incurred in fulfilling the mortgage servicing right responsibilities; and (3) the discount factor applied to future net cash flows to convert them to present value. The Company established these factors based on independent analysis of our portfolio and reviews these assumptions periodically to ensure that they reasonably reflect current market conditions and our loan portfolio experience.\nSeptember 30, 2022\nFair value of mortgage loan servicing rights $ 15,288\nPrepayment speed assumptions (weighted average annual rate) 15.0 %\nImpact on fair value of 10% adverse change $ (567)\nImpact on fair value of 20% adverse change $ (1,083)\nEstimated prospective annual cost to service loans (weighted average) 0.12 %\nImpact on fair value of 10% adverse change $ (1,320)\nImpact on fair value of 20% adverse change $ (2,640)\nDiscount rate 12.0 %\nImpact on fair value of 10% adverse change $ (528)\nImpact on fair value of 20% adverse change $ (1,017)\nThese sensitivities are hypothetical and should be used with caution. As indicated in the table above, changes in fair value based on a 10% variation in assumptions generally cannot be extrapolated because the relationship in the change in assumption to the change in fair value may not be linear. Also, the effect of a variation in a particular assumption on the fair value of the retained interest is calculated without changing any other assumption. In reality, changes in one factor may result in changes in another (for example, increases in market interest rates may result in lower prepayments), which could magnify or counteract the sensitivities.\nServicing rights are evaluated periodically for impairment based on the fair value of those rights. Twenty-two risk tranches are used in evaluating servicing rights for impairment, segregated primarily by interest rate stratum within original term to maturity categories with additional strata for less uniform account types.\nActivity in mortgage servicing rights is summarized as follows:\nYear Ended September 30,\n2022 2021 2020\nBalance-beginning of year $ 8,941 $ 7,860 $ 8,080\nAdditions from loan securitizations/sales 657 3,836 1,613\nAmortization (1)\n(1,655) (2,764) (1,824)\nNet change in valuation allowance - 9 (9)\nBalance-end of year $ 7,943 $ 8,941 $ 7,860\nFair value of capitalized amounts $ 15,288 $ 17,454 $ 12,487\n(1) Year ended September 30, 2021 and 2020 amounts include $199 and $1,063 respectively, related to the repurchase of loans previously sold and serviced by the Company.\nThe Company receives annual servicing fees ranging from 0.02% to 0.98% of the outstanding loan balances. Servicing income, net of amortization of capitalized servicing rights, included in non-interest income, amounted to $4,251 in 2022, $3,260 in 2021 and $3,365 in 2020. The unpaid principal balance of mortgage loans serviced for others was approximately $2,051,110, $2,262,875 and $2,007,319 at September 30, 2022, 2021 and 2020, respectively. The ratio of capitalized servicing rights to the unpaid principal balance of mortgage loans serviced for others was 0.39%, 0.40%, and 0.39% at September 30, 2022, 2021 and 2020, respectively.\n7. PREMISES, EQUIPMENT AND SOFTWARE, NET\nPremises, equipment and software at cost are summarized as follows:\nSeptember 30,\n2022 2021\nLand $ 8,610 $ 8,688\nOffice buildings 61,312 60,661\nFurniture, fixtures and equipment 39,899 39,266\nSoftware 20,048 19,962\nLeasehold improvements 11,071 10,768\n140,940 139,345\nLess: accumulated depreciation and amortization (106,409) (101,925)\nTotal $ 34,531 $ 37,420\nDuring the years ended September 30, 2022, 2021 and 2020, depreciation and amortization expense on premises, equipment, and software was $5,393, $5,422 and $5,435, respectively.\nThe Company, as lessor, previously leased certain commercial office buildings. The office buildings and land were sold during the year ended September 30, 2020. The Company's share of the gain on the sale was $4,665. During the year ended September 30, 2020, rental income was $5, and appears in other non-interest income in the accompanying statements. Depreciation expense on the buildings during fiscal 2020 was $48. There was no activity for 2022 and 2021.\n8. LEASES\nAs a lessee, the Company enters into operating leases of buildings and land. The Company occupies certain banking branches, loan production and customer service offices and a disaster recovery site through non-cancellable operating leases with remaining terms from less than one year to 14 years. Most of the leases have fixed payment terms with annual fixed-escalation clauses. Certain leases have annual rent escalations based on subsequent year-to-year changes in the consumer price index. These year-to-year changes in the consumer price index are excluded from the calculation of right-of-use assets and lease liabilities and recognized as expense in the period in which they are incurred. Additionally, all variable lease costs that are not based on an index or rate, such as \"common area maintenance\" costs, are expensed as incurred. Most of the Company's leases include options to extend for periods that range from three to 10 years. The leases do not have early-termination options. The Company has not included term extensions in the calculation of the lease term, as the Company does not consider it reasonably certain that the options will be exercised. As the interest rate implicit in all of the Company's lease contracts is not readily determinable, the Company utilized its incremental borrowing rate, which is the rate that would be incurred to borrow on a collateralized basis over a similar term on an amount equal to the total contractual lease payments in a similar economic environment. The incremental borrowing rate utilized for all the Company's leases is the FHLB Advance rate based on the lease term at commencement in determining the present value of lease payments.\nOperating lease expense for the years ended September 30, 2022 and 2021, totaled $5,576 and $5,351, respectively. Variable lease expense for the years ended September 30, 2022 and 2021, totaled $1,479 and $1,374, respectively. During the years ended September 30, 2022 and 2021, the Company paid $5,572 and $5,354, respectively, in cash for amounts included in the measurement of lease liabilities. As of September 30, 2022 and 2021, the Company has not entered into any material leases that have not yet commenced.\nThe following table summarizes information relating to the Company's operating leases:\nSeptember 30,\n2022 2021\nRight-of-use assets (a) $ 30,189 $ 27,923\nLease liabilities (b) $ 15,775 $ 18,461\nWeighted Average Remaining Lease Term 5.06 years 5.51 years\nWeighted Average Discount Rate 1.49 % 1.51 %\n(a) Included in Other assets in the CONSOLIDATED STATEMENTS OF CONDITION\n(b) Included in Accrued expenses and other liabilities in the CONSOLIDATED STATEMENTS OF CONDITION\nThe following table summarizes the maturities of lease liabilities at the periods presented:\nSeptember 30,\n2022 2021\nMaturing in:\n12 months or less $ 4,953 $ 5,128\n13 to 24 months 3,903 4,334\n25 to 36 months 3,044 3,400\n37 to 48 months 1,810 2,570\n49 to 60 months 591 1,321\nover 60 months 2,230 2,640\nTotal minimum lease payments 16,531 19,393\nLess imputed interest 756 932\nTotal lease liabilities $ 15,775 $ 18,461\n9. DEPOSITS\nDeposit account balances are summarized by interest rate as follows:\nStated\nInterest\nRate September 30,\n2022 2021\nAmount Percent Amount Percent\nChecking accounts 0.00-1.00%\n$ 1,210,035 13.6 % $ 1,132,910 12.6 %\nSavings accounts, excluding money market accounts 0.00-1.05\n1,364,821 15.3 1,263,309 14.0\nMoney market accounts 0.00-1.05\n481,650 5.4 563,931 6.3\nSubtotal 3,056,506 34.3 2,960,150 32.9\nCertificates of deposit 0.00-0.99\n3,157,495 35.4 3,335,102 37.1\n1.00-1.99\n1,002,227 11.2 808,105 9.0\n2.00-2.99\n1,320,579 14.8 1,574,939 17.5\n3.00 and above\n381,973 4.3 313,457 3.5\n5,862,274 65.7 6,031,603 67.1\nSubtotal 8,918,780 100.0 8,991,753 100.0\nAccrued interest 2,237 - 1,852 -\nTotal deposits $ 8,921,017 100.0 % $ 8,993,605 100.0 %\nAt September 30, 2022 and 2021, the weighted average interest rate was 0.81% and 0.09% on checking accounts; 0.79% and 0.12% on savings accounts; 0.95% and 0.19% on money market accounts; 1.37% and 1.26% on certificate of deposit, respectively; and 1.18% and 0.89% on total deposits, respectively.\nThe aggregate amount of CD's in denominations of $250 or more was $733,301 and $693,375 at September 30, 2022 and 2021, respectively. In accordance with the DFA, the maximum amount of deposit insurance is $250 per depositor.\nBrokered CD's (exclusive of acquisition costs and subsequent amortization), which are used as an additional funding alternative, totaled $575,236 and $491,994 at September 30, 2022 and 2021, respectively. The FDIC places restrictions on banks with regard to issuing brokered deposits based on the bank's capital classification. As a well-capitalized institution at September 30, 2022 and September 30, 2021, the Association may accept brokered deposits without FDIC restrictions.\nThe scheduled maturity of certificates of deposit is as follows:\nSeptember 30, 2022\nAmount Percent Weighted\nAverage\nRate\n12 months or less $ 3,015,505 51.5 % 1.02 %\n13 to 24 months 1,015,842 17.3 % 1.51 %\n25 to 36 months 814,248 13.9 % 1.49 %\n37 to 48 months 476,759 8.1 % 1.50 %\n49 to 60 months 510,856 8.7 % 2.81 %\nOver 60 months 29,064 0.5 % 1.32 %\nTotal $ 5,862,274 100.0 % 1.36 %\nInterest expense on deposits is summarized as follows:\nYear Ended September 30,\n2022 2021 2020\nCertificates of deposit $ 68,204 $ 93,187 $ 130,990\nChecking accounts 4,186 1,140 1,477\nSavings and Money Market accounts 4,553 2,992 7,775\nTotal $ 76,943 $ 97,319 $ 140,242\n10. BORROWED FUNDS\nAt September 30, 2022, the Association had a maximum borrowing capacity of $9,237,184, of which $4,793,221 was outstanding. Borrowings from the FHLB of Cincinnati are secured by the Associations investment in the common stock of the FHLB of Cincinnati as well as by a blanket pledge of its mortgage portfolio not otherwise pledged. The Association also has the ability to purchase Fed Funds through arrangements with other institutions. Finally, the ability to borrow from the FRB-Cleveland Discount Window is available to the Association and is secured by a pledge of specific loans in the Associations mortgage portfolio.\nTotal borrowings at September 30, 2022 are summarized in the table below:\nBorrowing Capacity Borrowings Available Borrowings Outstanding\nFHLB $ 8,474,183 $ 3,912,447 $ 4,561,736\nFRB Cleveland 168,001 168,001 -\nFed Funds Purchased 595,000 370,000 225,000\nSubtotal $ 9,237,184 $ 4,450,448 4,786,736\nAccrued Interest 6,485\nTotal Borrowings $ 4,793,221\nMaturities of borrowings at September 30, 2022 are summarized in the table below:\nAmount Weighted Average Rate\nMaturing in:\n12 months or less $ 2,225,182 2.93 %\n13 to 24 months 775,000 1.50 %\n25 to 36 months 625,000 1.42 %\n37 to 48 months 500,789 1.97 %\n49 to 60 months\n600,000 2.72 %\nover 60 months 60,765 2.93 %\nTotal Advances $ 4,786,736 2.38 %\nAccrued interest 6,485\nTotal $ 4,793,221\nAll borrowings have fixed rates during their term ranging up to 240 months. Interest is payable monthly for long-term advances and at maturity for FHLB three-month advances and overnight advances. The table above reflects the effective maturities and fixed interest rates of the $1,550,000 of short-term FHLB advances that are tied to interest rate swaps discussed in Note 17. DERIVATIVE INSTRUMENTS.\nFor the years ended September 30, 2022, 2021 and 2020, net interest expense related to short-term borrowings was $49,828, $50,975 and $61,058, respectively.\nIn March 2021, the Association received a second consecutive Needs to Improve rating on its Community Reinvestment Act (CRA) examination covering the period ending December 31, 2019. The FHFA practice is to place member institutions in this situation on restriction. When this restriction is established, the Association will not have access to FHLB long-term advances (maturities greater than one year) until the rating improves. However, the Association has not received the notice of this restriction as of November 22, 2022. Existing advances and future advances with less than a one year term, including 90 day advances used to facilitate longer term interest rate swap agreements, will not be affected. The Association does not expect any impact to its ability to access funding.\n11. OTHER COMPREHENSIVE INCOME (LOSS)\nThe change in AOCI by component is as follows:\nUnrealized Gains (Losses) on Securities Available for Sale Cash Flow Hedges Defined Benefit Plan Total\nFiscal year 2020 activity\nBalance at September 30, 2019 $ (2,165) $ (44,915) $ (22,299) $ (69,379)\nOther comprehensive income (loss) before reclassifications, net of tax expense (benefit) of $(22,316)\n6,859 (88,948) (1,862) (83,951)\nAmounts reclassified, net of tax expense (benefit) of $5,680\n- 19,557 1,808 21,365\nOther comprehensive income (loss) 6,859 (69,391) (54) (62,586)\nBalance at September 30, 2020 $ 4,694 $ (114,306) $ (22,353) $ (131,965)\nFiscal year 2021 activity\nOther comprehensive income (loss) before reclassifications, net of tax expense (benefit) of $8,656\n(3,733) 20,914 9,937 27,118\nAmounts reclassified, net of tax expense (benefit) of $9,907\n- 35,182 1,864 37,046\nOther comprehensive income (loss) (3,733) 56,096 11,801 64,164\nBalance at September 30, 2021 $ 961 $ (58,210) $ (10,552) $ (67,801)\nFiscal year 2022 activity\nOther comprehensive income (loss) before reclassifications, net of tax expense (benefit) of $21,242\n(34,860) 109,452 (1,665) 72,927\nAmounts reclassified, net of tax expense (benefit) of $5,212\n- 17,641 382 18,023\nOther comprehensive income (loss) (34,860) 127,093 (1,283) 90,950\nBalance at September 30, 2022 $ (33,899) $ 68,883 $ (11,835) $ 23,149\nThe following table presents the reclassification adjustment out of AOCI included in net income and the corresponding line item on the CONSOLIDATED STATEMENTS OF INCOME for the periods indicated:\nDetails about AOCI Components For the Years Ended September 30, Line Item in the Statement of Income\n2022 2021 2020\nCash flow hedges:\nInterest (income) expense $ 22,740 $ 44,534 $ 24,757 Interest expense\nNet income tax effect (5,099) (9,352) (5,200) Income tax expense\nNet of income tax expense (benefit) $ 17,641 $ 35,182 $ 19,557\nAmortization of defined benefit plan:\nActuarial loss $ 495 $ 2,419 $ 2,288 (a)\nNet income tax effect (113) (555) (480) Income tax expense\nNet of income tax expense 382 1,864 1,808\nTotal reclassifications for the period $ 18,023 $ 37,046 $ 21,365\n(a) These items are included in the computation of net period pension cost. See Note 13. EMPLOYEE BENEFIT PLANS for additional disclosure.\n12. INCOME TAXES\nThe components of the income tax provision are as follows:\nYear Ended September 30,\n2022 2021 2020\nCurrent tax expense (benefit):\nFederal $ 41,812 $ 31,043 $ (5,237)\nState 2,553 2,230 473\nDeferred tax expense (benefit):\nFederal (24,691) (13,548) 20,487\nState (2,185) (638) 1,205\nIncome tax provision $ 17,489 $ 19,087 $ 16,928\nReconciliation from tax at the federal statutory rate to the income tax provision is as follows:\nYear Ended September 30,\n2022 2021 2020\nTax at statutory rate 21.0 % 21.0 % 21.0 %\nState tax, net 0.3 1.3 1.3\nNon-taxable income from bank owned life insurance contracts (2.3) (2.1) (1.5)\nNon-deductible compensation 1.4 0.9 1.1\nEquity based compensation (0.1) (1.3) (0.5)\nNOL carryback claim rate benefit under CARES Act - - (3.6)\nOther, net (1.3) (0.7) (0.9)\nIncome tax provision 19.0 % 19.1 % 16.9 %\nTemporary differences between the financial statement carrying amounts and tax basis of assets and liabilities that gave rise to significant portions of net deferred taxes relate to the following:\nSeptember 30,\n2022 2021\nDeferred tax assets:\nLoan loss reserve $ 27,659 $ 25,728\nDeferred compensation 4,198 4,159\nLease liability 3,599 4,227\nProperty, equipment and software basis difference 1,413 1,263\nOther 2,220 2,259\nTotal deferred tax assets 39,089 37,636\nDeferred tax liabilities:\nFHLB stock basis difference 5,017 5,036\nMortgage servicing rights 1,551 1,699\nPension 2,119 2,220\nGoodwill 2,132 2,137\nLease ROU asset 3,514 4,142\nDeferred loan costs, net of fees 13,371 11,606\nOther 2,219 2,051\nTotal deferred tax liabilities 29,923 28,891\nNet deferred tax asset $ 9,166 $ 8,745\nIn the accompanying CONSOLIDATED STATEMENTS OF CONDITION the net deferred tax asset is included in Other assets.\nA valuation allowance is established to reduce deferred tax assets if it is more likely than not that the related tax benefits will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. There was no valuation allowance required at September 30, 2022 or 2021.\nRetained earnings at September 30, 2022 and 2021 included approximately $104,861 for which no provision for federal or state income tax has been made. This amount represents allocations of income during years prior to 1988 to bad debt deductions for tax purposes only. These qualifying and nonqualifying base year reserves and supplemental reserves will be recaptured into income in the event of certain distributions and redemptions. Such recapture would create income for tax purposes only, which would be subject to the then current corporate income tax rate. However, recapture would not occur upon the reorganization, merger, or acquisition of the Association, nor if the Association is merged or liquidated tax-free into a bank or undergoes a charter change. If the Association fails to qualify as a bank or merges into a nonbank entity, these reserves will be recaptured into income.\nThe provisions of Accounting for Uncertainty in Income Taxes, codified within FASB ASC 740 Income Taxes, prescribe a recognition threshold and measurement attribute for the financial statement recognition and measurement for a tax position taken or expected to be taken in a tax return. FASB ASC 740 also provides guidance on derecognition, classification, interest and penalties, accounting in interim periods, disclosure and transition. Tax positions must meet a more-likely-than-not recognition threshold in order for the related tax benefit to be recognized or continue to be recognized. As of September 30, 2022 and 2021, the Company had no unrecognized tax benefits. The Company does not anticipate the total amount of unrecognized tax benefits to significantly change within the next twelve months.\nThe Company recognizes interest and penalties on income tax assessments or income tax refunds, where applicable, in the financial statements as a component of its provision for income taxes. The Company recognized $0, $9, and $0 interest expense or penalties on income tax assessments, and $34, $116, and $0 of interest on income tax refunds related to net operating loss carrybacks during the years ended September 30, 2022, 2021 and 2020, respectively. There was no interest related to income tax assessments accrued at September 30, 2022 or 2021.\nThe Companys effective income tax rate was 19.0%, 19.1% and 16.9% for the years ended September 30, 2022, 2021 and 2020, respectively. The increase in the effective rate for the year ended September 30, 2021 compared to the same period during fiscal 2020 is primarily due to the impact of a CARES Act provision, which permitted a carry back of net tax operating losses to years taxed at higher rates, and resulted in a tax benefit of $3,607 during the year ended September 30, 2020. This is offset by an increase in permanent tax benefits from BOLI contracts.\nThe Company and its subsidiaries file income tax returns in the U.S. federal jurisdiction and various state and city jurisdictions. With few exceptions, the Company is no longer subject to income tax examinations in its major jurisdictions for tax years prior to 2019.\nThe Company makes certain investments in limited partnerships which invest in affordable housing projects that qualify for the Low Income Housing Tax Credit (\"LIHTC\"). The Company acts as a limited partner in these investments and does not exert control over the operating or financial policies of the partnership. The Company accounts for its interests in LIHTCs using the proportional amortization method. The impact of the Company's investments in tax credit entities on the provision for income taxes was not material for the years ended September 30, 2022, 2021 and 2020.\n13. EMPLOYEE BENEFIT PLANS\nDefined Benefit Plan-The Third Federal Savings Retirement Plan (the Plan) is a defined benefit pension plan. Effective December 31, 2002, the Plan was amended to limit participation to employees who met the Plans eligibility requirements on that date. Effective December 31, 2011, the Plan was amended to freeze future benefit accruals for participants in the Plan. After December 31, 2002, employees not participating in the Plan, upon meeting the applicable eligibility requirements, and those eligible participants who no longer receive service credits under the Plan, participate in a separate tier of the Companys defined contribution 401(k) Savings Plan. Benefits under the Plan are based on years of service and the employees average annual compensation (as defined in the Plan) through December 31, 2011. The funding policy of the Plan is consistent with the funding requirements of U.S. federal and other governmental laws and regulations. During the fiscal years ending 2022 and 2021, a settlement adjustment was recognized as a result of lump sum payments exceeding the interest costs for the year.\nThe following table sets forth the change in projected benefit obligation for the defined benefit plan:\nSeptember 30,\n2022 2021\nProjected benefit obligation at beginning of year $ 88,276 $ 94,941\nInterest cost 2,628 2,536\nActuarial (gain) loss and other (19,783) (2,273)\nSettlement (4,292) (5,112)\nBenefits paid (1,814) (1,816)\nProjected benefit obligation at end of year $ 65,015 $ 88,276\nThe following table reconciles the beginning and ending balances of the fair value of Plan assets and presents the funded status of the Plan recognized in the CONSOLIDATED STATEMENTS OF CONDITION at the September 30 measurement dates. There were no employer contributions in the years ending September 30, 2022 and 2021.\nSeptember 30,\n2022 2021\nFair value of plan assets at beginning of year $ 97,971 $ 89,275\nActual return on plan assets (17,823) 15,624\nBenefits paid (1,814) (1,816)\nSettlement (4,292) (5,112)\nFair value of plan assets at end of year $ 74,042 $ 97,971\nFunded status of the plan-asset (liability) $ 9,027 $ 9,695\nThe components of net periodic cost recognized in other non-interest expense in the CONSOLIDATED STATEMENTS OF INCOME are as follows:\nYear Ended September 30,\n2022 2021 2020\nInterest Cost $ 2,628 $ 2,536 $ 2,797\nExpected return on plan assets (4,987) (4,997) (4,652)\nAmortization of net loss and other 576 1,466 2,288\nRecognized net loss due to settlement 882 792 1,174\nNet periodic benefit (income) cost $ (901) $ (203) $ 1,607\nThere were no contributions, required minimum or voluntary, made during the fiscal year ended September 30, 2022.\nPlan assets consist of investments in mutual funds and pooled separate accounts that invest in fixed securities such as asset backed securities, commercial mortgage backed securities and corporate bonds, in addition to some short-term securities such as commercial paper. The Plan reallocated some of its investments to long duration fixed income mutual funds as a strategy to reduce risk in the portfolio as funded status remains elevated. As the mutual funds invested in are traded in active markets with readily available prices, these types of investments are included in level 1 of the fair value hierarchy. Pooled separate accounts\nare valued at net asset value per share at the reporting date. The fair values of the underlying investments used to determine net asset value of the pooled separate accounts are primarily based on pricing from an independent third party pricing source. In accordance with Subtopic 820-10, certain investments measured at fair value using the net asset value per share practical expedient are not classified in the fair value hierarchy described in Note 16. FAIR VALUE.\nDuring fiscal years ending 2022 and 2021, the fair value of mutual funds were valued at $30,271 and $0, respectively, in level 1 of the fair value hierarchy. The following tables present the fair value of pooled separate account assets:\nSeptember 30,\n2022 2021\nFair Value\n(in thousands) Unfunded Commitments Redemption Frequency\n(if currently eligible) Redemption Notice Period Fair Value\n(in thousands) Unfunded Commitments Redemption Frequency\n(if currently eligible) Redemption Notice Period\nPooled Separate Accounts $ 43,771 N/A Daily 7 days $ 97,971 N/A Daily 7 days\nThere are no redemption restrictions on Plan assets at September 30, 2022. Redemptions may be deferred for a longer period if conditions do not permit an orderly transfer or for certain investments of an illiquid nature.\nThe following additional information is provided with respect to the Plan:\nSeptember 30,\n2022 2021 2020\nAssumptions and dates used to determine benefit obligations:\nDiscount rate 5.35 % 2.85 % 2.65 %\nRate of compensation increase n/a n/a n/a\nAssumptions used to determine net periodic benefit cost:\nDiscount rate 4.60 % 2.80 % 3.20 %\nLong-term rate of return on plan assets 5.50 % 5.50 % 6.00 %\nRate of compensation increase (graded scale) n/a n/a n/a\nThe expected long-term return on plan assets assumption was developed as a weighted average rate based on the target asset allocation of the plan and the Long-Term Capital Market Assumptions for the corresponding fiscal year end. Management evaluates the historical performance of the various asset categories, as well as current expectations in determining the adequacy of the assumed rates of return in meeting Plan obligations. If warranted, the assumption is modified.\nThe following table provides estimates of expected future benefit payments during each of the next five fiscal years, as well as in the aggregate for years six through ten. Additionally, the table includes the minimum employer contributions expected during the next fiscal year:\nExpected Benefit Payments During the Fiscal Years Ending September 30:\n2023 $ 5,750\n2024 4,530\n2025 4,260\n2026 4,300\n2027 4,360\nAggregate expected benefit payments during the five fiscal year period beginning October 1, 2028, and ending September 30, 2032 23,540\nMinimum employer contributions expected to be paid during the fiscal year ending September 30, 2023 -\nFor the fiscal years ended September 30, 2022, 2021, and 2020, AOCI includes pretax net actuarial losses of $15,255, $13,686, and $28,843, respectively, which have not been recognized as components of net periodic benefit costs as of the measurement date. The Company expects that $1,020 of net actuarial losses will be recognized as AOCI components of net periodic benefit cost during the fiscal year ended September 30, 2023.\n401(k) Savings Plan-The Company maintains a 401(k) savings plan that is comprised of three tiers. The first tier allows eligible employees to contribute up to 75% of their compensation to the plan, subject to limitations established by the Internal\nRevenue Service, with the Company matching 100% of up to 4% on funds contributed. The second tier permits the Company to make a profit-sharing contribution at its discretion. The first and second tiers cover substantially all employees who have reached age 18 and have worked 1,000 hours in one year of service. The third tier permits the Company to make discretionary contributions allocable to eligible employees including those eligible employees who are participants, but no longer receiving service credits, under the Companys defined benefit pension plan. Voluntary contributions made by employees are vested at all times whereas Company contributions and Company matching contributions are subject to various vesting periods which range from immediately vested to fully vesting upon five years of service.\nThe total of the Companys matching and discretionary contributions related to the 401(k) savings plan for the years ended September 30, 2022, 2021 and 2020 was $4,295, $4,187 and $4,042, respectively.\nEmployee (Associate) Stock Ownership Plan-The Company established an ESOP for its employees effective January 1, 2006. The ESOP is a tax-qualified plan designed to invest primarily in the Companys common stock and provides employees with an opportunity to receive a funded retirement benefit, based on the value of the Companys common stock. The ESOP covers all eligible employees of the Company and its wholly-owned subsidiaries. Employees are eligible to participate in the ESOP after attainment of age 18, completion of 1,000 hours of service, and employment on the last day of the plans calendar year. Company contributions to the plan are at the discretion of the Board of Directors. The ESOP is accounted for in accordance with the provisions for stock compensation in FASB ASC 718. Compensation expense for the ESOP is based on the market price of the Companys stock and is recognized as shares are committed to be released to participants. The total compensation expense related to this plan in the 2022, 2021 and 2020 fiscal years was $7,063, $8,270 and $7,367, respectively.\nThe ESOP was authorized to purchase, and did purchase, 11,605,824 shares of the Companys common stock at a price of $10 per share with a 2006 plan year cash contribution and the proceeds of a loan from the Company to the ESOP. The outstanding loan principal balance as of September 30, 2022 and 2021 was $41,927 and $46,454, respectively. Shares of the Companys common stock pledged as collateral for the loan are released from the pledge for allocation to participants as loan payments are made. At September 30, 2022, 8,139,108 shares have been allocated to participants and 325,005 shares were committed to be released. Shares that are committed to be released will be allocated to participants at the end of the plan year (December 31). ESOP shares that are unallocated or not yet committed to be released totaled 3,141,711 at September 30, 2022, and had a fair market value of $40,842. Participants have the option to receive dividends on allocated shares in cash or leave the dividend in the ESOP. Dividends are reinvested in Company stock for those participants who choose to leave their dividends in the ESOP or who do not make an election. The purchase of Company stock for reinvestment of dividends is made in the open market on or about the date of the cash disbursement to the participants who opt to take dividends in cash. Dividends on unallocated shares held in the Employer Stock fund were paid to the trustee to be used to make payments on the outstanding loan obligation.\n14. EQUITY INCENTIVE PLAN\nThe TFS Financial Corporation Amended and Restated 2008 Equity Incentive Plan, approved by shareholders in February 2018 and the 2008 Equity Incentive Plan, approved by shareholders in May 2008, are collectively referred to as the \"Equity Plan. The amended and restated plan is substantially similar to the previous plan, except that the number of future shares eligible to be granted has been reduced to 8,450,000 shares, of which 7,418,782 shares remain available for future award, and the term to grant shares has been extended to February 21, 2028.\nThe Company recorded excess tax benefits of $109, $1,331, and $485 related to share-based compensation awards for the years ended September 30, 2022, 2021 and 2020, respectively.\nThe following table presents share-based compensation expense and the related tax benefit recognized during the periods presented:\nYear Ended September 30,\n2022 2021 2020\nRestricted stock units expense $ 3,206 $ 4,160 $ 3,303\nPerformance share units expense 739 1,214 917\nStock option expense - 68 531\nTotal stock-based compensation expense $ 3,945 $ 5,442 $ 4,751\nTax benefit related to share-based compensation expense $ 677 $ 999 $ 824\nRestricted stock units vest over a one to 10 year service period. The product of the number of units granted and the grant date market price of the Companys common stock determines the fair value of restricted stock units under the Equity Plan. The\nCompany recognizes compensation expense for the fair value of restricted stock units on a straight-line basis over the requisite service period.\nThe following is a summary of the status of the Companys restricted stock units as of September 30, 2022 and changes therein during the year then ended:\nNumber of\nShares\nAwarded Weighted\nAverage\nGrant Date\nFair Value\nOutstanding at September 30, 2021 1,281,910 $ 14.21\nGranted 126,200 $ 17.80\nReleased (124,662) $ 17.53\nForfeited (25,550) $ 17.77\nOutstanding at September 30, 2022 (1) 1,257,898 $ 14.17\n(1) Includes 765,748 shares with a weighted average grant date fair value of $11.87 that have vested but will not be issued until the recipients are no longer employed by the Company.\nThe weighted average grant date fair value of restricted stock units granted during the years ended September 30, 2022, 2021 and 2020 was $17.80, $17.77 and $19.76 per share, respectively. The total fair value of restricted stock units vested during the years ended September 30, 2022, 2021 and 2020 was $2,058, $6,981, and $1,676, respectively. Expected future compensation expense relating to the non-vested restricted stock units at September 30, 2022 is $3,598 over a weighted average period of 1.86 years.\nPerformance share units vest in the form of Company common stock issued at the end of a three-year period, based on the pro-rata achievement of performance based metrics over a two-year period. The range of payout is zero to 150% of the number of share units granted. For performance stock units, fair value is estimated as the product of the number of performance units granted, adjusted for the probability of achievement, and the grant date market price of the Companys common stock. The Company recognizes compensation expense for the fair value of performance share units on a straight-line basis over the requisite service period, based on the performance condition that is probable of achievement. Probability of achievement is reassessed at each reporting period and the cumulative effect of a change in estimate, if any, is recognized in the period of change. Cash dividend equivalents are accrued and paid only if and when the underlying units become vested and payable.\nThe following is a summary of the status of the Companys performance share units as of September 30, 2022 and changes therein during the year then ended. No awards were forfeited during the year ended September 30, 2022.\nNumber of\nShares\nAwarded Weighted\nAverage\nGrant Date\nFair Value\nOutstanding at September 30, 2021 182,069 17.46\nGranted 53,100 17.80\nReleased (71,692) 15.54\nPerformance adjustment 6,477 19.76\nOutstanding at September 30, 2022 169,954 18.46\nThe weighted average grant date fair value of performance share units granted during the year ended September 30, 2022, 2021 and 2020 was $17.80, $17.77, and $19.76, respectively. The total fair value of performance share units vested during the years ended September 30, 2022, 2021 and 2020, respectively, totaled $1,112, $14, and $0. Expected future compensation expense relating to the non-vested performance share units at September 30, 2022 is $1,031 over a weighted average period of 1.83 years.\nStock options have a contractual term of 10 years and vest over a one to seven year service period. The Company recognizes compensation expense for the fair values of these awards, which have installment vesting, on a straight-line basis over the requisite service period of the awards.\nThe following is a summary of the Companys stock option activity and related information for the Equity Plan for the year ended September 30, 2022. There were no stock options granted during 2022, 2021 and 2020.\nNumber of\nStock Options Weighted\nAverage\nExercise\nPrice Weighted\nAverage\nRemaining\nContractual\nLife (years) Aggregate\nIntrinsic\nValue\nOutstanding at September 30, 2021 2,463,300 $ 14.98 4.25 $ 10,095\nExercised (99,525) $ 11.16 $ 551\nForfeited (2,600) $ 15.82 $ -\nOutstanding at September 30, 2022 2,361,175 $ 15.14 3.32 $ 429\nVested and exercisable, at September 30, 2022 2,361,175 $ 15.14 3.32 $ 429\nVested or expected to vest, at September 30, 2022 2,361,175 $ 15.14 3.32 $ 429\nThe total intrinsic value of options exercised during the years ended September 30, 2022, 2021 and 2020 was $551, $8,605 and $3,941. There were no non-vested options outstanding as of September 30, 2022. Upon exercise of vested options, management expects to draw on treasury stock as the source of the shares.\n15. COMMITMENTS AND CONTINGENT LIABILITIES\nIn the normal course of business, the Company enters into commitments with off-balance-sheet risk to meet the financing needs of its customers. Commitments to extend credit are agreements to lend to a customer as long as there is no violation of any condition established in the contract. Commitments to originate loans generally have fixed expiration dates of 60 to 360 days or other termination clauses and may require payment of a fee. Unfunded commitments related to home equity lines of credit generally expire from five to 10 years following the date that the line of credit was established, subject to various conditions including compliance with payment obligation, adequacy of collateral securing the line and maintenance of a satisfactory credit profile by the borrower. Since some of the commitments may expire without being drawn upon, the total commitment amounts do not necessarily represent future cash requirements.\nOff-balance sheet commitments to extend credit involve elements of credit risk and interest rate risk in excess of the amount recognized in the CONSOLIDATED STATEMENTS OF CONDITION. The Companys exposure to credit loss in the event of nonperformance by the other party to the commitment is represented by the contractual amount of the commitment. The Company generally uses the same credit policies in making commitments as it does for on-balance-sheet instruments. The allowance for credit losses related to off-balance sheet commitments is recorded in other liabilities in the CONSOLIDATED STATEMENTS OF CONDITION. Refer to Note 5. LOANS AND ALLOWANCES FOR CREDIT LOSSES for discussion on credit loss methodology. Interest rate risk on commitments to extend credit results from the possibility that interest rates may have moved unfavorably from the position of the Company since the time the commitment was made.\nAt September 30, 2022, the Company had commitments to originate loans and related allowances as follows:\nCommitment Allowance\nFixed-rate mortgage loans $ 229,194 $ 930\nAdjustable-rate mortgage loans 152,057 616\nEquity loans and lines of credit 157,465 1,977\nTotal $ 538,716 $ 3,523\nAt September 30, 2022, the Company had unfunded commitments outstanding and related allowances as follows:\nCommitment Allowance\nHome equity lines of credit $ 4,084,843 $ 22,876\nConstruction loans 72,273 623\nTotal $ 4,157,116 $ 23,499\nAt September 30, 2022, the unfunded commitment on home equity lines of credit, including commitments for accounts suspended as a result of material default or a decline in equity, is $4,105,486.\nThe above commitments are expected to be funded through normal operations.\nThe Company is undergoing an escheat audit covering Ohio and Kentucky. Any potential loss that may result from this matter is not reasonably estimable at September 30, 2022.\nThe Company and its subsidiaries are subject to various legal actions arising in the normal course of business. In the opinion of management, the resolution of these legal actions is not expected to have a material adverse effect on the Companys consolidated financial condition, results of operation, or statements of cash flows.\n16. FAIR VALUE\nUnder U.S. GAAP, fair value is defined as the price that would be received to sell an asset, or paid to transfer a liability, in an orderly transaction between market participants at the measurement date under current market conditions. A fair value framework is established whereby assets and liabilities measured at fair value are grouped into three levels of a fair value hierarchy, based on the transparency of inputs and the reliability of assumptions used to estimate fair value. The three levels of\ninputs are defined as follows:\nLevel 1 - quoted prices (unadjusted) for identical assets or liabilities in active markets.\nLevel 2 -\nquoted prices for similar assets or liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets with few transactions, or model-based valuation techniques using assumptions that are observable in the market.\nLevel 3 - a companys own assumptions about how market participants would price an asset or liability.\nAs permitted under the fair value guidance in U.S. GAAP, the Company elects to measure at fair value mortgage loans classified as held for sale that are subject to pending agency contracts to securitize and sell loans. This election is expected to reduce volatility in earnings related to market fluctuations between the contract trade and settlement dates. At September 30, 2022 and September 30, 2021, respectively, there were no pending agency contracts held for sale. For the years ended September 30, 2022, 2021, and 2020, net gain (loss) on the sale of loans includes $0, $134 and $2,026, respectively, related to unrealized gains or losses during the period due to changes in the fair value of loans held for sale subject to pending agency contracts.\nPresented below is a discussion of the methods and significant assumptions used by the Company to estimate fair value.\nInvestment Securities Available for Sale-Investment securities available for sale are recorded at fair value on a recurring basis. At September 30, 2022 and 2021, respectively, this includes $457,908 and $421,783 of investments in U.S. government and agency obligations including U.S. Treasury notes and highly liquid collateralized mortgage obligations issued by Fannie Mae, Freddie Mac, and Ginnie Mae, both measured using the market approach. The fair values of investment securities represent unadjusted price estimates obtained from third party independent nationally recognized pricing services using pricing models or quoted prices of securities with similar characteristics and are included in Level 2 of the hierarchy. Third party pricing is reviewed on a monthly basis for reasonableness based on the market knowledge and experience of company personnel that interact daily with the markets for these types of securities.\nMortgage Loans Held for Sale-The fair value of mortgage loans held for sale is estimated on an aggregate basis using a market approach based on quoted secondary market pricing for loan portfolios with similar characteristics. Loans held for sale are carried at the lower of cost or fair value except, as described above, the Company elects the fair value measurement option for mortgage loans held for sale subject to pending agency contracts to securitize and sell loans. Loans held for sale are included in Level 2 of the hierarchy. At September 30, 2022 and 2021, there were $9,661 and $0, respectively, of loans held for sale measured at fair value and $0 and $8,848, respectively, of loans held for sale carried at cost. Interest income on mortgage loans held for sale is recorded in interest income on loans.\nCollateral-dependent Loans-Collateral-dependent loans represent certain loans held for investment that are subject to a fair value measurement under U.S. GAAP because they are individually evaluated using a fair value measurement, such as the fair value of the underlying collateral. Credit loss is measured using a market approach based on the fair value of the collateral, less estimated costs to dispose, for loans the Company considers to be collateral-dependent due to a delinquency status or other adverse condition severe enough to indicate that the borrower can no longer be relied upon as the continued source of repayment. These conditions are described more fully in Note 5. LOANS AND ALLOWANCES FOR CREDIT LOSSES. To calculate the credit loss of collateral-dependent loans, the fair market values of the collateral, estimated using exterior appraisals in the majority of instances, are reduced by calculated estimated costs to dispose, derived from historical experience and recent market conditions. Any indicated credit loss is recognized by a charge to the allowance for credit losses. Subsequent increases in collateral values or principal pay downs on loans with recognized credit loss could result in a collateral-dependent loan being\ncarried below its fair value. When no credit loss is indicated, the carrying amount is considered to approximate the fair value of that loan to the Company because contractually that is the maximum repayment the Company can expect. The amortized cost of loans individually evaluated for credit loss based on the fair value of the collateral are included in Level 3 of the hierarchy with assets measured at fair value on a non-recurring basis. The range and weighted average impact of estimated costs to dispose on fair values is determined at the time of credit loss or when additional credit loss is recognized and is included in quantitative information about significant unobservable inputs later in this note.\nLoans held for investment that have been restructured in TDRs, are performing according to the restructured terms of the loan agreement and are not evaluated based on collateral, are individually evaluated for credit loss using the present value of future cash flows based on the loans effective interest rate, which is not a fair value measurement. At September 30, 2022 and 2021, respectively, this included $76,692 and $84,594 in amortized costs of TDRs with related allowances for loss of $10,284 and $12,073.\nReal Estate Owned-Real estate owned includes real estate acquired as a result of foreclosure, or by deed in lieu of foreclosure, and is carried at the lower of the cost basis or fair value, less estimated costs to dispose. The carrying amounts of real estate owned at September 30, 2022 and September 30, 2021 were $1,191 and $289, respectively. Fair value is estimated under the market approach using independent third party appraisals. As these properties are actively marketed, estimated fair values may be adjusted by management to reflect current economic and market conditions. At September 30, 2022 and 2021, these adjustments were not significant to reported fair values. At September 30, 2022 and 2021, respectively, $1,192 and $66 of real estate owned is included in Level 3 of the hierarchy with assets measured at fair value on a non-recurring basis where the cost basis equals or exceeds the estimate of fair values less costs to dispose of these properties. Real estate owned includes estimated costs to dispose of $156 and $9 related to properties measured at fair value and $155 and $231 of properties carried at their original or adjusted cost basis at September 30, 2022 and 2021, respectively.\nDerivatives-Derivative instruments include interest rate locks on commitments to originate loans for the held for sale portfolio, forward commitments on contracts to deliver mortgage loans, and interest rate swaps designated as cash flow hedges. Derivatives not designated as cash flow hedges are reported at fair value in Other assets or Other liabilities on the CONSOLIDATED STATEMENT OF CONDITION with changes in value recorded in current earnings. Derivatives qualifying as cash flow hedges are settled daily, bringing their fair value to $0. Refer to Note 17. DERIVATIVE INSTRUMENTS for additional information on cash flow hedges. The fair value of interest rate lock commitments is adjusted by a closure rate based on the estimated percentage of commitments that will result in closed loans. The range and weighted average impact of the closure rate is included in quantitative information about significant unobservable inputs later in this note. A significant change in the closure rate may result in a significant change in the ending fair value measurement of these derivatives relative to their total fair value. Because the closure rate is a significantly unobservable assumption, interest rate lock commitments are included in Level 3 of the hierarchy. Forward commitments on contracts to deliver mortgage loans are included in Level 2 of the hierarchy.\nAssets and liabilities carried at fair value on a recurring basis in the CONSOLIDATED STATEMENTS OF CONDITION at September 30, 2022 and 2021 are summarized below. There are no liabilities carried at fair value at September 30, 2021.\nRecurring Fair Value Measurements at Reporting Date Using\nSeptember 30,\n2022 Quoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable Inputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nAssets\nInvestment securities available for sale:\nREMICs $ 453,268 $ - $ 453,268 $ -\nFannie Mae certificates 1,021 - 1,021 -\nU.S. government and agency obligations 3,619 $ - 3,619 -\nTotal $ 457,908 $ - $ 457,908 $ -\nLiabilities\nDerivatives:\nInterest rate lock commitments 333 - - 333\nTotal $ 333 $ - $ - $ 333\nRecurring Fair Value Measurements at Reporting Date Using\nSeptember 30,\n2021 Quoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable Inputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nAssets\nInvestment securities available for sale:\nREMICs $ 416,241 $ - $ 416,241 $ -\nFannie Mae certificates 5,542 - 5,542 -\nDerivatives:\nInterest rate lock commitments 525 - - 525\nTotal $ 422,308 $ - $ 421,783 $ 525\nThe table below presents a reconciliation of the beginning and ending balances and the location within the CONSOLIDATED STATEMENTS OF INCOME where gains (losses) due to changes in fair value are recognized on interest rate lock commitments which are measured at fair value on a recurring basis using significant unobservable inputs (Level 3).\nInterest Rate Lock Commitments\nYear Ended September 30,\n2022 2021 2020\nBeginning balance $ 525 $ 1,194 $ 44\n(Loss)/Gain during the period due to changes in fair value:\nIncluded in other non-interest income (858) (669) 1,150\nEnding balance $ (333) $ 525 $ 1,194\nChange in unrealized gains for the period included in earnings for\nassets held at end of the reporting date $ (333) $ 525 $ 1,194\nSummarized in the tables below are those assets measured at fair value on a nonrecurring basis.\nNonrecurring Fair Value Measurements at Reporting Date Using\nSeptember 30,\n2022 Quoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable Inputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nCollateral-dependent loans, net of allowance $ 47,121 $ - $ - $ 47,121\nMortgage loans held for sale 9,661 - 9,661 -\nReal estate owned(1)\n1,192 - - 1,192\nTotal $ 57,974 $ - $ 9,661 $ 48,313\n______________________\n(1) Amounts represent fair value measurements of properties before deducting estimated costs to dispose.\nNonrecurring Fair Value Measurements at Reporting Date Using\nSeptember 30,\n2021 Quoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable Inputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nCollateral-dependent loans, net of allowance $ 83,854 $ - $ - $ 83,854\nReal estate owned(1)\n66 - - 66\nTotal $ 83,920 $ - $ - $ 83,920\n______________________\n(1) Amounts represent fair value measurements of properties before deducting estimated costs to dispose.\nThe following provides quantitative information about significant unobservable inputs categorized within Level 3 of the Fair Value Hierarchy. The interest rate lock commitments can include commitments on both mortgage origination applications and preapprovals. Preapprovals generally have a much lower closure rate than origination applications which is reflected in the aggregate weighted average closure rates shown below when applicable.\nFair Value\nSeptember 30, 2022 Valuation Technique(s) Unobservable Input Range Weighted Average\nCollateral-dependent loans, net of allowance $47,121 Market comparables of collateral discounted to estimated net proceeds Discount appraised value to estimated net proceeds based on historical experience:\nResidential Properties 0 - 28% 4.7%\nInterest rate lock commitments $(333) Quoted Secondary Market pricing Closure rate 0 - 100% 93.7%\nFair Value\nSeptember 30, 2021 Valuation Technique(s) Unobservable Input Range Weighted Average\nCollateral-dependent loans, net of allowance $83,854 Market comparables of collateral discounted to estimated net proceeds Discount appraised value to estimated net proceeds based on historical experience:\nResidential Properties 0 - 34% 4.0%\nInterest rate lock commitments $525 Quoted Secondary Market pricing Closure rate 0 - 100% 66.1%\nThe following tables present the estimated fair value of the Company's financial instruments and their carrying amounts as reported in the CONSOLIDATED STATEMENTS OF CONDITION.\nSeptember 30, 2022\nCarrying Estimated Fair Value\nAmount Total Level 1 Level 2 Level 3\nAssets:\nCash and due from banks $ 18,961 $ 18,961 $ 18,961 $ - $ -\nInterest earning cash equivalents 350,603 350,603 350,603 - -\nInvestment securities available for sale 457,908 457,908 - 457,908 -\nMortgage loans held for sale 9,661 9,661 - 9,661 -\nLoans, net:\nMortgage loans held for investment 14,253,804 13,106,346 - - 13,106,346\nOther loans 3,263 3,263 - - 3,263\nFederal Home Loan Bank stock 212,290 212,290 N/A - -\nAccrued interest receivable 40,256 40,256 - 40,256 -\nCash collateral received from or held by counterparty 26,045 26,045 26,045 - -\nLiabilities:\nChecking and passbook accounts $ 3,056,506 $ 3,056,506 $ - $ 3,056,506 $ -\nCertificates of deposit 5,864,511 5,733,418 - 5,733,418 -\nBorrowed funds 4,793,221 4,734,377 - 4,734,377 -\nBorrowers advances for taxes and insurance 117,250 117,250 - 117,250 -\nPrincipal, interest and escrow owed on loans serviced 29,913 29,913 - 29,913 -\nDerivatives 333 333 - 333\nSeptember 30, 2021\nCarrying Estimated Fair Value\nAmount Total Level 1 Level 2 Level 3\nAssets:\nCash and due from banks $ 27,346 $ 27,346 $ 27,346 $ - $ -\nInterest earning cash equivalents 460,980 460,980 460,980 - -\nInvestment securities available for sale 421,783 421,783 - 421,783 -\nMortgage loans held for sale 8,848 8,982 - 8,982 -\nLoans, net:\nMortgage loans held for investment 12,506,257 12,777,375 - - 12,777,375\nOther loans 2,778 2,778 - - 2,778\nFederal Home Loan Bank stock 162,783 162,783 N/A - -\nAccrued interest receivable 31,107 31,107 - 31,107 -\nCash collateral received from or held by counterparty 24,236 24,236 24,236 - -\nDerivatives 525 525 - - 525\nLiabilities:\nChecking and passbook accounts $ 2,960,150 $ 2,960,150 $ - $ 2,960,150 $ -\nCertificates of deposit 6,033,455 6,118,018 - 6,118,018 -\nBorrowed funds 3,091,815 3,106,277 - 3,106,277 -\nBorrowers advances for taxes and insurance 109,633 109,633 - 109,633 -\nPrincipal, interest and escrow owed on loans serviced 41,476 41,476 - 41,476 -\nPresented below is a discussion of the valuation techniques and inputs used by the Company to estimate fair value.\nCash and Due from Banks, Interest Earning Cash Equivalents, Cash Collateral Received from or Held by Counterparty-The carrying amount is a reasonable estimate of fair value.\nInvestment Securities Available for Sale-Estimated fair value for investment and mortgage-backed securities is based on quoted market prices, when available. If quoted prices are not available, management will use as part of their estimation process fair values which are obtained from third party independent nationally recognized pricing services using pricing models, quoted prices of securities with similar characteristics, or discounted cash flows.\nMortgage Loans Held for Sale-Fair value of mortgage loans held for sale is based on quoted secondary market pricing for loan portfolios with similar characteristics.\nLoans-For mortgage loans held for investment and other loans, fair value is estimated by discounting contractual cash flows adjusted for prepayment estimates using the current rates at which similar loans would be made to borrowers with similar credit ratings and for the same remaining term. The use of current rates to discount cash flows reflects current market expectations with respect to credit exposure. Collateral-dependent loans are measured at the lower of cost or fair value as described earlier in this footnote.\nFederal Home Loan Bank Stock-It is not practical to estimate the fair value of FHLB stock due to restrictions on its transferability. The fair value is estimated to be the carrying value, which is par. All transactions in capital stock of the FHLB Cincinnati are executed at par.\nDeposits-The fair value of demand deposit accounts is estimated as the amount payable on demand at the reporting date. The fair value of fixed-maturity certificates of deposit is estimated using discounted cash flows and rates currently offered for deposits of similar remaining maturities.\nBorrowed Funds-Fair value for borrowed funds is estimated using discounted cash flows and rates currently charged for borrowings of similar remaining maturities.\nAccrued Interest Receivable, Borrowers Advances for Insurance and Taxes, and Principal, Interest and Related Escrow Owed on Loans Serviced-The carrying amount is a reasonable estimate of fair value.\nDerivatives-Fair value is estimated based on the valuation techniques and inputs described earlier in this footnote.\n17. DERIVATIVE INSTRUMENTS\nThe Company enters into interest rate swaps to add stability to interest expense and manage exposure to interest rate movements as part of an overall risk management strategy. For hedges of the Company's borrowing program, interest rate swaps designated as cash flow hedges involve the receipt of variable amounts from a counterparty in exchange for the Company making fixed payments. These derivatives are used to hedge the forecasted cash outflows associated with the Company's FHLB borrowings. At September 30, 2022 and 2021, the interest rate swaps used in the Company's asset/liability management strategy have weighted average terms of 2.7 years and 2.5 years and weighted average fixed-rate interest payments of 1.88% for both periods.\nCash flow hedges are initially assessed for effectiveness using regression analysis. Changes in the fair value of derivatives designated and that qualify as cash flow hedges is recorded in OCI and is subsequently reclassified into earnings during the period in which the hedged forecasted transaction affects earnings. Quarterly, a qualitative analysis is preformed to monitor the ongoing effectiveness of the hedging instrument. All derivative positions were initially and continue to be highly effective at September 30, 2022.\nThe Company enters into forward commitments for the sale of mortgage loans principally to protect against the risk of lost revenue from adverse interest rate movements on net income. The Company recognizes the fair value of such contracts when the characteristics of those contracts meet the definition of a derivative. These derivatives are not designated in a hedging relationship; therefore, gains and losses are recognized immediately in the CONSOLIDATED STATEMENTS OF INCOME.\nIn addition, the Company is party to derivative instruments when it enters into interest rate lock commitments to originate a portion of its loans, which when funded, are classified as held for sale. Such commitments are not designated in a hedging relationship; therefore, gains and losses are recognized immediately in the CONSOLIDATED STATEMENTS OF INCOME.\nThe following tables provide the locations within the CONSOLIDATED STATEMENTS OF CONDITION, notional values and fair values, at the reporting dates, for all derivative instruments.\nSeptember 30, 2022 September 30, 2021\nNotional Value Fair Value Notional Value Fair Value\nDerivatives designated as hedging instruments\nCash flow hedges: Interest rate swaps\nOther Assets $ 1,550,000 $ - $ 250,000 $ -\nOther Liabilities - - 2,200,000 -\nTotal cash flow hedges: Interest rate swaps $ 1,550,000 $ - $ 2,450,000 $ -\nDerivatives not designated as hedging instruments\nInterest rate lock commitments\nOther Assets $ - $ - $ 24,826 $ 525\nOther Liabilities 9,170 (333) - -\nTotal derivatives not designated as hedging instruments $ 9,170 $ (333) $ 24,826 $ 525\nThe following tables present the net gains and losses recorded within the CONSOLIDATED STATEMENTS OF INCOME and the CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME relating to derivative instruments.\nLocation of Gain or (Loss)\nRecognized in Income Year Ended September 30,\n2022 2021 2020\nCash flow hedges\nAmount of gain/(loss) recognized Other comprehensive income $ 141,163 $ 27,848 $ (115,396)\nAmount of gain/(loss) reclassified from AOCI Interest expense: Borrowed funds (22,740) (44,534) (16,982)\nAmount of gain/(loss) reclassified from AOCI-Due to discontinuance of cash flow hedge Interest expense: Borrowed funds - - (7,775)\nDerivatives not designated as hedging instruments\nInterest rate lock commitments Other non-interest income $ (858) $ (669) $ 1,150\nForward commitments for the sale of mortgage loans Net gain/(loss) on the sale of loans - 134 (134)\nThe Company estimates that $35,882 of the amounts reported in AOCI will be reclassified as a credit to interest expense during the fiscal year ending September 30, 2023.\nThe economic lockdowns precipitated by the COVID-19 pandemic of 2020 caused unprecedented economic conditions resulting in extended low rates across the entire maturity spectrum, in which the Company decided to take advantage of this market condition. In the 2020 fiscal year the Company terminated four high cost interest rate swaps prior to their maturity. For the early termination of these swaps, the Company incurred $7,775 in additional interest rate expense and $48 in prepayment penalties. This additional interest rate expense is loss reclassified from AOCI during the year ended September 30, 2020 as a result of the discontinuance of the cash flow hedges because it was probable that the original forecasted transactions would not occur. These selected swaps were deemed beneficial to terminate as the Company would lower interest rate expense for future periods.\nDerivatives contain an element of credit risk which arises from the possibility that the Company will incur a loss because a counterparty fails to meet its contractual obligations. The Company's exposure is limited to the replacement value of the contracts rather than the notional or principal amounts. Credit risk is minimized through counterparty margin payments, transaction limits and monitoring procedures. All of the Company's swap transactions are cleared through a registered clearing broker to a central clearing organization. The clearing organization establishes daily cash and upfront cash or securities margin requirements to cover potential exposure in the event of default. This process shifts the risk away from the counterparty, since the clearing organization acts as the middleman on each cleared transaction. At September 30, 2022 and 2021, there was $26,045 and $24,236, respectively, included in other assets related to initial margin requirements held by the central clearing organization. For derivative transactions cleared through certain clearing parties, variation margin payments are recognized as settlements on a daily basis. The fair value of derivative instruments are presented on a gross basis, even when the derivative instruments are subject to master netting arrangements.\n18. PARENT COMPANY ONLY FINANCIAL STATEMENTS\nThe following condensed financial statements for TFS Financial Corporation (parent company only) reflect the investments in, and transactions with, its wholly-owned subsidiaries. Intercompany activity is eliminated in the consolidated financial statements.\nSeptember 30,\n2022 2021\nStatements of Condition\nAssets:\nCash and due from banks $ 1,341 $ 5,357\nInvestment securities - available for sale 3,619 -\nOther loans:\nDemand loan due from Third Federal Savings and Loan 184,772 185,076\nESOP loan receivable 41,927 46,454\nInvestments in:\nThird Federal Savings and Loan 1,605,306 1,487,284\nNon-thrift subsidiaries 8,104 6,381\nPrepaid federal and state taxes - 655\nDeferred income taxes 296 285\nAccrued receivables and other assets 9,158 9,397\nTotal assets $ 1,854,523 $ 1,740,889\nLiabilities and shareholders equity:\nLine of credit due non-thrift subsidiary $ 7,485 $ 5,836\nAccrued expenses and other liabilities 2,532 2,773\nAccrued federal and state income taxes 167 -\nTotal liabilities 10,184 8,609\nPreferred stock, $0.01 par value, 100,000,000 shares authorized, none issued and outstanding\n- -\nCommon stock, 0.01 par value, 700,000,000 shares authorized; 332,318,750 shares issued; 280,582,741 and 280,761,299 outstanding at September 30, 2022 and September 30, 2021, respectively\n3,323 3,323\nPaid-in capital 1,751,223 1,746,887\nTreasury stock, at cost; 51,736,009 and 51,557,451 shares at September 30, 2022 and September 30, 2021, respectively\n(771,986) (768,035)\nUnallocated ESOP shares (31,417) (35,751)\nRetained earnings-substantially restricted 870,047 853,657\nAccumulated other comprehensive income (loss) 23,149 (67,801)\nTotal shareholders equity 1,844,339 1,732,280\nTotal liabilities and shareholders equity $ 1,854,523 $ 1,740,889\nYears Ended September 30,\n2022 2021 2020\nStatements of Comprehensive Income (Loss)\nInterest income:\nDemand loan due from Third Federal Savings and Loan $ 1,600 $ 164 $ 1,412\nESOP loan 1,400 1,732 2,548\nOther interest income 6 1 43\nInvestment securities available for sale 43 - -\nTotal interest income 3,049 1,897 4,003\nInterest expense:\nBorrowed funds from non-thrift subsidiaries 97 7 291\nTotal interest expense 97 7 291\nNet interest income 2,952 1,890 3,712\nNon-interest income:\nIntercompany service charges 30 85 77\nDividend from Third Federal Savings and Loan 56,000 55,000 57,000\nDividend from non-thrift subsidiary - - 16,000\nTotal other income 56,030 55,085 73,077\nNon-interest expenses:\nSalaries and employee benefits 4,534 4,917 5,012\nProfessional services 1,456 1,566 1,323\nOffice property and equipment 13 3 10\nOther operating expenses 223 176 254\nTotal non-interest expenses 6,226 6,662 6,599\nIncome before income tax benefit 52,756 50,313 70,190\nIncome tax benefit (2,826) (3,848) (4,404)\nIncome before undistributed earnings of subsidiaries 55,582 54,161 74,594\nEquity in undistributed earnings of subsidiaries (dividend in excess of earnings):\nThird Federal Savings and Loan 17,260 24,738 19,418\nNon-thrift subsidiaries 1,723 2,108 (10,695)\nNet income 74,565 81,007 83,317\nChange in net unrealized gain (loss) on securities available for sale (34,860) (3,733) 6,859\nChange in cash flow hedges 127,093 56,096 (69,391)\nChange in pension obligation (1,283) 11,801 (54)\nTotal other comprehensive income (loss) 90,950 64,164 (62,586)\nTotal comprehensive income $ 165,515 $ 145,171 $ 20,731\nYears Ended September 30,\n2022 2021 2020\nStatements of Cash Flows\nCash flows from operating activities:\nNet income $ 74,565 $ 81,007 $ 83,317\nAdjustments to reconcile net income to net cash provided by operating activities:\n(Equity in undistributed earnings of subsidiaries) dividend in excess of earnings:\nThird Federal Savings and Loan (17,260) (24,738) (19,418)\nNon-thrift subsidiaries (1,723) (2,108) 10,695\nDeferred income taxes 81 204 2,114\nESOP and stock-based compensation expense 1,543 1,843 1,893\nNet decrease (increase) in interest receivable and other assets 908 12,593 (3,337)\nNet increase (decrease) in accrued expenses and other liabilities 48 (200) 241\nNet cash provided by operating activities 58,162 68,601 75,505\nCash flows from investing activities:\nPurchase of securities available for sale (4,071) - -\nIncrease in balances lent to Third Federal Savings and Loan 304 (12,222) (31,899)\nRepayment of capital contributions from non-thrift subsidiaries - - 69,000\nNet cash provided by (used in) investing activities (3,767) (12,222) 37,101\nCash flows from financing activities:\nPrincipal reduction of ESOP loan 4,527 4,063 3,719\nPurchase of treasury shares (5,049) - (413)\nDividends paid to common shareholders (58,297) (56,637) (55,465)\nAcquisition of treasury shares through net settlement (1,241) (5,591) (1,907)\nNet increase (decrease) in borrowings from non-thrift subsidiaries 1,649 1,787 (58,497)\nNet cash used in financing activities (58,411) (56,378) (112,563)\nNet increase (decrease) in cash and cash equivalents (4,016) 1 43\nCash and cash equivalents-beginning of year 5,357 5,356 5,313\nCash and cash equivalents-end of year $ 1,341 $ 5,357 $ 5,356\n19. EARNINGS PER SHARE\nBasic earnings per share is the amount of earnings available to each share of common stock outstanding during the reporting period. Diluted earnings per share is the amount of earnings available to each share of common stock outstanding during the reporting period adjusted to include the effect of potentially dilutive common shares. For purposes of computing earnings per share amounts, outstanding shares include shares held by the public, shares held by the ESOP that have been allocated to participants or committed to be released for allocation to participants and the 227,119,132 shares held by Third Federal Savings, MHC. For purposes of computing dilutive earnings per share, stock options and restricted and performance share units with a dilutive impact are added to the outstanding shares used in the basic earnings per share calculation. Unvested shares awarded pursuant to the Company's restricted stock plans are treated as participating securities in the computation of EPS pursuant to the two-class method as they contain nonforfeitable rights to dividends. The two-class method is an earnings allocation that determines EPS for each class of common stock and participating security. Performance share units, determined to be contingently issuable and not participating securities, are excluded from the calculation of basic EPS. At September 30, 2022 and 2021, respectively, the ESOP held 3,141,711 and 3,575,051 shares, respectively that were neither allocated to participants nor committed to be released to participants.\nThe following is a summary of the Companys EPS calculations.\nFor the Year Ended September 30, 2022\nIncome Shares Per share\namount\n(Dollars in thousands, except per share data)\nNet income $ 74,565\nLess: income allocated to restricted stock units 1,510\nBasic earnings per share:\nIncome available to common shareholders 73,055 277,370,762 $ 0.26\nDiluted earnings per share:\nEffect of dilutive potential common shares 1,315,603\nIncome available to common shareholders $ 73,055 278,686,365 $ 0.26\nFor the Year Ended September 30, 2021\nIncome Shares Per share\namount\n(Dollars in thousands, except per share data)\nNet income $ 81,007\nLess: income allocated to restricted stock units 1,555\nBasic earnings per share:\nIncome available to common shareholders 79,452 276,694,594 $ 0.29\nDiluted earnings per share:\nEffect of dilutive potential common shares 1,881,660\nIncome available to common shareholders $ 79,452 278,576,254 $ 0.29\nFor the Year Ended September 30, 2020\nIncome Shares Per share\namount\n(Dollars in thousands, except per share data)\nNet income $ 83,317\nLess: income allocated to restricted stock units 1,579\nBasic earnings per share:\nIncome available to common shareholders 81,738 275,859,660 $ 0.30\nDiluted earnings per share:\nEffect of dilutive potential common shares 1,943,398\nIncome available to common shareholders $ 81,738 277,803,058 $ 0.29\nThe following is a summary of outstanding stock options and restricted and performance share units that are excluded from the computation of diluted EPS because their inclusion would be anti-dilutive.\nFor the Year Ended September 30,\n2022 2021 2020\nOptions to purchase shares 407,100 133,800 573,500\nRestricted and performance share units 50,000 - 44,030\n20. RECENT ACCOUNTING PRONOUNCEMENTS\nAdopted in fiscal year ended September 30, 2022\nIn March of 2022, the FASB issued ASU 2022-01, Derivatives and Hedging (Topic 815), Fair Value Hedging - Portfolio Layer Method. The amendments in this Update amend the guidance in ASU 2017-12 relating to the \"last-of-layer\" method and rename the method as the \"portfolio layer\" method. It expands the scope of existing guidance so that entities can apply the portfolio layer method to portfolios of all financial assets, including both prepayable and nonprepayable financial assets. Additionally, the standards expands the current model to explicitly allow entities to designate multiple layers in a single portfolio as individual hedged items. This allows a larger portion of the interest rate risk associated with such a portfolio to be hedged. The Update is effective for fiscal years beginning after December 15, 2022, with early adoption permitted in any interim period after its issuance. The Company early adopted this Update effective April 1, 2022. This Update did not have a material impact on the Company's consolidated financial condition or results of operations.\nIssued but not yet adopted as of September 30, 2022\nIn March 2022, the FASB issued ASU 2022-02, Financial Instruments - Credit Losses (Topic 326). The amendments in this Update eliminate the accounting guidance for TDR by creditors in Subtopic 310-40, while enhancing disclosure requirements for certain loan refinancings and restructurings by creditors when the borrower is experiencing financial difficulty. This will be done by applying the loan refinancing and restructuring guidance to determine whether a modification results in a new loan or a continuation of an existing loan. Additionally, this amendment requires that an entity disclose current-period gross write-offs by year of origination for financing receivables and net investments in leases within the scope of Subtopic 326-20. This update is effective for fiscal years beginning after December 15, 2022, with early adoption permitted. The Company is currently evaluating the impact that this accounting guidance may have on its consolidated financial condition or results of operations. The Company plans to adopt this guidance as of October 1, 2023.\nThe Company has determined that all other recently issued accounting pronouncements will not have a material impact on the Company's consolidated financial statements or do not apply to its operations.\n21. RELATED PARTY TRANSACTIONS\nThe Company has made loans and extensions of credit, in the ordinary course of business, to certain directors and executive officers. These loans were originated with normal credit terms, including interest rate and collateralization, and do not represent more than the normal risk of collection. The aggregate amount of loans to such related parties at September 30, 2022 and 2021 was $0 and $64, respectively.\nFORM 10-K EXHIBIT INDEX\nExhibit\nNumber\nDescription of Exhibit If Incorporated by Reference, Documents with\nWhich Exhibit was Previous Filed with SEC\n3.1\nAmended and Restated Charter of TFS Financial Corporation, dated January 16, 2007\nAmendment No. 2 to Registration Statement on Form S-1 No. 333-139295 (filed with the SEC on February 9, 2006; Exhibit 3.2 therein)\n3.2\nAmended and Restated Bylaws of TFS Financial Corporation\nCurrent Report on Form 8-K No. 001-33390 (filed with the SEC on April 28, 2008; Exhibit 3.2 therein)\n3.3\nAmendment to Bylaws of TFS Financial Corporation\nCurrent Report on Form 8-K No. 001-33390 (filed with the SEC on October 29, 2018; Exhibit 3 therein)\n3.4\nAmendment to Bylaws of TFS Financial Corporation\nCurrent Report on Form 8-K No. 001-33390 (filed with the SEC on July 1, 2022; Exhibit 3 therein)\n4.1\nForm of Common Stock Certificate of TFS Financial Corporation\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 4 therein)\n4.2\nDescription of Registrant's Securities\nAnnual Report on Form 10-K No. 001-33390 (filed with the SEC on November 24, 2020; Exhibit 4.2 therein)\n10.1 [Intentionally omitted]\n10.2\nFinancial, Retirement & Estate Planning Program as amended and restated January 1, 2006\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.2 therein)\n10.3\nResolution Regarding Executive Physical Program, dated May 16, 2002\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.3 therein)\n10.4\nCompany Car Program, dated February 24, 1995\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.4 therein)\n10.5\nExecutive Retirement Benefit Plan I, dated January 1, 2006\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.5 therein)\n10.6\nBenefit Equalization Plan, dated January 1, 2005\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.6 therein)\n10.7\nSplit Dollar Agreement, dated January 29, 2002\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.7 therein)\n10.8\nResolution Regarding Supplemental Split Dollar Life Insurance Plan, dated August 22, 2002\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 10.8 therein)\n10.9 [Intentionally omitted]\n10.10\nTFS Financial Corporation Amended and Restated 2008 Equity Incentive Plan (incorporated by reference to Appendix B to the definitive proxy statement for the 2018 Annual Meeting of Stockholders)\nProxy Statement on Schedule 14A, No. 001-33390 (filed with the SEC on January 9, 2018)\n10.11\nTFS Financial Corporation Management Incentive Compensation Plan (incorporated by reference to Appendix A to the definitive proxy statement for the 2018 Annual Meeting of Stockholders)\nProxy Statement on Schedule 14A, No. 001-33390 (filed with the SEC on January 9, 2018)\nExhibit\nNumber\nDescription of Exhibit If Incorporated by Reference, Documents with\nWhich Exhibit was Previous Filed with SEC\n10.12\nFirst Amendment to the Restricted Stock Unit Award Agreement (August 11, 2008 award), dated August 9, 2012\nCurrent Report on Form 8-K No. 001-33390 (filed with the SEC on August 9, 2012; Exhibit 10.1 therein)\n10.13\nFirst Amendment to the Restricted Stock Unit Award Agreement (May 12, 2009 award), dated August 9, 2012\nCurrent Report on Form 8K No. 001-33390 (filed with the SEC on August 9, 2012; Exhibit 10.2 therein)\n10.14\nFirst Amendment to the Restricted Stock Unit Award Agreement (May 14, 2010 award), dated August 9, 2012\nCurrent Report on Form 8K No. 001-33390 (filed with the SEC on August 9, 2012; Exhibit 10.3 therein)\n14 Code of Ethics Available on our website, www.thirdfederal.com\n21.1\nSubsidiaries of Registrant\nRegistration Statement on Form S-1 No. 333-139295 (filed with the SEC on December 13, 2006; Exhibit 21 therein)\n23.1\nConsent of Independent Registered Public Accounting Firm\nFiled herewith\n31.1\nCertification of chief executive officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934\nFiled herewith\n31.2\nCertification of chief financial officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934\nFiled herewith\nCertification of chief executive officer and chief financial officer pursuant to Rule 13a-14(b) of the Securities Exchange Act of 1934 and 18 U.S.C. Section 1350\nFiled herewith\n100 XBRL related documents The following financial statements from TFS Financial Corporations Annual Report on Form 10-K for the year ended September 30, 2022 filed on November 22, 2022 formatted in Inline XBRL (Extensible Business Reporting Language) includes: (i) Consolidated Statements of Condition, (ii) Consolidated Statements of Income, (iii) Consolidated Statements of Comprehensive Income, (iv) Consolidated Statements of Shareholders' Equity, (v) Consolidated Statements of Cash Flows, (vi) Notes to Consolidated Financial Statements.\n101.INS Interactive datafile XBRL Instance Document\n101.SCH Interactive datafile XBRL Taxonomy Extension Schema Document\n101.CAL Interactive datafile XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF Interactive datafile XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB Interactive datafile XBRL Taxonomy Extension Label Linkbase Document\n101.PRE Interactive datafile XBRL Taxonomy Extension Presentation Linkbase Document\n104 Interactive datafile Cover Page Interactive Datafile (embedded within the Inline XBRL document and included in Exhibit 101)\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nTFS Financial Corporation\nDated: November 22, 2022 /S/ MARC A. STEFANSKI\nMarc A. Stefanski\nChairman of the Board, President\nand Chief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nDated: November 22, 2022 /S/ MARC A. STEFANSKI\nMarc A. Stefanski\nChairman of the Board, President\nand Chief Executive Officer\n(Principal Executive Officer)\nDated: November 22, 2022 /S/ TIMOTHY W. MULHERN\nTimothy W. Mulhern\nChief Financial Officer\n(Principal Financial Officer)\nDated: November 22, 2022 /S/ SUSANNE N. MILLER\nSusanne N. Miller\nChief Accounting Officer\n(Principal Accounting Officer)\nDated: November 22, 2022 /S/ BARBARA J. ANDERSON\nBarbara J. Anderson, Director\nDated: November 22, 2022 /S/ ANTHONY J. ASHER\nAnthony J. Asher, Director\nDated: November 22, 2022 /S/ MARTIN J. COHEN\nMartin J. Cohen, Director\nDated: November 22, 2022 /S/ ROBERT A. FIALA\nRobert A. Fiala, Director\nDated: November 22, 2022 /S/ WILLIAM C. MULLIGAN\nWilliam C. Mulligan, Director\nDated: November 22, 2022 /S/ TERRENCE R. OZAN\nTerrence R. Ozan, Director\nDated: November 22, 2022 /S/ JOHN P. RINGENBACH\nJohn P. Ringenbach, Director\nDated: November 22, 2022 /S/ MEREDITH S. WEIL\nMeredith S. Weil, Director\nDated: November 22, 2022 /S/ DANIEL F. WEIR\nDaniel F. Weir, Director\nDated: November 22, 2022 /S/ ASHLEY H. WILLIAMS\nAshley H. Williams, Director"
}