{
    "cik": "1387998",
    "company": "Snoogoo Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-10-21",
    "period_of_report": "2018-12-31",
    "sic": "1000",
    "state_of_inc": "NV",
    "state_location": "AZ",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1387998/0001096906-22-002528-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1387998/000109690622002528/sgoo-20181231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1387998/0001096906-22-002528.txt",
    "filename": "1387998_10K_2018_0001096906-22-002528.htm",
    "content": "ITEM 1. BUSINESS.\nSnoogoo Corp a Nevada corporation formerly known as Casey Container Corp., was incorporated in the State of Nevada on September 26, 2006 under the name Sawadee Ventures Inc. to engage in the acquisition, exploration and development of natural resource properties of merit. In September 2008, we ceased our exploration activities and, in November of 2009 we entered into an Additive Supply and License Agreement with Bio-Tec Environmental, developer of the breakthrough EcoPure® technology.\nOn January 6, 2010 Ms. Rachna Khanna tendered her resignation as the President, CEO, CFO and Director. The same day Mr. James Casey, Mr. Terry Neild, and Mr. Robert Seaman were appointed as Directors of the Company. Mr. Casey filled the position of President, Mr. Neild was appointed Chief Executive Officer, Chief Financial Officer and Secretary, and Mr. Seaman was appointed Vice- President-Operations.\nIn January 2015 the Company ended its Additive Supply and License Agreement with Bio-Tec Environmental. On February 11, 2015 the Company entered into an Asset Purchase Agreement for the acquisition of a new social information network technology that it planned to use in order to launch web and mobile applications with broad global appeal. The technology represented a breakthrough in common information networks by allowing individuals and groups to search, bookmark and share all forms of digital content, both privately and publicly, based on their own or shared interests.\nIn January 2016 the Company ended its pursuit of its acquisition of a new social information network technology. The Company is currently seeking to acquire a company either active in the green energy sector or one whose focus is on an aspect of sustainability.\nThe implementation of our business objectives is wholly contingent upon the successful sale of our securities. We intend to utilize the proceeds of any offering, any sales of equity securities or debt securities, bank and other borrowings or a combination of those sources to affect our growth potential.\nWe are currently considered a shell company inasmuch for the period ending December 31, 2018 we did not generate revenues, did not own an operating business, had no employees and no material assets.\nEmployees\nAs of December 31, 2018 our corporate officers were our only employees.\nLegal Proceedings\nWe are currently not involved, nor have any knowledge of any current or proposed legal proceedings or claims against the Company.\nProperties and Facilities\nWe currently utilize space for no charge, at 8900 East Pinnacle Peak Road, Suite 207B, Scottsdale, AZ 85255. ITEM 1A. RISK FACTORS.\nAs a smaller reporting company defined by Item 10 of Regulation S-K, the Company is not required to provide this information. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNot applicable. ITEM 2. PROPERTIES.\nOur principal business address is 8900 East Pinnacle Peak Road, Suite 207B, Scottsdale, AZ 85255. The office space we are occupying is being provided to us at no cost to the company by our CEO and we expect this arrangement to continue until our operations require expansion. The facilities include an answering machine, a fax machine, computer and office equipment and the value of the office space and the peripherals all of which are designed to be de minimis. ITEM 3. LEGAL PROCEEDINGS.\nFrom time to time, the company may become involved in various lawsuits and legal proceedings, which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. We are currently not aware of any such legal proceedings or claims that we believe will have, individually or in the aggregate, a material adverse effect on our business, financial condition or operating results. ITEM 4. MINE SAFETY DISCLOSURES.\nNot Applicable.\nPART II ITEM 5. MARKET FOR THE REGISTRANTS COMMON EQUITY AND RELATED STOCKHOLDER MATTERS.\nMarket Information\nOur common stock is traded on the OTC Pink tier of the OTC Markets Group, Inc. under the ticker symbol SGOO. To date, there has not been an active trading market.\nShareholders of Record\nAs of December 31, 2018 we had 201,864,701 shares of common stock issued and outstanding and there were 171 certificate holders of record of our common stock.\nDividends\nAs of the date of this Annual Report on Form 10-K, we have not paid any cash dividends to stockholders. The declaration of any future cash dividends will be at the discretion of our Board of Directors and will depend upon our earnings, if any, our capital requirements and financial position, the general economic conditions, and other pertinent conditions. It is our present intention not to pay any cash dividends in the foreseeable future, but rather to reinvest earnings, if any, in our business operations.\nIssuer Purchases of Equity Securities\nWe did not, nor did any affiliated purchaser make any repurchases of our securities during the year ended December 31, 2018.\nTransfer Agent:\nThe company has retained Pacific Stock Transfer Co. located at 6725 Via Austi Pkwy, Suite 300, Las Vegas, Nevada 89119. ITEM 6. RESERVED. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe following discussion contains forward-looking statements that provide our current expectations or forecasts of future events. These statements can be identified by the use of terminology such as estimates, projects, plans, believes, expects, anticipates, intends, or the negative or other variations, or by discussions of strategy that involve risks and uncertainties. We urge you to be cautious of the forward-looking statements, that such statements, which are contained in this Form 10-K, reflect our current beliefs with respect to future events and involve known and unknown risks, uncertainties and other factors affecting our operations, market growth, services, products and licenses. No assurances can be given regarding the achievement of future results, as actual results may differ materially as a result of the risks we face, and actual events may differ from the assumptions underlying the statements that have been made regarding anticipated events.\nOVERVIEW\nSnoogoo Corp a Nevada corporation formerly known as Casey Container Corp., was incorporated in the State of Nevada on September 26, 2006 under the name Sawadee Ventures Inc. to engage in the acquisition, exploration and development of natural resource properties of merit. In September 2008, we ceased our exploration activities and, in November of 2009 we entered into an Additive Supply and License Agreement with Bio-Tec Environmental, developer of the breakthrough EcoPure® technology.\nOn January 6, 2010 Ms. Rachna Khanna tendered her resignation as the President, CEO, CFO and Director. The same day Mr. James Casey, Mr. Terry Neild, and Mr. Robert Seaman were appointed as Directors of the Company. Mr. Casey filled the position of President, Mr. Neild was appointed Chief Executive Officer, Chief Financial Officer and Secretary, and Mr. Seaman was appointed Vice- President-Operations.\nIn January 2015 the Company ended its Additive Supply and License Agreement with Bio-Tec Environmental. On February 11, 2015 the Company entered into an Asset Purchase Agreement for the acquisition of a new social information network technology that it planned to use in order to launch web and mobile applications with broad global appeal. The technology represented a breakthrough in common information networks by allowing individuals and groups to search, bookmark and share all forms of digital content, both privately and publicly, based on their own or shared interests.\nIn January 2016 the Company ended its pursuit of its acquisition of a new social information network technology. The Company is currently seeking to acquire a company either active in the green energy sector or one whose focus is on an aspect of sustainability.\nWe are currently considered a shell company inasmuch for the period ending December 31, 2018 we did not generate revenues, did not own an operating business and had no employees and no material assets.\nResults of Operations for The Years Ending December 31, 2018 and December 31, 2017\nRevenue\nFor the years ended December 31, 2018 and 2017 we generated no revenue.\nExpenses\nFor the years ended December 31, 2018 and 2017 we incurred operating expenses of $18,671 and $55,357, respectively. We incurred no interest expense in either year. The decrease in the expenses in 2018 relative to 2017 represent the discontinuation of reimbursing the officers for business expenses incurred on behalf of the company. No expenses were incurred by them for the year ended December 31, 2018.\nNet Loss\nFor the years ended December 31, 2018 and 2017 we incurred losses of $(18,671) and $(55,357), respectively. At December 31, 2018 the weighted average number of common shares outstanding was 200,064,701 and the loss per share was $0.00. At December 31, 2017 the weighted average number of common shares outstanding was 190,314,701 and the loss per share was $0.00.\nLiquidity\nFor the years ended December 31, 2018 and 2017 we incurred net losses of $(18,671) and $(55,357), respectively. As of December 31, 2018 and 2017 we had cash in the amount of $1,589 and $23, respectively and current liabilities of $523,692 and $551,155, respectively. During the year ended December 31, 2018 we raised $25,000 resulting from the sale of our Restricted common stock and, for the year ended December 31, 2017 we received $35,502 in support from a related party and a short-term, non-interest-bearing advance in the amount of $9,500 which was settled with the issuance of 950,000 shares of our Restricted common stock on January 24, 2018.\nWe will seek additional funds through equity or debt financing, collaborative or other arrangements with corporate partners and from other sources which may have the effect of diluting the holdings of existing shareholders.\nThe Company has no current arrangements with respect to, or sources of, such additional funding and we do not anticipate that existing shareholders will provide any portion of our future financing requirements. However, as of December 31, 2018 the Company is not operating and will therefore incur minimal expenses while seeking an acquisition, most of which will be related to SEC compliance. The source of funds to maintain said compliance will be provided by additional sales of common stock and capital contributions and advances from related parties.\nNo assurance can be given that additional funding will be available when needed or that such financing will be available on terms acceptable to the Company. If adequate funds are not available, we may be required to halt our acquisition search. This would have a material adverse effect on the Company.\nGoing Concern\nThe report of our independent registered public accounting firm on the financial statements for the years ended December 31, 2018 and 2017 includes an explanatory paragraph relating to the uncertainty of our ability to continue as a going concern. We have incurred recurring losses, incurred liabilities in excess of assets and have an accumulated deficit as of December 31, 2018 of and 2017 of approximately $6.5 million and $6.4 million, respectively. Based upon current operating levels we will be required to obtain additional capital in order to sustain our operations, which mainly consists of searching for an acquisition candidate as well as meeting our compliance requirements with the SEC. We will obtain these funds via sales of stock and loans. However, in order to be an on-going business, we are aware of the importance of finding an operating company to acquire as soon as possible.\nCritical Accounting Policies and Use of Estimates\nOur Critical Accounting Policies are enumerated in Note 2 of our financial statements. The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nOff-Balance Sheet Arrangements\nAs of December 31, 2018 and 2017 we did not have any off-balance sheet arrangements as defined in Item 303(a)(4)(ii) of Regulation S-K promulgated under the Securities Act of 1934.\nContractual Obligations and Commitments\nAs of December 31, 2018 and 2017 we did not have any contractual obligations. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nAs a smaller reporting company defined by Item 10 of Regulation S-K, the Company is not required to provide this information. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nINDEX TO THE FINANCIAL STATEMENTS\nAudited Financial Statements\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 178)\nBalance Sheets\nStatements of Operations\nStatements of Stockholders Equity (Deficit)\nStatements of Cash Flows\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nShareholders and Board of Directors\nSnoogoo Corp.\nParadise Valley, Arizona\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Snoogoo Corp. (the Company) as of December 31, 2018 and 2017, the related statements of operations, stockholders deficit, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2018 and 2017, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has suffered recurring losses from operations and has a net capital deficiency that raise substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ SEMPLE, MARCHAL & COOPER, LLP\nCertified Public Accountants\nWe have served as the Company's auditor since 2021\nPhoenix, Arizona\nOctober 20, 2022\nSNOOGOO CORP.\nBalance Sheets\nAs Of\nDecember 31,\nAs Of\nDecember 31,\nASSETS\nCurrent Assets\nCash and cash equivalents\n$1,589\n$23\nTotal Assets\n1,589\nLIABILITIES AND STOCKHOLDER'S EQUITY (DEFICIT)\nCurrent Liabilities\nAccrued liabilities\n$30,893\n$30,893\nDue to Related Parties\n492,799\n510,762\nNon-interest-bearing loans\n-\n9,500\nTotal Current Liabilities\n523,692\n551,155\nTotal Liabilities\n523,692\n551,155\nStockholder's Equity (Deficit)\nPreferred stock, $0.001 par value, 10,000,000 shares authorized, none issued and outstanding\n-\n-\nCommon stock, $0.001 par value, 1,000,000,000 shares authorized, 201,864,701 and 190,314,701 shares issued and outstanding at December 31, 2018 and 2017 respectively\n201,865\n190,315\nAdditional paid-in-capital\n5,740,840\n5,704,690\nAccumulated deficit\n(6,464,808)\n(6,446,137)\nTotal Stockholder's Deficit\n(522,103)\n(551,132)\nTotal Liabilities and Stockholder's Equity (Deficit)\n$1,589\n$23\nThe accompanying notes are an integral part of these financial statements.\nSNOOGOO CORP.\nStatements of Operations\nYear Ended\nYear Ended\nDecember 31,\nDecember 31,\nRevenues\n$-\n$-\nOperating Expenses\nGeneral and administrative\n18,671\n55,357\nTotal operating expenses\n18,671\n55,357\nLoss from operations\n(18,671)\n(55,357)\nProvision for Income Taxes:\nIncome Tax Benefit\n-\n-\nNet Loss\n$(18,671)\n$(55,357)\nBasic and diluted loss per share\n$0.00\n$0.00\nWeighted average number of common shares outstanding, basic and diluted\n200,064,701\n190,314,701\nThe accompanying notes are an integral part of these financial statements.\nSNOOGOO CORP.\nStatements of Stockholders' Equity (Deficit)\nFor the Years Ended December 31, 2018 and 2017\nTotal\nCommon Stock\nAdditional\nAccumulated\nStockholders'\nShares\nAmount\nPaid-In Capital\nDeficit\nDeficit\nBalance December 31, 2016\n190,314,701\n$190,315\n$5,704,690\n$(6,390,780)\n$(495,775)\nNo shares were issued in 2017\nNet Loss for the Year ended December 31, 2017\n-\n-\n-\n(55,357)\n(55,357)\nBalance December 31, 2017\n190,314,701\n190,315\n5,704,690\n(6,446,137)\n(551,132)\nStock issued at $.01 per share for cash on January 16, 2018\n1,000,000\n1,000\n9,000\n-\n10,000\nStock issued at $.01 per share for debt settlement agreement on January 24, 2018\n950,000\n8,550\n-\n9,500\nStock issued at $.002 per share per consulting agreement on February 13, 2018\n6,600,000\n6,600\n6,600\n-\n13,200\nStock issued at $.005 per share for cash on April 23, 2018\n2,000,000\n2,000\n8,000\n-\n10,000\nStock issued at $.005 per share for cash on October 23, 2018\n1,000,000\n1,000\n4,000\n-\n5,000\nNet Loss for the Year ended December 31, 2018\n-\n-\n-\n(18,671)\n(18,671)\nBalance December 31, 2018\n201,864,701\n$201,865\n$5,740,840\n$(6,464,808)\n$(522,103)\nThe accompanying notes are an integral part of these financial statements.\nSNOOGOO CORP\nStatements of Cash Flows\nFor the Year\nFor the Year\nEnded\nEnded\nDecember 31, 2018\nDecember 31, 2017\nCash flows from operating activities:\nNet Loss\n$(18,671)\n$(55,357)\nAdjustments to reconcile net loss to net cash used in operating activities\nChanges in assets and liabilities:\nPrepaid expenses\n-\n10,400\nAccounts payable and accrued liabilities\n13,200\n(22)\nAdvances from Related Parties\n-\n35,502\nNet cash used in operating activities\n(5,471)\n(9,477)\nCash flows from financing activities:\nNon-interest-bearing loans\n9,500\nCommon stock issued and issuable for cash\n25,000\n-\nCash paid to Related Parties\n(17,963)\n-\nNet cash provided by financing activities\n7,037\n9,500\nNet increase (decrease) in cash\n$1,566\n$23\nCash, Beginning of the Period\n$23\n$-\nCash, End of the Period\n$1,589\n$23\nSupplemental disclosure of cash flow information:\nCash paid for interest\n$-\n$-\nCash paid for income taxes\n$-\n$-\nNon-cash, Investing and Financing Activities:\nIn 2018 we had Conversions of Obligations to Stock in the amount of $22,700.\nIn 2017 we had non-cash Financing from Related Parties in the amount of $35,502.\nThe accompanying notes are an integral part of these financial statements.\nSNOOGOO CORP.\nNOTES TO FINANCIAL STATEMENTS\nNote 1 - Organization, Plan of Business\nSnoogoo Corp (originally Sawadee Ventures, Inc. and then Casey Container Corp.) was incorporated under the laws of the State of Nevada on September 26, 2006 (the Company or Snoogoo Corp.) and was originally formed to engage in the acquisition, exploration and development of natural resource properties. In 2015 the Company changed its business direction and entered into an Asset Purchase Agreement for the acquisition of a new social information network technology that it planned to use in order to launch web and mobile applications with broad global appeal. In 2016 the Company abandoned the concept due to difficulties with the seller in completing the asset purchase and is currently seeking to acquire a company in either the green energy industry or one with a focus on a strong sustainability program.\nThe accompanying financial statements have been prepared assuming the continuation of the Company as a going concern. The Company has not yet established an ongoing source of revenues sufficient to cover its operating expenses and the cost of an acquisition and is dependent on debt and equity financing to fund its operations. Management of the Company is making efforts to raise additional funding and believes that it will be successful in its capital formation and planned operating activities. However, there can be no assurance that the Company will be able to raise additional equity capital or be successful in the development and commercialization of the products it develops or initiates collaboration agreements thereon. The accompanying financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result from the possible inability of the Company to continue as a going concern.\nNote 2 - Summary of Significant Accounting Policies\nBasis of Presentation\nThe Companys financial statements have been prepared on the basis of accounting principles generally accepted in the United States of America (GAAP).\nCash and Cash Equivalents\nThe Company considers all cash on hand, cash accounts not subject to withdrawal restrictions or penalties, and all highly liquid debt instruments with a maturity of three months or less at the time of purchase to be cash and cash equivalents.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates.\nLoss per Common Share\nNet loss per common share is computed by dividing the net loss by the weighted average number of common shares outstanding for the period. The calculation of diluted net loss per share gives effect to common stock equivalents; however, potential common shares are excluded if their effect is anti-dilutive. For the years ended December 31, 2018 and 2017 the Company had no potentially dilutive securities. The basic and diluted net loss per share in December 31, 2018 and 2017 was $0.00 and $0.00, respectively. The net loss for December 31, 2018 and 2017 was $(18,671) and $(55,357), respectively. For the years ended December 31, 2018 and 2017, the weighted average number of common shares outstanding, basic and diluted were 200,064,701 and 190,314,701, respectively.\nIncome Taxes\nThe Company accounts for its income taxes pursuant to FASB ASC Topic 740, Income Taxes by recognizing deferred tax assets and liabilities for future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis and tax credit carry forwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in operations in the period that includes the enactment date.\nSNOOGOO CORP.\nNOTES TO FINANCIAL STATEMENTS\nNote 2 - Summary of Significant Accounting Polices (contd)\nAs of December 31, 2018 and 2017 the Company has net operating loss carryovers of approximately $5.1 million and approximately $5.1 million, respectively, to be used to reduce future years taxable income. The Company has recorded a valuation allowance for the full potential tax benefit of the operating loss carryovers due to the uncertainty regarding realization.\nDecember 31, 2018\nDecember 31, 2017\nNet operating loss carryovers\n$ 5.1MM\n$ 5.1MM\nEffective tax deferred asset (30% tax rate)\n$ 1,518,302\n$ 1,512,700\nImpairment of tax deferred asset\n$ (1,518,302)\n$ (1,512,700)\nNet tax deferred asset\n$ 0\n$ 0\nThe 2018 and 2017 tax benefits would have been approximately $6,000 and approximately $17,000, respectively, however they had been fully reserved in their current years.\nRevenue Recognition\nThe Company recognizes revenue utilizing the five principles of ASC 606. They are: (1) Identify the contract with a customer; (2) Identify the Performance Obligation in the contract; (3) Determine the transaction price; (4) Allocate the transaction price; (5) Recognize Revenue. There was no revenue in the years ended December 31, 2018 or 2017.\nRecent Accounting Pronouncements\nThe Company reviewed all the recently issued, but not yet effective, accounting pronouncements and we do not believe any of these pronouncements will have a material impact on the Company.\nNote 3 - Going Concern\nThe report of our independent registered public accounting firm on the financial statements for the years ended December 31, 2018 and 2017 includes an explanatory paragraph relating to the uncertainty of our ability to continue as a going concern. For the years ended December 31, 2018 and 2017 we incurred net losses of $(18,671) and $(55,357), respectively. As of December 31, 2018 and 2017 we had cash in the amount of $1,589 and $23, respectively and current liabilities of $523,692 and $551,155, respectively. We have incurred recurring losses, incurred liabilities in excess of assets and have an accumulated deficit of $6.5 million as of December 31, 2018. Based upon current operating levels these losses combined with our current liabilities cast significant doubt on the companys ability to operate as a going concern. The ability to continue as a going concern is dependent upon the Company generating profitable operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management intends to finance operating costs over the next twelve months with loans from officers and/or private placement of common stock. The failure to achieve the necessary levels of profitability or obtaining additional funding would be detrimental to the Company.\nNote 4 - Property and Equipment\nAs of December 31, 2018 and 2017 the Company did not own any physical plant and/or equipment.\nSNOOGOO CORP.\nNOTES TO FINANCIAL STATEMENTS\nNote 5 - Related Party Transactions\nAs of December 31, 2018 and 2017 the total amounts due to related parties were $492,799 and $510,762, respectively and were for expenses paid on behalf of the Company and are non-interest bearing. There are no call provisions for these loans and they will be paid when the Company has sufficient funds to do so. There were no shares issued to Related Parties in 2018 or 2017.\nNote 6 - Non-interest-bearing Loans\nThe non-interest-bearing loans, in the amount of $9,500 as of December 31, 2017, represent a short-term advance from an individual and was settled on January 24, 2018 with 950,000 shares of the companys Restricted common stock.\nNote 7 - Stockholders Equity\nAs of December 31, 2018 and 2017 the Company was authorized to issue 1,000,000,000 shares of common stock and 10,000,000 shares of preferred stock. Total common shares issued and outstanding on December 31, 2018 and 2017 were 201,864,701 and 190,314,701, respectively and no preferred shares have been issued. There were 11,550,000 common shares issued in 2018 and no common shares issued in 2017. The Company does not have any stock options outstanding, nor does it have any written or oral agreements for the issuance or distribution of stock options at any point in the future.\nOn January 16, 2018 the Company received an investment from a non-related party of $10,000 and issued 1,000,000 Restricted common shares at $0.01 per share.\nOn January 24, 2018 the Company signed a Debt Settlement Agreement with a non-related party and issued 950,000 Restricted common shares at $0.01 per share in exchange for a $9,500 short-term advance owed to the recipient.\nOn February 13, 2018 the Company signed a Consulting Agreement with a non-related party and issued 6,600,000 Restricted common shares at $0.002 per share\nOn April 23, 2018 the Company received an investment from a non-related party of $10,000 and issued 2,000,000 Restricted common shares at $0.005 per share.\nOn October 23, 2018 the Company received an investment from a non-related party of $5,000 and issued 1,000,000 Restricted common shares at $0.005 per share.\nNote 8 - Subsequent Events\nManagement has evaluated subsequent events through the date the financial statements were filed. ITEM 9.CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A.CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we evaluated the effectiveness of our disclosure controls and procedures (as that term is defined in Rules 13a-15I and 15d-15I under the Exchange Act) as of December 31, 2018, which is the end of the period covered by this Annual Report. Based on this evaluation, our Chief Executive Officer and Chief Financial Officer concluded that the Companys disclosure controls and procedures were not effective as of December 31, 2018 to ensure that information required to be disclosed by the Company in reports we file or submit under the Exchange Act is (i) recorded, processed, summarized, evaluated and reported, as applicable, within the time periods specified in the United States Securities and Exchange Commissions rules and forms and (ii) accumulated and communicated to the Companys management, including the Companys Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosures.\nReport of Management on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) promulgated under the Exchange Act as a process designed by, or under the supervision of, our principal executive officer and principal financial and accounting officer and effected by our Board of Directors to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. Because of our inherent limitations, our internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of December 31, 2018. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework (2013 Framework).\nBased on our evaluation, management concluded that our internal control over financial reporting was not effective as of December 31, 2018 due to a lack of segregation of duties and adequate personnel. A material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of annual or interim financial statements will not be prevented or detected and corrected on a timely basis. As this deficiency created a reasonable possibility that a material misstatement would not be prevented or detected in a timely basis, management concluded that the control deficiency represented a material weakness and accordingly our internal control over financial reporting was not effective as of December 31, 2018. Management concluded that additional personnel should be hired to ensure that there is adequate segregation of duties.\nRemediation Plan for Material Weakness in Internal Control over Financial Reporting\nWe and our Board treat the controls surrounding, and the integrity of, our financial statements with the utmost priority. Management is committed to the planning and implementation of remediation efforts to address control deficiencies and any other identified areas of risk. These remediation efforts are intended to both address the identified material weakness and to enhance our overall financial control environment.\nManagement is committed to improving its internal controls and will (1) continue to use third party specialists to address shortfalls in staffing and to assist the Company with accounting and finance responsibilities, (2) increase the frequency of independent reconciliations of significant accounts which will mitigate the lack of segregation of duties until there are sufficient personnel and (3) may consider appointing outside directors and audit committee members in the future.\nWe believe there are no material inaccuracies or omissions of material fact in this Form 10-K and, to the best of our knowledge, we believe that the financial statements in this Form 10-K fairly present in all material aspects our financial condition, results of operations and cash flows in conformity with GAAP.\nChanges in Internal Control over Financial Reporting\nBased on our evaluation, management concluded that our internal control over financial reporting was not effective as of December 31, 2018 due to a lack of segregation of duties and adequate personnel.\nOther than as set forth in the foregoing paragraph, there have been no changes in our internal control over financial reporting that occurred during the year ended December 31, 2018 that has materially affected, or is reasonably likely to materially affect, our internal control financial reporting.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to rules of the SEC that permit the Company to provide only managements report in this annual report. ITEM 9B. OTHER INFORMATION.\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nDirectors and Executive Officers\nThe following table provides information regarding our executive officers and directors as of December 31, 2018:\nName\nAge\nPosition\nDate First Elected\nTerm Expires\nTerry W Neild\nChairman, President\n& Secretary\n1/12/10 (Appointed)\n01/12/22\nScott Campbell\nCFO & Director\n4/17/13 (Appointed)\n01/12/22*\nEdward Heisler\nDirector\n1/08/17 (Appointed)\n01/12/22*\n* Resigned 10/31/2021; Mindi S. Osborn was appointed CFO on December 31, 2021.\nTerry W. Neild, Chairman, President and Secretary was appointed to the Board of Directors on January 12, 2010. Mr. Neild was previously President and CEO of Clearly Canadian Beverage Corporation and Jolt Beverages Corporation, both successful retail specialty beverage and bottled water companies. Throughout his 50-year career as a business leader and innovator, Mr. Neild has built a depth of proven entrepreneurial skills in a variety of industries. He has guided the development of several start-up companies, bringing them to substantial successes. In addition, Mr. Neild, who is a Certified Management Accountant, has held senior financial positions in several Fortune 500 companies.\nScott Campbell, CFO and Director, is the President & founder of Campbell and Company Financial Group, Inc. (CCFG) a full-service accounting firm with its primary focus on the hospitality industry. Over the past 25 years CCFG Inc. has developed proprietary financial models specifically designed for the restaurant/bar industry. In addition to private accounting CCFG Inc. prepares filings for many public companies and serves as an Officer and Director of some. He resigned as CFO and from the Board of Directors on October 31, 2021.\nEdward Heisler, Director, is an experienced professional with proven success in helping a diverse array of companies. Over the past two decades, he has been responsible for helping many companies with business leadership needs. Mr. Heisler began his career in the automotive industry working with all of Detroits Big Three Automakers and the UAW. Prior to leaving the industry, he was responsible for ongoing Continuous Improvement initiatives within the Chrysler Corporations powertrain division, first as a UAW Rep. and then in management. He resigned from the Board of Directors on October 31, 2021.\nDirectors are elected to serve until the next annual meeting of stockholders and until their successor has been elected and qualified. Officers are appointed to serve until the meeting of the Board of Directors following the next annual meeting of stockholders and until their successors have been elected and qualified. No executive officer or director of the corporation has been the subject of any order, judgment, or decree of any court of competent jurisdiction, or any regulatory agency permanently or temporarily enjoining, barring, suspending or otherwise limiting him or her from acting as an investment advisor, underwriter, broker or dealer in the securities industry, or as an affiliated person, director or employee of an investment company, bank, savings and loan association, or insurance company or from engaging in or continuing any conduct or practice in connection with any such activity or in connection with the purchase or sale of any securities. No executive officer or director of the corporation has been convicted in any criminal proceeding (excluding traffic violations) or is the subject of a criminal proceeding which is currently pending.\nOn October 31, 2021 Scott Campbell and Edward Heisler resigned from the Board of Directors. The Company is in the process of appointing new Directors. In addition, Scott Campbell resigned as CFO on October 31, 2021 and Mindi S. Osborn was appointed CFO on December 31, 2021.\nCommittees\nWe do not currently maintain an audit committee, a compensation committee, a corporate governance and nominating committee, a conflicts committee or an executive committee.\nDirector Compensation\nDirectors currently do not receive any compensation.\nCode of Business Conduct and Ethics\nThe Company has adopted a written code of business conduct and ethics that applies to our directors, officers and employees including our principal executive officer and principal accounting officer and the Board. The Company will provide, free of charge, a copy of the Companys code of business conduct and ethics to any person, upon request and can be requested by writing to the Company at 8900 East Pinnacle Peak Road, Suite 207B, Scottsdale, AZ 85255. We expect to adopt any amendments or waivers to the code that are required by law. ITEM 11. EXECUTIVE COMPENSATION.\nNo executive compensation was paid during the fiscal years ended December 31, 2018 and 2017. The Company has no employment agreements with any of its officers and directors. ITEM 12.SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth certain information concerning the ownership of our common stock, with respect to: (i) each person known to us to be the beneficial owner of five percent (5%) or more of the issued and outstanding shares of the Companys common stock; (ii) each of our directors; (iii) each of our named executive officers; and (iv) all of our current directors and executive officers as a group. Unless otherwise indicated, the address for each person is our address at 8900 East Pinnacle Peak Road, Suite 207B, Scottsdale, AZ 85255.\nName and Address1 of Beneficial Owner\n5% or more Stockholders\nNumber of Shares\nPercentage\nTerry W. Neild, Chairman, President and Secretary\n27,893,333\n13.8%\nNamed Executive Officers and Directors\nScott Campbell, Officer and Director\n2,550,000\n1.2%\nEdward Heisler, Director\n7,000,000\n3.5%\nALL DIRECTORS AND NAMED EXECUTIVE OFFICERS AS A GROUP\n18.5%\n1 See address of executive officers and directors noted above table. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nThe principal executive office and telephone number are provided by Mr. Terry Neild, Chief Executive Officer of the corporation, on a rent-free basis. Mr. Neild will also not receive any interest on any funds that he may advance to us for operating expenses. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nThe following table represents the aggregate fees billed for professional services rendered for the years ended December 31, 2018 and 2017.\nAudit fees\n$0\n$750\nAudit-related fees\nTax fees\nAll other fees\nTotal fees\n$0\n$750\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES.\n1. Financial Statement Schedules\nAll financial statement schedules are omitted because they are not applicable or the amounts are immaterial or the required information is presented in the financial statements and notes thereto beginning on page 10 of this Report.\n2. Exhibits\nWe hereby file as part of this Report the exhibits listed in the attached Exhibit Index. Exhibits which are incorporated herein by reference can be accessed on the SEC website at www.sec.gov.\nExhibit\nDescription\nMethod of Filing\n3.1\nArticles of Incorporation\nIncorporated by reference to Exhibit 3.1 to the Companys Registration Statement on Form SB-2 filed with the SEC on February 5, 2007.\n3.2\nBylaws\nIncorporated by reference to Exhibit 3.1 to the Companys Registration Statement on Form SB-2 filed with the SEC on February 5, 2007.\n31.1\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nFiled electronically\n31.2\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nFiled electronically\n32.1\nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nFiled electronically\n32.2\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nFiled electronically\nInteractive Data Piles pursuant to Rule 405 of Regulation S-T.\nFiled electronically\nITEM 16. FORM 10-K SUMMARY.\nWe have elected not to include a summary pursuant to this ITEM 16.\nSIGNATURES\nIn accordance with the requirements of the Securities Act of 1933, the registrant certifies that it has reasonable grounds to believe it meets all of the requirements for filing Form 10-K and authorized this report to be signed on its behalf by the undersigned, in the city of Scottsdale, AZ, on October 19, 2022.\nSnoogoo, Corp.\n/s/ Terry Neild\nTerry Neild\nChief Executive Officer\nOctober 19, 2022"
}