{
    "cik": "1397016",
    "company": "Optex Systems Holdings Inc",
    "filing_type": "10-K",
    "filing_date": "2022-12-19",
    "period_of_report": "2022-10-02",
    "sic": "3827",
    "state_of_inc": "DE",
    "state_location": "TX",
    "fiscal_year_end": "1002",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1397016/0001493152-22-035871-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1397016/000149315222035871/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1397016/0001493152-22-035871.txt",
    "filename": "1397016_10K_2022_0001493152-22-035871.htm",
    "content": "Item 1. Business\nBackground\nCurrent Line of Business\nWe manufacture optical sighting systems and assemblies, primarily for Department of Defense applications. Our products are installed on various types of U.S. military land vehicles, such as the Abrams and Bradley fighting vehicles, light armored and armored security vehicles and the Stryker family of vehicles. We also manufacture and deliver numerous periscope configurations, rifle and surveillance sights and night vision optical assemblies. Our products consist primarily of build-to-customer print products that are delivered both directly to the armed services and to other defense prime contractors. Less than 1% of our revenue is related to the resale of products substantially manufactured by others. In this case, the product would likely be a simple replacement part of a larger system previously produced by us.\nWe continue to field new product opportunities from both domestic and international customers. We believe that given continuing unrest in multiple global hot spots, the need for precision optics continues to increase. Most of these requirements are for observation and situational awareness applications; however, we continue to see requests for higher magnification and custom reticles in various product modifications. The basic need to protect the soldier while providing information about the mission environment continues to be the primary driver for these requirements.\nRecent Events\nNASDAQ Listing Application\nOn December 7, 2022 the Company submitted an application to list its common stock on the NASDAQ Capital Market. There are no assurances (1) that the Company will continue to meet the initial listing criteria throughout the pendency of the application (including with respect to its share price), (2) that NASDAQ will approve the application or (3) relating to the timing of any such approval. If and when listed on NASDAQ, there are no assurances that the Company will continue to meet NASDAQs continued listing requirements.\nAmended and Restated Employment Agreement for Danny Schoening\nOn November 28, 2022, the Company entered into a new employment agreement with Danny Schoening. Pursuant to the agreement, which is dated as of December 1, 2022, Mr. Schoening will continue to serve as the Companys President and Chief Executive Officer through November 30, 2025. Mr. Schoenings base salary initially is $304,912 per annum, and will be increased to $314,060 on December 1, 2023 and $323,481 on December 1, 2024. Mr. Schoening will be eligible for a performance bonus based on a one-year operating plan adopted by the Companys Board of Directors (the Board). The bonus will be based on financial and/or operating metrics decided annually by the Board or the Compensation Committee and tied to such one-year plan. The target bonus will equate to 30% of Mr. Schoenings base salary. The Board will have discretion in good faith to alter the performance bonus upward or downward by 20%.\nThe updated employment agreement also served to amend Mr. Schoenings RSU Agreement, dated January 2, 2019, which had been previously amended as of December 1, 2021, by changing the third and final vesting date for the restricted stock units granted under such agreement from the change of control date to January 1, 2023.\nThe employment agreement events of termination consist of: (i) death or permanent disability of Mr. Schoening; (ii) termination by the Company for cause (including conviction of a felony, commission of fraudulent, illegal or dishonest acts, certain willful misconduct or gross negligence by Mr. Schoening, continued failure to perform material duties or cure material breach after written notice, violation of securities laws and material breach of the employment agreement), (iii) termination by the Company without cause and (iv) termination by Mr. Schoening for good reason (including continued breach by the Company of its material obligations under the agreement after written notice, the requirement for Mr. Schoening to move more than 100 miles away for his employment without consent, and merger or consolidation that results in more than 66% of the combined voting power of the Companys then outstanding securities or those of its successor changing ownership or a sale of all or substantially all of its assets, without the surviving entity assuming the obligations under the agreement). For a termination by the Company for cause or upon death or permanent disability of Mr. Schoening, Mr. Schoening will be paid accrued and unpaid salary and any bonus earned through the date of termination. For a termination by the Company without cause or by Mr. Schoening with good reason, Mr. Schoening will also be paid six months base salary in effect.\nNew Loan Agreement\nOn April 12, 2022, the Company and its subsidiary, Optex Systems, Inc. (collectively with the Company, the Borrowers), entered into an Amended and Restated Loan Agreement (the Loan Agreement) with PNC Bank, National Association, successor to BBVA USA (the Lender), pursuant to which the Borrowers existing revolving line of credit facility was decreased from $2.25 million to $1.125 million, and the maturity date was extended from April 15, 2022 to April 15, 2023.\nThe Loan Agreement requires the Borrowers to maintain a fixed charge coverage ratio of at least 1.25:1.\nOn November 21, 2022, the Borrowers issued an Amended and Restated Revolving Line of Credit Note (the Line of Credit Note) to the Lender in connection with an increase of the Borrowers revolving line of credit facility under the Loan Agreement from $1.125 million to $2.0 million. The maturity date remains April 15, 2023. Obligations outstanding under the credit facility will accrue interest at a rate equal to the Lenders prime rate minus 0.25%.\nThe Line of Credit Note and Loan Agreement contain customary events of default and negative covenants, including but not limited to those governing indebtedness, liens, fundamental changes, investments, and restricted payments. The credit facility is secured by substantially all of the operating assets of the Borrowers as collateral. The Borrowers obligations under the credit facility are subject to acceleration upon the occurrence of an event of default as defined in the Line of Credit Note and Loan Agreement.\nElection of New Director\nOn October 19, 2022, the Board of Directors of the Company expanded the size of the Board from four to five members and elected Mr. Dayton Judd as a director, to hold office until the Companys next annual meeting of shareholders and until his successor has been elected and qualified.\nTender Offer\nOn September 15, 2022, the Companys modified Dutch auction tender offer expired. In accordance with the terms and conditions of the tender offer, the Company accepted for purchase 1,603,773 shares of common stock at a price of $2.65 per share, for an aggregate cost of approximately $4.25 million, excluding fees and expenses relating to the tender offer. These shares represented approximately 19.3% of its shares of common stock outstanding as of September 15, 2022. Because the tender offer was oversubscribed, the Company accepted for payment only a pro-rated portion of the shares of common stock properly tendered by each tendering stockholder (other than odd lot holders whose shares were purchased on a priority basis).\nRenewal of Employment Agreement for Karen Hawkins\nOn July 1, 2022, the employment agreement for Karen Hawkins, CFO, auto-renewed for an additional 18-month period, expiring on December 31, 2023. The contract automatically renews for subsequent 18-month periods unless Ms. Hawkins or the Company give notice of termination at least 90 days before the end of the term then in effect. On March 28, 2022, the Compensation Committee of the Board of Directors approved a salary increase of 4% for Karen Hawkins, CFO to be effective on April 1, 2022. As a result of the increase, the salary has been changed from $205,425 to $213,642.\nStock Repurchases\nOn September 22, 2021 the Company announced authorization for a $1 million stock repurchase program.\nDuring the twelve months ended October 2, 2022, there were 190,954 common shares repurchased through the repurchase programs at a cost of $371 thousand. As of October 2, 2022, there were zero shares held in treasury purchased under the September 2021 stock repurchase program. The shares authorized to be repurchased under the repurchase program were purchased from time to time at prevailing market prices, through open market or in negotiated transactions, depending upon market conditions and subject to Rule 10b-18 as promulgated by the SEC.\nRecent Orders\n● On November 2, 2022, the Company announced it has been awarded a maximum order value of $7,500,000 for spare Light Interference Filters associated with various Night Vision Goggle systems. The expected average annual revenue over the following five-year period is $1,000,000-$1,500,000. The products will be manufactured at the Applied Optics Center (AOC) Division of Optex Systems, Inc.\n● On November 1, 2022, the Company announced it has been awarded a $3.4 million order to repair and refurbish night vision equipment for the Government of Israel, which includes an additional 100% optional award quantity. The majority of this work will be performed in the Optex Systems, Inc., Richardson facility.\n● On October 24, 2022, the Company announced it has been awarded a $720,000 order from a major US prime contractor in support of the US Armys Mobile Protected Firepower (MPF) tank program. The majority of this work will be performed in the Optex Systems, Inc., Richardson facility.\n● On October 4, 2022, the Company announced it has been awarded a $1.75 million order as part of its continuing support to the M1 Abrams Tank Program. The products will be manufactured at the Applied Optics Center (AOC) Division of Optex Systems, Inc.\n● On September 6, 2022, the Company announced it has been awarded a $1.1 million order as part of a multi-year strategic supplier agreement with a domestic commercial manufacturer of premium optical devices. The products will be manufactured at the Applied Optics Center (AOC) Division of Optex Systems, Inc.\n● On August 30, 2022, the Company announced it has been awarded a $2.23 million order as part of a multi-year strategic supplier agreement with a domestic commercial manufacturer of premium optical devices. The products will be manufactured at the Applied Optics Center (AOC) Division of Optex Systems, Inc.\n● On June 29, 2022, the Company announced a $1 million laser filter unit order as part of XM157 (NGWS-FC) Scope. The products will be manufactured at the Applied Optics Center (AOC) Division of Optex Systems, Inc.\n● On April 20, 2022, the Company announced a contract for $1.1 million as part of a multi-year strategic supplier agreement with a domestic manufacturer of premium optical devices. The products will be manufactured at the Applied Optics Center (AOC) Division of Optex Systems, Inc.\n● On March 1, 2022, the Company announced a contract for $2.1 million as part of a multi-year strategic supplier agreement with a domestic manufacturer of premium optical devices. The products will be manufactured at the Applied Optics Center (AOC) Division of Optex Systems, Inc.\nProducts\nOur products are installed on various types of U.S. military land vehicles, such as the Abrams, and Bradley and Stryker families of fighting vehicles, as well as light armored and armored security vehicles. We also manufacture and deliver numerous periscope configurations, rifle and surveillance sights and night vision optical assemblies. We deliver our products both directly to the federal government and to prime contractors.\nIn addition, the Company offers mil-spec quality High Efficiency Anti-Reflective Coatings for Infrared applications in both the military and commercial markets. These coatings are manufactured at the Applied Optics Center (AOC) Division of the Company in Dallas, Texas.\nWe deliver high volume products, under multi-year contracts, to large defense contractors and government customers. Increased emphasis in the past several years has been on new opportunities to promote and deliver our products in foreign military sales, where U.S.-manufactured, combat and wheeled vehicles, are supplied (and upgraded) in cooperation with the U.S. Department of Defense. We have a reputation for quality and credibility with our customers as a strategic supplier. We also anticipate the opportunity to integrate some of our night vision and optical sights products into commercial applications.\nSpecific product categories by product line include:\nProduct Line\nProduct Category\nPeriscopes\nLaser & Non-Laser Protected Plastic & Glass Periscopes, Electronic M17 Day/Thermal Periscopes, Vision Blocks\nSighting Systems\nBack Up Sights, Digital Day and Night Sighting Systems (DDAN), M36 Thermal Periscope, Unity Mirrors, Optical Weapon System Support and Maintenance, Commander Weapon Station Sight (CWSS)\nHowitzers\nM137 Telescope, M187 Mount, M119 Aiming Device, XM10 Aiming Circle\nOther\nMuzzle Reference Systems (MRS), Binoculars, Collimators, Optical Lenses & Elements, Windows\nApplied Optics Center\nLaser Interference Filter, Optical Assemblies, Laser Filter Units, Day Windows, Binoculars, Specialty Thin Film Coatings.\nContracts\nSome of our contracts may allow for government contract financing in the form of contract progress payments pursuant to Federal Acquisition Regulation 52.232-16, Progress Payments. Subject to certain limitations, this clause provides for government payment of up to 90% of incurred program costs prior to product delivery for small businesses like us. To the extent any contracts allow for progress payments and the respective contracts would result in significant preproduction cash requirements for design, process development, tooling, material or other resources which could exceed our current working capital or line of credit availability, we intend to utilize this benefit to minimize any potential negative impact on working capital prior to receipt of payment for the associated contract deliveries.\nOur government contracts allow for Federal Acquisition Regulation 52.243-1 which entitles the contractor to an equitable adjustment for contract or statement of work changes effecting cost or time of performance. In essence, an equitable price adjustment request is a request for a contract price modification (generally an increase) that allows for the contractor to be made whole for additional costs incurred which were necessitated by some modification of the contract effort. This modification may come from an overt change in U.S. Government requirements or scope, or it may come from a change in the conditions surrounding the contract (e.g., differing site conditions or late delivery of U.S. Government-furnished property) which result in statement of work additions, deletions, part substitutions, schedule or other changes to the contract which impact the contractors overall cost to complete.\nEach contract with our customers has specific quantities of material that need to be purchased, assembled, and then shipped. Prior to bidding for a contract, we contact potential sources of material and receive qualified quotations for each material. In some cases, the entire volume is given to a single supplier and in other cases, the volume might be split between several suppliers. If a contract has a single source supplier and that supplier fails to meet their obligations (e.g., quality, delivery), then we would attempt to find an acceptable alternate supplier, and if successful, we would then renegotiate contractual deliverables (e.g., specifications, delivery or price). As of December 1, 2022, approximately 1% of our material requirements are single-sourced across 7 suppliers representing approximately 12% of our active supplier order values. Single-sourced component requirements span across all of our major product lines. Of these single sourced components, we have material contracts (purchase orders) with firm pricing and delivery schedules in place with each of the suppliers to supply the parts necessary to satisfy our current contractual needs. See Item 1.A. Risk Factors - Risks Relating to Our Business - Certain of our products are dependent on specialized sources of supply potentially subject to disruption which could have a material, adverse impact on our business for a description of certain supplier risks we face, which description is incorporated herein by reference.\nApproximately 78% of our contracts contain termination clauses for convenience. In the event these clauses should be invoked by our customer, future revenues against these contracts could be affected, however these clauses allow for a full recovery of any incurred contract costs plus a reasonable fee up through and as a result of the contract termination. We are currently unaware of any pending terminations on our existing contracts.\nIn some cases, contract awards may be issued that are subject to renegotiation at a date (up to 180 days) subsequent to the initial award date. Generally, these subsequent negotiations have had an immaterial impact (zero to 5%) on the contract price of the affected contracts. Currently, none of our awarded contracts are subject to renegotiation.\nWe are subject to, and must comply with, various governmental regulations that impact, among other things, our revenue, operating costs, profit margins and the internal organization and operation of our business. The material regulations affecting our U.S. government business are summarized in the table below.\nRegulation\nSummary\nFederal Acquisition Regulation (FAR)\nThe principal set of rules in the Federal Acquisition Regulation System. This system consists of sets of regulations issued by agencies of the federal government of the United States to govern what is called the acquisition process, which is the process through which the government acquires goods and services. That process consists of three phases: (1) need recognition and acquisition planning, (2) contract formation, and (3) contract administration. This system regulates the activities of government personnel in carrying out that process. It does not regulate the purchasing activities of private sector firms, except to the extent that those activities involve government solicitations and contracts by reference.\nInternational Traffic in Arms Regulations (ITAR)\nUnited States government regulations that control the export and import of defense-related articles and services on the United States Munitions List. These regulations implement the provisions of the Arms Export Control Act.\nTruth in Negotiations Act (TINA)\nA public law enacted for the purpose of providing for full and fair disclosure by contractors in the conduct of negotiations with the government. The most significant provision included is the requirement that contractors submit certified cost and pricing data for negotiated procurements above a defined threshold of $2 million for contracts entered into after June, 30, 2018. The law requires contractors to provide the government with an extremely broad range of cost or pricing information relevant to the expected costs of contract performance, and it requires contractors and subcontractors to submit cost or pricing data to the government and to certify that, to the best of their knowledge and belief, the data are current, accurate, and complete. A contracting officer may still request cost or price data, if necessary, without certification, to determine whether the proposed cost or price is fair and reasonable for contracts which are below the threshold.\nWe are responsible for full compliance with the Federal Acquisition Regulation (FAR). Upon award, the contract may identify certain regulations that we need to meet. For example, a contract may allow progress billing pursuant to specific FAR clauses incorporated into the contract. Other contracts may call for specific first article acceptance and testing requirements. The FAR will identify the specific regulations that we must follow based on the type of contract awarded and contains guidelines and regulations for managing a contract after award, including conditions under which contracts may be terminated, in whole or in part, at the governments convenience or for default. These regulations also subject us to financial audits and other reviews by the government of our costs, performance, accounting and general business practices relating to our government contracts, which may result in adjustment of our contract-related costs and fees and, among other things and impose accounting rules that define allowable and unallowable costs governing our right to reimbursement under certain contracts.\nFirst Article Testing and Acceptance requirements consist of specific steps which could be comprehensive and time consuming. The dimensions and material specifications of each piece of the assembly must be verified, and some products may have in excess of 100 assembled parts. Once the individual piece parts are verified to be compliant to the specification, the assembly processes are documented and verified. A sample of the production (typically three units) is verified to meet final performance specifications. Once the units meet the final performance specification, they are then subjected to accelerated life testing, a series of tests which simulate the lifetime use of the product in the field. This consists of exposing the units to thermal extremes, humidity, mechanical shock, vibration, and other physical exposure tests. Once completed, the units undergo a final verification process to ensure that no damage has occurred as a result of the testing and that they continue to meet the performance specification. All of the information and data is recorded into a final first article inspection and test report and submitted to the customer along with the test units for final approval. First Article Acceptance and Testing is generally required on new contracts/product awards but may also be required on existing products or contracts where there has been a significant gap in production, or where the product has undergone significant manufacturing process, material, tooling, equipment or product configuration changes.\nWe are also subject to laws, regulations and executive orders restricting the use and dissemination of information deemed classified for national security purposes and the exportation of certain products and technical data as covered by the International Traffic in Arms Regulation (ITAR). In order to import or export items listed on the U.S. Munitions List, we are required to be registered with the Directorate of Defense Trade Controls office. The registration is valid for one year, and the registration fees are established based on the number of license applications submitted the previous year. We currently have an approved and current registration on file with the Directorate of Defense Trade Controls office. Once the registration is approved, each import/export license must be filed separately. License approval requires the company to provide proof of need, such as a valid contract or purchase order requirement for the specific product or technical data requested on the license and requires a detailed listing of the items requested for export/import, the end-user, the end-user statement, the value of the items, consignees/freight forwarders and a copy of a valid contract or purchase order from the end-user. The approval process for the license can vary from several weeks to six months or more. The licenses we currently use are the Department of State licenses: DSP-5 (permanent export), DSP-6 (license revisions) and DSP-73 (temporary export) and Department of Commerce: BIS-711 (export).\nThe aforementioned licenses are valid for 48 months from date that each license is issued. A summary of our active ITAR licenses is presented below (updated as of November 30, 2022):\nFiscal Year Number of Total Contract\nValue of\nActive ITAR Licenses of Expiration Licenses Licenses\nDSP-5\nIssued 2019 20,934,845\nIssued 2020 51,365\nIssued 2021 232,630\nIssued 2022 321,722\nTotal DSP-5 Licenses\n$ 21,540,562\nDSP-6 (no active licenses) N/A - $ -\nDSP-73\nIssued in 2019 $ 4,000\nTotal DSP-73 Licenses\n$ 4,000\nBIS-711\nIssued in 2019 3,416\nIssued in 2020 92,554\nIssued in 2021 323,911\nIssued in 2022 9,372\nTotal BIS-711 Licenses\n$ 429,253\nTotal All Licenses\n$ 21,973,815\nThese licenses are subject to termination if a licensee is found to be in violation of the Arms Export Control Act or the ITAR requirements. If a licensee is found to be in violation, in addition to a termination of its licenses, it can be subject to fines and penalties by the government.\nOur contracts may also be governed by the Truth in Negotiation Act (TINA) requirements where certain of our contracts or proposals exceed the TINA threshold ($2 million for awards after June 30, 2018), and/or are deemed as sole source, or non-competitive awards, covered under this act. For these contracts, we must provide a vast array of cost and pricing data in addition to certification that our pricing data and disclosure materials are current, accurate and complete upon conclusion of the negotiation. Due to the additional disclosure and certification requirements, if a post contract award audit were to uncover that the pricing data provided was in any way not current, accurate or complete as of the certification date, we could be subjected to a defective pricing claim adjustment with accrued interest. We have no history of defective pricing claim adjustments and have no outstanding defective pricing claims pending. Additionally, as a result of this requirement, contract price negotiations may span from two to six months and can result in undefinitized or not to exceed ceiling priced contracts subject to future downward negotiations and price adjustments. Currently, we do not have any undefinitized contracts subject to further price negotiation.\nOur failure to comply with applicable regulations, rules and approvals or misconduct by any of our employees could result in the imposition of fines and penalties, the loss of security clearances, the loss of our U.S. government contracts or our suspension or debarment from contracting with the U.S. government generally, any of which could have a material adverse effect our business, financial condition, results of operations and cash flows. We are currently in compliance with all applicable regulations and do not have any pending claims as a result of noncompliance.\nThe terms of our material contracts as of November 30, 2022, are as follows:\nCustomer Customer PO/Contract Contract Type Total Award Value (millions) Remaining Value (millions) Delivery Period\nUS Prime Contractor(1)\nSighting Systems\nSubcontract\nPO 35515590 FFPQ $ 3.5 $ 1.0 Oct 2017- Mar 2025\nDLA Land and Maritime(2)\nPeriscopes\nPrime\nSPE7LX-18-D-0108 IDIQ $ 1.6 $ 0.6 Feb 2020 - Apr 2023\nDLA Land and Maritime(3)\nPeriscopes\nPrime\nSPE7LX-19-D-0089 IDIQ $ 0.2 $ 0.3 Feb 2021 - Jan 2023\nDLA Land and Maritime(4)\nPeriscopes\nPrime\nSPE7LX-20-D-0020 IDIQ $ 0.8 $ 0.2 Dec 2021 - July 2023\nDLA Land and Maritime(5)\nGlass Periscopes\nPrime/Shared\nSPE7MX-20-D-0012 IDIQ $ - $ - No task awards as of current date\nDLA Land and Maritime(6)\nPeriscopes\nPrime\nSPE7MX-20-D-0028 IDIQ $ - $ - No task awards as of current date\nDLA Land and Maritime(7)\nPeriscopes\nPrime\nSPE7MX-20-D-0032 IDIQ $ - $ - No task awards as of current date\nU.S. Prime Contractor(8)\nXM10 Aiming Circles\nSubcontract\nPO 63659 FFPQ $ 2.3 $ 2.3 Pending Revision (2023-2024)\nDLA Land and Maritime(9) Prime IDIQ $ 2.2 $ 0.9 Sept 2021 - Jan 2023\nPeriscopes SPE7LX-21-D-0057\nU.S. Prime Contractor(10)\nLaser Filter Units (AOC)\nSubcontract\nPO 631537 FFPQ $ 8.4 $ 5.0 Aug 2021 - Mar 2024\nUS Prime Contractor(11)\nPeriscopes\nSubcontract\nPO 40389248,40389250 FFPQ $ 1.7 $ 0.5 Feb 2022 - Jan 2024\nCommercial Customer(12)\nOptical Assemblies (AOC)\nSubcontract\nPO 27044 FFPQ $ 2.1 $ 1.9 Jul 2022 - Dec 2022\nCommercial Customer(13)\nOptical Assemblies (AOC)\nSubcontract\nPO 27377 FFPQ $ 1.1 $ 1.0 Aug 2022 - Jan 2023\nUS Prime Contractor(14)\nLaser Filter Unit (AOC)\nSubcontract\nPO 52960 FFPQ $ 1.0 $ 1.0 Nov 2022 - Dec 2023\nCommercial Customer(15)\nOptical Assemblies (AOC)\nSubcontract\nPO 28012 FFPQ $ 2.2 $ 2.2 Apr 2023 - Dec 2023\nCommercial Customer(16)\nOptical Assemblies (AOC)\nSubcontract\nPO 28043 FFPQ $ 1.1 $ 1.1 Jun 2023 - Dec 2023\nUS Prime Contractor(17)\nDay Windows (AOC)\nSubcontract\nPO 40385578 IDIQ $ 1.9 $ 1.9 Dec 2022 - Jul 2025\nUS Prime Contractor(18)\nPeriscopes\nSubcontract\nPO 319216 FFPQ $ 0.7 $ 0.7 Jun 2023 - Aug 2024\nGovernment of Israel MOD(19)\nRefurbish Night Vision Equip\nForeign Military Sales\nPO 4441236828 FFPQ $ 3.4 $ 3.4 Pending Revision (2023-2024)\nDLA Land at Aberdeen(20)\nLight Interference Filters (AOC)\nPrime\nSPRBL1-23-D-0001 IDIQ $ 0.1 $ 0.1 May 2023\n(1) The original three-year contract was awarded on September 11, 2017 to provide LAV 6.0 optimized weapon system support for Optexs Commander Sighting System. The contract includes option years to extend the period of performance through 2035 if awarded. The current contract option extends the in-service support through March 2025 for their existing fleet of Light Armored Vehicles.\n(2) Contract awarded September 5, 2018. This is a long-term, Indefinite Delivery Indefinite Quantity (IDIQ) Contract with firm fixed pricing for the duration of a base period of three (3) years plus two (2) firm fixed priced option years for a potential total of (5) five years. On June 23, 2022 the customer exercised the option for the final option year 2. The ordering period for option year 2 expires on September 10, 2023.\n(3) Contract awarded March 4, 2019. This is a long-term, Indefinite Delivery Indefinite Quantity (IDIQ) Contract with firm fixed pricing for the duration of a base period of three (3) years plus two (2) firm fixed priced option years for a potential total of (5) five years. On March 2, 2022, the customer exercised the first of two option years extending the ordering period of the contract through March 3, 2023.\n(4) Contract awarded on November 12, 2019. This is a long-term, Indefinite Delivery Indefinite Quantity (IDIQ) Contract with firm fixed pricing for the duration of a base period of three (3) years plus two (2) firm fixed priced option years for a potential total of (5) five years for periscopes valued up to $2.3 million.\n(5) Contract awarded on December 5, 2019. This is a shared long-term, Indefinite Delivery Indefinite Quantity (IDIQ) Contract with firm fixed pricing for the duration of a base period of three (3) years plus two (2) firm fixed priced option years. The contract was a split award between Optex Systems Inc. and another supplier. As of October 2, 2022, there have been no task orders released against the base contract award.\n(6) Contract awarded on January 24, 2020. This is a long-term, Indefinite Delivery Indefinite Quantity (IDIQ) Contract with firm fixed pricing for the duration of a base period of three (3) years plus two (2) firm fixed priced option years for a potential total of (5) five years for periscopes valued up to $3.6 million. As of October 3, 2021, there have been no task orders released against the base contract award.\n(7) Contract awarded on February 12, 2020. This is a long-term, Indefinite Delivery Indefinite Quantity (IDIQ) Contract with firm fixed pricing for the duration of a base period of three (3) years plus two (2) firm fixed priced option years for a potential total of (5) five years for periscopes valued up to $9.2 million. As of October 3, 2021, there have been no task orders released against the base contract award.\n(8) Purchase Order by a U.S. prime contractor in support of government contract W15QKN-16-D-0055 for Aiming Circle optical subassemblies. The purchase order was awarded on July 30, 2020 for $2 million and amended to $2.3 million on September 14, 2020 and includes non-recurring engineering, first article testing and production deliveries. Contract has been delayed pending receipt of customer furnished material and is pending changes to the contract delivery schedule.\n(9) Contract awarded on January 6, 2021. This is a long-term, Indefinite Delivery Indefinite Quantity (IDIQ) Contract with firm fixed pricing for the duration of a base period of three (3) years plus two (2) firm fixed priced option years for a potential total of (5) five years for periscopes valued up to $14.4 million.\n(10) Purchase Order awarded August 3, 2021 by a U.S. prime contractor in support of U.S. government contracts. Award includes first article inspection in August 2021 and production deliveries commencing in September 2021 through October 2023.\n(11) Purchase Orders awarded September 24, 2021 by a U.S. prime contractor in support of U.S. government contracts.\n(12) Purchase Orders awarded February 28, 2022 to a commercial customer in support of optical assemblies.\n(13) Purchase Orders awarded April 19, 2022 to a commercial customer in support of optical assemblies.\n(14) Purchase Orders awarded June 28, 2022 from a U.S. defense contractor in support of laser filter units.\n(15) Purchase Orders awarded August 26, 2022 from a commercial customer in support of optical assemblies.\n(16) Purchase Orders awarded August 31, 2022 from a commercial customer in support of optical assemblies.\n(17) Purchase Orders awarded August 29, 2021 and modified with a significant quantity increase on September 28, 2022 by a U.S. prime contractor in support of U.S. government contracts.\n(18) Purchase Orders awarded September 16, 2022 by a U.S. prime contractor in support of U.S. government contracts.\n(19) Purchase Orders awarded October 27, 2022 to repair and refurbish night vision equipment for the Government of Israel which includes an option for an additional quantity up to 100%. The Contract is pending a firm delivery schedule pending receipt of customer furnished material and evaluation.\n(20) Contract awarded on November 2, 2022 for spare Light Interference Filters associated with various Night Vision Goggle systems. This is a five year Indefinite Delivery Indefinite Quantity (IDIQ) Contract with firm fixed pricing for the duration of the contract. The award has a maximum order value of $7,500,000 with an expected average annual revenue over the following five year period of $1,000,000-$1,500,000.\nMarket Opportunity - U.S. Military\nDuring the twelve months ended October 2, 2022, approximately 70% of our business was in support of U.S. military products. The chart below was derived from public government spending sources and depicts total U.S. military spending from 2018 through 2022 and estimated spending through 2027. The purpose of including this chart is to provide the reader with historical trend data and projected U.S. military defense and procurement spending over time. For fiscal year 2023, the total projected military spending is estimated at $767.6 billion, an overall increase of 3.6% over estimated 2022 spending. The chart below also depicts increased spending through 2027 of 10.9% from the current estimated fiscal year 2022 level, reflecting an average increase of 2.2% per year. Military procurement spending, a subset of total military spending, depicts an overall increase of $3.6 billion, or 2.7%, in fiscal year 2023 as compared to the estimated spending in fiscal year 2022.\nAs of December 7, 2022, the National Defense Authorization Act for Fiscal Year 2023 (2023 NDAA) has not yet been passed by Congress but had cleared negotiations through the U.S. House and Senate with an expected $45 billion increase over the original funding request. The Chart below depicts the original estimated funding levels from the U.S. Department of Defense based on the FY2023 budget request.\nSource: Government Publishing Office, U.S. Budget Historical Tables, FY 2023, Table 3.2 Outlays by function and sub function, 1962-2027.\nThe table below depicts the U.S. Department of Defense budget request for fiscal year 2023 for major ground system programs. The last five years have experienced a significant reduction in spending for U.S ground system military programs, which has a direct impact on the Optex Systems Richardson segment revenue. The total fiscal year 2023 budget request for major ground system programs decreased by 15.4% from the fiscal year 2022 levels and by 37.0% from the fiscal year 2019 levels. Although it is difficult to directly tie the budget request to specific components provided by Optex Systems, we provide periscopes, collimator assemblies, vision blocks and laser interface filters to the U.S. armed forces on almost all of the ground system platforms categorized below.\n($ in Millions) FY2019 FY2020 FY2021 FY2022 FY2023B\nJoint Light Tactical Vehicle $ 1,901.8 $ 1,716.5 $ 1,408.3 $ 1,048.5 $ 1,058.8\nARMY\nAbrams Tank Modification/Upgrade 2,646.0 2,186.0 1,404.2 1,261.2 717.6\nArmored Multi-Purpose Vehicle 787.8 525.2 132.1 118.9 380.7\nPaladin Integrated Management 561.6 744.5 681.4 838.0 629.7\nFamily of Medium Tactical Vehicles 127.2 141.4 211.2 77.2 97.4\nFamily Of Heavy Tactical Vehicles 324.1 50.8 28.8 201.7 147.0\nNext Generation Squad Weapon - 86.2 125.3 176.4 287.8\nGround Mobility Vehicle 44.0 - - - -\nStryker 661.5 953.2 1,186.3 1,113.8 742.4\nUSMC\nAmphibious Combat Vehicle 230.8 349.3 478.1 594.4 531.2\nTotal Ground Systems Vehicles (millions) $ 7,284.8 $ 6,753.1 $ 5,655.7 $ 5,430.1 $ 4,592.6\nSource: Office of the Under Secretary of Defense (Comptroller)/Chief Financial Officer, Program Acquisition Cost by Weapon System, United States Department of Defense, Fiscal Year 2023 Budget Request, April 2022 and Program Acquisition Cost by Weapon System, United States Department of Defense, Fiscal Year 2022 Budget Request, May 2021.\nThe 2023 Department of Defense Budget indicates an overall decrease in ground system vehicle program spending in the fiscal year 2022 and the 2023 appropriation budget years. There is generally a six to eighteen-month delay between U.S. defense budget requests and program delivery orders related to our products from government agencies and our prime defense customers. In addition, DoD budget requests are often changed throughout the congressional NDAA Budgeting and Budget appropriations process. The DoD budget requests exclude any foreign military sales as they are funded separately from the annual NDAA budgets. We are carefully watching the projected trends in both DoD military spending and FMS as defense allocation priorities change, as well as challenges which are presented from the current pandemic, global recession, and changes in political climate to ascertain any potential impact to the companys future revenue.\nThe Applied Optics Center supports numerous other military platforms outside of the ground system vehicles budget such as infantry rifle scopes, night vision monoculars, infantry and navy binoculars, night goggles, and infrared aircraft filters. The Applied Optics Center has seen a substantial increase in orders from new and existing customers in support of the other platforms, which we expect to offset the impact of the ground systems reductions to their base revenue.\nMarket Opportunity - Foreign Military\nOur products directly support FMS combat vehicles globally, including Canada, the Kingdom of Saudi Arabia, Kuwait, Morocco, Egypt, South America, and Israel. We have increased efforts to promote our proven military products, as well as newly improved product solutions directly to foreign military representatives and domestic defense contractors supporting the FMS initiatives.\nWe were successful with the Israeli Ministry of Defense (IMOD) in refurbishing a small quantity of their Night Vision Rifle Scopes. Given this success, the IMOD subsequently awarded us a $3.4 million follow on contract to continue this activity. If we successfully execute this contract, we would expect another contract award of similar size and duration.\nWe are also exploring possibilities to adapt some of our products for commercial use in those markets that demonstrate potential for solid revenue growth, both domestically and internationally.\nMarket Opportunity - Commercial\nOur products are currently sold to military and related government markets. We believe there may be opportunities to commercialize various products we presently manufacture to address other markets. Our initial focus will be directed in three product areas.\n● Big Eye Binoculars - While the military application we produce is based on mature military designs, we own all castings, tooling and glass technology. These large fixed mount binoculars could be sold to cruise ships, personal yachts and cities/municipalities. The binoculars are also applicable to fixed, land-based outposts for private commercial security as well as border patrols and regional law enforcement.\n● Thin Film Coatings - The acquisition of the Applied Optics Center (AOC) also creates a new sector of opportunity for commercial products for us. Globally, commercial optical products use thin film coatings to create product differentiation. These coatings can be used for redirecting light (mirrors), blocking light (laser protection), absorbing select light (desired wavelengths), and many other combinations. They are used in telescopes, rifle scopes, binoculars, microscopes, range finders, protective eyewear, photography, etc. Given this broad potential, the commercial applications are a key opportunity going forward.\n● Optical Assemblies - Through the Applied Optics Center, we are utilizing our experience in military sighting systems to pursue commercial opportunities associated with products that incorporate multi-lens optical cell assemblies, bonded optical elements and mechanical assemblies. There are a wide variety of products in the medical, machine vision, automotive and outdoor recreation fields that can benefit from our capabilities. Support to domestic customers for these type products has driven significant increases in Applied Optics Segment sales during the last five years.\nCustomer Base\nWe serve customers in four primary categories: as prime defense contractor (Defense Logistics Agency (DLA) Land and Maritime, DLA Warren, DLA Aviation, U.S. Army, Navy and Marine Corps), as defense subcontractor (General Dynamics, L-3 Communications, Elbit Systems, BAE, Sig Sauer, and ADS Inc.), as a military supplier to foreign governments (Israel, Australia, South America and Canada) and also as a commercial optical assembly supplier (Nightforce Optics, Cabelas, Amazon). During the twelve months ended October 2, 2022, we derived approximately 80% of our gross business revenue from five major customers: U.S. government agencies (14%), three major defense contractors (22%, 15%, and 7%), and one commercial customer (22%). We have approximately 111 discrete contracts for items that are utilized in vehicles, optical product lines and as spare parts. Due to the high percentage of prime and subcontracted U.S. defense revenues, large customer size and the fact that there are multiple contracts with each entity, which are not interdependent, we are of the opinion that this provides us with a fairly well diversified revenue pool.\nMarketing Plan\nWe believe we are well positioned to service both U.S. and foreign military needs by our focus on delivering products that satisfy the following factors important to the U.S. military:\n● Product reliability - failure can cost lives\n● Speed to delivery and adherence to delivery schedule\n● System life cycle extension\n● Low cost/best value\n● Visual aids for successful execution of mission objectives\n● Mission critical products specifically related to soldier safety.\nPotential Entrants - Low Risk to us. In order to enter this market, potential competitors must overcome several barriers to entry. The first hurdle is that an entrant would need to prove to the government agency in question the existence of a government approved accounting system for larger contracts. Second, the entrant would need to develop the processes required to produce the product. Third, the entrant would then need to produce the product and submit successful test requirements (many of which require lengthy government consultation for completion). Finally, in many cases, the customer has an immediate need and therefore cannot wait for this qualification cycle and therefore must issue the contracts to existing suppliers. Given the expense of development and qualification testing, the barrier to entry is high for new competitors.\nBuyers - Medium Risk to us. In most cases the buyers (usually government agencies or defense contractors) have two fairly strong suppliers. It is in their best interest to keep at least two, and therefore, in some cases, the contracts are split between suppliers. In the case of larger contracts, the customer can request an open book policy on costs and expects a reasonable margin to have been applied.\nSubstitutes - Low Risk to us. We have both new vehicle contracts and replacement part contracts for the same product. Three combat vehicles have a long history of service in the U.S. Army. The first M-1 Abrams Tank entered service with the Army in 1980; the M-2/M-3 Bradley Fighting Vehicle in 1981; and the Stryker Combat Vehicle in 2001. Under current Army modernization plans, the Army envisions all three vehicles in service with Active and National Guard forces beyond FY2028. Optex Systems provides periscopes and optical sighting systems in support of all three vehicle platforms. Since it was first fielded in 1980, the Abrams tank has undergone near-continuous upgrades and improvements; however, as illustrated above, spending on modifications and upgrades of the Abrams tank by the U.S. military has significantly decreased in the past five years and we expect this trend to continue. The Abrams is the principal battle tank of the United States Army and Marine Corps, and the armies of Egypt, Kuwait, Saudi Arabia, Iraq, and since 2007, Australia. On average, there has been a new improvement package every seven years. The Army is currently upgrading the Abrams with a System Enhancement Package Version 3 (SEPv3), with additional upgrades in development. Additionally, the US Army has announced contracts to produce 742 Stryker DVH vehicles, redesigned (dual v-hulled vehicles) to be more resistant to land mines, as retrofits and as new production vehicles. The Abrams, Bradley and Striker vehicles are the only production tanks currently in production by the government. We believe that this, in conjunction with the 30-year life span, supports our expectation that they will continue to be used through 2040.\nSuppliers - Low to Medium Risk to Optex Systems Holdings. The suppliers of standard processes (e.g., casting, machining and plating) need to be very competitive to gain and/or maintain contracts. Those suppliers of products that use top secret clearance processes have a slight advantage; however, there continues to be multiple avenues of supply and therefore only moderate power.\nConsistent with our marketing plan and business model, the AOC acquisition strengthened our overall position by decreasing the bargaining power of their suppliers through the backwards integration of a key supplier and created additional barriers of entry for potential competitors.\nThe following matrix reflects the current focus of our four basic approaches for sales and development:\n1) Sell existing products to existing customers.\n2) Sell existing products to new customers.\n3) Develop new products to meet the needs of our existing customers.\n4) Develop new products to meet the needs of new customers.\nExisting Customers\nNew Customers\nNew Products\nChile M17 Day/Thermal\nUSACC Binoculars\nBrazil M17 Day/Thermal\nGDLS DDAN, OWSS\nIsrael M17 Day/Thermal, OWSS\nU.S. Prime Contractor - XM10 Aiming Circle\nCommercial Optical Lens\nCommercial: Optical Lens, Spotting Scopes, Monocular Lens\nExisting Products\nUSACC Periscopes, Back Up Sights,\nMarines Sighting Systems\nBinoculars, Vision Blocks,\nLaser Filter Units\nCommercial: Optical Lens, Spotting\nGDLS Periscopes, Collimators\nScopes, Monocular Lens\nBAE Periscopes\nL3- Laser Interface Filters\nU.S. Prime Contractor - Laser Filter Units\nDLA Optical Elements\nOperations Plan\nOur operations plan can be broken down into three distinct areas: material management, manufacturing space planning and efficiencies associated with economies of scale.\nMaterials Management\nThe largest portion of our costs is materials. We have completed the following activities in order to demonstrate continuous improvement:\n- Successful completion of annual surveillance audit for ISO 9001:2008 certificate, with no major nonconformance issues\n- Weekly cycle counts on inventory items\n- Weekly material review board meeting on non-moving piece parts\n- Kanban kitting on products with consistent ship weekly ship quantities\n- Daily cross functional floor meetings focused on delivery, yields and labor savings\n- Redesigned floor layout using tenant improvement funds\n- Daily review of yields and product velocity\n- Bill of material reviews prior to work order release\nFuture continuous improvement opportunities include installation and training of shop floor control module within the ERP system and organizational efficiencies of common procurement techniques among buyers.\nManufacturing Space Planning\nWe currently lease 93,967 square feet of manufacturing space (see Properties). Our current facilities are sufficient to meet our immediate production needs without excess capacity. As our processes are primarily labor driven, we are able to easily adapt to changes in customer demand by adjusting headcounts, overtime schedules and shifts in line with production needs. In the event additional floor space is required to accommodate new contracts, Optex has the option to lease adjacent floor space at the current negotiated lease cost per square foot. Consistent with the space planning, we will drive economies of scale to reduce support costs on a percentage of sales basis. These cost reductions can then be either passed through directly to the bottom line or used for business investment.\nOur manufacturing process is driven by the use of six sigma techniques and process standardization. Initial activities in this area have been the successful six sigma projects in several production areas which have led to improved output and customer approval on the aesthetics of the work environment. In addition, we use many tools including 5S programs, six sigma processes, and define, measure, analyze, improve, control (DMAIC) problem solving techniques to identify bottlenecks within the process flow, reduce cost and improve product yields. Successful results can then be replicated across the production floor and drive operational improvements.\nEconomies of Scale\nPlant efficiencies fluctuate as a function of program longevity, complexity and overall production volume. Our internal processes are primarily direct labor intensive and can be more easily adapted to meet fluctuations in customer demand; however, our material purchases, subcontracted operations and manufacturing support costs are extremely sensitive to changes in volume. As our volume increases, our support labor, material and scrap costs decline as a percentage of revenue as we are able to obtain better material pricing, and scrap, start up and support labor (fixed) costs and they are spread across a higher volume base. On the contrary, as production volumes decline, our labor and material costs per unit of production generally increase. Additional factors that contribute to economies of scale relate to the longevity of the program. Long running, less complex programs (e.g., periscopes) do not experience as significant of an impact on labor costs as production volumes change, as the associated workforce is generally less skilled and can be ramped quickly as headcounts shift. Our more complex thin laser filter coatings, Howitzer and thermal day/night programs are more significantly impacted by volume changes as they require a more highly-skilled workforce and ramp time is longer as the training is more complex. We continually monitor customer demand over a rolling twelve-month window and in order to anticipate any changes in necessary manpower and material which allows us to capitalize on any benefits associated with increased volume and minimize any negative impact associated with potential declines in product quantities.\nSources and Availability of Raw Materials\nDisclosure responsive to this item is incorporated herein by reference to Risk Factors - Risks Related to Our Business - Certain of our products are dependent on specialized sources of supply potentially subject to disruption which could have a material, adverse impact on our business.\nIntellectual Property\nWe utilize several highly specialized and unique processes in the manufacture of our products. While we believe that these trade secrets have value, it is probable that our future success will depend primarily on the innovation, technical expertise, manufacturing and marketing abilities of our personnel. We cannot assure you that we will be able to maintain the confidentiality of our trade secrets or that our non-disclosure agreements will provide meaningful protection of our trade secrets, know-how or other proprietary information in the event of any unauthorized use, misappropriation or other disclosure. The confidentiality agreements that are designed to protect our trade secrets could be breached, and we might not have adequate remedies for the breach. Additionally, our trade secrets and proprietary know-how might otherwise become known or be independently discovered by others. We possess three utility patents and two design patents.\nOur competitors, many of which have substantially greater resources, may have applied for or obtained, or may in the future apply for and obtain, patents that will prevent, limit or interfere with our ability to make and sell some of our products. Although we believe that our products do not infringe on the patents or other proprietary rights of third parties, we cannot assure you that third parties will not assert infringement claims against us or that such claims will not be successful.\nThe following patents generally expire 20 years after issuance.\nOn October 17, 2022, we filed for a new design patent, currently under review with the United States Patent and Trademark Office for an Interchangeable Offset Image Prism which provides a method for adapting a quick release prism with offset image.\nOn November 4, 2021 we were issued U.S. Patent No. 2021/0341746A1 titled Selectable Offset Image Wedge which is a mechanical wedge used to offset the image anywhere in the selectable range of circular travel within the defined offset field of view. This application is a continuation-in-part of U.S. Patent No. 10,324,298 and claims priority to U.S. Patent No. 10,324,298, issued on June 18, 2019.\nOn June 18, 2019 we were issued U.S. Patent No. 10,324,298 titled Offset Image Wedge with Dual Capability and Alignment Technique. The invention relates to an offset image wedge for use on a bore-sighted rifle mounted directly onto the scope via a clamp mounting device. The wedge allows for a dual image which can be aligned in the field and provides the user with a choice of either a bore-sighted image or an offset image without removing the wedge.\nOn July 11, 2017, we were issued U.S. Patent No. D791,852 S, for our Red Tail Digital Spotting Scope. We have a retail sales relationship with Cabelas Inc. and Amazon, to distribute these scopes. They are currently the only digital spotting scope offered by Cabelas. Our Red Tail Digital Spotting Scopes also received a favorable review from Trigger Magazine in 2017.\nIn May 2015, we announced the issuance to us of U.S. Patent No. 13,792,297 titled ICWS Periscope. This invention improves previously accepted levels of periscope performance that, in turn, improve soldiers safety.\nIn December 2013, Optex Systems, Inc. was issued U.S. Patent No. 23,357,802 titled Multiple Spectral Single Image Sighting System Using Single Objective Lens Set. The technology platform, designed for our DDAN program, is applicable to all ground combat vehicles used by the US and foreign militaries. This invention presents a single image to both day and night sensors using precision optics, which in turn allows the user to individually observe day, night, or day and night simultaneously. In addition, it has proven to be especially useful in light transition points experienced at dusk and dawn. We are in production and currently delivering sighting systems with this advanced technology, a significant upgrade in the goal of supporting our customers as they modernize the worldwide inventory of aging armored vehicles. This technology is applicable to many sighting systems, and it has already been designed for implementation on the Light Armored Vehicles, the Armored Security Vehicle, the Amphibious Assault Vehicle, and the M60 Main Battle Tank. Digital Day and Night technology has advanced the capabilities of these installed weapon systems and is the first in a series of patents we have applied for to protect our Intellectual Property portfolio in support of the warfighters who use these systems.\nIn May 2012, we purchased a perpetual, non-exclusive license, with a single up-front license fee of $200,000 to use Patent 7,880,792 Optical and Infrared Periscope with Display Monitor (issued in 2011 and owned by Synergy International Optronics, LLC). We believe the purchase of the license agreement may allow us to extend and expand our market potential for the M113APC vehicle type which has the highest number of commonly used armored vehicles in the world. The current estimated active M113 APC worldwide inventory is over 80,000 units. This licensing of this patent allows us to develop additional products for this vehicle type, including the M17 Day/Thermal and M17 Day/Night periscopes. We are actively marketing the new periscopes internationally and completed our first international shipment utilizing this technology in March 2014. We continue to prototype these products and demonstrate them to potential customers.\nCompetition\nThe markets for our products are competitive. We compete primarily on the basis of our ability to design and engineer products to meet performance specifications set by our customers. Our customers include military and government end users as well as prime contractors that purchase component parts or subassemblies, which they incorporate into their end products. Product pricing, quality, customer support, experience, reputation and financial stability are also important competitive factors.\nThere are a limited number of competitors in each of the markets for the various types of products that we design, manufacture and sell. At this time, we consider our primary competitors for the Optex, Richardson site to be Kent Periscopes and Synergy International Optronics, LLC. The Applied Optics Center thin film and laser coatings products compete primarily with Materion-Barr, Artemis and Alluxa.\nOur competitors are often well entrenched, particularly in the defense markets. While we believe that the quality of our technologies and product offerings provides us with a competitive advantage over certain manufacturers, some of our competitors have substantially greater financial and other resources than we do to spend on the research and development of their technologies and for funding the construction and operation of commercial scale plants.\nWe expect our competitors to continue to improve the design and performance of their products. We cannot assure investors that our competitors will not develop enhancements to, or future generations of, competitive products that will offer superior price or performance features, or that new technology or processes will not emerge that render our products less competitive or obsolete. Increased competitive pressure could lead to lower prices for our products, thereby adversely affecting our business, financial condition and results of operations. Also, competitive pressures may force us to implement new technologies at a substantial cost, and we may not be able to successfully develop or expend the financial resources necessary to acquire new technology. We cannot assure you that we will be able to compete successfully in the future.\nEmployees and Human Capital\nWe had 84 full time equivalent employees as of October 2, 2022 and 88 employees as of December 1, 2022, which include a small temporary work force to handle peak loads as needed. We are in compliance with local prevailing wage, contractor licensing and insurance regulations, and have good relations with our employees, who are not currently unionized. We use outside consultants for various services. We have not experienced any work stoppages and are not a party to a collective bargaining agreement. Management considers labor relations to be good.\nWe are dedicated to preserving operational excellence and remaining an employer of choice. We provide and maintain a work environment that is designed to attract, develop and retain top talent through offering our employees an engaging work experience that contributes to their career development. We recognize that our success is based on the collective talents and dedication of those we employ, and we are highly invested in their success. We value our employees and believe that employee loyalty and enthusiasm are key elements of our operating performance.\nCorporate History\nOptex Systems Holdings, Inc. is a Delaware corporation originally organized in Delaware as Sustut Exploration, Inc. in April 2006. Optex Systems, Inc. is a Delaware corporation organized in September 2008. In March 2009, Optex Systems, Inc. engaged in a reverse merger with Sustut Exploration, Inc., in connection with which the latter was renamed Optex Systems Holdings, Inc. and the former became a wholly-owned subsidiary of Optex Systems Holdings, Inc.\nInternet Address\nThe Company maintains an internet website at the following address: www.optexsys.com. The information on the Companys website is not incorporated by reference in this Annual Report on Form 10-K. Item 1A. Risk Factors\nInvesting in our common stock involves a high degree of risk. Prospective investors should carefully consider the risks described below, together with all of the other information included or referred to in this Annual Report, before purchasing shares of our common stock. There are numerous and varied risks, known and unknown, that may prevent us from achieving our goals. The risks described below are not the only risks we face. If any of these risks actually materializes, our business, financial condition or results of operations may be materially adversely affected. In such case, the trading price of our common stock could decline and investors in our common stock could lose all or part of their investment. The risks and uncertainties described below are not exclusive and are intended to reflect the material risks that are specific to us, our industry and companies that have securities trading on an over-the-counter market.\nRisks Related to our Business\nOur results of operations could be adversely affected by economic and political conditions globally and the effects of these conditions on our customers businesses and levels of business activity.\nEconomic and political events this year have altered the landscape in which we and other U.S. companies operate in a variety of ways. In response to inflationary pressures, the U.S. Federal Reserve has raised interest rates, resulting in an increase in the cost of borrowing for us, our customers, our suppliers, and other companies relying on debt financing. World events, such as the Russian invasion of Ukraine and the resulting economic sanctions, have impacted the global economy, including by exacerbating inflationary and other pressures linked to COVID-related supply chain disruptions. Prolonged inflationary conditions, high and/or increased interest rates, and additional sanctions or retaliatory measures related to the Russia-Ukraine crisis, or other situations, could further negatively affect U.S. and international commerce and exacerbate or prolong the period of high energy prices and supply chain constraints. At this time, the extent and duration of these economic and political events and their effects on the economy and the Company are impossible to predict.\nLow unemployment and tight labor markets may adversely affect our labor costs and our ability to hire and retain a sufficient workforce required to meet the backlog and customer demands. If we are not able to maintain a sufficient workforce and attract and retain additional personnel as required, we may not be able to implement our business plan and our results of operations could be materially and adversely affected.\nWe compete with several other large defense contractors, as well as homebuilding, industrial manufacturing and warehousing industries within the immediate area of our manufacturing facilities for both lower and higher skill level manufacturing employees. The limited supply of available workers for hire, combined with increasing competition among other local industries may result in increased production costs associated with higher wages, employee bonuses, overtime premiums and enhanced employee benefits in addition to cost increases associated with employee recruitment, employee turnover, training and learning curve inefficiencies. We may be unable to fill the labor positions required to meet our customer demands in a timely or cost-effective manner which would impede our ability to meet current or increasing production levels in line with our customer expectations and adversely affect our ability to grow revenue or maintain our current margin levels.\nOur ability to fulfill our backlog may have an effect on our long-term ability to procure contracts and fulfill current contracts.\nOur ability to fulfill our backlog may be limited by our ability to devote sufficient financial and human capital resources and limited by available material supplies. Disruptions in our supply chain and transportation delays, combined with inflationary pressures and tight labor market conditions could impede our ability to meet customer requirements. If we do not fulfill our backlog in a timely manner, we may experience delays in product delivery which would postpone receipt of revenue from those delayed deliveries. Additionally, if we are consistently unable to fulfill our backlog, this may be a disincentive to customers to award large contracts to us in the future until they are comfortable that we can effectively manage our backlog.\nOur historical operations depend on government contracts and subcontracts. We face risks related to contracting with the federal government, including federal budget issues and fixed price contracts.\nFuture general political and economic conditions, which cannot be accurately predicted, may directly and indirectly affect the quantity and allocation of expenditures by federal agencies. Even the timing of incremental funding commitments to existing, but partially funded, contracts can be affected by these factors. Therefore, cutbacks or re-allocations in the federal budget could have a material adverse impact on our results of operations. Obtaining government contracts may also involve long purchase and payment cycles, competitive bidding, qualification requirements, delays or changes in funding, budgetary constraints, political agendas, extensive specification development, price negotiations and milestone requirements. In addition, our government contracts are primarily fixed price contracts, which may prevent us from recovering costs incurred in excess of budgeted costs. Fixed price contracts require us to estimate the total project cost based on preliminary projections of the projects requirements. The financial viability of any given project depends in large part on our ability to estimate such costs accurately and complete the project on a timely basis. Some of those contracts are for products that are new to our business and are thus subject to unanticipated impacts to manufacturing costs. Even if our estimates are reasonable at the time made, prices of materials are subject to unanticipated adverse fluctuation. In the event our actual costs exceed fixed contractual costs of our product contracts, we will not be able to recover the excess costs which could have a material adverse effect on our business and results of operations. We examine these contracts on a regular basis and accrue for anticipated losses on these contracts, if necessary. As of October 2, 2022, there was $289 thousand in accrued loss provisions for loss contracts or cost overruns.\nApproximately 77% of our contracts contain termination clauses for convenience. In the event these clauses should be invoked by our customer, future revenues against these contracts could be affected, however these clauses allow for a full recovery of any incurred contract costs plus a reasonable fee up through and as a result of the contract termination. We are currently unaware of any pending terminations on our existing contracts.\nIn some cases, contract awards may be issued that are subject to renegotiation at a date (up to 180 days) subsequent to the initial award date. Generally, these subsequent negotiations have had an immaterial impact (zero to 5%) on the contract price of the affected contracts. Currently, none of our awarded contracts are subject to renegotiation.\nWe have sought to minimize the adverse impact from the slower pace of U.S. military orders on our results of operations by seeking to obtain foreign military orders, expanding our customer base as well as seeking new commercial business. We do not expect these markets to completely mitigate the negative impact of lower U.S. defense spending.\nIf we fail to scale our operations appropriately in response changes in demand, we may be unable to meet competitive challenges or exploit potential market opportunities, and our business could be materially and adversely affected.\nSignificant fluctuations in customer demand place a significant strain on our management personnel, infrastructure and resources. To implement our current business and product plans, we need to appropriately manage our cost base, as well as train, manage and motivate our workforce, while continuing to maintain our critical operational and financial systems and our manufacturing and service capabilities. All of these endeavors require substantial management effort and potential capital. If we are unable to effectively manage our operations to our customer demand levels, we may be unable to scale our business quickly enough to meet competitive challenges or exploit potential market opportunities, and our current or future business could be materially and adversely affected.\nWe do not have employment agreements with our key personnel, other than our Chief Executive and Financial Officers, and our management has minimal unencumbered equity ownership in us. If we are not able to retain our key personnel or attract additional key personnel as required, we may not be able to implement our business plan and our results of operations could be materially and adversely affected.\nWe depend to a large extent on the abilities and continued participation of our executive officers and other key employees. The loss of any key employee could have a material adverse effect on our business. We currently have only two employment agreements, with our Chief Executive Officer which currently expires on November 30, 2025, and our Chief Financial Officer which expires on December 31, 2023 with renewable terms each 18 months thereafter. We do not presently maintain key man insurance on any other key employees. We believe that experienced personnel will continue to be required to implement our business plan. Competition for such personnel is intense, and we cannot assure you that they will be available when required, or that we will have the ability to attract and retain them. In addition, due to our small size, we do not presently have depth of staffing in our executive, operational and financial management areas in order to have an effective succession plan should the need arise. Thus, in the event of the loss of one or more of our management employees, our results of operations could be vulnerable to challenges associated with recruiting additional key personnel, if such recruiting efforts are not successful in a timely manner.\nCertain of our products are dependent on specialized sources of supply potentially subject to disruption which could have a material, adverse impact on our business.\nWe expect recent supply chain disruptions driven by the pandemic and Russias invasion of Ukraine and the related sanctions, combined with raw material shortages, labor shortages, transportation delays and inflationary pressures, to continue for the foreseeable future. These conditions have strained our suppliers and extended supplier delivery lead times, affecting their ability to sustain operations. We are experiencing market wide material shortages for paint and resin products as well as critical epoxies and chemicals used in our manufacturing process. In addition, we are seeing substantial increases in the costs of aluminum, steel and acrylic commodities. In addition, we have experienced supplier schedule delays for other key components which are driven by supplier labor and material shortages. In several cases, spotty supply and material shortages have resulted in stocking higher inventory safety stock levels to ensure adequate lead time to replenish critical supplies.\nWe have selectively single-sourced some of our material components in order to mitigate excess procurement costs associated with significant tooling and startup costs. Furthermore, because of the nature of government contracts, we are often required to purchase selected items from U.S. government approved suppliers, which may further limit our ability to utilize multiple supply sources for these key components.\nTo the extent any of these single sourced or government approved suppliers may have disruptions in deliveries due to production, quality, or other issues, we may also experience related production delays or unfavorable cost increases associated with retooling and qualifying alternate suppliers. The impact of delays resulting from disruptions in supply for these items could negatively impact our revenue, our reputation with our customers, and our results of operations. In addition, significant price increases from single-source suppliers could have a negative impact on our profitability to the extent that we are unable to recover these cost increases on our fixed price contracts.\nEach contract has a specific quantity of material which needs to be purchased, assembled, and shipped. Prior to bidding on a contract, we contact potential sources of material and receive qualified quotations for this material. In some cases, the entire volume is given to a single supplier and in other cases; the volume might be split between several suppliers. If a contract has a single source supplier and that supplier fails to meet their obligations (e.g., quality, delivery), then we would seek to find an alternate supplier and bring this information back to the final customer. Contractual deliverables would then generally be re-negotiated (e.g., specifications, delivery, price. As of December 1, 2022, approximately 1% of our material requirements are single-sourced across 7 suppliers representing approximately 12% of our active supplier order value. Single-sourced component requirements span across all of our major product lines.\nWe consider it a material financial or schedule risk if we believe it will take us at least three months to identify and qualify a suitable replacement for specialized single source suppliers. In the table below, we identify those specialized single source suppliers with respect to which we face such a material risk and the product lines supported by those materials utilized by us as of December 1, 2022.\nProduct Line\nSupply Item\nRisk\nPurchase Orders\nSighting Systems M36 DDAN\nDigital camera system\nAlternative source would take in excess of six months to qualify\nCurrent firm fixed price & quantity purchase orders are in place with the supplier to meet all contractual requirements.\nPeriscopes\nDie-cast housings\nAll die cast tooling is consolidated at this supplier. It would take approximately six months to move tooling and re-qualify a new supplier.\nCurrent firm fixed price & quantity purchase orders are in place with the supplier to meet all contractual requirements. Supplier is on schedule.\nPeriscopes\nSteel castings\nAlternative supplier source would take six months to qualify.\nCurrent firm fixed price & quantity purchase orders are in place with the supplier to meet all contractual requirements.\nVision Blocks\nMIL Spec welded housings for vision blocks\nWould take approximately 8-10 months to re-qualify a new supplier source.\nCurrently working with current vendor to keep supply of these parts\nVision Blocks\nLarge/Small/Customs Blocks\nWould take approximately 4-6 months to re-qualify a new supplier source.\nCurrently working with single source for purchasing material on a forecast projection basis\nMRS\nAL Castings for Housing\nWould take approximately 8-12 months to re-qualify a new supplier source.\nCurrently, ordering for a single source, new casting tool and FAT will be required to qualify a new source\nShort/Long Drivers\nMirrors\nWould take approximately 8-12 months to re-qualify a new supplier source.\nCurrently working with single source for purchasing material on a forecast projection basis\nBig Eye\nSand castings for big eye binocular parts\nWould take approximately 4-6 months to re-qualify a new supplier source\nCurrent firm fixed price & quantity purchase orders are in place with the supplier to meet all contractual requirements.\nApplied Optics Center\nM22/M24 Binocular\nSpare Components\nOnly approved source due to proprietary rights. Alternate source cannot be developed.\nCurrent firm fixed price and quantity purchase orders are in place with the supplier to meet all contractual requirements. Supplier is on schedule.\nThe defense technology supply industry is subject to technological change and if we are not able to keep up with our competitors and/or they develop advanced technology as response to our products, we may be at a competitive disadvantage.\nThe market for our products is generally characterized by technological developments, evolving industry standards, changes in customer requirements, frequent new product introductions and enhancements, short product life cycles and severe price competition. Our competitors could also develop new, more advanced technologies in reaction to our products. Currently accepted industry standards may change. Our success depends substantially on our ability, on a cost-effective and timely basis, to continue to enhance our existing products and to develop and introduce new products that take advantage of technological advances and adhere to evolving industry standards. An unexpected change in one or more of the technologies related to our products, in market demand for products based on a particular technology or of accepted industry standards could materially and adversely affect our business. We may or may not be able to develop new products in a timely and satisfactory manner to address new industry standards and technological changes, or to respond to new product announcements by others. In addition, new products may or may not achieve market acceptance.\nUnexpected warranty and product liability claims could adversely affect our business and results of operations.\nThe possibility of future product failures could cause us to incur substantial expense to repair or replace defective products. We warrant the quality of our products to meet customer requirements and be free of defects for twelve months subsequent to delivery. We establish reserves for warranty claims based on our historical rate of returned shipments against these contracts. There can be no assurance that this reserve will be sufficient if we were to experience an unexpectedly high incidence of problems with our products. Significant increases in the incidence of such claims may adversely affect our sales and our reputation with consumers. Costs associated with warranty and product liability claims could materially affect our financial condition and results of operations.\nWe rely on the proper function, availability and security of information technology systems to operate our business and a cyber-attack or other breach of these systems could have a material adverse effect on our business, financial condition or results of operations.\nWe rely on information technology systems to process, transmit, and store electronic information in our day-to-day operations. Similar to other companies, the size and complexity of our information technology systems makes them vulnerable to a cyber-attack, malicious intrusion, breakdown, destruction, loss of data privacy, or other significant disruption. Our information systems require an ongoing commitment of significant resources to maintain, protect, and enhance existing systems and develop new systems to keep pace with continuing changes in information processing technology, evolving systems and regulatory standards.\nOn July 13, 2021, we experienced a ransomware attack. While we do not expect that attack to have material adverse consequences, similar attacks, if not caught and effectively addressed in a timely manner, could have a material adverse effect on our business, financial condition and results of operations.\nAny failure by us to maintain or protect our information technology systems and data integrity, including from cyber-attacks, intrusions or other breaches, could result in the unauthorized access to personally identifiable information, theft of intellectual property or other misappropriation of assets, or otherwise compromise our confidential or proprietary information and disrupt our operations. Any of these events may cause us to have difficulty preventing, detecting, and controlling fraud, be subject to legal claims and liability, have regulatory sanctions or penalties imposed, have increases in operating expenses, incur expenses or lose revenues as a result of a data privacy breach or theft of intellectual property, or suffer other adverse consequences, any of which could have a material adverse effect on our business, financial condition or results of operations.\nWe may face risks as a result of the COVID-19 pandemic.\nWe may be at risk as a result of the continuing COVID-19 pandemic. Risks that could affect our business include the duration and scope of the COVID-19 pandemic and the impact on the demand for our products; actions by governments, businesses and individuals taken in response to the pandemic; the length of time of the COVID-19 pandemic and the possibility of its reoccurrence; the timing required to develop and implement effective treatments and achieve acceptable vaccination rates in the event of future outbreaks; the eventual impact of the pandemic and actions taken in response to the pandemic on global and regional economies; and the pace of recovery when the COVID-19 pandemic subsides.\nThe pandemic has caused several program delays throughout the defense supply chain as a result of plant shutdowns, employee illnesses, travel restrictions, remote work arrangements and similar supplier issues.\nThe sweeping and evolving nature of the COVID-19 pandemic makes it extremely difficult to predict how our business operations will be affected in the long term by the COVID-19 outbreak, variants of COVID-19, and any virus that spreads in a similar fashion. A repeat of the cascading effects of the COVID-19 pandemic could materially increase our costs, severely negatively impact our revenue, net income, and other results of operations, and impact our liquidity position, possibly significantly. The extent and duration of any such impacts on our business, financial condition, and results of operations cannot be predicted.\nWe derive almost all of our revenue from a small number of customers and the loss of any of these customers could have a material adverse effect on our revenues.\nFor the year ended October 2, 2022, the Companys consolidated revenues were derived from U.S. government agencies (14%), three U.S. defense contractors (22%, 15%, and 7%), one major commercial customer (22%) and all other customers (20%). Approximately 93% of total Company revenue is generated from domestic customers and 7% is derived from foreign customers, primarily Canada. In particular, a decision by one of our major defense contract customers, U.S. government agencies, or major commercial customers to cease issuing contracts to us could have a significant material impact on our business and results of operations given that they represent over 80% of our gross business revenue. There can be no assurance that we could replace these customers on a timely basis or at all.\nWe have approximately 111 discrete contracts with major defense contractors and the U.S. Government (primarily Defense Logistics Agencies (DLA)), and other prime U.S. defense contractors. If they choose to terminate these contracts, we are entitled to fully recover all contractual costs and reasonable profits incurred up to or as a result of the terminated contract.\nWe only possess six patents and rely primarily on trade secrets to protect our intellectual property.\nWe utilize several highly specialized and unique processes in the manufacture of our products, for which we rely solely on trade secrets to protect our innovations. We cannot assure you that we will be able to maintain the confidentiality of our trade secrets or that our non-disclosure agreements will provide meaningful protection of our trade secrets, know-how or other proprietary information in the event of any unauthorized use, misappropriation or other disclosure. The non-disclosure agreements that are designed to protect our trade secrets could be breached, and we might not have adequate remedies for the breach.\nIt is also possible that our trade secrets will otherwise become known or independently developed by our competitors, many of which have substantially greater resources than us, and these competitors may have applied for or obtained, or may in the future apply for or obtain, patents that will prevent, limit or interfere with our ability to make and sell some of our products. Although based upon our general knowledge (and we have not conducted patent searches), we believe that our products do not infringe on the patents or other proprietary rights of third parties; however, we cannot assure you that third parties will not assert infringement claims against us or that such claims will not be successful.\nWe may need to raise additional capital in the future beyond any cash flow from our existing business; additional funds may not be available on terms that are acceptable to us, or at all.\nWe may need to raise additional capital in the future to finance our future working capital needs. We cannot assure you that any additional capital will be available on a timely basis, on acceptable terms, or at all. Future equity or debt financings may be difficult to obtain. If we are not able to obtain additional capital as may be required, our business, financial condition and results of operations could be materially and adversely affected.\nWe anticipate that our capital requirements will depend on many factors, including:\n● our ability to fulfill backlog;\n● our ability to procure additional production contracts;\n● our ability to control costs;\n● the timing of payments and reimbursements from government and other contracts, including but not limited to changes in federal government military spending and the federal government procurement process;\n● increased sales and marketing expenses;\n● technological advancements and competitors response to our products;\n● capital improvements to new and existing facilities;\n● our relationships with customers and suppliers; and\n● general economic conditions including the effects of future economic slowdowns, acts of war or terrorism and the current international conflicts.\nEven if available, financings may involve significant costs and expenses, such as legal and accounting fees, diversion of managements time and efforts, and substantial transaction costs. If adequate funds are not available on acceptable terms, or at all, we may be unable to finance our operations, develop or enhance our products, expand our sales and marketing programs, take advantage of future opportunities or respond to competitive pressures.\nRisks Related to Our Stock\nOur common stock is currently quoted on an Over-The-Counter Market, which affects the liquidity of our common stock and may affect its stock price.\nAlthough we have recently applied to list our common stock on the NASDAQ Capital Market, there can be no assurances that the application will be granted and no assurances on the timing of any uplisting. Until such time, if any, as our stock is listed on the NASDAQ Capital Market, it will continue to be quoted on OTCQB under the trading symbol OPXS. Trading in our common stock has been very limited and we cannot make any assurances that the trading volume will increase, or, if and when it increases, that it will be sustained at any level. Over-the-counter markets are generally considered to be less efficient than, and not as broad as, a stock exchange.\nOur share price could decrease as a result of this limited liquidity or otherwise, and our share price is likely to be highly volatile. Specifically, stockholders may have difficulties reselling significant numbers of shares of common stock at any particular time, and may not be able to resell their shares of common stock at or above the price paid for such shares. As a result, stockholders may be required to hold shares of common stock for an indefinite period of time. In addition, sales of substantial amounts of common stock could lower the prevailing market price of our common stock.\nFurthermore, our ability to raise additional capital is impaired because of the less liquid nature of the over-the-counter markets. We may not be able to complete an equity financing on acceptable terms, or at all. In that context, investors should consider that not having the common stock listed on a national securities exchange makes us ineligible to use shorter and less costly filings, such as Form S-3, to register our securities for sale. While we may use Form S-1 to register a sale of our stock to raise capital or complete acquisitions, doing so would cause us to incur higher transaction costs and adversely impact our ability to raise capital or complete acquisitions of other companies in a timely manner. In addition, if we are able to complete equity financings, the dilution from any equity financing while our shares are quoted on an over-the-counter market could be greater than if we were to complete a financing while our common stock were listed on a national securities exchange.\nFinally, if we cease to qualify for quotation on OTCQB, our common stock may be forced to trade on the pink sheets, and the market for resale of our common stock would be extremely limited. In that case, holders of our common stock may find it more difficult to dispose of, or to obtain accurate quotations as to the market value of, our common stock, and the market value of our common stock may decline as a result.\nWe are subject to penny stock rules, which discourages broker-dealers from effecting transactions in our common stock.\nThe SEC has adopted a number of rules to regulate penny stock that restricts transactions involving our shares of common stock. Such rules include Rules 3a51-1, 15g-1, 15g-2, 15g-3, 15g-4, 15g-5, 15g-6, 15g-7, and 15g-9 under the Exchange Act. These rules may have the effect of reducing the liquidity of penny stocks. Penny stocks generally are equity securities with a price of less than $5.00 per share, subject to certain exclusions. As long as we are not listed on a securities exchange or NASDAQ, our shares of common stock constitute penny stock within the meaning of the rules. The additional sales practice and disclosure requirements imposed upon U.S. broker-dealers in connection with effecting transactions in penny stocks may discourage such broker-dealers from effecting transactions in shares of our common stock, which could severely limit the market liquidity of such shares and impede their sale in the secondary market.\nA U.S. broker-dealer selling penny stock to anyone other than an established customer or accredited investor must make a special suitability determination for the purchaser and must receive the purchasers written consent to the transaction prior to sale, unless the broker-dealer or the transaction is otherwise exempt. In addition, the penny stock regulations require the U.S. broker-dealer to deliver, prior to any transaction involving a penny stock, a disclosure schedule prepared in accordance with SEC standards relating to the penny stock market, unless the broker-dealer or the transaction is otherwise exempt. A U.S. broker-dealer is also required to disclose commissions payable to the U.S. broker-dealer and the registered representative and current quotations for the securities. Finally, a U.S. broker-dealer is required to submit monthly statements disclosing recent price information with respect to the penny stock held in a customers account and information with respect to the limited market in penny stocks.\nIn addition to the penny stock rules described above, FINRA has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nFurthermore, transfers of our common stock may require broker-dealers to submit notice filings and pay fees in certain states, which may discourage broker-dealers from effecting transactions in our common stock.\nYou should also be aware that, according to the SEC, the market for penny stocks has suffered in recent years from patterns of fraud and abuse. Such patterns include (i) control of the market for the security by one or a few broker-dealers that are often related to the promoter or issuer; (ii) manipulation of prices through prearranged matching of purchases and sales and false and misleading press releases; (iii) boiler room practices involving high-pressure sales tactics and unrealistic price projections by inexperienced sales persons; (iv) excessive and undisclosed bid-ask differentials and markups by selling broker-dealers; and (v) the wholesale dumping of the same securities by promoters and broker-dealers after prices have been manipulated to a desired level, resulting in investor losses.\nGeneral Risk Factors\nChanges in current economic conditions may adversely affect our ability to continue operations.\nChanges in current economic conditions may cause a decline in business, consumer and defense spending and capital market performance, which could adversely affect our business and financial performance. Our ability to raise funds, which could be required for business continuity or expansion of our operations, may be adversely affected by current and future economic conditions, such as a reduction in the availability of credit, financial market volatility and economic recession.\nIn the future, we may look to acquire other businesses in our industry and the acquisitions will require us to use substantial resources.\nIn the future, we may decide to pursue acquisitions of other businesses in our industry. In order to successfully acquire other businesses, we would be forced to spend significant resources for both acquisition and transactional costs, which could divert substantial resources in terms of both financial and personnel capital from our current operations. Additionally, we might assume liabilities of the acquired business, and the repayment of those liabilities could have a material adverse impact on our cash flow. Furthermore, when a new business is integrated into our ongoing business, it is possible that there would be a period of integration and adjustment required which could divert resources from ongoing business operations.\nThe elimination of monetary liability against our directors, officers and employees under Delaware law and the existence of indemnification rights to our directors, officers and employees may result in substantial expenditures by us and may discourage lawsuits against our directors, officers and employees.\nWe provide indemnification to our directors and officers to the extent provided by Delaware law. The foregoing indemnification obligation could result in our incurring substantial expenditures to cover the cost of settlement or damage awards against directors and officers, which we may be unable to recoup. These provisions and resultant costs may also discourage us from bringing a lawsuit against directors and officers for breaches of their fiduciary duties and may similarly discourage the filing of derivative litigation by our stockholders against our directors and officers even though such actions, if successful, might otherwise benefit us and our stockholders.\nOur stock price is speculative, and there is a risk of litigation.\nThe trading price of our common stock has in the past and may in the future be subject to wide fluctuations in response to factors such as the following:\n● revenue or results of operations in any quarter failing to meet the expectations, published or otherwise, of the investment community;\n● speculation in the press or investment community;\n● wide fluctuations in stock prices, particularly with respect to the stock prices for other defense industry companies;\n● announcements of technological innovations by us or our competitors;\n● new products or the acquisition of significant customers by us or our competitors;\n● changes in investors beliefs as to the appropriate price-earnings ratios for us and our competitors;\n● changes in management;\n● sales of common stock by directors and executive officers;\n● rumors or dissemination of false or misleading information, particularly through Internet chat rooms, instant messaging, and other rapid-dissemination methods;\n● conditions and trends in the defense industry generally;\n● the announcement of acquisitions or other significant transactions by us or our competitors;\n● adoption of new accounting standards affecting our industry;\n● general market conditions;\n● domestic or international terrorism and other factors; and\n● other factors as described in this section.\nFluctuations in the price of our common stock may expose us to the risk of securities class action lawsuits. Although no such lawsuits are currently pending against us and we are not aware that any such lawsuit is threatened to be filed in the future, there is no assurance that we will not be sued based on fluctuations in the price of our common stock. Defending against such suits could result in substantial cost and divert managements attention and resources. In addition, any settlement or adverse determination of such lawsuits could subject us to significant liability.  Item 2. Properties\nWe are headquartered in Richardson, TX and lease approximately 93,967 combined square feet of facilities between Richardson, Texas and Dallas, Texas. We operate with a single shift, and capacity could be expanded by adding a second shift.\nWe renewed the lease on our 49,100 square foot, Richardson, Texas facility, effective as of January 11, 2021, for eighty-six (86) months, commencing on April 1, 2021 and ending on May 31, 2028. Our Applied Optics Center, is located in Dallas, Texas with leased premises consisting of approximately 44,867 square feet of space. The Applied Optics Center lease was renewed on January 11, 2021 for eighty-six (86) months, commencing on November 1, 2021 and ending on December 31, 2028. The Applied Optics Center amendment provides for a five-year renewal option at the end of the lease term at the greater of the then prevailing rental rate or the then current base rent rate. Item 3. Legal Proceedings\nFrom time to time, we are involved in lawsuits, claims, investigations and proceedings, including pending opposition proceedings involving patents that arise in the ordinary course of business. There are no matters pending that we expect to have a material adverse impact on our business, results of operations, financial condition or cash flows. Item 4. Mine Safety Disclosures\nNone.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket information\nOur common stock is currently quoted on the OTCQB Marketplace under the symbol OPXS. Trading in our common stock has historically lacked consistent volume, and the market price has been volatile. Over-the-counter market quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nOn December 16, 2022, the closing price for our common stock as reported on the OTCQB was $3.07 per share.\nOn December 7, 2022, the Company submitted an application to list its common stock on the NASDAQ Capital Market. There are no assurances (1) that the Company will continue to meet the initial listing criteria throughout the pendency of the application (including with respect to its share price), (2) that NASDAQ will approve the application or (3) relating to the timing of any such approval. If and when listed on NASDAQ, there are no assurances that the Company will continue to meet NASDAQs continued listing requirements.\nSecurities outstanding and holders of record\nOn December 16, 2022, there were approximately 80 shareholders of record for our common stock and 6,716,638 shares of our common stock issued and outstanding.\nDividends\nWe have in the past paid dividends but we have no plans to do so in the foreseeable future.\nUnregistered Sales of Equity Securities\nOn January 4, 2022, the Company issued 23,216 common shares to an officer and a key employee in settlement of 33,000 restricted stock units which vested on such date. The issuance was made pursuant to the exemption from registration afforded by Rule 506(b) under the Securities Act as an issuance to an accredited investors.\nIssuer Purchases of Equity Securities\nThe table below sets forth information with respect to purchases made by or on behalf of the Company or any affiliated purchaser (as defined in Rule 10b-18(a)(3) under the Exchange Act) of its common shares during the three months ended October 2, 2022.\nPeriod Total number of shares purchased Total purchase cost\n(thousands)\nAverage price paid per share (with transaction fees) Maximum dollar value that may yet be purchased under the plan\nJuly 4, 2022 through July 25, 2022(1) $ 1 $ 2.10 $ 564\nJuly 26, 2022 through August 28, 2022(1) 1,930 2.09\nAugust 29, 2022 to October 2, 2022(2) 1,603,773 4,361 2.72\n(1) On September 22, 2021 the Company announced authorization for a $1 million stock repurchase program. As of October 2, 2022, there were zero shares held in treasury purchased under the September 2021 stock repurchase program. The shares authorized to be repurchased under the repurchase program may be purchased from time to time at prevailing market prices, through open market or in negotiated transactions, depending upon market conditions and subject to Rule 10b-18 as promulgated by the SEC.\n(2) Common shares repurchased pursuant to the tender offer that closed on September 15, 2022. Total tendered shares of 1,603,773 at $2.65, or $4.25 million, plus transaction costs of $111 thousand. The repurchased shares were immediately cancelled. Item 6. Reserved Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the consolidated financial statements and the related notes that are set forth in our financial statements elsewhere in this Annual Report.\nThis managements discussion and analysis reflects information known to management as of our fiscal year end, October 2, 2022, and the date of filing. This MD&A is intended to supplement and complement our audited financial statements and notes thereto for the year ended October 2, 2022, prepared in accordance with U.S. generally accepted accounting principles (GAAP). You are encouraged to read our financial statements in conjunction with this MD&A. The financial information in this MD&A has been prepared in accordance with GAAP, unless otherwise indicated. In addition, we use non-GAAP financial measures as supplemental indicators of our operating performance and financial position. We use these non-GAAP financial measures internally for comparing actual results from one period to another, as well as for planning purposes. We will also report non-GAAP financial results as supplemental information, as we believe their use provides more insight into our performance. When a non-GAAP measure is used in this MD&A, it is clearly identified as a non-GAAP measures and reconciled to the most closely corresponding GAAP measure.\nThe following discussion highlights the principal factors that have affected our financial condition and results of operations as well as our liquidity and capital resources for the periods described. This discussion contains forward-looking statements. Please see Special cautionary statement concerning forward-looking statements and Risk factors for a discussion of the uncertainties, risks and assumptions associated with these forward-looking statements. The operating results for the periods presented were not significantly affected by inflation.\nAll references in the following section to 2021 or 2022 with respect to our financial position and results of operations are to our fiscal years ended October 3, 2021 or October 2, 2022, respectively.\nBackground\nOptex Systems, Inc. manufactures optical sighting systems and assemblies, primarily for Department of Defense applications. Its products are installed on various types of U.S. military land vehicles, such as the Abrams and Bradley fighting vehicles, light armored and armored security vehicles and have been selected for installation on the Stryker family of vehicles. Optex Systems, Inc. (Delaware) also manufactures and delivers numerous periscope configurations, rifle and surveillance sights and night vision optical assemblies. Optex Systems, Inc. (Delaware) products consist primarily of build-to-customer print products that are delivered both directly to the armed services and to other defense prime contractors. Less than 1% of our revenue is related to the resale of products substantially manufactured by others. In this case, the product would likely be a simple replacement part of a larger system previously produced by Optex Systems, Inc. (Delaware).\nWe are both a prime and sub-prime contractor to the Department of Defense. Sub-prime contracts are typically issued through major defense contractors such as General Dynamics Land Systems, Raytheon Corp., BAE, ADS Inc. and others. We are also a military supplier to foreign governments such as Israel, Australia and NAMSA and South American countries and as a subcontractor for several large U.S. defense companies serving foreign governments.\nBy way of background, the Federal Acquisition Regulation is the principal set of regulations that govern the acquisition process of government agencies and contracts with the U.S. government. In general, parts of the Federal Acquisition Regulation are incorporated into government solicitations and contracts by reference as terms and conditions effecting contract awards and pricing solicitations.\nMany of our contracts are prime or subcontracted directly with the Federal government and, as such, are subject to Federal Acquisition Regulation Subpart 49.5, Contract Termination Clauses and more specifically Federal Acquisition Regulation clauses 52.249-2 Termination for Convenience of the Government Fixed-Price), and 49.504 Termination of fixed-price contracts for default. These clauses are standard clauses on our prime military contracts and generally apply to us as subcontractors. It has been our experience that the termination for convenience is rarely invoked, except where it is mutually beneficial for both parties. We are currently not aware of any pending terminations for convenience or for default on our existing contracts.\nIn the event a termination for convenience were to occur, Federal Acquisition Regulation clause 52.249-2 provides for full recovery of all contractual costs and profits reasonably occurred up to and as a result of the terminated contract. In the event a termination for default were to occur, we could be liable for any excess cost incurred by the government to acquire supplies from another supplier similar to those terminated from us. We would not be liable for any excess costs if the failure to perform the contract arises from causes beyond the control and without the fault or negligence of the company as defined by Federal Acquisition Regulation clause 52.249-8.\nIn addition, some of our contracts allow for government contract financing in the form of contract progress payments pursuant to Federal Acquisition Regulation 52.232-16, Progress Payments. Subject to certain limitations, this clause provides for government payment of up to 90% of incurred program costs prior to product delivery for small businesses like us. To the extent our contracts allow for progress payments, we intend to utilize this benefit, thereby minimizing the working capital impact on Optex Systems Holdings for materials and labor required to complete the contracts.\nRecent Developments and Material Trends\nRefer to Item 1. Business - Market Opportunity: U.S. Military for a description of current trends in U.S. government military spending and its potential impact on Optex, which may be material, including particularly the tables included in that section and disclosure on the significant reduction in spending for U.S ground system military programs, which has a direct impact on the Optex Systems Richardson segment revenue, all of which is incorporated herein by reference.\nRefer to Item 1A. Risk Factors - Risks Related to Our Business - Certain of our products are dependent on specialized sources of supply potentially subject to disruption which could have a material, adverse impact on our business for a description of recent supply chain disruptions, which have strained our suppliers and extended supplier delivery lead times, affecting their ability to sustain operations. We anticipate market wide material shortages for paint and resin products as well as critical epoxies and chemicals used in our manufacturing process. In addition, we are seeing substantial increases in the costs of aluminum, steel and acrylic commodities.\nWe have experienced significant material shortages during the three months ended October 2, 2022 and extending into the first three months of fiscal year 2023 from two significant suppliers of our periscope covers and housings. These shortages affect several of our periscope products at the Optex Richardson segment. The delays in key components, combined with labor shortages during the first quarter of fiscal year 2023 to date have negatively impacted our production levels and have pushed the expected delivery dates into the second and third quarters of fiscal year 2023. We are aggressively seeking alternative sources for these components as well as increasing employee recruitment initiatives and overtime to mitigate any continuing risks to the periscope line. In addition, one of our major customers for the Applied Optics Center has requested a significant schedule delay pushing their laser filter unit delivery schedules from the first half into the second half of fiscal year 2023.\nWe expect the combination of these issues to negatively impact our revenue during the first three months of fiscal year 2023. Our first quarter revenue projection is expected to be approximately 8-9% below the 2022 first quarter level.\nIn November 2022, we increased our line of credit to $2.0 million from $1.125 million to facilitate our working capital requirements due to the delays and increased backlog. We anticipate revenue and working capital in the second half of fiscal year 2023 to increase significantly from the first six months with a full recovery expected by fiscal year end 2023. Based on our current backlog, we anticipate an overall increase for fiscal year 2023 revenues as compared to the 2022 levels.\nRefer to Item 1. Business - Recent Events of this report for recent material events affecting the Company.\nResults of Operations\nSegment Information\nWe have presented the operating results by segment to provide investors with an additional tool to evaluate our operating results. Management of Optex Systems Holdings uses the selected financial measures by segment internally to evaluate its ongoing segment operations and to allocate resources within the organization accordingly. Segments are determined based on differences in products, location, internal reporting and how operational decisions are made. Management has determined that the Optex Systems, Richardson plant (to which we refer below as the Optex Systems segment or Optex Systems), and the Applied Optics Center, Dallas plant, which was acquired on November 3, 2014 (to which we refer below as the Applied Optics Center segment or Applied Optics Center), are separately managed, organized, and internally reported as separate business segments. The table below provides a summary of selective statement of operations data by operating segment for the years ended October 2, 2022 and October 3, 2021 reconciled to the Audited Consolidated Results of Operations as presented in Item 8, Financial Statements and Supplementary Data.\nResults of Operations Selective Financial Info\n(Thousands)\nTwelve months ended\nOctober 2, 2022 October 3, 2021\nOptex\nRichardson\nApplied Optics Center\nDallas\nOther\n(non-allocated costs and eliminations)\nConsolidated Optex\nRichardson\nApplied Optics Center\nDallas\nOther\n(non-allocated costs and eliminations)\nConsolidated\nRevenue from External Customers $ 9,533 $ 12,850 $ - $ 22,383 $ 11,827 $ 6,395 $ - $ 18,222\nIntersegment Revenues - (879 ) - - 1,056 (1,056 ) -\nTotal Segment Revenue 9,533 13,729 (879 ) 22,383 11,827 7,451 (1,056 ) 18,222\nTotal Cost of Sales 8,441 9,924 (879 ) 17,486 9,934 6,824 (1,056 ) 15,702\nGross Margin 1,092 3,805 - 4,897 1,893 - 2,520\nGross Margin % 11.5 % 27.7 % - 21.9 % 16.0 % 8.4 % - 13.8 %\nGeneral and Administrative Expense 2,613 3,250 2,319 3,014\nSegment Allocated G&A Expense (1,141 ) 1,141 - - (677 ) - -\nNet General & Administrative Expense 1,472 1,616 3,250 1,642 1,144 3,014\nOperating Income (Loss) (380 ) 2,189 (162 ) 1,647 (517 ) (228 ) (494 )\nOperating Income (Loss) % (4.0 )% 15.9 % - 7.4 % 2.1 % (6.9 %) - (2.7 )%\nGain (Loss) on Change in Fair Value of Warrants - - - - - - 2,535 2,535 )\nInterest Expense - - - - - - (11 ) (11 )\nIncome (Loss) before taxes $ (380 ) 2,189 (162 ) 1,647 $ 251 $ (517 ) $ 2,296 $ 2,030\nIncome (loss) before taxes % (4.0 )% 15.9 % - 7.4 % 2.1 % (6.9 %) - 11.1 %\nOur total external sales revenues increased by $4.2 million in the fiscal year 2022, or 23.1% compared to the 2021 fiscal year. The Optex Systems segment realized a $2.3 million decrease and the Applied Optics Center segment realized an increase of $6.5 million in external revenue compared to the prior year period. Intersegment revenues decreased by $0.2 million to $0.9 million in 2022 from $1.1 million in 2021. Intersegment revenues relate primarily to coated filters provided by the Applied Optics Center to Optex Systems in support of the Optex Systems periscope line.\nGross margin increased $2.4 million and the gross margin percentage increased by 8.1 points from 13.8% in the 2021 fiscal year to 21.9% in the 2022 fiscal year. The Optex Systems gross margin decreased by $0.8 million and the gross margin percentage decreased to 11.5% as compared to 16.0% in the prior year period on lower revenue. The Applied Optics Center gross margin increased by $3.2 million and the gross margin percentage increased by 19.3 points to 27.7% as compared to the prior year period of 8.4%. The increase in the consolidated gross margin is primarily attributable to a significant shift in revenue from the Optex-Richardson segment to higher margin products in the Applied Optics segment combined with higher absorption of the Applied Optics segment fixed overhead cost base associated with higher production levels.\nDuring the years ended 2022 and 2021, Applied Optics Center absorbed $1.1 million and $0.7 million of fixed general and administrative costs incurred by Optex Systems for support services. The increase in allocated general and administrative expenses during the 2022 year is directly attributable to the shift in revenue volume between segments. These expenses cover accounting, executive, human resources, information technology, board fees and other corporate expenses paid by Optex Systems and shared across both operating segments.\nOperating income increased by $2.1 million in the year ended October 2, 2022 to an income of $1.6 million as compared to the prior year operating loss of $(0.5) million. The increase in operating income is primarily attributable to increased revenue and gross margin at the Applied Optics Center segment.\nIncome before taxes decreased $0.4 million, to $1.6 million in the 2022 fiscal year from a prior year income before taxes of $2.0 million. The decrease in income before taxes year over year is primarily due to the expiration of the warrants in 2021 which generated a gain on change in fair valuation of warrants of $2.5 million in the prior year and which is partially offset by the higher operating profit in 2022.\nBacklog\nDuring the twelve months ended October 2, 2022, the Company booked $28.0 million in new orders, representing a 4.1% decrease from the prior year period orders of $29.2 million. The orders for the most recently completed twelve months consist of $13.5 million for our Optex Richardson segment and $14.5 million attributable to the Applied Optics Center segment.\nThe following table depicts the new customer orders for the twelve months ending October 2, 2022 as compared to the prior year period in millions of dollars:\n(Millions)\nProduct Line Twelve months ended\nOctober 2, 2022\nTwelve months ended\nOctober 3, 2021\nVariance % Chg\nPeriscopes $ 9.2 $ 7.6 $ 1.6 21.1 %\nSighting Systems 0.7 1.2 (0.5 ) (41.7 )%\nHowitzer - - - - %\nOther 3.6 0.8 2.8 350.0 %\nOptex Systems - Richardson 13.5 9.6 3.9 40.6 %\nOptical Assemblies 6.7 6.1 0.6 9.8 %\nLaser Filters 4.7 11.9 (7.2 ) (60.5 )%\nDay Windows 1.9 0.7 1.2 171.4 %\nOther 1.2 0.9 0.3 33.3 %\nApplied Optics Center - Dallas 14.5 19.6 (5.1 ) (26.0 )%\nTotal Customer Orders $ 28.0 $ 29.2 $ (1.2 ) (4.1 )%\nThe primary reason for the decline in orders in 2022 as compared to 2021 relates to the $8.4 million order awarded in August 2021 for laser filters which was deliverable over twenty-four months. We anticipate future awards against this program as we near completion of the current contract. In addition, in 2021 we received a $0.4 million award for sighting systems which are deliverable in 2023.\nThe Optex Systems Richardson segment currently has seven open US Government IDIQ type military contracts for periscopes with unspent funding which covers government base year and option year requirement periods into 2025. We anticipate additional orders throughout the next three years for these contracts.\nOptex Systems Holdings continues to pursue new international and commercial opportunities in addition to maintaining its current footprint with U.S. military vehicle manufacturers, with existing as well as new product lines. We are also reviewing potential products, outside our traditional product lines, which could be manufactured using our current production facilities in order to capitalize on our existing capacity. Further, we continue to look for strategic businesses to acquire that will strengthen our existing product line, expand our operations, and enter new markets.\nBacklog as of October 2, 2022 was $32.9 million as compared to a backlog of $27.3 million as of October 3, 2021, representing an increase of 20.5%. The following table depicts the current expected delivery by quarter of all contracts awarded as of October 2, 2022.\n(Millions)\nProduct Line Q1\nQ2\nQ3\nQ4\nDelivery\n2024+\nDelivery\nTotal Backlog\n10/2/2022\nTotal Backlog\n10/3/2021\nVariance % Chg\nPeriscopes $ 1.4 $ 2.6 $ 1.9 $ 0.1 $ 6.0 $ 1.6 $ 7.6 $ 5.6 $ 2.0 35.7 %\nSighting Systems 0.2 0.6 0.1 0.1 1.0 0.7 1.7 1.7 - - %\nHowitzer - - 0.1 0.3 0.4 1.9 2.3 2.3 - - %\nOther 0.1 0.9 0.3 0.9 2.2 1.2 3.4 1.4 2.0 142.9 %\nOptex Systems - Richardson 1.7 4.1 2.4 1.4 9.6 5.4 15.0 11.0 4.0 36.4 %\nOptical Assemblies 1.3 2.1 1.3 1.0 5.7 1.1 6.8 5.0 1.8 36.0\nLaser Filters 0.4 1.2 2.4 1.4 5.4 3.3 8.7 9.9 (1.2 ) (12.1 )\nDay Windows 0.2 0.1 0.2 0.1 0.6 1.4 2.0 1.1 0.9 81.8\nOther 0.3 - - - 0.3 0.1 0.4 0.3 0.1 33.3\nApplied Optics Center - Dallas 2.2 3.4 3.9 2.5 12.0 5.9 17.9 16.3 1.6 9.8 %\nTotal Backlog $ 3.9 $ 7.5 $ 6.3 $ 3.9 $ 21.6 $ 11.3 $ 32.9 $ 27.3 $ 5.6 20.5 %\nOptex Systems - Richardson\nDuring the twelve months ended October 2, 2022, backlog for our Optex Richardson segment increased by 36.4%, or 4.0 million to $15.0 million, as compared to the prior year ending backlog of $11.0 million.\nBacklog for our periscope product line has increased 35.7% or $2.0 million to $7.6 million, from our 2021 fiscal year end level of $5.6 million.\nSighting Systems and Howitzer product line backlog remained flat during the twelve months ended October 2, 2022 as compared to the prior year end backlog at $1.7 million and $2.3 million, respectively. The Howitzer contract awarded in July 2020 continues to experience customer driven delays related to customer furnished materials. We expect to complete the first article testing during the third fiscal quarter and to begin production deliveries during the fourth fiscal quarter of 2023.\nOur backlog in other product groups increased by $2.0 million or 142.9% from $1.4 million in 2021 to $3.4 million in 2022 on new orders booked during the twelve months ended October 2, 2022, primarily for muzzle reference systems for a major U.S. defense contractor.\nApplied Optics Center - Dallas\nThe Applied Optics Center backlog increased by $1.6 million, or 9.8%, for the year ended October 2, 2022, from $16.3 million in 2021 to $17.9 million in 2022.\nBacklog for our optical assemblies increased by $1.8 million, or 36.0%, as compared to the prior year on new orders from one of our commercial customers.\nLaser filter backlog decreased by $1.2 million, or 12.1%, during the year due to shipments against our long term laser filter unit contract.\nDay window backlog increased by $0.9 million during the period as compared to the prior year on new orders from a major U.S. defense contractor.\nOther backlog increased by $0.1 million, or 33.3% for the year ended October 2, 2022, on new orders booked during the period for specialty coatings.\nTwelve month period ended October 2, 2022 compared to the twelve month period ended October 3, 2021\nRevenues\nThe table below details the revenue changes by segment and product line for the year ended October 2, 2022 as compared to the year ended October 3, 2021.\nTwelve months ended\n(Millions)\nProduct Line October 2, 2022\nOctober 3, 2021 Variance % Chg\nPeriscopes $ 7.2 $ 7.2 $ - -\nSighting Systems 0.8 2.3 (1.5 ) (65.2 )\nHowitzers - 0.2 (0.2 ) (100.0 )\nOther 1.5 2.1 (0.6 ) (28.6 )\nOptex Systems - Richardson 9.5 11.8 (2.3 ) (19.5 )\nOptical Assemblies 4.9 1.9 3.0 157.9\nLaser Filters 5.9 3.0 2.9 96.7\nDay Windows 1.0 1.0 - -\nOther 1.1 0.5 0.6 120.0\nApplied Optics Center - Dallas 12.9 6.4 6.5 101.6\nTotal Revenue $ 22.4 $ 18.2 $ 4.2 23.1\nOur total revenues increased by $4.2 million, or 23.1% in fiscal year 2022 compared to fiscal year 2021. The Optex Systems Richardson segment realized a $2.3 million, or 19.5%, decrease in revenue and the Applied Optics Center segment realized an increase of $6.5 million, or 101.6%, in revenue compared to the prior year period.\nOptex Systems - Richardson\nRevenues on our periscope line remained flat at $7.2 million during the twelve months ended October 2, 2022 and October 3, 2021.\nRevenues on sighting systems decreased by $1.5 million, or 65.2% from the prior year period due to completion of the Commander Weapon Sighting Systems in the prior year with no follow-on order for the current year period, combined with lower revenue on the DDAN and OWSS repair units during the current year as compared to the prior year. Lower revenue during the year is attributable to reductions in US spending for military ground systems.\nRevenue on Howitzers decreased by $0.2 million, to zero, compared to revenues of $0.2 million in the prior fiscal year due to customer driven delays against our Aiming Circle XM10 optical assemblies contract awarded in 2020.\nOptex Systems-Richardson revenue on other product lines decreased by $0.6 million, or 28.6%, compared to revenues in the prior year due to lower contract demand on MRS collimators and cell assemblies attributable to reductions in US spending for military ground systems.\nApplied Optics Center - Dallas\nRevenue on optical assemblies increased by $3.0 million, or 157.9%, during the twelve months ended October 2, 2022 as compared to the prior twelve-month period on significantly higher demand on several rifle scope assemblies from one of our major commercial customers.\nLaser filter revenue increased by $2.9 million, or 96.7%, during the twelve months ended October 2, 2022 as compared to the prior twelve-month period on significantly higher demand for laser filter units from multiple defense contract customers.\nRevenues on our day windows remained flat at $1.0 million during the twelve months ended October 2, 2022 and October 3, 2021 as we continue to ship against our existing contracts.\nApplied Optics Center revenue for other product lines increased by $0.6 million, or 120.0%, during the twelve months ended October 2, 2022 as compared to the prior twelve-month period on increased revenue for unity mirrors and specialty coatings.\nGross Margin. The gross margin for the year ended October 2, 2022 was 21.9% of revenue as compared to a gross margin of 13.8% of revenue for the year ended October 3, 2021. Cost of sales increased by $1.8 million to $17.5 million for 2022 compared to $15.7 million for 2022. The gross margin increased by $2.4 million to $4.9 million in 2022 as compared to $2.5 million in 2021. The increase is primarily due to higher revenue and shifts between segments and product lines combined with higher fixed cost absorption at the Applied Optics Center segment related to increased production volume.\nG&A Expenses. For the years ended October 2, 2022 and October 3, 2021, we recorded operating expenses of $3.3 million and $3.0 million, respectively. General and administrative cost increases of $0.3 million, or 10%, during fiscal year 2022 are primarily attributable to increased labor and expenses based on labor, increased office expenses and higher selling expenses as compared to the prior year.\nOperating Income. For the year ended October 2, 2022, we recorded an operating income of $1.6 million as compared to operating loss of $(0.5) million during the year ended October 3, 2021. The $2.1 million increase in operating income in the current year over the prior year is primarily due to higher revenue and gross margin, partially offset by increased general and administrative expenses.\nNet income applicable to common shareholders. During the year ended October 2, 2022, we recorded net income applicable to common shareholders of $1.3 million as compared to net income applicable to common shareholders of $1.5 million during the year ended October 3, 2021. The decrease of net income of $0.2 million is primarily attributable to the elimination of the warrants which expired in 2021 and resulted in a $2.5 million gain during the prior year twelve-month period, and a change in tax expenses of $0.5 million as compared to 2021. The change in income due to the warrants and taxes is partially offset by higher revenue and operating income of $2.1 million in the current year as compared to the prior year period and elimination of the deemed dividends of $0.7 million associated with the warrants which expired in 2021.\nNon GAAP Adjusted EBITDA\nWe use adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) as an additional measure for evaluating the performance of our business as net income includes the significant impact of noncash valuation gains and losses on warrant liabilities, noncash compensation expenses related to equity stock issues, as well as depreciation, amortization, interest expenses and federal income taxes. We believe that Adjusted EBITDA is a meaningful indicator of our operating performance because it permits period-over-period comparisons of our ongoing core operations before the excluded items, which we do not consider relevant to our operations. Adjusted EBITDA is a financial measure not required by, or presented in accordance with, U.S. generally accepted accounting principles (GAAP).\nAdjusted EBITDA has limitations and should not be considered in isolation or a substitute for performance measures calculated under GAAP. This non-GAAP measure excludes certain cash expenses that we are obligated to make. In addition, other companies in our industry may calculate Adjusted EBITDA differently than we do or may not calculate it at all, which limits the usefulness of Adjusted EBITDA as a comparative measure.\nThe table below summarizes our twelve-month operating results for the periods ended October 2, 2022 and October 3, 2021, in terms of both the GAAP net income measure and the non-GAAP Adjusted EBITDA measure.\n(Thousands)\nTwelve months ended\nOctober 2, 2022\nOctober 3, 2021\nNet Income - GAAP $ 1,283 $ 2,131\nAdd:\nGain on Change in Fair Value of Warrants - (2,535 )\nFederal Income Tax Expense (Benefit) (101 )\nDepreciation\nStock Compensation\nInterest Expense -\nAdjusted EBITDA - Non GAAP $ 2,116 $ (3 )\nOur Adjusted EBITDA increased by $2.1 million to $2.1 million during the twelve months ended October 2, 2022 as compared to $0.0 million during the twelve months ended October 3, 2021. The increase in EBITDA is primarily driven by increased revenue and operating profit during the current year as compared to the prior year twelve-month period. Operating segment performance is discussed in greater detail throughout the previous sections.\nLiquidity and Capital Resources\nAs of October 2, 2022, Optex Systems Holdings had working capital of $10.0 million, as compared to $12.9 million as of October 3, 2021. During the twelve months ended October 2, 2022, we generated operating cash flow of $2.0 million and spent ($4.7) million for the purchase of shares against our stock repurchase plan and common stock tender offer and ($0.25) million on acquisitions of property and equipment.\nBacklog as of October 2, 2022 was $32.9 million as compared to a backlog of $27.3 million as of October 3, 3021, representing an increase of 20.5%.\nThe Company has historically funded its operations through cash from operations, convertible notes, common and preferred stock offerings and bank debt. The Companys ability to generate positive cash flows depends on a variety of factors, including the continued development and successful marketing of the Companys products. At October 2, 2022, the Company had approximately $0.9 million in cash and an outstanding payable balance of zero against its then $1.125 million line of credit (which has since been increased to $2.0 million). As of October 2, 2022, our outstanding accounts receivable was $2.9 million. We expect the accounts to be collected during the first quarter of fiscal 2023.\nRecently experienced supplier delays, labor shortages, and customer schedule changes are expected to negatively impact our revenue during the first three months of fiscal year 2023. In November 2022, we increased our line of credit to $2.0 million from $1.125 million, to facilitate our working capital requirements due to the delays and increased backlog. We anticipate revenues, and working capital, in the second half of fiscal year 2023 to increase significantly from the first six months with a full recovery expected by fiscal year end 2023.\nIn the short term, the Company plans to utilize its current cash, open line of credit and operating cash flow to fund inventory purchases in support of the backlog growth and higher anticipated revenue during the next twelve months. Short term cash in excess of our working capital needs may be also be used to fund the purchase of property and equipment required to maintain or meet our growing backlog in addition to repurchasing common stock against our current stock repurchase plan. Longer term, excess cash beyond our operating needs may be used to fund new product development, company or product line acquisitions, or additional stock purchases as attractive opportunities present themselves.\nSome of our contracts may allow for government contract financing in the form of contract progress payments pursuant to Federal Acquisition Regulation 52.232-16, Progress Payments. Subject to certain limitations, this clause provides for government payment of up to 90% of incurred program costs prior to product delivery for small businesses like us. To the extent any contracts allow for progress payments and the respective contracts would result in significant preproduction cash requirements for design, process development, tooling, material or other resources which could exceed our current working capital or line of credit availability, we intend to utilize this benefit to minimize any potential negative impact on working capital prior to receipt of payment for the associated contract deliveries.\nThe Company expects to generate net income and positive cash flow from operating activities over the next twelve months. To remain profitable, we need to maintain a level of revenue adequate to support our cost structure. Management intends to manage operations commensurate with its level of working capital and facilities line of credit during the next twelve months and beyond; however, uneven revenue levels driven by changes in customer delivery demands, first article inspection requirements or other program delays associated with the pandemic could create a working capital shortfall. In the event the Company does not successfully implement its ultimate business plan, certain assets may not be recoverable.\nOn April 12, 2022, the Company and its subsidiary, Optex Systems, Inc. (collectively with the Company, the Borrowers), entered into an Amended and Restated Loan Agreement (the Loan Agreement) with PNC Bank, National Association, successor to BBVA USA (the Lender), pursuant to which the Borrowers existing revolving line of credit facility was decreased from $2.25 million to $1.125 million, and the maturity date was extended from April 15, 2022 to April 15, 2023.\nThe Loan Agreement requires the Borrowers to maintain a fixed charge coverage ratio of at least 1.25:1.\nOn November 21, 2022, the Borrowers issued an Amended and Restated Revolving Line of Credit Note (the Line of Credit Note) to the Lender in connection with an increase of the Borrowers revolving line of credit facility under the Loan Agreement from $1.125 million to $2.0 million. The maturity date remains April 15, 2023. Obligations outstanding under the credit facility will accrue interest at a rate equal to the Lenders prime rate minus 0.25%.\nThe Line of Credit Note and Loan Agreement contain customary events of default and negative covenants, including but not limited to those governing indebtedness, liens, fundamental changes, investments, and restricted payments. The credit facility is secured by substantially all of the operating assets of the Borrowers as collateral. The Borrowers obligations under the credit facility are subject to acceleration upon the occurrence of an event of default as defined in the Line of Credit Note and Loan Agreement.\nWe intend to renew or replace the line of credit facility. If adequate funds are not available on acceptable terms, or at all, we may be unable to finance our operations, develop or enhance our products, expand our sales and marketing programs, take advantage of future opportunities or respond to competitive pressures.\nOn September 15, 2022, the Companys modified Dutch auction tender offer expired. In accordance with the terms and conditions of the tender offer, the Company accepted for purchase 1,603,773 shares of common stock at a price of $2.65 per share, for an aggregate cost of approximately $4.25 million, excluding fees and expenses relating to the tender offer. These shares represented approximately 19.3% of its shares of common stock outstanding as of September 15, 2022. Because the tender offer was oversubscribed, the Company accepted for payment only a pro-rated portion of the shares of common stock properly tendered by each tendering stockholder (other than odd lot holders whose shares were purchased on a priority basis).\nOn September 22, 2021 the Company announced authorization for an additional $1 million stock repurchase program. During the twelve months ended October 2, 2022, the Company purchased 190,954 common shares under the September 2021 stock repurchase plan at a cost of $371 thousand. As of October 2, 2022, there were zero shares held in treasury. As of October 2, 2022, there was an authorized balance of $560 thousand remaining to be spent against the repurchase program.\nDuring the twelve months ended October 2, 2022 the Company declared and paid no dividends. As of October 2, 2022, there are no outstanding declared and unpaid dividends.\nCritical Accounting Estimates\nA critical accounting estimate is an estimate that:\n● is made in accordance with generally accepted accounting principles,\n● involves a significant level of estimation uncertainty, and\n● has had or is reasonably likely to have a material impact on the companys financial condition or results of operation.\nOur significant accounting policies are fundamental to understanding our results of operations and financial condition. Some accounting policies require that we use estimates and assumptions that may affect the value of our assets or liabilities and financial results. These policies are described in Note 2 Summary of Significant Accounting Policies of Item 8 Financial Statements and Supplementary Data of this report.\nOur critical accounting estimates include warranty costs, contract losses and the deferred tax asset valuation. Future warranty costs are based on the estimated cost of replacement for expected returns based upon our most recent experience rate of defects as a percentage of warranty covered sales. Our warranty covered sales primarily include the Applied Optics Center optical assemblies. While our warranty period is 12 months, our reserve balances assume a general 90-day return period for optical assemblies previously delivered plus any returned backlog in-house that has not yet been repaired or replaced to our customer. If our actual warranty returns should significantly exceed our historical rates on new customer products, significant production changes, or substantial customer changes to the 90-day turn-around times on returned goods, the impact could be material to our operating profit. We have not experienced any significant changes to our warranty trends in the preceding three years and do not anticipate any significant impacts in the near term. We monitor the actual warranty costs incurred to the expected values on a quarterly basis and adjust our estimates accordingly. As of October 2, 2022, the Company had accrued warranty costs of $169 thousand, as compared to $78 thousand as of October 3, 2021. The primary reason for the $91 thousand increase in reserve balances relates to higher revenue on warrantied product being sold during the twelve months ended October 2, 2022, combined with an increase in customer returned backlog pending repair or replacement to our customer as compared to the warranty backlog as of October 3, 2021.\nAs of October 2, 2022 and October 3, 2021, we had $289 thousand, and $51 thousand, respectively, of contract loss reserves included in our balance sheet accrued expenses. These loss contracts are related to some of our older legacy periscope IDIQ contracts which were priced in 2018 through early 2020, prior to Covid-19 and the significant downturn in defense spending on ground system vehicles. Due to inflationary price increases on component parts and higher internal manufacturing costs (as a result of escalating labor costs and higher burden rates on reduced volume), some of these contracts are in a loss condition, or at marginal profit rates. These contracts are typically three-year IDIQ contracts with two optional award years, and as such, we are obligated to accept new task awards against these contracts until the contract expiration. Should contract costs continue to increase above the negotiated selling price, or in the event the customer should release substantial quantities against these existing loss contracts, the losses could be material. For contracts currently in a loss status based on the estimated per unit contract costs, losses are booked immediately on new task order awards. During the twelve months ended October 2, 2022, there accrued contract losses increased by $238 thousand on new awards against the active IDIQ contracts. There is no way to reasonably estimate future inflationary impacts, or customer awards on the existing loss contracts. We continue to monitor these contracts throughout the year for any significant changes in addition to seeking potential cost saving strategies to mitigate risk.\nAs of October 2, 2022 and October 3, 2021, Optex Systems Inc. had a net carrying value of $0.9 million and $1.3 million, respectively in deferred tax assets. Net deferred tax assets as October 2 2022 and October 3, 2021 consisted of deferred tax assets of $ 1.8 million and $2.1 million, and valuation reserves of $0.9 million and $0.8 million, respectively. During the twelve-month period ended October 2, 2022, we collected $0.3 million in tax refunds related to the prior year net operating loss carryback in deferred tax assets. The valuation allowance covers certain deferred tax assets where we believe we will be unlikely to recover those tax assets through future operations. The valuation reserve includes assumptions related to future taxable income which would be available to cover net operating loss carryforward amounts. Because of the uncertainties of future income forecasts combined with the complexity of some of the deferred assets, these forecasts are subject to change over time. While we believe our current estimate to be reasonable, changing market conditions and profitability, changes in equity structure and changes in tax regulations may impact our estimated reserves in future periods.\nRecent Accounting Pronouncements\nRecent Accounting Pronouncements are detailed under Note 3 of Item 8 Financial Statements and Supplementary Data of this report. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nNot applicable. Item 8. Financial Statements and Supplementary Data\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nOptex Systems Holdings, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Optex Systems Holdings, Inc. and subsidiaries (the Company) as of October 2, 2022 and October 3, 2021, and the related consolidated statements of income, stockholders equity, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of October 2, 2022 and October 3, 2021, and the results of their operations and their cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nDeferred Taxes\nCritical Audit Matter Description\nAs described in notes 2 and 13 to the consolidated financial statements, deferred tax assets and liabilities are determined based on differing treatment of items for financial reporting and income tax reporting purposes. A valuation allowance is provided for certain deferred tax assets if it is more likely than not that the Company will not realize tax assets through future operations. When assessing the recoverability of deferred tax assets, management considers the scheduled reversal of deferred tax liabilities, projected future taxable income and tax planning strategies, and results of recent operations. Management has determined that a portion of the deferred tax assets may not be realized and has established a valuation allowance against the deferred tax asset balance. For the year ended October 2, 2022, the Company has a net carrying value of $0.9 million in deferred tax assets represented by deferred tax assets of $1.8 million and a deferred tax asset valuation allowance of $0.9 million against those assets.\nWe identified the evaluation of the deferred taxes as a critical audit matter because of the significant estimates and assumptions management used in calculating the deferred tax assets and liabilities as well as the valuation allowance. Performing audit procedures to evaluate the reasonableness of these estimates and assumptions required a high degree of auditor judgment. Additionally, the audit procedures performed on deferred taxes required increased audit effort and involved the use of professionals with specialized skill and knowledge.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures consisted of the following:\n● Testing managements process for developing the accounting estimate for deferred taxes including the valuation allowance.\n● Evaluating the appropriateness of the significant estimates and assumptions used by management, including the scheduled reversal of deferred tax liabilities, projected future taxable income, and results of recent operations. We considered the current and past performance of the entity, the industry in which the Company operates, and whether audit evidence obtained from other audit procedures resulted in any disconfirming evidence.\n● Testing the completeness and accuracy of underlying data used in calculating deferred taxes and the related valuation allowance.\n● Utilizing professionals with specialized skill and knowledge to assist in the evaluation of the reasonableness of deferred taxes and the related valuation allowance.\n/s/ Whitley Penn LLP\nWe have served as the Companys auditor since 2017.\nFort Worth, Texas\nDecember 19, 2022\nPCAOB ID: 726\nOptex Systems Holdings, Inc.\nConsolidated Balance Sheets\n(Thousands, except share and per share data)\nOctober 2, 2022 October 3, 2021\nASSETS\nCash and Cash Equivalents $ 934 $ 3,900\nAccounts Receivable, Net 2,908 3,183\nInventory, Net 9,212 7,583\nPrepaid Expenses\nCurrent Assets 13,382 14,928\nProperty and Equipment, Net 1,017\nOther Assets\nDeferred Tax Asset 1,288\nRight-of-use Asset 3,222 3,599\nSecurity Deposits\nOther Assets 4,187 4,910\nTotal Assets $ 18,537 $ 20,855\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent Liabilities\nAccounts Payable $ 706 $ 551\nOperating Lease Liability\nFederal Income Taxes Payable -\nAccrued Expenses\nAccrued Warranty Costs\nContract Loss Reserves\nCustomer Advance Deposits -\nCurrent Liabilities 3,368 2,008\nOther Liabilities\nOperating Lease Liability, net of current portion 2,761 3,133\nOther Liabilities 2,761 3,133\nTotal Liabilities 6,129 5,141\nCommitments and Contingencies -\nStockholders Equity\nCommon Stock - ($0.001 par, 2,000,000,000 authorized, 6,716,638 and 8,523,704 shares issued, and 6,716,638 and 8,488,149 shares outstanding, respectively)\nTreasury Stock (at cost, zero and 35,555 shares held, respectively)\n(69 )\nAdditional Paid in capital 21,096 25,752\nAccumulated Deficit (8,695 ) (9,978 )\nStockholders Equity 12,408 15,714\nTotal Liabilities and Stockholders Equity $ 18,537 $ 20,855\nThe accompanying notes are an integral part of these financial statements.\nOptex Systems Holdings, Inc.\nConsolidated Statements of Income\n(Thousands, except share and per share data)\nTwelve months ended\nOctober 2, 2022 October 3, 2021\nRevenue $ 22,383 $ 18,222\nCost of Sales 17,486 15,702\nGross Margin 4,897 2,520\nGeneral and Administrative Expense 3,250 3,014\nOperating Income (Loss) 1,647 (494 )\nGain on change in fair value of warrants - 2,535\nInterest Expense - (11 )\nOther Income (Expense) - 2,524\nIncome Before Taxes 1,647 2,030\nIncome Tax Expense (Benefit), net (101 )\nNet Income $ 1,283 $ 2,131\nDeemed dividends on participating securities - (660 )\nNet income applicable to common shareholders $ 1,283 $ 1,471\nBasic income per share $ 0.16 $ 0.18\nWeighted Average Common Shares Outstanding - basic 8,128,024 8,241,021\nDiluted income per share $ 0.16 $ 0.18\nWeighted Average Common Shares Outstanding - diluted 8,219,069 8,323,809\nThe accompanying notes are an integral part of these financial statements.\nOptex Systems Holdings, Inc.\nConsolidated Statements of Cash Flows\n(Thousands)\nTwelve months ended\nOctober 2, 2022 October 3, 2021\nCash Flows from Operating Activities:\nNet Income $ 1,283 $ 2,131\nAdjustments to Reconcile Net Income to Net Cash provided by Operating Activities:\nDepreciation\nGain on Change in Fair Value of Warrants - (2,535 )\nStock Compensation Expense\nChange in Deferred Tax Asset (60 )\nAccounts Receivable (230 )\nBad Debt Expense -\nInventory (1,629 ) 1,208\nPrepaid Expenses (66 ) (33 )\nLeases\nAccounts Payable and Accrued Expenses (561 )\nFederal Income Taxes Payable -\nAccrued Warranty Costs (4 )\nCustomer Advance Deposits (1 )\nIncrease In Accrued Estimated Loss On Contracts\nTotal Adjustments (1,650 )\nNet Cash provided by Operating Activities 2,042\nCash Flows used in Investing Activities\nPurchases of Property and Equipment (257 ) (274 )\nNet Cash used in Investing Activities (257 ) (274 )\nCash Flows used in Financing Activities\nCash Paid for Taxes Withheld On Net Settled Restricted Stock Unit Share Issue (19 ) (44 )\nPayments to Credit Facility - (377 )\nProceeds from Warrant Exercise -\nCommon Stock Repurchases (4,732 ) (869 )\nNet Cash used in Financing Activities (4,751 ) (1,007 )\nNet Decrease in Cash and Cash Equivalents (2,966 ) (800 )\nCash and Cash Equivalents at Beginning of Year 3,900 4,700\nCash and Cash Equivalents at End of Year $ 934 $ 3,900\nSupplemental Cash Flow Information:\nNon Cash Transactions:\nRight-of-Use Asset $ 51 $ 3,688\nOperating Lease Liabilities (51 ) (3,688 )\nTreasury stock retired 4,801 1,000\nCash Transactions:\nCash (Refund) Paid for Taxes (312 )\nCash Paid for Interest -\nThe accompanying notes are an integral part of these financial statements.\nOptex Systems Holdings, Inc.\nConsolidated Statement of Stockholders Equity\n(Thousands, except share data)\nCommon\nAdditional\nTotal\nShares Treasury Common Treasury Paid in Retained Stockholders\nIssued Shares Stock Stock Capital Earnings Equity\nBalance at September 27, 2020 8,795,869 105,733 (200 ) $ 26,276 $ (12,109 ) $ 13,976\nStock Compensation Expense - - - - -\nVested restricted stock units issued net of tax withholding 58,392 - - - (44 ) - (44 )\nCommon Stock Repurchase (1) - 449,088 - (869 ) - - (869 )\nExercise of Warrants(2) 188,809 - - - -\nCommon Stock Purchase and Cancellation (100 ) - - - - - -\nCancellation of Treasury Shares(1) (519,266 ) (519,266 ) - 1,000 (1,000 ) - -\nNet income - - - - - 2,131 2,131\nBalance at October 3, 2021 8,523,704 35,555 $ 9 $ (69 ) $ 25,752 $ (9,978 ) $ 15,714\nStock Compensation Expense - - - - -\nVested restricted stock units issued net of tax withholding 23,216 - - - (19 ) - (19 )\nCommon Stock Repurchase (1) - 190,954 - (371 ) - - (371 )\nCancellation of Treasury Shares (1) (226,509 ) (226,509 ) - (440 ) - -\nTender Offer Stock Repurchase and Cancellation(3) (1,603,773 ) - (2 ) - (4,359 ) - (4,361 )\nNet income - - - - - 1,283 1,283\nBalance at October 2, 2022 6,716,638 - $ 7 $ - $ 21,096 $ (8,695 ) $ 12,408\n(1) Common shares repurchased in the open market during the twelve months ended October 3, 2021 and October 2, 2022. Shares were held in treasury using the cost method. As of October 3, 2021, there were 35,555 shares held in treasury at a cost of $69 thousand. As of October 2, 2022, all of the treasury shares have been cancelled.\n(2) Exercise of warrants for common shares at $1.50 for gross proceeds of $283 thousand and a fair market value of $9 thousand as of the exercise dates.\n(3) Common shares repurchased pursuant to the tender offer that closed on September 15, 2022. Total tendered shares of 1,603,773 at $2.65, or $4.25 million, plus transaction costs of $111 thousand. Repurchased shares were immediately cancelled.\nThe accompanying notes are an integral part of these financial statements.\nNote 1 - Organization and Operations\nOptex Systems Holdings, Inc. (the Company) manufactures optical sighting systems and assemblies for the U.S. Department of Defense, foreign military applications and commercial markets. Its products are installed on a variety of U.S. military land vehicles, such as the Abrams and Bradley fighting vehicles, light armored and advanced security vehicles, and have been selected for installation on the Stryker family of vehicles. Optex Systems Holdings also manufactures and delivers numerous periscope configurations, rifle and surveillance sights and night vision optical assemblies. Optex Systems Holdings products consist primarily of build to customer print products that are delivered both directly to the military and to other defense prime contractors or commercial customers. Optex Systems Holdings operations are based in Dallas and Richardson, Texas in leased facilities comprising 93,967 square feet. As of October 2, 2022, the Company operated with 84 full-time equivalent employees.\nNote 2 - Summary of Significant Accounting Policies\nBasis of Presentation\nPrinciples of Consolidation: The consolidated financial statements include the accounts of Optex Systems Holdings and its wholly-owned subsidiary, Optex Systems, Inc. All significant inter-company balances and transactions have been eliminated in consolidation.\nUse of Estimates: The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statement and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from the estimates.\nSegment Reporting: FASB ASC 280 requires that a public business enterprise report financial and descriptive information about its reportable operating segments. Operating segments are components of an enterprise about which separate financial information is available and evaluated regularly by the chief operating decision maker in decisions regarding resource allocations and performance assessments. Generally, financial information is required to be reported on the basis that it is used internally for evaluating segment performance and deciding how to allocate resources to segments. Segments are determined based on differences in products, internal reporting and how operational decisions are made. Management has determined that the Optex Systems, Richardson plant, and the Applied Optics Center, Dallas plant are separately managed, organized, and internally reported as separate business segments. The FASB ASC 280 requires that a public business enterprise report a measure of segment profit or loss, certain specific revenue and expense items, and segment assets. It requires reconciliations of total segment revenues, total segment profit or loss, total segment assets, and other amounts disclosed for segments to corresponding amounts in the enterprises general-purpose financial statements.\nFiscal Year: Optex System Holdings fiscal year ends on the Sunday nearest September 30. Fiscal year 2022 ended on October 2, 2022 and included 52 weeks. Fiscal year 2021 ended on October 3, 2021 and included 53 weeks.\nFair Value of Financial Instruments: Fair value estimates discussed herein are based upon certain market assumptions and pertinent information available to management as of the financial statement presentation date.\nThe carrying value of cash and cash equivalents, accounts receivable, accounts payable, accrued liabilities, are carried at, or approximate, fair value as of the reporting date because of their short-term nature. The credit facility is reported at fair value as it bears market rates of interest. Fair values for the Companys warrant liabilities and derivatives are estimated by utilizing valuation models that consider current and expected stock prices, volatility, dividends, market interest rates, forward yield curves and discount rates. Besides the Companys warrant liabilities, such amounts and the recognition of such amounts are subject to significant estimates that may change in the future.\nThe fair value hierarchy prioritizes the inputs to valuation techniques used to measure fair value and requires that assets and liabilities carried at fair value be classified and disclosed in one of the following three categories:\nLevel 1: Quoted market prices in active markets for identical assets or liabilities.\nLevel 2: Observable market-based inputs or unobservable inputs that are corroborated by market data.\nLevel 3: Unobservable inputs reflecting the reporting entitys own assumptions.\nThe accounting guidance establishes a hierarchy which requires an entity to maximize the use of quoted market prices and minimize the use of unobservable inputs. An asset or liabilitys level is based on the lowest level of input that is significant to the fair value measurement. Fair value estimates are reviewed at the origination date and again at each applicable measurement date and interim or annual financial reporting dates, as applicable for the financial instrument, and are based upon certain market assumptions and pertinent information available to management at those times.\nEach of the measurements is considered a Level 3 measurement based on the availability of market data and inputs and the significance of any unobservable inputs as of the measurement date. The methods and significant inputs and assumptions utilized in estimating the fair value of the warrant liabilities, as well as the respective hierarchy designations are discussed further in Note 12 Warrant Liabilities.\nCash and Cash Equivalents: For financial statement presentation purposes, Optex Systems Holdings considers those short-term, highly liquid investments with original maturities of three months or less to be cash or cash equivalents. Optex Systems Holdings has $0.9 million in cash on deposit with our banks. Only a portion of the cash, currently $250 thousand, would be covered by federal deposit insurance and the uninsured balances are substantially greater than the insured amounts.\nConcentration of Credit Risk: The Companys revenues for fiscal year ended October 2, 2022 are derived from sales to U.S. government agencies (14%), three U.S. defense contractors (22%, 15%, and 7%), one major commercial customer 22%) and all other customers (20%). The Companys revenues for fiscal year ended October 3, 2021 are derived from sales to U.S. government agencies (28%), four major U.S. defense contractors (27%, 11%, 5%, and 5%), one major commercial customer (10%) and all other customers (14%). Optex Systems Holdings does not believe that this concentration results in undue credit risk because of the financial strength of the obligees.\nAccounts Receivable: Optex Systems Holdings records its accounts receivable at the original sales invoice amount less liquidations for previously collected advance/progress bills and an allowance for doubtful accounts. An account receivable is considered to be past due if any portion of the receivable balance is outstanding beyond its scheduled due date. On a quarterly basis, Optex Systems Holdings evaluates its accounts receivable and establishes an allowance for doubtful accounts, based on its history of past write-offs and collections, and current credit conditions. No interest is accrued on past due accounts receivable. As of October 2, 2022, and October 3, 2021, Optex Systems Holdings had an allowance for doubtful accounts of $5 thousand, for non U.S. government account balances greater than 120 days. As the customer base is primarily U.S. government and government prime contractors, Optex Systems Holdings allowance for doubtful accounts is minimal. Optex Systems Holdings charges uncollectible accounts to bad debt expense in the period as they are first deemed uncollectible. In the fiscal year 2022 we recognized $21 thousand in bad debt expenses associated with uncollectible accounts. In the fiscal year 2021 we recognized zero in bad debt expenses associated with uncollectible accounts.\nAs of October 2, 2022, 89% of the accounts receivable balance was comprised of eight customers: the U.S. government, 10%, five major defense contractors, 14%, 12%, 9%, 8% and 7%, a commercial customer, 19%, and a foreign military customer, 10%. As of October 3, 2021, 87% of the accounts receivable balance was comprised of six customers: the U.S. government, 34%, three major defense contractors, 13%, 10% and 7%, and a commercial customer, 16%, and a foreign military customer, 7%.\nInventory: Inventory is recorded at the lower of cost or net realizable value, and adjusted as appropriate for decreases in valuation and obsolescence. Adjustments to the valuation and obsolescence reserves are made after analyzing market conditions, current and projected sales activity, inventory costs and inventory balances to determine appropriate reserve levels. Cost is determined using the first-in first-out method. As of October 2, 2022, and October 3, 2021 inventory included:\nSchedule of Inventory\n(Thousands)\nAs of\nOctober 2, 2022\nAs of\nOctober 3, 2021\nRaw Materials $ 6,953 $ 4,926\nWork in Process 2,722 2,664\nFinished Goods\nGross Inventory 10,023 8,219\nLess: Inventory Reserves (811 ) (636 )\nNet Inventory $ 9,212 $ 7,583\nIn the twelve months ended October 2, 2022 Optex Systems recorded $175 thousand of obsolete and excess inventory reserves. Net Inventory increased by $1.6 million in support of increased customer backlog and higher revenue.\nWarranty Costs: Some of Optex Systems Holdings customers require that the Company warrant the quality of its products to meet customer requirements and be free of defects for up to twelve months subsequent to delivery. Future warranty costs are based on the estimated cost of replacement for expected returns based upon our most recent experience rate of defects as a percentage of warranty covered sales. Throughout the year, warranty costs are expensed as incurred, and as of each year end, Optex Systems Holdings reviews the prior 12-month warranty experience rate and may adjust the warranty accrual as required to cover any estimated warranty expenses associated the period end backlog of returned customer units awaiting repair or replacement plus any estimated warranty expenses related to anticipated future returns on previous deliveries. As of October 2, 2022 and October 3, 2021, the existing warranty reserve balances of $169 thousand and $78 thousand, respectively, were reviewed and determined to be adequate to satisfy any future warranty claims that may have existed as of the end of each fiscal year for shipments occurring in the prior 12 months. We have made numerous improvements to our supplier bases and internal production process to reduce the return rate on future shipments but will continue to review and monitor the reserve balances related to this product line against any existing warranty backlog and current trend data as we repair and replace our current warranty backlog and process future warranty returns.\nThe table below summarizes the warranty expenses and incurred warranty costs for the twelve months ended October 2, 2022 and October 3, 2021.\nSchedule of Warranty Reserves\nYears ended\nBeginning balance $ 78 $ 83\nIncurred costs for warranties satisfied during the period (4 ) (80 )\nWarranty Expenses:\nWarranties reserved for new product shipped during the period(1)\nChange in estimate for pre-existing warranty liabilities (2) (103 )\nWarranty Expense\nEnding balance $ 169 $ 78\n(1) Warranty expenses accrued to cost of sales (based on current year shipments and historical warranty return rate).\n(2) Changes in estimated warranty liabilities recognized in cost of sales associated with: the period end customer returned warranty backlog, or the actual costs of repaired/replaced warranty units which were shipped to the customer during the year. During the twelve months ended October 2, 2022, the warranty return rate was significantly below historical levels resulting in a favorable change in estimate during the period.\nProperty and Equipment: Property and equipment are recorded at cost. Depreciation is computed using the straight-line method over the estimated useful lives of the assets, ranging from three to seven years. Expenditures for renewals and betterments are capitalized. Expenditures for minor items, repairs and maintenance are charged to operations as incurred. Gain or loss upon sale or retirement due to obsolescence is reflected in the operating results in the period the event takes place.\nLeases: In February 2016, FASB issued ASU 2016-02-Leases (Topic 842). The update is intended to increase transparency and comparability among organizations by recognizing lease assets and lease liabilities on the balance sheet and disclosing key information about leasing arrangements. The amendments in this update are effective for fiscal years beginning after December 15, 2018, including interim periods within those fiscal years. As such, Optex Systems Holdings adopted these provisions as of the fiscal year beginning on September 30, 2019. Optex Systems Holdings has two significant operating facilities leases which extend beyond twelve months and fall under the guidance of ASC Topic 842.\nOn January 11, 2021, the Company executed amendments extending the lease terms of both facilities for eighty-six months. Execution of the new lease amendments for the Dallas and Richardson facilities resulted in the balance sheet recognition of a right-of-use asset of $3.7 million and corresponding operating lease liabilities of approximately $3.7 million during the period ended October 3, 2021. As of the twelve months ended October 2, 2022, the Company has recognized $51 thousand in right-of-use-asset and corresponding operating lease liabilities of $51 thousand for an office equipment lease expiring in December 2025. See also Note 7.\nRevenue Recognition: The Company has adopted FASB ASC 606-Revenue from Contracts with Customers which requires revenue recognition based on a five-step model that includes: identifying the contract, identifying the performance obligations, determining the transaction price, allocating the transaction price and recognizing the revenue. The standard results in the recognition of revenue depicting the transfer of promised goods or services to customers in an amount reflecting the expected consideration to be received from the customer for such goods and services, based on the satisfaction of performance obligations, occurring when the control of the goods or services transfer to the customer. The majority of the Companys contracts and customer orders originate with fixed determinable unit prices for each deliverable quantity of goods defined by the customer order line item (performance obligation) and include the specific due date for the transfer of control and title of each of those deliverables to the customer at pre-established payment terms, which are generally within thirty to sixty days from the transfer of title and control. We have elected to account for shipping and handling costs as fulfillment costs after the customer obtains control of the goods. In addition, the Company has one ongoing service contract which relates to optimized weapon system support (OWSS) and includes ongoing program maintenance, repairs and spare inventory support for the customers existing fleet units in service during the duration of the contract. Revenue recognition for this program has been recorded by the Company, and compensated by the customer, at fixed monthly increments over time, consistent with the defined contract maintenance period. The total revenue recognized over time related to the contract is $464 thousand for the twelve months ended October 2, 2022 and $479 thousand for the twelve months ended October 3, 2021.\nThe Company has on occasion, outside of the presented periods, received selective contract awards and modifications which included substantive milestone performance obligations, contract modifications, negotiated settlements and financing arrangements which could fall within the scope of FASB ASC 606 revenue recognition guidance on reoccurrence, and as such, the Company has expanded their contract review process to ensure any new contract awards, changes, modifications, financing arrangements or potential negotiated settlements are recorded in compliance to the new standard guidance.\nDuring the twelve months ended October 2, 2022, there was zero revenue recognized during the period from customer deposit liabilities (deferred contract revenue). During the twelve months ended October 3, 2021 there was $1 thousand of revenue recognized from customer deposit liabilities (deferred contract revenue). As October 2, 2022 and October 3, 2021, there are no significant deferred contract costs such as sales commissions.\nCustomer Advance Deposits: Customer advance deposits represent amounts collected from customers in advance of shipment or revenue recognition which relate to undelivered product due to non-substantive milestone payments or other cash in advance payment terms. As of October 2, 2022 and October 3, 2021, Optex Systems, Inc. had a balance of $311 thousand and zero, respectively, in customer advance deposits.\nContract Loss Reserves: The Company records loss provisions in the event that the current estimated total revenue against a contract and the total estimated cost remaining to fulfill the contract indicate a loss upon completion. When the estimated costs indicate a loss, we record the entire value of the loss against the contract loss reserve in the period the determination is made. The Company has several long-term fixed price contracts that are currently indicative of a loss condition due to recent inflationary pressures on material and labor, combined with increased manufacturing overhead costs. As of the twelve months ended October 2, 2022, the Company recognized contract loss reserves of $289 which have been separately itemized on the balance sheet. As of the twelve months ended October 3, 2021, the Company had contract loss reserves of $51 thousand. In the prior year, the accrued contract losses were previously included in accrued expense and have been reclassed as a separate line in the current year presentation. See also Note 6 Accrued Expenses.\nGovernment Contracts: Many of Optex Systems Holdings contracts are prime or subcontracted directly with the Federal government and as such, are subject to Federal Acquisition Regulation (Federal Acquisition Regulation) Subpart 49.5, Contract Termination Clauses and more specifically Federal Acquisition Regulation clauses 52.249-2 Termination for Convenience of the Government (Fixed-Price), and 49.504 Termination of fixed-price contracts for default. These clauses are standard clauses on prime military contracts and are required by the government to be flowed down by the prime contractor to any subcontractors used to perform work or provide components against the award. It has been Optex Systems Holdings experience that the termination for convenience is rarely invoked, except where it has been mutually beneficial for both parties. Optex Systems Holdings is not currently aware of any pending terminations for convenience or default on its existing prime contracts or customer purchase orders.\nImpairment or Disposal of Long-Lived Assets: Optex Systems Holdings follows the provisions of FASB ASC 360-10, Accounting for the Impairment or Disposal of Long-lived Assets. This standard requires, among other things, that long-lived assets be reviewed for potential impairment whenever events or circumstances indicate that the carrying amounts may not be recoverable. The assessment of possible impairment is based on the ability to recover the carrying value of the asset from the expected future pre-tax cash flows (undiscounted and without interest charges) of the related operations. If these cash flows are less than the carrying value of such assets, an impairment loss is recognized for the difference between estimated fair value and carrying value. The measurement of impairment requires management to estimate future cash flows and the fair value of long-lived assets. No impairment of long-lived assets was recorded for the periods presented.\nStock-Based Compensation: FASB ASC 718 establishes standards for the accounting for transactions in which an entity exchanges its equity instruments for goods or services, but primarily focuses on transactions whereby an entity obtains employee services for share-based payments. FASB ASC 718 requires that the compensation cost relating to share-based payment transactions be recognized in the financial statements. That cost will be measured based on the fair value of the equity or liability instruments issued. It also addresses transactions in which an entity incurs liabilities in exchange for goods or services that are based on the fair value of the entitys equity instruments or that may be settled by the issuance of those equity instruments.\nIncome Tax/Deferred Tax: FASB ASC 740 requires recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns. Under this method, deferred tax assets and liabilities are determined based on differing treatment of items for financial reporting and income tax reporting purposes. The deferred tax balances are adjusted to reflect tax rates by tax jurisdiction, based on currently enacted tax laws, which will be in effect in the years in which the temporary differences are expected to reverse. Under FASB ASC 740, the effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance is provided for certain deferred tax assets if it is more likely than not that Optex Systems Holdings will not realize tax assets through future operations. When assessing the recoverability of deferred tax assets, management considers the scheduled reversal of deferred tax liabilities, projected future taxable income and tax planning strategies and results of recent operations. Based on those estimates, management has determined that a portion of the deferred tax assets may not be realized and has established a valuation allowance against the deferred tax asset balance. We record uncertain tax positions in accordance with ASC 740 on the basis of a two-step process in which (1) we determine whether it is more likely than not that the tax positions will be sustained on the basis of the technical merits of the position and (2) for those tax positions that meet the more-likely-than-not recognition threshold, we recognize the largest amount of tax benefit that is more than 50 percent likely to be realized upon ultimate settlement with the related tax authority.\nAs of October 2, 2022, Optex Systems Inc. has a net carrying value of $0.9 million in deferred tax assets represented by deferred tax assets of $1.8 million and a deferred tax asset valuation allowance of ($0.9) million against those assets. The valuation allowance has been established due to historical losses resulting in a Net Operating Loss Carryforward for each of the fiscal years 2010 through 2016 which may not be fully recognized due to an IRS Section 382 limitation related to a change in control occurring in fiscal year 2018. As of October 2, 2022 and October 3, 2021, we reviewed the deferred tax assets and determined it was more likely than not that we would be able to utilize a substantial portion of the deferred tax asset balance against future earnings. Our assumptions were based on the previous three years earnings trend as well as anticipated future earnings expected with the increases in U.S defense and Foreign Military market spending. During the twelve months ended October 2, 2022, the Company recovered $0.3 million in cash for a tax refund related to a net operating loss carryback from the prior year ended October 2, 2021, and recognized an income tax expense of $0.4 million. We will continue to review the deferred tax assets and related valuation reserves in accordance with ASC 740 on an annual basis.\nEarnings per Share: Basic earnings per share is computed by dividing income available for common shareholders (the numerator) by the weighted average number of common shares outstanding (the denominator) for the period. Diluted earnings per share reflect the potential dilution that could occur if securities or other contracts to issue common stock were exercised or converted into common stock.\nThe potentially dilutive securities that Optex Systems Holdings had outstanding were stock options and warrants. Optex Systems Holdings uses the Treasury Stock Method to compute the dilutive effect of stock options and warrants. Stock options and warrants that are anti-dilutive are excluded from the calculation of diluted earnings per common share.\nFor the twelve months ended October 2, 2022, 66,000 unvested restricted stock units and 180,000 unvested restricted shares (which converts to 91,045 incremental dilutive shares) were included in the diluted earnings per share calculation as dilutive. For the twelve months ended October 3, 2021, 99,000 unvested restricted stock units and 240,000 restricted unvested shares (which converts to 82,788 incremental dilutive shares) were included in the diluted earnings per share calculation as dilutive.\nOur outstanding warrants during the twelve months ended October 3, 2021 were participating securities which shared dividend distributions and the allocation of any undistributed earnings (deemed dividends) with our common shareholders. During the twelve months ended October 3, 2021, there were no declared dividends and allocated undistributed earnings of $0.7 million attributable to the participating warrants. There were no outstanding warrants or declared dividends during the twelve months ended October 2, 2022 as the warrants expired on August 21, 2021.\nNote 3 - Recent Accounting Pronouncements\nThere are no significant recent accounting pronouncements that effect the Company.\nNote 4 - Segment Reporting\nThe Companys reportable segments are strategic businesses offering similar products to similar markets and customers; however, the companies are operated and managed separately due to differences in manufacturing technology, equipment, geographic location, and specific product mix. Applied Optics Center was acquired as a unit, and the management at the time of the acquisition was retained. Both the Applied Optics Center and Optex Systems - Richardson operate as reportable segments under the Optex Systems, Inc. corporate umbrella.\nThe Applied Optics Center segment also serves as the key supplier of laser coated filters used in the production of periscope assemblies for the Optex Systems-Richardson (Optex Systems) segment. Intersegment sales and transfers are accounted for at annually agreed to pricing rates based on estimated segment product cost, which includes segment direct manufacturing and general and administrative costs, but exclude profits that would apply to third party external customers.\nOptex Systems (OPX) - Richardson, Texas\nOptex Systems revenues are primarily in support of prime and subcontracted military customers. Approximately 84% of the Optex Systems segment revenue is comprised of domestic military customers, and 16% is comprised of foreign military customers. Optex Systems segment revenue is derived from the U.S. government, 13%, and two major U.S. defense contractors representing 17% and 8%, of the Companys consolidated revenue, respectively.\nOptex Systems is located in Richardson Texas, with leased premises consisting of approximately 49,100 square feet. As of October 2, 2022, the Richardson facility operated with 46 full time equivalent employees in a single shift operation. Optex Systems, Richardson serves as the home office for both the Optex Systems and Applied Optics Center segments.\nApplied Optics Center (AOC) - Dallas, Texas\nThe Applied Optics Center serves primarily domestic U.S. customers. Sales to commercial customers represent 41% and military sales to prime and subcontracted customers represent 59% of the total segment revenue. Approximately 94% of the AOC revenue is derived from external customers and approximately 6% is related to intersegment sales to Optex Systems in support of military contracts. For the twelve months ended October 2, 2022, the AOC segment revenue from one major commercial customer, and two major defense contractors represent approximately 22%, 15% and 5% of the Companys consolidated revenue, respectively.\nThe Applied Optics Center is located in Dallas, Texas with leased premises consisting of approximately 44,867 square feet of space. As of October 2, 2022, AOC operated with 38 full time equivalent employees in a single shift operation.\nThe financial table below presents the information for each of the reportable segments profit or loss as well as segment assets for each year. The Company does not allocate interest expense, income taxes or unusual items to segments.\nSchedule of Segment Reporting Information\nReportable Segment Financial Information\n(thousands)\nTwelve months ended October 2, 2022\nOptex\nSystems\nRichardson\nApplied\nOptics\nCenter\nDallas\nOther\n(non-\nallocated\ncosts and\nintersegment\neliminations)\nConsolidated\nTotal\nRevenues from external customers $ 9,533 $ 12,850 $ - $ 22,383\nIntersegment revenues - (879 ) -\nTotal Revenue $ 9,533 $ 13,729 $ (879 ) $ 22,383\nInterest expense $ - $ - $ - $ -\nDepreciation and Amortization $ 38 $ 269 $ - $ 307\nIncome (loss) before taxes $ (380 ) $ 2,189 $ (162 ) $ 1,647\nOther significant noncash items:\nAllocated home office expense $ (1,141 ) $ 1,141 $ - $ -\nStock compensation expense $ - $ - $ 162 $ 162\nWarranty expense $ - $ 95 $ - $ 95\nSegment Assets $ 11,286 $ 7,251 $ - $ 18,537\nExpenditures for segment assets $ 64 $ 193 $ - $ 257\nReportable Segment Financial Information\n(thousands)\nTwelve months ended October 3, 2021\nOptex\nSystems\nRichardson\nApplied\nOptics\nCenter\nDallas\nOther\n(non-\nallocated\ncosts and\nintersegment\neliminations)\nConsolidated\nTotal\nRevenues from external customers $ 11,827 $ 6,395 $ - $ 18,222\nIntersegment revenues - 1,056 (1,056 ) -\nTotal Revenue $ 11,827 $ 7,451 $ (1,056 ) $ 18,222\nInterest expense $ - $ - $ 11 $ 11\nDepreciation and Amortization $ 41 $ 222 $ - $ 263\nIncome before taxes $ 251 $ (517 ) $ 2,296 $ 2,030\nOther significant noncash items:\nAllocated home office expense $ (677 ) $ 677 $ - $ -\nGain on change in fair value of warrants $ - $ - $ (2,535 ) $ (2,535 )\nStock compensation expense $ - $ - $ 228 $ 228\nWarranty Expense $ (15 ) $ 90 $ - $ 75\nSegment Assets $ 14,010 $ 6,845 $ - $ 20,855\nExpenditures for segment assets $ 20 $ 254 $ - $ 274\nNote 5 - Property and Equipment\nA summary of property and equipment at October 2, 2022 and October 3, 2021 is as follows:\nSchedule of Property and Equipment\nEstimated\nUseful Life\nYear Ended\nOctober 2, 2022\nYear Ended\nOctober 3, 2021\n(Thousands)\nEstimated\nUseful Life\nOctober 2, 2022\nOctober 3, 2021\nProperty and Equipment\nFurniture and Fixtures 3-5 yrs $ 405 $ 398\nMachinery and Equipment 5 yrs 4,231 4,035\nLeasehold Improvements 7 yrs\nProperty and Equipment, gross 7 yrs\nLess: Accumulated Depreciation\n(4,019 ) (3,712 )\nNet Property & Equipment\n$ 968 $ 1,017\nDepreciation Expense\n$ 307 $ 263\nDuring the twelve months ended October 2, 2022, Optex Systems Holdings purchased $6 thousand in new furniture and fixtures, $196 thousand in machinery and equipment and $55 thousand in leasehold improvements. During the twelve months ended October 2, 2022, there were no sales or retirements of fixed assets. During the twelve months ended October 3, 2021, Optex Systems Holdings purchased $254 thousand in new furniture and fixtures and $20 thousand in leasehold improvements. During the twelve months ended October 3, 2021, there were no sales or retirements of fixed assets.\nNote 6 - Accrued Expenses\nThe components of accrued liabilities as of October 2, 2022 and October 3, 2021 are summarized below:\nSchedule of Accrued Liabilities\nOctober 2, 2022 October 3, 2021(1)\n(Thousands)\nOctober 2, 2022 October 3, 2021(1)\nAccrued Vacation\nProperty Taxes\nOperating Expenses\nPayroll & Payroll Related\nTotal Accrued Expenses $ 958 $ 800\n(1) Accrued Expenses at October 3, 2021, previously included $51 thousand in Contract Loss Reserves which has been presented as a separate balance sheet component as of the year ended October 2, 2022. See also Note 2 Contract Loss Reserves.\nNote 7 - Commitments and Contingencies\nRental Payments under Non-cancellable Operating Leases\nOptex Systems Holdings leases its office and manufacturing facilities for the Optex Systems, Inc. Richardson location and the Applied Optics Center Dallas location. The Company also leases certain office equipment under non-cancellable operating leases.\nThe leased facility under Optex Systems Inc. located at 1420 Presidential Drive, Richardson, Texas consists of 49,100 square feet of space at the premises. The previous lease term for this location expired March 31, 2021 and the monthly base rent was $24.6 thousand through March 31, 2021. On January 11, 2021 the Company executed a sixth amendment extending the terms of the lease for eighty-six (86) months, commencing on April 1, 2021 and ending on May 31, 2028. The initial base rent is set at $25.3 thousand and escalates 3% on April 1 each year thereafter. The initial term included 2 months of rent abatement for April and May of 2021. The monthly rent includes approximately $11.3 thousand for additional Common Area Maintenance fees and taxes (CAM), to be adjusted annually based on actual expenses incurred by the landlord.\nThe leased facility under the Applied Optics Center located at 9839 and 9827 Chartwell Drive, Dallas, Texas, consists of 44,867 square feet of space at the premises. The previous lease term for this location expired on October 31, 2021 and the monthly base rent was $21.9 thousand through the end of the lease. On January 11, 2021 the Company executed a first amendment extending the terms of the lease for eighty-six (86) months, commencing on November 1, 2021 and ending on December 31, 2028. The initial base rent is set at $23.6 thousand as of January 1, 2022 and escalates 2.75% on January 1 each year thereafter. The initial term includes 2 months of rent abatement for November and December of 2021. The amendment provides for a five-year renewal option at the end of the lease term at the greater of the then prevailing rental rate or the then current base rental rate. Our obligations to make payments under the lease are secured by a $125,000 standby letter of credit. The monthly rent includes approximately $7.9 thousand for additional CAM, to be adjusted annually based on actual expenses incurred by the landlord.\nExecution of the new lease amendments for the Dallas and Richardson facilities resulted in the balance sheet recognition of a right-of-use asset of $3.7 million and corresponding operating lease liabilities of approximately $3.7 million during the year ended October 3, 2021.\nThe Company had one non-cancellable office equipment lease with a commencement date of October 1, 2018 and a term of 39 months. The lease cost for the equipment was $1.5 thousand per month from October 1, 2018 through December 31, 2021. The lease was renewed on November 18, 2021 for an additional 48 months at a cost of $1.2 thousand per month. The start of the lease was delayed until April 2022 due to temporary equipment shortages. The lease renewal resulted in the recognition of an additional right of use asset and a lease liability of $51 thousand, respectively during the twelve months ended October 2, 2022.\nAs of October 2, 2022, the remaining minimum base lease and estimated common area maintenance (CAM) payments under the non-cancellable office equipment and facility space leases are as follows:\nNon-cancellable Operating Leases Minimum Payments\nSchedule of Non-cancellable Operating Leases Minimum Payments\n(Thousands)\nOptex\nRichardson Applied Optics\nCenter Office\nEquipment Consolidated\nFiscal Year Facility\nLease\nPayments\nFacility\nLease\nPayments\nLease\nPayments\nTotal Lease\nPayments Total Variable\nCAM Estimate\n2023 Base year lease $ 317 $ 288 $ 15 $ 620 $ 235\n2024 Base year lease 638\n2025 Base year lease 656\n2026 Base year lease 662\n2027 Base year lease -\n2028 Base year lease -\n2029 Base year lease - -\nTotal base lease payments 1,925 $ 1,937 $ 48 3,910 $ 1,434\nImputed interest on lease payments (1) (258 ) (283 ) (4 ) (545 )\nTotal Operating Lease Liability(2) $ 1,667 $ 1,654 $ 44 $ 3,365\nRight-of-use Asset(3) $ 1,587 $ 1,591 $ 44 $ 3,222\n(1) Assumes a discount borrowing rate of 5.0% on the new lease amendments effective as of January 11, 2021.\n(2) Includes $143 thousand of unamortized deferred rent.\n(3) Short-term and Long-term portion of Operating Lease Liability is $604 thousand and $2,761 thousand, respectively.\nTotal expense under both facility lease agreements for the twelve months ended October 2, 2022 was $849 thousand. Total expense under both facility lease agreements as of the twelve months ended October 3, 2021 was $769 thousand.\nTotal office equipment rentals included in operating expenses was $22 thousand for the twelve months ended October 2, 2022 and for the twelve months ended October 3, 2021.\nNote 8 - Debt Financing\nCredit Facility - PNC Bank (formerly BBVA, USA)\nOn April 16, 2020, the Company terminated its facility with Avidbank and entered into a new facility with BBVA USA.\nOn April 16, 2020, Optex Systems Holdings, Inc. and its subsidiary, Optex Systems, Inc. (the Borrower) entered into a line of credit facility (the Facility) with BBVA, USA. In June 2021, PNC Bank completed its acquisition of BBVA, USA and the bank name changed to PNC Bank (PNC). The substantive terms were as follows:\n● The principal amount of the Facility was $2.25 million. The Facility matured on April 15, 2022. The interest rate was variable based on PNCs Prime Rate plus a margin of -0.250%, initially set at 3% at loan origination, and all accrued and unpaid interest was payable monthly in arrears starting on May 15, 2020; and the principal amount was due in full with all accrued and unpaid interest and any other fees on April 15, 2022.\n● There were commercially standard covenants including, but not limited to, covenants regarding maintenance of corporate existence, not incurring other indebtedness except trade debt, not changing more than 25% stock ownership of Borrower, and a Fixed Charge Coverage Ratio of 1.25:1, with the Fixed Charge Coverage Ratio defined as (earnings before taxes, amortization, depreciation, amortization and rent expense less cash taxes, distribution, dividends and fair value of warrants) divided by (current maturities on long term debt plus interest expense plus rent expense).\n● The Facility contained commercially standard events of default including, but not limited to, not making payments when due; incurring a judgment of $10,000 or more not covered by insurance; not maintaining collateral and the like.\n● The Facility was secured by a first lien on all of the assets of Borrower.\nOn April 12, 2022, the Company and its subsidiary, Optex Systems, Inc. (collectively with the Company, the Borrowers), entered into an Amended and Restated Loan Agreement (the Loan Agreement) with PNC Bank, National Association, successor to BBVA USA (the Lender), pursuant to which the Borrowers existing revolving line of credit facility was decreased from $2.25 million to $1.125 million, and the maturity date was extended from April 15, 2022 to April 15, 2023.\nThe Loan Agreement requires the Borrowers to maintain a fixed charge coverage ratio of at least 1.25:1.\nOn November 21, 2022, the Borrowers issued an Amended and Restated Revolving Line of Credit Note (the Line of Credit Note) to the Lender in connection with an increase of the Borrowers revolving line of credit facility under the Loan Agreement from $1.125 million to $2.0 million. The maturity date remains April 15, 2023. Obligations outstanding under the credit facility will accrue interest at a rate equal to the Lenders prime rate minus 0.25%. See also Note 14 Subsequent Events.\nThe Line of Credit Note and Loan Agreement contain customary events of default and negative covenants, including but not limited to those governing indebtedness, liens, fundamental changes, investments, and restricted payments. The credit facility is secured by substantially all of the operating assets of the Borrowers as collateral. The Borrowers obligations under the credit facility are subject to acceleration upon the occurrence of an event of default as defined in the Line of Credit Note and Loan Agreement.\nThe outstanding balance on the credit facility was zero as of October 2, 2022 and October 3, 2021, respectively. For the years ended October 2, 2022 and October 3, 2021, the total interest expense against the outstanding line of credit balance was zero and $11 thousand, respectively.\nNote 9 - Stock Based Compensation\nStock Options issued to Employees, Officers and Directors\nThe Optex Systems Holdings 2009 Stock Option Plan provides for the issuance of up to 75,000 shares to the Companys officers, directors, employees and to independent contractors who provide services to Optex Systems Holdings as either incentive or non-statutory stock options determined at the time of grant. There were no new grants of stock options during the twelve months ended October 2, 2022. As of October 2, 2022, there are zero stock options outstanding.\nRestricted Stock and Restricted Stock Units issued to Officers and Employees\nThe following table summarizes the status of Optex Systems Holdings aggregate non-vested restricted stock and restricted stock units, with the latter granted under the Companys 2016 Restricted Stock Unit Plan:\nSchedule of Aggregate Non-vested Restricted Stock and Restricted Stock Units Granted\nRestricted\nStock Units\nWeighted\nAverage\nGrant Date\nFair Value\nRestricted\nShares\nWeighted\nAverage\nGrant Date\nFair Value\nOutstanding at September 27, 2020 182,000 $ 1.54 300,000 1.75\nGranted - - - -\nVested (83,000 ) $ 1.49 (60,000 ) $ 1.75\nForfeited - - - -\nOutstanding at October 3, 2021 99,000 $ 1.59 240,000 $ 1.75\nGranted - - - -\nVested (33,000 ) $ 1.73 (60,000 ) $ 1.75\nForfeited - - - -\nOutstanding at October 2, 2022 66,000 $ 1.52 180,000 $ 1.75\nOn January 2, 2019, the Company granted 150,000 and 50,000 restricted stock units with a January 2, 2019 grant date to Danny Schoening and Karen Hawkins, respectively, vesting as of January 1 each year subsequent to the grant date over a three-year period at a rate of 34% in year one, and 33% each year thereafter. The stock price at grant date was $1.32 per share. Effective December 1, 2021, the vesting terms of Danny Schoenings Restricted Stock Unit (RSU) grant from January 2019 were revised as described below. The Company amortizes the grant date fair value of $264 thousand to stock compensation expense on a straight-line basis across the three-year vesting period beginning on January 2, 2019. As of October 2, 2022, there was no unrecognized compensation cost relating to this award.\nThe Company entered into an amended and restated employment agreement with Danny Schoening dated December 1, 2021. The updated employment agreement also served to amend Mr. Schoenings RSU Agreement, dated January 2, 2019, by changing the third and final vesting date for the restricted stock units granted under such agreement from January 1, 2022 to the change of control date, that being the first of the following to occur with respect to the Company: (i) any Person, as that term is defined in Sections 13(d) and 14(d) of the Securities Exchange Act of 1934, as amended (the Exchange Act), with certain exclusions, is or becomes the Beneficial Owner (as that term is defined in Rule 13d-3 under the Exchange Act), directly or indirectly, of securities of the Company representing fifty percent (50%) or more of the combined voting power of the Companys then outstanding securities; or (ii) the Company is merged or consolidated with any other corporation or other entity, other than: (A) a merger or consolidation which would result in the voting securities of the Company outstanding immediately prior thereto continuing to represent (either by remaining outstanding or by being converted into voting securities of the surviving entity) more than fifty percent (50%) of the combined voting power of the voting securities of the Company or such surviving entity outstanding immediately after such merger or consolidation; or (B) the Company engages in a merger or consolidation effected to implement a recapitalization of the Company (or similar transaction) in which no Person (as defined above) acquires fifty percent (50%) or more of the combined voting power of the Companys then outstanding securities. The amended RSU Agreement contains certain exceptions to the definition of change of control.\nAs of the December 1, 2021 modification date related to the third and final vesting date of the 49,500 unvested restricted stock units held by Danny Schoening, there was no change in the fair value of the modified award as compared to the original award immediately prior to the modification date. The restricted stock units initially were certain to vest on January 1, 2022, but due to the modification, they are less certain to vest, contingent on a change in control occurring, which change in control, in case Mr. Schoening is terminated by the Company without cause or he resigns with good reason prior to such change in control, must occur prior to March 13, 2023. As of the modification date, there was $5 thousand of unrecognized compensation cost associated with the original award. As a matter of expediency, the unrecognized compensation expense as of the modification date was fully expensed through January 1, 2022. There is no additional compensation expense associated with the modification of the restricted stock unit agreement.\nOn November 28, 2022, the Company entered into a new employment agreement with Danny Schoening which amended Mr. Schoenings RSU Agreement, dated January 2, 2019, which had been previously amended as of December 1, 2021, by changing the third and final vesting date for the restricted stock units granted under such agreement from the change of control date to January 1, 2023. See also Note 14 Subsequent Events.\nOn February 17, 2020, the Company granted 50,000 restricted stock units to Bill Bates, General Manager of the Applied Optics Center. The restricted stock units vest as of January 1 each year subsequent to the grant date over a three-year period at a rate of 34% in year one, and 33% each year thereafter. The stock price at grant date was $2.13 per share. The Company will amortize the grant date fair value of $107 thousand to stock compensation expense on a straight-line basis across the three-year vesting period beginning on February 17, 2020.\nOn April 30, 2020, the Optex Systems Holdings, Inc. Board of Directors held a meeting and voted to increase the annual board compensation for the three independent directors from $22,000 to $36,000 with an effective date of January 1, 2020, in addition to granting 100,000 restricted shares to each independent director which shall vest at a rate of 20% per year (20,000 shares) each January 1st, over the next five years, through January 1, 2025. The total market value for the 300,000 shares is $525 thousand based on the stock price of $1.75 as of April 30, 2020. The Company amortizes the grant date fair value to stock compensation expense on a straight-line basis across the five-year vesting period beginning on April 30, 2020. On each of January 1, 2021 and January 1, 2022, 60,000 of the restricted director shares vested. As of October 2, 2022, there were 180,000 unvested restricted shares.\nOn January 2, 2021, the Company issued 58,392 common shares to directors and officers, net of tax withholding of $44 thousand, in settlement of 83,000 restricted stock units which vested on January 1, 2021.\nOn January 4, 2022, the Company issued 23,216 common shares to officers, net of tax withholding of $19 thousand, in settlement of 33,000 restricted stock units which vested on January 1, 2022.\nAs of October 2, 2022, there were 66,000 unvested restricted stock units consisting of 16,500 unvested restricted stock units for Bill Bates, which will vest on January 1, 2023, and 49,500 unvested restricted stock units for Danny Schoening, vesting on January 1, 2023.\nThere were no new grants of restricted stock or restricted stock units during the twelve months ended October 2, 2022.\nStock Based Compensation Expense\nEquity compensation is amortized to general and administrative expenses based on a straight-line basis across the vesting or service period as applicable. The recorded compensation costs for restricted shares granted and restricted stock units awarded as well as the unrecognized compensation costs are summarized in the table below:\nSchedule of Unrecognized Compensation Costs\nStock Compensation\n(thousands)\nRecognized Compensation\nExpense\nUnrecognized Compensation\nExpense\nTwelve months ended As of year ended\nOctober 2,\nOctober 3,\nOctober 2,\nOctober 3,\nRestricted Shares $ 105 $ 105 $ 236 $ 341\nRestricted Stock Units 66\nTotal Stock Compensation $ 162 $ 228 $ 245 $ 407\nThe unrecognized compensation expense for restricted shares and restricted stock units as of October 2, 2022, is expected to be recognized over a weighted-average period of 2.25 years and 0.25 years, respectively.\nNote 10 - Defined Contribution Plan\nThe Company sponsors a defined contribution pension plan under Section 401(k) of the Internal Revenue Code for all employees. Company contributions are voluntary and are determined annually at the discretion of the Board of Directors at the beginning of each fiscal year. For the fiscal years ended October 2, 2022 and October 3, 2021, the Company offered a qualified automatic contribution arrangement (QACA) with a 100% match of the first 1% and 50% matching of the next 5% and a 2-year vesting requirement. The Companys contribution expense for the fiscal years ended October 2, 2022 and October 3, 2021 were $155 thousand and $158 thousand, respectively.\nNote 11 - Stockholders Equity\nDividends\nThere were no dividends declared or paid during the twelve months ended October 2, 2022 and October 3, 2021.\nCommon stock\nDuring the twelve months ended October 3, 2021, there were 58,392 common shares issued, net of tax withholding, in settlement of 83,000 restricted stock units which vested on January 1, 2021.\nDuring the twelve months ended October 2, 2022, there were 23,216 common shares issued to officers, net of tax withholding of $19 thousand, in settlement of 33,000 restricted stock units which vested on January 1, 2022.\nOn August 10, 2021 and August 23, 2021, there were 148,300 and 40,509 warrants exercised, respectively, at $1.50 per common share at a total transaction cost of $283 thousand. The total fair market value at the time of exercise was $292 thousand. There were no other issuances of common stock during the twelve months ended October 3, 2021.\nOn August 31, 2021, the Company repurchased 100 common shares from a private investor for a total transaction cost of $150 which were subsequently cancelled.\nOn June 8, 2020 the Company announced authorization for a $1 million stock repurchase program. As of September 27, 2020 there were 105,733 shares held in treasury purchased under the June 2020 stock repurchase plan. The Company purchased a total of 519,266 common shares against the program through April 2021, which were subsequently cancelled in June 2021.\nOn September 22, 2021 the Company announced authorization for an additional $1 million stock repurchase program. The shares authorized to be repurchased under the repurchase program may be purchased from time to time at prevailing market prices, through open market or in negotiated transactions, depending upon market conditions and subject to Rule 10b-18 as promulgated by the SEC.\nDuring the twelve months ended October 2, 2022, there were 190,954 common shares repurchased through the program at a cost of $371 thousand. During the twelve months ended October 3, 2021, there were 449,088 common shares repurchased through the program at a cost of $869 thousand. As of October 3, 2021, there were 35,555 shares held in treasury purchased under the September 2021 stock repurchase plan. As of October 2, 2022, all of the repurchased shares had been cancelled. A summary of the purchases under the plan follows:\nSummary of Purchases Under Plan\nFiscal Period Total number\nof shares\npurchased\nTotal\npurchase cost\nAverage price\npaid per\nshare\n(with\ncommission)\nMaximum\ndollar\nvalue that\nmay\nyet be\npurchased\nunder the\nplan\nSeptember 28, 2020 through October 25, 2020 20,948 $ 42 $ 2.01 $ 758\nOctober 26, 2020 through November 22, 2020 129,245 2.05\nNovember 23, 2020 through December 27, 2020 58,399 1.86\nDecember 28, 2020 through January 24, 2021 40,362 1.80\nJanuary 25, 2021 through February 21, 2021 52,180 1.94\nFebruary 22, 2021 through March 28, 2021 73,800 1.90\nMarch 29, 2021 through April 19, 2021 38,599 1.82 -\nSeptember 23, 2021 through October 1, 2021 35,555 $ 69 $ 1.93 $ 931\nTotal shares repurchased for year ended October 3, 2021 449,088 $ 869 $ 1.93 $ 931\nOctober 4, 2021 through October 31, 2021 18,265 $ 37 $ 2.01 $ 894\nNovember 1, 2021 through November 28, 2021 4,415 2.04\nNovember 29, 2021 through January 2, 2022 14,558 1.93\nJanuary 3, 2022 through January 30, 2022 15,585 1.89\nJanuary 31, 2022 through February 27, 2022 27,618 1.75\nFebruary 28, 2022 through April 3, 2022 35,530 1.98\nApril 4, 2022 through May 1, 2022 12,304 2.22\nMay 2, 2022 through May 29, 2022 10,482 2.11\nMay 30, 2022 through July 3, 2022 49,657 1.90\nJuly 4, 2022 through July 25,2022 2.10\nJuly 26, 2022 through August 13, 2022 1,930 2.09\nTotal shares repurchased for twelve months ended October 2, 2022 190,954 $ 371 $ 1.94 $ 560\nFurthermore, on August 18, 2022, the Company announced the commencement of a tender offer to purchase up to $4.25 million in value of shares of its common stock. On September 15, 2022, the Companys modified Dutch auction tender offer expired. In accordance with the terms and conditions of the tender offer, the Company accepted for purchase 1,603,773 shares of common stock at a price of $2.65 per share, for an aggregate cost of approximately $4.25 million, excluding fees and expenses relating to the tender offer. The transaction cost associated with the tender offer was $111 thousand. The shares were immediately cancelled upon completion of the transaction.\nAs of October 2, 2022, and October 3, 2021, the total outstanding common shares were 6,716,638 and 8,488,149, respectively.\nWarrants\nOn August 26, 2016, Optex Systems Holdings Inc. issued 4,323,135 warrants to new shareholders and the underwriter, in connection with a public share offering. The warrants entitled the holder to purchase one share of our common stock at an exercise price equal to $1.50 per share at any time on or after August 26, 2016 (the Initial Exercise Date) and on or prior to the close of business on August 26, 2021 (the Termination Date).\nPursuant to a warrant agreement between Optex Systems Inc. and Equity Stock Transfer, LLC, as warrant agent, the warrants were issued in book-entry form and were initially represented only by one or more global warrants deposited with the warrant agent, as custodian on behalf of The Depository Trust Company, or DTC, and registered in the name of Cede & Co., a nominee of DTC, or as otherwise directed by DTC.\nThe exercise price and number of shares of common stock issuable upon exercise of the warrants could be adjusted in certain circumstances, including in the event of a stock split, stock dividend, extraordinary dividend on or recapitalization, reorganization, merger or consolidation.\nUnder the terms of the warrant agreement, Optex Systems Holdings Inc. agreed to use their best efforts to maintain the effectiveness of the registration statement and current prospectus relating to common stock issuable upon exercise of the warrants until the expiration of the warrants. During any period in which Optex failed to have an effective registration statement covering the shares underlying the warrants, the warrant holder was permitted to exercise the warrants on a cashless basis. The warrant holders did not have the rights or privileges of holders of common stock and any voting rights until they exercised their warrants and received shares of common stock, except as set forth in the warrants. After the issuance of shares of common stock upon exercise of the warrants, each holder was entitled to one vote for each share held of record on all matters to be voted on by stockholders.\nSubject to limited exceptions, a holder of warrants did have the right to exercise any portion of its warrants if the holder (together with such holders affiliates, and any persons acting as a group together with such holder or any of such holders affiliates) would beneficially own a number of shares of common stock in excess of 4.99% of the shares of our common stock then outstanding after giving effect to such exercise (the Beneficial Ownership Limitation); provided, however, that, upon notice to the Company, the holder could increase or decrease the Beneficial Ownership Limitation, provided that in no event could the Beneficial Ownership Limitation have exceeded 9.99% and any increase in the Beneficial Ownership Limitation would not be effective until 61 days following notice of such increase from the holder to us.\nNo fractional shares of common stock would be issued upon exercise of the warrants. If, upon exercise of the warrants, a holder would be entitled to receive a fractional interest in a share, Optex Systems Holdings Inc. would, upon exercise, round up to the nearest whole number of shares of common stock to be issued to the warrant holder. If multiple warrants were exercised by the holder at the same time, Optex Systems Holdings Inc. would aggregate the number of whole shares issuable upon exercise of all the warrants. There was no established trading market for the warrants.\nIn the event of a fundamental transaction (as defined in warrant), then the Company or any successor entity would pay at the holders option, exercisable at any time concurrently with or within 30 days after the consummation of the fundamental transaction, an amount of cash equal to the value of the remaining unexercised portion of the warrants on the date of consummation of the fundamental transaction as determined in accordance with the Black Scholes option pricing model.\nAs of September 27, 2020 there were 4,125,200 warrants outstanding. During the twelve months ended September 27, 2020, there were zero warrants exercised or repurchased. During the twelve months ended October 3, 2021, 188,809 of the warrants were exercised and zero warrants repurchased. On August 26, 2021, the remaining 3,936,391 warrants expired worthless. As of October 3, 2021 and October 2, 2022, there were zero outstanding warrants remaining.\nNote 12 - Warrant Liabilities\nOn August 26, 2016, Optex Systems Holdings, Inc. issued 4,323,135 warrants to new shareholders and the underwriter, in connection with a public share offering. The warrants entitle the holder to purchase one share of our common stock at an exercise price equal to $1.50 per share at any time on or after August 26, 2016, and on or prior to the close of business on August 26, 2021. The Company determined that these warrants are free standing financial instruments that are legally detachable and separately exercisable from the common stock included in the public share offering. Management also determined that the warrants are puttable for cash upon a fundamental transaction at the option of the holder and as such required classification as a liability pursuant to ASC 480 Distinguishing Liabilities from Equity. The Company had no plans to consummate a fundamental transaction and did not believe a fundamental transaction was likely to occur during the remaining term of the outstanding warrants. In accordance with the accounting guidance, the outstanding warrants were recognized as a warrant liability on the balance sheet and are measured at their inception date fair value and subsequently re-measured at each reporting period with changes being recorded as a component of other income in the consolidated statement of income.\nThe fair value of the warrant liabilities presented below were measured using either a BSM valuation model. Significant inputs into the respective model at the inception and reporting period measurement dates are as follows:\nSchedule of Warrant Liabilities Assumptions Used\nIssuance\ndate\nPeriod\nended\nPeriod\nended\nPeriod\nended\nPeriod\nended\nExpiration\ndate\nValuation Assumptions August 26,\nOctober 1,\nSeptember 30,\nSeptember 29,\nSeptember 27,\nAugust 26,\n2021(5)\nExercise Price(1) $ 1.50 $ 1.50 $ 1.50 $ 1.50 $ 1.50 $ 1.50\nWarrant Expiration Date (1) 8/26/2021 8/26/2021 8/26/2021 8/26/2021 8/26/2021 8/26/2021\nStock Price (2) $ 0.95 $ 0.98 $ 1.71 $ 1.56 $ 1.96 $ 1.49\nInterest Rate (annual) (3) 1.23 % 1.62 % 2.88 % 1.63 % 0.12 % -\nVolatility (annual) (4) 246.44 % 179.36 % 64.05 % 53.66 % 51.67 % -\nTime to Maturity (Years) 3.9 2.9 1.9 0.9 Expired\nCalculated fair value per share $ 0.93 $ 0.87 $ 0.82 $ 0.49 $ 0.62 $ -\n(1) Based on the terms provided in the warrant agreement to purchase common stock of Optex Systems Holdings, Inc. dated August 26, 2016.\n(2) Based on the trading value of common stock of Optex Systems Holdings, Inc. as of each presented period ending date. August 26, 2021 stock price based on the volume weighted average price for 618,451 share trades on that date. Closing price was $1.55 based trades of 2,400 final shares traded.\n(3) Interest rate for U.S. Treasury Bonds, as of each presented period ending date, as published by the U.S. Federal Reserve.\n(4) Based on the historical daily volatility of Optex Systems Holdings, Inc. as of each presented period ending date.\n(5) Warrants expired worthless without cashless exchange pursuant to the Warrant Agreement Section 2(c) determination that the August 26, 2021 VWAP calculation of $1.49 was below the exercise price of $1.50.\nThe warrants outstanding and fair values at each of the respective valuation dates are summarized below:\nSummary of Warrants Outstanding and Fair Values\nWarrants Fair Value Fair Value\nWarrant Liability Outstanding per Share (000s)\nFair Value as of period ended 9/27/2020 4,125,200 $ 0.62 $ 2,544\nReclassification to additional paid in capital on exercise of warrants (1) (188,809 )\n(9 )\nGain on Change in Fair Value of Warrant Liability (2) (3,936,391 )\n(2,535 )\nFair Value as of period ended 10/03/2021 $ - $ - $ -\n(1) Exercise of warrants for gross proceeds of $283 thousand and a warrant liability fair market value of $292 thousand as of the exercise date.\n(2) Expiration of Warrants on August 26, 2021.\nThe warrant liabilities are considered Level 3 liabilities on the fair value hierarchy as the determination of fair value includes various assumptions about of future activities and the Companys stock prices and historical volatility as inputs.\nNote 13 - Income Taxes\nThe income tax provision for the years ended October 2, 2022 and October 3, 2021 include the following:\nSchedule of Income Tax Provision\n(Thousands)\nCurrent income tax expense:\nCurrent year federal income tax $ 331 $ -\nPrior year tax adjustment - (62 )\nCurrent income tax expense (62 )\nDeferred income tax provision (benefit):\nFederal (39 )\nProvision for (Benefit from) income taxes, net $ 364 $ (101 )\nAs of October 2, 2022, Optex Systems Inc. has a net carrying value of $0.9 million in deferred tax assets represented by deferred tax assets of $1.8 million and a deferred tax asset valuation allowance of ($0.9) million against those assets. The valuation allowance has been established due to historical losses resulting in a Net Operating Loss Carryforward for each of the fiscal years 2010 through 2016 which may not be fully recognized due to an IRS Section 382 limitation related to a change in control occurring in fiscal year 2018. As of October 2, 2022 and October 3, 2021, we reviewed the deferred tax assets and determined it was more likely than not that we would be able to utilize a substantial portion of the deferred tax asset balance against future earnings. Our assumptions were based on the previous three years earnings trend as well as anticipated future earnings expected with the recent orders and increased backlog as of October 2, 2022. During the twelve months ended October 2, 2022, the Company recognized $0.03 million in tax expenses to deferred tax assets. During the twelve months ended October 3, 2021, the Company recognized ($0.04) million in tax benefits to deferred tax assets. We will continue to review the deferred tax assets and related valuation reserves in accordance with ASC 740 on an annual basis.\nThe income tax provision for Optex Systems as of October 2, 2022 and October 3, 2021 differs from those computed using the statutory federal tax rate in the respective years due to the following permanent differences:\nSchedule of Effective Income Tax Rate Reconciliation\n% %\nTax provision (benefit) at statutory federal rate $ 346 $ 426\nNondeductible expenses - (531 ) (26 )\nOther temporary adjustments (17 ) (1 )\nPrior year federal income tax adjustment - - (62 ) (3 )\nChange in deferred tax valuation allowance (155 ) (8 )\nProvision for (benefit from) income taxes, net $ 364 $ (101 ) (5 )\nDeferred income taxes recorded in the balance sheets result from differences between financial statement and tax reporting of income and deductions. A summary of the composition of the deferred income tax assets (liabilities) follows:\nSchedule of Deferred Income Taxes\nAs of\nOctober 2, 2022\nAs of\nOctober 3, 2021\n(Thousands)\nDeferred Tax Asset\nAs of\nOctober 2, 2022\nAs of\nOctober 3, 2021\nStock Compensation $ 76 $ 73\nInventory Reserve\nUnicap\nDeferred Compensation -\nFixed assets (219 ) (226 )\nGoodwill Amortization\nIntangible Asset Amortization\nContract Loss Reserve\nAccrued Paid Time Off\nNet Operating Losses 1,327 1,657\nOther\nSubtotal $ 1,785 $ 2,096\nValuation allowance (843 ) (808 )\nNet deferred asset $ 942 $ 1,288\nThe Company has a net loss carryforward of $6.3 million as of October 2, 2022 as compared to a net loss carryforward of $7.9 million as of October 3, 2021. Due to an IRS section 382 change in control limitation which was effective during the fiscal year ended 2017, it is anticipated that the Company may only realize $2.3 million of the current net operating loss carryforward for a net tax benefit of $0.5 million through fiscal year ending in 2037. For the year ended October 3, 2021, the Company realized a ($1.4) million net operating tax loss which was not subject to the IRS section 382 limitation and was available for a tax loss carryback up to five years. During the twelve months ended October 2, 2022, the Company recovered $0.3 million in cash for a tax refund related to the net operating loss carryback from the prior October 3, 2021 year end.\nThe Company applied FASB ASC 740-10 and has no unrecognized tax benefits. By statute, the tax years ended October 2, 2022, October 3, 2021 and September 27, 2020 are open to examination by the major taxing jurisdictions to which the Company is subject.\nDuring the twelve months ended October 2, 2022 the Company paid zero in income taxes, received a tax refund of $312 thousand for fiscal year 2021 operating loss carrybacks, and recorded a current year federal income tax liability of $331 thousand. During the twelve months ended October 3, 2021 the Company paid $48 thousand in income taxes, and had a net tax refund due related to the fiscal year 2021 tax year of ($48) thousand included in prepaid expenses.\nNote 14 - Subsequent Events\nOn November 21, 2022, the Company issued an Amended and Restated Revolving Line of Credit Note to PNC Bank, National Association, in connection with an increase of the Borrowers revolving line of credit facility from $1.125 million to $2.0 million under the Borrowers existing Amended and Restated Loan Agreement with the Lender. The maturity date remains April 15, 2023. Obligations outstanding under the credit facility will accrue interest at a rate equal to the Lenders prime rate minus 0.25%.\nOn November 28, 2022, the Company entered into a new employment agreement with Danny Schoening. Pursuant to the agreement, which is dated as of December 1, 2022, Mr. Schoening will continue to serve as the Companys President and Chief Executive Officer through November 30, 2025. Mr. Schoenings base salary initially is $304,912 per annum, and will be increased to $314,060 on December 1, 2023 and $323,481 on December 1, 2024. Mr. Schoening will be eligible for a performance bonus based on a one-year operating plan adopted by the Companys Board of Directors (the Board). The bonus will be based on financial and/or operating metrics decided annually by the Board or the Compensation Committee and tied to such one-year plan. The target bonus will equate to 30% of Mr. Schoenings base salary. The Board will have discretion in good faith to alter the performance bonus upward or downward by 20%.\nThe updated employment agreement also served to amend Mr. Schoenings RSU Agreement, dated January 2, 2019, which had been previously amended as of December 1, 2021, by changing the third and final vesting date for the restricted stock units granted under such agreement from the change of control date to January 1, 2023. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs of October 2, 2022, management performed, with the participation of our Principal Executive Officer and Principal Financial Officer, an evaluation of the effectiveness of our disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act. Our disclosure controls and procedures are designed to ensure that information required to be disclosed in the report we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SECs forms, and that such information is accumulated and communicated to our management including our Principal Executive Officer and our Principal Financial Officer, to allow timely decisions regarding required disclosures. Based on the evaluation, our Principal Executive Officer and our Principal Financial Officer concluded that, as of October 2, 2022, our disclosure controls and procedures were effective.\nChanges in Internal Control Over Financial Reporting\nDuring the quarter ended October 2, 2022, there were no changes in our internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagements Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with GAAP. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projection of any evaluation of effectiveness to future periods is subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement has conducted, with the participation of our Principal Executive Officer and our Principal Financial Officer, an assessment, including testing of the effectiveness, of our internal control over financial reporting as of October 2, 2022. Managements assessment of internal control over financial reporting was conducted using the criteria in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis. In connection with our managements assessment of our internal control over financial reporting as required under Section 404 of the Sarbanes-Oxley Act of 2002, we have not identified any material weaknesses in our internal control over financial reporting as of October 2, 2022. We have thus concluded that our internal control over financial reporting was effective as of October 2, 2022. Item 9B. Other Information\nOn December 16, 2022, our director Lawrence Hagenbuch notified us that he will not be standing for re-election at the 2023 annual meeting of shareholders.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this Item 10 will be included in the Proxy Statement or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference. Item 11. Executive Compensation\nThe information required by this Item 11 will be included in the Proxy Statement or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item 12 will be included in the Proxy Statement or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this Item 13 will be included in the Proxy Statement or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference. Item 14. Principal Accountant Fees and Services\nThe information required by this Item 14 will be included in the Proxy Statement or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference. Item 15. Exhibits\n(a)(1)\nFinancial Statements. The following financial statements of Optex Systems Holdings, Inc. are included in Part II, Item 8:\nReport of Independent Registered Public Accounting Firm\nConsolidated Statements of Income for the years ended October 2, 2022 and October 3, 2021\nConsolidated Balance Sheets as of October 2, 2022 and October 3, 2021\nConsolidated Statement of Stockholders Equity for the years ended October 2, 2022 and October 3, 2021\nConsolidated Statements of Cash Flows for the years ended October 2, 2022 and October 3, 2021\nNotes to the Consolidated Financial Statements\n(a)(2) Financial Statement Schedules.\nAll schedules are omitted because they are not applicable, or not required, or because the required information is included in the consolidated financial statements or notes thereto.\n(a)(3) Exhibits.\nSee Exhibit Index\nExhibits\nExhibit No.\nDescription\n2.1\nAgreement and Plan of Reorganization, dated as of the March 30, 2009, by and between registrant, a Delaware corporation and Optex Systems, Inc., a Delaware corporation(1)\n3.1\nCertificate of Incorporation, as amended to date(13)\n3.2\nBylaws of Optex Systems Holdings(1)\n3.3\nCharters of the Audit Committee, Compensation Committee and Nominating Committee(6)\n4.1\nDescription of Capital Stock(13)\n4.2\nSpecimen Stock Certificate(2)\n10.1\nLease for 1420 Presidential Blvd., Richardson, TX(1).\n10.2\nThird Amendment to Lease, between Aquiport DFWIP and Optex Systems, Inc., dated January 7, 2010(3)\n10.3\nRestricted Stock Unit Plan(7)\n10.4\nForm of RSU Agreement(7)\n10.5\nEmployment Agreement with Karen Hawkins, dated as of August 1, 2016(5)\n10.6\nForm of Lease(8)\n10.7\nForm of Letter of Credit(8)\n10.8\nForm of Award/Contract between the Company and US DLA, dated July 3, 2017(9)\n10.9\nEmployment Agreement with Danny Schoening, dated December 1, 2021(10)\n10.10\nSixth Amendment to Lease Agreement(13)\n10.11\nFirst Amendment to Lease(13)\n10.13\nBBVA Business Loan Agreement(11)\n10.14\nBBVA Letter of Credit(13)\n10.15\nAmended and Restated Loan Agreement dated as of April 12, 2022 by and among Optex Systems Holdings, Inc., Optex Systems, Inc., and PNC Bank, National Association (12)\n10.16\nAmended and Restated Line of Credit Note dated as of November 21, 2022 by and among Optex Systems Holdings, Inc., Optex Systems, Inc. and PNC Bank, National Association (14)\n10.16\n2009 Stock option Plan(4)\n14.1\nCode of Ethics(2)\n21.1\nList of Subsidiaries - Optex Systems, Inc.(1)\n31.1\nCertifications pursuant to Section 302 of Sarbanes Oxley Act of 2002\n31.2\nCertifications pursuant to Section 302 of Sarbanes Oxley Act of 2002\n32.1\nCertifications pursuant to Section 906 of Sarbanes Oxley Act of 2002\n32.2\nCertifications pursuant to Section 906 of Sarbanes Oxley Act of 2002\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n(1) Incorporated by reference from our Current Report on Form 8-K dated April 3, 2009.\n(2) Incorporated by reference from our Registration Statement on Form S-1 filed on May 19, 2009.\n(3) Incorporated by reference from our Amendment No. 4 to Registration Statement on Form S-1 filed on June 14, 2010.\n(4) Incorporated by reference from our Current Report on Form 8-K dated April 3, 2009.\n(5) Incorporated by reference from our Current Report on Form 8-K, filed on August 10, 2016.\n(6) Incorporated by reference from our Amendment No. 1 to Registration Statement on Form S-1 filed on July 23, 2015.\n(7) Incorporated by reference from our Current Report on Form 8-K, filed on June 17, 2016.\n(8) Incorporated by reference from our Current Report on Form 8-K, filed on November 23, 2016.\n(9) Incorporated by reference from our Current Report on Form 8-K, filed on July 10, 2017.\n(10) Incorporated by reference from our Current Report on Form 8-K, dated December 7, 2021.\n(11) Incorporated by reference from our Current Report on Form 8-K, dated April 20, 2020.\n(12) Incorporated by reference from our Current Report on Form 8-K, dated April 12, 2022.\n(13)\nIncorporated by reference from our Annual Report on Form 10-K for the year ended October 3, 2021.\n(14)\nIncorporated by reference from our Current Report on Form 8-K, dated November 21, 2022.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nOPTEX SYSTEMS HOLDINGS, INC.\nBy: /s/ Danny Schoening\nDanny Schoening, Principal Executive Officer and Director\nDate: December 19, 2022\nBy: /s/ Karen Hawkins\nKaren Hawkins, Principal Financial Officer and Principal Accounting Officer\nDate: December 19, 2022\nPursuant to the requirements of the Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Danny Schoening\nDanny Schoening\nChairman, Principal Executive Officer and Director\nDecember 19, 2022\n/s/ Karen Hawkins\nKaren Hawkins\nPrincipal Financial Officer and Principal Accounting Officer\nDecember 19, 2022\n/s/ Larry Hagenbuch\nLarry Hagenbuch\nDirector\nDecember 19, 2022\n/s/ Rimmy Malhotra\nRimmy Malhotra\nDirector\nDecember 19, 2022\n/s/ Dale Lehmann\nDale Lehmann\nDirector\nDecember 19, 2022\n/s/ Dayton Judd\nDayton Judd\nDirector\nDecember 19, 2022"
}