{
    "cik": "1404935",
    "company": "THC Therapeutics, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-11-25",
    "period_of_report": "2022-07-31",
    "sic": "3523",
    "state_of_inc": null,
    "state_location": "NV",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1404935/0001477932-22-008875-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1404935/000147793222008875/thct_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1404935/0001477932-22-008875.txt",
    "filename": "1404935_10K_2022_0001477932-22-008875.htm",
    "content": "Item 1. Business\nOverview\nTHC Therapeutics, Inc. (the Company), was incorporated in the State of Nevada on May 1, 2007, as Fairytale Ventures, Inc., and later changed its name to Aviation Surveillance Systems, Inc. and Harmonic Energy, Inc. On January 23, 2017, the Company changed its name to THC Therapeutics, Inc. On January 17, 2018, the Company changed its name to Millennium Blockchain Inc. On September 28, 2018, the Company changed its name back to THC Therapeutics, Inc. THC Therapeutics, Inc., together with its subsidiaries, is collectively referred to herein as the Company, and THC Therapeutics.\nThe Company is focused on developing a sanitizing herb dryer, the dHydronator®, which has been specifically designed for the drying and sanitizing (i.e., reducing the bacterial count) of freshly harvested cannabis, and other herbs, flowers, and tea leaves.\nCorporate History\nTHC Therapeutics, Inc., was incorporated in the State of Nevada on May 1, 2007, as Fairytale Ventures, Inc., as a development stage company with plans to provide products and services related to themed childrens parties, and later changed its name to Aviation Surveillance Systems, Inc., when the Company shifted its business plan to focus on merging with an operating firm, and Harmonic Energy, Inc., when the Company shifted its plan of operations again, instead focusing on oil and gas operations.\nOn January 23, 2017, the Company experienced a change of control, and new management determined to shift the Companys focus and changed the Companys name to THC Therapeutics, Inc., focusing on wellness operations and development of a herb dryer for use with cannabis. On May 30, 2017, the Company formed Genesis Float Spa LLC, a wholly-owned subsidiary, to market its float spa assets purchased for wellness centers. On January 17, 2018, the Company changed its name to Millennium BlockChain Inc. and began to also focus on acquiring digital equity or digital assets of blockchain technology companies. On September 28, 2018, because of the regulatory environment surrounding blockchain technology companies, the Company changed its name back to THC Therapeutics, Inc., abandoned its blockchain technology focus, and refocused its efforts on its wellness operations.\nThe Companys fiscal year end is July 31st, its telephone number is (833) 420-8428, and the address of its principal executive office is 11700 W Charleston Blvd. #73, Las Vegas, Nevada, 89135.\nDescription of Business\nThe Company is focused on operations in the wellness industry. The Company is developing a sanitizing herb dryer, the dHydronator®, with multiple design, function, and usage patents. This innovative, laboratory-proven product is specifically designed for the drying and sanitizing (i.e., reducing the bacterial count by using ultraviolet light) of freshly harvested cannabis, and other herbs, flowers, and tea leaves. The dHydronator® can reduce moisture content of cannabis to 10-15% in only 10-14 hours. Traditional herbal drying times can take up to two weeks. Additionally, after the Company has launched the dHydronator®, and depending on available funding, the Company intends to establish a float spa facility that will allow each guest to customize their wellness experience, at their own pace, based on their individual needs.\nWellness Operations\nTHC Therapeutics is focused on the wellness industry, with plans to develop a patented herb dryer as well as an innovative float spa facility in Las Vegas, Nevada, or southern California.\nThe Company is developing a sanitizing herb dryer, the dHydronator®, with multiple design, function, and usage patents. This innovative, laboratory-proven1 product is specifically designed for the drying and sanitizing (i.e., reducing the bacterial count by using ultraviolet light) of freshly harvested cannabis, and other herbs, flowers, and tea leaves. The dHydronator® can reduce moisture content of cannabis to 10-15% in only 10-14 hours. Traditional herbal drying times can take up to two weeks. The dHydronator® can also significantly reduce the bacterial count of the cannabis during the drying process, but it will not eliminate all bacteria from the cannabis or other plant materials.\nThe Company has a functioning prototype of the dHydronator®, which is now protected by a patent with the United States Patent and Trademark Office (see Patent, Trademark, License & Franchise Restrictions and Contractual Obligations & Concessions below), and once the Company has sufficient funds available, the Company plans to source parts for serial manufacturing and negotiate and secure serial manufacturing and assembly. The Company also plans to hire sales and marketing staff as funds are available.\n________________\n1 Tests were conducted in 2016-2017 by independent cannabis-testing labs: first by CannLabs on the first-generation dHydronator® prototype, and later by Digipath Labs on the second-generation prototype. Optimal cannabis moisture content is 8-12%. The initial testing by CannLabs showed that (i) moisture content across five wet cannabis samples was reduced to an average moisture content of 13.81% with a standard deviation of 4.04% after 12 hours of drying, and 8.86% with a standard deviation of 2.25% after 16 hours of drying, and (ii) after autoclaving cannabis flowers to ensure sterility and then spiking multiple samples with 100 CFU of E. Coli and Salmonella bacteria and Aspergillus niger mold, testing for the presence of the bacteria and mold by both quantitative polymerase chain reaction (qPCR) and traditional plating methods, which testing concluded that the dHydronator® prototype eliminated or reduced the bacteria and mold contamination, but did not quantify the results. The subsequent testing by Digipath Labs on the second-generation prototype covered multiple strains and independent tests to confirm the prior findings. The strains tested were Lucy Diamond, Cotton Candy, Blue Dream, Kings Cut, Pot of Gold and Diablo. The optimal drying time was determined to be 10-14 hours in the first test. The Companys proprietary sanitizing technology brought the failing TAC (total aerobic count) from over 300,000 CFU/g down to 78,000 CFU/g (anything less than 100,000 CFU/g is considered passing) in the second test. In the third test, after drying 14 hours and 15.5 hours in the dHydronator® and using the Companys proprietary sanitizing technology for a longer period than required, the moisture content had been reduced from 80% (at 0 hours) to 10.89% (at 14 hours) and 8.83% (at 15.5 hours), the THCA% had been reduced from 21.2% (at 0 hours) to 17.26% (at 14 hours) and 18.26% (at 15.5 hours), and the TAC had been reduced from 210,000 CFU/g (at 0 hours) to 1,500 CFU/g (at 14 hours) and 500 CFU/g (at 15.5 hours). In the fourth experiment, after 12 hours and 15.5 hours of drying in the dHydronator® and using the proprietary sanitizing technology for a longer period than required, the moisture content had reduced from 80% to 12.00% (at 12 hours) and 7.44% (at 15.5 hours), the THCA% had been reduced from 21.2% to 20.08% (at 12 hours) and 19.43% (at 15.5 hours), and the TAC had been reduced from 190,000 CFU/g to 51,000 CFU/g (at 12 hours) and 2,300 CFU/g (at 15.5 hours). After 14 hours of drying, the moisture content had been reduced to 8.15%, the THCA% had been reduced to 19.82%, and the TAC had been reduced to 21,000 CFU/g. In the fifth test, prior moisture and THCA% results were tested, but this time using the Companys proprietary sanitizing technology for a much shorter time period, using two samples of a different cannabis strain, and testing the expanded cannabinoid profile data of each sample, and after 12 hours of drying two different samples, moisture content for the two samples decreased from 74% and 74% to 9.17% and 9.90%, respectively, and THCA% increased from 14.45% and 14.94% before drying to 16.81% and 17.2%, respectively, after 12 hours of drying. Test six was a test of the same strain as test five but using a different lot of plant material, and moisture content decreased from 81% to 11.5% after 12 hours of drying, while TCHA% increased from 21.28% to 22.6% after 12 hours of drying. The seventh through ninth tests confirmed prior results.\nMore specifically, once we have at least $2,000,000 in in available cash flow or funds from other operations and if we receive the patent, we intend to engage in further development efforts as follows: (i) finalizing case design, with an estimated tooling expense of approximately $300,000-$500,000; manufacturing pre-production units for field testing and presentation to potential partners and distributors, with an estimated expense of $250,000; (iii) hiring a subject-matter expert and consultants or employees in the home herb garden and legal cannabis marketplace to manage the development and sales of herb dryer, with an estimated expense of $400,000 for 12 months; (iv) engaging in further detailed laboratory of our herb drying with respect to cannabis plants and home herb garden plants, with an estimated expense of $50,000 to $100,000 for 12 months; (v) establishing a relationship with a market research and/or marketing company to explore creative strategies, advertising concepts, and consumer opinion, explore applications of our intellectual property in the existing wholesale and retail distribution channels for home herb, garden products and legal cannabis markets, and determine the best path for sales, distribution and licensing of our intellectual property, with an estimated expense of $1,000,000 for 12 months.\nAdditionally, on May 12, 2017, the Company entered into an asset purchase agreement with a third party under which it acquired four (4) float spa units and associated equipment. With the acquisition of these assets, the Company intended to establish a float spa facility that will allow each guest to customize their wellness experience, at their own pace, based on their individual needs. Once we have approximately $500,000-$1,000,000 in available cash flow or funds from other operations, and after the launch of our dHydronator® sanitizing herb dryer, we plan to capitalize on our spa assets purchased in 2017 by (i) leasing a 2,500 to 5,000 square foot facility in Nevada or California, to be built out as needed (and with the size of the facility dependent on available capital); (ii) obtaining necessary licenses and permits, (iii) purchasing inventory, equipment, furnishings and supplies, including inventory, fixtures, furnishings and equipment for an oxygen bar and a Kampuchea, juice and tea Bar, refrigeration and storage equipment, point of sale computers and tablets, digital monitors, signage and display materials, and other suppliers; (iv) hiring spa management personnel including a manager, assistant manager and two spa attendants; (v) hiring marketing and sales consultants, and (vi) launching a marketing campaign to include internet lead services, Groupon and social networking.\nCompetition\nThere are a number of commercial herb dryers sold by competitors, including Yofumo Technologies, which are already commercially available, and which have significant market share. As to our float spa plans, we believe True Rest Float Spa, which has over 20 spa locations across the country, is our primary national competitor, and there are numerous locally owned float spas throughout the country that would considered competitors with our spa operations. There is no assurance that we will be able to compete effectively with any of these competitors.\nMarket Opportunity\nThe Companys herb dryer, the dHydronator®, safely lowers moisture content and sanitizes without harm to the integrity of the plant. Our test results have been proven to dry cannabis in less than 14 hours verses up to 14 days using traditional drying methods. Test results indicate the removal of many surface germs and bacteria including powder mold, dust mites and spider mites from herbs, plants, the surface of glass or ceramic herbal tea accessories, and any other object that fits safely in the drying chamber. Therefore, we believe that our product will be attractive to the cannabis and home herb and garden product markets.\nWith regard to floatation therapy, the sensory deprivation consumer typically ranges in age from eighteen to eighty. Floatation therapy is a service that is unisex in its appeal and attracts many. As many consumers seek natural alternative therapies for the relief from pain, stress and sleep disorders that affect a significant percentage of the population, we believe that our planned floatation therapy spa facilities will be attractive to these consumers.\nMarketing Strategy\nWe plan to attend regional cannabis-related trade shows and offer field testing to legal cannabis growers and suppliers in the United States and Canada initially, and throughout the world once the technology has been adopted in the regional market. We also plan to establish a relationship with a market research and marketing company to explore creative strategies, advertising concepts, consumer opinion, existing distribution and sales channels and potential licensing of our intellectual property, to determine the best path for sales and distribution. We also intend to hire subject matter expert consultants or employees in the legal cannabis and home herb marketplace to manage the development and sales of our products. Once our marketing experts identify an herbal or commercial agriculture niche or venue to enter or solicit, we will market to distributors and retailers via trade shows and direct contact.\nWith regard to our spa plans, we intend to launch internet, Groupon and social networking campaigns offering coupons and membership plans for floatation therapy, and our planned oxygen bar and Kampuchea, juice and tea bar. We plan to invite local TV and Radio personalities to tour our facilities, and we plan to offer local healthcare and rehabilitation service providers and non-competitive spa owners and managers a private tour of our spa facilities.\nCustomers\nDue to the nature of its business and its focus on development of its patent-pending herb dryer, the Company does not currently have any customers.\nPatent, Trademark, License & Franchise Restrictions and Contractual Obligations & Concessions\nThe Company has acquired the exclusive intellectual property rights to the dHydronator® sanitizing plant dryer with improved convection flow from the Companys CEO and Director, Brandon Romanek. Mr. Romaneks father irrevocably assigned those intellectual property rights to Mr. Romanek in 2016. A trademark application for the mark dHyrdonator has been filed (serial no. 86874611), and a patent application was filed with the United States Patent and Trademark Office (USPTO), docket number 5503.101 (application nos. 15/467,722 and 62/312,327), for 20 separate herb dryer design, function, and usage patents. On or about July 20, 2018, the Companys patent counsel received a Notification of Allowance from the USPTO, notifying the Company that the USPTO would be allowing all 20 claims, and on or about November 20, 2018, the USPTO granted the final patent (patent no. 10,132,56), the Company was subsequently notified of the patent grant, and the patent has been recorded with the USPTO as being assigned to the Company.\nGovernmental Regulations\nWe will be governed by government laws and regulations governing spas. We do not believe the dHydronator® will be subject to regulation by the U.S. Food and Drug Administration or any other government agency (other than pursuant to general laws governing truth in advertising or similar laws under the purview of the Federal Trade Commission). We believe that we are currently in compliance with all laws which govern our operations and have no current liabilities thereunder. Our intent is to maintain strict compliance with all relevant laws, rules and regulations.\nEmployees\nThe Company currently has one full-time employee, our founder, CEO and director, Brandon Romanek.\nReports to Security Holders\nThe Company intends to furnish its stockholders with annual reports containing consolidated financial statements audited by its independent registered public accounting firm and to make available quarterly reports containing unaudited consolidated financial statements for each of the first three quarters of each year. The Company files Quarterly Reports on Form 10-Q, Annual Reports on Form 10-K and Current Reports on Form 8-K with the Securities and Exchange Commission in order to meet its timely and continuous disclosure requirements. The Company may also file additional documents with the Commission if those documents become necessary in the course of its operations.\nThe public may read and copy any materials that the Company files with the SEC at the SECs Public Reference Room at 100 F Street, NE, Washington, D.C. 20549. The public may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The site address is www.sec.gov.\nAvailable Information\nAll reports of the Company filed with the SEC are available free of charge through the SECs website at www.sec.gov. In addition, the public may read and copy materials filed by the Company at the SECs Public Reference Room located at 100 F Street, N.E., Washington, D.C. 20549. The public may also obtain additional information on the operation of the Public Reference Room by calling the Commission at 1-800-SEC-0330. Item 1A. Risk Factors.\nThe Company, as a smaller reporting company (as defined by Rule 12b-2 of the Exchange Act), is not required to furnish information required by this item. However, the following important factors among others, could cause our actual operating results to differ materially from those indicated or suggested by forward-looking statements made in this Annual Report on Form 10-K or presented elsewhere by management from time to time.\nThere are numerous and varied risks, known and unknown, that may prevent us from achieving our goals. If any of these risks actually occur, our business, financial condition or results of operation may be materially adversely affected. In such case, the trading price of our common stock could decline, and investors could lose all or part of their investment.\nThere is substantial doubt about our ability to continue as a going concern\nWe have not generated any revenues or profit during the years ended July 31, 2022 and 2021. We expect that our operating expenses will increase over the next twelve months to continue our development activities. Based on our average monthly expenses and current burn rate, we estimate that our cash on hand will not sufficiently support our operation for the next twelve months. If we cannot raise the money that we need in order to continue to operate our business, we will be forced to delay, scale back or eliminate some or all of our proposed operations. If any of these were to occur, there is a substantial risk that our business would fail. If we are unsuccessful in raising additional financing, we may need to curtail, discontinue or cease operations.\nWe have had a history of losses and may incur future losses, which may prevent us from attaining profitability.\nWe have had a history of operating losses since our inception and, as of July 31, 2022, we had an accumulated deficit of approximately $38 million. We may incur operating losses in the future, and these losses could be substantial and impact our ability to attain profitability. We expect to significantly increase expenditures for product development, general and administrative expenses, and sales and marketing expenses, and there is no guarantee that we will ever generate revenues, or that we ever achieve or sustain profitability or positive operating cash flows. Even if we achieve profitability and positive operating cash flows, we may not be able to sustain or increase profitability or positive operating cash flows on a quarterly or annual basis.\nFederal drug regulation and enforcement may adversely impact our operations.\nCurrently, there are approximately 37 states plus the District of Columbia that have laws and/or regulation that recognize in one form or another legitimate medical uses for cannabis and consumer use of cannabis in connection with medical treatment, and there are approximately 18 states and the District of Columbia that have more expansive laws legalizing marijuana for recreational use. Conversely, under the Controlled Substances Act (the CSA), the policy and regulations of the Federal government and its agencies is that cannabis has no medical benefit and a range of activities including cultivation and use of cannabis for personal use is prohibited. Until Congress amends the CSA with respect to medical marijuana, there is a risk that federal authorities may enforce current federal law.\nAs we plan on marketing our herb dryer to the cannabis industry, federal enforcement of federal law would adversely affect the cannabis industry and would therefore adversely affect the Companys planned operations and sales. Active enforcement of the current federal regulatory position on cannabis may thus indirectly and adversely affect revenues and profits of the Company.\nOur products may become subject to regulation by the FDA, which would materially increase the costs associated with developing the products.\nWe do not believe our dHydronator® herb dryer product will be subject to regulation by the U.S. Food and Drug Administration (the FDA) or any other government agency (other than pursuant to general laws governing truth in advertising and similar laws under the purview of the Federal Trade Commission). The FDA could disagree and determine that the dHydronator® is subject to FDA regulation.\nThe process for obtaining regulatory approval to market products regulated by the FDA is expensive, time-consuming, and can vary substantially based on the type, complexity, and novelty of the product candidates involved. Our ability to generate revenues from the sale of the dHydronator® would be adversely affected if we are delayed because our product is subject to FDA regulation, or if we are unable to successfully develop our products to comply with FDA regulation.\nWe may not be able to achieve our strategic initiatives and grow our business as anticipated.\nIn September 2018, we determined to focus on our sanitizing herb dryer and floatation spa plans. Our strategic initiatives have required us to devote financial and operational assets to these activities. Our success depends on our ability to appropriately manage our expenses as we execute on our planned initiatives. If we are not able to execute on this strategy successfully, our business may not grow as we anticipate, which could adversely affect our operating results.\nWe have a history of changing and discontinuing operations and have retained obligations associated with discontinued activities.\nWe have changed our name and business plan multiple times since our inception in 2007, and have a history of discontinued operations. We have carried liabilities of approximately $60,580 associated with discontinued operations, and there is no guarantee that we will not change our business plan in the future and discontinue current operations.\nIf we were deemed an investment company under the Investment Company Act, applicable restrictions could have a material adverse effect on our business.\nWe do not believe that we are an investment company under the Investment Company Act of 1940, as amended (the Investment Company Act), because we believe we are covered by the Rule 3a-2 safe harbor promulgated under the Investment Company Act.\nSection 3(a)(1)(A) of the Investment Company Act defines the term investment company to mean any issuer that is or holds itself out as being engaged primarily, or proposes to engage primarily, in the business of investing, reinvesting, or trading in securities. Section 3(a)(1)(C) of the Investment Company Act defines investment company as any issuer which is engaged or proposes to engage in the business of investing, reinvesting, owning, holding, or trading in securities, and owns or proposes to acquire investment securities having a value exceeding 40 per centum of the value of such issuers total assets (exclusive of Government securities and cash items) on an unconsolidated basis. Generally, any issuer meeting the definition of an investment company is subject to all applicable provisions of the Investment Company Act and must register with the Commission under Section 8 of the Investment Company Act, unless it meets the terms and conditions of various exceptions provided by the Investment Company Act including, but not limited to, those provided in Section 3(c) of the Investment Company Act, or in rules adopted by the SEC under the Investment Company Act.\nRule 3a-2 promulgated by the SEC under the Investment Company Act generally provides that, for purposes of Sections 3(a)(1)(A) and 3(a)(1)(C) of the Investment Company Act, an issuer will not be deemed to be engaged in the business of investing, reinvesting, owning, holding or trading in securities for a period not to exceed one year if the issuer has a bona fide intent to be engaged in a non-investment company business. This rule is intended to enable the issuer to make an orderly transition to a non-investment company business during the one-year safe harbor period.\nWhile we previously acquired rights to equity and digital tokens of other companies, with those rights having a value exceeding 40% of our total assets, we determined in September of 2018 that we would focus our operational efforts on developing and launching our sanitizing herb dryer and would no longer engage in the business of acquiring blockchain-related assets. As of January 31, 2019, all of our rights to equity and digital tokens of other companies had been fully impaired and had nominal value pursuant to the relevant accounting guidance, and in May and June of 2019, we rescinded all of our agreements to acquire rights to equity and digital tokens of other companies. As those agreements have been legally rescinded, it is as if we never acquired any rights to equity or digital tokens. As a result, we believe we were never an investment company and are covered by the Rule 3a-2 safe harbor.\nHowever, if we were to be deemed an investment company, we would be required to register as an investment company or adjust our business strategy and assets. If we were required to register as an investment company under the Investment Company Act, we would incur substantial expenses associated with such registration, and we would become subject to substantial regulation with respect to our capital structure, management, operations, transactions with affiliated persons, asset composition, including restrictions with respect to diversification and industry concentration, and other matters, which would have a material adverse effect on our business.\nIf we fail to protect our intellectual property, then our ability to compete could be negatively affected, which would harm our financial condition and operating results.\nWe have acquired the rights to our sanitizing herb dryer, the dHydronator®, from our CEO, Mr. Romanek, and the herb dryer has received patent protection. There is no guarantee that we will be able to maintain the patent in the future.\nWe believe that the market for the dHydronator® depends to a significant extent upon the goodwill and patent protection afforded by the patent protection covering the dHydronator®. In addition, the laws of certain foreign countries may not protect our intellectual property rights to the same extent as the laws of the United States. The failure to maintain the patent for the dHydronator®, or the loss or infringement of our patent rights would impair the goodwill associated with the dHydronator® and harm our reputation, which would harm our financial condition and operating results.\nIf our intellectual property is not adequate to provide us with a competitive advantage or to prevent competitors from replicating our products, or if we infringe the intellectual property rights of others, then our financial condition and operating results would be harmed.\nOur future success and ability to compete in the herb drying market depends upon our ability to produce a sanitizing herb dryer, which we attempt to protect under a combination of patent and trade secret laws, confidentiality procedures and contractual provisions. However, we have not yet been issued a patent, and even if we are, the legal protections afforded by patent law and contractual proprietary rights in our products provide only limited protection and may be time-consuming and expensive to enforce or maintain. Further, despite our efforts, we may be unable to prevent third parties from infringing upon or misappropriating our proprietary rights or from independently developing non-infringing products that are competitive with, equivalent to or superior to our herb dryer.\nMonitoring infringement or misappropriation of intellectual property can be difficult and expensive, and we may not be able to detect every infringement or misappropriation of intellectual property rights. Even if we do detect infringement or misappropriation of our proprietary rights, litigation to enforce these rights could cause us to divert financial and other resources away from our business operations. Further, the laws of some foreign countries do not protect our proprietary rights to the same extent as do the laws of the United States.\nAdditionally, third parties may claim that our herb dryer infringes upon their intellectual property rights, and there can be no assurance that one or more of our products will not be found to infringe upon third-party intellectual property rights in the future.\nOur products may be subject to recalls.\nManufacturers and distributors of products are sometimes subject to the recall or return of their products for a variety of reasons, including product defects, such as contamination, unintended harmful side effects or interactions with other substances, packaging safety and inadequate or inaccurate labeling disclosure. If our sanitizing herb dryer, the dHydronator®, is recalled due to an alleged product defect or for any other reason, we could be required to incur the unexpected expense of the recall and any legal proceedings that might arise in connection with the recall. We may lose a significant amount of sales and may not be able to replace those sales at an acceptable margin, or at all. In addition, a product recall may require significant management attention and adversely affect our other operations.\nAdditionally, if our herb dryer were subject to recall, the goodwill associated with that product and with us could be harmed. A recall would likely lead to decreased demand for our herb dryer, but it could also materially and adversely effect our spa as well and the perception of our company as a whole. Additionally, product recalls may lead to increased scrutiny of our operations by regulatory agencies, requiring further management attention and potential legal fees and other expenses. Furthermore, any product recall affecting the cannabis industry more broadly could lead consumers to lose confidence in the safety and security of products sold by other participants in the industry, which could have a material adverse effect on our business, financial condition and results of operations.\nOur future success depends on our ability to retain our chief executive officer and other key executives and to attract, retain and motivate qualified personnel.\nWe are highly dependent on Brandon Romanek, our Chief Executive Officer. Although we have entered into an employment agreement with Mr. Romanek providing for certain benefits, including severance in the event of a termination without cause, this agreement does not prevent him from terminating his employment with us at any time. We do not maintain key person insurance for any personnel. The loss of the services of Mr. Romanek could impede the achievement of our herb dryer and spa research, development, commercialization and acquisition objectives.\nIn addition, we rely on consultants and advisors, to assist us in formulating our development and commercialization strategy. Our consultants and advisors may be employed by employers other than us and may have commitments under consulting or advisory contracts with other entities that may limit their availability to us.\nWe will need additional funding if we intend on executing our operational plans and making future acquisitions. If we are unable to raise capital when needed, we would be forced to delay, reduce or eliminate our planned development.\nWe expect our expenses to increase in connection with our ongoing activities. Furthermore, upon the effectiveness of this Registration Statement, we expect to incur additional costs associated with operating as a mandatory filer under the Securities Exchange Act of 1934, as amended (the Exchange Act). Accordingly, we will need to obtain substantial additional funding in connection with our continuing operations. If we are unable to raise capital when needed or on attractive terms, we would be forced to delay, reduce or eliminate some or all of our herb dryer and spa development plans.\nRaising additional capital may cause dilution to our stockholders, restrict our operations or require us to relinquish rights to our technologies or other assets.\nUntil the time, if ever, that we can generate substantial product revenues, we plan to finance our cash needs through some combination of equity offerings, debt financings, collaborations, strategic alliances and licensing arrangements. We do not have any committed external source of funds. To the extent that we raise additional capital through the sale of equity or convertible debt securities, the ownership interest of our existing stockholders will be diluted, and the terms of these new securities may include liquidation or other preferences that adversely affect the rights of our existing stockholders. Debt financing, if available, may involve agreements that include covenants limiting or restricting our ability to take specific actions, such as incurring additional debt, making capital expenditures or declaring dividends.\nOur common stock is subject to the SECs penny stock rules, which may make it difficult for broker-dealers to complete customer transactions and could adversely affect trading activity in our securities.\nThe SEC has adopted regulations which generally define penny stock to be an equity security that has a market price of less than $5.00 per share, subject to specific exemptions. The market price of our common stock is currently less than $5.00 per share and therefore our stock is considered a penny stock according to SEC rules, unless we are listed on a national securities exchange. Under these rules, broker-dealers who recommend such securities to persons other than institutional accredited investors must:\nmake a special written suitability determination for the purchaser;\nreceive the purchasers prior written agreement to the transaction;\nprovide the purchaser with risk disclosure documents which identify certain risks associated with investing in penny stocks and which describe the market for these penny stocks as well as a purchasers legal remedies; and\nobtain a signed and dated acknowledgment from the purchaser demonstrating that the purchaser has actually received the required risk disclosure document before a transaction in a penny stock can be completed.\nIf required to comply with these rules, broker-dealers may find it difficult to effectuate customer transactions and trading activity in our securities may be adversely affected.\nThe market price of our common stock may be volatile and may fluctuate in a way that is disproportionate to our operating performance.\nOur stock price may experience substantial volatility as a result of a number of factors, including:\nsales or potential sales of substantial amounts of our common stock;\nthe success of competitive products or technologies;\nannouncements about us or about our competitors, including new product introductions and commercial results;\nthe recruitment or departure of key personnel;\ndevelopments concerning our licensors or manufacturers;\nlitigation and other developments;\nactual or anticipated changes in estimates as to financial results, development timelines or recommendations by securities analysts;\nvariations in our financial results or those of companies that are perceived to be similar to us; and\ngeneral economic, industry and market conditions.\nMany of these factors are beyond our control. The stock markets in general, and the market for companies related to the cannabis in any way in particular, have historically experienced extreme price and volume fluctuations. These fluctuations often have been unrelated or disproportionate to the operating performance of these companies. Broad market and industry factors could reduce the market price of our common stock, regardless of our actual operating performance.\nWe currently have outstanding shares of preferred stock that have special rights that could limit our ability to undertake corporate transactions, inhibit potential changes of control and reduce the proceeds available to our common stockholders in the event of a change in control.\nWe currently have outstanding two classes of stock, common stock and preferred stock, and there are two series of preferred stock, Series A Preferred Stock and Series B Preferred Stock. The holders of our Series A Preferred Stock are entitled to super voting and super converting rights.\nAs a result of the rights associated with our Series A Preferred Stock, we may not be able to undertake certain corporate transactions, including equity or debt offerings necessary to raise sufficient capital to run our business, change of control transactions or other transactions that may otherwise be beneficial to our businesses. These provisions may discourage, delay or prevent a merger, acquisition or other change in control of us that stockholders may consider favorable, including transactions in which our common stockholders might otherwise receive a premium price for their shares. The market price of our common stock could be adversely affected by the rights of our preferred stockholders.\nWe have never paid and do not intend to pay cash dividends.\nWe have never paid cash dividends on any of our capital stock and we currently intend to retain future earnings, if any, to fund the development and growth of our business. As a result, capital appreciation, if any, of our common stock will be our common stockholders sole source of gain for the foreseeable future. Under the terms of our existing Articles of Incorporation, we cannot declare, pay or set aside any dividends on shares of any class or series of our capital stock, other than dividends on shares of common stock payable in shares of common stock, unless we pay dividends to the holders of our preferred stock. Additionally, without special stockholder and board approvals, we cannot currently pay or declare dividends and will be limited in our ability to do so until such time, if ever, that we are listed on a stock exchange.\nOur executive officer and director have the ability to control all matters submitted to stockholders for approval.\nOur executive officer and director, Brandon Romanek, holds 200,000 shares of our Series A Preferred Stock (each share votes as the equivalent of 100 shares of common stock on all matters submitted for a vote by the common stockholders), as well as 10,531,632 shares of our common stock, and as such, he would be able to control all matters submitted to our stockholders for approval, as well as our management and affairs. For example, Mr. Romanek would control the election of directors and approval of any merger, consolidation or sale of all or substantially all of our assets. This concentration of voting power could delay or prevent an acquisition of our company on terms that other stockholders may desire.\nProvisions in our articles of incorporation and by-laws and under Nevada law could make an acquisition of us, which may be beneficial to our stockholders, more difficult and may prevent attempts by our stockholders to replace or remove our current management.\nProvisions in our articles of incorporation and by-laws may discourage, delay or prevent a merger, acquisition or other change in control of us that stockholders may consider favorable (a Corporate Transaction), including transactions in which our common stockholders might otherwise receive a premium price for their shares.\nSpecifically, our authorized capital stock in our articles of incorporation includes preferred stock issuable in one or more series. Our board of directors has the authority to issue preferred stock and determine the price, designation, rights, preferences, privileges, restrictions and conditions, including voting and dividend rights, of those shares without any further vote or action by stockholders. The rights of the holders of common stock will be subject to, and may be adversely affected by, the rights of holders of any preferred stock that may be issued. Issuance of preferred stock with preferential voting rights or economic rights, could make it more difficult for a third party to acquire a majority of the voting power of our outstanding voting securities, which could deprive our holders of common stock to purchase common stock at a premium that they might otherwise realize in connection with a proposed acquisition of our company. Similarly, our bylaws generally state that a majority of our board of directors constitute a quorum for the transaction of business and do not require that a larger percentage of our directors constitute a quorum. These provisions in our articles of incorporation and bylaws effectively mean that a simple majority of our board of directors could, without common shareholder approval, designate a class of preferred stock, and issue shares of that class of preferred stock, in a manner that would discourage, delay or prevent a Corporate Transaction from occurring.\nThese provisions could also limit the price that investors might be willing to pay in the future for shares of our common stock, thereby depressing the market price of our common stock. In addition, because our board of directors is responsible for appointing the members of our management team, these provisions may frustrate or prevent any attempts by our stockholders to replace or remove our current management by making it more difficult for stockholders to replace members of our board of directors.\nWe will incur increased costs as a result of operating as a public reporting company, and our management will be required to devote substantial time to new compliance initiatives.\nAs a public reporting company, we will incur significant legal, accounting and other expenses that we did not incur as a non-reporting company. In addition, the Sarbanes-Oxley Act of 2002 and rules subsequently implemented by the SEC, have imposed various requirements on public companies, including establishment and maintenance of effective disclosure and financial controls and corporate governance practices. Our management and other personnel will need to devote a substantial amount of time to these compliance initiatives. Moreover, these rules and regulations will increase our legal and financial compliance costs and will make some activities more time consuming and costly. For example, we expect that these rules and regulations may make it more difficult and more expensive for us to obtain director and officer liability insurance.\nWe currently have outstanding, and we may, in the future issue instruments which are convertible into shares of common stock, which will result in additional dilution to you.\nWe currently have outstanding debt and equity instruments which are convertible into shares of common stock, and we may need to issue similar instruments in the future. In the event that these convertible instruments are converted into shares of common stock, or that we make additional issuances of other convertible or exchangeable securities, you could experience additional dilution. Furthermore, we cannot assure you that we will be able to issue shares or other securities in any offering at a price per share that is equal to or greater than the price per share paid by investors or the then-current market price.\nWe cannot predict every event and circumstance that may impact our business and, therefore, the risks discussed herein may not be the only ones you should consider.\nAs we continue to grow our business, we may encounter other risks of which we are not aware as of the date of this Registration Statement. These additional risks may cause serious damage to our business in the future, the impact of which we cannot estimate at this time. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nThe Company does not own any real property. Item 3. Legal Proceedings.\nFrom time to time, we may become involved in various lawsuits and legal proceedings which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. We are not presently a party to any material litigation, nor to the knowledge of management is any litigation threatened against us, which may materially affect us, other than as set forth herein.\nOn or about December 18, 2020, Power Up Lending Group, Ltd. (Power Up) filed suit against the Company, the Companys executive officers, and the Companys transfer agent (Case Index No. 614700/2020, Supreme Court of the State of New York for Nassau County, Power Up Lending Group, Ltd. v. THC Therapeutics, Inc., Parker Mitchell, Transhare Corporation, and Brandon Romanek), alleging that the Companys convertible promissory notes issued to Power Up are in default as a result of the Companys alleged failure to honor the conversion terms of the notes along with related claims, and seeking monetary damages in excess of $280,920 (representing 200% of the outstanding note balances) and equitable relief to force the Company to honor Power Ups conversion of note amounts into Company common stock. The Company and its officers answered the complaint and filed counterclaims against Power Up. The parties settled in July of 2021, and the case was dismissed by Power Up.\nOn or about January 5, 2021, another Company lender, Iliad Research and Trading, L.P. (Iliad), sent a demand letter to the Company regarding the Companys alleged default under its promissory note issued to Iliad. The Company retained litigation counsel in Nevada and responded, and Iliad sued the Company in the fall of 2021 in Utah, where Iliad is domiciled (case no. 210000342 filed in the Third Judicial Court of Salt Lake City, Utah). In December of 2021, the Company was improperly served, Iliad subsequently received a default judgment, and the Company then filed a motion to set aside the judgment, which motion was granted by the court on or about May 9, 2022. The Company intends to vigorously defend the action, and on or about May 31, 2022, removed the case to United States District Court for the District of Utah (case no. 2:22-cv-00367-DAO). The Company subsequently filed a motion to stay arbitration as demanded by Iliad, and filed an Answer and Counterclaim against Iliad.\nIn the spring of 2021, the Companys former CEO, Parker Mitchell, filed suit against the Company for wrongful termination (case no. A-21-833007-Z filed in the District Court for Clark County, Nevada). The matter was subsequently settled on or about December 12, 2021, and the case was then dismissed.\nIn the fall of 2021, the Companys former CFO, an individual representing himself as Jonathan Cross, but who, upon information and belief was the convicted felon, John Dankovich, made numerous demands of the Company in connection with his termination by the Company. The Company responded to Mr. Dankovich on or about November 11, 2021, and Mr. Dankovich has taken no further action against the Company to its knowledge.\nIn the fall of 2021, one of the Companys former directors and current Company business consultant, Joshua Halford, made a demand for payment of funds due to Mr. Halford under a consulting agreement, Mr. Halford and the Company have since resolved the matter, and Mr. Halford is still providing consulting and technical design services to the Company in connection with the Companys dHyrdonator herb dryer product redesign. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket for Common Equity\nMarket Information\nThe Companys common stock is quoted on the OTC Link alternative trading system operated by OTC Markets Group, Inc., under the symbol THCT. As of July 31, 2022, the Companys common stock was held by 37 stockholders of record, which does not include stockholders whose shares are held in street or nominee name.\nThe following chart is indicative of the fluctuations in the stock prices for the fiscal years ended July 31, 2022 and 2021:\nFor the Years Ended July 31,\nHigh\nLow\nHigh\nLow\nFirst Quarter\n$ 0.3999\n$ 0.0955\n$ 0.079\n$ 0.027\nSecond Quarter\n$ 0.2195\n$ 0.06\n$ 0.50\n$ 0.02\nThird Quarter\n$ 0.1195\n$ 0.0002\n$ 0.75\n$ 0.16\nFourth Quarter\n$ 0.08\n$ 0.002\n$ 0.28\n$ 0.07\n__________\nSource: www.otcmarkets.com\nThe Companys transfer agent is ClearTrust, LLC, 16540 Pointe Village Dr., Suite 205, Lutz, Florida, 33558.\nDividend Distributions\nWe have not paid any cash dividends on our common stock and have no present intention of paying any dividends on the shares of our common stock for the foreseeable future. Our current policy is to retain earnings, if any, for use in our operations and in the development of our business. Our future dividend policy may be modified from time to time by our board of Directors.\nSecurities authorized for issuance under equity compensation plans\nThe Company does not have any securities authorized for issuance under equity compensation plans.\nPenny Stock\nOur common stock is considered penny stock under the rules the Securities and Exchange Commission (the SEC) under the Securities Exchange Act of 1934. The SEC has adopted rules that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a price of less than $5.00, other than securities registered on certain national securities exchanges or quoted on the NASDAQ Stock Market System, provided that current price and volume information with respect to transactions in such securities is provided by the exchange or quotation system. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock, to deliver a standardized risk disclosure document prepared by the Commission, that:\n·\ncontains a description of the nature and level of risks in the market for penny stocks in both public offerings and secondary trading;\n·\ncontains a description of the brokers or dealers duties to the customer and of the rights and remedies available to the customer with respect to a violation to such duties or other requirements of Securities laws; contains a brief, clear, narrative description of a dealer market, including bid and ask prices for penny stocks and the significance of the spread between the bid and ask price;\n·\ncontains a toll-free telephone number for inquiries on disciplinary actions;\n·\ndefines significant terms in the disclosure document or in the conduct of trading in penny stocks; and\n·\ncontains such other information and is in such form, including language, type, size and format, as the Commission shall require by rule or regulation.\nThe broker-dealer also must provide, prior to effecting any transaction in a penny stock, the customer with:\n·\nbid and offer quotations for the penny stock;\n·\nthe compensation of the broker-dealer and its salesperson in the transaction;\n·\nthe number of shares to which such bid and ask prices apply, or other comparable information relating to the depth and liquidity of the marker for such stock; and\n·\nmonthly account statements showing the market value of each penny stock held in the customers account.\nIn addition, the penny stock rules that require that prior to a transaction in a penny stock not otherwise exempt from those rules; the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written acknowledgement of the receipt of a risk disclosure statement, a written agreement to transactions involving penny stocks, and a signed and dated copy of a written suitably statement.\nThese disclosure requirements may have the effect of reducing the trading activity in the secondary market for our stock.\nRelated Stockholder Matters\nNone.\nUnregistered Sales of Equity Securities During Three Months Ended July 31, 2022\nOn June 4, 2021, a convertible note holder converted $19,500 in principal and fees into 1,203,704 shares of common stock at a conversion price of $0.0162 per share.\nOn July 7, 2021, a convertible note holder converted $20,000 in principal and fees into 372,439 shares of common stock at a conversion price of $0.0537 per share.\nThe forgoing shares issued upon conversion of convertible promissory notes were issued in reliance on the exemption from registration provided by Section 3(a)(9) of the Securities Act of 1933, as amended, as the shares were issued solely in exchange of convertible debt securities of the Company issued to the lenders previously, there was no additional consideration for the exchange, and there was no renumeration for solicitation of the exchange.\nPurchase of Equity Securities\nNone. Item 6. Selected Financial Data.\nAs the Company is a smaller reporting company, this item is inapplicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operation.\nThis Annual Report on Form 10-K contains forward-looking statements within the meaning of Rule 175 of the Securities Act of 1933, as amended, and Rule 3b-6 of the Securities Act of 1934, as amended, that involve substantial risks and uncertainties. These forward-looking statements are not historical facts, but rather are based on current expectations, estimates and projections about our industry, our beliefs and our assumptions. Words such as anticipate, expects, intends, plans, believes, seeks and estimates and variations of these words and similar expressions are intended to identify forward-looking statements. These statements are not guarantees of future performance and are subject to risks, uncertainties and other factors, some of which are beyond our control and difficult to predict and could cause actual results to differ materially from those expressed or forecasted in the forward-looking statements. You should not place undue reliance on these forward-looking statements, which apply only as of the date of this Form 10-K. Investors should carefully consider all of such risks before making an investment decision with respect to the Companys stock. The following discussion and analysis should be read in conjunction with our consolidated financial statements and summary of selected financial data for THC Therapeutics, Inc. Such discussion represents only the best present assessment from our Management.\nPlan of Operation\nTHC Therapeutics is focused on the wellness and nutraceutical industry. The Company is developing a sanitizing herb dryer, the dHydronator®, with multiple design, function, and usage patents. This innovative, laboratory-proven product is specifically designed for the drying and sanitizing (i.e., reducing the bacterial count) of freshly harvested cannabis, and other herbs, flowers, and tea leaves. The dHydronator® can reduce moisture content of cannabis to 10-15% in only 10-14 hours. Traditional herbal drying times can take up to two weeks. The Company also intends to establish a float spa facility that will allow each guest to customize their wellness experience, at their own pace, based on their individual needs.\nThe following summary of our results of operations should be read in conjunction with our audited consolidated financial statements for the years ended July 31, 2022 and 2021, which are included herein.\nOur financial statements are stated in U.S. Dollars and are prepared in accordance with generally accepted accounting principles of the United States (GAAP).\nGoing Concern Qualification\nSeveral conditions and events cast substantial doubt about the Companys ability to continue as a going concern. The Company has incurred cumulative net losses of approximately $38 million since its inception and requires capital for its contemplated operational and marketing activities to take place. The Companys ability to raise additional capital through the future issuances of common stock is unknown. The obtainment of additional financing, the successful development of the Companys contemplated plan of operations, and its transition, ultimately, to the attainment of profitable operations are necessary for the Company to continue operations. The ability to successfully resolve these factors raise substantial doubt about the Companys ability to continue as a going concern.\nFor the Year Ended July 31, 2022 and 2021:\nOur operating results for the year ended July 31, 2022 and 2021, and the changes between those periods for the respective items are summarized as follows:\nYears ended\nJuly 31,\nChange\nAmount\nPercentage\nOperating loss\n$ (1,746,028 )\n$ (939,977 )\n$ (806,051 )\n86 %\nOther income (expense)\n$ 227,099\n$ (945,468 )\n$ 1,172,567\n(124 )%\nNet income (loss)\n$ (1,518,929 )\n$ (1,885,445 )\n$ 366,516\n(19 )%\nRevenues\nWe did not earn any revenues during the fiscal years ending July 31, 2022 and 2021, respectively. We do not anticipate earning significant revenues until such time that we have fully developed our operational strategy and launched sales of our herb dryer product.\nOperating Income (Loss)\nOur loss from operations increased by $806,051 during the fiscal year ended July 31, 2022, from an operating loss of $939,977 for the 2021 fiscal year. The following table presents operating expenses for the 2022 and 2021 fiscal years:\nYears ended\nJuly 31,\nChange\nAmount\nPercentage\nProfessional fees\n$ 178,897\n$ 253,838\n$ (74,941 )\n(30 )%\nConsulting fees\n966,533\n205,170\n761,363\n371 )%\nSalaries and wages\n462,617\n267,975\n194,342\n73 %\nGeneral and administrative expenses\n138,281\n212,994\n(74,713 )\n(35 )%\nTotal operating expenses\n$ 1,746,028\n$ 939,977\n$ 806,051\n86 %\nWe realized a decrease of $74,941 in professional fees during the fiscal year ended July 31, 2022, as compared to 2021 fiscal year, primarily due to a decrease in legal fees. We also realized a decrease in General and administrative expenses during the fiscal year ended July 31, 2022, as compared to the 2021 fiscal year, primarily due to a decrease in advertising, insurance, and rent expenses. We realized an increase of $761,363 in consulting fees during the fiscal year ended July 31, 2022, as compared to the 2021 fiscal year, primarily due to an increase in stock-based compensation. We also realized an increase of $194,342 in Salaries and wages during the fiscal year ended July 31, 2022, as compared to the 2021 fiscal year, primarily due to an increase in payroll expenses.\nWe realized a decrease of $2,486 in depreciation expenses during fiscal year ended July 31, 2022, as compared to the same period in 2021, due to an asset becoming fully depreciated mid-way through the year ended July 31, 2022.\nOther Income (Expense)\nThe following table presents other income and expenses for the fiscal years ended July 31, 2022 and 2021:\nYears ended\nJuly 31,\nChange\nAmount\nPercentage\nGain/(loss) on change in derivative liability\n$ 327,501\n$ (393,718 )\n$ 721,219\n(183 )%\nInterest Expense\n(100,402 )\n(551,750 )\n451,348\n(82 )%\nTotal other income (expense)\n$ 227,099\n$ (945,468 )\n$ 1,172,567\n(124 )%\nGain/loss on change in derivative liability decreased by $721,219 during the fiscal year ended July 31, 2022, as compared to the 2021 fiscal year, due to the fluctuations in the price of our common stock between reporting periods. Interest expense decreased by $451,348 during the fiscal year ended July 31, 2022, as compared to the 2021 fiscal year, due to a default on a loan payable in the 2021 fiscal year.\nNet Income (loss)\nNet loss decreased to $1,518,929 during the fiscal year ended July 31, 2022, from a net loss of $1,885,445 in the 2021 fiscal year.\nLiquidity and Capital Resources\nBased upon our current financial condition, we do not have sufficient cash to operate our business at the current level for the next twelve months. We intend to fund operations through sales of our herb dryer and debt and/or equity financing arrangements, which may be insufficient to fund expenditures or other cash requirements. We plan to seek additional financing in a private equity offering to secure funding for operations. There can be no assurance that we will be successful in raising additional funding. If we are not able to secure additional funding, the implementation of our business plan will be impaired. There can be no assurance that such additional financing will be available to us on acceptable terms or at all.\nWorking Capital\nThe following table presents our working capital position as of July 31, 2022 and 2021:\nJuly 31,\nJuly 31,\nChange\nAmount\nPercentage\nCash and cash equivalents\n$ 32\n$ 296,130\n$ (296,098 )\n(100 )%\nPrepaid expenses\n40,656\n4,586\n36,070\n787 %\nInventory\n(805 )\n(97 )%\nCurrent assets\n$ 40,713\n$ 301,546\n$ (260,833 )\n(86 )%\nCurrent liabilities\n3,216,868\n2,857,394\n359,474\n13 %\nWorking capital deficit\n$ (3,176,155 )\n$ (2,555,848 )\n$ (620,307 )\n24 %\nThe change in working capital during the year ended July 31, 2022, was primarily due to a decrease in current assets of $260,833 and an increase in current liabilities of $359,474. Current assets decreased due to a decrease in cash and inventory, offset by an increase of prepaid expenses as of July 31, 2022. Current liabilities increased due to an increase in accrued expenses and payroll, which resulted in accounts payable and accrued liabilities of $1,580,689, and advances from related parties of $144,632, as compared to accounts payable and accrued liabilities of $970,445, and advances from related parties of 96,313, as of July 31, 2021. Cash decreased as of July 31, 2022, by $296,098 to $32, primarily caused by an increase in operating costs during the fiscal year ending July 31, 2022.\nCash Flow\nWe fund our operations with cash received from advances from officers and related parties, debt, and issuances of equity.\nThe following tables presents our cash flow for the fiscal years ended July 31, 2022 and 2021:\nYears ended\nJuly 31,\nChange 2022\nVersus 2021\nCash Flows Used in Operating Activities\n$ (418,917 )\n$ (388,477 )\n$ (30,440 )\nCash Flows Used in Investing Activities\n-\n(152,785 )\n152,785\nCash Flows Provided by Financing Activities\n122,819\n794,153\n(671,334 )\nNet increase (decrease) in Cash During Period\n$ (296,098 )\n$ 252,891\n$ (548,989 )\nCash Flows from Operating Activities\nWe did not generate positive cash flows from operating activities for the fiscal year ended July 31, 2022.\nFor the fiscal year ended July 31, 2022, net cash flows used in operating activities consisted of a net loss of $1,518,929, reduced by depreciation of $12,334, stock-based compensation of $836,788, amortization of debt discounts of $14,682, and a net increase in change of operating assets and liabilities of $563,709, and increased by gain on change in derivative liabilities of $327,501. For the fiscal year ended July 31, 2021, net cash flows used in operating activities consisted of a net loss of $1,885,445, reduced by depreciation of $16,370, stock-based compensation of $115,692, amortization of debt discounts of $277,845, loss on change in derivative liability of $393,718, convertible loan increase due to default of $179,960, and increased by a net increase in change of operating assets and liabilities of $513,383.\nCash Flows from Investing Activities\nFor the fiscal year ended July 31, 2022, no cashflows were used in investing activities. For the fiscal year ended July 31, 2021, net cashflows used in investing activities consisted of purchases of silver of $152,785.\nCash Flows from Financing Activities\nFor the fiscal year ended July 31, 2022, we received $102,881 from loans from related party, we received $147,000 from the sale of common stock, we received $25,000 from the convertible notes payable, and used $54,562 for net repayments on related party debts and $97,500 for the repurchase of the Companys common stock. For the fiscal year ended July 31, 2021, we received $91,081 from loans from related party, we received $506,500 from the sale of common stock, we received $300,000 from the sale of preferred stock, and used $78,428 for net repayments on related party debts and $25,000 for net repayments on convertible notes payable.\nAnticipated Cash Requirements\nWe estimate that our expenses to further implement our plan of operations over the next 12 months, will be approximately $3,810,000. This estimate may change significantly depending on the nature of our future business activities and our ability to raise capital from shareholders or other sources. We further anticipate incurring additional costs and expenses for accounting, legal, and other miscellaneous fees relating to compliance with SEC requirements.\nGiven that our cash needs are strongly driven by our growth requirements, we also intend to maintain a reserve sum for other risk contingencies that may arise.\nWe intend to meet our cash requirements for the next 12 months through the use of the cash we have on hand and through business operations, future equity financing, debt financing, or other sources, which may result in further dilution in the equity ownership of our shares. We currently do not have any other arrangements in place to complete any private placement financings and there is no assurance that we will be successful in completing any such financings on terms that will be acceptable to us.\nOff-Balance Sheet Arrangements\nThe Company does not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on the Companys financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements and related disclosures in conformity with U.S. generally accepted accounting principles (GAAP) and the Companys discussion and analysis of its financial condition and operating results require the Companys management to make judgments, assumptions and estimates that affect the amounts reported in its consolidated financial statements and accompanying notes. Note 3, Summary of Significant Accounting Policies, of the Notes to Consolidated Financial Statements included in this Form 10, describes the significant accounting policies and methods used in the preparation of the Companys consolidated financial statements. Management bases its estimates on historical experience and on various other assumptions it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities. Actual results may differ from these estimates, and such differences may be material.\nManagement believes the Companys critical accounting policies and estimates are those related to revenue recognition. Management considers these policies critical because they are both important to the portrayal of the Companys financial condition and operating results, and they require management to make judgments and estimates about inherently uncertain matters. The Companys management has reviewed these critical accounting policies and related disclosures.\nPrinciples of Consolidation - The consolidated financial statements include the accounts of the Company and its subsidiaries. All significant intercompany balances and transactions have been eliminated.\nUse of Estimates - The preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the consolidated financial statements, and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. Significant estimates include estimates used to review the Companys goodwill, impairments and estimations of long-lived assets, revenue recognition on percentage of completion type contracts, allowances for uncollectible accounts, inventory valuation, and the valuations of non-cash capital stock issuances. The Company bases its estimates on historical experience and on various other assumptions that are believed to be reasonable in the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nCash and Cash Equivalents - For purposes of the statement of cash flows, the Company considers all highly liquid investments and short-term instruments with original maturities of three months or less to be cash equivalents.\nFair Value of Financial Instruments - The carrying amounts reflected in the balance sheets for cash, accounts payable and accrued expenses approximate the respective fair values due to the short maturities of these items.\nAs required by the Fair Value Measurements and Disclosures Topic of the FASB ASC, fair value is measured based on a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value as follows: (Level 1) observable inputs such as quoted prices in active markets; (Level 2) inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and (Level 3) unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nThe three levels of the fair value hierarchy are described below:\nLevel 1: Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities;\nLevel 2: Quoted prices in markets that are not active, or inputs that are observable, either directly or indirectly, for substantially the full term of the asset or liability;\nLevel 3: Prices or valuation techniques that require inputs that are both significant to the fair value measurement and unobservable (supported by little or no market activity).\nRevenue Recognition: We recognize revenue in accordance with generally accepted accounting principles as outlined in the Financial Accounting Standard Boards (FASB) Accounting Standards Codification (ASC) 606, Revenue From Contracts with Customers, which requires that five steps be followed in evaluating revenue recognition: (i) identify the contract with the customer; (ii) identity the performance obligations in the contract; (iii) determine the transaction price; (iv) allocate the transaction price; and (v) recognize revenue when or as the entity satisfied a performance obligation.\nWe did not have a cumulative impact as of January 1, 2018 due to the adoption of Topic 606 and there was not an impact to our consolidated statements of operations for the years ended July 31, 2022 and 2021 as a result of applying Topic 606.\nThe company has made an accounting policy election to exclude from the measurement of the transaction price all taxes assessed by governmental authorities that are collected by the company from its customers (sales and use taxes, value added taxes, some excise taxes).\nProduct Sales - Revenues from the sale of products are recognized when title to the products are transferred to the customer and only when no further contingencies or material performance obligations are warranted, and thereby have earned the right to receive reasonably assured payments for products sold and delivered.\nCosts of Revenue - Costs of revenue includes raw materials, component parts, and shipping supplies. Shipping and handling costs is not a significant portion of the cost of revenue.\nGoodwill and Intangible Assets - The Company follows Financial Accounting Standard Boards (FASB) Codification Topic 350-10 (ASC 350-10), Intangibles - Goodwill and Other. According to this statement, goodwill and intangible assets with indefinite lives are no longer subject to amortization, but rather an annual assessment of impairment by applying a fair-value based test. Fair value for goodwill is based on discounted cash flows, market multiples and/or appraised values as appropriate. Under ASC 350-10, the carrying value of assets are calculated at the lowest level for which there are identifiable cash flows.\nLong-Lived Assets - In accordance with the Financial Accounting Standards Board (FASB) Accounts Standard Codification (ASC) ASC 360-10, Property, Plant and Equipment, the carrying value of intangible assets and other long-lived assets is reviewed on a regular basis for the existence of facts or circumstances that may suggest impairment. The Company recognizes impairment when the sum of the expected undiscounted future cash flows is less than the carrying amount of the asset. Impairment losses, if any, are measured as the excess of the carrying amount of the asset over its estimated fair value.\nSegment Reporting - Operating segments are defined as components of an enterprise for which separate financial information is available and evaluated regularly by the chief operating decision maker, or decision-making group, in deciding the method to allocate resources and assess performance. The Company currently has one reportable segment for financial reporting purposes, which represents the Companys core business.\nIncome Taxes - The Company accounts for its income taxes in accordance with FASB Codification Topic ASC 740-10, Income Taxes, which requires recognition of deferred tax assets and liabilities for future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and tax credit carry-forwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nStock-Based Compensation - The Company follows the guidelines in FASB Codification Topic ASC 718-10 Compensation-Stock Compensation, which requires the measurement and recognition of compensation expense for all share-based payment awards made to employees and directors including employee stock options and employee stock purchases related to an Employee Stock Purchase Plan based on the estimated fair values.\nEarnings (Loss) Per Share - The Company reports earnings (loss) per share in accordance with FASB Codification Topic ASC 260-10 Earnings Per Share. Basic earnings (loss) per share is computed by dividing income (loss) available to common shareholders by the weighted average number of common shares available. Diluted earnings (loss) per share is computed similar to basic earnings (loss) per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. Diluted earnings (loss) per share has not been presented since the effect of the assumed exercise of options and warrants to purchase common shares (common stock equivalents) would have an anti-dilutive effect.\nEmerging Growth Company\nWe are an emerging growth company under the federal securities laws and will be subject to reduced public company reporting requirements. In addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We are choosing to take advantage of the extended transition period for complying with new or revised accounting standards. As a result, our financial statements may not be comparable to those of companies that comply with public company effective dates.\nRecently Issued Accounting Pronouncements\nWe do not expect the adoption of any recently issued accounting pronouncements to have a significant impact on our net results of operations, financial position, or cash flows.\nSeasonality\nWe do not expect our sales to be impacted by seasonal demands for our products and services. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nAs the Company is a smaller reporting company, this item is inapplicable.\nGries & Associates, LLC\nCertified Public Accountants\n501 S. Cherry Street Suite 1100\nDenver, Colorado 80246\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Shareholders\nTHC Therapeutics, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of THC Therapeutics, Inc. (the Company) as of July 31, 2022 and 2021, and the related consolidated statements of operations, statements of stockholders deficit, and cash flows for each of the two years then ended, and the related notes and schedules (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2022 and 2021, and the results of its operations and its cash flows for each of the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in note 2 to the financial statements, the Company has incurred losses since inception of $38,036,909, net loss of $1,518,929 and net cash used in operations of $418,917. These factors create an uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nEmphasis of Matters-Risks and Uncertainties\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and financial markets of many countries, including the geographical area in which the Company plans to operate.\n/s/ Gries & Associates, LLC\nWe have served as the Companys auditor since 2022.\nDenver, CO\nNovember 23, 2022\nPCAOB# 6778\nblaze@griesandassociates.com\n501 S. Cherry Street, Suite 1100, Denver, Colorado 80246\n(O)720-464-2875 (M)773-255-5631 (F)720-222-5846 Item 8. Consolidated Financial Statements and Supplementary Data.\nTHC THERAPEUTICS INC.\nCONSOLIDATED BALANCE SHEETS\nASSETS\nJuly 31, 2022\nJuly 31, 2021\nCurrent assets\nCash\n$ 32\n$ 296,130\nPrepaid expenses\n40,656\n4,586\nInventory\nTotal current assets\n40,713\n301,546\nPhysical silver assets\n152,785\n152,785\nFixed assets, net\n-\n9,480\nIntangible assets, net\n13,403\n16,257\nTotal assets\n206,901\n480,068\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent liabilities\nAccounts payable and accrued liabilities\n$ 1,580,689\n$ 970,445\nAccrued expenses - related party\n16,807\n28,077\nAdvances from related parties\n144,632\n96,313\nNotes payable, net\n25,000\n-\nConvertible notes payable\n576,028\n561,346\nConvertible notes payable- related party\n200,000\n200,000\nDerivative liability\n673,712\n1,001,213\nTotal current liabilities\n3,216,868\n2,857,394\nTotal liabilities\n3,216,868\n2,857,394\nCommitments and Contingencies (See note 10)\n100,000\n100,000\nStockholders' deficit\nPreferred stock; $0.001 par value; 10,000,000 shares authorized;\n226,300 and 218,000 series A and B and C shares issued and outstanding\nas of July 31, 2022 and 2021, respectively\nPreferred A stock; $0.001 par value; 3,000,000 shares authorized;\n226,000 and 218,000 shares issued and outstanding\nas of July 31, 2022 and 2021, respectively\nPreferred B stock; $0.001 par value; 16,500 shares authorized;\n0 and 0 shares issued and outstanding\nas of July 31, 2022 and 2021, respectively\n-\n-\nPreferred C stock; $0.001 par value; 10,000 shares authorized;\n300 and 300 shares issued and outstanding\nas of July 31, 2022 and 2021, respectively\n-\n-\nCommon stock; $0.001 par value; 500,000,000 shares authorized;\n33,891,671 and 29,287,337 shares issued and outstanding\nas of July 31, 2022 and 2021, respectively\n32,492\n29,287\nStock payable\n622,278\n658,892\nStock receivable\n(6,902,000 )\n(6,902,000 )\nAdditional paid-in capital\n41,173,946\n40,254,257\nAccumulated deficit\n(38,036,909 )\n(36,517,980 )\nTotal stockholders' deficit\n(3,109,967 )\n(2,477,326 )\nTotal liabilities and stockholders' deficit\n$ 206,901\n$ 480,068\nThe accompanying notes are an integral part of these financial statements.\nTHC THERAPEUTICS INC.\nCONSOLIDATED STATEMENT OF OPERATIONS\nFor the Years Ended\nJuly 31, 2022\nJuly 31, 2021\nRevenues\n$ -\n$ -\nCost of revenues\n-\n-\nGross profit\n-\n-\nOperating expenses\nProfessional fees\n178,897\n253,838\nConsulting fees\n966,533\n205,170\nSalaries and wages\n462,317\n267,975\nGeneral and administrative\n138,281\n212,994\nTotal operating expenses\n1,746,028\n939,977\nLoss from operations\n(1,746,028 )\n(939,977 )\nOther income (expense)\nGain (loss) on derivative liability\n327,501\n(393,718 )\nInterest expense\n(100,402 )\n(551,750 )\nTotal other income (expense)\n227,099\n(945,468 )\nNet loss\n$ (1,518,929 )\n$ (1,885,445 )\nBasic loss per common share\n$ (0.05 )\n$ (0.08 )\nBasic weighted average common shares outstanding\n33,244,334\n23,659,514\nThe accompanying notes are an integral part of these financial statements.\nTHC THERAPEUTICS INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS DEFICIT\nPreferred A Stock\nPreferred B Stock\nPreferred C Stock\nCommon Stock\nAdditional\nPaid-in\nStock\nStock\nAccumulated\nTotal Stockholders'\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nCapital\nPayable\nReceivable\nDeficit\nDeficit\nBalance, July 31, 2020\n218,000\n-\n-\n-\n-\n21,461,784\n21,462\n39,547,581\n221,700\n(6,902,000 )\n(34,632,535 )\n(1,743,574 )\nShares issued for conversion of convertible debt\n-\n-\n-\n-\n-\n-\n4,292,219\n4,292\n97,208\n-\n-\n-\n101,500\nShares and warrants issued for services\n-\n-\n-\n-\n-\n-\n-\n-\n-\n115,692\n-\n-\n115,692\nCommon Stock issued for cash\n-\n-\n-\n-\n-\n-\n3,533,334\n3,533\n181,467\n321,500\n-\n-\n506,500\nPreferred stock issued for cash\n-\n-\n-\n-\n-\n-\n-\n300,000\n-\n-\n-\n300,000\nDerivative liability written off to additional paid in capital\n-\n-\n-\n-\n-\n-\n-\n-\n128,001\n-\n-\n-\n128,001\nNet loss\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(1,885,445 )\n(1,885,445 )\nBalance, July 31, 2021\n218,000\n-\n-\n-\n29,287,337\n29,287\n40,254,257\n658,892\n(6,902,000 )\n(36,517,980 )\n(2,477,326 )\nConversion of preferred shares into common stock shares\n(5,000 )\n(5 )\n-\n-\n-\n-\n500,000\n(495 )\n-\n-\n-\n-\nShares issued for cash\n-\n-\n-\n-\n-\n-\n3,533,334\n3,533\n188,967\n(45,500 )\n-\n-\n147,000\nShares and warrants issued for services\n13,000\n-\n-\n-\n-\n586,000\n827,302\n8,886\n-\n-\n836,788\nShares cancelled\n-\n-\n-\n-\n-\n-\n(15,000 )\n(15 )\n-\n-\n-\n-\nRepurchase of common stock\n-\n-\n-\n-\n-\n-\n(1,400,000 )\n(1,400 )\n(96,100 )\n-\n-\n(97,500 )\nNet loss\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(1,518,929 )\n(1,518,929 )\nBalance, July 31, 2022\n226,000\n-\n-\n-\n32,491,671\n32,492\n41,173,946\n622,278\n(6,902,000 )\n(38,036,909 )\n(3,109,967 )\nThe accompanying notes are an integral part of these financial statements.\nTHC THERAPEUTICS INC.\nCONSOLIDATED STATEMENT OF CASHFLOWS\nFor the Years Ended\nJuly 31, 2022\nJuly 31, 2021\nCash Flows from Operating Activities\nNet loss\n$ (1,518,929 )\n$ (1,885,445 )\nAdjustments to reconcile net loss to net cash used by operating activities:\nLoss (gain) on change in derivative liabilities\n(327,501 )\n393,718\nAmortization of debt discount\n14,682\n277,845\nStock based compensation\n836,788\n115,692\nConvertible loan increase due to default\n-\n179,960\nDepreciation and amortization\n12,334\n16,370\nImputed interest\n-\n-\nLoss on settlement of accounts payable\n-\n-\nChanges in operating assets and liabilities\nIncrease (decrease) in inventory\n(830 )\nIncrease (decrease) in prepaid assets\n(36,070 )\n(4,586 )\nIncrease (decrease) in accounts payable\n610,244\n(86,239 )\nIncrease (decrease) in accounts payable related party\n(11,270 )\n505,038\nIncrease (decrease) in contingent liability\n-\n100,000\nNet cash used in operating activities\n(418,917 )\n(388,477 )\nCash Flows from investing\nPurchase of silver\n-\n(152,785 )\nNet cash used in investing activities\n-\n(152,785 )\nCash Flows provided by Financing Activities\nProceeds from related party advances\n102,881\n91,081\nPayments on related party advances\n(54,562 )\n(78,428 )\nProceeds from sale of common stock\n147,000\n506,500\nRepurchase of common stock\n(97,500 )\n-\nProceeds from sale of preferred stock\n-\n300,000\nProceeds from convertible notes payable\n25,000\n-\nRepayments of convertible notes payable\n-\n(25,000 )\nNet cash provided by financing activities\n122,819\n794,153\nNet decrease in Cash\n(296,098 )\n252,891\nBeginning cash balance\n296,130\n43,239\nEnding cash balance\n$ 32\n$ 296,130\nSupplemental disclosure of cash flow information\nDerivative liability written off to additional paid in capital\n$ -\n$ 128,001\nShares issued for the conversion of debt\n$ -\n$ 101,500\nThe accompanying notes are an integral part of these financial statements.\nTHC THERAPEUTICS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. DESCRIPTION OF BUSINESS AND HISTORY\nDescription of business - THC Therapeutics, Inc. (referred to as the Company) is focused developing its patented product, the dHydronator®, a sanitizing herb dryer. The main function of the dHydronator is to greatly accelerate the drying time of an herb while sanitizing it. The dHydronator can be used to dry a variety of herbs, but it has been specifically tested for use with cannabis, and it can reduce the drying time for cannabis from 10-14 days to less than 14 hours.\nHistory - The Company was incorporated in the State of Nevada on May 1, 2007, as Fairytale Ventures, Inc., and later changed its name to Aviation Surveillance Systems, Inc. and Harmonic Energy, Inc. On January 23, 2017, the Company changed its name to THC Therapeutics, Inc.\nOn May 30, 2017, the Company formed Genesis Float Spa LLC, a wholly-owned subsidiary, to market its float spa assets purchased for wellness centers. The Companys health spa plans are part of the Companys strategic focus on revenue generation and creating shareholder value.\nOn January 17, 2018, the Company changed its name to Millennium Blockchain Inc.\nOn September 28, 2018, the Company changed its name back to THC Therapeutics, Inc.\nTHC Therapeutics, Inc., together with its subsidiaries, shall herein be collectively referred to as the Company.\n2. BASIS OF PRESENTATION AND GOING CONCERN\nBasis of Presentation and Principles of Consolidation - These consolidated financial statements and related notes are presented in accordance with accounting principles generally accepted in the United States (US GAAP) and include the accounts of the Company and its wholly owned subsidiaries. All significant intercompany balances and transactions have been eliminated.\nGoing Concern - The accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities and commitments in the normal course of business.\nManagement evaluated all relevant conditions and events that are reasonably known or reasonably knowable, in the aggregate, as of the date the consolidated financial statements are issued and determined that substantial doubt exists about the Companys ability to continue as a going concern. The Companys ability to continue as a going concern is dependent on the Companys ability to generate revenues and raise capital. The Company has not generated sufficient revenues to provide sufficient cash flows to enable the Company to finance its operations internally. As of July 31, 2022, the Company had $32 cash on hand. At July 31, 2022 the Company has an accumulated deficit of 38,036,909. For the year ended July 31, 2022 the Company had a net loss of $1,518,929, and net cash used in operations of $418,917. These factors raise substantial doubt about the Companys ability to continue as a going concern within one year from the date of filing.\nOver the next twelve months management plans to use borrowings and security sales to mitigate the effects of cash flow deficits; however, no assurance can be given that debt or equity financing, if and when required, will be available. The financial statements do not include any adjustments relating to the recoverability and classification of recorded assets and classification of liabilities that might be necessary should the Company be unable to continue existence.\n3. SUMMARY OF SIGNIFICANT POLICIES\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the consolidated financial statements, and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. Significant estimates include estimates used to review the Companys goodwill, impairments and estimations of long-lived assets, revenue recognition on percentage of completion type contracts, allowances for uncollectible accounts, inventory valuation, and the valuations of non-cash capital stock issuances. The Company bases its estimates on historical experience and on various other assumptions that are believed to be reasonable in the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nCash and Cash Equivalents\nFor purposes of the statement of cash flows, the Company considers all highly liquid investments and short-term instruments with original maturities of six months or less to be cash equivalents. There were $32 and $296,130 in cash and no cash equivalents as of July 31, 2022 and 2021, respectively.\nConcentration Risk\nAt times throughout the year, the Company may maintain cash balances in certain bank accounts in excess of FDIC limits. As of July 31, 2022, the cash balance in excess of the FDIC limits was $0. The Company has not experienced any losses in such accounts and believes it is not exposed to any significant credit risk in these accounts.\nRevenue Recognition\nWe recognize revenue in accordance with generally accepted accounting principles as outlined in the Financial Accounting Standard Board's (FASB) Accounting Standards Codification (ASC) 606, Revenue From Contracts with Customers, which requires that five steps be followed in evaluating revenue recognition: (i) identify the contract with the customer; (ii) identity the performance obligations in the contract; (iii) determine the transaction price; (iv) allocate the transaction price; and (v) recognize revenue when or as the entity satisfied a performance obligation.\nThe company has made an accounting policy election to exclude from the measurement of the transaction price all taxes assessed by governmental authorities that are collected by the company from its customers (sales and use taxes, value added taxes, some excise taxes).\nRevenues from the sale of products are recognized when title to the products are transferred to the customer and only when no further contingencies or material performance obligations are warranted, and thereby have earned the right to receive reasonably assured payments for products sold and delivered.\nFair Value of Financial Instruments\nThe carrying amounts reflected in the balance sheets for cash, accounts payable and accrued expenses approximate the respective fair values due to the short maturities of these items.\nAs required by the Fair Value Measurements and Disclosures Topic of the FASB ASC, fair value is measured based on a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value as follows: (Level 1) observable inputs such as quoted prices in active markets; (Level 2) inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and (Level 3) unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nThe six levels of the fair value hierarchy are described below:\nLevel 1: Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities.\nLevel 2: Quoted prices in markets that are not active, or inputs that are observable, either directly or indirectly, for substantially the full term of the asset or liability.\nLevel 3: Prices or valuation techniques that require inputs that are both significant to the fair value measurement and unobservable (supported by little or no market activity).\nFinancial assets and liabilities measured at fair value on a recurring basis are summarized below as of July 31, 2022:\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets\nPhysical Silver Assets\n$ 152,785\n$ -\n$ -\n$ 152,785\nLiabilities\nDerivative Financial Instruments\n$ -\n$ -\n$ 673,712\n$ 673,712\nAs of July 31, 2022, the Companys stock price was $0.026, risk-free discount rate of 2.22% and volatility of 851.23%.\nThe following tables provides a summary of the changes in fair value, including net transfers in and/or out, of the derivative financial instruments, measured at fair value on a recurring basis using significant unobservable inputs for the year ended July 31, 2022:\nAmount\nBalance July 31, 2021\n$ 1,001,213\nDerivative reclassed to additional paid in capital\n-\nChange in fair market value of derivative liabilities\n(327,501 )\nBalance July 31, 2022\n$ 673,712\nFinancial assets and liabilities measured at fair value on a recurring basis are summarized below as of July 31, 2021:\nLevel 1\nLevel 2\nLevel 3\nTotal\nLiabilities\nDerivative Financial Instruments\n$ -\n$ -\n$ 1,001,213\n$ 1,001,213\nAs of July 31, 2021, the Companys stock price was $0.11, risk-free discount rate of 0.05% and volatility of 236.13%.\nGoodwill and Intangible Assets\nThe Company follows Financial Accounting Standard Boards (FASB) Codification Topic 350-10 (ASC 350-10), Intangibles - Goodwill and Other. According to this statement, goodwill and intangible assets with indefinite lives are no longer subject to amortization, but rather an annual assessment of impairment by applying a fair-value based test. Fair value for goodwill is based on discounted cash flows, market multiples and/or appraised values as appropriate. Under ASC 350-10, the carrying value of assets are calculated at the lowest level for which there are identifiable cash flows.\nLong-Lived Assets\nIn accordance with the Financial Accounting Standards Board (\"FASB\") Accounts Standard Codification (ASC) ASC 360-10, \"Property, Plant and Equipment,\" the carrying value of intangible assets and other long-lived assets is reviewed on a regular basis for the existence of facts or circumstances that may suggest impairment. The Company recognizes impairment when the sum of the expected undiscounted future cash flows is less than the carrying amount of the asset. Impairment losses, if any, are measured as the excess of the carrying amount of the asset over its estimated fair value. During the years ending July 31, 2022 and 2021 the Company recorded an impairment expense of $0 and $0, respectively.\nIncome Taxes\nThe Company accounts for its income taxes in accordance with FASB Codification Topic ASC 740-10, Income Taxes, which requires recognition of deferred tax assets and liabilities for future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and tax credit carry-forwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nStock-Based Compensation\nThe Company follows the guidelines in FASB Codification Topic ASC 718-10 Compensation-Stock Compensation, which requires the measurement and recognition of compensation expense for all share-based payment awards made to employees and directors including employee stock options and employee stock purchases related to an Employee Stock Purchase Plan based on the estimated fair values.\nEarnings (Loss) Per Share\nThe Company reports earnings (loss) per share in accordance with FASB Codification Topic ASC 260-10 Earnings Per Share. Basic earnings (loss) per share is computed by dividing income (loss) available to common shareholders by the weighted average number of common shares available. Diluted earnings (loss) per share is computed similar to basic earnings (loss) per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. Diluted earnings (loss) per share have not been presented since the effect of the assumed exercise of options and warrants to purchase common shares (common stock equivalents) would have an anti-dilutive effect.\nAdvertising Costs\nThe Companys policy regarding advertising is to expense advertising when incurred. The Company incurred advertising expenses of $7,419 and $29,912 during the years ended July 31, 2022 and 2021, respectively.\n4. PHYSICAL SILVER ASSETS\nDuring the year ending July 31, 2021, the Company purchased silver bars and coins for $152,785. We determine the fair value of our silver on a nonrecurring basis in accordance with ASC 820, Fair Value Measurement, based on quoted prices on the active exchange(s) that we have determined is its principal market for silver (Level 1 inputs). We perform an analysis each quarter to identify whether events or changes in circumstances, principally decreases in the quoted prices on active exchanges, indicate that it is more likely than not that our silver assets are impaired. In determining if an impairment has occurred, we consider the lowest market price of silver quoted on the active exchange since acquiring the silver. If the then current carrying value of a silver exceeds the fair value so determined, an impairment loss has occurred with respect to those silver assets in the amount equal to the difference between their carrying values and the price determined.\n5. FIXED ASSETS\nFixed assets consist of the following as of July 31, 2022 and 2021:\nJuly 31,\nJuly 31,\nHydronator prototype\n$ 27,100\n$ 27,100\nFloat Spa and associated equipment\n60,000\n60,000\nOffice furniture and equipment\nLess: accumulated depreciation\n(87,632 )\n(78,152 )\nFixed assets, net\n$ -\n$ 9,480\nDepreciation expense for the years ended July 31, 2022 and 2021, was $9,480 and $11,966, respectively.\n6. INTANGIBLE ASSETS\nIntangible assets consist of the following as of July 31, 2022 and 2021:\nJuly 31,\nJuly 31,\nPatents and patents pending\n$ 19,699\n$ 19,699\nTrademarks\n1,275\n1,275\nWebsite and domain names\n15,098\n15,098\nLess: accumulated depreciation\n(22,669 )\n(19,815 )\nIntangible assets, net\n$ 13,403\n$ 16,257\nAmortization expense for the years ended July 31, 2022 and 2021, was $2,854 and $4,404 respectively.\n7. RELATED PARTY TRANSACTIONS\nADVANCES FROM RELATED PARTIES\nOur Chief Executive Officer and Harvey Romanek, father of our Chief Executive Officer, previously agreed to advance funds to the Company from time to time to support the ongoing operations of the Company. Advances are due within ten days of demand and bear interest at 5% annually.\nAdvances from related parties consist of the following as of July 31, 2022:\nPrincipal as of\nYear ending\nJuly 31, 2022\nPrincipal as of\nAccrued\ninterest balance\nAs of\nJuly 31,\nFunds\nadvanced\nFunds\nrepaid\nJuly 31,\nJuly 31,\nB. Romanek, President and CEO\n$ 25,920\n$ 102,881\n$ (54,562 )\n$ 74,239\n$ 1,345\nShareholder Relative of our President and CEO\n70,393\n-\n-\n70,393\n15,462\nTOTAL\n$ 96,313\n$ 102,881\n$ (54,562 )\n$ 144,632\n$ 16,807\nOn November 1, 2017, we entered into an employment agreement with Brandon Romanek, our Chief Executive Officer. In accordance with this agreement, Mr. Romanek provides services to the Company in exchange for $78,000 per year plus vacation and bonuses as approved annually by the board of directors, as well as reimbursement of expenses incurred. On February 1, 2019, we amended the employment agreement with Brandon Romanek, our Chief Executive Officer. In accordance with this agreement, Mr. Romanek provides services to the Company in exchange for $178,000 per year plus vacation and bonuses as approved annually by the board of directors, as well as reimbursement of expenses incurred.\nDuring the year ending July 31, 2022, the Company accrued $177,527 due to Mr. Romanek related to this agreement. As of July 31, 2022, Mr. Romanek has allowed the Company to defer a total of $662,961 in compensation earned to date related to his employment agreements.\nOn June 15, 2019, the Company entered into an employment agreement with Joshua Halford, a business development analyst for the Company, under the agreement Mr. Halford earns (i) $3,000 in compensation every other week, payable at the Companys election in cash or in the form of common stock registered with the SEC on Form S-8 with a 50% bonus for stock issuances made in lieu of cash payments at the time of issuance (for example, if the Company filed a registration statement on Form S-8 in the future, the Company could elect to pay Mr. Halford the $3,000 biweekly payment by issuing Mr. Halford $4,500 of S-8 registered Company common stock at the then-current common stock price instead of making a $3,000 cash payment to Mr. Halford), and (ii) 10% sales commissions. On February 18, 2020 the employment agreement was amended to $1,000 in compensation every other week to be paid in cash. During the year ended July 31, 2022 Mr. Halford earned $233,437.\nCONVERTIBLE NOTES PAYABLE RELATED PARTY\nOn May 1, 2019, we entered into a convertible promissory note pursuant to which we borrowed $200,000 from Harvey Romanek, the father of the Companys Chief Executive Officer, Brandon Romanek. Interest under the convertible promissory note is 10% per annum, and the principal and all accrued but unpaid interest is due on May 1, 2021. The note is convertible six months after the issuance date at the noteholders option into shares of our common stock at a Variable Conversion Price of 65% multiplied by the lowest Trading Price for the Common Stock during the ten (10) Trading Day period ending on the last complete Trading Day prior to the Conversion Date.\nThe Company recorded a debt discount in the amount of $200,000 in connection with the original issuance discount, offering costs and initial valuation of the derivative liability related to the embedded conversion option of the Note to be amortized utilizing the effective interest method of accretion over the term of the Note.\nFurther, the Company recognized a derivative liability of $387,232 and an initial loss of $187,232 based on the Black-Scholes pricing model.\nAs of July 31, 2022, convertible notes due to related parties was $200,000.\nThe Company accounts for the fair value of the conversion features of its convertible debt in accordance with ASC Topic No. 815-15 Derivatives and Hedging; Embedded Derivatives (Topic No. 815-15). Topic No. 815-15 requires the Company to bifurcate and separately account for the conversion features as an embedded derivative contained in the Companys convertible debt. The Company is required to carry the embedded derivative on its balance sheet at fair value and account for any unrealized change in fair value as a component of results of operations. The Company values the embedded derivatives using the Black-Scholes pricing model.\nThe Black-Scholes model, adopted by management as an appropriate financial model, utilized the following inputs to value the derivative liabilities at the date of issuance of the convertible note through July 31, 2022:\nRisk free interest rate\n2.22 %\nExpected term (years)\nExpected volatility\n851.23 %\nExpected dividends\n0 %\n8. NOTES PAYABLE\nNotes payable consist of the following at:\nJuly 31,\nJuly 31,\nNote payable, unsecured, 12% interest, due March 30, 2023\n25,000\n-\nTotal Notes Payable\n$ 25,000\n$ -\nOn March 30, 2022, the Company issued a $25,000 12% promissory note. The note is due on March 30, 2023.\n9. CONVERTIBLE NOTES PAYABLE\nConvertible Notes Payable at consists of the following:\nJuly 31,\nJuly 31,\nOn April 4, 2019, we entered into a master convertible promissory note pursuant to which we may borrow up to $250,000 in $50,000 tranches.\nOn April 19, 2019, we borrowed the first tranche of $50,000, net of debt issuance costs and investor legal fees of $7,000, resulting in the Company receiving $43,000.\nOn June 19, 2019, we borrowed the second tranche of $50,000, net of debt issuance costs and investor legal fees of $7,000, resulting in the Company receiving $43,000.\nOn January 27, 2020, we borrowed the third tranche of $35,000, net of debt issuance costs and investor legal fees of $7,000, resulting in the Company receiving $30,500.\nOn January 31, 2019, the lender converted $9,532 of principle and $500 of fees into 16,500 shares of common stock.\nOn December 12, 2020, the lender converted $9,700 of principle and $500 of fees into 34,000 shares of common stock.\nOn February 10, 2020, the lender converted $10,156 of principle and $500 of fees into 120,000 shares of common stock.\nOn March 24, 2020, the lender converted $7,628 of principle and $500 of fees into 160,000 shares of common stock.\nOn April 13, 2020, the lender converted $7,900 of principle and $500 of fees into 300,000 shares of common stock.\nOn April 28, 2020, the lender converted $5,084 of principle, $500 of fees, and $5,000 of interest into 588,000 shares of common stock.\nOn May 26, 2020, the lender converted $13,000 of principle, and $500 of fees into 750,000 shares of common stock.\nInterest under the convertible promissory note is 10% per annum, and the principal and all accrued but unpaid interest is due on April 4, 2020. The note is convertible at any date after the issuance date at the noteholders option into shares of our common stock at a variable conversion price equal to the lesser of (i) the lowest Trading Price during the previous twenty-five (25) Trading Day period ending on the latest complete Trading Day prior to the date of this Note or (ii) Variable Conversion Price of 60% multiplied by the lowest Trading Price for the Common Stock during the twenty-five (25) Trading Day period ending on the last complete Trading Day prior to the Conversion Date.\nThe Company recorded debt discounts in the amount of $135,000 in connection with the original issuance discount, offering costs and initial valuation of the derivative liability related to the embedded conversion option of each tranche of the Note to be amortized utilizing the effective interest method of accretion over the term of each tranche of the Note. The aggregate debt discount has been accreted and charged to interest expenses as a financing expense in the amount of $0 during the year ended July 31, 2022.\nFurther, the Company recognized a derivative liability of $465,748 and an initial loss of $335,248 based on the Black-Scholes pricing model.\n72,000\n72,000\nUnamortized debt discount\n-\n-\nTotal, net of unamortized discount\n72,000\n72,000\nOn June 20, 2019, we entered into a convertible promissory note pursuant to which we borrowed $291,108, net of an Original Issue Discount (OID) of $36,108 and investor legal expenses of $5,000 resulting in the Company receiving $250,000.\nOn January 31, 2019, the lender converted $30,000 of principle into 170,940 shares of common stock.\nOn March 27, 2020, the lender converted $30,000 of principle into 267,016 shares of common stock.\nOn April 23, 2020, the lender converted $21,000 of principle into 210,108 shares of common stock.\nOn April 23, 2020, the lender converted $30,000 of principle into 1,129,816 shares of common stock\nOn May 28, 2020, the lender converted $35,000 of principle into 1,318,118 shares of common stock\nInterest under the convertible promissory note is 8% per annum, and the principal and all accrued but unpaid interest is due on June 20, 2020. The note is convertible at any date after the issuance date at the noteholders option into shares of our common stock at a conversion price equal to $8.80 (the Lender Conversion Price). Additionally, after 6 months from the date the Company receives note funding, the noteholder has the right to demand whole or partial redemption of amounts owed to the noteholder under the note. Payments of redemption amounts by the Company to the noteholder can be made in cash or by converting the redemption amount into shares common stock of the Company, with such conversions occurring at the lower of (i) the Lender Conversion Price, or (ii) a price equal to the 65% of the two lowest Closing Trade Prices during the ten (10) Trading Day period immediately preceding the measurement date.\nThe Company recorded a debt discount in the amount of $182,499 in connection with the original issuance discount, offering costs and initial valuation of the derivative liability related to the embedded conversion option of the Note to be amortized utilizing the effective interest method of accretion over the term of the Note. The aggregate debt discount has been accreted and charged to interest expenses as a financing expense in the amount of $0 during the year ended July 31, 2022.\nFurther, the Company recognized a derivative liability of $141,391 and an initial loss of $0 based on the Black-Scholes pricing model.\n145,108\n145,108\nUnamortized debt discount\n-\n-\nTotal, net of unamortized discount\n145,108\n145,108\nOn February 20, 2020, we entered into a convertible promissory note pursuant to which we borrowed $135,680, net of an Original Issue Discount (OID) of $7,680 and investor legal expenses of $2,500 resulting in the Company receiving $125,500.\nOn September 2, 2020, the lender converted $10,000 of principle into 242,718 shares of common stock\nOn September 30, 2020, the lender converted $12,000 of principle into 476,190 shares of common stock\nOn November 14, 2020, the lender converted $20,000 of principle into 938,967 shares of common stock.\nOn December 1, 2020, the lender converted $20,000 of principle into 1,058,201 shares of common stock.\nThe fair value of the derivative liability associated with the conversions for the nine months ended April 30, 2021 on the date of settlement of $16,244 was recorded to additional paid in capital.\nInterest under the convertible promissory note is 10% per annum, and the principal and all accrued but unpaid interest is due on August 15, 2021. The note is convertible at any date after the issuance date at the noteholders option into shares of our common stock at a conversion price equal to 71% of the average of the 2 lowest trading prices of the common stock during the 10 completed trading days prior to conversion date.\nThe Company recorded a debt discount in the amount of $135,680 in connection with the original issuance discount, offering costs and initial valuation of the derivative liability related to the embedded conversion option of the Note to be amortized utilizing the effective interest method of accretion over the term of the Note. The aggregate debt discount has been accreted and charged to interest expenses as a financing expense in the amount of $3,714 during the year ended July 31, 2022.\nFurther, the Company recognized a derivative liability of $192,236 and an initial loss of $64,236 based on the Black-Scholes pricing model.\n147,360\n147,360\nUnamortized debt discount\n(-\n) (3,714\n)\nTotal, net of unamortized discount\n147,360\n143,646\nOn March 26, 2020, we entered into a convertible promissory note pursuant to which we borrowed $3,000, net of legal expenses of $3,000 resulting in the Company receiving $0.\nInterest under the convertible promissory note is 0% per annum, and the principal and all accrued but unpaid interest is due on March 26, 2021. The note is convertible at any date after the issuance date at the noteholders option into shares of our common stock at a conversion price equal to the average of the closing trading prices of the common stock during the 3 completed trading days prior to conversion date.\nThe Company recorded a debt discount in the amount of $3,000 in connection with the original issuance discount, offering costs and initial valuation of the derivative liability related to the embedded conversion option of the Note to be amortized utilizing the effective interest method of accretion over the term of the Note. The aggregate debt discount has been accreted and charged to interest expenses as a financing expense in the amount of $0 during the year ended July 31, 2022.\nFurther, the Company recognized a derivative liability of $1,500 and an initial loss of $1,500 based on the Black-Scholes pricing model.\n3,000\n3,000\nUnamortized debt discount\n(-\n)\n(-\n)\nTotal, net of unamortized discount\n3,000\n3,000\nOn May 1, 2020, we entered into a convertible promissory note pursuant to which we borrowed $100,000, net of consulting expenses of $100,000 resulting in the Company receiving $0. During the nine months ended April 30, 2021, the Company made cash payments of $25,000.\nInterest under the convertible promissory note is 10% per annum, and the principal and all accrued but unpaid interest is due on May 1, 2021. The note is convertible at any date after the effective date at the noteholders option into shares of our common stock at a conversion price equal to 65% of the average of the six lowest closing prices in the 10 trading days prior to the conversion.\nThe Company recorded a debt discount in the amount of $64,888 in connection with the original issuance discount, offering costs and initial valuation of the derivative liability related to the embedded conversion option of the Note to be amortized utilizing the effective interest method of accretion over the term of the Note. The aggregate debt discount has been accreted and charged to interest expenses as a financing expense in the amount of $0 during the year ended July 31, 2022.\nFurther, the Company recognized a derivative liability of $64,888 based on the Black-Scholes pricing model.\n75,000\n75,000\nUnamortized debt discount\n(-\n)\n(-\n)\nTotal, net of unamortized discount\n75,000\n75,000\nOn May 7, 2020, we entered into a convertible promissory note pursuant to which we borrowed $66,780, net of an Original Issue Discount (OID) of $3,780 and investor legal expenses of $3,000 resulting in the Company receiving $60,000.\nInterest under the convertible promissory note is 10% per annum, and the principal and all accrued but unpaid interest is due on October 29, 2021. The note is convertible at any date after the issuance date at the noteholders option into shares of our common stock at a conversion price equal to 71% of the average of the 2 lowest trading prices of the common stock during the 10 completed trading days prior to conversion date.\nThe Company recorded a debt discount in the amount of $66,780 in connection with the original issuance discount, offering costs and initial valuation of the derivative liability related to the embedded conversion option of the Note to be amortized utilizing the effective interest method of accretion over the term of the Note. The aggregate debt discount has been accreted and charged to interest expenses as a financing expense in the amount of $10,968 during the year ended July 31, 2022.\nFurther, the Company recognized a derivative liability of $138,172 and an initial loss of $134,237 based on the Black-Scholes pricing model.\n133,560\n133,560\nUnamortized debt discount\n(-\n)\n(10,968\n)\nTotal, net of unamortized discount\n133,560\n122,592\nTotal notes payable, net of unamortized discount\n$ 576,028\n$ 561,346\nThe Company accounts for the fair value of the conversion features of its convertible debt in accordance with ASC Topic No. 815-15 Derivatives and Hedging; Embedded Derivatives (Topic No. 815-15). Topic No. 815-15 requires the Company to bifurcate and separately account for the conversion features as an embedded derivative contained in the Companys convertible debt. The Company is required to carry the embedded derivative on its balance sheet at fair value and account for any unrealized change in fair value as a component of results of operations. The Company values the embedded derivatives using the Black-Scholes pricing model.\nThe Black-Scholes model, adopted by management as an appropriate financial model, utilized the following inputs to value the derivative liabilities at the date of issuance of the convertible note through July 31, 2022:\nRisk free interest rate\n2.22 %\nExpected term (years)\nExpected volatility\n851.23 %\nExpected dividends\n0 %\n10. COMMITMENTS AND CONTINGENCIES\nFrom time to time, we may become involved in various lawsuits and legal proceedings which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. We are not presently a party to any material litigation, nor to the knowledge of management is any litigation threatened against us, which may materially affect us, other than as set forth herein.\nOn or about December 18, 2020, Power Up Lending Group, Ltd. (Power Up) filed suit against the Company, the Companys executive officers, and the Companys transfer agent (Case Index No. 614700/2020, Supreme Court of the State of New York for Nassau County, Power Up Lending Group, Ltd. v. THC Therapeutics, Inc., Parker Mitchell, Transhare Corporation, and Brandon Romanek), alleging that the Companys convertible promissory notes issued to Power Up are in default as a result of the Companys alleged failure to honor the conversion terms of the notes along with related claims, and seeking monetary damages in excess of $280,920 (representing 200% of the outstanding note balances) and equitable relief to force the Company to honor Power Ups conversion of note amounts into Company common stock. The Company and its officers answered the complaint and filed counterclaims against Power Up. The parties settled in July of 2021, and the case was subsequently dismissed by Power Up.\nOn or about January 5, 2021, another Company lender, Iliad Research and Trading, L.P. (Iliad), sent a demand letter to the Company regarding the Companys alleged default under its promissory note issued to Iliad. The Company retained litigation counsel in Nevada and responded, and Iliad sued the Company in the fall of 2021 in Utah, where Iliad is domiciled (case no. 210000342 filed in the Third Judicial Court of Salt Lake City, Utah). In December of 2021, the Company was improperly served, Iliad subsequently received a default judgment, and the Company then filed a motion to set aside the judgment, which motion was granted by the court on or about May 9, 2022. The Company intends to vigorously defend the action.\nIn the spring of 2021, the Companys former CEO, Parker Mitchell, filed suit against the Company for wrongful termination (case no. A-21-833007-Z filed in the District Court for Clark County, Nevada). The matter was subsequently settled on or about December 12, 2021, and the case was then dismissed.\nIn the fall of 2021, the Companys former CFO, an individual representing himself as Jonathan Cross, but who, upon information and belief was the convicted felon, John Dankovich, made numerous demands of the Company in connection with his termination by the Company. The Company responded to Mr. Dankovich on or about November 11, 2021, and Mr. Dankovich has taken no further action against the Company to its knowledge.\nIn the fall of 2021, one of the Companys former directors and current Company business consultant, Joshua Halford, made a demand for payment of funds due to Mr. Halford under a consulting agreement, Mr. Halford and the Company have since resolved the matter, and Mr. Halford is still providing consulting and technical design services to the Company in connection with the Companys dHyrdonator herb dryer product redesign.\n11. INCOME TAXES\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. The Company recorded the valuation allowance due to the uncertainty of future realization of federal and state net operating loss carryforwards. The deferred income tax assets are comprised of the following at July 31, 2022 and 2021:\nDeferred income tax assets:\n$ 7,972,562\n$ 7,668,776\nValuation allowance\n(7,972,562 )\n(7,668,776 )\nNet deferred tax asset\n$ -\n$ -\nReconciliation between the statutory rate and the effective tax rate is as follows at December 31, 2022 and 2021:\nEffective Tax Rate Reconciliation:\nFederal statutory tax rate\n21.0 %\n21.0 %\nState taxes, net of federal benefit\n0.0 %\n0.0 %\nChange in valuation allowance\n(21.0 )%\n(21.0 )%\nEffective tax rate\n0.0 %\n0.0 %\nAs of July 31, 2022, the Company had net operating loss carryforwards of approximately $38,036,909 and net operating loss carryforwards expire in 2022 through 2030. The current years net operating loss will carryforward indefinitely, limited to 80% of the current year taxable income.\nThe current income tax benefit of $7,972,562 generated for the year ended July 31, 2022 was offset by an equal increase in the valuation allowance. The valuation allowance was increased due to uncertainties as to the Companys ability to generate sufficient taxable income to utilize the net operating loss carryforwards which is the only significant component of deferred taxes.\nThe Company recognizes interest and penalties related to uncertain tax positions in general and administrative expense. As of July 31, 2022 and 2021 the Company has no unrecognized uncertain tax positions, including interest and penalties.\n12. STOCK WARRANTS\nThe following is a summary of warrant activity during the nine months ended July 31, 2022.\nNumber of Shares\nWeighted Average Exercise Price\nBalance, July 31, 2021\n815,379\n$ 16.21\nWarrants granted and assumed\n3,000,000\n.09\nWarrants expired\n(1,200,000 )\n-\nWarrants canceled\n(5,000 )\n(.05 )\nWarrants exercised\n-\n-\nBalance outstanding and exercisable, July 31, 2022\n2,610,379\n$ 1.26\n13. SHAREHOLDERS DEFICIT\nOverview\nThe Companys authorized capital stock consists of 500,000,000 shares of $0.001 par value common stock and 10,000,000 shares of $0.001 par value preferred stock.\nAs of July 31, 2022 and 2021, the Company had 32,491,671 and 29,287,337 shares of common stock issued and outstanding, respectively.\nAs of July 31, 2022 and 2021, the Company had 226,000 and 218,000 shares of Series A Preferred Stock issued and outstanding, respectively.\nAs of July 31, 2022 and 2021, the Company had 0 and 0 shares of Series B Preferred Stock issued and outstanding, respectively.\nAs of July 31, 2022 and 2021, the Company had 300 and 300 shares of Series C Preferred Stock issued and outstanding, respectively.\nSeries A Preferred Stock\nOn January 24, 2017, pursuant to Article III of our Articles of Incorporation, the Company designated a class of preferred stock, the Series A Preferred Stock, consisting of six million (3,000,000) shares, par value $0.001.\nUnder the Certificate of Designation, holders of the Series A Preferred Stock are entitled at their option to convert their preferred shares into common stock at a conversion rate of one hundred (100) shares of common stock for every one (1) share of Series A Preferred Stock. The holders are further entitled to vote together with the holders of the Companys common stock on all matters submitted to shareholders at a rate of one hundred (100) votes for each share held. The holders are entitled to equal rights with our common stockholders as it relates to liquidation preference.\nSeries B Preferred Stock\nOn May 12, 2017, pursuant to Article III of our Articles of Incorporation, the Company designated a class of preferred stock, the Series B Preferred Stock, consisting of up to one hundred twenty thousand (120,000) shares, par value $0.001. On June 5, 2017, the Company amended the designation to increase the number of shares of Series B Preferred Stock to one hundred sixty-five thousand (165,000) shares, par value $0.001.\nUnder the Certificate of Designation, as amended, holders of Series B Preferred Stock are entitled to a liquidation preference on the stated value of $10.00 per share. The shares carry a mandatory conversion provision, and all shares of Series B Preferred Stock will be redeemed by the Company one year from issuance, at a variable conversion rate equal to the stated price of $10.00 divided by the prior days closing price as quoted on OTC Markets. Holders of Series B Preferred Stock are not entitled to any voting or dividend rights.\nAs of July 31, 2022, all shares of Series B Preferred Stock eligible for mandatory conversion have been converted into common stock.\nSeries C Preferred Stock\nOn July 29, 2021, pursuant to Article III of our Articles of Incorporation, the Company designated a class of preferred stock, the Series C Preferred Stock, consisting of up to six hundred (300) shares, par value $0.001.\nUnder the Certificate of Designation, as amended, holders of Series C Preferred Stock are entitled to a liquidation preference on the stated value of $1,200 per share. Holders of Series C Preferred Stock are entitled to a cumulative dividend of 10% per annum. Series C Preferred Stock is convertible at the option of the Holder at a price equal to 80% of the lowest VWAP of the Common Stock during the twenty (20) Trading Days immediately preceding, but not including the Conversion Date. Series C Preferred Stock Holders will vote together with the common stock on an as-converted basis subject to the Beneficial Ownership Limitations.\nOn July 28, 2021 the Company sold 300 shares of Series C Preferred Stock for $300,000 cash.\nIssuances of Common and Preferred Stock for the year ended July 31, 2022:\nOn August 16, 2021 the Company issued 56,500 shares of common stock for services valued at $7,140, which had been previously provided and recorded as stock payable.\nOn August 16, 2021 the Company issued 60,000 shares of common stock for services valued at $13,890.\nOn August 16, 2021 the Company issued 500,000 shares of common stock for cash proceeds of $25,000 received in a prior period.\nOn August 19, 2021 the Company issued 300,000 shares of common stock for cash proceeds of $22,500 received in a prior period.\nOn August 19, 2021 the Company issued 500,000 shares of common stock for cash proceeds of $25,000 received in a prior period.\nOn August 19, 2021 the Company issued 500,000 shares of common stock for cash proceeds of $25,000 received in a prior period.\nOn August 26, 2021 the Company issued 800,000 shares of common stock for cash proceeds of $40,000 received in a prior period.\nOn August 26, 2021 the Company issued 533,334 shares of common stock for cash proceeds of $40,000 received in a prior period.\nOn September 13, 2021 a shareholder elected to convert 5,000 shares of Series A Preferred Stock into 500,000 shares of the companys Common Stock.\nOn September 13, 2021 the Company issued 200,000 shares of common stock for cash proceeds of $20,000 received in a prior period.\nOn September 13, 2021 the Company issued 200,000 shares of common stock for cash proceeds of $20,000 received in a prior period.\nOn June 24, 2021 the Company agreed to issue 59,500 shares of common stock per month for 6 months of services, ending on December 24, 2021. Per this agreement the Company agreed to issue 300,500 shares of common stock for services valued at $29,071 during the year ended July 31, 2022. As of July 31, 2022 the shares had not been issued and are included in stock payable.\nOn September 10, 2021 the Company issued 13,000 shares of the Companys Series A Preferred stock for services valued at $396,500.\nOn November 5, 2021 the Company issued 169,500 shares of common stock for services valued at $20,425.\nOn November 15, 2021 the Company issued 300,000 shares of common stock for services valued at $375,000.\nOn November 18, 2021 the Company received and cancelled 15,000 shares of common stock.\nOn December 17, 2021 the Company repurchased and cancelled 1,400,000 shares of common stock for $97,500.\nOn February 2, 2022 the Company agreed to issue 4,000,000 shares of common stock for cash proceeds of $160,000. As of July 31, 2022 the shares had not been issued and are included in stock payable.\nOn February 10, 2022 the Company agreed to issue 60,000 shares of common stock for cash proceeds of $3,000. As of July 31, 2022 the shares had not been issued and are included in stock payable.\nOn February 10, 2022 the Company agreed to issue 60,000 shares of common stock for cash proceeds of $3,000. As of July 31, 2022 the shares had not been issued and are included in stock payable.\nOn February 10, 2022 the Company agreed to issue 150,000 shares of common stock for cash proceeds of $6,000. As of July 31, 2022 the shares had not been issued and are included in stock payable.\n14. SUBSEQUENT EVENTS\nOn September 1, 2022 the Company issued 700,000 shares for services,\nOn November 10, 2022 the Company agreed to issue 1,700,000 shares for services. The shares have not yet been issued. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nThere are no reportable events under this item for the fiscal year ended July 31, 2022. Item 9A. Controls and Procedures.\nDisclosure Controls and Procedures\nThe Securities and Exchange Commission defines the term disclosure controls and procedures to mean the companys controls and other procedures of an issuer that are designed to ensure that information required to be disclosed in the reports that it files or submits under the Securities Exchange Act of 1934 (the Exchange Act) is recorded, processed, summarized and reported, within the time periods specified in the Securities and Exchange Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Securities Exchange Act of 1934 is accumulated and communicated to the issuers management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. The Company maintains such a simple system of controls and procedures in an effort to ensure that all information which it is required to disclose in the reports it files under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified under the SECs rules and forms and that information required to be disclosed is accumulated and communicated to principal executive and principal financial officers to allow timely decisions regarding disclosure.\nAs of the end of the period covered by this report, we carried out an evaluation, under the supervision and with the participation of our chief executive officer and chief financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures. Based on this evaluation, our chief executive officer and chief financial officer concluded that our disclosure controls and procedures were not effective to provide reasonable assurance of achieving the objectives of timely alerting them to material information required to be included in our periodic SEC reports and of ensuring that such information is recorded, processed, summarized and reported with the time periods specified. Our chief executive officer and chief financial officer also concluded that our disclosure controls and procedures were not effective as of the end of the period covered by this report to provide reasonable assurance of the achievement of these objectives.\nManagements Annual Report on Internal Control Over Financial Reporting\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting as defined in rule 13a-15(f) and 15d-15(f) under the Exchange Act. Internal control over financial reporting is a process designed by, or under the supervision of the CEO to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external purposes in accordance with generally accepted accounting principles. Internal controls over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records which in reasonable detail accurately and fairly reflect the transactions and disposition of the Companys assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of consolidated financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made in accordance with authorizations of management and Directors of the issuer; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the Companys consolidated financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nA material weakness is a deficiency or a combination of deficiencies in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim consolidated financial statements will not be prevented or detected on a timely basis.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of July 31, 2022. Based on this assessment, management concluded that, as of July 31, 2022, the Companys internal control over financial reporting was not effective based on those criteria.\nTo remediate our internal control weaknesses, management intends to implement the following measures when funds permit:\n·\nThe Company plans to add independent directors to its Board and create an audit committee with at least three directors that qualify as independent directors pursuant to relevant NASDAQ or similar exchange rules.\n·\nThe Company will add sufficient knowledgeable accounting personnel to properly segregate duties and to effect a timely, accurate preparation of the financial statements.\n·\nUpon the hiring of additional accounting personnel, the Company will develop and maintain adequate written accounting policies and procedures.\nThe additional hiring of accounting personnel and appointment of independent members of the Board is contingent upon the Companys operational efforts and results and available funds to implement such measures. Management plans to hire additional personnel and staff its audit committee with at additional independent directors in the coming fiscal year but provides no assurances that it will be able to do so.\nWe understand that remediation of material weaknesses and deficiencies in internal controls are a continuing work in progress due to the issuance of new standards and promulgations. However, remediation of any known deficiency is among our highest priorities. Our management will periodically assess the progress and sufficiency of our ongoing initiatives and make adjustments as and when necessary.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant rules of the SEC that permit us to provide only managements report in this annual report. On July 21, 2010, President Obama signed the Dodd-Frank Wall Street Reform and Consumer Protection Act. Included in the Act is a provision that permanently exempts smaller public companies that qualify as either a Non-Accelerated Filer or Smaller Reporting Company from the auditor attestation requirement of Section 404(b) of the Sarbanes-Oxley Act of 2002.\nThere was no change in our internal control over financial reporting during the fiscal quarter ended July 31, 2022, that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nChanges in Internal Control over Financial Reporting\nExcept as set forth above, there were no changes in our internal control over financial reporting that occurred during the period covered by this report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nLimitations on the Effectiveness of Controls\nThe Companys management, including the CEO and CFO, does not expect that our disclosure controls and procedures or our internal control over financial reporting will prevent or detect all error and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. Further, the design of the control system must reflect that there are resource constraints and that the benefits must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. Controls can also be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of controls. The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Projections of any evaluation of controls effectiveness to future periods are subject to risks. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures. Item 9B. Other Information.\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe names, ages, positions, periods served of the Companys present directors are set forth in the following table:\nName\nAge\nPositions\nPeriod of Service Began\nBrandon Romanek\nCEO, CFO, President, Treasurer, Secretary, Director (1)\nJanuary 12, 2017 (1)\n__________\n(1)\nAll directors hold office until the next annual meeting of stockholders and until their successors have been duly elected and qualified. Parker Mitchell served as our Chief Executive Officer from December 11, 2020-April 2, 2021. An individual identifying himself as Jonathan Cross (who the Company believes was actually John Dankovich) was appointed as the Chief Financial Officer of the Company on August 24, 2021, and he was terminated as the Chief Financial Officer of the Company on November 2, 2021. Joshua Halford served as a director of the Company from February 17, 2021-November 2, 2021, and as COO of the Company from March 8, 2021-November 8, 2021.\nThere are no agreements with respect to electing directors. The Board of Directors appoints officers annually and each executive officer serves at the discretion of the Board of Directors. The Company does not have any standing committees at this time, and due to its small size does not believe that committees are necessary at this time. The Companys Board fulfills the duties of an audit committee. None of the directors held any directorships during the past five years in any company with a class of securities registered pursuant to Section 12 of the Exchange Act or subject to the requirements of Section 15(d) of such act, or of any company registered as an investment company under the Investment Company Act of 1940.\nDirector and Officer Biographical Information\nBrandon Romanek\nBrandon Romaneks background in brokerage firms, hedge funds, institutions, money management, and trading prepared him for the task of building THC Therapeutics. Beginning in 1999, Mr. Romanek traded with Wedbush, Merrill Lynch other brokerage firms using portfolio margin. Mr. Romanek has traded on many platforms including Real Tick, Sterling, LightSpeed, and Firetip. From 2002-2006, Mr. Romanek traded CFDs with the CMC Markets in Toronto. From 2008, Mr. Romanek was a commodities trader in the precious metals markets. He was a broker dealer in physical metals from 2009-2011, mostly doing business with Amark, a publicly traded metals dealer. Mr. Romanek is also founder and CEO of SBR Asset Management. Mr. Romanek became the CEO, CFO, President, Treasurer, Secretary, and a director of the Company in January of 2017, and he has not been the director of any other public company during the past five years. We believe that Mr. Romaneks financial markets background makes him a valuable member of our Board of Directors.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, our sole officer and director, Mr. Romanek, has not, during the past ten years:\n(1)\nhad a petition under the Federal bankruptcy laws or any state insolvency law filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he was a general partner at or within two years before the time of such filing, or any corporation or business association of which he was an executive officer at or within two years before the time of such filing;\n(2)\nbeen convicted in a criminal proceeding or is a named subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n(3)\nbeen the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from, or otherwise limiting, the following activities:\n(i)\nActing as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\n(ii)\nEngaging in any type of business practice; or\n(iii)\nEngaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n(4)\nbeen the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any activity described in (3)(i) above, or to be associated with persons engaged in any such activity;\n(5)\nbeen found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n(6)\nbeen found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n(7)\nbeen the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\n(i)\nAny Federal or State securities or commodities law or regulation; or\n(ii)\nAny law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\n(iii)\nAny law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n(8)\nbeen the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nOur Directors are elected at the annual meeting of the stockholders, with vacancies filled by the Board of Directors, and serve until their successors are elected and qualified, or their earlier resignation or removal. Officers are appointed by the board of Directors and serve at the discretion of the board of Directors or until their earlier resignation or removal. Any action required can be taken at any annual or special meeting of stockholders of the corporation which may be taken without a meeting, without prior notice and without a vote, if consent of consents in writing setting forth the action so taken, shall be signed by the holders of the outstanding stock having not less than the minimum number of votes that would be necessary to authorize or take such action at a meeting at which all shares entitled to vote thereon were present and voted and shall be delivered to the corporation by delivery to its registered office, its principle place of business, or an officer or agent of the corporation having custody of the book in which the proceedings of meetings are recorded.\nIndemnification of Directors and Officers\nNevada law allows for the indemnification of officers, directors, and any corporate agents in terms sufficiently broad to indemnify such persons under certain circumstances for liabilities, including reimbursement for expenses, incurred arising as a result of their service as officers, directors or agents of the Company. The Bylaws of the Company provide that the Company will indemnify its directors and officers to the fullest extent authorized or permitted by law and such right to indemnification will continue as to a person who has ceased to be a director or officer of the Company and will inure to the benefit of his or her heirs, executors and similar successors; provided, however, that, except for proceedings to enforce rights to indemnification, the Company will not be obligated to indemnify any director or officer in connection with a proceeding (or part thereof) initiated by such person unless such proceeding (or part thereof) was authorized by the Board of Directors. The right to indemnification conferred will include the right to be paid by the Company the expenses (including attorneys fees) incurred in defending any such proceeding in advance of its final disposition.\nThe Company may, to the extent authorized from time to time by the Board of Directors, provide rights to indemnification and to the advancement of expenses to employees and agents of the Company similar to those conferred on directors and officers of the Company. Furthermore, the Company may maintain insurance, at its expense, to protect itself and any director, officer, employee or agent of the Company or another company against any expense, liability or loss, whether or not the Company would have the power to indemnify such person against such expense, liability or loss under Nevada law.\nCode of Ethics\nWe intend to adopt a code of ethics that applies to our officers, directors and employees, including our principal executive officer and principal accounting officer, but have not done so to date due to our relatively small size. We intend to adopt a written code of ethics in the near future. Item 11. Executive Compensation.\nThe table below summarizes all compensation awarded to, earned by, or paid to our former or current executive officers for the fiscal years ended July 31, 2022 and 2021.\nSummary Compensation Table\nStock\nOption\nAll Other\nSalary\nBonus\nAwards\nAwards\nCompensation\nTotal\nName and Principal Position\nYear\n($)\n($)\n($)\n($)\n($) (2)\n($)\nBrandon Romanek\n177,527\n-\n-\n-\n-\n177,527\nCEO, CFO, President & Director (1)\n178,000\n-\n-\n-\n42,000\n(2)\n220,000\nJohn Dankovich (3)\nFormer CFO\n-\n-\n-\n-\n-\n-\nParker Mitchell (4)\n-\n-\n-\n-\n-\n-\nFormer CEO\n8,226\n-\n-\n-\n-\n8,226\nJoshua Halford (5)\n26,568\n240,000\n396,500\n-\n-\n663,068\nFormer COO\n72,000\n-\n-\n-\n-\n72,000\n___________\n(1)\nMr. Romanek was appointed as CEO, CFO, President, Treasurer, Secretary and a director of the Company on January 12, 2017.\n(2)\nThe Company leased an office from Mr. Romanek for $1,500 per month.\n(3)\nAn individual first identifying himself as Jonathan Cross, who the Company believes was actually the convicted felon, John Dankovich, was appointed as the Chief Financial Officer of the Company on August 24, 2021, and he was terminated as the Chief Financial Officer of the Company on November 2, 2021.\n(4)\nMr. Mitchell served as CEO of the Company from December 11, 2020-April 2, 2021.\n(5)\nMr. Halford served as the COO of the Company from March 8, 2021-November 8, 2021.\nDirector Compensation\nNo directors of the Company receive compensation for serving as a director of the Company (although Mr. Romanek and Mr. Halford, directors during the fiscal year ending July 31, 2022, received compensation for their services as officers of the Company).\nEmployment Agreements\nExcept for the following agreements, the Company does not have any written agreements with any of its current executive officers or directors.\nOn November 1, 2017, we entered into an employment agreement with Brandon Romanek, our Chief Executive Officer. In accordance with this agreement, Mr. Romanek provides services to the Company in exchange for $78,000 per year plus vacation and bonuses as approved annually by the board of directors, as well as reimbursement of expenses incurred.\nOn February 1, 2019, we amended the employment agreement with Brandon Romanek, our Chief Executive Officer. In accordance with this agreement, Mr. Romanek provides services to the Company in exchange for $178,000 per year plus vacation and bonuses as approved annually by the board of directors, as well as reimbursement of expenses incurred. Pursuant to the original and amended employment agreement, Mr. Romaneks employment can be terminated by either the Company or Mr. Romanek at any time, but if the Company terminates Mr. Romanek for a reason other than total disability or Cause or if Mr. Romanek terminates his employment for Good Reason in the absence of Cause, then the Company is obligated to pay Mr. Romanek (i) a severance payment equal to 18 months salary plus one years incentive compensation bonus, and (ii) a pro rata portion of the bonus that Mr. Romanek would have received for the portion of the year that Mr. Romanek was employed, and any unvested equity compensation awards will immediately vest. Cause is generally defined as (i) willful failure to perform material duties, (ii) willful and gross misconduct, (iii) conviction or plea of no contest to the commission of a felony or any misdemeanor that is a crime of moral turpitude, (iv) breach of the non-competition, non-solicitation or confidentiality covenants in the employment agreement, or (v) any other willful act having the intended effect of injuring the reputation, business or business relationships of the Company or its affiliates. Good Reason is generally defined as a (i) a material reduction in the employees base salary or a material reduction in annual incentive compensation opportunity, in each case other than any isolated or inadvertent failure by Company that is not in bad faith and is cured within 30 business days after the employee gives Company notice of such event, (ii) a material diminution the employees title, duties and responsibilities, other than any isolated or inadvertent failure by Company that is not in bad faith and is cured within 30 business days after the employee gives Company notice of such event, (iii) a transfer of the employees primary workplace by more than 50 miles from his current workplace, or (iv) the failure of a successor to the Company to have assumed the employment agreement obligations in connection with any sale of the business. Finally, if there is a change of control of the Company (generally defined as the sale or other disposition of substantially all of the Companys property, assets or business or a merger or similar transaction with another entity in which more than 50% of the voting power of the Company is disposed of), Mr. Romanek will have the option to terminate his employment, and such termination will be considered a termination by the Company for reasons other than Cause (meaning that Mr. Romanek would be entitled to the severance and prorated bonus described above, and any unvested equity compensation awards would immediately vest).\nDuring the year ending July 31, 2021, the Company accrued $187,748 due to Mr. Romanek related to this agreement, and during the year ending July 31, 2022, the Company accrued $177,527 due to Mr. Romanek related to this agreement. As of July 31, 2022, Mr. Romanek has allowed the Company to defer a total of $662,961 in compensation earned to date related to his employment agreements with the Company.\nStock Option Plan and other Employee Benefits Plans\nThe Company does not maintain a Stock Option Plan or other Employee Benefit Plans.\nOverview of Compensation Program\nWe currently do not maintain a Compensation Committee of the Board of Directors. Until a formal committee is established, our entire Board of Directors has responsibility for establishing, implementing and continually monitoring adherence with the Companys compensation philosophy. The Board of Directors ensures that the total compensation paid to the executives is fair, reasonable, and competitive.\nCompensation Philosophy and Objectives\nThe Board of Directors believes that the most effective executive compensation program is one that is designed to reward the achievement of specific annual, long-term and strategic goals by the Company and that aligns executives interests with those of the stockholders by rewarding performance above established goals, with the ultimate objective of improving stockholder value. As a result of the size of the Company, the Board evaluates both performance and compensation on an informal basis. Upon hiring additional executives, the Board intends to establish a Compensation Committee to evaluate both performance and compensation to ensure that the Company maintains its ability to attract and retain superior employees in key positions and that compensation provided to key employees remains competitive relative.\nRole of Executive Officers in Compensation Decisions\nThe Board of Directors makes all compensation decisions for, and approves recommendations regarding equity awards to, the executive officers and directors of the Company. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following tables set forth, as of February 9, 2022, certain information concerning the beneficial ownership of our voting capital stock, including our common stock, and Series A Preferred Stock, Series B Preferred Stock, and Series C Preferred Stock, by:\n·\neach stockholder known by us to own beneficially 5% or more of any class of our outstanding voting stock;\n·\neach director;\n·\neach named executive officer;\n·\nall of our executive officers and directors as a group; and\n·\neach person, or group of affiliated persons, who is known by us to beneficially own more than 5% of any class of our outstanding stock.\nAs of February 9, 2022, the Company had authorized 500,000,000 shares of common stock and 10,000,000 shares of preferred stock, with 3,000,000 shares of preferred stock designated as Series A Preferred Stock, 165,000 shares of preferred stock designated as Series B Preferred Stock, and 300 shares of preferred stock designated as Series C Preferred Stock. There were 34,146,149 shares of common stock, 226,000 shares of Series A Preferred Stock, 0 shares of Series B Preferred Stock, and 300 shares of Series C Preferred Stock outstanding as of November 11, 2022. Each share of Series A Preferred Stock is convertible into 100 shares of common stock, and each share entitles the holder thereof to 100 votes per share. Each share of Series B Preferred Stock is convertible one year following issuance at a variable conversion rate equal to the stated price of $1.00 divided by the prior days closing price of the Companys common stock as quoted on the OTC Link, LLC, operated by OTC Markets Group, Inc. Each share of Series C Preferred Stock is convertible into at a variable conversion rate equal to 80% of the lowest volume-weighted average price of the Common Stock during the twenty (20) trading days immediately preceding, but not including, the date that a holder elects to convert the Series C Preferred Stock into common stock, and entitles the holder thereof to voting rights on an as-converted basis, subject to a 4.99% beneficial ownership limitation.\nBeneficial ownership is determined in accordance with the rules and regulations of the SEC and includes voting or investment power with respect to our common stock. Shares of our common stock subject to options that are currently exercisable or exercisable within 60 days of November 11, 2022, are considered outstanding and beneficially owned by the person holding the options for the purpose of calculating the percentage ownership of that person but not for the purpose of calculating the percentage ownership of any other person. Except as otherwise noted, we believe the persons and entities included in the below table have sole voting and investing power with respect to all of the shares of our common stock beneficially owned by them, subject to community property laws, where applicable, and their address is c/o the Company at 11700 W Charleston Blvd. #73, Las Vegas, Nevada, 89135.\nSecurity Ownership of Certain Beneficial Owners & Management\nTitle of Class\nName and Address of Beneficial Owner\nAmount and nature of beneficial ownership\nPercent of Class\nCommon Stock\nBrandon Romanek\n30,531,632\n(1)\n56.7\n%\nCommon Stock\nAll Directors and Officers as a Group\n30,531,632\n(1)\n56.7\n%\nSeries A Preferred Stock\nBrandon Romanek\n200,000\n88.5\n%\nSeries A Preferred Stock\nBrunson Chandler Jones\n15,000\n6.8\n%\n%Series A Preferred Stock\nAll Directors and Officers as a Group\n200,000\n88.5\n%\nSeries C Preferred Stock\nGHS Investments, LLC (2)\n200,000\n88.5\n%\nSeries C Preferred Stock\nAll Directors and Officers as a Group\n-\n-\n(1)\nIncludes 10,531,632 shares of common stock issued to Mr. Romanek, as well as 20,000,000 of common stock issuable to Mr. Romanek upon conversion to common stock of his 200,000 shares of Series A Preferred Stock.\n(2)\nThe Company believes that Matt Schissler and Mark Grober share voting and dispositive power over shares held in the name of GHS Investments, LLC, and that they therefore are deemed to be the beneficial owner of shares held in the name of GHS Investments, LLC. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nTransactions with Related Persons\nADVANCES FROM RELATED PARTIES\nOur Chief Executive Officer and Harvey Romanek, father of our Chief Executive Officer, previously agreed to advance funds to the Company from time to time to support the ongoing operations of the Company. Advances are due within ten days of demand and bear interest at 5% annually.\nAdvances from related parties consist of the following as of July 31, 2022 :\nPrincipal as of\nYear ending\nJuly 31, 2022\nPrincipal as of\nAccrued\ninterest balance\nAs of\nJuly 31,\nFunds\nadvanced\nFunds\nrepaid\nJuly 31,\nJuly 31,\nB. Romanek, President and CEO\n$ 25,920\n$ 102,881\n$ (54,562 )\n$ 74,239\n$ 1,345\nShareholder Relative of our President and CEO\n70,393\n-\n-\n70,393\n15,462\nTOTAL\n$ 96,313\n$ 102,881\n$ (54,562 )\n$ 144,632\n$ 16,807\nOn November 1, 2017, we entered into an employment agreement with Brandon Romanek, our Chief Executive Officer. In accordance with this agreement, Mr. Romanek provides services to the Company in exchange for $78,000 per year plus vacation and bonuses as approved annually by the board of directors, as well as reimbursement of expenses incurred. On February 1, 2019, we amended the employment agreement with Brandon Romanek, our Chief Executive Officer. In accordance with this agreement, Mr. Romanek provides services to the Company in exchange for $178,000 per year plus vacation and bonuses as approved annually by the board of directors, as well as reimbursement of expenses incurred.\nDuring the year ending July 31, 2022, the Company accrued $177,527 due to Mr. Romanek related to this agreement. As of July 31, 2022, Mr. Romanek has allowed the Company to defer a total of $662,961 in compensation earned to date related to his employment agreements.\nOn June 15, 2019, the Company entered into an employment agreement with Joshua Halford, a business development analyst for the Company, under the agreement Mr. Halford earns (i) $3,000 in compensation every other week, payable at the Companys election in cash or in the form of common stock registered with the SEC on Form S-8 with a 50% bonus for stock issuances made in lieu of cash payments at the time of issuance (for example, if the Company filed a registration statement on Form S-8 in the future, the Company could elect to pay Mr. Halford the $3,000 biweekly payment by issuing Mr. Halford $4,500 of S-8 registered Company common stock at the then-current common stock price instead of making a $3,000 cash payment to Mr. Halford), and (ii) 10% sales commissions. On February 18, 2020 the employment agreement was amended to $1,000 in compensation every other week to be paid in cash. During the year ended July 31, 2022 Mr. Halford earned $233,437.\nCONVERTIBLE NOTES PAYABLE RELATED PARTY\nOn May 1, 2019, we entered into a convertible promissory note pursuant to which we borrowed $200,000 from Harvey Romanek, the father of the Companys Chief Executive Officer, Brandon Romanek. Interest under the convertible promissory note is 10% per annum, and the principal and all accrued but unpaid interest is due on May 1, 2021. The note is convertible six months after the issuance date at the noteholders option into shares of our common stock at a Variable Conversion Price of 65% multiplied by the lowest Trading Price for the Common Stock during the ten (10) Trading Day period ending on the last complete Trading Day prior to the Conversion Date.\nThe Company recorded a debt discount in the amount of $200,000 in connection with the original issuance discount, offering costs and initial valuation of the derivative liability related to the embedded conversion option of the Note to be amortized utilizing the effective interest method of accretion over the term of the Note. The aggregate debt discount has been accreted and charged to interest expenses as a financing expense in the amount of $0 during the year ending July 31, 2022.\nFurther, the Company recognized a derivative liability of $387,232 and an initial loss of $187,232 based on the Black-Scholes pricing model.\nAs of July 31, 2022, convertible notes due to related parties net of unamortized debt discounts of $0, was $200,000.\nPromoters and Certain Control Persons\nNone.\nList of Parents\nNone.\nDirector Independence\nThe Company currently has two directors, and neither of the directors is independent under either board or committee independence standards. The Company does not have a compensation, nominating or audit committee. Item 14. Principal Accounting Fees and Services.\nThe following table sets forth the fees billed by our principal independent accountants for the years indicated, for the categories of services indicated.\nYears Ended July 31,\nCategory\nAudit Fees\n$ 15,000\n$ 19,500\nAudit Subsequent Related Fees\n-\n-\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTotal\n$ 15,000\n$ 19,500\nAudit fees. Consists of fees billed for the audit of our annual consolidated financial statements and review of our interim financial information and services that are normally provided by the accountant in connection with year-end and quarter-end statutory and regulatory filings or engagements.\nAudit-related fees. Consists of fees billed for services relating to review of other regulatory filings including registration statements, periodic reports and audit related consulting.\nTax fees. Consists of professional services rendered by our principal accountant for tax compliance, tax advice and tax planning.\nOther fees. Other services provided by our accountants.\nPART IV Item 15. Exhibits, Financial Statement Schedules.\nEXHIBIT INDEX\nExhibit\nDescription\n3.1\nBylaws (incorporated by reference to Registration Statement on Form 10 filed on October 19, 2018; File No. 000-55994; Exhibit 3.1 thereto)\n3.2\nArticles of Incorporation filed May 1, 2007 (incorporated by reference to Registration Statement on Form 10 filed on October 19, 2018; File No. 000-55994; Exhibit 3.2 thereto)\n3.3\nArticles of Amendment filed January 23, 2017 (incorporated by reference to Registration Statement on Form 10 filed on October 19, 2018; File No. 000-55994; Exhibit 3.3 thereto)\n3.4\nArticles of Amendment filed January 17, 2018 (incorporated by reference to Registration Statement on Form 10 filed on October 19, 2018; File No. 000-55994; Exhibit 3.4 thereto)\n3.5\nCertificate of Designation for Series A Preferred Stock filed January 24, 2017 (incorporated by reference to Registration Statement on Form 10 filed on October 19, 2018; File No. 000-55994; Exhibit 3.5 thereto)\n3.6\nCertificate of Designation for Series B Preferred Stock May 12, 2017 (incorporated by reference to Registration Statement on Form 10 filed on October 19, 2018; File No. 000-55994; Exhibit 3.6 thereto)\n3.7\nAmended Certificate of Designation for Series B Preferred Stock filed June 5, 2017 (incorporated by reference to Registration Statement on Form 10 filed on October 19, 2018; File No. 000-55994; Exhibit 3.7 thereto)\n3.8\nArticles of Amendment filed September 28, 2018 (incorporated by reference to Registration Statement on Form 10 filed on October 19, 2018; File No. 000-55994; Exhibit 3.8 thereto)\n10.1\nAsset Purchase Agreement with Brandon Romanek dated January 20, 2017 (incorporated by reference to Registration Statement on Form 10 filed on October 19, 2018; File No. 000-55994; Exhibit 10.1 thereto)\n10.2\nPatent Assignment by and between Harvey Romanek and Brandon Romanek dated November 7, 2016 (incorporated by reference to Registration Statement on Form 10/A filed on October 4, 2019; File No. 000-55994; Exhibit 10.2 thereto)\n10.3\nPatent Assignment Confirmation and Release by Brandon Romanek (incorporated by reference to Registration Statement on Form 10/A filed on October 4, 2019; File No. 000-55994; Exhibit 10.3 thereto)\n10.4\nPatent Assignment Confirmation and Release by Harvey Romanek (incorporated by reference to Registration Statement on Form 10/A filed on October 4, 2019; File No. 000-55994; Exhibit 10.4 thereto)\n10.5\nAsset Purchase Agreement with Urban Oasis Float Center, LLC dated June 1, 2017 (incorporated by reference to Registration Statement on Form 10/A filed on April 8, 2019; File No. 000-55994; Exhibit 10.2 thereto)\n10.6\nAmended Employment Agreement with Brandon Romanek February 1, 2019 (incorporated by reference to Form 10/A filed on August 22, 2019, File No. 000-55994; Exhibit 10.4 thereto)\n10.7\nEmployment Agreement with Joshua Halford dated June 15, 2019 (incorporated by reference to Registration Statement on Form 10/A filed on July 8, 2019; File No. 000-55994; Exhibit 10.5 thereto)\nSubsidiaries (incorporated by reference to Registration Statement on Form 10 filed on October 19, 2018; File No. 000-55994; Exhibit 21 thereto)\n31.1*\nCertification of Principal Executive Officer required by Rule 13a-14(1) or Rule 15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2*\nCertification of Principal Financial Officer required by Rule 13a-14(1) or Rule 15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1*\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 and Section 1350 of 18 U.S.C. 63\n32.2*\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 and Section 1350 of 18 U.S.C. 63\nInteractive data files pursuant to Rule 405 of Regulation S-T.\n________________\n*\nFiled herewith.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n/s/ Brandon Romanek\nNovember 22, 2022\nBrandon Romanek, Chief Executive Officer & President\nDate\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n/s/ Brandon Romanek\nNovember 22, 2022\nBrandon Romanek, Director\nDate"
}