{
    "cik": "1406587",
    "company": "Forestar Group Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-11-17",
    "period_of_report": "2022-09-30",
    "sic": "6500",
    "state_of_inc": "DE",
    "state_location": "TX",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1406587/0001406587-22-000128-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1406587/000140658722000128/for-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1406587/0001406587-22-000128.txt",
    "filename": "1406587_10K_2022_0001406587-22-000128.htm",
    "content": "Item 1. Business.\nOverview\nForestar Group Inc. is a national, well-capitalized residential lot development company focused primarily on making investments in land acquisition and development to sell finished single-family residential lots to homebuilders. Our common stock is listed on the New York Stock Exchange (NYSE) under the ticker symbol FOR. The terms Forestar, the Company, we and our used herein refer to Forestar Group Inc., a Delaware corporation, and its predecessors and subsidiaries.\nWe conduct a wide range of project planning and management activities related to the entitlement, acquisition, community development and sale of residential lots. We generally secure entitlements while the land is under contract by creating plans that meet the needs of the markets where we operate, and we aim to have all entitlements secured before closing on the investment. Moving land through the entitlement and development process creates significant value. We primarily invest in entitled short-duration projects that can be developed in phases, enabling us to complete and sell lots at a pace that matches market demand, consistent with our focus on maximizing capital efficiency and returns. This strategy is a unique, lower-risk business model that we expect will produce more consistent returns than other public and private land developers. We also make short-term strategic investments in finished lots (lot banking) and undeveloped land (land banking) with the intent to sell these assets within a short time period to utilize available capital prior to its deployment into longer-term lot development projects. For the year ended September 30, 2022, we sold 17,691 lots with an average sales price of $86,300. At September 30, 2022, our lot position consisted of 90,100 residential lots, of which approximately 61,800 were owned and 28,300 were controlled through purchase contracts. Of our 61,800 owned lots, approximately 19,200 lots are under contract to be sold for an aggregate remaining sales price of approximately $1.5 billion.\nWe have expanded and diversified our lot development operations across 53 markets in 21 states by investing available capital into our existing markets and by entering new markets. We believe our geographically diverse operations provide a strong platform for us to consolidate market share in the highly fragmented lot development industry. We also believe our geographic diversification lowers our operational risks and enhances our earnings potential by mitigating the effects of local and regional economic cycles.\nOur customers are primarily local, regional and national homebuilders. The lots we deliver in our communities are primarily for entry-level, first-time move-up and active adult homes. Entry-level and first-time move-up homebuyers are the largest segments of the new home market. We also market some of our communities towards build-to-rent operators.\nOur real estate origins date back to the 1954 incorporation of Lumbermens Investment Corporation, which became a wholly-owned subsidiary of the predecessor to Temple-Inland Inc. (\"Temple-Inland\") in 1971. We changed our name to Forestar Real Estate Group Inc. after Temple-Inland began reporting us as a separate business segment in 2006, and in 2007, Temple-Inland completed a tax-free distribution of our shares to its stockholders, making us an independent publicly-traded company. In 2008, we changed our name from Forestar Real Estate Group Inc. to Forestar Group Inc. We became a majority-owned subsidiary of D.R. Horton, Inc. (\"D.R. Horton\") in October 2017 by virtue of a merger with a wholly-owned subsidiary of D.R. Horton. Immediately following the merger, D.R. Horton owned 75% of our outstanding common stock, and as of September 30, 2022 they owned approximately 63% of our outstanding common stock. As our controlling shareholder, D.R. Horton has significant influence in guiding our strategic direction and operations. In connection with the merger, we entered into certain agreements with D.R. Horton including a Stockholders Agreement, a Master Supply Agreement and a Shared Services Agreement. Under the terms of the Master Supply Agreement, we supply finished lots to D.R. Horton at market terms offered by Forestar and both companies identify land development opportunities to expand our portfolio of assets.\nWe manage our operations through our real estate segment. Our national footprint provides diversification in our real estate inventory investments and our sources of revenues and earnings. At September 30, 2022, we conducted our operations in the states and markets listed below.\nState Market State Market\nAlabama Birmingham Maryland Washington/Arlington/Alexandria\nHuntsville\nMobile/Baldwin County Minnesota Minneapolis/St. Paul\nTuscaloosa\nNevada Las Vegas\nArizona Phoenix Reno\nTucson\nNew Jersey Southern New Jersey\nCalifornia Riverside County\nNew Mexico Albuquerque\nColorado Denver\nFort Collins North Carolina Asheville\nCharlotte\nFlorida Fort Myers/Naples Greensboro\nGainesville Greenville\nJacksonville Raleigh-Durham\nLakeland Wilmington\nMelbourne\nMiami/Fort Lauderdale Ohio Columbus\nOcala Cincinnati\nOrlando\nPensacola/Panama City Pennsylvania Allentown/Bethlehem/Easton\nPort St. Lucie\nTampa/Sarasota South Carolina Charleston\nVolusia County Greenville/Spartanburg\nWest Palm Beach Hilton Head\nGeorgia Atlanta Tennessee Nashville\nAugusta\nSavannah Texas Austin\nDallas\nIllinois Chicago Fort Worth\nHouston\nIndiana Indianapolis San Antonio\nIowa Des Moines Washington Seattle/Tacoma/Everett\nWhen evaluating new or existing markets for purposes of capital allocation, we consider local, market-specific factors, including, among others:\neconomic conditions;\nemployment levels and job growth;\nhousing demand and affordability;\navailability of land and lots in desirable locations on acceptable terms;\nland entitlement and development processes;\navailability of qualified subcontractors;\nnew and secondary home sales activity;\ncompetition; and\nperformance capabilities of our local management teams.\nBusiness Operations\nThe majority of our real estate projects are single-family residential communities. We primarily purchase land in the open market and install the necessary infrastructure to develop the land into finished residential lots for single-family homes. Our customers are primarily local, regional and national homebuilders. Our managers are responsible for the following activities related to our land and lot acquisition and development activities:\nsite selection, which involves:\n-a feasibility study;\n-soil and environmental reviews;\n-review of existing zoning and other governmental requirements;\n-review of the need for and extent of offsite work required to obtain project entitlements and to complete necessary infrastructure; and\n-financial analysis of the potential project;\nnegotiating land acquisition, lot purchase and related contracts;\nobtaining all necessary land development approvals;\nselecting land development subcontractors and ensuring their work meets our contracted scopes;\nplanning and managing land development schedules;\ndetermining the sales pricing for each lot in a given project;\ndeveloping and implementing marketing and sales plans; and\ncoordinating all interactions with customers throughout the lot sale process.\nOur corporate executives and corporate office personnel provide control and oversight functions to many important risk elements in our operations, including:\nallocation of capital;\ncash management;\nreview and approval of business plans and budgets;\nreview, approval and funding of land and lot acquisitions (Board of Directors must approve acquisitions greater than $20 million in accordance with the Stockholder's Agreement);\nenvironmental assessments of land and lot acquisitions;\nreview of all business and financial analysis for potential land and lot inventory investments;\noversight of land and lot inventory levels;\nmonitoring and analysis of profitability, returns and costs; and\nreview of major personnel decisions and incentive compensation plans.\nOur corporate executives and office personnel are responsible for establishing our operational policies and internal control standards and monitoring compliance with established policies and controls throughout our operations. We have a Shared Services Agreement with D.R. Horton whereby D.R. Horton provides us with certain administrative, compliance, operational and procurement services. Our corporate executives and office personnel are responsible for, and provide oversight and review for, the following shared services performed by D.R. Horton:\nfinance and treasury;\nrisk and insurance;\ninformation technology;\ninternal audit;\ninvestor relations; and\nhuman resources, payroll and employee benefits.\nWe have a Master Supply Agreement with D.R. Horton which establishes our business relationship with D.R. Horton as both companies identify residential real estate opportunities. The agreement provides D.R. Horton the right of first offer to purchase, at market prices and terms offered by Forestar, up to 100% of the lots from D.R. Horton sourced projects, up to 50% of the lots in the first phase of a Forestar sourced project and up to 50% of the lots in any subsequent phase in which D.R. Horton purchases at least 25% of the lots in the previous phase. D.R. Horton has no such rights on third-party sourced development opportunities. The Master Supply Agreement continues until the earlier of (i) the date at which D.R. Horton owns less than 15% of our voting shares or (ii) June 29, 2037; however, we may terminate the agreement at any time when D.R. Horton owns less than 25% of our voting shares.\nWe have a Stockholder's Agreement with D.R. Horton which defines D.R. Hortons right to nominate members to our Board, requires D.R. Hortons consent for certain transactions and establishes an investment committee. D.R. Horton has the right to nominate our Board members commensurate with its equity ownership. As long as D.R. Horton owns at least 20% of our voting securities, it retains the right to nominate individuals to our Board based on its equity ownership as well as designate the Executive Chairman.\nAs long as D.R. Horton owns at least 35% of our voting securities, we must obtain D.R. Hortons consent to (i) issue any new class of equity or shares of our common stock in excess of certain amounts; (ii) incur, assume, refinance or guarantee debt that would increase our total leverage to greater than 40%; (iii) select, terminate, remove or change compensation arrangements for the Executive Chairman, Chief Executive Officer, Chief Financial Officer and other key senior management; and (iv) make an acquisition or investment greater than $20 million. The Stockholders Agreement also establishes an investment committee to approve new investments up to $20 million.\nLand/Lot Acquisition and Inventory Management\nWe acquire land for use in our development operations after we have completed due diligence and obtained the development rights (known as entitlements). Before we acquire lots or tracts of land, we complete a feasibility study, which includes soil tests, independent environmental studies, other engineering work and financial analysis. We also evaluate the status of necessary zoning and other governmental entitlements required to develop the property for home construction. Although we purchase and develop land primarily to sell finished lots to homebuilders, we may sell land where we have excess land positions or for other strategic reasons.\nWe also enter into land purchase contracts, whereby we obtain the right, but generally not the obligation, to buy land at predetermined prices on a defined schedule commensurate with planned development. These contracts generally are non-recourse, which limits our financial exposure to our earnest money deposited into escrow under the terms of the contract and any pre-acquisition due diligence costs we incur. This enables us to control land with limited capital investment.\nWe attempt to mitigate our exposure to real estate inventory risks by:\nmanaging our supply of land and lots owned and controlled through purchase contracts in each market based on anticipated future demand;\nmonitoring local market and demographic trends that affect housing demand;\nlimiting the size of our land development projects and focusing on short duration projects;\nacquiring land entitled for single-family residential housing and managing our development in phases;\nfocusing on developing lots for entry-level housing, the segment where housing demand has been the highest;\ndeveloping the majority of our lots for a known buyer; and\ngeographically diversifying our land portfolio.\nLand Development\nSubstantially all of our land development work is performed by subcontractors. Subcontractors typically are selected after a competitive bidding process pursuant to a contract that obligates the subcontractor to complete the scope of work at an agreed-upon price and within a specified time frame. We monitor land development activities, participate in major decisions, coordinate the activities of subcontractors and suppliers, review the work of subcontractors for quality and cost controls and monitor compliance with building codes or other regulations.\nWe typically do not maintain inventories of land development materials except for work-in-progress materials for active development projects. Generally, the materials used in our operations have been readily available from numerous sources. In fiscal 2021, our development cycle time lengthened primarily due to the COVID-19 pandemic and its effects on our supply chain, which resulted in shortages of certain construction materials and tightness in the labor market. Continuing supply chain delays and disruptions during fiscal 2022 lengthened our development cycle time further.\nWe are subject to governmental regulations that affect our land development operations. In fiscal 2021 and 2022, municipalities and other government agencies were frequently delayed in granting the proper approvals to us, which delayed our development activities in certain markets.\nIn select situations, we contract with D.R. Horton for land development services, generally in geographic markets where we do not have established development teams and capabilities.\nLot/Land Banking\nIn addition to our residential lot development activities, we also make strategic short-term investments in finished lots (lot banking) and undeveloped land (land banking) with the intent to sell these assets within a short time period, primarily to D.R. Horton, utilizing available capital prior to its deployment into longer term lot development projects. We manage our level of lot/land banking relative to short-term liquidity and expected future cash requirements for lot development projects.\nCost Controls\nWe control development costs by designing our communities efficiently and by obtaining competitive bids for materials and labor. We monitor our land development expenditures versus budgets for each project, and we review our inventory levels, margins, expenses, profitability and returns for each project compared to its business plan and our performance expectations.\nCompetition\nWe face significant competition for the acquisition, development and sale of real estate in our markets. Our major competitors include numerous national, regional and local developers, including homebuilders. In addition, we compete with other development projects offering similar amenities, products and/or locations. Competition also exists for investment opportunities, financing, available land, raw materials and labor. Some of our real estate competitors are well established and financially strong, may have greater financial, marketing and other resources than we do, or may be larger than us and/or have lower cost of capital and operating costs than we have and expect to have. The presence of competition may increase the bargaining power of property owners seeking to sell. These competitive market pressures can sometimes make it difficult to acquire, develop or sell land and lots at prices that meet our return criteria.\nThe land and lot acquisition and development business is highly fragmented, and we are unaware of any meaningful concentration of national market share by any one competitor. Enterprises of varying sizes, from individuals or small companies to large corporations, actively engage in the real estate development business. Many competitors are local, privately-owned companies. We have a few regional and national land developer competitors in addition to national homebuilders that may develop lots on which they construct and sell homes. During periods when access to capital is restricted, participants in a weaker financial condition tend to be less active.\nSales Contracts and Backlog\nOur lot sales contracts require an earnest money deposit, which can vary in amount across our markets and communities. We have the right to either retain or refund customer deposits on canceled lot purchase contracts, depending upon the applicable provisions of the contract or other circumstances. The length of time between the signing of a lot sales contract and delivery of the lot to the customer (closing) is generally from three to twelve months. At September 30, 2022, our lots owned included approximately 19,200 lots (31%) that were under contract to be sold, of which approximately 17,800 lots are under contract to D.R. Horton.\nHuman Capital Resources\nPeople and Culture\nFor the past three fiscal years, despite the COVID-19 pandemic, we increased the number of employees and made no reductions to our employee compensation plans or employee benefit plans. We have increased our number of employees from 250 at September 30, 2021 to 291 at September 30, 2022 to support the growth of our residential lot development business across a geographically diversified platform. At September 30, 2022, 231 of our employees worked in our regional and divisional offices and 60 worked at our corporate office. In fiscal 2022, our total cost for employee compensation and benefits was $58.4 million. In addition to our employees, we also have a Shared Services Agreement with D.R. Horton whereby D.R. Horton employees provide us with certain administrative, compliance, operational and procurement services.\nWe believe the people who work for our company are our most important resources and are critical to our continued success. We focus significant attention toward attracting and retaining talented and experienced individuals to manage and support our operations. Our people are expected to exhibit and promote honest, ethical and respectful conduct in the workplace. All of our employees must certify to their understanding of and adhere to a code of conduct that sets standards for appropriate behavior and includes required internal training on preventing, identifying, reporting and stopping any type of discrimination.\nRecruitment, Development and Retention\nWe are committed to hiring, developing and supporting an energetic, diverse workforce and maintaining a productive, positive and inclusive workplace. We believe diversity in the workplace produces unique perspectives and fresh ideas and helps us better serve our customers. We have an active recruiting team that partners with college campuses and external organizations to identify strong new hires and experienced professionals. Our paid internship program provides college students and recent graduates an opportunity to work alongside some of the most experienced professionals in the land development industry. Management is committed to supporting the development of our employees in many ways including onboarding programs, training and providing employees exposure to senior management. Our management team also supports a culture of developing future leaders from our existing workforce, enabling us to promote from within for many leadership positions. We believe this provides long-term focus and continuity to our operations while also providing opportunities for the growth and advancement of our employees. During fiscal 2022, 19 employees were placed into new leadership positions in our regional and divisional offices, and of those, 74% were promoted from within the organization.\nCompensation and Benefits\nWe believe our compensation package and benefits are competitive with others in our industry. In addition to base pay, eligible employees may participate in our incentive bonus and stock compensation plans, which align their compensation to the interests of our shareholders. We also offer our employees a broad range of benefits, including paid vacation, holidays, sick time and parental leave; medical, dental and vision healthcare insurance and life insurance and disability coverage. We are committed to supporting our employees in their health, wellness and financial planning goals. Additional benefits offered include a 401(k) savings plan, employee stock purchase plan and access to professional resources to support employees with their mental and physical health, financial planning, identify theft protection and legal needs. Additional information about our employee benefit plans is included in Note 11 to the accompanying financial statements.\nWorkplace Safety and Wellness\nThe safety and well-being of our employees are our first priority. We take workplace safety seriously at our construction sites and in our offices. Our organization strives for a zero-incident safety culture and full compliance with safety regulations. We provide certification training to our field personnel through an Occupational Safety and Health Administration authorized third-party vendor; we provide our teams with an abundance of safety resources, including safety checklists, policies, procedures, and best practices; and we communicate with all of our employees through a monthly safety newsletter to inform and reinforce our commitment to and concern for their well-being. We also require certain personal protective equipment, such as hard hats, high visibility safety wear and hearing and eye protection to be worn in certain circumstances at our active development sites. Additionally, because substantially all of our land development work is performed by subcontractors, we require that our subcontractors maintain safety programs.\nDuring the COVID-19 pandemic, we implemented safety protocols to protect our employees and contractors. These protocols included complying with health and safety standards as required by federal, state and local government agencies, taking into consideration guidelines of the Centers for Disease Control and Prevention and other public health authorities. Many of our administrative and operational functions during this period required modification, including some of our workforce working remotely. Our teams adapted to the changes in our work environment and managed our business successfully during this challenging time. To support our employees throughout the pandemic, employee access to remote work and virtual meetings was expanded. Once available, COVID-19 vaccinations were provided at no charge through Company sponsored health insurance plans. We also have had no workforce or salary reductions related to the pandemic.\nGovernmental Regulation and Environmental Matters\nOur operations are subject to extensive and complex regulations. We, and the subcontractors we use, must comply with many federal, state and local laws and regulations. These include zoning, permitting, density and development requirements, and building, environmental, advertising, labor and real estate sales rules and regulations. These regulations and requirements substantially affect all aspects of our land development and sales processes in varying degrees across our markets. Our properties are subject to inspection and approval by local authorities where required and may be subject to various assessments for schools, parks, streets, utilities and other public improvements. We may experience delays in receiving the proper approvals from local authorities that could delay our anticipated development activities in certain projects.\nOur land development activities are also subject to an extensive array of local, state and federal statutes, ordinances, rules and regulations concerning protecting health, safety and the environment. The particular compliance requirements for each site vary greatly according to location, environmental condition and the present and former uses of the site and adjoining properties. We believe that we are in compliance in all material respects with existing environmental regulations applicable to our business. Additionally, our compliance with such regulations has not had, nor is expected to have, a material adverse effect on our consolidated financial position, results of operations or cash flows. However, changes in regulations could increase our costs to comply with such regulations, as discussed in Item 1A. Risk Factors.\nDiscussion of our business and operations included in this annual report on Form 10-K should be read together with the risk factors set forth below. They describe various risks and uncertainties we are or may become subject to, many of which are difficult to predict or beyond our control. Although the risks are organized and described separately, many of the risks are interrelated. These risks and uncertainties, together with other factors described elsewhere in this report, have the potential to affect our business, financial condition, results of operations, cash flows, strategies or prospects in a material and adverse manner.\nRisks Related to our Concentrated Ownership\nSo long as D.R. Horton controls us, our other stockholders will have limited ability to influence matters requiring stockholder approval, and D.R. Horton's interest may conflict with the interests of other current or potential holders of our securities.\nD.R. Horton beneficially owns approximately 63% of our common stock. As a result, until such time as D.R. Horton and its controlled affiliates hold shares representing less than a majority of the votes entitled to be cast by our stockholders at a stockholder meeting, D.R. Horton generally has the ability to control the outcome of any matter submitted for the vote of our stockholders, except in certain circumstances set forth in our certificate of incorporation or bylaws. In addition, under the terms of our certificate of incorporation and the Stockholder's Agreement with D.R. Horton, so long as D.R. Horton or its affiliates own 35% or more of our voting securities, we may not take certain actions without D.R. Horton's approval, including certain actions with respect to equity issuances, indebtedness, acquisitions, fundamental changes in our business and executive hiring, termination and compensation.\nFor so long as D.R. Horton and its controlled affiliates hold shares of our common stock representing at least 20% of the votes entitled to be cast by our stockholders at a stockholder meeting, D.R. Horton is able to designate a certain number of the members of our Board of Directors. Currently, D.R. Horton has the right to designate four out of five members of our Board, subject to a requirement that we and D.R. Horton use reasonable best efforts to cause at least three directors to qualify as independent directors, as such term is defined in the New York Stock Exchange (\"NYSE\") listing rules, and applicable law. The directors designated by D.R. Horton have the authority to make decisions affecting our capital structure, including the issuance of additional capital stock or options, the incurrence of additional indebtedness, the implementation of stock repurchase programs and the declaration of dividends. The interests of D.R. Horton may be materially different than the interests of our other stakeholders.\nThe interests of D.R. Horton may not coincide with the interests of our current or potential stockholders. D.R. Horton's ability, subject to the limitations in the Stockholder's Agreement and our certificate of incorporation and bylaws, to control matters submitted to our stockholders for approval limits the ability of other stockholders to influence corporate matters, which may cause us to take actions that our other stockholders do not view as beneficial to them. In such circumstances, the market price of our common stock could be adversely affected, and our ability to access the capital markets may also be adversely affected. In addition, the existence of a controlling stockholder may have the effect of making it more difficult for a third party to acquire us, or may discourage a third party from seeking to acquire us. A third party would be required to negotiate any such transaction with D.R. Horton, and the interests of D.R. Horton with respect to such transaction may be different from the interests of our other stockholders.\nSubject to limitations in the Stockholder's Agreement and our certificate of incorporation that limit D.R. Horton's ability to take advantage of certain corporate opportunities that are presented directly to our officers or directors in their capacity as such, D.R. Horton is not restricted from competing with us or otherwise taking for itself or its other affiliates certain corporate opportunities that may be attractive to us.\nAny inability to resolve favorably any disputes that may arise between us and D.R. Horton may result in a significant reduction of our revenues and earnings.\nDisputes may arise between D.R. Horton and us in a number of areas, including:\nbusiness combinations involving us;\nsales or dispositions by D.R. Horton of all or any portion of its ownership interest in us;\nperformance under the Master Supply Agreement;\narrangements with third parties that are exclusionary to D.R. Horton or us; and\nbusiness opportunities that may be attractive to both D.R. Horton and us.\nWe may not be able to resolve any potential conflicts, and even if we do, the resolution may be less favorable than if we were dealing with an unaffiliated party.\nNew agreements may be entered into between D.R. Horton and us, and agreements we enter into with D.R. Horton may be amended upon agreement between the parties. Because we are controlled by D.R. Horton, we may not have the leverage to negotiate these agreements, or amendments thereto if required, on terms as favorable to us as those that we would negotiate with an unaffiliated third party.\nD.R. Horton's ability to control our Board may make it difficult for us to recruit independent directors.\nSo long as D.R. Horton and its controlled affiliates hold shares of our common stock representing at least 20% of the votes entitled to be cast by our stockholders at a stockholders' meeting, D.R. Horton is able to designate a certain number of the members of our Board. Our Nominating and Governance Committee has the right to designate the remaining number of individuals to the Board, and in any event not less than one. Currently, D.R. Horton has the right to designate four out of five members of our Board. Further, the interests of D.R. Horton and our other stockholders may diverge. Under these circumstances, persons who might otherwise accept an invitation to join our Board may decline.\nWe qualify as a controlled company within the meaning of the NYSE rules and, as a result, may elect to rely on exemptions from certain corporate governance requirements that provide protection to stockholders of companies that are not controlled companies.\nSo long as D.R. Horton owns more than 50% of the total voting power of our common stock, we qualify as a \"controlled company\" under the NYSE corporate governance standards. As a controlled company, we may under the NYSE rules elect to be exempt from obligations to comply with certain NYSE corporate governance requirements, including the requirements:\nthat a majority of our Board consist of independent directors;\nthat we have a nominating and governance committee that is composed entirely of independent directors with a written charter addressing the committee's purpose and responsibilities;\nthat we have a compensation committee that is composed entirely of independent directors with a written charter addressing the committee's purpose and responsibilities; and\nthat an annual performance evaluation of the nominating and governance committee and compensation committee be performed.\nWe have not elected to utilize the controlled company exemptions at this time. However, if we elect to use the controlled company exemptions, our stockholders will not have the same protections afforded to stockholders of companies that are subject to all of the NYSE corporate governance requirements.\nWe may not realize potential benefits of the strategic relationship with D.R. Horton, including the transactions contemplated by the Master Supply Agreement with D.R. Horton.\nThe Master Supply Agreement establishes a strategic relationship between us and D.R. Horton for the supply of developed lots. Under the Master Supply Agreement, we will, and D.R. Horton may, present lot development opportunities to each other, subject to certain exceptions. The parties may collaborate with respect to such opportunities and, if they elect to develop such opportunities, D.R. Horton has a right of first offer or right to purchase some or all of the lots developed by us, as set forth in the Master Supply Agreement, on market terms offered by Forestar. There are numerous uncertainties associated with our relationship with D.R. Horton, including the risk that the parties will be unable to negotiate mutually acceptable terms for lot development opportunities and the fact that D.R. Horton is not obligated to present its lot development opportunities to us. As a result, we may not realize potential growth or other benefits from the strategic relationship with D.R. Horton, which may affect our financial condition or results of operations.\nD.R. Horton's control of us or the strategic relationship between D.R. Horton and us may negatively affect our business relationships with other builder customers.\nSo long as D.R. Horton controls us or the strategic relationship between D.R. Horton and us remains in place, our business relationships with other builder customers may be negatively affected, including the risk that such other builder customers may believe that we will favor D.R. Horton over our other customers. In addition, we have in the past relied on builder referrals as a source for land development opportunities, and there is a risk that builders may refer such opportunities to land developers other than us as a result of our close alignment with D.R. Horton.\nRisks Related to Our Business and our Industry\nThe homebuilding and lot development industries are cyclical and affected by changes in economic, real estate or other conditions that could adversely affect our business or financial results.\nThe homebuilding and lot development industries are cyclical and are significantly affected by changes in general and local economic and real estate conditions, such as:\nemployment levels;\nconsumer confidence and spending;\ndemand for residential lots;\navailability of financing for homebuyers;\navailability of financing for companies that purchase our residential lots;\ninterest rates;\ninflation; and\ndemographic trends.\nAdverse changes in general and local economic conditions or deterioration in the broader economy may negatively impact our business and financial results and increase the risk of asset impairments and write-offs. Changes in economic conditions may affect some of our regions or markets more than others. If adverse conditions affect our larger markets, they could have a proportionately greater impact on us than on some other real estate development companies.\nThe federal governments fiscal policies and the Federal Reserve's monetary policies may negatively impact the financial markets and consumer confidence and could hurt the U.S. economy and the real estate market, and in turn, could adversely affect the operating results of our businesses. During fiscal 2022, in response to increased inflation, the Federal Reserve raised interest rates significantly and has signaled it expects additional future interest rate increases. As a result, mortgage interest rates increased significantly, and we began to see a moderation in housing demand. Increases in mortgage interest rates would likely reduce demand for our residential lots and may have an adverse impact on our business or financial results.\nDeployments of U.S. military personnel to foreign regions, terrorist attacks, other acts of violence or threats to national security and any corresponding response by the United States or others, domestic or international instability or social or political unrest may cause an economic slowdown in the markets where we operate, which could adversely affect our business.\nIf we experience any of the foregoing, homebuilders may be less willing or able to buy our residential lots. Additionally, cancellations of lot sales contracts may increase if homebuilders do not honor their contracts due to any of the factors discussed above. Our pricing and product strategies may also be limited by market conditions. We may be unable to change the mix of our product offerings, reduce the costs of the residential lots we develop, or satisfactorily address changing market conditions in other ways without adversely affecting our profits and returns.\nOur business and financial results could be adversely affected by significant inflation, higher interest rates or deflation.\nInflation can adversely affect us by increasing costs of land, materials and labor. In addition, significant inflation is often accompanied by higher interest rates, which have a negative impact on housing affordability. During fiscal 2022, we began to see a moderation in housing demand as inflationary pressures and mortgage interest rates increased. In an inflationary environment, depending on industry and other economic conditions, we may be precluded from raising residential lot prices enough to keep up with the rate of inflation, which could reduce our profit margins. Moreover, in an inflationary environment, our cost of capital, labor and materials can increase and the purchasing power of our cash resources can decline, which can have an adverse impact on our business or financial results.\nAlternatively, a significant period of deflation could cause a decrease in overall spending and borrowing levels. This could lead to deterioration in economic conditions, including an increase in the rate of unemployment. Deflation could also cause the value of our real estate to decline. These, or other factors related to deflation, could have a negative impact on our business or financial results.\nSupply shortages and other risks related to acquiring land, materials and skilled labor could increase our costs and delay lot deliveries.\nThe residential lot development industry may experience significant difficulties that can affect the cost or timing of lot development, including:\ndifficulty in acquiring land suitable for residential development at affordable prices in locations that are attractive to homebuilders;\nshortages of qualified subcontractors;\nreliance on local subcontractors, manufacturers and distributors who may be inadequately capitalized;\nshortages of construction materials; and\nsignificant increases in the cost of materials and other inputs, including petroleum-based products.\nThese factors may cause construction delays or increase our costs. During fiscal 2021 and 2022, we have experienced multiple disruptions in our supply chain, which have resulted in shortages of certain building materials and tightness in the labor market. This has caused our construction cycle to lengthen and costs of building materials to increase. If shortages and cost increases in building materials and tightness in the labor market persist for a prolonged period of time, our profit margins could be adversely impacted if we are unable to offset future cost increases by increasing the selling price of our lots.\nPublic health issues such as a major epidemic or pandemic could adversely affect our business or financial results.\nThe U.S. and other countries have experienced, and may experience in the future, outbreaks of contagious diseases that affect public health and public perception of health risk. The ongoing COVID-19 pandemic continues to affect the global economy. The effects of the pandemic contributed to disrupting our supply chain, which has resulted in shortages of certain building materials and tightness in the labor market.\nThere is uncertainty regarding the extent to which and how long COVID-19 and its variant strains will continue to impact the global economy and our supply chain, and the effect of the pandemic on our operational and financial performance will depend on future developments, including its impact on our customers, trade partners and employees, all of which are highly uncertain and cannot be predicted. If COVID-19 and its variant strains continue to have a negative impact on economic conditions, our results of operations and financial condition could be adversely impacted.\nOur business and financial results could be adversely affected by weather conditions and natural disasters.\nPhysical risks, including weather conditions and natural disasters, such as hurricanes, tornadoes, earthquakes, volcanic activity, droughts, floods, hailstorms, heavy or prolonged precipitation, wildfires and others, can harm our business. Additionally, the physical impacts of climate change may cause these occurrences to increase in frequency, severity and duration. Any such events can temporarily delay our development work and lot sales, unfavorably affect the cost or availability of materials or labor, damage residential lots under construction, lead to changing customer preferences and/or negatively impact demand for residential lots in affected areas. We have experienced temporary delays in production and short-term impacts on our lot sales from weather events in recent years. However, there has been no material impact on our business from these events or material operational challenges resulting from these events, but they could adversely affect our business in the future. The climates and geology of many of the states in which we operate, including California, Florida, Texas and other coastal areas where we have some of our larger operations and which have experienced recent natural disasters, present increased risks of adverse weather or natural disasters.\nA health and safety incident relating to our operations could be costly in terms of potential liability and reputational damage.\nLand development sites are inherently dangerous, and operating in this industry poses certain inherent health and safety risks. Due to health and safety regulatory requirements and the number of residential lots we develop, health and safety performance is critical to the success of our business. Any failure in health and safety performance may result in penalties for non-compliance with relevant regulatory requirements, and a failure that results in a major or significant health and safety incident is likely to be costly and could expose us to liability that could be costly. Such an incident could generate significant negative publicity and have a corresponding impact on our reputation, our relationships with relevant regulatory agencies or governmental authorities, and our ability to attract customers and employees, which in turn could have a material adverse effect on our financial results and liquidity.\nFrom time to time, we obtain performance bonds, the unavailability of which could adversely affect our results of operations and cash flows.\nFrom time to time, we provide surety bonds to secure our performance or obligations under construction contracts, development agreements and other arrangements. At September 30, 2022, we had $632.7 million of outstanding surety bonds. Our ability to obtain surety bonds primarily depends upon our credit rating, financial condition, past performance and other factors, including the capacity of the surety market and the underwriting practices of surety bond issuers. The ability to obtain surety bonds also can be impacted by the willingness of insurance companies to issue performance bonds for construction and development activities. If we are unable to obtain surety bonds when required, our results of operations and cash flows could be adversely affected.\nGovernmental regulations and environmental matters could increase the cost and limit the availability of property suitable for residential lot development and could adversely affect our business or financial results.\nWe are subject to extensive and complex regulations that affect land acquisition, development and home construction, including zoning, density restrictions and building standards. These regulations often provide broad discretion to the administering governmental authorities as to the conditions we must meet prior to acquisition or development being approved, if approved at all. We are subject to determinations by these authorities as to the adequacy of water or sewage facilities, roads or other local services. New housing developments may also be subject to various assessments for schools, parks, streets and other public improvements. In addition, in many markets, government authorities have implemented no growth or growth control initiatives. Any of these may limit, delay or increase the costs of acquisition of land for residential use and development or home construction.\nWe are also subject to a significant number and variety of local, state and federal laws and regulations concerning protection of health, safety, labor standards and the environment. The impact of environmental laws varies depending upon the prior uses of the building site or adjoining properties and may be greater in areas with less supply where undeveloped land or desirable alternatives are less available. These matters may result in delays, may cause us to incur substantial compliance, remediation, mitigation and other costs, and can prohibit or severely restrict land acquisition and development activity in environmentally sensitive regions or areas. Government agencies also routinely initiate audits, reviews or investigations of our business practices to ensure compliance with these laws and regulations, which can cause us to incur costs or create other disruptions in our business that can be significant.\nRecently, there has been growing concern from advocacy groups, government agencies and the general public over the effects of climate change on the environment. Transition risks, such as government restrictions, standards or regulations intended to reduce greenhouse gas emissions and potential climate change impacts, are emerging and may increase in the future in the form of restrictions or additional requirements on land development in certain areas. Such restrictions and requirements could increase our operating and compliance costs or require additional technology and capital investment, which could adversely affect our results of operations. This is a particular concern in the western United States, where some of the most extensive and stringent environmental laws and residential building construction standards in the country have been enacted, and where we have business operations. We believe we are in compliance in all material respects with existing climate-related government restrictions, standards and regulations applicable to our business, and such compliance has not had a material impact on our business. However, given the rapidly changing nature of environmental laws and matters that may arise that are not currently known, we cannot predict our future exposure concerning such matters, and our future costs to achieve compliance or remedy potential violations could be significant.\nAdditionally, actual or perceived environmental, social, governance (\"ESG\") and other sustainability matters and our response to these matters could harm our business. Increasing governmental and societal attention to ESG matters, including expanding mandatory and voluntary reporting, diligence, and disclosure on topics such as climate change, human capital, labor and risk oversight, could expand the nature, scope, and complexity of matters that we are required to control, assess and report. These factors may alter the environment in which we do business and may increase the ongoing costs of compliance, and adversely impact our results of operations and cash flows. If we are unable to adequately address such ESG matters or fail to comply with all laws, regulations, policies and related interpretations, it could negatively impact our reputation and our business results.\nThe subcontractors we rely on to perform the actual development of our residential lots are also subject to a significant\nnumber of local, state and federal laws and regulations, including laws involving matters that are not within our control.\nIf the subcontractors who develop our residential lots fail to comply with all applicable laws, we can suffer reputational\ndamage and may be exposed to possible liability.\nWe are also subject to an extensive number of laws and regulations because our common stock is publicly traded in the capital markets. These regulations govern our communications with our shareholders and the capital markets, our financial statement disclosures and our legal processes, and they also impact the work required to be performed by our independent registered public accounting firm and our legal counsel. Changes in these laws and regulations, including the subsequent implementation of rules by the administering government authorities, may require us to incur additional compliance costs, and such costs may be significant.\nThere can be no assurance that our current business strategy will be successful.\nOur business strategy is focused on expanding our unique residential lot development business across a geographically diversified national platform while consolidating market share in the fragmented U.S. lot development industry, primarily through our strategic relationship with D.R. Horton. There can be no assurance that our unique model will continue to succeed as intended or that we will be able to continue to execute it effectively because of the risks described elsewhere in this Risk Factors section, or other unforeseen issues or problems that arise. If we are not successful in achieving our objectives, our business, results of operations, cash flows and financial condition may be negatively affected.\nWe may have continuing liabilities relating to assets that have been sold, which could adversely impact our results of operations.\nIn the course of selling assets we are typically required to make contractual representations and warranties and to provide contractual indemnities to the buyers. These contractual obligations typically survive the closing of the transactions for some period of time. If a buyer is successful in sustaining a claim against us we may incur additional expenses pertaining to an asset we no longer own, and we may also be obligated to defend and/or indemnify the buyer from certain third-party claims. Such obligations could be material and they could adversely impact our results of operations.\nOur real estate development operations span several markets and as a result, our financial results may be significantly influenced by the local economies of those markets.\nThe local economic growth and strength of the markets in which our real estate development activity is located are important factors in sustaining demand for our land and lots. Any adverse impact on the economic growth and health, or infrastructure development, of a local economy in which we develop real estate could materially adversely affect our business, liquidity, financial condition and results of operations.\nOur real estate development operations are highly dependent upon national, regional and local homebuilders.\nWe are highly dependent upon our relationships with national, regional, and local homebuilders to purchase lots in our residential developments. If homebuilders do not view our developments as desirable locations for homebuilding operations, or if homebuilders are limited in their ability to conduct operations due to economic conditions, our business, liquidity, financial condition and results of operations will be adversely affected.\nIn addition, we enter into contracts to sell lots to homebuilders. A homebuilder could decide to delay purchases of lots in one or more of our developments, subject to loss of earnest money, due to adverse real estate conditions wholly unrelated to our areas of operations, such as corporate decisions regarding allocation of limited capital or human resources. As a result, we may sell fewer lots and may have lower sales revenues, which could have an adverse effect on our business, liquidity, financial condition and results of operations.\nDelays or failures by governmental authorities to take expected actions could reduce our returns or cause us to incur losses on certain real estate development projects.\nFor certain projects, we rely on governmental districts to issue bonds to reimburse us for qualified expenses, such as road and utility infrastructure costs. Bonds are often supported by assessments of district tax revenues, usually from ad valorem taxes. Slowing new home sales, decreasing real estate values or difficult credit markets for bond sales can reduce or delay district bond sale revenues and tax or assessment receipts, causing such districts to delay reimbursement of our qualified expenses. Failure to receive reimbursement for qualified expenses could adversely affect our cash flows and reduce our returns or cause us to incur losses on certain real estate development projects.\nFailure to succeed in new markets may limit our growth.\nWe may from time to time commence development activity or make acquisitions outside of our existing market areas if appropriate opportunities arise. Our historical experience in existing markets does not ensure that we will be able to operate successfully in new markets. We may be exposed to a variety of risks if we choose to enter new markets, including, among others:\nan inability to accurately evaluate local housing market conditions and local economies;\nan inability to obtain land for development or to identify appropriate acquisition opportunities;\nan inability to hire and retain key personnel;\nan inability to successfully integrate operations; and\nlack of familiarity with local governmental and permitting procedures.\nWe plan to raise additional capital in the future, and such capital may not be available when needed or at all.\nWe have a $410 million senior unsecured revolving credit facility with an uncommitted accordion feature that could increase the size of the facility to $600 million, subject to certain conditions and availability of additional bank commitments. The facility also provides for the issuance of letters of credit with a sublimit equal to the greater of $100 million and 50% of the revolving credit commitment. The maturity date of the facility is October 28, 2026. The revolving credit facility is guaranteed by our wholly-owned subsidiaries that are not immaterial subsidiaries or have not been designated as unrestricted subsidiaries. We also have outstanding $400 million principal amount of 3.85% senior notes due 2026 and $300 million principal amount of 5.0% senior notes due 2028, both of which may be redeemed prior to maturity, subject to certain limitations and premiums defined in the indenture agreements. The notes represent senior unsecured obligations that rank equally in right of payment to all existing and future senior unsecured indebtedness and are guaranteed by each of our subsidiaries to the extent such subsidiaries guarantee our revolving credit facility.\nWe regularly assess our projected capital requirements to fund growth in our business, repay debt obligations and support other general corporate and operational needs, and we regularly evaluate our opportunities to raise additional capital. At September 30, 2022, we had an effective shelf registration statement filed with the SEC in October 2021 registering $750 million of equity securities, of which $300 million was reserved for sales under our at-the-market equity offering program that became effective November 2021. At September 30, 2022, $748.2 million remained available for issuance under the shelf registration statement, of which $298.2 million is reserved for sales under our at-the-market equity offering program. We plan to raise additional capital in the future, in the form of additional debt or equity, to have sufficient capital resources and liquidity to fund our business needs and future growth plans and repay existing indebtedness. Our ability to raise additional capital will depend on, among other things, conditions in the capital markets at that time, which are outside of our control, and our financial condition, operating performance and growth prospects. Economic conditions may increase our cost of funding and limit access to certain customary sources of capital or make such capital only available on unfavorable terms. We may not be able to obtain capital on acceptable terms or at all. Any occurrence that may limit our access to the capital markets, such as a decline in the confidence of debt purchasers or counterparties participating in the capital markets or other disruption in capital markets, may adversely affect our capital costs and our ability to raise capital and, in turn, our liquidity. Further, we may need to raise capital in the future when other real estate-related companies are also seeking to raise capital and would then have to compete with those companies for investors. An inability to raise additional capital on acceptable terms when needed could have a material adverse effect on our business, financial condition and results of operations.\nThe real estate development industry is highly competitive and a number of entities with which we compete are larger and have greater resources or are smaller and have lower cost structures, and competitive conditions may adversely affect our results of operations.\nThe real estate development industry in which we operate is highly competitive. Competitive conditions in the real estate development industry may result in difficulties acquiring suitable land at acceptable prices, lower sales volumes and prices, increased development or construction costs and delays in construction. We compete with numerous regional and local developers for the acquisition of land suitable for development. We also compete with national, regional and local homebuilders who develop real estate for their own use in homebuilding operations, many of which are larger and have greater resources than we do or are smaller and have lower cost structures than we do. Any improvement in the cost structure or service of our competitors will increase the competition we face. Our business, financial condition and results of operations may be negatively affected by any of these factors.\nRisks Related to Our Indebtedness\nWe have significant amounts of consolidated debt and may incur additional debt; our debt obligations and our ability to comply with related covenants, restrictions or limitations could adversely affect our financial condition.\nAs of September 30, 2022, our consolidated debt was $706.0 million, including $400 million principal amount of 3.85% senior notes due 2026 and $300 million principal amount of 5.0% senior notes due 2028. Our revolving credit facility and the indentures governing the senior notes impose restrictions on our and our restricted subsidiaries ability to incur secured and unsecured debt, but still permit us and our restricted subsidiaries to incur a substantial amount of future secured and unsecured debt, and do not restrict the incurrence of future secured and unsecured debt by our unrestricted subsidiaries. The indentures governing the senior notes allow us to incur a substantial amount of additional debt.\nPossible Consequences\nThe amount and the maturities of our debt could have important consequences. For example, they could:\nrequire us to dedicate a substantial portion of our cash flow from operations to payment of our debt and reduce our ability to use our cash flow for other operating or investing purposes;\nlimit our flexibility to adjust to changes in our business or economic conditions; and\nlimit our ability to obtain future financing for working capital, capital expenditures, acquisitions, debt service requirements or other requirements.\nIn addition, our debt and the restrictions imposed by the instruments governing those obligations expose us to additional risks, including:\nDependence on Future Performance\nOur ability to meet our debt service and other obligations, including our obligations under the senior notes and the financial covenants under our revolving credit facility, will depend, in part, upon our future financial performance. Our future results are subject to the risks and uncertainties described in this Risk Factors section. Our revenues and earnings vary with the level of general economic activity in the markets we serve. Our business is also affected by financial, political, business and other factors, many of which are beyond our control. The factors that affect our ability to generate cash can also affect our ability to raise additional funds for these purposes through the sale of debt or equity, the refinancing of debt or the sale of assets.\nRisks of Variable Rate Debt\nChanges in prevailing interest rates may affect the cost of our debt service obligations, because borrowings under our revolving credit facility bear interest at floating rates. Borrowings under our revolving credit facility primarily bear interest based on the Secured Overnight Financing Rate (\"SOFR\").\nChanges in Debt Ratings\nThere can be no assurance that we will be able to maintain the credit ratings on our senior unsecured debt. Any lowering of our debt ratings could make accessing the capital markets or obtaining additional credit from banks more difficult and/or more expensive.\nChange of Control Purchase Option and Change of Control Default.\nUpon the occurrence of a change of control triggering event, as defined in the indentures governing our senior notes, we will be required to offer to repurchase such notes at 101% of their principal amount, together with all accrued and unpaid interest, if any. Moreover, a change of control, as defined in our revolving credit facility, would constitute an event of default under our revolving credit facility that could result in the acceleration of the repayment of any borrowings outstanding under our revolving credit facility, a requirement to cash collateralize all letters of credit outstanding thereunder and the termination of the commitments thereunder. If the maturity of our revolving credit facility and/or other indebtedness together having an aggregate principal amount outstanding of $40 million or more is accelerated, an event of default would result under the indentures governing the senior notes, entitling the trustee for the notes or holders of at least 25% in aggregate principal amount of the then outstanding notes to declare all such notes to be due and payable immediately. If purchase offers were required under the indentures for the senior notes, repayment of the borrowings under our revolving credit facility were required, or if the notes were accelerated, we can give no assurance that we would have sufficient funds to pay the required amounts.\nOur debt agreements contain a number of restrictive covenants which will limit our ability to finance future operations, acquisitions or capital needs or engage in other business activities that may be in our interest.\nThe covenants in the indentures governing our senior notes and the credit agreement governing our revolving credit facility impose, and the terms of any future indebtedness may impose, operating and other restrictions on us and our subsidiaries. Such restrictions affect or will affect, and in many respects limit or prohibit, among other things, our ability and the ability of certain of our subsidiaries to:\nincur additional indebtedness;\ncreate liens;\npay dividends and make other distributions in respect of our equity securities;\nredeem or repurchase our equity securities;\nmake certain investments or certain other restricted payments;\nsell certain kinds of assets;\nenter into certain types of transactions with affiliates; and\neffect mergers or consolidations.\nIn addition, our revolving credit facility contains financial covenants requiring the maintenance of a minimum level of tangible net worth, a minimum level of liquidity, a maximum allowable leverage ratio and a borrowing base restriction based on the book value of our real estate assets and unrestricted cash.\nThe restrictions contained in the indentures and the credit agreements could (1) limit our ability to plan for or react to market or economic conditions or meet capital needs or otherwise restrict our activities or business plans and (2) adversely affect our ability to finance our operations, acquisitions, investments or strategic alliances or other capital needs or to engage in other business activities that would be in our interest.\nA breach of any of these covenants could result in a default under all or certain of our debt instruments. If an event of default occurs, such creditors could elect to:\ndeclare all amounts outstanding, together with accrued and unpaid interest, to be immediately due and payable;\nrequire us to apply all of our available cash to repay such amounts; or\nprevent us from making debt service payments on certain of our debt instruments.\nGeneral Risk Factors\nThe market price of and trading volume of our shares of common stock may be volatile.\nThe market price of our shares of common stock has fluctuated substantially and may continue to fluctuate in response to many factors which are beyond our control, including:\nfluctuations in our operating results, including results that vary from the expectations of management, analysts and investors;\nannouncements of strategic developments, acquisitions, financings and other material events by us or our competitors;\nthe sale of a substantial number of shares of our common stock held by existing security holders in the public market; and\ngeneral conditions in the real estate industry.\nThe stock markets in general may experience extreme volatility that may be unrelated to the operating performance of particular companies. These broad market fluctuations may adversely affect the trading price of our common stock, make it difficult to predict the market price of our common stock in the future and cause the value of our common stock to decline.\nOur business may suffer if we lose key personnel.\nWe depend to a large extent on the services of certain key management personnel. These individuals have extensive experience and expertise in our business. The loss of any of these individuals could have a material adverse effect on our operations. We do not maintain key-person life insurance with respect to any of our employees. Our success may be dependent on our ability to continue to employ and retain skilled personnel.\nInformation technology failures, data security breaches and the failure to satisfy privacy and data protection laws and regulations could harm our business.\nWe use information technology and other computer resources to carry out important operational and marketing activities and to maintain our business records. These information technology systems are dependent upon global communications providers, web browsers, third-party software and data storage providers and other aspects of the Internet infrastructure that have experienced security breaches, cyber-attacks, ransomware attacks, significant systems failures and service outages in the past. Additionally, phishing attacks, whereby perpetrators attempt to fraudulently induce employees, customers, vendors or other users of a companys systems to disclose sensitive information to gain access to its data, have become more prevalent in recent years. The use of remote work environments and virtual platforms may increase our risk of cyber-attack or data security breaches. Further, geopolitical tensions or conflicts, such as the ongoing conflict between Russia and Ukraine, may create a heightened risk of cyber-attacks or other data security breaches. Our normal business activities involve collecting and storing information specific to our customers, employees, vendors and suppliers and maintaining operational and financial information related to our business, both in an office setting and remote locations as needed. A material breach in the security of our information technology systems or other data security controls could include the theft or release of this information. The unintended or unauthorized disclosure of personal identifying and confidential information as a result of a security breach by any means could lead to litigation or other proceedings against us by the affected individuals or business partners, or by regulators. The outcome of such proceedings, which could include penalties or fines, could have a significant negative impact on our business.\nWe may also be required to incur significant costs to protect against damages caused by information technology failures, security breaches, and the failure to satisfy privacy and data protection laws and regulations in the future as legal requirements continue to increase. The European Union and other international regulators, as well as state governments, have enacted or enhanced data privacy regulations, such as the California Consumer Privacy Act (and its successor the California Privacy Rights Act that will go into effect on January 1, 2023), and other governments are considering establishing similar or stronger protections. These regulations impose certain obligations for handling specified personal information in our systems, including notifying individuals regarding information we have collected from them. We have incurred costs in an effort to comply with these requirements, but our costs may increase significantly if new requirements are enacted and based on how individuals exercise their rights. Any noncompliance could result in substantial penalties, reputational damage or litigation.\nWe provide employee awareness training about cybersecurity threats. We routinely utilize information technology security experts to assist us in our evaluations of the effectiveness of the security of our information technology systems, and we regularly enhance our security measures to protect our systems and data. We use various encryption, tokenization and authentication technologies to mitigate cybersecurity risks and have increased our monitoring capabilities to enhance early detection and rapid response to potential cyber threats. However, because the techniques used to obtain unauthorized access, disable or degrade systems change frequently and are increasing in sophistication, they often are not recognized until launched against a target. As such, we may be unable to anticipate these techniques, to implement adequate preventative measures or to identify and investigate cybersecurity incidents.\nAlthough past cybersecurity incidents have not had a material effect on our business or operations to date, in the future, a data security breach, a significant and extended disruption in the functioning of our information technology systems or a breach of any of our data security controls could disrupt our business operations, damage our reputation and cause us to lose customers. We cannot provide assurances that a security breach, cyber-attack, data theft or other significant systems or security failures will not occur in the future, and such occurrences could have a material and adverse effect on our consolidated results of operations or financial position. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nOur principal executive office is leased and is located in Arlington, Texas. We also lease office space in other locations to support our business operations. Item 3. Legal Proceedings.\nWe are involved in various legal proceedings that arise from time to time in the ordinary course of our business. We believe we have established adequate reserves for any probable losses and that the outcome of any of the proceedings should not have a material adverse effect on our financial position or long-term results of operations or cash flows. It is possible, however, that charges related to these matters could be significant to our results of operations or cash flow in any single accounting period. Item 4. Mine Safety Disclosures.\nNot Applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur common stock is traded on the NYSE under the trading symbol \"FOR.\" As of November 10, 2022, the closing price of our common stock on the NYSE was $13.45, and there were approximately 1,076 holders of record.\nDividend Policy\nWe currently intend to retain any future earnings to support our business. The declaration and payment of any future dividends will be at the discretion of our Board of Directors after taking into account various factors, including without limitation, our financial condition, earnings, capital requirements of our business, the terms of any credit agreements or indentures to which we may be a party at the time, legal requirements, industry practice and other factors that our Board of Directors deems relevant.\nStock Performance Graph\nThe following graph illustrates the cumulative total stockholder return of an initial investment of $100 on December 31, 2017 in Forestar common stock for the period from December 31, 2017 through September 30, 2022 compared to the same investment in the Russell 2000 Index and our peer group.\nThe companies included in our peer group are M.D.C. Holdings, Inc.; Tri Pointe Homes, Inc.; Century Communities, Inc.; Beazer Homes USA, Inc.; Five Point Holdings, LLC (Class A); The Howard Hughes Corporation; The St. Joe Company; Masonite International Corporation; and PGT Innovations, Inc. These companies were selected based on their industries, similar market capitalization and business model.\nPursuant to SEC rules, returns of each of the companies in the peer groups are weighted according to the respective companys stock market capitalization at the beginning of each period for which a return is indicated. Shareholder returns over the indicated period are based on historical data and should not be considered indicative of future shareholder returns. The graph and related disclosure in no way reflect our forecast of future financial performance.\nDecember 31, September 30,\n2017 2018 2019 2020 2021 2022\nForestar Group Inc. $ 100.00 $ 96.36 $ 83.09 $ 80.45 $ 84.68 $ 50.86\nRussell 2000 100.00 111.51 101.60 101.99 150.62 115.23\nPeer Group 100.00 87.62 96.18 90.03 119.11 81.68\nThis performance graph shall not be deemed to be incorporated by reference into our SEC filings and should not constitute soliciting material or otherwise be considered filed under the Securities Act of 1933, as amended (Securities Act) or the Exchange Act. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nManagements Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to promote an understanding of our financial condition, results of operations, liquidity and certain other factors that may affect future results. MD&A is provided as a supplement to, and should be read in conjunction with our consolidated financial statements and notes to those statements that appear elsewhere in this Form 10-K. This section generally discusses the results of operations for fiscal 2022 compared to 2021. For similar operating and financial data and discussion of our fiscal 2021 results compared to our fiscal 2020 results, refer to Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations under Part II of our annual report on Form 10-K for the fiscal year ended September 30, 2021, which was filed with the SEC on November 18, 2021.\nThe following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to any differences include, but are not limited to, those discussed under the caption Forward-Looking Statements and under Item 1A - Risk Factors.\nBusiness Segment\nWe are a residential lot development company with operations in 53 markets in 21 states as of September 30, 2022. In October 2017, we became a majority-owned subsidiary of D.R. Horton. As our controlling shareholder, D.R. Horton has significant influence in guiding our strategic direction and operations.\nWe manage our operations through our real estate segment, which is our core business and generates substantially all of our revenues. The real estate segment primarily acquires land and installs infrastructure for single-family residential communities and generates revenues from sales of residential single-family finished lots to local, regional and national homebuilders. We have other business activities for which the related assets and operating results are immaterial and therefore, are included in our real estate segment.\nResults of Operations\nThe following tables and related discussion set forth key operating and financial data as of and for the fiscal years ended September 30, 2022 and 2021.\nOperating Results\nComponents of income before taxes were as follows:\nYear Ended September 30,\n2022 2021\n(In millions)\nRevenues $ 1,519.1 $ 1,325.8\nCost of sales 1,195.1 1,096.6\nSelling, general and administrative expense 93.6 68.4\nEquity in earnings of unconsolidated ventures (1.2) (0.2)\nGain on sale of assets (3.2) (2.5)\nInterest and other income (1.0) (1.2)\nLoss on extinguishment of debt - 18.1\nIncome before income taxes $ 235.8 $ 146.6\nLot Sales\nResidential lots sold consist of:\nYear Ended September 30,\n2022 2021\nDevelopment projects 16,454 14,221\nLot banking projects 383 1,694\n16,837 15,915\nDeferred development projects 854 -\n17,691 15,915\nAverage sales price per lot (a)\n$ 86,300 $ 81,600\n_______________\n(a) Excludes lots sold from deferred development projects and any impact from change in contract liabilities.\nRevenues\nRevenues consist of:\nYear Ended September 30,\n2022 2021\n(In millions)\nResidential lot sales:\nDevelopment projects $ 1,420.2 $ 1,182.6\nLot banking projects 33.5 116.1\nDecrease (increase) in contract liabilities 1.8 (5.6)\n1,455.5 1,293.1\nDeferred development projects 26.8 -\n1,482.3 1,293.1\nTract sales and other 36.8 32.7\nTotal revenues $ 1,519.1 $ 1,325.8\nResidential lots sold and residential lot sales revenues have increased primarily as a result of lots sales to customers other than D.R. Horton. In fiscal 2022, we sold 14,895 residential lots to D.R. Horton for $1.2 billion compared to 14,839 residential lots sold to D.R. Horton for $1.2 billion in fiscal 2021. In fiscal 2022, we sold 2,796 residential lots to customers other than D.R. Horton for $287.8 million, inclusive of the $64.1 million cumulative transaction price of deferred development lot sales, compared to 1,076 residential lots sold for $86.5 million in fiscal 2021. Lots sold to customers other than D.R. Horton in fiscal 2022 included 943 lots that were sold for $131.1 million to a lot banker who expects to sell those lots to DR. Horton at a future date.\nDeferred development lot sales in fiscal 2022 include 854 undeveloped and partially developed lots that were sold to customers other than D.R. Horton for a cumulative transaction price of $64.1 million. As part of these transactions, we are obligated to complete the development of the lots. During fiscal 2022, we received $38.8 million in cash related to deferred development transactions with the remainder due as development of the lots is completed. During fiscal 2022, we recognized revenue of $26.8 million related to deferred development transactions. The remaining revenue will be recognized over time as our development obligations are completed.\nTract sales and other revenue in fiscal 2022 primarily consisted of 512 acres sold to third parties for $35.7 million. Tract sales and other revenue in fiscal 2021 primarily consisted of 12 acres sold to third parties for $1.6 million and 85 acres sold to D.R. Horton for $25.9 million.\nThroughout the majority of fiscal 2022, demand for our residential lots remained strong. More recently, we have seen weakening demand as mortgage interest rates have increased substantially and inflationary pressures have remained elevated. We increase our land and lot sales prices when market conditions permit, and we attempt to offset cost increases in one component with savings in another. However, during periods when market conditions are challenging, we may have to reduce selling prices or may not be able to offset cost increases with higher selling prices. Although these challenging market conditions may persist for some time, we believe we are well-positioned to operate effectively through changing economic conditions because of our low net leverage and strong liquidity position, our low overhead model and our strategic relationship with D.R. Horton.\nCost of Sales, Real Estate Impairment and Land Option Charges and Interest Incurred\nCost of sales in fiscal 2022 increased compared to fiscal 2021 primarily due to the increase in the number of lots sold. Cost of sales related to tract sales and other revenues in fiscal 2022 and 2021 was $20.3 million and $27.0 million, respectively.\nEach quarter, we review the performance and outlook for all of our real estate for indicators of potential impairment and perform detailed impairment evaluations and analyses when necessary. As a result of this process, we recorded real estate impairment charges of $3.8 million during fiscal 2022. There were no real estate impairment charges recorded in fiscal 2021. During fiscal 2022 and 2021, land purchase contract deposit and pre-acquisition cost write-offs related to land purchase contracts that we terminated or expect to terminate were $8.7 million and $3.0 million, respectively.\nWe capitalize interest costs throughout the development period (active real estate). Capitalized interest is charged to cost of sales as the related real estate is sold to the buyer. Interest incurred was $32.9 million and $41.5 million in fiscal 2022 and 2021, respectively. Interest charged to cost of sales was 2.9% and 3.3% of total cost of sales (excluding real estate impairments and land option charges) in those years.\nSelling, General and Administrative (SG&A) Expense and Other Income Statement Items\nSG&A expense in fiscal 2022 was $93.6 million compared to $68.4 million in fiscal 2021. SG&A expense as a percentage of revenues was 6.2% and 5.2% in fiscal 2022 and 2021, respectively. Our SG&A expense primarily consists of employee compensation and related costs. Our business operations employed 291 and 250 employees at September 30, 2022 and 2021, respectively. We attempt to control our SG&A costs while ensuring that our infrastructure supports our operations; however, we cannot make assurances that we will be able to maintain or improve upon the current SG&A expense as a percentage of revenues.\nLoss on extinguishment of debt of $18.1 million in fiscal 2021 was due to the redemption of our $350 million principal amount of 8.0% senior notes due 2024 in May 2021.\nIncome Taxes\nOur income tax expense was $57.0 million and $36.1 million in fiscal 2022 and 2021, respectively, and our effective tax rate was 24.2% and 24.6% in those respective years. Our effective tax rate for both years includes an expense for state income taxes and nondeductible expenses and a benefit related to noncontrolling interests.\nAt September 30, 2022, we had deferred tax liabilities, net of deferred tax assets, of $35.9 million. The deferred tax assets were offset by a valuation allowance of $1.0 million, resulting in a net deferred tax liability of $36.9 million. At September 30, 2021, deferred tax liabilities, net of deferred tax assets, were $23.2 million. The deferred tax assets were offset by a valuation allowance of $1.2 million, resulting in a net deferred tax liability of $24.4 million. The valuation allowance for both years was recorded because it is more likely than not that a portion of our state deferred tax assets, primarily NOL carryforwards, will not be realized because we are no longer operating in some states or the NOL carryforward periods are too brief to realize the related deferred tax asset. We will continue to evaluate both the positive and negative evidence in determining the need for a valuation allowance on our deferred tax assets. Any reversal of the valuation allowance in future periods will impact our effective tax rate.\nThe Inflation Reduction Act of 2022 (IRA) was signed into law on August 16, 2022. The tax related provisions of the IRA did not have a material impact on our financial statements and are not expected to have a material impact on our financial statements in the future.\nWe had no unrecognized tax benefits at September 30, 2022 and September 30, 2021.\nLand and Lot Position\nOur land and lot position at September 30, 2022 and 2021 is summarized as follows:\nSeptember 30,\n2022 2021\nLots owned 61,800 64,400\nLots controlled through land lot purchase contracts 28,300 32,600\nTotal lots owned and controlled 90,100 97,000\nOwned lots under contract to sell to D.R. Horton 17,800 21,000\nOwned lots under contract to customers other than D.R. Horton 1,400 800\nTotal owned lots under contract 19,200 21,800\nOwned lots subject to right of first offer with D.R. Horton based on executed purchase and sale agreements 18,900 18,200\nOwned lots fully developed 5,500 5,300\nLiquidity and Capital Resources\nLiquidity\nAt September 30, 2022, we had $264.8 million of cash and cash equivalents and $356.7 million of available borrowing capacity on our revolving credit facility. We have no senior note maturities until fiscal 2026. We believe we are well positioned to operate effectively during changing economic conditions because of our low net leverage and strong liquidity position, our low overhead model and our strategic relationship with D.R. Horton.\nAt September 30, 2022, our ratio of debt to total capital (debt divided by stockholders equity plus debt) was 37.1% compared to 41.0% at September 30, 2021. Our ratio of net debt to total capital (debt net of unrestricted cash divided by stockholders equity plus debt net of unrestricted cash) was 26.9% compared to 35.2% at September 30, 2021. Over the long term, we intend to maintain our ratio of net debt to total capital at approximately 40% or less. We believe that the ratio of net debt to total capital is useful in understanding the leverage employed in our operations.\nWe believe that our existing cash resources and revolving credit facility will provide sufficient liquidity to fund our near-term working capital needs. Our ability to achieve our long-term growth objectives will depend on our ability to obtain financing in sufficient amounts. We regularly evaluate alternatives for managing our capital structure and liquidity profile in consideration of expected cash flows, growth and operating capital requirements and capital market conditions. We may, at any time, be considering or preparing for the purchase or sale of our debt securities, the sale of our common stock or a combination thereof.\nBank Credit Facility\nWe have a $410 million senior unsecured revolving credit facility with an uncommitted accordion feature that could increase the size of the facility to $600 million, subject to certain conditions and availability of additional bank commitments. The facility also provides for the issuance of letters of credit with a sublimit equal to the greater of $100 million and 50% of the revolving credit commitment. Borrowings under the revolving credit facility are subject to a borrowing base calculation based on the book value of our real estate assets and unrestricted cash. Letters of credit issued under the facility reduce the available borrowing capacity. There were no borrowings or repayments under the facility during fiscal 2022. At September 30, 2022, there were no borrowings outstanding and $53.3 million of letters of credit issued under the revolving credit facility, resulting in available capacity of $356.7 million.\nIn October 2022, our senior unsecured revolving credit facility was amended to extend its maturity date to October 28, 2026.\nThe revolving credit facility is guaranteed by our wholly-owned subsidiaries that are not immaterial subsidiaries or have not been designated as unrestricted subsidiaries. The revolving credit facility includes customary affirmative and negative covenants, events of default and financial covenants. The financial covenants require a minimum level of tangible net worth, a minimum level of liquidity and a maximum allowable leverage ratio. These covenants are measured as defined in the credit agreement governing the facility and are reported to the lenders quarterly. A failure to comply with these financial covenants could allow the lending banks to terminate the availability of funds under the revolving credit facility or cause any outstanding borrowings to become due and payable prior to maturity. At September 30, 2022, we were in compliance with all of the covenants, limitations and restrictions of our revolving credit facility.\nSenior Notes\nWe have outstanding senior notes as described below that were issued pursuant to Rule 144A and Regulation S under the Securities Act. The notes represent senior unsecured obligations that rank equally in right of payment to all existing and future senior unsecured indebtedness and may be redeemed prior to maturity, subject to certain limitations and premiums defined in the respective indenture. The notes are guaranteed by each of our subsidiaries to the extent such subsidiaries guarantee our revolving credit facility.\nOur $400 million principal amount of 3.85% senior notes (the \"2026 notes\") mature May 15, 2026 with interest payable semi-annually. On or after May 15, 2023, the 2026 notes may be redeemed at 101.925% of their principal amount plus any accrued and unpaid interest. In accordance with the indenture, the redemption price decreases annually thereafter, and the 2026 notes can be redeemed at par on or after May 15, 2025 through maturity. The annual effective interest rate of the 2026 notes after giving effect to the amortization of financing costs is 4.1%.\nWe also have $300 million principal amount of 5.0% senior notes (the \"2028 notes\") outstanding, which mature March 1, 2028 with interest payable semi-annually. On or after March 1, 2023, the 2028 notes may be redeemed at 102.5% of their principal amount plus any accrued and unpaid interest. In accordance with the indenture, the redemption price decreases annually thereafter and the 2028 notes can be redeemed at par on or after March 1, 2026 through maturity. The annual effective interest rate of the 2028 notes after giving effect to the amortization of financing costs is 5.2%.\nThe indentures governing our senior notes require that, upon the occurrence of both a change of control and a rating decline (each as defined in the indentures), we offer to purchase the applicable series of notes at 101% of their principal amount. If we or our restricted subsidiaries dispose of assets, under certain circumstances, we will be required to either invest the net cash proceeds from such asset sales in our business within a specified period of time, repay certain senior secured debt or debt of our non-guarantor subsidiaries, or make an offer to purchase a principal amount of such notes equal to the excess net cash proceeds at a purchase price of 100% of their principal amount. The indentures contain covenants that, among other things, restrict the ability of us and our restricted subsidiaries to pay dividends or distributions, repurchase equity, prepay subordinated debt and make certain investments; incur additional debt or issue mandatorily redeemable equity; incur liens on assets; merge or consolidate with another company or sell or otherwise dispose of all or substantially all of our assets; enter into transactions with affiliates; and allow to exist certain restrictions on the ability of subsidiaries to pay dividends or make other payments. At September 30, 2022, we were in compliance with all of the limitations and restrictions associated with our senior note obligations.\nEffective April 30, 2020, our Board of Directors authorized the repurchase of up to $30 million of our debt securities. The authorization has no expiration date. All of the $30 million authorization was remaining at September 30, 2022.\nOther Note Payable\nWe also have a note payable of $12.5 million that was issued as part of a transaction to acquire real estate for development. The note is non-recourse, is secured by the underlying real estate and accrues interest at 4.0% per annum with interest payments due in October 2022 and at maturity in October 2023.\nIssuance of Common Stock\nWe have an effective shelf registration statement filed with the SEC in October 2021 registering $750 million of equity securities, of which $300 million was reserved for sales under our at-the-market equity offering program that became effective November 2021. In fiscal 2022, we issued 84,547 shares of common stock under our at-the-market equity offering program for proceeds of $1.7 million, net of commissions and other issuance costs totaling $0.1 million. At September 30, 2022, $748.2 million remained available for issuance under the shelf registration statement, of which $298.2 million was reserved for sales under our at-the-market equity offering program.\nOperating Cash Flow Activities\nIn fiscal 2022, net cash provided by operating activities was $108.7 million, which was primarily the result of net income generated in the year and increases in liabilities and other accrued expenses, partially offset by the increase in our real estate. In fiscal 2021, net cash used in operating activities was $303.1 million, which was primarily the result of the increase in our real estate.\nInvesting Cash Flow Activities\nIn fiscal 2022, net cash provided by investing activities was $1.3 million compared to $1.0 million in fiscal 2021. The cash provided by investing activities in the current period consists primarily of cash received from the sale of an investment, partially offset by cash expenditures for property and equipment. Additionally, cash provided by investing activities in both periods includes distributions received from our unconsolidated ventures.\nFinancing Cash Flow Activities\nIn fiscal 2022, net cash provided by financing activities was $1.2 million compared to $61.4 million in fiscal 2021. Cash provided by financing activities in the prior year was primarily the result of proceeds from the issuance of $400 million principal amount of 3.85% senior notes and the issuance of common stock under our at-the-market equity offering program for net proceeds of $33.4 million, which were partially offset by the early redemption of our $350 million principal amount of 8.0% senior notes and the related call premium of $14.0 million.\nCritical Accounting Policies and Estimates\nGeneral - A comprehensive enumeration of the significant accounting policies of Forestar Group Inc. and subsidiaries is presented in Note 1 to the accompanying financial statements as of September 30, 2022 and 2021, and for the years ended September 30, 2022, 2021 and 2020. Each of our accounting policies has been chosen based upon current authoritative literature that collectively comprises U.S. Generally Accepted Accounting Principles (GAAP). In instances where alternative methods of accounting are permissible under GAAP, we have chosen the method that most appropriately reflects the nature of our business, the results of our operations and our financial condition, and have consistently applied those methods over each of the periods presented in the financial statements. The Audit Committee of our Board of Directors has reviewed and approved the accounting policies selected.\nAccounting estimates are considered critical if both of the following conditions are met: (1) the nature of the estimates or assumptions is material because of the levels of subjectivity and judgment needed to account for matters that are highly uncertain and susceptible to change and (2) the effect of the estimates and assumptions is material to the financial statements. We have reviewed our accounting estimates, and none were deemed to be considered critical for the accounting periods presented.\nRevenue Recognition - Real estate revenue and related profit are generally recognized at the time of the closing of a sale, when title to and possession of the property are transferred to the buyer. Our performance obligation, to deliver the agreed-upon land or lots, is generally satisfied at closing. However, there may be instances in which we have an unsatisfied remaining performance obligation at the time of closing. In these instances, we record contract liabilities and recognize those revenues over time as the performance obligations are completed. Generally, our unsatisfied remaining performance obligations are expected to have an original duration of less than one year.\nReal Estate and Cost of Sales - Real estate includes the costs of direct land and lot acquisition, land development, capitalized interest, and direct overhead costs incurred during land development. All indirect overhead costs, such as compensation of management personnel and insurance costs are charged to selling, general and administrative expense as incurred.\nLand and development costs are typically allocated to individual residential lots based on the relative sales value of the lot. Cost of sales includes applicable land and lot acquisition, land development and related costs (both incurred and estimated to be incurred) allocated to each residential lot in the project. Any changes to the estimated total development costs subsequent to the initial lot sales are generally allocated to the remaining lots.\nWe receive earnest money deposits from homebuilders for purchases of developed lots. These earnest money deposits are typically released to the homebuilders as lots are sold. Earnest money deposits from D.R. Horton are subject to mortgages that are secured by the real estate under contract with D.R. Horton. These mortgages expire when the earnest money is released to D.R. Horton as lots are sold.\nWe have agreements with certain utility or improvement districts to convey water, sewer and other infrastructure-related assets we have constructed in connection with projects within their jurisdiction and receive reimbursements for the cost of these improvements. The amount of reimbursements for these improvements are defined by the district and are based on the allowable costs of the improvements. The transfer is consummated and we generally receive payment when the districts have a sufficient tax base to support funding of their bonds. The cost incurred by us in constructing these improvements, net of the amount expected to be collected in the future, is included in our land development budgets and in the determination of lot costs.\nEach quarter, we review the performance and outlook for all of our real estate for indicators of potential impairment. We determine if impairment indicators exist by analyzing a variety of factors including, but not limited to, the following:\ngross margins on lots sold in recent months;\nprojected gross margins based on budgets;\ntrends in gross margins, average selling prices or cost of sales; and\nlot sales absorption rates.\nIf indicators of impairment are present, we perform an impairment evaluation, which includes an analysis to determine if the undiscounted cash flows estimated to be generated by those assets are less than their carrying amounts. These estimates of cash flows are significantly impacted by specific factors including estimates of the amount and timing of future revenues and estimates of the amount of land development costs which, in turn, may be impacted by the following local market conditions:\nsupply and availability of land and lots;\nlocation and desirability of our land and lots;\namount of land and lots we own or control in a particular market or sub-market; and\nlocal economic and demographic trends.\nFor those assets deemed impaired, an impairment charge is recorded to cost of sales for the amount by which the carrying amount of the assets exceeds the fair value of the assets. Our determination of fair value is primarily based on discounting the estimated cash flows at a rate commensurate with the inherent risks associated with the assets and related estimated cash flow streams. When an impairment charge is determined, the charge is then allocated to each lot in the same manner as land and development costs are allocated to each lot.\nWe rarely purchase land for resale. However, we may change our plans for land we own or land under development and decide to sell the asset. When we determine that we will sell the asset, the project is accounted for as land held for sale if certain criteria are met. We record land held for sale at the lesser of its carrying value or fair value less estimated costs to sell. In performing the impairment evaluation for land held for sale, we consider several factors including, but not limited to, recent offers received to purchase the property, prices for land in recent comparable sales transactions and market analysis studies, which include the estimated price a willing buyer would pay for the land. If the estimated fair value less costs to sell an asset is less than the current carrying value, the asset is written down to its estimated fair value less costs to sell.\nThe key assumptions relating to inventory valuations are impacted by local market and economic conditions, and are inherently uncertain. Although our quarterly assessments reflect managements best estimates, due to uncertainties in the estimation process, actual results could differ from such estimates.\nPending Accounting Standards\nIn March 2020, the FASB issued ASU 2020-04, Reference Rate Reform, which provides optional expedients and exceptions for applying U.S. GAAP to contracts, hedging relationships, and other transactions affected by the discontinuation of the London Interbank Offered Rate (LIBOR) or by another reference rate expected to be discontinued. The guidance was effective beginning March 12, 2020 and can be applied prospectively through December 31, 2022. In January 2021, the FASB issued ASU 2021-01, Reference Rate Reform - Scope, which clarified the scope and application of the original guidance. We will adopt these standards when LIBOR is discontinued and do not expect them to have a material impact on our consolidated financial statements or related disclosures.\nIn October 2021, the FASB issued ASU 2021-08, which requires application of ASC 606, Revenue from Contracts with Customers, to recognize and measure contract assets and liabilities from contracts with customers acquired in a business combination. ASU 2021-08 creates an exception to the general recognition and measurement principle in ASC 805 and will result in recognition of contract assets and contract liabilities consistent with those recorded by the acquiree immediately before the acquisition date. The guidance is effective for us beginning October 1, 2023 and interim periods therein, with early adoption permitted. We are currently evaluating the impact of this guidance, and it is not expected to have a material impact on our consolidated financial position, results of operations and cash flows.\nForward-Looking Statements\nThis Annual Report on Form 10-K and other materials we have filed or may file with the Securities and Exchange Commission contain forward-looking statements within the meaning of the federal securities laws. These forward-looking statements are identified by their use of terms and phrases such as believe, anticipate, could, estimate, likely, intend, may, plan, expect, and similar expressions, including references to assumptions. These statements reflect our current views with respect to future events and are subject to risks and uncertainties. We note that a variety of factors and uncertainties could cause our actual results to differ significantly from the results discussed in the forward-looking statements. Factors and uncertainties that might cause such differences include, but are not limited to:\nthe effect of D.R. Hortons controlling level of ownership on us and the holders of our securities;\nour ability to realize the potential benefits of the strategic relationship with D.R. Horton;\nthe effect of our strategic relationship with D.R. Horton on our ability to maintain relationships with our customers;\nthe cyclical nature of the homebuilding and lot development industries and changes in economic, real estate and other conditions;\nthe impact of significant inflation, higher interest rates or deflation;\nsupply shortages and other risks of acquiring land, construction materials and skilled labor;\nthe effects of public health issues such as a major epidemic or pandemic, including the impact of COVID-19 on the economy and our business;\nthe impacts of weather conditions and natural disasters;\nhealth and safety incidents relating to our operations;\nour ability to obtain or the availability of surety bonds to secure our performance related to construction and development activities and the pricing of bonds;\nthe impact of governmental policies, laws or regulations and actions or restrictions of regulatory agencies;\nour ability to achieve our strategic initiatives;\ncontinuing liabilities related to assets that have been sold;\nthe cost and availability of property suitable for residential lot development;\ngeneral economic, market or business conditions where our real estate activities are concentrated;\nour dependence on relationships with national, regional and local homebuilders;\ncompetitive conditions in our industry;\nobtaining reimbursements and other payments from governmental districts and other agencies and timing of such payments;\nour ability to succeed in new markets;\nthe conditions of the capital markets and our ability to raise capital to fund expected growth;\nour ability to manage and service our debt and comply with our debt covenants, restrictions and limitations;\nthe volatility of the market price and trading volume of our common stock;\nour ability to hire and retain key personnel;\nthe strength of our information technology systems and the risk of cybersecurity breaches and our ability to satisfy privacy and data protection laws and regulations.\nOther factors, including the risk factors described in Item 1A of this Annual Report on Form 10-K, may also cause actual results to differ materially from those projected by our forward-looking statements. New factors emerge from time to time and it is not possible for us to predict all such factors, nor can we assess the impact of any such factor on our business or the extent to which any factor, or combination of factors, may cause results to differ materially from those contained in any forward-looking statement.\nAny forward-looking statement speaks only as of the date on which such statement is made, and, except as required by law, we expressly disclaim any obligation or undertaking to disseminate any updates or revisions to any forward-looking statement to reflect events or circumstances after the date on which such statement is made or to reflect the occurrence of unanticipated events. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nInterest Rate Risk\nWe are subject to interest rate risk on our senior debt and revolving credit facility. We monitor our exposure to changes in interest rates and utilize both fixed and variable rate debt. For fixed rate debt, changes in interest rates generally affect the fair value of the debt instrument, but not our earnings or cash flows. Conversely, for variable rate debt, changes in interest rates generally do not impact the fair value of the debt instrument, but may affect our future earnings and cash flows. Except in very limited circumstances, we do not have an obligation to prepay fixed-rate debt prior to maturity and, as a result, interest rate risk and changes in fair value would not have a significant impact on our cash flows related to our fixed-rate debt until such time as we are required to refinance, repurchase or repay such debt.\nAt September 30, 2022, our fixed rate debt consisted of $400 million principal amount of the 2026 notes, $300 million principal amount of the 2028 notes and $12.5 million principal amount of 4.0% other note payable due October 2023. Our variable rate debt consists of the outstanding borrowings on our $410 million senior unsecured revolving credit facility, of which there were none at September 30, 2022. There were no borrowings or repayments under the facility during fiscal 2022.\nForeign Currency Risk\nWe have no exposure to foreign currency fluctuations.\nCommodity Price Risk\nWe have no significant exposure to commodity price fluctuations. Item 8. Financial Statements and Supplementary Data.\nMANAGEMENTS ANNUAL REPORT ON\nINTERNAL CONTROL OVER FINANCIAL REPORTING\nThe management of Forestar is responsible for establishing and maintaining adequate internal control over financial reporting. Management has designed our internal control over financial reporting to provide reasonable assurance that our published financial statements are fairly presented, in all material respects, in conformity with generally accepted accounting principles.\nManagement is required by paragraph (c) of Rule 13a-15 of the Securities Exchange Act of 1934, as amended, to assess the effectiveness of our internal control over financial reporting as of each year end. In making this assessment, management used the Internal Control - Integrated Framework (2013) by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nManagement conducted the required assessment of the effectiveness of our internal control over financial reporting as of September 30, 2022. Based upon this assessment, management believes that our internal control over financial reporting is effective as of September 30, 2022.\nErnst & Young LLP (PCAOB ID: 42), the independent registered public accounting firm that audited our financial statements included in this Form 10-K, has also audited our internal control over financial reporting. Their attestation report follows this report of management.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of Forestar Group Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited Forestar Group Inc.s internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Forestar Group Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of September 30, 2022, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of September 30, 2022 and 2021, the related consolidated statements of operations, total equity, and cash flows, for each of the three years in the period ended September 30, 2022, and the related notes and our report dated November 17, 2022 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nFort Worth, Texas\nNovember 17, 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of Forestar Group Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Forestar Group Inc. (the Company) as of September 30, 2022 and 2021, the related consolidated statements of operations, total equity and cash flows for each of the three years in the period ended September 30, 2022, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 30, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2022, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated November 17, 2022 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nLand development costs (including estimated costs to complete)\nDescription of the Matter For the year ended September 30, 2022, the Companys cost of sales was approximately $1.2 billion, which included the costs of direct land and lot acquisition, land development, and related costs (both incurred and estimated to be incurred) allocated to each residential lot in the project. As discussed in Note 1 to the consolidated financial statements, land development costs are typically allocated to individual residential lots based on the relative sales value of the lots. At the time of lot closings, land development activities may not yet be finalized. To recognize the appropriate amount of cost of sales, the Company estimates the total remaining development costs. Estimates are affected by changes to the land development projects cost of labor, material, and subcontractors.\nAuditing the Company's land development cost measurement and allocation to lots can be complex and subjective due to the estimation required to determine the costs to complete land development. Specifically, the land development cost estimate is sensitive to management assumptions regarding estimated cost of labor, material, and subcontractors.\nHow We Addressed the Matter in Our Audit We obtained an understanding and tested the design and operating effectiveness of the Company's process and controls over its land development cost measurement and allocation to lots, including controls over management's review of the estimated costs to complete.\nOur audit procedures included, among others, testing the assumptions used to develop the estimated costs to complete the land development projects by comparing to supporting documentation such as subcontractor bids, contracts, or actual costs from similar or related projects. In addition, we performed procedures related to land development budget changes during the year as well as performed a predictive margin analytic which included investigating variances between historical and estimated margins. We also performed a look-back analysis on completed projects by comparing actual land development costs to land development budgets as of the beginning of the year in order to evaluate the accuracy of managements land development budgets.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2007.\nFort Worth, Texas\nNovember 17, 2022\nFORESTAR GROUP INC.\nCONSOLIDATED BALANCE SHEETS\nSeptember 30,\n2022 2021\n(In millions, except share data)\nASSETS\nCash and cash equivalents $ 264.8 $ 153.6\nReal estate 2,022.4 1,905.2\nInvestment in unconsolidated ventures 0.5 0.9\nProperty and equipment, net 5.7 2.9\nOther assets 49.6 39.1\nTotal assets $ 2,343.0 $ 2,101.7\nLIABILITIES\nAccounts payable $ 72.2 $ 47.4\nAccrued development costs 122.3 104.5\nEarnest money on sales contracts 136.2 148.3\nDeferred tax liability, net 36.9 24.4\nAccrued expenses and other liabilities 70.1 56.7\nDebt 706.0 704.5\nTotal liabilities 1,143.7 1,085.8\nCommitments and contingencies (Note 12)\nEQUITY\nCommon stock, par value $1.00 per share, 200,000,000 authorized shares,\n49,761,480 and 49,580,389 shares issued and outstanding\nat September 30, 2022 and 2021, respectively\n49.8 49.6\nAdditional paid-in capital 640.6 636.2\nRetained earnings 507.9 329.1\nStockholders' equity 1,198.3 1,014.9\nNoncontrolling interests 1.0 1.0\nTotal equity 1,199.3 1,015.9\nTotal liabilities and equity $ 2,343.0 $ 2,101.7\nSee accompanying notes to consolidated financial statements.\nFORESTAR GROUP INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear Ended September 30,\n2022 2021 2020\n(In millions, except per share amounts)\nRevenues $ 1,519.1 $ 1,325.8 $ 931.8\nCost of sales 1,195.1 1,096.6 813.7\nSelling, general and administrative expense 93.6 68.4 45.7\nEquity in earnings of unconsolidated ventures (1.2) (0.2) (0.7)\nGain on sale of assets (3.2) (2.5) (0.1)\nInterest and other income (1.0) (1.2) (4.9)\nLoss on extinguishment of debt - 18.1 -\nIncome before income taxes 235.8 146.6 78.1\nIncome tax expense 57.0 36.1 16.4\nNet income 178.8 110.5 61.7\nNet income attributable to noncontrolling interests - 0.3 0.9\nNet income attributable to Forestar Group Inc. $ 178.8 $ 110.2 $ 60.8\nBasic net income per common share attributable to Forestar Group Inc. $ 3.59 $ 2.25 $ 1.26\nWeighted average number of common shares 49.8 48.9 48.0\nDiluted net income per common share attributable to Forestar Group Inc. $ 3.59 $ 2.25 $ 1.26\nAdjusted weighted average number of common shares 49.8 49.0 48.1\nSee accompanying notes to consolidated financial statements.\nFORESTAR GROUP INC.\nCONSOLIDATED STATEMENTS OF TOTAL EQUITY\nCommon Stock Additional Paid-in Capital Retained Earnings Non-controlling Interests Total Equity\n(In millions, except share amounts)\nBalances at September 30, 2019 (47,997,366 shares)\n$ 48.0 $ 602.2 $ 158.1 $ 0.6 $ 808.9\nNet income\n- - 60.8 0.9 61.7\nStock issued under employee benefit plans (64,555 shares)\n0.1 - - - 0.1\nCash paid for shares withheld for taxes\n- (0.3) - - (0.3)\nStock-based compensation expense\n- 2.0 - - 2.0\nDistributions to noncontrolling interests\n- - - (0.6) (0.6)\nBalances at September 30, 2020 (48,061,921 shares)\n$ 48.1 $ 603.9 $ 218.9 $ 0.9 $ 871.8\nNet income\n- - 110.2 0.3 110.5\nIssuance of common stock (1,448,520 shares)\n1.4 32.0 - - 33.4\nPurchase of noncontrolling interest, net - (1.7) - (0.1) (1.8)\nStock issued under employee benefit plans (69,948 shares)\n0.1 - - - 0.1\nCash paid for shares withheld for taxes\n- (0.6) - - (0.6)\nStock-based compensation expense\n- 2.6 - - 2.6\nDistributions to noncontrolling interests\n- - - (0.1) (0.1)\nBalances at September 30, 2021 (49,580,389 shares)\n$ 49.6 $ 636.2 $ 329.1 $ 1.0 $ 1,015.9\nNet income\n- - 178.8 - 178.8\nIssuance of common stock (84,547 shares)\n0.1 1.6 - - 1.7\nStock issued under employee benefit plans (96,544 shares)\n0.1 - - - 0.1\nCash paid for shares withheld for taxes\n- (0.5) - - (0.5)\nStock-based compensation expense\n- 3.3 - - 3.3\nBalances at September 30, 2022 (49,761,480 shares)\n$ 49.8 $ 640.6 $ 507.9 $ 1.0 $ 1,199.3\nSee accompanying notes to consolidated financial statements.\nFORESTAR GROUP INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended September 30,\n2022 2021 2020\n(In millions)\nOPERATING ACTIVITIES\nNet income $ 178.8 $ 110.5 $ 61.7\nAdjustments:\nDepreciation and amortization 2.7 2.7 4.9\nDeferred income taxes 12.5 19.2 23.1\nEquity in earnings of unconsolidated ventures (1.2) (0.2) (0.7)\nStock-based compensation expense 3.3 2.6 2.0\nReal estate impairment and land option charges 12.5 3.0 0.9\nLoss on extinguishment of debt - 18.1 -\nGain on sale of assets (3.2) (2.5) (0.1)\nOther - 0.1 0.1\nChanges in operating assets and liabilities:\nIncrease in real estate (142.3) (585.9) (281.7)\nIncrease in other assets (1.6) (14.8) (3.4)\nIncrease in accounts payable and other accrued liabilities 40.9 28.0 15.0\nIncrease in accrued development costs 17.8 60.1 9.0\n(Decrease) increase in earnest money deposits on sales contracts (11.5) 49.7 3.9\nDecrease (increase) in income taxes receivable - 6.3 (3.1)\nNet cash provided by (used in) operating activities 108.7 (303.1) (168.4)\nINVESTING ACTIVITIES\nExpenditures for property, equipment, software and other (3.5) (1.6) (0.6)\nReturn of investment in unconsolidated ventures 1.6 2.6 4.3\nProceeds from sale of assets 3.2 - 1.3\nNet cash provided by investing activities 1.3 1.0 5.0\nFINANCING ACTIVITIES\nIssuance of common stock 1.7 33.4 -\nProceeds from debt - 458.0 300.0\nRepayments of debt - (422.0) (118.9)\nDeferred financing fees - (4.9) (5.3)\nPurchase of noncontrolling interest - (2.4) -\nDistributions to noncontrolling interests, net - (0.1) (0.6)\nCash paid for shares withheld for taxes (0.5) (0.6) (0.3)\nNet cash provided by financing activities 1.2 61.4 174.9\nNet increase (decrease) in cash and cash equivalents 111.2 (240.7) 11.5\nCash and cash equivalents at beginning of year 153.6 394.3 382.8\nCash and cash equivalents at end of year $ 264.8 $ 153.6 $ 394.3\nSUPPLEMENTAL CASH FLOW INFORMATION:\nNote payable issued for real estate $ - $ 12.5 $ -\nIncome taxes paid (refunded), net $ 42.4 $ 4.3 $ (3.1)\nSee accompanying notes to consolidated financial statements.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 - Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying consolidated financial statements have been prepared in accordance with U.S. Generally Accepted Accounting Principles (GAAP) and include the accounts of Forestar Group Inc. (\"Forestar\") and all of its 100% owned, majority-owned and controlled subsidiaries, which are collectively referred to as the Company unless the context otherwise requires. The Company accounts for its investment in other entities in which it has significant influence over operations and financial policies using the equity method. All intercompany accounts, transactions and balances have been eliminated in consolidation. Noncontrolling interests in consolidated pass-through entities are recognized before income taxes. The transactions included in net income in the consolidated statements of operations are the same as those that would be presented in comprehensive income. Thus, the Company's net income equates to comprehensive income.\nIn October 2017, Forestar became a majority-owned subsidiary of D.R. Horton, Inc. (\"D.R. Horton\") by virtue of a merger with a wholly-owned subsidiary of D.R. Horton. Immediately following the merger, D.R. Horton owned 75% of the Company's outstanding common stock. In connection with the merger, the Company entered into certain agreements with D.R. Horton, including a Stockholders Agreement, a Master Supply Agreement and a Shared Services Agreement. D.R. Horton is considered a related party of Forestar under GAAP. As of September 30, 2022, D.R. Horton owned approximately 63% of the Company's outstanding common stock.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions. These estimates and assumptions affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ materially from those estimates.\nRevenue Recognition\nReal estate revenue and related profit are generally recognized at the time of the closing of a sale, when title to and possession of the property are transferred to the buyer. The Companys performance obligation, to deliver the agreed-upon land or lots, is generally satisfied at closing. However, there may be instances in which the Company has an unsatisfied remaining performance obligation at the time of closing. In these instances, the Company records contract liabilities and recognizes those revenues over time as the performance obligations are completed. Generally, the Company's unsatisfied remaining performance obligations are expected to have an original duration of less than one year. See Note 4.\nCash and Cash Equivalents\nCash and cash equivalents include cash, other short-term instruments with original maturities of three months or less and proceeds from land and lot closings held for the Companys benefit at title companies.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nReal Estate and Cost of Sales\nReal estate includes the costs of direct land and lot acquisition, land development, capitalized interest and direct overhead costs incurred during land development. All indirect overhead costs, such as compensation of management personnel and insurance costs, are charged to selling, general and administrative expense as incurred.\nLand and development costs are typically allocated to individual residential lots based on the relative sales value of the lot. Cost of sales includes applicable land and lot acquisition, land development and related costs (both incurred and estimated to be incurred) allocated to each residential lot in the project. Any changes to the estimated total development costs subsequent to the initial lot sales are generally allocated to the remaining lots.\nThe Company receives earnest money deposits from homebuilders for purchases of developed lots. These earnest money deposits are typically released to the homebuilders as lots are sold. Earnest money deposits from D.R. Horton are subject to mortgages which are secured by the real estate under contract with D.R. Horton. These mortgages expire when the earnest money is released to D.R. Horton as lots are sold. See Note 13 for related party transactions and balances.\nThe Company has agreements with certain utility or improvement districts to convey water, sewer and other infrastructure-related assets it has constructed in connection with projects within their jurisdiction and receive reimbursements for the cost of these improvements. The reimbursement amounts for these improvements are defined by the district and are based on the allowable costs of the improvements. The transfer is consummated and the Company generally receives payment when the districts have a sufficient tax base to support funding of their bonds. The cost incurred by the Company in constructing these improvements, net of the amount expected to be collected in the future, is included in the Company's land development budgets and in the determination of lot costs.\nThe Company reviews real estate assets held for use for impairment when events or circumstances indicate that their carrying value may not be recoverable. Impairment exists if the carrying amount of the asset is not recoverable from the undiscounted cash flows expected from its use and eventual disposition. The amount of the impairment loss is determined by comparing the carrying value of the asset to its estimated fair value, which is generally determined based on the present value of future cash flows expected from the sale of the asset. Real estate impairments are included in cost of sales in the consolidated statements of operations. See Note 3.\nCapitalized Interest\nThe Company capitalizes interest costs throughout the development period (active real estate). Capitalized interest is charged to cost of sales as the related real estate is sold to the buyer. During periods in which the Companys active real estate is lower than its debt level, a portion of the interest incurred is reflected as interest expense in the period incurred. During fiscal 2022 and 2021, the Companys active real estate exceeded its debt level, and all interest incurred was capitalized to real estate. See Note 5.\nLand Purchase Contract Deposits and Pre-Acquisition Costs\nThe Company enters into land and lot purchase contracts to acquire land for the development of residential lots. Under these contracts, the Company will fund a stated deposit in consideration for the right, but not the obligation, to purchase land or lots at a future point in time with predetermined terms. Under the terms of many of the purchase contracts, the deposits are not refundable in the event the Company elects to terminate the contract. Land purchase contract deposits and capitalized pre-acquisition costs are expensed to cost of sales when the Company believes it is probable that it will not acquire the property under contract and will not be able to recover these costs through other means. See Notes 3 and 12.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nVariable Interests\nLand purchase contracts can result in the creation of a variable interest in the entity holding the land parcel under contract. There were no variable interest entities reported in the consolidated balance sheets at September 30, 2022 or 2021 because, with regard to each entity, the Company determined it did not control the activities that most significantly impact the variable interest entitys economic performance.\nThe maximum exposure to losses related to the Companys unconsolidated variable interest entities is limited to the amounts of the Companys related deposits. At September 30, 2022 and 2021, the deposits related to these contracts totaled $10.0 million and $10.4 million, respectively, and are included in other assets in the consolidated balance sheets.\nProperty and Equipment\nProperty and equipment are stated at cost less accumulated depreciation. The cost of significant additions and improvements is capitalized and the cost of repairs and maintenance is expensed as incurred. Depreciation generally is recorded using the straight-line method over the estimated useful life of the asset as follows:\nEstimated Useful Lives September 30,\n2022 2021\n(In millions)\nLeasehold improvements 5 to 10 years\n$ 1.5 $ 0.9\nProperty and equipment 2 to 10 years\n5.8 2.9\nTotal property and equipment 7.3 3.8\nAccumulated depreciation (1.6) (0.9)\nProperty and equipment, net $ 5.7 $ 2.9\nDepreciation expense was $0.7 million, $0.4 million and $0.3 million in fiscal 2022, 2021 and 2020, respectively.\nIncome Taxes\nThe Companys income tax expense is calculated using the asset and liability method, under which deferred tax assets and liabilities are recognized based on the future tax consequences attributable to temporary differences between the financial statement amounts of assets and liabilities and their respective tax bases and attributable to net operating losses and tax credit carryforwards. When assessing the realizability of deferred tax assets, management considers whether it is more likely than not that some portion or all of its deferred tax assets will not be realized. The realization of deferred tax assets is dependent upon the generation of sufficient taxable income in future periods and in the jurisdictions in which those temporary differences become deductible. The Company records a valuation allowance when it determines it is more likely than not that a portion of the deferred tax assets will not be realized. The accounting for deferred taxes is based upon estimates of future results. Differences between the anticipated and actual outcomes of these future results could have a material impact on the Companys consolidated results of operations or financial position. Also, changes in existing federal and state tax laws and tax rates could affect future tax results and the valuation of the Companys deferred tax assets and liabilities.\nInterest and penalties related to unrecognized tax benefits are recognized in the financial statements as a component of income tax expense. Significant judgment is required to evaluate uncertain tax positions. The Company evaluates its uncertain tax positions on a quarterly basis. The evaluations are based upon a number of factors, including changes in facts or circumstances, changes in tax law, correspondence with tax authorities during the course of audits and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in increases or decreases in the Companys income tax expense in the period in which the change is made. See Note 9.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nStock-Based Compensation\nThe Companys stockholders formally authorize shares of its common stock to be available for future grants of stock-based compensation awards. From time to time, the Compensation Committee of the Companys Board of Directors authorizes the grant of stock-based compensation to its employees and directors from these available shares. At September 30, 2022, the outstanding stock-based compensation awards consist of restricted stock units. Grants of restricted stock units vest over a certain number of years as determined by the Compensation Committee of the Board of Directors. Restricted stock units outstanding at September 30, 2022 have a remaining vesting period of up to 4.5 years.\nThe compensation expense for stock-based awards is based on the fair value of the award and is recognized on a straight-line basis over the remaining vesting period. The fair values of restricted stock units are based on the Companys stock price at the date of grant. See Note 11.\nFair Value Measurements\nThe FASB's authoritative guidance for fair value measurements establishes a three-level hierarchy based upon the inputs to the valuation model of an asset or liability. When available, the Company uses quoted market prices in active markets to determine fair value. Non-financial assets measured at fair value on a non-recurring basis principally include real estate assets which the Company reviews for indicators of impairment when events and circumstances indicate that the carrying value is not recoverable. See Note 14.\nPending Accounting Standards\nIn March 2020, the Financial Accounting Standards Board (\"FASB\") issued ASU 2020-04, Reference Rate Reform, which provides optional expedients and exceptions for applying U.S. GAAP to contracts, hedging relationships, and other transactions affected by the discontinuation of the London Interbank Offered Rate (LIBOR) or by another reference rate expected to be discontinued. The guidance was effective beginning March 12, 2020 and can be applied prospectively through December 31, 2022. In January 2021, the FASB issued ASU 2021-01, Reference Rate Reform - Scope, which clarified the scope and application of the original guidance. The Company will adopt these standards when LIBOR is discontinued and does not expect such standards to have a material impact on its consolidated financial statements and related disclosures.\nIn October 2021, the FASB issued ASU 2021-08, which requires application of ASC 606, Revenue from Contracts with Customers, to recognize and measure contract assets and liabilities from contracts with customers acquired in a business combination. ASU 2021-08 creates an exception to the general recognition and measurement principle in ASC 805 and will result in recognition of contract assets and contract liabilities consistent with those recorded by the acquiree immediately before the acquisition date. The guidance is effective for the Company beginning October 1, 2023, with early adoption permitted. The Company is currently evaluating the impact of this guidance, and it is not expected to have a material impact on its consolidated financial position, results of operations or cash flows.\nNote 2 - Segment Information\nThe Company manages its operations through its real estate segment, which is its core business and generates substantially all of its revenues. The real estate segment primarily acquires land and installs infrastructure for single-family residential communities, and its revenues generally come from sales of residential single-family finished lots to local, regional and national homebuilders. The Company has other business activities for which the related assets and operating results are immaterial and therefore are included within the Company's real estate segment.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 3 - Real Estate\nReal estate consists of:\nSeptember 30,\n2022 2021\n(In millions)\nDeveloped and under development projects $ 1,932.6 $ 1,824.7\nLand held for future development 89.8 80.5\n$ 2,022.4 $ 1,905.2\nDuring fiscal 2022, the Company invested $320.7 million for the acquisition of residential real estate and $1.1 billion for the development of residential real estate. At September 30, 2022 and 2021, land held for future development primarily consisted of undeveloped land which the Company has the contractual right to sell to D.R. Horton at a sales price equal to the carrying value of the land at the time of sale plus additional consideration of 12% to 16% per annum.\nEach quarter, the Company reviews the performance and outlook for all of its real estate for indicators of potential impairment and performs detailed impairment evaluations and analyses when necessary. As a result of this process, the Company recorded real estate impairment charges of $3.8 million during fiscal 2022. There were no real estate impairment charges recorded in fiscal 2021 or 2020.\nDuring fiscal 2022, 2021 and 2020, land purchase contract deposit and pre-acquisition cost write-offs related to land purchase contracts that the Company has terminated or expects to terminate were $8.7 million, $3.0 million and $0.9 million, respectively. Real estate impairments and land option charges are included in cost of sales in the consolidated statements of operations.\nNote 4 - Revenues\nRevenues consist of:\nYear Ended September 30,\n2022 2021 2020\n(In millions)\nResidential lot sales $ 1,455.5 $ 1,293.1 $ 880.3\nDeferred development lot sales 26.8 - -\nTract sales and other 36.8 32.7 51.5\n$ 1,519.1 $ 1,325.8 $ 931.8\nDuring fiscal 2022, deferred development lot sales included 854 undeveloped and partially developed lots that were sold to customers other than D.R. Horton for a total transaction price of $64.1 million. As part of these transactions, the Company is obligated to complete the development of these lots. During fiscal 2022, the Company received $38.8 million in cash related to deferred development transactions with the remainder of the transaction price due as development of the lots is completed. During fiscal 2022, the Company recognized revenue of $26.8 million related to deferred development transactions. The remaining revenue will be recognized over time as the Companys development obligations are completed.\nTotal revenue from D.R. Horton was $1.2 billion in both fiscal 2022 and 2021 and $887.6 million in fiscal 2020.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 5 - Capitalized Interest\nThe following table summarizes the Companys interest costs incurred, capitalized and expensed in fiscal 2022, 2021 and 2020.\nYear Ended September 30,\n2022 2021 2020\n(In millions)\nCapitalized interest, beginning of year $ 53.7 $ 48.7 $ 23.7\nInterest incurred 32.9 41.5 43.3\nInterest charged to cost of sales (34.1) (36.5) (18.3)\nCapitalized interest, end of year $ 52.5 $ 53.7 $ 48.7\nNote 6 - Other Assets, Accrued Expenses and Other Liabilities\nThe Company's other assets at September 30, 2022 and 2021 were as follows:\nSeptember 30,\n2022 2021\n(In millions)\nEarnest money notes receivable on sales contracts $ - $ 0.7\nReceivables, net 11.4 0.4\nLease right of use assets 7.5 6.9\nPrepaid expenses 18.9 15.4\nLand purchase contract deposits 10.0 10.4\nOther assets 1.8 5.3\n$ 49.6 $ 39.1\nThe Company's accrued expenses and other liabilities at September 30, 2022 and 2021 were as follows:\nSeptember 30,\n2022 2021\n(In millions)\nAccrued employee compensation and benefits $ 11.6 $ 7.9\nAccrued property taxes 6.2 3.4\nLease liabilities 8.1 7.3\nAccrued interest 8.0 8.5\nContract liabilities 16.1 5.8\nDeferred income 4.1 6.8\nIncome taxes payable 8.2 6.8\nOther accrued expenses 6.8 8.9\nOther liabilities 1.0 1.3\n$ 70.1 $ 56.7\nContract liabilities at September 30, 2022 include $12.0 million related to the Company's remaining unsatisfied performance obligations on deferred development lot sales.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 7 - Debt\nThe Company's notes payable at their carrying amounts consist of the following:\nSeptember 30,\n2022 2021\n(In millions)\nUnsecured:\nRevolving credit facility $ - $ -\n3.85% senior notes due 2026 (1)\n396.5 395.5\n5.0% senior notes due 2028 (1)\n297.0 296.5\nOther note payable 12.5 12.5\n$ 706.0 $ 704.5\n______________\n(1)Unamortized debt issuance costs that were deducted from the carrying amounts of the senior notes totaled $6.5 million and $8.0 million at September 30, 2022 and 2021, respectively.\nBank Credit Facility\nThe Company has a $410 million senior unsecured revolving credit facility with an uncommitted accordion feature that could increase the size of the facility to $600 million, subject to certain conditions and availability of additional bank commitments. The facility also provides for the issuance of letters of credit with a sublimit equal to the greater of $100 million and 50% of the revolving credit commitment. Borrowings under the revolving credit facility are subject to a borrowing base calculation based on the book value of the Company's real estate assets and unrestricted cash. Letters of credit issued under the facility reduce the available borrowing capacity. There were no borrowings or repayments under the facility during fiscal 2022. At September 30, 2022, there were no borrowings outstanding and $53.3 million of letters of credit issued under the revolving credit facility, resulting in available capacity of $356.7 million.\nIn October 2022, the Company's senior unsecured revolving credit facility was amended to extend its maturity date to October 28, 2026.\nThe revolving credit facility is guaranteed by the Companys wholly-owned subsidiaries that are not immaterial subsidiaries or have not been designated as unrestricted subsidiaries. The revolving credit facility includes customary affirmative and negative covenants, events of default and financial covenants. The financial covenants require a minimum level of tangible net worth, a minimum level of liquidity and a maximum allowable leverage ratio. These covenants are measured as defined in the credit agreement governing the facility and are reported to the lenders quarterly. A failure to comply with these financial covenants could allow the lending banks to terminate the availability of funds under the revolving credit facility or cause any outstanding borrowings to become due and payable prior to maturity. At September 30, 2022, the Company was in compliance with all of the covenants, limitations and restrictions of its revolving credit facility.\nSenior Notes\nThe Company has outstanding senior notes as described below that were issued pursuant to Rule 144A and Regulation S under the Securities Act. The notes represent senior unsecured obligations that rank equally in right of payment to all existing and future senior unsecured indebtedness and may be redeemed prior to maturity, subject to certain limitations and premiums defined in the indenture agreements. The notes are guaranteed by each of the Company's subsidiaries to the extent such subsidiaries guarantee the Company's revolving credit facility.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe Company's $400 million principal amount of 3.85% senior notes (the \"2026 notes\") mature May 15, 2026 with interest payable semi-annually. On or after May 15, 2023, the 2026 notes may be redeemed at 101.925% of their principal amount plus any accrued and unpaid interest. In accordance with the indenture, the redemption price decreases annually thereafter and the 2026 notes can be redeemed at par on or after May 15, 2025 through maturity. The annual effective interest rate of the 2026 notes after giving effect to the amortization of financing costs is 4.1%.\nThe Company's $300 million principal amount of 5.0% senior notes (the \"2028 notes\") mature March 1, 2028 with interest payable semi-annually. On or after March 1, 2023, the 2028 notes may be redeemed at 102.5% of their principal amount plus any accrued and unpaid interest. In accordance with the indenture, the redemption price decreases annually thereafter and the 2028 notes can be redeemed at par on or after March 1, 2026 through maturity. The annual effective interest rate of the 2028 notes after giving effect to the amortization of financing costs is 5.2%.\nThe indentures governing the senior notes require that, upon the occurrence of both a change of control and a rating decline (each as defined in the indentures), the Company offer to purchase the applicable series of notes at 101% of their principal amount. If the Company or its restricted subsidiaries dispose of assets, under certain circumstances, the Company will be required to either invest the net cash proceeds from such asset sales in its business within a specified period of time, repay certain senior secured debt or debt of its non-guarantor subsidiaries, or make an offer to purchase a principal amount of the notes equal to the excess net cash proceeds at a purchase price of 100% of their principal amount. The indentures contain covenants that, among other things, restrict the ability of the Company and its restricted subsidiaries to pay dividends or distributions, repurchase equity, prepay subordinated debt and make certain investments; incur additional debt or issue mandatorily redeemable equity; incur liens on assets; merge or consolidate with another company or sell or otherwise dispose of all or substantially all of the Companys assets; enter into transactions with affiliates; and allow to exist certain restrictions on the ability of subsidiaries to pay dividends or make other payments. At September 30, 2022, the Company was in compliance with all of the limitations and restrictions associated with its senior note obligations.\nEffective April 30, 2020, the Board of Directors authorized the repurchase of up to $30 million of the Companys debt securities. The authorization has no expiration date. All of the $30 million authorization was remaining at September 30, 2022.\nOther Note Payable\nThe Company also has a note payable of $12.5 million that was issued as part of a transaction to acquire real estate for development. The note is non-recourse, is secured by the underlying real estate and accrues interest at 4.0% per annum with interest payments due in October 2022 and at maturity in October 2023.\nNote 8 - Earnings per Share\nThe computations of basic and diluted earnings per share are as follows:\nYear Ended September 30,\n2022 2021 2020\n(In millions, except share and per share amounts)\nNumerator:\nNet income attributable to Forestar Group Inc. $ 178.8 $ 110.2 $ 60.8\nDenominator:\nWeighted average common shares outstanding - basic 49,818,132 48,901,987 48,037,018\nDilutive effect of stock-based compensation 31,762 73,674 57,093\nTotal weighted average shares outstanding - diluted 49,849,894 48,975,661 48,094,111\nBasic net income per common share attributable to Forestar Group Inc. $ 3.59 $ 2.25 $ 1.26\nDiluted net income per common share attributable to Forestar Group Inc. $ 3.59 $ 2.25 $ 1.26\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 9 - Income Taxes\nThe components of the Company's income tax expense are as follows:\nYear Ended September 30,\n2022 2021 2020\n(In millions)\nCurrent tax expense (benefit):\nFederal $ 38.3 $ 14.3 $ (7.6)\nState and other 6.2 2.6 0.9\n44.5 16.9 (6.7)\nDeferred tax expense:\nFederal 10.2 15.8 21.2\nState and other 2.3 3.4 1.9\n12.5 19.2 23.1\nIncome tax expense $ 57.0 $ 36.1 $ 16.4\nA reconciliation of the federal statutory rate to the Company's effective income tax rate follows:\nYear Ended September 30,\n2022 2021 2020\nFederal statutory rate 21.0 % 21.0 % 21.0 %\nState, net of federal benefit 3.0 3.3 2.9\nValuation allowance (0.1) - (0.1)\nTax benefits previously unrecognized - - (2.0)\nNon-controlling interests - - (0.3)\nTax rate benefit in carryback years - - (1.0)\nOther 0.3 0.3 0.5\nEffective tax rate 24.2 % 24.6 % 21.0 %\nThe effective tax rate for fiscal 2020 includes a tax benefit of $2.3 million related to the net operating loss (\"NOL\") carryback provisions of the Coronavirus Aid, Relief, and Economic Security Act (\"CARES Act\"), which allowed the Company to carryback a portion of its fiscal 2018 NOL. The carryback provisions resulted in the recognition of previously unrecognized tax benefits and the revaluation of deferred tax assets due to the utilization of NOLs at a higher tax rate in the carryback period. The effective tax rate for all years includes an expense for state income taxes and nondeductible expenses and a benefit related to noncontrolling interests\nThe Inflation Reduction Act of 2022 (\"IRA\") was signed into law on August 16, 2022. The tax provisions of the IRA did not have a material impact on our financial statements.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSignificant components of deferred taxes are:\nSeptember 30,\n2022 2021\n(In millions)\nDeferred tax assets:\nReal estate $ 11.5 $ 14.2\nEmployee benefits 2.8 1.9\nNet operating loss carryforwards 1.2 1.4\nAccruals not deductible until paid 0.2 0.2\nTotal deferred tax assets 15.7 17.7\nValuation allowance (1.0) (1.2)\nTotal deferred tax assets, net of valuation allowance 14.7 16.5\nDeferred tax liabilities:\nDeferral of profit on lot sales (51.6) (40.9)\nTotal deferred tax liabilities (51.6) (40.9)\nDeferred tax liability, net $ (36.9) $ (24.4)\nAt September 30, 2022, the Company had tax benefits of $1.2 million related to state NOL carryforwards, of which $0.7 million will expire between 2030 and 2037 while the remaining $0.5 million do not have an expiration date.\nThe Company has a valuation allowance of $1.0 million and $1.2 million at September 30, 2022 and 2021, respectively, because it is more likely than not that a portion of the Company's state deferred tax assets, primarily NOL carryforwards, will not be realized because the Company is no longer operating in some states or the NOL carryforward periods are too brief to realize the related deferred tax asset. The Company will continue to evaluate both the positive and negative evidence in determining the need for a valuation allowance on its deferred tax assets. Any reversal of the valuation allowance in future periods will impact the effective tax rate.\nThe Company is subject to a Tax Sharing Agreement with D.R. Horton. The agreement sets forth an equitable method for reimbursements of tax liabilities or benefits between the Company and D.R. Horton related to state and local income, margin or franchise tax returns that are filed on a unitary basis with D.R. Horton. In accordance with the agreement, the Company reimbursed D.R. Horton $0.7 million, $0.5 million and $0.2 million in fiscal 2022, 2021 and 2020, respectively, for its tax expense generated in fiscal 2021, 2020 and 2019.\nThe Company files income tax returns in the U.S. and in various state jurisdictions. The federal statute of limitations for tax years prior to 2019 is closed and the statute of limitations in major state jurisdictions for tax years prior to 2017 is closed. The Company is not currently being audited by the IRS or any state jurisdictions.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nA reconciliation of the beginning and ending amount of tax benefits not recognized for book purposes is as follows:\nYear Ended September 30,\n2022 2021 2020\n(In millions)\nUnrecognized tax benefits, beginning of year $ - $ - $ 1.6\nDecrease for tax positions taken in prior years - - (1.6)\nUnrecognized tax benefits, end of year $ - $ - $ -\nThe Company had no unrecognized tax benefits at September 30, 2022, 2021 and 2020 as a result of the recognition of $1.6 million of previously unrecognized tax benefits during fiscal 2020. All of the $1.6 million of recognized tax benefits affected the Companys effective tax rate in fiscal 2020 and was attributable to the NOL carryback provisions of the CARES Act allowing previously uncertain tax attributes to be recognized.\nThe Company recognizes interest accrued related to unrecognized tax benefits in income tax expense. In fiscal years 2022, 2021 and 2020, no significant interest related to unrecognized tax benefits was recognized. At September 30, 2022, there were no accrued interest or penalties.\nNote 10 - Stockholders' Equity\nThe Company has an effective shelf registration statement filed with the Securities and Exchange Commission in October 2021 registering $750 million of equity securities, of which $300 million was reserved for sales under the at-the-market equity offering program that became effective in November 2021. In fiscal 2022, the Company issued 84,547 shares of common stock under its at-the-market equity offering program for proceeds of $1.7 million, net of commissions and other issuance costs totaling $0.1 million. At September 30, 2022, $748.2 million remained available for issuance under the shelf registration statement, of which $298.2 million was reserved for sales under the at-the-market equity offering program.\nNote 11 - Employee Benefit Plans\nRetirement Plans\nThe Company has a 401(k) plan for all employees who have been with the Company for a period of six months or more. The Company matches portions of employees voluntary contributions. Additional employer contributions in the form of profit sharing may also be made at the Companys discretion. The Company recorded expense of $0.8 million, $0.6 million and $0.4 million for matching contributions in fiscal 2022, 2021 and 2020, respectively, which is included in in selling, general and administrative expense in the Company's consolidated statements of operations.\nRestricted Stock Units (RSUs)\nThe Companys Stock Incentive Plan provides for the granting of stock options and restricted stock units to executive officers, other key employees and non-management directors. Restricted stock unit awards may be based on performance (performance-based) or on service over a requisite time period (time-based). RSU equity awards represent the contingent right to receive one share of the Companys common stock per RSU if the vesting conditions and/or performance criteria are satisfied and have no voting rights during the vesting period.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDuring fiscal 2022, 2021 and 2020, the Company granted time-based RSUs that vest annually in equal installments over periods of three to five years. The following table provides additional information related to time-based RSU activity during those periods.\nYear Ended September 30,\n2022 2021 2020\nNumber of Restricted Stock Units Weighted Average Grant Date Fair Value Number of Restricted Stock Units Weighted Average Grant Date Fair Value Number of Restricted Stock Units Weighted Average Grant Date Fair Value\nOutstanding at beginning of year 387,154 $ 20.70 285,863 $ 17.47 200,960 $ 19.68\nGranted 394,786 17.76 234,000 23.13 181,325 16.11\nVested (123,389) 19.98 (92,159) 19.08 (79,432) 19.58\nCancelled (36,600) 19.98 (40,550) 19.66 (16,990) 19.10\nOutstanding at end of year 621,951 $ 18.94 387,154 $ 20.70 285,863 $ 17.47\nThe total fair value of shares vested on the vesting date was $2.5 million during fiscal 2022 and $1.6 million during both fiscal 2021 and 2020. Total stock-based compensation expense related to the Company's restricted stock units for fiscal 2022, 2021 and 2020 was $3.3 million, $2.6 million and $2.0 million, respectively. These expenses are included in selling, general and administrative expense in the Company's consolidated statements of operations. At September 30, 2022, there was $8.0 million of unrecognized compensation expense related to unvested time-based RSU awards. This expense is expected to be recognized over a weighted average period of 2.9 years.\nNote 12 - Commitments and Contingencies\nContractual Obligations and Off-Balance Sheet Arrangements\nIn support of the Company's residential lot development business, it issues letters of credit under the revolving credit facility and has a surety bond program that provides financial assurance to beneficiaries related to the execution and performance of certain development obligations. At September 30, 2022, the Company had outstanding letters of credit of $53.3 million under the revolving credit facility and surety bonds of $632.7 million issued by third parties to secure performance under various contracts. The Company expects that its performance obligations secured by these letters of credit and bonds will generally be completed in the ordinary course of business and in accordance with the applicable contractual terms. When the Company completes its performance obligations, the related letters of credit and bonds are generally released shortly thereafter, leaving the Company with no continuing obligations. The Company has no material third-party guarantees.\nLitigation\nThe Company is involved in various legal proceedings that arise from time to time in the ordinary course of business and believes that adequate reserves have been established for any probable losses. The Company does not believe that the outcome of any of these proceedings will have a significant adverse effect on its financial position, long-term results of operations or cash flows. It is possible, however, that charges related to these matters could be significant to the Company's results or cash flows in any one accounting period.\nLand Purchase Contracts\nThe Company enters into land purchase contracts to acquire land for the development of residential lots. At September 30, 2022, the Company had total deposits of $10.0 million related to contracts to purchase land with a total remaining purchase price of approximately $490.3 million. The majority of land and lots under contract are currently expected to be purchased within two years. None of the land purchase contracts were subject to specific performance provisions at September 30, 2022.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nOther Commitments\nThe Company leases facilities and equipment under non-cancelable long-term operating lease agreements. In addition, the Company has various obligations under other office space and equipment leases of less than one year. Rent expense for facilities and equipment was $2.5 million in fiscal 2022, $1.7 million in fiscal 2021 and $1.1 million in fiscal 2020. Future minimum rental commitments, by fiscal year, under non-cancelable operating leases having an initial or remaining term in excess of one year are: 2023 - $2.4 million; 2024 - $2.4 million; 2025 - $1.9 million; 2026 - $1.4 million; 2027 - $0.2 million; and none thereafter.\nNote 13 - Related Party Transactions\nThe Company has a Shared Services Agreement with D.R. Horton whereby D.R. Horton provides the Company with certain administrative, compliance, operational and procurement services. During fiscal 2022, 2021 and 2020, selling, general and administrative expense in the consolidated statements of operations included $4.1 million, $4.0 million and $5.0 million for these shared services, $7.4 million, $4.7 million and $2.7 million reimbursed to D.R. Horton for the cost of health insurance and other employee benefits and $6.6 million, $6.1 million and $4.0 million for other corporate and administrative expenses paid by D.R. Horton on behalf of the Company.\nThe Company is subject to a Tax Sharing Agreement with D.R. Horton. The agreement sets forth an equitable method for reimbursements of tax liabilities or benefits between the Company and D.R. Horton related to state and local income, margin or franchise tax returns that are filed on a unitary basis with D.R. Horton. In accordance with the agreement, the Company reimbursed D.R. Horton $0.7 million, $0.5 million and $0.2 million in fiscal 2022, 2021 and 2020, respectively, for its tax expense generated in fiscal 2021, 2020 and 2019.\nUnder the terms of the Master Supply Agreement with D.R. Horton, both companies identify land development opportunities to expand Forestar's portfolio of assets. At September 30, 2022 and 2021, the Company owned approximately 61,800 and 64,400 residential lots, of which D.R. Horton had the following involvement.\nSeptember 30,\n2022 2021\n(Dollars in millions)\nResidential lots under contract to sell to D.R. Horton 17,800 21,000\nResidential lots subject to right of first offer with D.R. Horton 18,900 18,200\nEarnest money deposits from D.R. Horton for lots under contract $ 130.1 $ 143.1\nEarnest money notes from D.R. Horton for lots under contract $ - $ 0.7\nRemaining sales price of lots under contract with D.R. Horton $ 1,389.7 $ 1,582.7\nDuring fiscal 2022, 2021 and 2020, the Company's residential lot sales totaled 17,691, 15,915 and 10,373 and lot sales revenues were $1.5 billion, $1.3 billion and $880.3 million. Lot and land sales to D.R. Horton during those periods were as follows.\nYear Ended September 30,\n2022 2021 2020\n(Dollars in millions)\nResidential lots sold to D.R. Horton 14,895 14,839 10,164\nResidential lot sales revenues from sales to D.R. Horton $ 1,230.0 $ 1,212.1 $ 859.7\nTract acres sold to D.R. Horton - 85 143\nTract sales revenues from sales to D.R. Horton $ - $ 25.9 $ 25.6\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn addition, the net impact of the change in contract liabilities increased revenues on lot sales to D.R. Horton by $1.8 million in fiscal 2022, decreased revenues on lot sales to D.R. Horton by $5.6 million in fiscal 2021 and increased revenues on lot sales to D.R. Horton by $2.3 million in fiscal 2020.\nDuring fiscal 2022, 2021 and 2020, the Company reimbursed D.R. Horton approximately $8.7 million, $30.8 million and $27.0 million for previously paid earnest money and $58.9 million, $61.3 million and $36.3 million for pre-acquisition and other due diligence and development costs related to land purchase contracts identified by D.R. Horton that the Company independently underwrote and closed.\nDuring fiscal 2022, 2021 and 2020, the Company paid D.R. Horton $2.8 million, $5.7 million and $6.2 million for land development services. These amounts are included in cost of sales in the Companys consolidated statements of operations.\nAt September 30, 2022 and 2021, land held for future development primarily consists of undeveloped land which the Company has the contractual right to sell to D.R. Horton within approximately one year of its purchase or, if D.R. Horton elects, at an earlier date, at a sales price equal to the carrying value of the land at the time of sale plus additional consideration of 12% to 16% per annum.\nAt September 30, 2022 and 2021, accrued expenses and other liabilities on the Company's consolidated balance sheets included $3.2 million and $6.7 million owed to D.R. Horton for any accrued and unpaid shared service charges, land purchase contract deposits and due diligence and other development cost reimbursements.\nFORESTAR GROUP INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 14 - Fair Value Measurements\nFair value is the exchange price that would be received for an asset or paid to transfer a liability in an orderly transaction between market participants. In arriving at a fair value measurement, the Company uses a fair value hierarchy based on three levels of inputs, of which the first two are considered observable and the last unobservable. The three levels of inputs used to establish fair value are the following:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities;\nLevel 2 - Inputs other than Level 1 that are observable, either directly or indirectly, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities; and\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities.\nThe Company elected not to use the fair value option for cash and cash equivalents and debt.\nFor the financial assets and liabilities that the Company does not reflect at fair value, the following tables present both their respective carrying value and fair value at September 30, 2022 and 2021.\nFair Value at September 30, 2022\nCarrying Value Level 1 Level 2 Level 3 Total\n(in millions)\nCash and cash equivalents (a)\n$ 264.8 $ 264.8 $ - $ - $ 264.8\nDebt (b) (c)\n706.0 - 570.7 12.5 583.2\nFair Value at September 30, 2021\nCarrying Value Level 1 Level 2 Level 3 Total\n(in millions)\nCash and cash equivalents (a)\n$ 153.6 $ 153.6 $ - $ - $ 153.6\nDebt (b) (c)\n704.5 - 711.2 12.5 723.7\n_____________________\n(a) The fair values of cash and cash equivalents approximate their carrying values due to their short-term nature and are classified as Level 1 within the fair value hierarchy.\n(b) At September 30, 2022 and 2021, debt primarily consisted of the Company's senior notes. The fair value of the senior notes is determined based on quoted market prices in markets that are not active, which is classified as Level 2 within the fair value hierarchy.\n(c) The fair values of the Company's other note payable approximates its carrying value due to its short-term nature and is classified as Level 3 within the fair value hierarchy.\nNon-financial assets measured at fair value on a non-recurring basis primarily include real estate assets which the Company reviews for indicators of potential impairment and performs impairment evaluations when necessary. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\n(a) Disclosure controls and procedures\nOur management, with the participation of the Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of our disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)), as of the end of the period covered by this report. Based on such evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that, as of the end of such period, our disclosure controls and procedures were effective in recording, processing, summarizing and reporting, on a timely basis, information required to be disclosed by us in the reports that we file or submit under the Exchange Act and were effective in ensuring that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\n(b) Internal control over financial reporting\nManagements report on internal control over financial reporting and the report of our independent registered public accounting firm are included in Part II, Item 8 of this Annual Report on Form 10-K.\n(c) Changes in internal control over financial reporting\nThere have been no changes in our internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the quarter ended September 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot Applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe information required by this item is set forth under the captions Election of Directors, Delinquent Section 16(a) Reports, if applicable, and Board Matters in our definitive Proxy Statement for the 2023 Annual Meeting of Stockholders. Item 11. Executive Compensation.\nThe information required by this item is set forth under the captions Director Compensation, Executive Compensation and CEO Pay Ratio in our definitive Proxy Statement for the 2023 Annual Meeting of Stockholders. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe information required by this item is set forth under the captions Securities Authorized for Issuance under Equity Compensation Plans and Voting Securities and Principal Stockholders in our definitive Proxy Statement for the 2023 Annual Meeting of Stockholders. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe information required by this item is set forth under the captions Certain Relationships and Related Party Transactions and Board Matters in our definitive Proxy Statement for the 2023 Annual Meeting of Stockholders. Item 14. Principal Accountant Fees and Services.\nThe information required by this item is set forth under the caption Proposal to Ratify the Selection of Ernst & Young as our Independent Registered Public Accounting Firm in our definitive Proxy Statement for the 2023 Annual Meeting of Stockholders.\nPART IV Item 15. Exhibits and Financial Statement Schedules.\n(a)The following documents are filed as part of this report.\n(1) Financial Statements\nOur consolidated financial statements are included in Part II, Item 8 of this Annual Report on Form 10-K.\n(2) Financial Statement Schedules\nAll financial statement schedules are omitted because they are not applicable or the required information is included in the consolidated financial statements or notes thereto.\n(3) Exhibits\nThe exhibits listed in (b) are filed or incorporated by reference as part of this Annual Report on Form 10-K.\n(b)Exhibits\nExhibit\nNumber Exhibit\n2.1 Agreement and Plan of Merger, dated as of June 29, 2017, by and among Forestar Group Inc., D.R. Horton, Inc. and Force Merger Sub, Inc. (incorporated by reference to Exhibit 2.1 to the Companys Current Report on Form 8-K filed with the Commission on June 29, 2017).\n3.1 Second Amended and Restated Certificate of Incorporation of Forestar Group Inc. (incorporated by reference to Exhibit 3.1 of the Companys Current Report on Form 8-K filed with the Commission on October 10, 2017).\n3.2 Second Amended and Restated Bylaws of Forestar Group Inc. (incorporated by reference to Exhibit 3.2 of the Companys Current Report on Form 8-K filed with the Commission on October 10, 2017).\n3.3 First Amendment to the Second Amended and Restated Bylaws of Forestar Group Inc. (incorporated by reference to Exhibit 3.1 of the Companys Current Report on Form 8-K filed with the Commission on January 30, 2018).\n3.4 Second Amendment to the Second Amended and Restated Bylaws of Forestar Group Inc. (incorporated by reference from Exhibit 3.1 to Forestar Group Inc.s Quarterly Report on Form 10-Q filed with the Commission on August 8, 2018).\n4.1 Specimen Certificate for shares of common stock, par value $1.00 per share (incorporated by reference to Exhibit 4.7 of the Company's Registration Statement on Form S-3 filed with the Commission on September 24, 2018).\n4.2 Indenture, dated as of February 25, 2020, by and among Forestar Group Inc., the subsidiary guarantors party thereto and U.S. Bank National Association, as trustee (incorporated by reference to Exhibit 4.1 of the Companys Current Report on Form 8-K filed with the Commission on February 25, 2020).\n4.3* Supplemental Indenture, dated as of August 29, 2022, among FOR Nevada Development LLC, FOR California Development LLC, Forestar Group Inc. and U.S. Bank Trust Company, National Association (as successor to U.S. Bank National Association), as trustee, relating to the 5.000% Senior Notes due 2028 of Forestar Group Inc.\n4.4 Description of Securities (incorporated by reference to Exhibit 4.6 of the Company's Annual Report on Form 10-K filed with the Commission on November 21, 2019).\n4.5 Indenture, dated as of April 21, 2021, by and among Forestar Group Inc., the subsidiary guarantors party thereto and U.S. Bank National Association, as trustee.\n4.6* Supplemental Indenture, dated as of August 29, 2022, among FOR Nevada Development LLC, FOR California Development LLC, Forestar Group Inc. and U.S. Bank Trust Company, National Association (as successor to U.S. Bank National Association), as trustee, relating to the 3.850% Senior Notes due 2026 of Forestar Group Inc.\n10.1 Forestar Real Estate Group Inc. Supplemental Executive Retirement Plan (incorporated by reference to Exhibit 10.5 of Amendment No. 5 to the Companys Form 10 filed with the Commission on December 10, 2007).\n10.2 Amendment No. 1 to Forestar Group Inc. Supplemental Executive Retirement Plan (incorporated by reference to Exhibit 10.3 of the Companys Annual Report on Form 10-K filed with the Commission on March 14, 2013).\n10.3 Amendment No. 2 to Forestar Group Inc. Supplemental Executive Retirement Plan (incorporated by reference to Exhibit 10.25 of the Company's Annual Report on Form 10-K filed with the Commission on March 11, 2014).\n10.4 Form of Indemnification Agreement (incorporated by reference to Exhibit 10.3 of the Companys Current Report on Form 8-K filed with the Commission on October 10, 2017).\n10.5 Form of Change in Control/Severance Agreement between the Company and its named executive officers (incorporated by reference to Exhibit 10.10 of the Companys Form 10 filed with the Commission on August 10, 2007).\n10.6 Form of First Amendment to Change in Control/Severance Agreement between the Company and certain named executive officers (incorporated by reference to Exhibit 10.8 of the Companys Annual Report on Form 10-K filed with the Commission on February 28, 2018).\n10.7 Shared Services Agreement, dated October 6, 2017, between Forestar Group Inc. and D.R. Horton, Inc. (incorporated by reference to Exhibit 10.7 of the Companys Form 10-K filed with the Commission on November 19, 2020).\n10.8 Stockholders Agreement dated as of June 29, 2017, by and between Forestar Group Inc. and D.R. Horton, Inc. (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed with the Commission on June 29, 2017).\n10.9 Master Supply Agreement dated as of June 29, 2017, by and between Forestar Group Inc. and D.R. Horton, Inc. (incorporated by reference to Exhibit 10.2 of the Companys Current Report on Form 8-K filed with the Commission on June 29, 2017).\n10.10 Forestar Real Estate Group Inc. 2007 Stock Incentive Plan (incorporated by reference to Exhibit 10.6 of Amendment No. 5 to the Companys Form 10 filed with the Commission on December 10, 2007).\n10.11 First Amendment to the Forestar Real Estate Group Inc. 2007 Stock Incentive Plan (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed with the Commission on May 13, 2009).\n10.12 Second Amendment to the Forestar Group Inc. 2007 Stock Incentive Plan (incorporated by reference to Exhibit 10.22 of the Companys Annual Report on Form 10-K filed with the Commission on March 3, 2010).\n10.13 Form of Restricted Stock Units Agreement pursuant to Forestar Real Estate Group Inc.s 2007 Stock Incentive Plan (incorporated by reference to Exhibit 10.11 of the Companys Annual Report on Form 10-K filed with the Commission on March 14, 2013).\n10.14 Forestar Group Inc. 2018 Stock Incentive Plan (incorporated by reference to Exhibit 10.2 of the Companys Quarterly Report on Form 10-Q filed with the Commission on May 9, 2018).\n10.15 Form of Restricted Stock Unit Agreement (Employees) pursuant to Forestar Group Inc.s 2018 Stock Incentive Plan (incorporated by reference to Exhibit 10.3 of the Companys Quarterly Report on Form 10-Q filed with the Commission on May 9, 2018).\n10.16 Credit Agreement, dated August 16, 2018, among Forestar Group Inc., the lenders party thereto and JPMorgan Chase Bank, N.A., as administrative agent (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed with the Commission on August 17, 2018).\n10.17 Form of Restricted Stock Unit Award Agreement (Employee) pursuant to the Company's 2018 Stock Incentive Plan (incorporated by reference to Exhibit 10.1 of the Companys Quarterly Report on Form 10-Q filed with the Commission on July 30, 2019).\n10.18 Form of Restricted Stock Unit Award Agreement (Director) pursuant to the Company's 2018 Stock Incentive Plan (incorporated by reference to Exhibit 10.2 of the Companys Quarterly Report on Form 10-Q filed with the Commission on July 30, 2019).\n10.19 Amendment No. 1 to Credit Agreement, dated October 2, 2019 by and among Forestar Group Inc., JPMorgan Chase Bank, N.A., as administrative agent, and the Lenders named therein (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed with the Commission on October 3, 2019).\n10.20 Amendment No. 2 to Credit Agreement, dated April 16, 2021 by and among the Company, JPMorgan Chase Bank, N.A., as administrative agent, and the Lenders named therein (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed with the Commission on April 20, 2021).\n10.21 Amendment No. 3 to Credit Agreement, dated October 28, 2022 by and among the Company, JPMorgan Chase Bank, N.A., as administrative agent, and the Lenders named therein (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed with the Commission on November 1, 2022).\n10.22 Equity Distribution Agreement, dated as of November 18, 2021, among Forestar Group Inc. and the Sales Agents named therein (incorporated by reference to Exhibit 1.1 of the Company's Current Report on Form 8-K filed with the Commission on November 18, 2021).\n21.1* List of Subsidiaries of the Company.\n23.1* Consent of Ernst & Young LLP.\n31.1* Certification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2* Certification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1* Certification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2* Certification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS** XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH** Inline XBRL Taxonomy Extension Schema Document.\n101.CAL** Inline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF** Inline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB** Inline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE** Inline XBRL Taxonomy Extension Presentation Linkbase Document.\n104** Cover Page Interactive Data File (embedded within the Inline XBRL document contained in Exhibit 101).\n_____________________\n* Filed or furnished herewith.\n** Submitted electronically herewith.\nManagement contract or compensatory plan or arrangement.\nItem 16. Form 10-K Summary.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nForestar Group Inc.\nDate: November 17, 2022 By: /s/ James D. Allen\nJames D. Allen\nExecutive Vice President and Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ Daniel C. Bartok Chief Executive Officer\n(Principal Executive Officer) November 17, 2022\nDaniel C. Bartok\n/s/ James D. Allen Executive Vice President and Chief Financial Officer\n(Principal Financial and Principal Accounting Officer) November 17, 2022\nJames D. Allen\n/s/ Donald J. Tomnitz Executive\nChairman of the Board November 17, 2022\nDonald J. Tomnitz\n/s/ Samuel R. Fuller Director November 17, 2022\nSamuel R. Fuller\n/s/ Lisa H. Jamieson Director November 17, 2022\nLisa H. Jamieson\n/s/ G.F. (Rick) Ringler, III Director November 17, 2022\nG.F. (Rick) Ringler, III\n/s/ Donald C. Spitzer Director November 17, 2022\nDonald C. Spitzer"
}