{
    "cik": "1409624",
    "company": "HIMALAYA TECHNOLOGIES, INC",
    "filing_type": "10-K",
    "filing_date": "2023-10-27",
    "period_of_report": "2023-07-31",
    "sic": "1311",
    "state_of_inc": "NV",
    "state_location": "PA",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1409624/0001493152-23-038473-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1409624/000149315223038473/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1409624/0001493152-23-038473.txt",
    "filename": "1409624_10K_2023_0001493152-23-038473.htm",
    "content": "Item 1. Description of Business.\nHimalaya Technologies, Inc. a/k/a Homeland Resources Ltd. (Himalaya, HMLA, us, we, the Company) was incorporated under the laws of the State of Nevada on July 8, 2003. The Companys principal historical activities had been the acquisition of a mineral property in the State of New Mexico. During the fiscal year ended July 31, 2010, the Company began to acquire working interests in a seismic exploration program as well as a drilling program in crude oil and natural gas properties in Oklahoma. Prior to July 31, 2019 the Company discontinued the exploration and drilling in Oklahoma and New Mexico. The Company has leases on two properties that were fully depleted prior to July 31, 2019. Over the past few years, the company generated approximately $1,500 per year of net revenue from these leases. Subsequent to July 31, 2022 the Company reached an agreement with the prior CEO to distribute the oil leases in payment of loan from shareholder. Our intended plan of operations was to develop and enhance our social site Kanab.Club targeting health and wellness in the cannabis media market.\nAt July 31, 2023, the Company had one wholly owned subsidiary, KANAB CORP. The Company had one investment, Peer to Peer Network, Inc. (PTOP.)\nKANAB CORP. is a development stage company targeting information services for the cannabis industry using its social site Kanab.Club (https://kanab.club/). We do not offer e-commerce services at this time or touch the cannabis plant and, given these matters, do not believe regulatory oversight or rules of law are a risk factor to our business.\nOn November 28, 2021 we executed a 19.9% stock purchase with GenBio, Inc. (GenBio; https://www.genbioinc.com/) a provider of nutraceutical products and services based on proprietary biotechnology that fight inflammation and high blood pressure. We issued 99,686 series B Preferred shares of stock for 2,036,188 common shares of GenBio, Inc., representing 19.9% ownership. Based on a stock price at closing of .0019 and 99,685,794 common stock equivalents, this valued the investment at $189,749. On May 16, 2023, we unwound our investment in GenBio, and subsequently received back 99,686 series B Preferred shares of stock.\nOn January 1, 2022, the Company executed a 19.9% stock purchase with The Agrarian Group LLC (TAG; http://www.theagrariangroup.com/), a provider of digital intelligence AgtechDi software designed from its granted patents to optimize the food supply chain by increasing food safety and profitability for growers who operate vertical farms, greenhouses, converted shipping containers, and other forms of controlled environment agriculture. TAG is focusing its technology on the broad produce market, but in the future may offer it to cannabis cultivators. TAG is a software platform and will never touch the cannabis plant, eliminating regulatory risk, in our view. Under the Investment Agreement, we issued TAG 99,686 Series B Preferred shares in exchange for 1,242,000 Class A Membership units of TAG. Based on a stock price at closing of .0012 and 99,868,000 common stock equivalents, this values the investment at $119,841. On April 3, 2023, we unwound our investment in TAG, and received back 99,686 series B Preferred shares of stock.\n.\nOn June 12, 2023, we purchased 210,000,000 common shares of Peer-to-Peer Network (OTC: PTOP) from FOMO WORLDWIDE, INC. (OTC: FOMC) by issuing FOMO WORLDWIDE, INC. 1,680,000 of our Series A Preferred shares. The fair value of the PTOP shares received was $63,000, and the as if converted value of our Series A Preferred shares was $100,800. A loss of $37,800 was thus recorded on acquisition. At July 31, 2023, the value of the investment in PTOP was $21,000.\nOur business plan included completing our social site Kanab.Club targeting health and wellness focused on the cannabis market, generating revenues from advertising and subscriptions, incorporating social media site into the site, and marketing our planned social sites including Goccha.net and Yinzworldwide.com.\nThe Companys shareholder voting control is effectively controlled by its chairman and CEO, Vikram P. Grover, due to his ownership of (i) all 1,000,000 of the outstanding shares of the Companys Series C Preferred Stock which has voting power of 100,000 votes per share, (ii) 4,777,777 shares of the Companys Series A Preferred Stock directly (31.9% of that classs outstanding shares) and 2,000,000 shares of the Companys Series A Preferred Stock indirectly through a Company he controls (27.4%) which have 50 votes per share. and (iii) 247,094 shares of the Companys Series B Preferred Stock directly (31.9% of that classs outstanding shares) and 250,000 shares of the Companys Series B Preferred Stock indirectly through a Company he controls (27.4%) which have 1,000 votes per share. With this voting power, Mr. Grover can determine the outcome of any matter put to a shareholder vote including taking corporate actions by shareholder consent.\nCorporate Information\nWe were incorporated in the State of Nevada in 2003. Our principal executive offices are located at 1 E Erie St, Ste 525 Unit #2420, Chicago, IL 60611 and our telephone number is (630) 708-0750. Our website is www.himalayatechnologies.com. Information contained on, or that can be accessed through, our website is not incorporated by reference into this Annual Report. Item 1A. Risk Factors.\nNot applicable to smaller reporting companies Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nThe Companys headquarters is an office at 831 W North Ave., Pittsburgh, PA 15233. Item 3. Legal Proceedings.\nNone. Item 4. Mine Safety Disclosures.\nNone.\nPART II Item 5. Market for Registrants Common Equity Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur shares of common stock are quoted on the OTCPink tier of the over-the-counter market operated by OTC Markets Group Inc. under the symbol HMLA. Such market is extremely limited. We can provide no assurance that our shares of common stock will be continued to be traded on the OTCPink or another exchange, or if traded, that the current public market will be sustainable.\nHolders of Record\nAs of the date of this Annual Report, there were approximately 34 holders of record of our common stock, as reported by the Companys transfer agent. In computing the number of holders of record, each broker-dealer and clearing corporation holding shares on behalf of its customers is counted as a single shareholder and accordingly, the Company believes that the number of beneficial owners of its common stock is significantly higher.\nDividends\nWe have never declared or paid any cash dividends on our common stock, nor do we anticipate paying any in the foreseeable future. Furthermore, we expect to retain any future earnings to finance our operations and expansion. The payment of cash dividends in the future will be at the discretion of our Board of Directors.\nSecurities Authorized for Issuance under Equity Compensation Plans\nNone.\nRecent Sales of Unregistered Securities\nNone. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operation\nThis Annual Report contains forward-looking statements. Our actual results could differ materially from those set forth because of general economic conditions and changes in the assumptions used in making such forward-looking statements. The following discussion and analysis of our financial condition and results of operations should be read together with the audited consolidated financial statements and accompanying notes and the other financial information appearing elsewhere in this Annual Report. See Cautionary Note Regarding Forward Looking Statements above.\nResults of Operations\nYear ended July 31, 2023 as compared to year ended July 31, 2022\nRevenues. During the years ended July 31, 2023 and 2022, the Company had no revenues.\nCost of Revenues. During the years ended July 31, 2023 and 2022, the Company had no cost of revenues.\nOperating Expenses. During the year ended July 31, 2023, the Company incurred operating expenses of $302,199 consisting primarily of shares issued for services and compensation expense. During the year ended July 31, 2022, the Company incurred operating expenses of $285,731 consisting primarily of shares issued for services and compensation expense. The increase in operating expenses in 2023 from 2022 was due primarily to shares and warrants issued for services.\nOther Income (Expenses). During the year ended July 31, 2023, the Company incurred other income(expense) $(275,577) consisting of interest expense, derivative liability losses, investment losses, a gain on the sale of oil and gas properties and other income. During the year ended July 31, 2022, the Company incurred other income(expense) $88,692 consisting of interest expense, derivative liability gains and other income.\nNet Losses. As a result of the above, the Company incurred a net loss of $577,776, for the year ended July 31, 2023, as compared to a net loss of $197,039 for the year ended July 31, 2022.\nLiquidity and Capital Resources at July 31, 2023\nWe have incurred losses since inception of our business and at July 31, 2023, we had an accumulated deficit of $8,637,251. As of July 31, 2023, we had cash of $324 and negative working capital of $1,161,282.\nTo date, we have funded our operations through short-term debt and equity financing. During the year ended July 31, 2023, the Company received $50,815, less $20,863 in payments, from related parties, as well as $35,000 received from third parties.\nSummary of Significant Accounting Policies\nSee Note 2 to the Consolidated Financial Statements included in Item 8 of this Annual Report.\nOff-balance Sheet Arrangements\nNone. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nNot required under Regulation S-K for smaller reporting companies. Item 8. Financial Statements and Supplementary Data.\nOur audited consolidated financial statements are set forth below.\nHIMALAYA TECHNOLOGIES, INC. and Subsidiary\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReports of Independent Registered Public Accounting Firm Victor Mokuolu (Firm ID:6771)\nConsolidated Balance Sheets, July 31, 2023 and 2022\nConsolidated Statements of Operations for the years ended July 31, 2023 and 2022\nConsolidated Statements of Stockholders Deficit for the years ended July 31, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended July 31, 2023 and 2022\nNotes to Consolidated Financial Statements July 31, 2023 and 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors\nHimalaya Technologies, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Himalaya Technologies, Inc. (the Company) as of July 31, 2023 and July 31, 2022, and the related consolidated statements of operations, stockholders deficit, and cash flows for each of the two years ended July 31, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of year ended July 31, 2023 and July 31, 2022, and the results of its operations and its cash flows for each of the two years ended July 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial doubt about the Companys ability to continue as a going concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company had operating losses for each of the years ended July 31, 2023, and July 31, 2022, has an accumulated deficit as of July 31, 2023, and the Company has not completed its efforts to generate revenues to cover its operating costs. These factors raise substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee or the Companys governance and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We have determined there are critical matters related to the Companys convertible debentures.\nAs described in Notes 2, Summary of Significant Accounting Policies, and Note 7, Convertible Note Payables, to the consolidated financial statements, the Company had convertible debentures with attached warrants that required accounting considerations and significant estimates. The Company determined that variable conversion features with attached warrants issued in connection with certain convertible debentures required derivative liability classification. These variable conversion features were initially measured at fair value and subsequently have been remeasured to fair value at each reporting period. The Company determined the fair value of the embedded derivatives using the Black-Scholes-Merton option pricing model. The value of the embedded derivative liabilities related to the convertible debentures as of July 31, 2023 was $680,946. We identified the accounting considerations and related valuations, including the related fair value determinations of the embedded derivative liabilities of such as a critical audit matter. The principal considerations for our determination were: (1) the accounting consideration in determining the nature of the various features (2) the evaluation of the potential derivatives and potential bifurcation in the instruments, and (3) considerations related to the determination of the fair value of the various debt and equity instruments and the conversion features that include valuation models and assumptions utilized by management. An audit of these elements is especially challenging and requires auditor judgement due to the nature and extent of audit effort required to address these matters, including the extent of specialized skill or knowledge needed. Our audit procedures related to managements conclusion on the evaluation and related valuation of embedded derivatives, included the following, among others: (1) evaluating the relevant terms and conditions of the various financings, (2) assessing the appropriateness of conclusions reached by the Company with respect to the accounting for the convertible debt, and the assessment and accounting for potential derivatives and (3) independently recomputing the valuations determined by Management.\nVictor Mokuolu, CPA PLLC\nWe have served as the Companys auditor since 2022.\nHouston, Texas\nOctober 27, 2023\nPCAOB ID: 6771\nHimalaya Technologies Inc\nConsolidated Balance Sheets\nJuly 31,\nASSETS\nCurrent assets\nCash $ 324 $ 4,141\nTotal current assets 4,141\nOther assets:\nInvestment in oil and gas properties - -\nInvestments 21,000 309,590\nWebsite design 14,651 13,338\nTotal other assets 35,651 322,928\nTotal assets $ 35,975 $ 327,069\nLIABILITIES AND STOCKHOLDERS DEFICIT\nLiabilities\nCurrent liabilities\nAccounts payable and accrued expenses $ 277,478 $ 293,856\nDerivative liability 680,946 440,766\nLoan from shareholder - 96,400\nLoan from affiliate 41,157 38,222\nLoan from related parties 41,157 38,222\nLoans payable due to non-related parties, net 162,025 151,500\nTotal current liabilities 1,161,606 1,020,744\nTotal liabilities 1,161,606 1,020,744\nStockholders deficit\nCommon stock; $0.0001 par value authorized: 1,000,000,000 shares; issued and outstanding 186,878,572 and 147,201,861 18,688 14,720\nPreferred stock Class A; $0.0001 par value authorized: 130,000,000 shares; issued and outstanding 8,457,777 and 0 -\nPreferred stock Class B; $0.0001 par value authorized: 20,000,000 shares; issued and outstanding 518,730 and 536,876 respectively\nPreferred stock Class C; $0.0001 par value authorized: 1,000,000 shares; issued and outstanding 1,000,000 and 1,000,000\nPreferred stock value\nAdditional paid-in-capital 7,491,934 7,350,927\nAccumulated deficit (8,637,251 ) (8,059,476 )\nTotal stockholders deficit (1,125,631 ) (693,675 )\nTotal liabilities and stockholders deficit $ 35,975 $ 327,069\nThe accompanying notes are an integral part of these consolidated financial statements\nHimalaya Technologies Inc\nConsolidated Statement of Operations\nFor the Years Ended July 31,\nOperating revenue $ - $ -\nCost of revenue - -\nGross profit - -\nOperating expenses:\nGeneral and administrative 297,512 283,068\nAmortization expense 4,687 2,663\nTotal operating expenses 302,199 285,731\nLoss from operations (302,199 ) (285,731 )\nOther income (expenses)\nInterest expense (33,630 ) (22,986 )\nDerivative expense (64,937 ) -\nChange in derivative liability (209,603 ) 111,125\nInvestment loss (79,800 ) -\nGain on sale of oil and gas properties 112,000 -\nOther income\nTotal other income (expenses) (275,577 ) 88,692\nLoss before income taxes (577,776 ) (197,039 )\nProvision for income taxes - -\nNet income (loss) $ (577,776 ) $ (197,039 )\nNet income (loss) per share, basic and diluted $ (0.00 ) $ (0.00 )\nWeighted average common equivalent share outstanding, basic and diluted 157,911,455 130,845,920\nThe accompanying notes are an integral part of these consolidated financial statements\nHimalaya Technologies Inc\nConsolidated Statement of Stockholders Deficit\nCommon Stock\nPreferred Stock\nClass A\nClass B\nClass C\nAdditional\nTotal\nNumber\nNo\nNumber\n$0.0001\nNumber\n$0.0001\nNumber\n$0.0001\npaid-in\nAccumulated\nstockholders\nof Shares\npar value\nof Shares\npar value\nof Shares\npar value\nof Shares\npar value\ncapital\ndeficit\ndeficit\nBalance, July 31, 2021\n97,734,883\n$ 9,773\n-\n$ -\n300,000\n$\n1,000,000\n$\n$ 6,709,111\n$ (7,862,437 )\n$ (1,143,423 )\nConversion of convertible debt\n49,466,978\n4,947\n-\n-\n-\n-\n-\n-\n123,050\n-\n127,997\nShares issued for services\n-\n-\n-\n-\n22,000\n-\n-\n39,198\n-\n39,200\nShares issued for accrued compensation\n-\n-\n-\n-\n15,504\n-\n-\n79,998\n-\n80,000\nShares issued for investment\n-\n-\n-\n-\n199,372\n-\n-\n309,570\n-\n309,590\nRecognition of warrants\n-\n-\n-\n-\n-\n-\n-\n-\n90,000\n-\n90,000\nNet income\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(197,039 )\n(197,039 )\nBalance, July 31, 2022\n147,201,861\n14,720\n-\n-\n536,876\n1,000,000\n7,350,927\n(8,059,476 )\n(693,675 )\nBalance 147,201,861 14,720 - - 536,876 1,000,000 7,350,927 (8,059,476 ) (693,675 )\nShares issued for accrued compensation\n-\n-\n4,777,777\n81,590\n-\n-\n159,514\n-\n160,000\nRecognition of warrants\n-\n-\n-\n-\n-\n-\n-\n-\n90,000\n-\n90,000\nConversion of warrants\n-\n-\n2,000,000\n-\n-\n-\n-\n9,800\n-\n10,000\nConversion of convertible debt\n39,676,711\n3,968\n-\n-\n-\n-\n-\n-\n60,641\n-\n64,609\nRecission of investment in TAG\n-\n-\n-\n-\n(99,686 )\n(10 )\n-\n-\n(119,830 )\n-\n(119,840 )\nRecission of investment in GenBio\n-\n-\n-\n-\n(99,686 )\n(10 )\n-\n-\n(189,739 )\n-\n(189,749 )\nAcquisition of investment in PTOP\n-\n-\n1,680,000\n-\n-\n-\n-\n100,632\n-\n100,800\nShares issued for debt forgiveness and advisory fees\n-\n-\n-\n-\n100,000\n-\n-\n29,990\n-\n30,000\nNet loss\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(577,776 )\n(577,776 )\nNet income (loss) - - - - - - - - - (577,776 ) (577,776 )\nBalance, July 31, 2023\n186,878,572\n$ 18,688\n8,457,777\n$\n518,730\n$\n1,000,000\n$\n$ 7,491,934\n$ (8,637,252 )\n$ (1,125,631 )\nBalance 186,878,572 $ 18,688 8,457,777 $ 846 518,730 $ 52 1,000,000 $ 100 $ 7,491,934 $ (8,637,252 ) $ (1,125,631 )\nThe accompanying notes are an integral part of these consolidated financial statements\nHimalaya Technologies Inc\nConsolidated Statement of Cash Flows\nFor the Years Ended July 31,\nCash flows provided by (used for) operating activities:\nNet income (loss) $ (577,776 ) $ (197,039 )\nAdjustments to reconcile net loss to net cash provided by (used for) operating activities:\nAmortization expense 4,687 2,663\nGain on sale of oil and gas properties (112,000 ) -\nChange in derivative liability 209,603 (111,125 )\nDerivative expense 64,937 -\nAmortization of debt discount 4,075 -\nShares/ Warrants issued for services 90,000 129,200\nShares issued for advisory fees 12,983\nLoss on investments 79,800\nIncrease (decrease) in assets and liabilities:\nAccounts payable 131,367 147,002\nAccrued interest on loans payable 29,555 -\nNet cash used for operating activities (62,769 ) (29,299 )\nCash flows provided by (used for) Investing activities\nPayment of Website Design (6,000 ) (5,800 )\nNet cash provided by (used for) investing activities (6,000 ) (5,800 )\nCash flows provided by (used for) Financing activities\nPayment of related party loan (20,863 ) (600 )\nProceeds from loan from affiliate 50,815 11,222\nProceeds from non-related loans 35,000 -\nNet cash provided by (used for) financing activities 64,952 10,622\nNet (decrease) increase in cash (3,817 ) (24,477 )\nCash, beginning of year 4,141 28,618\nCash, end of year $ 324 $ 4,141\nSupplemental disclosure of cash flow information\nCash paid for interest $ - $ -\nCash paid for taxes $ - $ -\nPreferred stock issued for accrued compensation $ 140,000 $ -\nCommon stock issued for debt $ 64,609 $ 761,456\nConversion of warrants $ 10,000 $ -\nRecission of investment in TAG $ 119,841 $ 761,456\nRecission of investment in GenBio $ 189,749 $ 761,456\nThe accompanying notes are an integral part of these consolidated financial statements\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nNote 1 - ORGANIZATION\nHimalaya Technologies, Inc. (the Company) was incorporated under the laws of the State of Nevada on July 8, 2003. The Companys principal historical activities had been the acquisition of a mineral property in the State of New Mexico. During the fiscal year ended July 31, 2010, the Company began to acquire working interests in a seismic exploration program as well as a drilling program in crude oil and natural gas properties in Oklahoma. Prior to July 31, 2019 the Company discontinued the exploration and drilling in Oklahoma and New Mexico. The Company had leases on two properties that were fully depleted prior to July 31, 2022. Over the past few years, the company generated approximately $1,500 per year of net revenue from these leases. During the year ended July 31, 2023, the Company reached an agreement with the Companys prior CEO to distribute the oil leases in payment of loan from shareholder.\nOn June 28, 2021 the Company amended its Articles of Incorporation to change the name of the Company to Himalaya Technologies, Inc. from Homeland Resources Ltd.\nThe Companys business plan includes completing its social site Kanab.Club targeting health and wellness based on the cannabis market, generating revenues from advertising and subscriptions, incorporating social media site into the site.\nNote 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying financial statements were prepared in conformity with generally accepted accounting principles in the United States of America (US GAAP) and in conformity with the rules and regulation of the U.S. Securities and Exchange Commission (SEC).\nUse of Estimates\nThe preparation of financial statements in conformity with US GAAP requires management to make certain estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. Significant estimates include accounts payable, the recoverability of long-term assets, and the valuation of derivative liabilities.\nConsolidation\nThe consolidated financial statements include the accounts and operations of the Company, and its wholly owned subsidiary, KANAB CORP. All intercompany transactions and accounts have been eliminated in the consolidation.\nCash\nCash consists of deposits in two large national banks in the United States. The Company has not experienced any losses in such accounts and believes it is not exposed to any risks on its cash in bank accounts.\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nFair Value of Financial Instruments\nFor certain of the Companys financial instruments, including cash accounts payable, accrued liabilities, short-term debt, and derivative liability, the carrying amounts approximate their fair values due to their short maturities. We adopted ASC Topic 820, Fair Value Measurements and Disclosures,, which requires disclosure of the fair value of financial instruments held by the Company. ASC Topic 825, Financial Instruments, defines fair value, and establishes a three-level valuation hierarchy for disclosures of fair value measurement that enhances disclosure requirements for fair value measures. The carrying amounts reported in the balance sheets for receivables and current liabilities each qualify as financial instruments and are a reasonable estimate of their fair values because of the short period of time between the origination of such instruments and their expected realization and their current market rate of interest. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurement) and the lowest priority to unobservable inputs (level 3 measurements). The three levels of valuation hierarchy are defined as follows:\nLevel 1 input to the valuation methodology are quoted prices for identical assets or liabilities in active markets.\nLevel 2 inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.\nLevel 3 inputs to the valuation methodology are unobservable in which little or no market data exists, therefore requiring an entity to develop its own assumptions, such as valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nThe Companys analyses of all financial instruments with features of both liabilities and equity under ASC 480, Distinguishing Liabilities from Equity, and ASC 815.\nThe Company has recorded the conversion option on notes as a derivative liability because of the variable conversion price, which in accordance with U.S. GAAP, prevents them from being considered as indexed to our stock and qualified for an exception to derivative accounting.\nThe Company recognizes derivative instruments as either assets or liabilities on the accompanying balance sheets at fair value. We record changes in the fair value of the derivatives in the accompanying statement of operations.\nAssets and liabilities measured at fair value are as follows as of July 31, 2023:\nSCHEDULE OF FAIR VALUE OF ASSETS AND LIABILITIES\nTotal Level 1 Level 2 Level 3\nAssets\nInvestments 21,000 21,000 - -\nTotal assets measured at fair value 21,000 21,000 - -\nLiabilities\nDerivative liability 680,946 - - 680,946\nTotal liabilities measured at fair value 680,946 - - 680,946\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nAssets and liabilities measured at fair value are as follows as of July 31, 2022:\nTotal Level 1 Level 2 Level 3\nAssets\nTotal assets measured at fair value - - - -\nLiabilities\nDerivative liability 440,766 - - 440,766\nTotal liabilities measured at fair value 440,766 - - 440,766\nEarnings Per Share (EPS)\nBasic EPS is computed by dividing income available to common shareholders by the weighted average number of common shares outstanding for the period. Diluted EPS is computed similar to basic net income per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if all the potential common shares, warrants and stock options had been issued and if the additional common shares were dilutive. Diluted EPS assumes that all dilutive convertible shares and stock options were converted or exercised. Dilution is computed by applying the treasury stock method for the outstanding options and the if-converted method for the outstanding convertible preferred shares. Under the treasury stock method, options and warrants are assumed to be exercised at the beginning of the period (or at the time of issuance, if later), and as if funds obtained thereby were used to purchase common stock at the average market price during the period. Under the if-converted method, convertible outstanding instruments are assumed to be converted into common stock at the beginning of the period (or at the time of issuance, if later). During the fiscal years ended July 31, 2023 and 2022, the Company generated no revenues and incurred substantial losses, of which the vast majority were due to mostly non-cash charges for accrued interest, penalties and derivative charges related to convertible debt instruments. Therefore, the effect of any common stock equivalents on EPS is anti-dilutive during those periods.\nIncome Taxes\nThe Company utilizes FASB Accounting Standards Codification (ASC) Topic 740, Income Taxes, which requires recognition of deferred tax assets and liabilities for the expected future tax consequences of events that were included in the financial statements or tax returns. Under this method, deferred income taxes are recognized for the tax consequences in future years of differences between the tax bases of assets and liabilities and their financial reporting amounts at each period end based on enacted tax laws and statutory tax rates applicable to the periods in which the differences are expected to affect taxable income. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized.\nASC 740 provides accounting and disclosure guidance about positions taken by an organization in its tax returns that might be uncertain. When tax returns are filed, it is likely that some positions taken would be sustained upon examination by the taxing authorities, while others are subject to uncertainty about the merits of the position taken or the amount of the position that would be ultimately sustained. The benefit of a tax position is recognized in the financial statements in the period during which, based on all available evidence, management believes it is more likely than not that the position will be sustained upon examination, including the resolution of appeals or litigation processes, if any. Tax positions taken are not offset or aggregated with other positions. Tax positions that meet the more-likely-than-not recognition threshold are measured as the largest amount of tax benefit that is more than 50 percent likely of being realized upon settlement with the applicable taxing authority. The portion of the benefits associated with tax positions taken that exceeds the amount measured as described above is reflected as a liability for unrecognized tax benefits in the accompanying balance sheets along with any associated interest and penalties that would be payable to the taxing authorities upon examination. Interest associated with unrecognized tax benefits is classified as interest expense and penalties are classified in selling, general and administrative expenses in the statements of income.\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nOn July 31, 2023 and 2022, the Company had not taken any significant uncertain tax positions on its tax returns for the period ended July 31, 2023 and prior years or in computing its tax provisions for any years. Prior management considered its tax positions and believed that all of the positions taken by the Company in its Federal and State tax returns were more likely than not to be sustained upon examination. The Company is subject to examination by U.S. Federal and State tax authorities from inception to present, generally for three years after they are filed. New management, which took control of the Company on June 21, 2021, is currently evaluating prior managements decision to not file federal tax returns and plans on filing past returns and related 1099 filings for compensation paid to prior management, employees, consultants, contractors and affiliates. The Company does not believe it has a material tax liability due to its operating losses in these periods but is preparing tax filings to bring itself current as it completes and moves forward on announced mergers and acquisitions.\nConcentration of Credit Risk\nCash is mainly maintained by one highly qualified institution in the United States. At various times, such amounts are more than federally insured limits. Management does not believe that the Company is subject to any unusual financial risk beyond the normal risk associated with commercial banking relationships. The Company has not experienced any losses on our deposits of cash.\nRisks and Uncertainties\nThe Company is subject to risks from, among other things, competition associated with the industry in general, other risks associated with financing, liquidity requirements, rapidly changing customer requirements, limited operating history and the volatility of public markets.\nCrude Oil and Natural Gas Properties\nThe Company follows the full cost accounting method to account for crude oil and natural gas properties, whereby costs incurred in the acquisition, exploration and development of crude oil and natural gas reserves are capitalized. Such costs include lease acquisition, geological and geophysical activities, rentals on non-producing leases, drilling, completing and equipping of crude oil and natural gas wells and administrative costs directly attributable to those activities and asset retirement costs. Disposition of crude oil and natural gas properties are accounted for as a reduction of capitalized costs, with no gain or loss recognized unless, such adjustment would significantly alter the relationship between capital costs and proved reserves of crude oil and natural gas, in which case the gain or loss is recognized to income.\nThe capitalized costs of crude oil and natural gas properties, excluding unevaluated and unproved properties, are amortized using the units-of-production method based on estimated proved recoverable crude oil and natural gas reserves. Amortization of unevaluated and unproved property costs begins when the properties become proved or their values become impaired. Impairment of unevaluated and unproved prospects is assessed periodically based on a variety of factors, including managements intention with regard to future exploration and development of individually significant properties and the ability of the Company to obtain funds to finance such exploration and development.\nUnder full cost accounting rules for each cost center, capitalized costs of evaluated crude oil and natural gas properties, including asset retirement costs, less accumulated amortization and related deferred income taxes, may not exceed an amount (the cost ceiling) equal to the sum of (a) the present value of future net cash flows from estimated production of proved crude oil and natural gas reserves, based on current economic and operating conditions, discounted at 10%, plus (b) the cost of properties not being amortized, plus (c) the lower of cost or estimated fair value of any unproved properties included in the costs being amortized, less (d) any income tax effects related to differences between the book and tax basis of the properties involved. If capitalized costs exceed this limit, the excess is charged to earnings.\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nGiven the volatility of crude oil and natural gas prices, it is reasonably possible that the estimate of discounted future net cash flows from proved crude oil and natural gas reserves could change in the near term. If crude oil and natural gas prices decline in the future, even if only for a short period of time, it is possible that additional impairments of crude oil and natural gas properties could occur. In addition, it is reasonably possible that additional impairments could occur if costs are incurred in excess of any increases in the present value of future net cash flows from proved crude oil and natural gas reserves, or if properties are sold for proceeds less than the discounted present value of the related proved crude oil and natural gas reserves.\nThe crude oil and gas properties were fully depleted prior to July 31, 2019.\nDuring the year ended July 31, 2023, the Company reached an agreement with its former CEO to sell the Companys interest in all of its crude oil and natural gas properties. The interest was sold on or around November 8, 2022.\nRevenue Recognition\nThe Company recognizes revenues in accordance with Accounting Standards Codification (ASC) 606 - Contracts with Customers. Revenue from sales of products is recognized when the related performance obligation is satisfied. The Companys performance obligation is satisfied upon the shipment or delivery of products to customers.\nStock-Based Compensation\nThe Company accounts for all stock-based compensation using a fair value-based method. The fair value of equity-classified awards granted to employees is estimated on the date of the grant using the Black-Scholes option-pricing model and the related stock-based compensation expense is recognized over the vesting period during which an employee is required to provide service in exchange for the award.\nIntangible Assets\nThe Companys intangible assets include the Kanab.Club website, which was developed for external use. The Company carries these intangibles at cost, less accumulated amortization. Amortization is recorded on a straight-line basis over the estimated useful lives, estimated to be 5 years. Costs that are incurred to produce the finished product after technological feasibility has been established are capitalized as an intangible asset. The company performs periodic reviews to ensure that unamortized program costs remain recoverable from future revenue.\nGoodwill and Other Acquired Intangible Assets\nThe Company initially records goodwill and other acquired intangible assets at their estimated fair values and reviews these assets periodically for impairment. Goodwill represents the excess of the purchase price over the fair value of identifiable tangible and intangible assets acquired and liabilities assumed in a business combination and is tested at least annually for impairment, historically during our fourth quarter.\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nDerivative Liabilities\nThe Company assessed the classification of its derivative financial instruments as of July 31, 2023 and 2022, which consist of convertible instruments and warrants in the Companys common stock and determined that such derivatives meet the criteria for liability classification under ASC 815.\nASC 815 generally provides three criteria that, if met, require companies to bifurcate conversion options from their host instruments and account for them as free-standing derivative financial instruments. These three criteria include circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument subject to the requirements of ASC 815. ASC 815 also provides an exception to this rule when the host instrument is deemed to be conventional, as described.\nThe Company uses judgment in determining the fair value of derivative liabilities at the date of issuance and at every balance sheet thereafter and in determining which valuation method is most appropriate for the instrument, the expected volatility, the implied risk-free interest rate, as well as the expected dividend rate, if any.\nRecently Issued Accounting Pronouncements\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40) - Accounting for Convertible Instruments and Contracts on an Entitys Own Equity. The ASU simplifies accounting for convertible instruments by removing major separation models required under current GAAP. Consequently, more convertible debt instruments will be reported as a single liability instrument with no separate accounting for embedded conversion features. The ASU removes certain settlement conditions that are required for equity contracts to qualify for the derivative scope exception, which will permit more equity contracts to qualify for the exceptions. The ASU also simplifies the diluted net income per share calculation in certain areas. The new guidance is effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years, and early adoption is permitted. The Company is currently evaluating the impact of the adoption of the standard on the consolidated financial statements.\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nNote 3 - GOING CONCERN\nThe accompanying financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America, which contemplate the continuation of the Company as a going concern. The Company reported an accumulated deficit of $8,637,251 as of July 31, 2023. The Company also had negative working capital of $1,161,282 on July 31, 2023 and had operating losses of $302,199 and $285,731 for the years ended July 31, 2023 and 2022, respectively. To date, these losses and deficiencies have been financed principally through the issuance of common stock, loans from related parties and loans from third parties.\nIn view of the matters described, there is substantial doubt as to the Companys ability to continue as a going concern without a significant infusion of capital. We anticipate that we will have to raise additional capital to fund operations over the next 12 months. To the extent that we are required to raise additional funds to acquire properties, and to cover costs of operations, we intend to do so through additional offerings of debt or equity securities. There are no commitments or arrangements for other offerings in place, no guaranties that any such financings would be forthcoming, or as to the terms of any such financings. Any future financing may involve substantial dilution to existing investors.\nNote 4 - ACQUISITION OF KANAB CORP.\nOn July 31, 2021, the Company acquired 100% interest in KANAB CORP., a cannabis information services company operating a website Kanab.Club (https://www.kanab.club/). KANAB CORP.s business plan includes completing its social site targeting health and wellness products and services in the cannabis market, generating revenues from advertising and subscriptions, incorporating social media site into the site, and marketing health and wellness products targeting consumers. KANAB CORP. is a development stage company that does not offer e-commerce services at this time, nor do we touch the cannabis plant and, given these matters, do not believe regulatory oversight or rules of law are a risk factor to the business. As consideration for the purchase, we issued 300,000 shares of Class B preferred stock. As KANAB CORP. was acquired from the Companys Chief Executive Officer and a company controlled by the Companys Chief Executive Office, the Company has accounted for the acquisition as an acquisition under common control, recorded at cost. The historical value of the development costs at acquisition for the website design was $11,500. Although KANAB CORP. has not generated any revenues, it has developed a website that is currently active and generating traffic. Subsequent to the acquisition, additional expenses were incurred in further enhancing the Kanab.Club website.\nThe following summarizes the acquired intangible assets:\nSCHEDULE OF ACQUIRED INTANGIBLE ASSETS\nJuly 31, July 31,\nIntangible assets $ 23,800 $ 17,800\nAccumulated amortization (9,149 ) (4,462 )\nIntangible assets- net $ 14,651 $ 13,338\nNote 5 - INVESTMENTS\nOn November 28, 2021 the Company executed a 19.9% stock purchase with GenBio, Inc. (GenBio) a provider of nutraceutical products and services based on proprietary biotechnology that fight inflammation and high blood pressure. The Company issued 99,686 series B Preferred shares of stock for 2,036,188 common shares of GenBio, Inc., representing 19.9% ownership. Based on a stock price at closing of .0019 and 99,685,794 common stock equivalents, this valued the investment at $189,749. On May 16, 2023, the Company unwound its investment in GenBio, and subsequently received back 99,686 series B Preferred shares of stock.\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nOn January 1, 2022, the Company executed a 19.9% stock purchase with The Agrarian Group LLC (TAG), a provider of digital intelligence AgtechDi software designed from its granted patents to optimize the food supply chain by increasing food safety and profitability for growers who operate vertical farms, greenhouses, converted shipping containers, and other forms of controlled environment agriculture. TAG is focusing its technology on the broad produce market, but in the future may offer it to cannabis cultivators. TAG is a software platform and will never touch the cannabis plant, eliminating regulatory risk, in our view. Under the Investment Agreement, the Company issued TAG 99,686 Series B Preferred shares in exchange for 1,242,000 Class A Membership units of TAG. Based on a stock price at closing of .0012 and 99,868,000 common stock equivalents, this values the investment at $119,841. On April 3, 2023, the Company unwound its investment in TAG, and received back 99,686 series B Preferred shares of stock.\nOn June 12, 2023, the Company purchased 210,000,000 common shares of Peer-to-Peer Network (OTC: PTOP) from FOMO WORLDWIDE, INC. (OTC: FOMC) by issuing FOMO WORLDWIDE, INC. 1,680,000 Series A Preferred shares. The fair value of the PTOP shares received was $63,000, and the as if converted value of our Series A Preferred shares was $100,800. A loss of $37,800 was thus recorded on acquisition. At July 31, 2023, the value of the investment in PTOP was $21,000.\nThe following summarizes the Companys investments:\nSCHEDULE OF COMPANYS INVESTMENTS\nJuly 31,\nGenBio, Inc. $ - $ 189,749\nThe Agrarian Group LLC - 119,841\nPeer to Peer Network 21,000 -\nInvestments $ 21,000 $ 309,590\nNote 6 - LOANS PAYABLE DUE TO RELATED PARTIES\nAs of July 31, 2023 and 2022, the Companys former chief executive officer had an outstanding balance of $0 and $96,400, respectively. The loan was non-interest bearing and due on demand. The loan was retired during the year ended July 31, 2023 through the sale of the Companys oil and gas interests to the note holder.\nOn June 28, 2021, the Company received a loan of $25,000 from FOMO WORLWIDE, INC. (FOMO), a related party. At July 31, 2023 and 2022, the loan balance was $58,174 and $38,222, respectively. The convertible note for FOMO WORLDWIDE, INC. converts at a price of 30% of the average of the two lowest trading prices for the twenty (20) days prior to and including the date of notice of conversion. The number of shares that the loan can be converted into depends on the trading price at the time of conversion. The convertible note was originally due on December 25, 2021. This maturity has been extended, most recently on October 10, 2022, to December 31, 2023 and FOMO waived all default provisions under section 8 (a) through (n). All other provisions of the loan remain in effect.\nOn May 10, 2023, the Company sold 100% of KANAB CORP. from Himalaya for partial forgiveness of $17,017 loaned to the business on June 28, 2021 and as amended on November 9, 2021 and September 1, 2022. The transaction was subsequently unwound on June 15, 2023 thereby returning 100% of KANAB CORP. to the Company. The loan reduction remained, and the Company issued 100,000 Series B Preferred stock for the return of Kanab Club.\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nNote 7 - CONVERTIBLE NOTE PAYABLES\nThe Company had convertible note payables with two third parties with stated interest rates ranging between 10% and 12% and 22% default interest not including penalties. These notes have a conversion feature such that the Company could not ensure it would have adequate authorized shares to meet all possible conversion demands; accordingly, the conversion option has been treated as a derivative liability in the accompanying financial statements. As of July 31, 2023, the Company had the following third-party convertible notes outstanding:\nSCHEDULE OF CONVERTIBLE NOTES OUTSTANDING\nLender Origination Maturity July 31, 2023 July 31, 2022 Interest\nGS Capital Partners LLC 6/29/21 6/29/22 $ 145,500 $ 151,500 24 %\n1800 Diagonal Lending LLC 8/15/22 8/15/23 16,700 - 8 %\n162,200 $ 151,500\nThe convertible note for GS Capital Partners LLC converts at a price of 60% of the lowest trading price for the twenty (20) days prior to and including the date of notice of conversion. The number of shares that the loan can be converted into depends on the trading price at the time of conversion. At July 31, 2023, the note theoretically would convert into 404,166,667 common shares.\nOn August 15, 2022, the Company entered into a convertible note agreement 1800 Diagonal Lending LLC for $39,250, due on August 15, 2023 and bearing interest at 8%. The convertible note is convertible at 61% multiplied by the lowest trading price for the common stock during the ten-trading day period ending on the latest complete trading day prior to the conversion date. At July 31, 2023, the note theoretically would convert into 34,221,311 common shares.\nIn connection with the convertible note with 1800 Diagonal Lending LLC, the note contained an original issue discount (OID) of $4,250. During the year ended July 31, 2023, $4,075 of this discount has been amortized as interest expense.\nDuring the year ended July 31, 2023, third-party lenders converted $64,609 of principal and interest into 39,676,711 shares of common stock.\nDuring the year ended July 31, 2022, third-party lenders converted $127,997 of principal and interest into 49,466,978 shares of common stock.\nThe variables used for the Black-Scholes model are as listed below:\nSCHEDULE OF FAIR VALUE ASSUMPTION OF BLACK-SCHOLES MODEL\nJuly 31,2023\nJuly 31, 2022\n● Volatility: 333%\nVolatility: 355%\n● Risk free rate of return: 5.40%\nRisk free rate of return: 2.98%\n● Expected term: 1 year\nExpected term: 1 year\nNote 8 - INCOME TAXES\nThe Company did not file its federal tax returns for fiscal years from 2012 through 2022. Management at year-end 2023 and 2022 believed that it should not have any material impact on the Companys financials because the Company did not have any tax liabilities due to net loss incurred during these years.\nBased on the available information and other factors, management believes it is more likely than not that any potential net deferred tax assets on July 31, 2023 and 2022 will not be fully realizable.\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nNote 9 - STOCKHOLDERS ‘EQUITY\nCommon Stock\nDuring the year ended July 31, 2023, third-party lenders converted $64,609 of principal and interest into 39,676,711 shares of common stock.\nDuring the year ended July 31, 2022, third-party lenders converted $127,997 of principal and interest into 49,466,978 shares of common stock.\nPreferred Stock\nThe preferred shares are in three classes:\n● Class A shares which, 130,000,000 authorized are convertible into 50 shares of common shares for each share, these shares have voting rights of 1 vote per share. At July 31, 2023 and 2022, there were 8,457,777 and 0 shares issued and outstanding which equates into 422,888,850 and 0 votes, respectively.\n● Class B shares, 20,000,000 authorized, which are convertible into 1,000 shares of common shares for each share, these shares have voting rights of 1,000 votes per share. At July 31, 2023 and 2022, there were 518,730 and 536,876 shares issued and outstanding which equates into 518,730,000 and 536,876,000 votes, respectively.\n● Class C shares, 1,000,000 authorized, which are convertible into 1 share of common shares for each share. These shares have voting rights of 100,000 votes per share. At July 31, 2023 and 2022 there were 1,000,000 shares outstanding which equates into 100,000,000,000 votes. These shares represent the controlling votes of the Company. These shares are all issued to the Company CEO. There are 99,000,000 shares of preferred shares authorized that have not been assigned a class at this time for future requirements.\nDuring the year ended July 31, 2023, the Company issued 4,777,777 shares of Class B Preferred and 81,590 shares of Class B Preferred to the Companys CEO for the conversion of accrued compensation of $160,000.\nDuring the year ended July 31, 2023, the Company issued 1,680,000 of Series A Preferred shares to acquire 210,000,000 common shares of Peer to Peer Network (OTC: PTOP) from FOMO WORLDWIDE, INC. (OTC: FOMC). The fair value of the PTOP shares received was $63,000, and the as if converted value of our Series A Preferred shares was $100,800. A loss of $37,800 was thus recorded on acquisition.\nDuring the year ended July 31, 2023, the Company agreed for the unwinding of its investment in TAG. As such, the Company returned its membership interests and TAG agreed to return 99,686 shares of Series B Preferred shares to the Company.\nDuring the year ended July 31, 2023, the Company unwound its investment in TAG, and received back 99,686 series B Preferred shares of stock.\nDuring the year ended July 31, 2023, issued 100,000 Series B Preferred stock to FOMO WORLDWIDE for partial forgiveness of monies loaned to the business.\nDuring the year ended July 31, 2022, the Company issued 22,000 shares of Class B Preferred for services. These shares were valued at the value of the as-if converted common shares on the date of issuance.\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nDuring the year ended July 31, 2022, the Company issued 15,504 shares of Class B Preferred to the Companys CEO for the conversion of accrued compensation of $80,000.\nOn November 28, 2021 the Company issued 99,686 series B preferred shares of its stock for 2,036,188 common shares of GenBio, Inc., representing 19.9% ownership. GenBio, Inc is a biotechnology company that researches natural products that act on new molecular pathways, primarily to suppress inflammation at critical points in these biochemical pathways. This investment was unwound in during the three months ended July 31, 2023.\nOn January 1, 2022, the Company issued 99,686 series B preferred shares of its stock for 1,242,000 Member Interests of The Agrarian Group, LLC (TAG) representing 19.9% ownership. This investment was unwound in during the three months ended July 31, 2023.\nWarrants\nOn June 22, 2021, the Company issued 50,000,000 warrants with a five-year expiration and $.0001 exercise price to FOMO CORP. as a deposit for the purchase of KANAB CORP. The warrants were canceled and reissued during the year ended July 31, 2023.\nOn June 29, 2021, the Company issued 15,000,000 warrants to GS Capital Group as part of the convertible debenture financing to fund operations. These warrants have a three-year expiration and a strike price of $0.01\nOn June 28, 2021, the Company issued 50,000,000 warrants with a five-year expiration and $.0001 exercise price to FOMO Advisors LLC for future advisory services.\nThe Company estimates the fair value of each award on the date of grant using a Black-Scholes option valuation model that uses the assumptions noted in the table below. Since Black-Scholes option valuation models incorporate ranges of assumptions for inputs, those ranges are disclosed. Expected volatilities are based on the historical volatility of the Companys stock. The Company uses historical data to estimate award exercise and employee termination within the valuation model, whereby separate groups of employees that have similar historical exercise behavior are considered separately for valuation purposes. The expected term of granted awards is derived from the output of the option valuation model and represents the period of time that granted awards are expected to be outstanding; the range given below results from certain groups of employees exhibiting different behavior. The risk-free rate for periods within the contractual life of the award is based on the U.S. Treasury yield curve in effect at the time of grant.\nThese FOMO Advisors LLC warrants were valued at $450,000 and are being recognized over the life of the agreement. At July 31, 2022, the Company had recognized $99,616 and $350,384 was unrecognized.\nDuring the quarter ended April 30, 2023, FOMO Advisors, LLC exercised 100,000,000 warrants to purchase two million (2,000,000) Series A Preferred shares of the Company which convert 1-50 into common stock and vote on an as converted basis. For the purchase, FOMO used $10,000 consideration of its credit line made available to us since June 2021.\nThe following are the assumptions utilized in valuing the warrants:\nSCHEDULE OF ASSUMPTIONS UTILIZED IN VALUING WARRANTS\nVolatility 465 %\nExpected life 5 years\nRisk free rate 3 %\nDividend yield 0 %\nHimalaya Technologies, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2023 AND 2022\nThe following table sets forth common share purchase warrants outstanding as of July 31, 2023 and 2022:\nSCHEDULE OF PURCHASE WARRANTS OUTSTANDING\nWeighted\nAverage\nIntrinsic\nWarrants Exercise Price Value\nOutstanding, July 31, 2021 65,000,000 0.0024 430,000\nWarrants granted - - -\nWarrants exercised - - -\nWarrants forfeited - - -\nOutstanding, July 31, 2022 65,000,000 0.0024 105,000\nWarrants granted - - -\nWarrants exercised (50,000,000 ) - -\nWarrants forfeited - - -\nOutstanding, July 31, 2023 15,000,000 $ 0.0024 $ -\nNote 10 - COMMITMENTS AND CONTINGENCIES\nOn August 1, 2021, the Board of Directors approved compensation to Vikram Grover CEO of $10,000 per month, broken down as $2,500 cash $7,500 stock if the Company is not SEC current, and $5,000 cash $5,000 stock when brought SEC current. Mr. Grover can elect to take the entire amount in Series B Preferred shares priced off the 20-day moving average closing bid price of HMLA common stock (1-1000 ratio) upon written notice at any time.\nDuring the years ended July 31, 2023 and 2022, the Company accrued $120,000 and $120,000 in compensation expense under this agreement, all of which has been converted into Series A Preferred stock and Series B Preferred stock.\nNote 11 - SALE OF OIL AND GAS INTERESTS\nOn November 8, 2022, the Company reached an agreement with its former CEO to sell the Companys interest in all of its crude oil and natural gas properties for $112,000, representing the amounts due to the Companys prior CEO under loans and accrued compensation. The Company recognized a gain of $112,000 on the sale.\nNote 12 - SUBSEQUENT EVENTS\nSubsequent to July 31, 2023, 1800 Diagonal Lending LLC converted debt of $4,500 into 9,183,673 shares of the Companys common stock.\nOn September 8, 2023, our CEO Vikram Grover converted $10,000 of accrued compensation into 333,333 Series A Preferred shares.\nOn September 26, 2023, our CEO Vikram Grover converted $5,000 of accrued compensation into 142,857 Series A Preferred shares.\nOn September 28, 2023, 1800 Diagonal Lending LLC converted debt of $3,600 into 9,729,730 shares of the Companys common stock.\nOn September 28, 2023, our CEO Vikram Grover converted $2,500 of accrued compensation into 62,500 Series A Preferred shares.\nOn October 2, 2023, our CEO Vikram Grover converted $2,500 of accrued compensation into 68,571 Seres A Preferred shares. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nDisclosure controls and procedures are designed with an objective of ensuring that information required to be disclosed in our periodic reports filed with the Securities and Exchange Commission, such as this Annual Report on Form 10-K, is recorded, processed, summarized, and reported within the time periods specified by the Securities and Exchange Commission. Disclosure controls are also designed with an objective of ensuring that such information is accumulated and communicated to our management, including our chief executive officer, to allow timely consideration regarding required disclosures.\nThe evaluation of our disclosure controls by our Chief Executive Officer (our principal executive, financial and accounting officer) included a review of the controls objectives and design, the operation of the controls, and the effect of the controls on the information presented in this Annual Report. Our management, including our chief executive officer, does not expect that disclosure controls can or will prevent or detect all errors and all fraud, if any. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Also, projections of any evaluation of the disclosure controls and procedures to future periods are subject to the risk that the disclosure controls and procedures may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nAs of the end of the period covered by this report, we carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer (our principal executive, financial and accounting officer), of the effectiveness of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934 as of the end of the period covered by this report. Based on that evaluation, our Principal Executive Officer and Principal Financial Officer have concluded that there were material weaknesses in our internal controls over Financial reporting as of July 31, 2023 and they were therefore not effective to ensure that information required to be disclosed by us in reports that we file or submit under the Securities Exchange Act of 1934 was recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms. The material weaknesses in our controls and procedure were a lack adequate staffing and supervision within the accounting operations of our Company. Management does not believe that any of these weaknesses materially affected the results and accuracy of its financial statements. However, in view of this discovery of such weaknesses, management has begun a review to improve them.\nMANAGEMENTS ANNUAL REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING.\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting for the company in accordance as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the (i) effectiveness and efficiency of operations, (ii) reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles, and (iii) compliance with applicable laws and regulations. Our internal controls framework is based on the criteria set forth in the Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagements assessment of the effectiveness of the small business issuers internal control over financial reporting is as of the year ended July 31, 2023. We believe that internal controls over financial reporting as set forth above shows some weaknesses and are not effective. We have identified certain weaknesses considering the nature and extent of our current operations and any risks or errors in financial reporting under current operations.\nUnder applicable rules of the Securities and Exchange Commission, as a smaller reporting company this Annual Report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Item 9B. Other Information.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe following table sets forth the names and ages of the directors and executive officers of the Company as of the date of this Annual Report and the principal offices and positions with the Company held by each person. There are no family relationships among any of the directors and executive officers.\nName\nAge\nPosition(s)\nVikram Grover\nChairman, CEO, President, CFO, Secretary\nVikram Grover has 29 years-experience on Wall Street as an equity research analyst, investment banker and consultant that has been advising, financing, and launching businesses for several years. He has worked at Thomas Weisel Partners Group, Inc. (now Stifel Nicolaus), Needham & Co., Source Capital Group, Inc. and Kaufman Bros., LLC in various capacities ranging from Director of Research, Senior Managing Director Investment Banking, and Managing Director Equity Research covering Telecommunications, Media, and Technology (TMT) companies. Prior to Himalaya Technologies, Inc. he was CEO of the first publicly traded eSports social site and tournament platform, Good Gaming. He is also the CEO of FOMO WORLDWIDE, INC. Mr. Grover has a Master of Science in Management (MSM) from the Georgia Institute of Technology (Georgia Tech), a BA in Marketing from the University of California San Diego (UCSD) and is a Chartered Financial Analyst (CFA).\nTerm of Office\nAll directors listed above will remain in office until the next annual meeting of our stockholders, and until their successors have been duly elected and qualified or until removed from office in accordance with our bylaws. There are no agreements with respect to the election of Directors. Other than stock options of various amounts, we have not compensated our directors for service on our Board of Directors, any committee thereof, or reimbursed for expenses incurred for attendance at meetings of our Board of Directors and/or any committee of our Board of directors. Executive Officers serve at the discretion of our Board of Directors. We do not have any standing committees. Our Board of Directors may in the future determine to pay directors fees and reimburse directors for expenses related to their activities.\nCode of Ethics\nAs of the date of this Report, the Company had not adopted a Code of Ethics applicable to our principal executive officer and principal financial officer. The Company intends to adopt one in the current fiscal year ending July 31, 2024. Item 11. Executive Compensation.\nOther than an employment agreement with our CEO Vikram Grover (below), we have not entered into employment agreements with our executive officers and their compensation, if any, is determined at the discretion of our Board of Directors.\nWe do not offer retirement benefit plans to our executive officers, nor have we entered any contract, agreement, plan, or arrangement, whether written or unwritten, that provides for payments to a named executive officer at, or in connection with, the resignation, retirement or other termination of a named executive officer, or a change in control of the company or a change in the named executive officers responsibilities following a change in control. We do not have any standard arrangement for compensation of our directors for any services provided as director, including services for committee participation or for special assignments.\nThe Company does not have a compensation committee. Given the nature of the Companys business, its limited stockholder base and the current composition of management, the board of directors does not believe that the Company requires a compensation committee at this time.\nThe following table summarizes all compensation recorded by us in 2021 and 2020 for our Chief Executive Officer, who is are only executive officer.\nSUMMARY COMPENSATION TABLE\nName and Principal Position Year Salary\n($) Bonus\n($) Stock\nAwards\n($) Option\nAwards\n($) Non-Equity\nIncentive Plan\nCompensation\n($) Nonqualified\nDeferred\nCompensation\n($) All Other\nCompensation\n($) Total\n($)\nVikram Grover, CEO 120,000 0 120,000\n120,000 0 120,000\nEmployment Agreement\nThe Company has an employment agreement with its Chief Executive Officer, Vikram Grover, effective August 1, 2021, compensating him $10,000 per month, including $5,000 in cash compensation if the Company is not current and $5,000 in cash compensation if current with its Exchange Act, with the balance due in restricted Series B Preferred shares. During 2023 and 2022, Mr. Grover converted $160,000 and $80,000 of his accrued compensation into Series A and B Preferred shares, respectively leaving amounts due to him on July 31, 2023 at $0.\nStock Option Plan\nWe do not have a stock option plan although we may adopt one or more such plans in the future.\nEmployee Pension, Profit Sharing, or other Retirement Plans\nWe do not have a defined benefit, pension plan, profit sharing or other retirement plan, although we may adopt one or more of such plans in the future. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth, as of the date of this Annual Report, certain information with respect to the Companys common stock owned of record or beneficially by (a) each director and executive officer of the Company; (b) each person who owns beneficially more than five percent (5%) of each class of the Companys outstanding common stock; and (c) all directors and executive officers as a group. The address of each of these individuals are c/o the Company, 831 W North Ave., Pittsburgh, PA 15233.\nClass A Preferred\nShares common shares\nbeneficially owned Percentage of\nbeneficially\nowned 2\nName and Address of Beneficial Owners 1\nVikram P. Grover 238,888,850 37.99 %\nFOMO Corp. 184,000,000 29.26 %\nAll beneficial holders as group (4 persons or entities) 422,888,850 67.26 %\n(1)\nRepresents shares of common stock issuable upon conversion of Series A Preferred Shares. Holders of Series A Preferred Shares vote on all matters presented to stockholders for a vote on an as converted basis together with our common stock as a single class, except as required by law.\n(2) Unless otherwise indicated, based on 205,791,975shares of common stock issued and outstanding as of the date of this Annual Report. Shares of common stock subject to options or warrants currently exercisable or exercisable within 60 days, are deemed outstanding for purposes of computing the percentage of the person holding such options or warrants but are not deemed outstanding for the purposes of computing the percentage of any other person.\nClass B Preferred\nShares common shares\nbeneficially owned Percentage of\nbeneficially\nowned 2\nName and Address of Beneficial Owners 1\nVikram P. Grover 234,594,000 33.98 %\nFOMO Corp. 250,000,000 36.21 %\nAll beneficial holders as group (4 persons or entities) 484,594,000 70.19 %\n(1)\nRepresents shares of common stock issuable upon conversion of Series B Preferred Shares. Holders of Series B Preferred Shares vote on all matters presented to stockholders for a vote on an as converted basis together with our common stock as a single class, except as required by law.\n(2) Unless otherwise indicated, based on 205,791,975 shares of common stock issued and outstanding as of the date of this Annual Report. Shares of common stock subject to options or warrants currently exercisable or exercisable within 60 days, are deemed outstanding for purposes of computing the percentage of the person holding such options or warrants but are not deemed outstanding for the purposes of computing the percentage of any other person. Item 13. Certain Relationships and Related Transactions and Director Independence.\nRelated Party Transactions\nNone.\nDirector Independence\nOur Common Stock is not quoted or listed on any national exchange or interdealer quotation system with a requirement that a majority of our board of directors be independent and therefore, the Company is not subject to any director independence requirements. Under NASDAQ Rule 5605(a)(2)(A), a director is not considered to be independent if he or she is also an executive officer or employee of the corporation. Under such definition our three officers and directors would not be considered an independent director. Item 14. Principal Accountant Fees and Services.\nVictor Mokuolu, CPA PLLC is our independent registered public accounting firm for the years ended July 31, 2023 and 2022.\nYear ended July 31,\nAudit Fees $ 12,500 $ 6,500\nAudit-Related Fees $ -0- $ -0-\nTax Fees $ -0- $ -0-\nAll Other Fees $ -0- $ -0-\nPre-Approval Policy\nOur Board preapproved all services provided by our independent registered public accounting firm. For any non-audit or non-audit related services, the Board must conclude that such services are compatible with their independence as our independent registered public accounting firm.\nPART IV Item 15. Financial Statements and Exhibits.\n(a) The following documents are filed as part of this Report:\n(1) Financial Statements. The following consolidated financial statements and the report of our independent registered public accounting firm are filed as Item 8. Financial Statements and Supplementary Data of this Report:\nReports of Independent Registered Public Accounting Firms (PCAOB ID: 6771)\nConsolidated Balance Sheets as of July 31, 2023 and 2022\nConsolidated Statements of Operations for the years ended July 31, 2023 and 2022\nConsolidated Statements of Stockholders Deficiency for the years ended July 31, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended July 31, 2023 and 2022\nNotes to Consolidated Financial Statements July 31, 2023 and 2022\n(2) Financial Statement Schedules\nNone.\n(3) Exhibits\nExhibit No.\nDescription\n2.1**\nArticles of Incorporation.\n2.2**\nAmendment to Articles of Incorporation\n2.3**\nAmendment to Articles of Incorporation\n2.4**\nBy-laws\n2.5*\nCertificate of Designation Preferred A Convertible Stock\n2.6*\nCertificate of Designation Preferred B Convertible Stock\n2.7*\nCertificate of Designation Preferred C Convertible Stock\n6.1***\nHimalaya Technologies Sprecher Beverage Brewing Company Co-pack Agreement\n6.2****\nBrokerwebs Statement of Work - Stock Chat Room for Kanab Club\n6.3*****\nGS Capital Partners Loan Document June 29, 2021\n6.4******\nAsset Purchase Contract and Receipt dated October 22, 2022 (redacted)\n31.1***\nCertification of Principal Executive Officer and Principal Financial Officer pursuant to Rule 13a-14 and Rule 15d 14(a), promulgated under the Securities and Exchange Act of 1934, as Amended.\n32.1***\nCertification of Principal Executive Officer and Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Link base Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Link base Document\n101.LAB\nInline XBRL Taxonomy Extension Label Link base Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Link base Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n*Incorporated by Reference to the exhibits to the Registrants Form 10-12G, filed January 18, 2022 File Number 000-55282\n** Incorporated by Reference to the exhibits to the Registrants Form 10-12G, filed January 18, 2022 File Number 000-55282. Incorporated by reference to the exhibits to the registrants registration statement on Form SB-1 filed November 19, 2007, file number 333-147501. Incorporated by reference to the exhibits to the registrants registration statement on Form SB-1 filed November 19, 2007, file number 333-147501.\n*** Incorporated by Reference to the exhibit to the Registrants Form 8-K/A filed June 1, 2022.\n**** Incorporated by Reference to the exhibit to the Registrants Form 8-K filed August 22, 2022\n*****Incorporated by Reference to exhibit 10.1 to the Registrants Form 8-K filed July 6, 2021.\n****** Incorporated by Reference to exhibit 10.1 to the Registrants Form 8-K/A filed November 2, 2022.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on the 27th day of October 2023.\nHIMALAYA TECHNOLOGIES, INC.\nBy: /s/ Vikram Grover\nVikram Grover, Chief Executive Officer and sole Director\n(Principal Executive, Financial and Accounting Officer)"
}