{
    "cik": "1410738",
    "company": "Voip-pal.com Inc",
    "filing_type": "10-K",
    "filing_date": "2023-12-22",
    "period_of_report": "2023-09-30",
    "sic": "3661",
    "state_of_inc": "NV",
    "state_location": "TX",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1410738/0001493152-23-045839-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1410738/000149315223045839/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1410738/0001493152-23-045839.txt",
    "filename": "1410738_10K_2023_0001493152-23-045839.htm",
    "content": "Item 1. Business.\nThe Company was incorporated in the state of Nevada in September 1997 as All American Casting International, Inc. and changed its name to VOIP MDU.com in 2004 and subsequently to VoIP-Pal.Com Inc. in 2006. Since March 2004, the Company has been in the development stage of becoming a Voice-over-Internet Protocol (VoIP) re-seller, a provider of a proprietary transactional billing platform tailored to the points and air mile business, and a provider of anti-virus applications for smartphones.\nIn 2013, Voip-Pal acquired Digifonica International (DIL) Limited (Digifonica), to fund and co-develop Digifonicas patent suite. Digifonica had been founded in 2003 with the vision that the internet would be the future of all forms of telecommunications - a team of twenty top engineers with expertise in Linux and Internet telephony developed and wrote a software suite with applications that provided solutions for several core areas of internet connectivity. In order to properly test the applications, Digifonica built and operated three production nodes in Vancouver, Canada (Peer 1), London, UK (Teliasonera), and Denmark. Upon successfully developing the technology, Digifonica filed for patents with the United States Patent and Trademark Office (USPTO).\nThe Digifonica patents formed the basis for Voip-Pals current intellectual property, now a worldwide portfolio of issued and pending patents primarily designed for the broadband VoIP market.\nThe Issuers primary and secondary SIC Codes are 4813 and 4899.\nThe Issuers fiscal year end date is September 30.\nPrincipal Products or Services\nVoIP-PAL owns a worldwide portfolio of issued patents covering numerous inventions, including, but not limited to the following technology areas:\n1. classification and routing of communications over different networks and over geographically distributed nodes;\n2. lawful intercept of such communications;\n3. enhanced emergency calling support (e.g., E911);\n4. mobile gateways;\n5. uninterrupted transmission during endpoint changes; and\n6. metering and billing, including the reselling of white label telecommunication services.\nVoIP-PAL continues to have some patent applications pending.\nVoIP-PAL is currently pursuing patent infringement lawsuits against several Fortune 500 companies that the Company believes are practicing its patented inventions. The status of the litigation is described elsewhere in this report.\nVoIP-Pals Patent Portfolio\nA brief summary of the Companys patents is provided below, focusing primarily on patents which have been issued in the U.S. (however only limited discussion is provided regarding the Companys related pending U.S. patent applications and foreign patent assets). The brief summaries below are provided for convenience only and without prejudice to the Companys rights; it will be appreciated that the scope of the Companys patents can only be discerned by conducting a full legal analysis under the applicable legal standards and is subject to Court decisions.\nVoIP-PALs patent portfolio covers the following technologies:\n1. Classification/routing of communications\n● U.S. Patent Nos. 8,542,815; 9,179,005; 9,537,762; 9,813,330; 9,826,002; 9,935,872; 9,948,549; European Patent No. 2,084,868; Indian Patent No. 287,412, Brazil Patent No. PI 0718312-7, and Canadian Patents 2,668,025; 3,032,707; 3,045,672; 3,045,681; 3,045,683; 3,045,694, among others, generally relate to classification/routing of communications.\n● The ‘815 Patent was the subject of four Inter Partes Review (IPR) challenges before the U.S. Patent Office by Apple, Unified Patents, and AT&T Services, one of which was instituted and resulted in a final written decision confirming the patentability of all challenged claims. The ‘005 Patent was the subject of four IPR challenges by Apple and AT&T Services, one of which was instituted and resulted in a final written decision confirming the patentability of all challenged claims. The ‘762, ‘330, ‘002 and ‘549 Patents were each subject to IPR challenges by Apple, but none of these IPRs was instituted. However, some of the claims of each of these patents been found patent-ineligible in court proceedings under §101.\n● Brief descriptions of these patents are provided below.\n1.1 U.S. Patent No. 8,542,815, issued September 24, 2013, generally relates to, among other things, classifying a call as pertaining to a public network or a private network based on a match of one or more attributes associated with a caller and an identifier associated with a callee and network classification criteria.\n1.2 U.S. Patent No. 9,179,005, issued November 3, 2015, generally relates to, among other things, routing communications by producing a public or private routing message based on a classification criteria of one or more attributes associated with a caller and an identifier associated with a callee.\n1.3 U.S. Patent No. 9,537,762, issued January 3, 2017, generally relates to, among other things, classifying a communication as pertaining to a first or second network based on attributes associated with a first participant to the communication and classification criteria which may include whether a second participant to the communication is registered with the system.\n1.4 U.S. Patent No. 9,813,330, issued November 7, 2017, generally relates to, among other things, classifying a communication as a system communication or external network communication based at least in part on comparing attributes associated with a first participant in a communication with an identifier associated with a second participant.\n1.5 U.S. Patent No. 9,826,002, issued November 21, 2017, generally relates to, among other things, classifying a communication as a system communication or external network communication based at least in part on a new second participant identifier produced by processing a second participant identifier based on a first participants attributes.\n1.6 U.S. Patent No. 9,948,549, issued on April 17, 2018, generally relates to, among other things, classifying a communication as a system communication or external network communication and producing a routing message based at least in part on a new second participant identifier produced by processing a second participant identifier based on a first participants attributes.\n1.7 U.S. Patent No. 9,935,872, issued April 3, 2018, generally relates to, among other things, using at least one first participant attribute to determine whether a communication initiated from a first participant device to a second participant device is allowed to proceed, and if it is allowed to proceed, whether it should be routed to its destination via a first network element or a second network element.\n1.8 U.S. Patent No. 10,218,606, issued February 26, 2019, relates to, among other things, processing at least one first participant attribute and a second participant identifier to determine whether a communication initiated from a first participant device to a second participant device in a packet switched or Internet Protocol (IP) based communication system can be routed using either a local cluster/node or a remote cluster/node.\n1.9 European Patent No. 2,084,868, granted May 30, 2018, relates to, among other things, the classification/routing of communications and is similar to the counterpart U.S. patents directed to this subject matter (see descriptions of U.S. patents above).\n1.10 Indian Patent No. 287,412, granted September 15, 2017, relates to, among other things, the classification/routing of communications and is similar to the counterpart U.S. patents directed to this subject matter (see descriptions of U.S. patents above).\n1.11 Indonesian Patent No. IDP000040412 similarly relates to classification/routing (see above patent descriptions).\n1.12 Brazil Patent No. PI 0718312-7, granted May 19, 2020, similarly relates to classification/routing (see above).\n1.13 Canadian Patent No. 2,668,025, issued February 25, 2020, relates to classification/routing, similarly to the counterpart U.S. patents described above.\n1.14 Canadian Patent No. 3,045,672, issued January 19, 2021, relates to classification/routing, similarly to the counterpart U.S. patents described above.\n1.15 Canadian Patent No. 3,032,707, issued February 9, 2021, relates to classification/routing, similarly to the counterpart U.S. patents described above.\n1.16 Canadian Patent No. 3,045,694, issued September 7, 2021, relates to classification/routing, similarly to the counterpart U.S. patents described above.\n1.17 Canadian Patent No. 3,045,681, issued October 12, 2021, relates to classification/routing, similarly to the counterpart U.S. patents described above.\n1.18 Canadian Patent No. 3,045,683, issued October 26, 2021, relates to classification/routing, similarly to the counterpart U.S. patents described above.\n2. Lawful intercept\n● U.S. Patent Nos. 8,422,507; 9,143,608; 9,549,071; and 10,038,779, Canadian Patent No. 2,670,510 and European Patent No. 2,090,024 generally relate to, for example, lawfully intercepting Voice Over IP (VoIP) and other data communications (e.g., when required by law enforcement agencies).\n● None of these patents are currently asserted in litigation.\n2.1 U.S. Patent No. 8,422,507, issued April 16, 2013, applies, for example, to lawful intercept scenarios in which communications originating in an Internet Protocol (IP) network system from a subscriber to another party occur through a media relay, where information associated with the subscriber profile meets intercept criteria, such that a routing message is produced to cause the media relay to send a copy of the communications to a mediation device.\n2.2 U.S. Patent No. 9,143,608, issued September 22, 2015, applies, for example, to lawful intercept scenarios in which communications originating in an Internet Protocol (IP) network system from a subscriber to another party occur through a media relay, and where a profile associated with the subscriber includes intercept determination information and destination information indicating where to send monitored communications. For example, when intercept criteria are met, at least some of the intercept determination information and the destination information are included in a routing message.\n2.3 U.S. Patent No. 9,549,071, issued January 17, 2017, generally relates to, among other things, lawfully intercepting Internet Protocol (IP) communications between a first party and a second party, where a profile associated with the first or second party includes intercept determination information and destination information for one of the first or second party that is to be monitored, the destination information indicating where to send the monitored communications. For example, when an intercept criterion is met, at least some of the intercept determination information and the destination information is included in a routing message.\n2.4 U.S. Patent No. 10,038,779, issued July 31, 2018, generally relates to lawfully intercepting VoIP or other data communications between a first party and a second party, based on an intercept request message that contains (a) an identification of at least one party whose communications are to be monitored, (b) intercept determination information, and (c) destination information indicating where copies of intercepted communications are to be sent. For example, when an intercept criterion is met, at least some intercept determination information and destination information is included in a routing message.\n2.5 Canadian Patent No. 2,670,510, granted December 22, 2020, also relates to lawful intercept of communication.\n2.6 European Patent No. 2,090,024, granted March 4, 2020, similarly relates to lawful intercept of communications.\n3. Mobile gateway\n● U.S. Patent No. 8,630,234, U.S. Patent No. 10,880,721, European Patent 2,311,292, and Canadian Patent No. 2,732,148 generally relate to, among other things, methods for channeling communications into distributed VoIP gateways (e.g., allowing roaming mobile devices to establish communications using optimal infrastructure based on a location associated with the mobile devices).\n● The litigation status of these patents is described elsewhere in this report.\n3.1 U.S. Patent No. 8,630,234, issued January 14, 2014, generally relates to, among other things, a method of roaming with a mobile phone. For example, the mobile phone could receive an access code reply message from the access server that includes a temporary access code allowing the mobile phone to initiate a call to the callee using the access code, allowing the mobile phone to avoid incurring long-distance roaming charges. The access code may be a phone number or an IP address.\n3.2. U.S. Patent No. 10,880,721, issued December 29, 2020, relates among other things, to apparatuses, servers and methods for providing an access code (e.g., IP address) to roaming mobile communication devices such as smartphones, to enable access to suitable communication routing infrastructure, wherein the selection of the communication channel for a call can be optimized based on the calling devices location.\n3.3 Canadian Patent No. 2,732,148, issued April 25, 2018, is directed to, among other things, subject-matter similar to the counterpart U.S. patents (see description above).\n3.4 European Patent No. 2,311,292, issued December 16, 2020, is directed to subject-matter similar to the counterpart U.S. patents above.\n4. Emergency assistance calling\n● U.S. Pat. Nos. 8,537,805 and 9,565,307 and Canadian Patent No. 2,681,984 generally relate to emergency assistance calling and are applicable, for example, to certain E911 scenarios.\n● None of these patents are currently asserted in litigation.\n4.1 U.S. Patent No. 8,537,805, issued September 17, 2013, relates to, among other things, handling emergency calls from a caller in a voice over IP (VoIP) system. The ‘805 Patent could apply, for example, when a routing request message is received and the contents of an emergency call identifier field of a profile match the callee identifier. In this example, if the caller identifier is not associated with a pre-associated identifier, a temporary identifier is associated with the caller. When the emergency call flag is active, for example, a routing message establishes a route between the caller and an emergency response center, the routing message including an emergency response center identifier from a profile associated with the caller and the DID identifier associated with the caller.\n4.2 U.S. Patent No. 9,565,307, issued February 7, 2017, relates to, among other things, routing emergency communications. The ‘307 Patent could apply, for example, when a routing request includes the caller identifier and the callee identifier, and where the caller identifier identifies a profile associated with the caller that includes an emergency call identifier (e.g., 911) and an emergency response center identifier. In this example, when the callee identifier matches the emergency call identifier, a routing message establishes the call, the routing message having a first portion including the emergency response center identifier and a second portion, which portion may include either a temporary or pre-assigned identifier associated with the caller, for example.\n4.3 Canadian Patent No. 2,681,984, issued April 2, 2019 also relates to routing emergency communications.\n4.4 U.S. Patent No. 11,172,064 relates to similar subject matter. An Issue Notification has been received from the U.S. Patent Office indicating that U.S. Patent No. 11,172,064 will issue on November 9, 2021.\n5. Allocating charges\n● U.S. Patent Nos. 8,774,378 and 9,998,363 both generally relate to allocating charges for communication services.\n● None of these patents are currently asserted in litigation.\n5.1 U.S. Patent No. 8,774,378, issued July 8, 2014, could apply, for example, to scenarios where a communication system operator and a reseller of communication services allocate charges incurred by a user. In this example, the process for attributing charges may involve determining a user cost based on a chargeable time and free time associated with the user, where the chargeable time is based on communication session time and a pre-defined billing pattern-then account balances for the user, reseller and system operator are updated accordingly.\n5.2 U.S. Patent No. 9,998,363, issued June 12, 2018, relates to, among other things, attributing charges for communications services provided in a communications system for a communication session between a users device and a destination device.\n5.3 Canadian Patent No. 2,916,220, granted November 26, 2019, also relates to allocating charges.\n6. Determining a time for permitting a communication session\n● None of these patents are currently asserted in litigation.\n6.1 U.S. Patent No. 9,137,385, issued September 15, 2015, generally relates to, among other things, determining a time for permitting a communication session to be conducted (e.g., a time-to-live or TTL).\n6.2 Canadian Patent No. 2,916,217, issued April 16, 2019, also relates to determining a time for permitting a communication session to be conducted (e.g., a time-to-live or TTL).\n6.3. U.S. Patent No. 11,171,864 relates to similar subject matter. An Issue Notification has been received from the U.S. Patent Office indicating that U.S. Patent No. 11,171,864 will issue on November 9, 2021.\n7. Uninterrupted transmission during endpoint changes\n● U.S. Patent Nos. 8,675,566; 9,154,417; 10,021,729; European Patent No. 2478678; and Canadian Patent No. 2,812,174 all generally relate to, among other things, uninterrupted transmission during endpoint changes (e.g., station handoffs).\n● None of these patents are currently asserted in litigation.\n7.1 U.S. Patent No. 8,675,566, issued March 18, 2014, generally relates to, among other things, uninterrupted transmission of internet protocol (IP) transmissions during endpoint changes.\n7.2 U.S. Patent No. 9,154,417, issued October 6, 2015, generally relates to, among other things, uninterrupted transmission, where in response to an IP transmission at a media relay, a session information record is processed in a certain manner.\n7.3 U.S. Patent No. 10,021,729, issued July 10, 2018, generally relates to, among other things, facilitating an uninterrupted internet protocol (IP) communication session, involving internet protocol transmissions between a first entity and a second entity, during endpoint changes.\n7.4 European Patent No. 2,478,678 and Canadian Patent No. 2,812,174 relate to subject matter similar to the aforesaid U.S. patents (see above descriptions).\nNOTE BENE: While the above generalized descriptions of the Companys patents have been provided for convenience, they are provided merely as a rough guide and are not intended to fully characterize the scope of the Companys legal rights. Reviewers are therefore advised to conduct their own legal analysis of the Companys patents and not merely to rely on the above cursory descriptions.\nAmount Spent on Research and Development\nFor the two years ended September 30, 2023 and 2022, the Company has incurred no research and development expenses.\nEmployees\nWe have two full time employees. The Company utilizes various consultants and contractors for other services.\nEmerging Growth Company Status\nWe are an emerging growth company as that term is used in the Jumpstart Our Business Startups Act of 2012 (the JOBS Act) and, as such, have elected to comply with certain reduced public company reporting requirements for future filings.\nIn April 2012, the Jumpstart Our Business Startups Act (JOBS Act) was enacted into law. The JOBS Act provides, among other things:\n- Exemptions for emerging growth companies from certain financial disclosure and governance requirements for up to five years and provides a new form of financing to small companies;\n- Amendments to certain provisions of the federal securities laws to simplify the sale of securities and increase the threshold number of record holders required to trigger the reporting requirements of the Securities Exchange Act of 1934, as amended;\n- Relaxation of the general solicitation and general advertising prohibition for Rule 506 offerings;\n- Adoption of a new exemption for public offerings of securities in amounts not exceeding $50 million; and\n- Exemption from registration by a non-reporting company of offers and sales of securities of up to $1,000,000 that comply with rules to be adopted by the SEC pursuant to Section 4(6) of the Securities Act and exemption of such sales from state law registration, documentation or offering requirements.\nIn general, under the JOBS Act a company is an emerging growth company if its initial public offering (IPO) of common equity securities was effected after December 8, 2011 and the company had less than $1 billion of total annual gross revenues during its last completed fiscal year. We will retain emerging growth company status until the earliest of:\n(i) the completion of the fiscal year in which the company has total annual gross revenues of $1 billion or more,\n(ii) the completion of the fiscal year of the fifth anniversary of the companys IPO;\n(iii) the companys issuance of more than $1 billion in nonconvertible debt in the prior three-year period, or\n(iv) the company becoming a larger accelerated filer as defined under the Securities Exchange Act of 1934, as amended.\nThe JOBS Act provides additional new guidelines and exemptions for non-reporting companies and for non-public offerings. Those exemptions that impact the Company are discussed below.\nFinancial Disclosure. The financial disclosure in a registration statement filed by an emerging growth company pursuant to the Securities Act of 1933, as amended, will differ from registration statements filed by other companies as follows:\n(i) audited financial statements required for only two fiscal years (provided that smaller reporting companies such as the Company are only required to provide two years of financial statements);\n(ii) selected financial data required for only the fiscal years that were audited (provided that smaller reporting companies such as the Company are not required to provide selected financial data as required by Item 301 of Regulation S-K); and\n(iii) executive compensation only needs to be presented in the limited format now required for smaller reporting companies\nHowever, the requirements for financial disclosure provided by Regulation S-K promulgated by the Rules and Regulations of the SEC already provide certain of these exemptions for smaller reporting companies. The Company is a smaller reporting company. Currently a smaller reporting company is not required to file as part of its registration statement selected financial data and only needs to include audited financial statements for its two most current fiscal years with no required tabular disclosure of contractual obligations.\nThe JOBS Act also exempts the Companys independent registered public accounting firm from having to comply with any rules adopted by the Public Company Accounting Oversight Board (PCAOB) after the date of the JOBS Acts enactment, except as otherwise required by SEC rule.\nThe JOBS Act further exempts an emerging growth company from any requirement adopted by the PCAOB for mandatory rotation of the Companys accounting firm or for a supplemental auditor report about the audit.\nInternal Control Attestation. The JOBS Act also provides an exemption from the requirement of the Companys independent registered public accounting firm to file a report on the Companys internal control over financial reporting, although management of the Company is still required to file its report on the adequacy of the Companys internal control over financial reporting. Section 102(a) of the JOBS Act exempts emerging growth companies from the requirements in §14A(e) of the Securities Exchange Act of 1934 for companies with a class of securities registered under the Securities Exchange Act of 1934, as amended, to hold shareholder votes for executive compensation and golden parachutes.\nOther Items of the JOBS Act. The JOBS Act also provides that an emerging growth company can communicate with potential investors that are qualified institutional buyers or institutions that are accredited to determine interest in a contemplated offering either prior to or after the date of filing the respective registration statement. The JOBS Act also permits research reports by a broker or dealer about an emerging growth company regardless of whether such report provides sufficient information for an investment decision. In addition, the JOBS Act precludes the SEC and FINRA from adopting certain restrictive rules or regulations regarding brokers, dealers and potential investors, communications with management and distribution of research reports on the emerging growth companys IPOs.\nSection 106 of the JOBS Act permits emerging growth companies to submit registration statements under the Securities Act of 1933, as amended, on a confidential basis provided that the registration statement and all amendments thereto are publicly filed at least 21 days before the issuer conducts any road show. This is intended to allow emerging growth companies to explore the IPO option without disclosing to the market the fact that it is seeking to go public or disclosing the information contained in its registration statement until the company is ready to conduct a roadshow.\nElection to Opt Out of Transition Period. Section 102(b)(1) of the JOBS Act exempts emerging growth companies from being required to comply with new or revised financial accounting standards until private companies (that is, those that have not had a Securities Act of 1933, as amended, registration statement declared effective or do not have a class of securities registered under the Securities Exchange Act of 1934, as amended) are required to comply with the new or revised financial accounting standard.\nThe JOBS Act provides that a company can elect to opt out of the extended transition period and comply with the requirements that apply to non-emerging growth companies but any such election to opt out is irrevocable. The Company has elected not to opt out of the transition period. This may make comparison of the Companys financial statements with any other public company which is not either an emerging growth company nor an emerging growth company which has opted out of using the extended transition period difficult or impossible as possible different or revised standards may be used.\nFor so long as we remain an emerging growth company as defined in the JOBS Act, we may take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies as described above. We cannot predict if investors will find our common stock less attractive because we will rely on some or all of these exemptions. If some investors find our common stock less attractive as a result, there may be a less active trading market for our common stock and our stock price may be more volatile. If we avail ourselves of certain exemptions from various reporting requirements, as is currently our plan, our reduced disclosure may make it more difficult for investors and securities analysts to evaluate us and may result in less investor confidence. Item 1A. Risk Factors.\nThe company qualifies as a smaller reporting company and is not required to provide the information required by this Item.  Item 2. Properties.\nThe Company does not own any properties or facilities. The Company leases office space for operations and administrative purposes. Item 3. Legal Proceedings.\nThe Company is party to the following legal proceedings:\nPatent Litigation\nThe Company is party to patent and patent-related litigation cases as follows:\ni) VoIP-Pal.com Inc. v. Facebook, Inc. et al. Case No. 6-20-cv-00267 in the U.S. District Court, Western District of Texas\nIn April 2020, the Company filed a lawsuit in the United States District Court, Western District of Texas, against Facebook, Inc. and certain related entities, alleging infringement of U.S. Patent No. 10,218,606. On July 22, 2022, the Western District of Texas granted Facebooks motion to transfer the case to the Northern District of California. The case number is Case No. 3:22-cv-4279-JD. On June 6, 2023, the parties stipulated to the dismissal of the case. On June 7, 2023, the court dismissed the case.\nii) VoIP-Pal.com Inc. v. Google, LLC fka Google, Inc. Case No. 6-20-cv-00269 in U.S. District Court, Western District of Texas\nIn April 2020, the Company filed a lawsuit in the United States District Court, Western District of Texas, against Google, alleging infringement of U.S. Patent No. 10,218,606. On September 21, 2022, the Western District of Texas granted Googles motion to transfer the case to the Northern District of California. The case number is Case No. 3:22-cv-5419-JD. On June 6, 2023, the parties stipulated to the dismissal of the case. On June 7, 2023, the court dismissed the case.\niii) VoIP-Pal.com Inc. v. Amazon.com, Inc. et al. Case No. 6-20-cv-00272 in the U.S. District Court, Western District of Texas\nIn April 2020, the Company filed a lawsuit in the United States District Court, Western District of Texas, against Amazon.com, Inc. and certain related entities, alleging infringement of U.S. Patent No. 10,218,606. The case is pending.\niv) VoIP-Pal.com, Inc. v. Facebook, Inc. et al Case No. 6-21-cv-665 in the United States District Court, Western District of Texas\nOn September 25, 2021, the Company filed a lawsuit in the US District Court, Western District of Texas, against Facebook, Inc. and WhatsApp, Inc. alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. On May 31, 2022, the Western District of Texas court granted Facebook and WhatsApps motion to transfer the case to the Northern District of California. The case number is Case No. 3:22-cv-3202-JD. On June 6, 2023, the parties stipulated to the dismissal of the case. On June 7, 2023, the court dismissed the case.\nv) VoIP-Pal.com, Inc. v. Google, LLC Case No. 6-21-cv-667 in the United States District Court, Western District of Texas\nOn September 25, 2021, the Company filed a lawsuit in the US District Court, Western District of Texas, against Google LLC alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. On May 31, 2022, the Western District of Texas granted Googles motion to transfer the case to the Northern District of California. The case number is Case No. 3:22-cv-3199-JD. On June 6, 2023, the parties stipulated to the dismissal of the case. On June 7, 2023, the court dismissed the case.\nvi) VoIP-Pal.com, Inc. v. Amazon.com, Inc. et al. Case No. 6-21-cv-668 in the U.S. District Court, Western District of Texas\nOn September 25, 2021, the Company filed a lawsuit in the U.S. District Court, Western District of Texas, against Amazon and related entities alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. On June 26, 2023, the parties stipulated to the dismissal of the case. On June 29, 2023, the court closed the case.\nvii) VoIP-Pal.com, Inc. v. Verizon Comms., Inc. Case No. 6-21-cv-672 in the U.S. District Court, Western District of Texas\nOn September 25, 2021, the Company filed a lawsuit in the U.S. District Court, Western District of Texas, against Verizon and related entities alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. The case is pending.\nviii) VoIP-Pal.com, Inc. v. T-Mobile US, Inc. et al. Case No. 6-21-cv-668 in the U.S. District Court, Western District of Texas\nOn September 25, 2021, the Company filed a lawsuit in the U.S. District Court, Western District of Texas, against T-Mobile and related entities alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. The case is pending.\nix) VoIP-Pal.com Inc v Samsung Electronics Co. et al Case No. 6-21-cv-1246 in U.S. District Court, Western District of Texas\nOn November 30, 2021, the Company filed a lawsuit in the U.S. District Court, Western District of Texas, against Samsung & related entities alleging infringement of U.S. Patent Nos. 8,630,234 & 10,880,721. On June 21, 2023, the parties stipulated to the dismissal of the case and the court closed the case.\nx) VoIP-Pal.com Inc v Huawei Technologies Co, Ltd. et al Case No. 6-21-cv-1247 in US District Court, Western District of Texas\nOn November 30, 2021, the Company filed a lawsuit in the U.S. District Court, Western District of Texas, against Huawei and related entities alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. On January 18, 2023, the Western District of Texas granted Huaweis motion to transfer the case to the Northern District of Texas. The case no. is 3:23-cv-00151. The case is pending.\nxi) Twitter, Inc. v. VoIP-Pal.com Inc. Case No. 3:21-cv-9773 in the U.S. District Court, Northern District of California\nOn December 17, 2021, Twitter filed a declaratory judgment lawsuit against the Company in the United States District Court, Northern District of California, alleging non-infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. On June 6, 2023, the parties stipulated to the dismissal of the case. On June 7, 2023, the court dismissed the case.\nNon-Patent Litigation\nThe Company is party to non-patent litigation cases as follows:\nLocksmith Financial Corporation, Inc. et al. (Plaintiff(s)) v VoIP-Pal.com Inc. et al (Defendant(s)) (Case No A-20-807745-C) filed in Clark County District Court.\nOn January 1, 2020, the Plaintiffs filed suit in Nevada District Court claiming that they were owed 95,832,000 Voip-Pal common shares from a previous case involving the Plaintiff and the Defendant that had been through a jury trial in 2019, in which the jury had made an award to the Plaintiff that was monetary only, and did not include said shares - following the jurys decision in the 2019 trial, the Plaintiff accepted the award and waived their right to appeal. Voip-Pal vigorously disputed the Plaintiffs 2020 claims on the basis of claim preclusion (the 2020 claims were addressed in the previous action in 2019 and are now precluded); that Plaintiffs claims are untimely, and that the Plaintiffs no longer have standing to bring their claims.\nDuring the year ended September 30, 2022, the Court entered a judgment in favor of VoIP-Pal.com Inc and co-defendants, dismissing the 2020 case. The Plaintiffs filed an appeal with the Nevada Supreme Court.\nDuring the year ended September 30, 2023, following a hearing of the appeal, the Nevada Supreme Court ruled to reverse the lower courts judgment and remanded the case back to the lower court for further proceedings. The Defendants (Voip-Pal et al) filed a motion to the Supreme Court for reconsideration, however that motion was denied, and a trial date was set for November 28, 2023.\nSubsequent to the year ended September 30, 2023,on November 30, 2023, after the completion of trial, the Eighth Judicial District Court for the State of Nevada rendered its decision in favor of VoIP-Pal upon all claims in the case, ruling that the Plaintiffs had not met their burden of proof with respect to any of its claims against VoIP-Pal et al, awarding no damages to Locksmith and specifically ruling that Locksmith take nothing as a result of the litigation. The case is now closed. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket\nOur common stock is quoted on the OTCQB with the OTC Markets Group, Inc. under the symbol VPLM. The OTCQB is an inter- dealer quotation and trading system where market makers apply to quote securities. Accordingly, the OTCQB is not considered a market, and there is, therefore, no public market for our Common Stock.\nHolders\nWe had approximately 575 holders of record of our common stock as of September 30, 2023 according to the books of our transfer agent. The number of our stockholders of record excludes any estimate by us of the number of beneficial owners of shares held in street name, the accuracy of which cannot be guaranteed.\nDividends\nWe have not declared a dividend on our common stock, and we do not anticipate the payment of dividends in the near future as we intend to reinvest our profits to grow our business. There are no restrictions in our articles of incorporation or bylaws that restrict us from declaring dividends. The Nevada Revised Statutes, however, prohibit us from declaring dividends where, after giving effect to the distribution of the dividend:\n● we would not be able to pay our debts as they become due in the usual course of business; or\n● our total assets would be less than the sum of our total liabilities, plus the amount that would be needed to satisfy the rights of shareholders who have preferential rights superior to those receiving the distribution.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nIn order to provide incentive to its directors, officers, management, employees, consultants and others who provide services to the Company or any subsidiary (the Service Providers) to act in the best interests of the Company, and to retain such Service Providers, the Company has in place an incentive Stock Option Plan (the Plan). Under the Plan, the Company is authorized to issue up to 10% of its issued and outstanding share capital in options to purchase common shares of the Company. The maximum term of options granted under the Plan cannot exceed ten years, with vesting terms determined at the discretion of the Board of Directors.\nDuring the year ended September 30, 2022, the Company granted 77,000,000 options to purchase 77,000,000 common shares at a price of $0.025 to its consultants and advisors, of which 69,500,000 are currently outstanding and exercisable. On April 24, 2023, the stock options issued on May 30, 2022 were re-priced from $0.025 to $0.005. The options have varied vesting provisions and are exercisable for a period of five years from the date of grant.\nDuring the year ended September 30, 2023, the Company granted 75,000,000 options to purchase 75,000,000 common shares at a price of $0.005 per share to its directors, consultants and advisors, of which 68,500,000 are currently exercisable. The options have varied vesting provisions and are exercisable for a period of five years from the date of grant.\nAs at September 30, 2023, the Company has 209,500,000 stock options outstanding at an average exercise price of $0.005 per share, with a remaining contractual life of an average of 3.68 years, of which 203,000,000 are vested and exercisable.\nRecent Sales of Unregistered Securities\nThe transactions described in this section were exempt from securities registration as provided by Section 4(a)(2) of the Securities Act for transactions not involving a public offering.\nSecurities Issued for Services Rendered\nDuring the year ended September 30, 2018, the Company issued 104,313,833 shares of common stock at prices between $0.02 and $0.06 per share to various individuals or entities for services valued at $4,461,789.\nDuring the year ended September 30, 2019, the Company issued 17,410,000 shares of common stock at prices between $0.02 and $0.04 per share to various individuals or entities for services valued at $540,200 and 127,000,000 common shares as bonus compensation, recorded as an expense to the Company of $5,080,000.\nDuring the year ended September 30, 2020, the Company issued 33,250,000 shares of common stock at prices between $0.005 and $0.03 per share to various individuals or entities for services with an aggregate value of $534,500.\nDuring the year ended September 30, 2021, the Company issued 17,800,000 shares of common stock at prices between $0.005 and $0.02 per share to various individuals or entities for services with an aggregate value of $298,900.\nDuring the year ended September 30, 2022, the Company issued 9,000,000 shares of common stock at prices between $0.011 and $0.012 per share to various individuals or entities for services with an aggregate value of $101,600.\nDuring the year ended September 30, 2023, the Company issued 14,500,000 shares of common stock at a price of $0.005 per share to various individuals or entities for services with an aggregate value of $72,500.\nSecurities Issued for Convertible Debt or in Settlement of Debt\nDuring the year ended September 30, 2018, the Company issued 174,983,685 shares of common stock at a price of $0.038 per share pursuant to the anti-dilution clause of the Digifonica share purchase agreement dated June 25, 2013 for an aggregate value of $6,684,377.\nDuring the year ended September 30, 2019, the Company issued 225,184,791 shares of common stock priced between $0.003 and $0.04 per share pursuant to the anti-dilution clause of the Digifonica share purchase agreement dated June 25, 2013 for an aggregate value of $5,124,641.\nSecurities Issued for Cash Proceeds\nDuring the year ended September 30, 2018, the Company issued:\n- 108,147,749 shares of common stock at prices between $0.015 and $0.06 per common share to various individuals or entities for cash proceeds of $3,343,940 from the private placement of common shares;\n- 6,306,000 units at prices between $0.0125 and $0.02 per unit to various individuals or entities for cash proceeds of $98,120 from the private placement of units of the Companys common stock. Each unit consists of one common share and one common share purchase warrant. Each common share purchase warrant allows the holder to purchase one common share for $0.04 for a period of twelve months from the date of issuance; and\n- 50,125,000 common shares at $0.04 per common share to various individuals or entities for cash proceeds of $2,005,000 on the exercise of 50,125,000 common share purchase warrants.\nDuring the year ended September 30, 2019, the Company issued:\n- 5,475,000 shares of common stock at $0.04 per common share to various individuals or entities for cash proceeds of $219,000 from the private placement of common shares;\n- 6,306,000 common shares at $0.04 per common share to various individuals or entities for cash proceeds of $252,240 on the exercise of 6,306,000 common share purchase warrants.\nDuring the year ended September 30, 2020, the Company issued 44,354,000 common shares priced between $0.005 and $0.015 per common share to various individuals or entities for cash proceeds of $299,310 from private placements of common shares.\nDuring the year ended September 30, 2021, the Company issued 193,201,500 common shares priced between $0.005 and $0.01 per share for cash proceeds of $1,018,515 from a private placement of common shares.\nDuring the year ended September 30, 2022, the Company issued 246,550,000 common shares priced at $0.005 per common share to various individuals or entities for cash proceeds of $1,232,750 from the private placement of common shares.\nDuring the year ended September 30, 2023, the Company issued 983,720,000 common shares priced at $0.005 per common share to various individuals or entities for cash proceeds of $4,918,600 from the private placement of common shares. Item 6. Selected Financial Data.\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following managements discussion and analysis (MD&A) should be read in conjunction with our audited consolidated financial statements for the year ended September 30, 2023 and notes thereto appearing elsewhere in this report, and our audited consolidated financial statements for the year ended September 30, 2022 and notes thereto.\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING INFORMATION\nThis MD&A for the year ending September 30, 2023 contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amending, and Section 21E of the Securities Exchange Act of 1934, as amending. Forward-looking statements may be identified by the use of forward-looking terminology, such as may, shall, could, expect, estimate, anticipate, predict, probable, possible, should, continue, or similar terms, variations of those terms or the negative of those terms. The forward-looking statements specified in the following information have been compiled by our management based on assumptions made by management and are considered by management to be reasonable. Our future operating results, however, are impossible to predict and no representation, guaranty, or warranty is to be inferred from those forward-looking statements.\nThe assumptions used for purposes of the forward-looking statements specified in the following information represent estimates of future events and are subject to uncertainty as to possible changes in economic, legislative, industry, and other circumstances. As a result, the identification and interpretation of data and other information and their use in developing and selecting assumptions from and among reasonable alternatives require the exercise of judgment. To the extent that the assumed events do not occur, the outcome may vary substantially from anticipated or projected results, and, accordingly, no opinion is expressed on the achievability of those forward- looking statements. No assurance can be given that any of the assumptions relating to the forward-looking statements specified in the following information are accurate, and we assume no obligation to update any such forward-looking statements.\nCORPORATE HISTORY, OVERVIEW AND PRINCIPAL BUSINESS\nVoIP-PAL.com Inc. (the Company) was incorporated in the state of Nevada in September 1997 as All American Casting International, Inc. and changed its name to VOIP MDI.com in 2004 and subsequently to Voip-Pal.Com Inc. in 2006. Since March 2004, the Company has been in the development stage of becoming a Voice-over-Internet Protocol (VoIP) re-seller, a provider of a proprietary transactional billing platform tailored to the points and air mile business, and a provider of anti-virus applications for smartphones. All business activities prior to March 2004 have been abandoned and written off to deficit.\nIn 2013, the Company acquired Digifonica International (DIL) Limited (Digifonica), to fund and co-develop Digifonicas patent suite. Digifonica had been founded in 2003 with the vision that the internet would be the future of all forms of telecommunications - a team of twenty top engineers with expertise in Linux and Internet telephony developed and wrote a software suite with applications that provided solutions for several core areas of internet connectivity. In order to properly test the applications, Digifonica built and operated three production nodes in Vancouver, Canada (Peer 1), London, UK (Teliasonera), and Denmark. Upon successfully developing the technology, Digifonica filed for patents with the United States Patent and Trademark Office (USPTO).\nThe Digifonica patents formed the basis for the Companys current intellectual property, now a worldwide portfolio of twenty-six issued and pending patents primarily designed for the broadband VoIP market.\nThe Companys intellectual property value is derived from its issued and pending patents. The inventions described in these patents, among other things, provide the means to integrate VoIP services with legacy telecommunications systems such as the public switched telephone network (PSTN) to create a seamless service using either legacy telephone numbers or IP addresses, and enhance the performance and value of VoIP implementations worldwide.\nVoIP has been and continues to be a green field for innovation that has spawned numerous inventions, greatly benefitting consumers large and small across the globe. VoIP is used in many places and by every modern telephony system vendor, network supplier, and retail and wholesale carrier.\nResults of Operations\nThe Companys operating costs consist of expenses incurred to monetizing, selling and licensing its VoIP patents. Other operating costs include expenses for legal, accounting and other professional fees, financing costs, and other general and administrative expenses.\nComparison of the Years Ending September 30, 2023 and 2022\nYear Ended September 30, Increase\n(Decrease) Percentage\nRevenue $ - $ - $ - $ -\nCost of revenue - - - -\nGross margin - - - -\nGeneral and administrative expenses (3,136,404 ) (1,195,619 ) 1,940,785 162 %\nAmortization & depreciation (140,458 ) (140,458 ) - -\nStock based compensation (20,076,567 ) (2,356,339 ) 17,720,228 752 %\nOther (income) 244,420 - 244,420 100 %\nNet loss $ (23,109,009 ) $ (3,692,416 ) $ 19,416,593 526 %\nREVENUES, COST OF REVENUES AND GROSS MARGIN\nThe Company had no revenues, cost of revenues or gross margin for the years ending September 30, 2023 and 2022.\nGENERAL AND ADMINISTRATIVE EXPENSES\nGeneral and administrative expenses for the year ending September 30, 2023 totaled $3,136,404 compared to $1,195,619 during 2022. The increase in general and administrative expenses of $1,940,785 or 162% more than the previous year, was primarily due to an increase in legal and professional fees and services.\nSTOCK BASED COMPENSATION\nStock-based compensation expense for the year ending September 30, 2023 totaled $20,076,567 compared to $2,356,339 during 2022. The increase in stock-based compensation expense of $17,720,228, or 752% more than the previous year, was primarily due to repricing of the outstanding options from $0.025 to $0.005, repricing and vesting of 2022 warrants of 410,000,000 and additional options and warrant issued and vested during the year ended September 30, 2023.\nAMORTIZATION AND DEPRECIATION\nAmortization of the intellectual VoIP communications patent properties and depreciation of fixed assets for the year ending September 30, 2023 totaled $140,458 compared to $140,458 for the year ended September 30, 2022. There was no difference between depreciation and amortization expense for the year ending September 30, 2023 as compared to 2022.\nThe Company follows GAAP (FAS 142) and is amortizing its intangibles over an estimated patent life of twelve (12) years. The Company evaluates its intangible assets annually and determines if the fair market value is less than its historical cost. If the fair market value is less, then impairment expense is recorded on the Companys financial statements. The intangible assets on the financial statements of the Company relate primarily to the Companys acquisition of Digifonica (International) Limited.\nOTHER ITEMS\nOther income for the year ending September 30, 2022 totaled $244,420 compared to $Nil during 2022. The increase in other income of $244,420, or 100% more than the previous year, which $59,420 was primarily due to the Company entering into settlement agreements with vendors pursuant to which they relinquished debt owed by the Company, and $185,000 was due to the Company entering into a settlement and release agreement with a party to resolve all aspects of a litigation regarding certain of VoIP-Pals patents.\nINTEREST EXPENSE\nThe Company had no financing or interest costs for the years ending September 30, 2023 and 2022.\nNET LOSS\nThe Company reported a net loss of $23,109,009 for the year ended September 30, 2023 compared to a net loss of $3,692,416 for the year ended September 30, 2022. The increase in net loss of $19,416,593 or 526% more than the previous year was primarily due to an increase in stock-based compensation and legal and professional fees.\nLIQUIDITY AND CAPITAL RESOURCES\nAs of September 30, 2023, the Company had an accumulated deficit of $93,185,588 as compared to an accumulated deficit of $70,076,579 at September 30, 2022. As of September 30, 2023, the Company had working capital of $2,198,010 as compared to working capital of $148,053 at September 30, 2022. The increase in the Companys working capital of $2,049,957 is due to proceeds received from a private placement of the Companys stock.\nNet cash used by operations for the years ending September 30, 2023 and 2022 was $3,006,496 and $1,103,768, respectively. The increase in net cash used for operations for the year ending September 30, 2023 as compared to the year ending September 30, 2022 was primarily due to an increase in legal fees and professional services.\nNet cash used in investing activities for the years ending September 30, 2023 and 2022 was $Nil. Net cash provided from financing activities for the years ending September 30, 2023 and 2022 was $4,918,600 and $1,232,750, respectively. The increase in net cash provided by financing activities of $3,685,850 was due to equity raised from private placements during the year ending September 30, 2023.\nLiquidity\nThe Company primarily finances its operations from cash received through the private placement of its common stock, settling outstanding debts, and the exercise of warrants from investors. While there can be no assurance that capital will be available as necessary to meet continued developments and operating costs or, if the capital is available, that it will be on terms acceptable to the Company, the Company believes its resources are adequate to fund its operations for the next 12 months.\nOff-Balance Sheet Arrangements\nPerformance Bonus Payable\nIn 2016, the board of directors authorized the Company to provide a performance bonus (the Performance Bonus) of up to 3% of the capital stock of the Company by way of the issuance of Common shares from its treasury to an as yet undetermined group of related and non-related parties upon the occurrence of a bonusable event, defined as the successful completion of a sale of the Company or substantially all its assets, or a major licensing transaction. In order to provide maximum flexibility to the Company with respect to determining the level of Performance Bonus payable, and who may qualify to receive a pro-rata share of such a Performance Bonus, the Company authorized full discretion to the Board in making such determinations.\nIn 2019, the board of directors authorized the increase of the Performance Bonus to up to 10% of the capital stock of the Company. Concurrently, the directors authorized 66.67% of the Performance Bonus to be issued in an advance payment of an aggregate 127,000,000 Common shares (Bonus Shares) to a group of related and non-related parties, which included members of management, a director and several consultants. 60,000,000 of the Bonus Shares are restricted from trading under Rule 144 and subject to voluntary lock-up agreements under which they cannot be traded, pledged, hypothecated, transferred or sold by the holders until such time as the Company has met the requirements of the bonusable event as described above.\nAs at September 30, 2023, no bonusable event had occurred and there was no Performance Bonus payable.\nImpact of Inflation\nWe believe that inflation has not had a material impact on our results of operations for the year ended September 30, 2023. We cannot assure you that future inflation will not have an adverse impact on our operating results and financial condition.\nImpact of COVID-19\nIn March 2020, the World Health Organization declared a global pandemic related to the COVID-19 coronavirus. Its impact on global economies has been far-reaching and businesses around the world are being forced to cease or limit operations for long or indefinite periods of time. Measures taken to contain the spread of the COVID-19 virus, including travel bans, quarantines, social distancing, and closures of non-essential services have triggered significant disruptions to businesses worldwide, resulting in an economic slowdown. Global stock markets have also experienced great volatility and significant declines. Governments and central banks have responded with monetary and fiscal interventions to stabilize economic conditions.\nThe duration and impact of the COVID-19 pandemic, as well as the effectiveness of government and central bank responses, remains unclear at this time. It is not possible to reliably estimate the duration and severity of the COVID-19 pandemic, nor its impact on the financial position and results of the Company in future periods. The Company is proceeding with its business activities as long as the work environment remains safe - at this point there has been minimal disruption to day-to-day operations resulting from health and safety measures. Disruptions and volatility in the global capital markets may increase the Companys cost of capital and adversely impact access to capital. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nAs a smaller reporting company we are not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data.\nVOIP-PAL.COM INC.\nCONSOLIDATED FINANCIAL STATEMENTS\nFiscal Year ending September 30, 2023\nCONSOLIDATED BALANCE SHEETS\nCONSOLIDATED STATEMENTS OF LOSS AND COMPREHENSIVE LOSS\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Directors of\nVoip-pal.com Inc.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Voip-pal.com Inc. (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of loss and comprehensive loss, cash flows, and stockholders equity for the years ended September 30, 2023 and 2022, and the related notes and schedules (collectively referred to as the financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for the years ended September 30, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the consolidated financial statements, the entity has suffered recurring losses from operations that raise substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nWe have served as the Companys auditor since 2015.\n/s/ DAVIDSON & COMPANY LLP\nVancouver, Canada\nChartered Professional Accountants\nDecember 20, 2023\nPCAOB ID # 731\nVOIP-PAL.COM INC.\nCONSOLIDATED BALANCE SHEETS\nAs at\n(Expressed in U.S. Dollars)\nSeptember 30, September 30,\nASSETS\nCURRENT\nCash $ 2,217,589 $ 305,485\nPrepaid expense 6,000 -\nRetainer (Note 5) 36,183 1,181\nTOTAL CURRENT ASSETS 2,259,772 306,666\nNON-CURRENT\nFixed assets (Note 6) 2,132 4,390\nIntellectual VoIP communications patent properties, net (Note 7) 226,550 364,750\nTOTAL ASSETS $ 2,488,454 $ 675,806\nLIABILITIES\nCURRENT\nAccounts payable and accrued liabilities $ 61,762 $ 158,613\nTOTAL LIABILITIES 61,762 158,613\nSTOCKHOLDERS EQUITY\nSHARE CAPITAL (Note 10) $ 2,491,993 $ 1,463,465\nPREFERRED SHARE CAPITAL (Note 10) 7,350 4,750\nADDITIONAL PAID-IN CAPITAL (Note 10) 93,112,937 69,064,237\nSHARES TO BE ISSUED (Note 10) - 61,320\nDEFICIT (93,185,588 ) (70,076,579 )\nTOTAL STOCKHOLDERS EQUITY 2,426,692 517,193\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY $ 2,488,454 $ 675,806\nNature and Continuance of Operations (Note 1)\nContingent Liabilities (Note 14)\nThe accompanying notes are an integral part of these consolidated financial statements\nVOIP-PAL.COM INC.\nCONSOLIDATED STATEMENTS OF LOSS AND COMPREHENSIVE LOSS\nFor the Fiscal Years ending\n(Expressed in U.S. Dollars)\nSeptember 30, September 30,\nEXPENSES\nAmortization (Note 6 & 7) $ 140,458 $ 140,458\nOfficers and Directors fees (Note 8) 100,218 74,255\nLegal fees 2,004,405 661,861\nOffice & general 341,980 140,682\nPatent consulting fees 8,921\nProfessional fees & services 689,387 309,900\nStock-based compensation (Note 11) 20,076,567 2,356,339\nTotal expenses $ 23,353,429 $ 3,692,416\nOTHER INCOME\nGain on settlement (Note 12) (185,000 ) -\nGain on settlement of accrued payables (Note 12) (59,420 ) -\nTotal other income (244,420 ) -\nLOSS AND COMPREHENSIVE LOSS FOR THE YEAR $ (23,109,009 ) $ (3,692,416 )\nBasic and diluted loss per common share $ (0.01 ) $ -\nWeighted-average number of common shares outstanding, basic and diluted 2,411,986,215 1,977,278,873\nThe accompanying notes are an integral part of these consolidated financial statements\nVOIP-PAL.COM INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Fiscal Years ended\n(Expressed in U.S. Dollars)\nSeptember 30,\nSeptember 30,\nCash Flows used in Operating Activities\nLoss for the year $ (23,109,009 ) $ (3,692,416 )\nAdd items not affecting cash:\nShares issued for services 84,661 101,600\nAmortization 140,458 140,458\nGain on settlement of accrued payables (59,420 ) -\nStock-based compensation 20,076,567 2,356,339\nChanges in non-cash working capital:\nRetainer (35,002 ) 13,237\nAccounts payable and accrued liabilities (98,751 ) (22,986 )\nPrepaid expense (6,000 ) -\nCash Flows Used in Operations (3,006,496 ) (1,103,768 )\nCash Flows from Financing Activities\nProceeds from private placement 4,918,600 1,232,750\nCash Flows Provided by Financing Activities 4,918,600 1,232,750\nIncrease in cash 1,912,104 128,982\nCash, beginning of the year 305,485 176,503\nCash, end of the year $ 2,217,589 $ 305,485\nSupplemental cash flow information (Note 9)\nThe accompanying notes are an integral part of these consolidated financial statements\nVOIP-PAL.COM INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\n(Expressed in U.S. dollars)\nNumber Par Value Number Par Value Value Capital Deficit Total\nCommon Shares Preferred Shares Shares to be Issued Additional Paid-in\nNumber Par Value Number Par Value Value Capital Deficit Total\nBalance at September 30, 2021 1,731,447,863 $ 1,207,915 - - $ 61,320 $ 65,633,848 $ (66,384,163 ) $ 518,920\nShares issued for private placement 246,550,000 246,550 - - - 986,200 - 1,232,750\nShares issued for services 9,000,000 9,000 - - - 92,600 - 101,600\nStock-based compensation - - 475,000 4,750 - 2,351,589 - 2,356,339\nLoss for the year - - - - - - (3,692,416 ) (3,692,416 )\nBalance at September 30, 2022 1,986,997,863 $ 1,463,465 475,000 $ 4,750 $ 61,320 $ 69,064,237 $ (70,076,579 ) $ 517,193\nBalance, value 1,986,997,863 $ 1,463,465 475,000 $ 4,750 $ 61,320 $ 69,064,237 $ (70,076,579 ) $ 517,193\nShares issued for private placement 983,720,000 983,720 - - - 3,934,880 - 4,918,600\nShares issued for services 14,500,000 14,500 121,611 1,216 - 68,945 - 84,661\nStock-based compensation - - 138,420 1,384 - 20,075,183 - 20,076,567\nExercise of stock options 32,500,000 32,500 - - - (32,500 ) - -\nReturn to treasury for cashless option exercise (2,192,572 ) (2,192 ) - - - 2,192 - -\nGain on settlement, issuance cancelled - - - - (61,320 ) - - (61,320 )\nLoss for the year - - - - - - (23,109,009 ) (23,109,009 )\nBalance at September 30, 2023 3,015,525,291 $ 2,491,993 735,031 $ 7,350 $ - $ 93,112,937 $ (93,185,588 ) $ 2,426,692\nBalance value 3,015,525,291 $ 2,491,993 735,031 $ 7,350 $ - $ 93,112,937 $ (93,185,588 ) $ 2,426,692\nThe accompanying notes are an integral part of these consolidated financial statements\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 1. NATURE AND CONTINUANCE OF OPERATIONS\nVOIP-PAL.com, Inc. (the Company) was incorporated in the state of Nevada in September 1997 as All American Casting International, Inc. The Companys registered office is located at 7215 Bosque Blvd, Suite 102, Waco, Texas in the United States of America.\nSince March 2004, the Company has developed technology and patents related to Voice-over-Internet Protocol (VoIP) processes. All business activities prior to March 2004 have been abandoned and written off to deficit. The Company operates in one reportable segment being the acquisition and development of VoIP-related intellectual property including patents and technology. All intangible assets are located in the United States of America.\nIn December 2013, the Company completed the acquisition of Digifonica (International) Limited, a private company controlled by the CEO of the Company, whose assets included several patents and technology developed for the VoIP market.\nThese consolidated financial statements have been prepared on the basis of a going concern, which contemplates the realization of assets and discharge of liabilities in the normal course of business. The Company is in various stages of product development and continues to incur losses and, as at September 30, 2023, had an accumulated deficit of $93,185,588 (September 30, 2022 - $70,076,579). The ability of the Company to continue operations as a going concern is dependent upon raising additional working capital, settling outstanding debts and the exercise of warrants from investors. These material uncertainties raise substantial doubt about the Companys ability to continue as a going concern. Should the going concern assumption not continue to be appropriate, further adjustments to carrying values of assets and liabilities may be required. There can be no assurance that capital will be available as necessary to meet these continued developments and operating costs or, if the capital is available, that it will be on terms acceptable to the Company. The issuances of additional stock by the Company may result in a significant dilution in the equity interests of its current shareholders. Obtaining commercial loans, assuming those loans would be available, will increase the Companys liabilities and future cash commitments. If the Company is unable to obtain financing in the amounts and on terms deemed acceptable, its business and future success may be adversely affected.\nAdditionally, as the Companys stated objective is to monetize its patent suite through the licensing or sale of its intellectual property (IP), the Company being forced to litigate or to defend its IP claims through litigation casts substantial doubt on its future to continue as a going concern. IP litigation is generally a costly process, and in the absence of revenue the Company must raise capital to continue its own defense and to validate its claims - in the event of a failure to defend its patent claims, either because of lack of funding, a court ruling against the Company or because of a protracted litigation process, there can be no assurance that the Company will be able to raise additional capital to pay for an appeals process or a lengthy trial. The outcome of any litigation process may have a significant adverse effect on the Companys ability to continue as a going concern.\nCOVID-19\nThe outbreak of COVID-19 had resulted in worldwide emergency measures to combat the spread of the virus. These measures, including significant restrictions on commercial activity, have adversely affected workforces, economies, and financial markets globally, potentially leading to an economic downturn. However, starting in the second half year of 2022, restrictions have been gradually eased, and while variants of COVID-19 continue to emerge, it appears that much of the impact of the pandemic on business may now be behind us. A new potential challenge is the impact of inflationary economic conditions on business activity but the consequences of this for the Companys business are not yet clear.\nNOTE 2. BASIS OF PRESENTATION\nThe accompanying consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America (US GAAP).\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 3. SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation\nThese consolidated financial statements have been prepared on a consolidated basis and include the accounts of the Company and its wholly owned subsidiary, Digifonica. All intercompany transactions and balances have been eliminated. As at September 30, 2023, Digifonica had no activities.\nUse of Estimates\nThe preparation of these consolidated financial statements required management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amount of revenues and expenses during the reporting period. Actual results could differ from these estimates. Where estimates have been used, financial results as determined by actual events could differ from those estimates. Some of the more significant accounting estimates used in the preparation of the companys financial statements include deferred income taxes, the valuation of equity-related instruments issued, and the useful life and impairment of intangible assets.\nCash\nCash consists of cash on hand, cash held in trust, and monies held in checking and savings accounts. The Company had $2,217,589 in cash on September 30, 2023 (September 30, 2022 - $305,485).\nFixed Assets\nFixed assets are stated at cost less accumulated depreciation, and depreciated using the straight-line method over their useful lives; Furniture and computers - 5 years.\nIntangible Assets\nIntangible assets, consisting of VoIP communication patent intellectual properties (IP) are recorded at cost and amortized over the assets estimated life on a straight-line basis. Management considers factors such as remaining life of the patents, technological usefulness and other factors in estimating the life of the assets.\nThe carrying value of intangible assets are reviewed for impairment by management of the Company at least annually or upon the occurrence of an event which may indicate that the carrying amount may be less than its fair value. If impaired, the Company will write- down such impairment. In addition, the useful life of the intangible assets will be evaluated by management at least annually or upon the occurrence of an event which may indicate that the useful life may have changed.\nFair Value of Financial Instruments\nFASB ASC 820, Fair Value Measurement, defines fair value as the price that would be received upon sale of an asset or paid upon transfer of a liability in an orderly transaction between market participants at the measurement date and in the principal or most advantageous market for that asset or liability. The fair value should be calculated based on assumptions that market participants would use in pricing the asset or liability, not on assumptions specific to the entity.\nThe Company classifies financial assets and liabilities as held-for-trading, available-for-sale, held-to-maturity, loans and receivables or other financial liabilities depending on their nature. Financial assets and financial liabilities are recognized at fair value on their initial recognition, except for those arising from certain related party transactions which are accounted for at the transferors carrying amount or exchange amount.\nFinancial assets and liabilities classified as held-for-trading are measured at fair value, with gains and losses recognized in net income. Financial assets classified as held-to-maturity, loans and receivables, and financial liabilities other than those classified as held-for-trading are measured at amortized cost, using the effective interest method of amortization. Financial assets classified as available-for-sale are measured at fair value, with unrealized gains and losses being recognized as other comprehensive income until realized, or if an unrealized loss is considered other than temporary, the unrealized loss is recorded in income.\nU.S. GAAP establishes a framework for measuring fair value under generally accepted accounting principles and enhances disclosures about fair value measurements. Fair value is defined as the amount that would be received for an asset or paid to transfer a liability (i.e., an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value maximize the use of observable inputs and minimize the use of unobservable inputs. The standard describes the following fair value hierarchy based on three levels of inputs, of which the first two are considered observable and the last unobservable, that may be used to measure fair value:\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 3. SIGNIFICANT ACCOUNTING POLICIES (CONTD)\n- Level 1: Quoted prices in active markets for identical assets and liabilities.\n- Level 2: Inputs other than Level 1 that are observable, either directly or indirectly, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\n- Level 3: Unobservable inputs supported by little or no market activity and that are significant to the fair value of the assets or liabilities.\nThe fair value of cash is classified as Level 1 at September 30, 2023 and 2022.\nThe Company classifies its financial instruments as follows: Cash is classified as held for trading and is measured at fair value. Accounts payable and accrued liabilities are classified as other financial liabilities, and have a fair value approximating their carrying value, due to their short-term nature.\nIncome Taxes\nDeferred income taxes have been provided for temporary differences between financial statement and income tax reporting under the asset and liability method, using expected tax rates and laws that are expected to be in effect when the differences are expected to reverse. A valuation allowance is provided when realization is not considered more likely than not.\nThe Companys policy is to classify income tax assessments, if any, for interest expense and for penalties in general and administrative expenses. The Companys income tax returns are subject to examination by the IRS and corresponding states, generally for three years after they are filed.\nLoss per Common Share\nBasic loss per share is calculated using the weighted-average number of common shares outstanding during each period. Diluted income per share includes potentially dilutive securities such as outstanding options and warrants outstanding during each period. To calculate diluted loss per share, the Company uses the treasury stock method and the if-converted method.\nFor the year ended September 30, 2023 and the year ended September 30, 2023, there were no potentially dilutive securities included in the calculation of weighted-average common shares outstanding.\nDerivatives\nWe account for derivatives pursuant to ASC 815, Accounting for Derivative Instruments and Hedging Activities. All derivative instruments are recognized in the consolidated financial statements and measured at fair value regardless of the purpose or intent for holding them. We determine fair value of warrants and other option-type instruments based on option pricing models. The changes in fair value of these instruments are recorded in income or expense.\nPreferred Shares\nThe preferred shares carry super-voting rights with each shared issued having the equivalent of 1,550 votes. Preferred shares issued by the Company are not convertible into or exchangeable for common shares and they are not exchangeable for equity nor redeemable for cash. The preferred shares do not pay dividends. The preferred shares cannot be sold, exchanged or transferred to another party.\nStock-Based Compensation\nThe Company recognizes compensation expense for all stock-based payments made to employees, directors and others based on the estimated fair values of its common stock on the date of issuance.\nThe Company determines the fair value of the stock-based compensation payments granted as either the fair value of the consideration received or the fair value of the equity instruments issued, whichever is more reliably measurable. If the fair value of the equity instruments issued is used, it is measured using the stock price and other measurement assumptions as of the earlier of either the date at which a commitment for performance to earn the equity instrument is reached or the date the performance is complete.\nThe Company recognizes compensation expense for stock awards with service conditions on a straight-line basis over the requisite service period, which is included in operations. Stock option expense is recognized over the options vesting period.\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 3. SIGNIFICANT ACCOUNTING POLICIES (CONTD)\nConcentrations of Credit Risk\nThe Companys policy is to maintain cash with reputable financial institutions or in retainers with trusted vendors. The Company has at times had cash balances at financial institutions in excess of the Federal Deposit Insurance Corporation (FDIC) Insurance Limit of\n$250,000; however, has not experienced any losses to date as a result. As of September 30, 2023, the Companys bank operating account balances exceeded the FDIC Insurance Limit of $250,000 by $1,967,589.\nRecent Accounting Pronouncements and Adoption\nASU 2020-10 - Codification Improvements. In October 2020, the FASB issued ASU 2020-10, Codification Improvements. The guidance contains improvements to the Codification by ensuring that all guidance that requires or provides an option for an entity to provide information in the notes to financial statements is codified in the Disclosure Section of the Codification. The guidance also contains Codifications that are varied in nature and may affect the application of the guidance in cases in which the original guidance may have been unclear. For public business entities, the amendments in the ASU are effective for fiscal years beginning after December 15, 2020. For all other entities, the amendments are effective for annual periods beginning after December 15, 2021, and interim periods within annual periods beginning after December 15, 2022. The Company has adopted the updated standard for the year ended September 30, 2023, which did not have an effect on the Companys consolidated financial statements.\nThe FASB issues ASUs to amend the authoritative literature in ASC. There have been a number of ASUs to date, including those above, that amend the original text of ASC. Management believes that those issued to date either (i) provide supplemental guidance, (ii) are technical corrections, (iii) are not applicable to us or (iv) are not expected to have a significant impact on our consolidated financial statements.\nNOTE 4. PURCHASE OF DIGIFONICA\nThe Company acquired Digifonica in December 2013. Pursuant to the terms in the Share Purchase Agreement (the SPA), the Company acquired 100% of Digifonica from the seller, the CEO of the Company (the Seller), for a cash payment of $800,000 and 389,023,561 common shares of the Company. The assets acquired through the acquisition were VoIP-related patented technology, including patents for Lawful Intercept, routing, billing and rating, mobile gateway, advanced interoperability solutions, intercepting voice over IP communications, and uninterrupted transmission of internet protocol transmissions during endpoint changes.\nThe SPA included an anti-dilution clause (the Anti-Dilution Clause) that required the Company to maintain the Sellers percentage ownership of the Company at 40% by issuing the Seller a proportionate number of common shares of any future issuance of the Companys common shares. Shares issued pursuant to the Anti-Dilution Clause were recorded as a share issuance cost within the Additional Paid-in Capital account (Notes 8 and 10).\nDuring the year ended September 30, 2021, on April 12, 2021, the SPA was amended to provide that: a) from its inception until March 31, 2021, the Company would issue warrants to purchase common shares of the Company in an equivalent amount to and instead of the required shares being issued pursuant to the Anti-Dilution Clause; and b) the Anti-Dilution Clause would be null and void from April 1, 2021 forward. As a result of this amendment, the Seller returned 513,535,229 common shares to the treasury of the Company and relinquished his right to receive an additional 107,935,333 common shares in exchange for 621,470,562 warrants to purchase common shares at a price of $0.021 for a period of ten years from the date of issue.\nDuring the year ended September 30, 2023, on April 23, 2023, the SPA was further amended to: a) retroactively reinstate the Anti-Dilution Clause that had been nullified by the amendments made to the STA in April 2021 so that the Company is now required to issue warrants to purchase common shares of the Company in an equivalent amount to and instead of the required shares being issued pursuant to the original Anti-Dilution Clause; and b) require the Company to issue preferred shares with super-voting rights in a sufficient amount in order for the Seller to maintain his 40% voting rights in the Company while his warrants issued pursuant to the original and reinstated Anti-Dilution Clause remain unexercised (2023 Amendments). Each of the warrant issuance and the preferred share issuance required under the 2023 Amendments are to occur at the close of each quarterly reporting period. As a result of the 2023 Amendments, the Seller was issued 831,466,899 share purchase warrants and 138,420 series A preferred shares on June 30, 2023. Shares and warrants issued pursuant to the Anti-Dilution Clause are recorded as a share issuance cost within the additional paid-in capital account (Notes 8 and 10).\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 5. RETAINER\nThe Company has retainers with certain of its professional service providers. The balance due on these prepaid retainers was $36,183 as of September 30, 2023, and $1,181 for the year ended September 30, 2022. The Company recognizes the expense from these retainers as they are invoiced, and the invoiced charges are deducted from the various providers prepaid retainer balances.\nNOTE 6. FIXED ASSETS\nA summary of the Companys fixed assets as of September 30, 2023 and September 30, 2022 is as follows:\nSCHEDULE OF FIXED ASSETS\nSeptember 30,\nSeptember 30,\nOffice furniture & computers $ 11,917 $ 11,917\nAccumulated depreciation (9,785 ) (7,527 )\nNet book value $ 2,132 $ 4,390\nThere were no retirements of any fixed assets in the years presented.\nNOTE 7. INTANGIBLE ASSETS\nThe Company acquired certain patents and technology from Digifonica in December 2013 (see Note 4). These assets have been recorded in the consolidated financial statements as intangible assets. These assets are being amortized over twelve (12) years on a straight-line basis. A summary of intangible assets as of September 30, 2023 and September 30, 2022 is as follows:\nSCHEDULE OF INTANGIBLE ASSETS\nSeptember 30,\nSeptember 30,\nVoIP Intellectual property and patents $ 1,552,416 $ 1,552,416\nAccumulated amortization (1,325,866 ) (1,187,666 )\nNet book value $ 226,550 $ 364,750\nThere were no disposals of any intangible assets in the years presented.\nNOTE 8. RELATED PARTY TRANSACTIONS AND KEY MANAGEMENT COMPENSATION\nThe Company compensates certain of its key management personnel to operate its business in the normal course. Key management includes the Companys executive officers and members of its Board of Directors.\nCompensation paid or accrued to key management for services during the years ended September 30, 2023 and 2022 includes:\nSCHEDULE OF COMPENSATION PAID OR ACCRUED TO KEY MANAGEMENT FOR SERVICES\nSeptember 30, 2023 September 30, 2022\nManagement fees paid to the CEO $ 17,718 $ 21,655\nManagement fees paid to the current CFO 15,000 -\nManagement fees paid to the former CFO 18,000 18,000\nFees paid or accrued to Directors 49,500 34,600\nStock-based compensations (Note 11) 10,866,260 446,835\nTotal fees paid $ 10,966,478 $ 521,090\nAt September 30, 2023, included in accounts payable and accrued liabilities is $5,000 (September 30, 2022 - $8,100) owed to current officers and directors.\nAt September 30, 2023, included in prepaid expense is $6,000 (September 30, 2022 - $Nil) of prepaid compensation to a director.\nDuring the year ended September 30, 2023, a director of the Company forgave $2,100 (2022 - $Nil) of accrued directors fees.\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 9. SUPPLEMENTAL CASH FLOW INFORMATION\nDuring the year ended September 30, 2023, the Company paid $Nil (September 30, 2022 - $Nil) in interest or income taxes. There were no non-cash investing or financing transactions during the years ended September 30, 2023 and 2022.\nNOTE 10. SHARE CAPITAL\nCapital Stock Authorized and Issued as at September 30, 2023:\n- 5,000,000,000 (September 30, 2022 - 3,500,000,000) common voting shares authorized with a par value of $0.001 each, of which 3,015,525,291 (September 30, 2022 - 1,986,997,863) shares are issued.\n- 1,000,000 Series A preferred shares authorized with a par value of $0.01 each, of which 735,031 (2022 - 475,000) shares are issued. The preferred shares were issued for super-voting rights and are not convertible, exchangeable for common shares, nor redeemable for cash. The preferred shares cannot be sold, exchanged or transferred to another party.\nIssues during the year ended September 30, 2023\nDuring the year ended September 30, 2023, the Company issued:\n− 983,720,000 common shares priced at $0.005 per share for cash proceeds of $4,918,600 from a private placement;\n− 831,466,899 warrants to purchase 831,466,899 common shares exercisable at a price of $0.001 to the Seller of Digifonica pursuant to the Anti-Dilution Clause of the amended SPA (Note 4);\n− 121,611 Series A Preferred shares for services with a value of $12,161 (Note 8);\n− 138,420 Series A Preferred shares pursuant to the Anti-Dilution Clause of the SPA (Note 4) with a value of $138; and\n− 14,500,000 common shares for services with a value of $72,500.\n− 32,500,000 common shares priced at $0.005 per share issuance, offset by 2,192,572 shares returned to treasury for cashless option exercise with a net value of $30,308.\nIssues during the year ended September 30, 2022\nDuring the year ended September 30, 2022, the Company issued:\n− 246,550,000 common shares at $0.005 per share for cash proceeds of $1,232,750 from a private placement of common shares;\n− 9,000,000 common shares for services with a value of $101,600; and\n− 475,000 preferred shares for services with a value of $835 which is recorded as stock-based compensation.\n− The Company also granted 410,000,000 warrants to purchase 410,000,000 common shares to its directors, officers, and consultants, exercisable at a price of $0.025 for a period of five years from the date of issue;\n− 77,000,000 options to purchase 77,000,000 common shares to its consultants and advisors, exercisable at a price of $0.025 for a period of five years from the date of grant; and\n− returned to treasury 11,850,000 options to purchase 11,850,000 common shares at a price of $0.05 from certain of its consultants and advisors as the option term had expired.\nShares to be Issued\nAs at September 30, 2023, there are nil (September 30, 2022 - 1,977,523) common shares to be issued that are accrued for services provided to the Company valued at $nil (September 30, 2022 - $61,320).\nSubsequent Issuances\nSubsequent to the year end, the Company issued 7,000,000 common shares priced at $0.005 per share for cash proceeds of $35,000 from a private placement, 10,000,000 common shares priced at $0.005 per share issuance, offset by 2,351,351 shares returned to treasury for cashless option exercise with a net value of $38,243, and 5,000,000 common shares for services with a value of $25,000.\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 11. STOCK-BASED COMPENSATION\nCommon Share Purchase Warrants\nAs of September 30, 2023, there are 1,862,937,461 (September 30, 2022 - 1,031,470,562) outstanding share purchase warrants to be exercised.\nThe following table summarizes the Companys warrant transactions:\nSCHEDULE OF STOCK WARRANT TRANSACTIONS\nNumber of warrants Weighted average\nexercise price\nBalance September 30, 2021 621,470,562 $ 0.001\nIssued May 30, 2022 410,000,000 0.005\nBalance September 30, 2022 1,031,470,562 0.0023\nIssued June 30, 2023 831,466,899 0.001\nBalance September 30, 2023 1,862,937,461 $ 0.0019\nThe following table summarizes the share purchase warrants outstanding at September 30, 2023:\nSCHEDULE OF PURCHASE WARRANTS OUTSTANDING\nWarrants\nOutstanding\nExercise\nPrice\nRemaining Contractual\nLife (Yrs)\nNumber of Warrants\nCurrently Exercisable\n621,470,562 $ 0.001 7.54 621,470,562\n410,000,000 0.005 3.67 410,000,000\n831,466,899 0.001 9.76 831,466,899\n1,862,937,461 $ 0.002 7.68 1,862,937,461\nDuring the year ended September 30, 2023, the Company:\n− on April 23, 2023, re-priced 621,470,562 warrants issued on April 12, 2021 from $0.021 to $0.001;\n− on April 24, 2023, changed the vesting provisions and exercise price of 410,000,000 warrants granted on May 30, 2022, to fully vest and re-price all such warrants from $0.025 to $0.005; and\n− on June 30, 2023, issued 831,466,899 warrants to purchase common shares at a price of $0.001 per share to the seller of Digifonica pursuant to the reinstated Anti-Dilution Clause of the amended STA (Note 4).\nDuring the year ended September 30, 2023, on June 30, 2023, the Company issued 831,466,899 warrants recorded as a share issuance cost to purchase common shares at a price of $0.001 per share for a period of ten years from the date of issue to its directors, officers, employees and consultants. The following assumptions were used for the Black-Scholes valuation of these warrants on grant date as follows: risk-free rate of 3.81%, expected life of 10 years, annualized historical volatility of 143.75% and a dividend rate of 0%. Expected volatilities are based on the historical volatility of the Companys stock and other factors. The weighted-average fair value per warrant is $0.046.\nDuring the year ended September 30, 2022, on May 30, 2022, the Company issued 410,000,000 warrants to purchase common shares at a price of $0.025 per share for a period of five years from the date of issue to its directors, officers, employees and consultants. On April 24, 2023, 410,000,000 warrants granted on May 30, 2022, were modified to become fully vested and re-priced all such warrants from $0.025 to $0.005. The following assumptions were used for the Black-Scholes valuation of these warrants on modification date as follows: risk-free rate of 3.60%, expected life of 4.10 years, annualized historical volatility of 174.16% and a dividend rate of 0%. Expected volatilities are based on the historical volatility of the Companys stock and other factors. The fair market value that was recorded as additional paid-in capital was $15,995,229. The weighted-average fair value per warrant is $0.039. During the year ended September 30, 2023, stock-based compensation cost of $15,995,229 (2022 - $nil) was charged against income from these vested warrants.\nOn April 23, 2023, 621,470,562 warrants issued on April 12, 2021 were re-priced from $0.021 to $0.005. For the incremental cost on these warrants modification, the following assumptions were used for the Black-Scholes valuation of warrants issued during the year ended September 30, 2023: risk-free rate of 4.78%, expected life of 7.99 years, annualized historical volatility of 169.15% and a dividend rate of 0%. Expected volatilities are based on the historical volatility of the Companys stock and other factors. The incremental cost that has been recorded as additional paid-in capital from the modification of these warrants was $130,000. The weighted-average fair value of these warrants issued during the year ended September 30, 2023 was $0.036.\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 11. STOCK-BASED COMPENSATION (CONTD)\nCommon Share Purchase Options\nIn order to provide incentive to directors, officers, management, employees, consultants and others who provide services to the Company or any subsidiary (the Service Providers) to act in the best interests of the Company, and to retain such Service Providers, the Company has in place an incentive Stock Option Plan (the Plan) whereby the Company is authorized to issue up to 10% of its issued and outstanding share capital in options to purchase common shares of the Company. The maximum term of options granted under the Plan cannot exceed ten years, with vesting terms determined at the discretion of the Board of Directors.\nThe following table summarizes the Companys stock option transactions:\nSCHEDULE OF STOCK OPTIONS TRANSACTIONS\nNumber of options Weighted average\nexercise price ($)\nBalance September 30, 2021 116,850,000 0.005\nGranted 77,000,000 0.005\nCancelled / Expired (11,850,000 ) 0.053\nBalance September 30, 2022 182,000,000 0.024\nGranted 75,000,000 0.005\nExercised (32,500,000 ) 0.005\nCancelled / Expired (15,000,000 ) 0.010\nBalance September 30, 2023 209,500,000 0.005\nThe following table summarizes the stock options outstanding at September 30, 2023:\nSCHEDULE OF STOCK OPTIONS OUTSTANDING\nOptions\nOutstanding\nExercise\nPrice\nRemaining Contractual\nLife (Yrs)\nNumber of Options\nCurrently Exercisable\n65,000,000 0.005 2.57 65,000,000\n69,500,000 0.005 3.67 69,500,000\n75,000,000 0.005 4.67 68,500,000\n209,500,000 $ 0.005 3.68 203,000,000\nDuring the year ended September 30, 2023, the Company:\n- on April 24, 2023, re-priced all its previously issued outstanding options to be exercisable at $0.005 per share; and\n- on May 31, 2023, granted 75,000,000 options to purchase 75,000,000 common shares at a price of $0.005 per share to its directors, consultants and advisors.\nDuring the year ended September 30, 2023, on May 31, 2023, the Company granted 75,000,000 options to purchase 75,000,000 common shares at a price of $0.005 to its consultants and advisors. The options are exercisable for a period of five years from the date of grant, with 68,500,000 options vesting on the date of the option grant, 3,500,000 options vesting on May 31, 2024, and 3,000,000 options vesting on May 31, 2025. The following assumptions were used for the Black-Scholes valuation of stock options on grant date as follows: risk-free rate of 3.74%, expected life of 5 years, annualized historical volatility of 148.52% and a dividend rate of 0%. Expected volatilities are based on the historical volatility of the Companys stock and other factors. During the year ended September 30, 2023, stock-based compensation cost of $3,416,227 (2022 - $nil) was charged against income from options vested. Of the 68,500,000 options vested, 15,000,000 related to replacement options issued from options originally issued on September 21, 2021.\nDuring the year ended September 30, 2022, on May 30, 2022, the Company granted 77,000,000 options to purchase 77,000,000 common shares at a price of $0.025 to its consultants and advisors. The options are exercisable for a period of five years from the date of grant, with the first 50% vesting on the date of the option grant and the remaining 50% vesting on May 30, 2023. On April 24, 2023, the stock options issued on May 30, 2022 were re-priced from $0.025 to $0.005. For the incremental cost on the option modification, the following assumptions were used for the Black-Scholes valuation: risk-free rate of 3.60%, expected life of 4.1 years, annualized historical volatility of 174.16% and a dividend rate of 0%. Expected volatilities are based on the historical volatility of the Companys stock and other factors. The incremental cost that has been recorded as additional paid-in capital from the modification of these options was $105,571 (2022 - $nil). During the year ended September 30, 2023, stock-based compensation cost of $183,385 (2022 - $1,352,004) was charged against income from options vested under the Plan relating to the May 30, 2022 stock option grant.\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 11. STOCK-BASED COMPENSATION (CONTD)\nDuring the year ended September 30, 2021, on April 23, 2021, the Company granted 90,000,000 options to purchase 90,000,000 common shares at a price of $0.025 to its directors, officers, employees, consultants and advisors. The options are exercisable for a period of five years from the date of grant and are all now fully vested. On April 24, 2023, the stock options issued on April 23, 2021 were re-priced from $0.025 to $0.005. For the incremental cost on the option modification, the following assumptions were used for the Black-Scholes valuation: risk-free rate of 3.84%, expected life of 3 years, annualized historical volatility of 169.15% and a dividend rate of 0%. Expected volatilities are based on the historical volatility of the Companys stock and other factors. The incremental cost that has been recorded as additional paid-in capital from the modification of these options was $235,456 (2022 - $nil). During the year ended September 30, 2023, stock-based compensation cost of $nil (2022 - $1,003,500) was charged against income from options vested under the Plan relating to the April 23, 2021 stock option grant.\nDuring the year ended September 30, 2023, 15,000,000 stock options were replaced. For the incremental cost on the option replacement, the following assumptions were used for the Black-Scholes valuation: risk-free rate of 3.74%, expected life of 5 years, annualized historical volatility of 148.52% and a dividend rate of 0%. Expected volatilities are based on the historical volatility of the Companys stock and other factors. The incremental cost that has been recorded as additional paid-in capital from the replacement of these options was $10,561 (2022 - $nil).\nPreferred Share\nDuring the year ended September 30, 2023, 138,420 preferred shares issued pursuant to the Anti-Dilution Clause of the SPAwith a value of $138 which is recorded as stock-based compensation (2022 - 475,000 preferred shares for services with a value of $835 which is recorded as stock-based compensation).\nDuring the year ended September 30, 2023, total stock-based compensation cost of $20,076,567 (2022 - $2,356,339) was charged against income from all options issued and vested, including the incremental cost resulting from the option modifications.\nAs at September 30, 2023, the aggregate intrinsic value of the Companys stock options is $3,142,500 (2022 - $22,500), and the total intrinsic value of options exercised during the year ended September 30, 2023 was $487,500 (2022 - $nil).\nNOTE 12. OTHER ITEMS\nDuring the year ended September 30, 2023, other income included $185,000 (2022 - $nil) from gain on settlement and $59,420 (2022 - $nil) from gain on settlement of accrued payables. $185,000 was due to the Company entering into a settlement and release agreement with a party to resolve all aspects of a litigation regarding certain of VoIP-Pals patents, and $59,420 was primarily due to the Company entering into settlement agreements with vendors pursuant to which they relinquished debt owed by the Company.\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 13. INCOME TAXES\nThe Company and its subsidiary file consolidated Federal and state income tax returns. The Company is registered in the State of Nevada which has no corporate income tax.\nCertain tax years are subject to examination by the Internal Revenue Service and state taxing authorities. The Company does not believe there would be any material adjustments upon such examination.\nAs of September 30, 2023 and 2022, the Company had net operating loss carryforwards of approximately $66,435,000 and $64,731,000 respectively, to reduce Federal income tax liabilities through 2043.\nA reconciliation of income taxes at statutory rates with the reported taxes is as follows:\nSCHEDULE OF RECONCILIATION OF INCOME TAXES EXPENSES\nLoss for the year $ (23,109,009 ) $ (3,692,416 )\nExpected income tax (recovery) $ (4,852,892 ) $ 775,407\nChange in statutory, foreign tax, foreign exchange rates and other - -\nPermanent Difference 4,216,079 494,831\nChange in unrecognized deductible temporary differences 636,813 280,576\nTotal income tax expense (recovery) $ - $ -\nThe significant components of the Companys temporary differences, unused tax credits and unused tax losses that have not been included on the consolidated statement of financial position are as follows:\nSCHEDULE OF UNUSED TAX CREDIT AND TAX LOSSES\nExpiry Date Range Expiry Date Range\nIntangible assets $ 11,698,000 No expiry date $ 11,560,000 No expiry date\nNon-capital losses available for future period $ 66,435,000 2033 to 2043 $ 64,731,000 2033 to 2042\nTax attributes are subject to review, and potential adjustment, by tax authorities.\nNOTE 14. CONTINGENT LIABILITIES\nPatent Litigation\nThe Company is party to patent and patent-related litigation cases as follows:\ni. VoIP-Pal.com Inc. v. Facebook, Inc. et al. Case No. 6-20-cv-00267 in the U.S. District Court, Western District of Texas\nIn April 2020, the Company filed a lawsuit in the United States District Court, Western District of Texas, against Facebook, Inc. and certain related entities, alleging infringement of U.S. Patent No. 10,218,606. On July 22, 2022, the Western District of Texas granted Facebooks motion to transfer the case to the Northern District of California. The case number is Case No. 3:22-cv-4279-JD. On June 6, 2023, the parties stipulated to the dismissal of the case. On June 7, 2023, the court dismissed the case.\nii. VoIP-Pal.com Inc. v. Google, LLC fka Google, Inc. Case No. 6-20-cv-00269 in U.S. District Court, Western District of Texas.\nIn April 2020, the Company filed a lawsuit in the United States District Court, Western District of Texas, against Google, alleging infringement of U.S. Patent No. 10,218,606. On September 21, 2022, the Western District of Texas granted Googles motion to transfer the case to the Northern District of California. The case number is Case No. 3:22-cv-5419-JD. On June 6, 2023, the parties stipulated to the dismissal of the case. On June 7, 2023, the court dismissed the case.\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 14. CONTINGENT LIABILITIES (CONTD)\nPatent Litigation (contd)\niii. VoIP-Pal.com Inc. v. Amazon.com, Inc. et al. Case No. 6-20-cv-00272 in the U.S. District Court, Western District of Texas.\nIn April 2020, the Company filed a lawsuit in the United States District Court, Western District of Texas, against Amazon.com, Inc. and certain related entities, alleging infringement of U.S. Patent No. 10,218,606. The case is pending.\niv. VoIP-Pal.com, Inc. v. Facebook, Inc. et al Case No. 6-21-cv-665 in the United States District Court, Western District of Texas\nOn September 25, 2021, the Company filed a lawsuit in the US District Court, Western District of Texas, against Facebook, Inc. and WhatsApp, Inc. alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. On May 31, 2022, the Western District of Texas court granted Facebook and WhatsApps motion to transfer the case to the Northern District of California. The case number is Case No. 3:22-cv-3202-JD. On June 6, 2023, the parties stipulated to the dismissal of the case. On June 7, 2023, the court dismissed the case.\nv. VoIP-Pal.com, Inc. v. Google, LLC Case No. 6-21-cv-667 in the United States District Court, Western District of Texas\nOn September 25, 2021, the Company filed a lawsuit in the US District Court, Western District of Texas, against Google LLC alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. On May 31, 2022, the Western District of Texas granted Googles motion to transfer the case to the Northern District of California. The case number is Case No. 3:22-cv-3199-JD. On June 6, 2023, the parties stipulated to the dismissal of the case. On June 7, 2023, the court dismissed the case.\nvi. VoIP-Pal.com, Inc. v. Amazon.com, Inc. et al. Case No. 6-21-cv-668 in the U.S. District Court, Western District of Texas\nOn September 25, 2021, the Company filed a lawsuit in the U.S. District Court, Western District of Texas, against Amazon and related entities alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. On June 26, 2023, the parties stipulated to the dismissal of the case. On June 29, 2023, the court closed the case.\nvii. VoIP-Pal.com, Inc. v. Verizon Comms., Inc. Case No. 6-21-cv-672 in the U.S. District Court, Western District of Texas\nOn September 25, 2021, the Company filed a lawsuit in the U.S. District Court, Western District of Texas, against Verizon and related entities alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. The case is pending.\nviii. VoIP-Pal.com, Inc. v. T-Mobile US, Inc. et al. Case No. 6-21-cv-668 in the U.S. District Court, Western District of Texas\nOn September 25, 2021, the Company filed a lawsuit in the U.S. District Court, Western District of Texas, against T-Mobile and related entities alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. The case is pending.\nix. VoIP-Pal.com Inc v Samsung Electronics Co. et al Case No. 6-21-cv-1246 in U.S. District Court, Western District of Texas\nOn November 30, 2021, the Company filed a lawsuit in the U.S. District Court, Western District of Texas, against Samsung & related entities alleging infringement of U.S. Patent Nos. 8,630,234 & 10,880,721. On June 21, 2023, the parties stipulated to the dismissal of the case and the court closed the case.\nx. VoIP-Pal.com Inc v Huawei Technologies Co, Ltd. et al Case No. 6-21-cv-1247 in US District Court, Western District of Texas\nOn November 30, 2021, the Company filed a lawsuit in the U.S. District Court, Western District of Texas, against Huawei and related entities alleging infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. On January 18, 2023, the Western District of Texas granted Huaweis motion to transfer the case to the Northern District of Texas. The case no. is 3:23-cv-00151. The case is pending.\nxi. Twitter, Inc. v. VoIP-Pal.com Inc. Case No. 3:21-cv-9773 in the U.S. District Court, Northern District of California\nOn December 17, 2021, Twitter filed a declaratory judgment lawsuit against the Company in the United States District Court, Northern District of California, alleging non-infringement of U.S. Patent Nos. 8,630,234 and 10,880,721. On June 6, 2023, the parties stipulated to the dismissal of the case. On June 7, 2023, the court dismissed the case.\nVOIP-PAL.COM INC.\nNotes to the Consolidated Financial Statements\n(Expressed in United States Dollars)\nSeptember 30, 2023\nNOTE 14. CONTINGENT LIABILITIES (CONTD)\nNon-Patent Litigation\nThe Company is party to non-patent litigation cases as follows:\nLocksmith Financial Corporation, Inc. et al. (Plaintiff(s)) v VoIP-Pal.com Inc. et al (Defendant(s)) (Case No A-20-807745-C) filed in Clark County District Court.\nOn January 1, 2020, the Plaintiffs filed suit in Nevada District Court claiming that they were owed 95,832,000 Voip-Pal common shares from a previous case involving the Plaintiff and the Defendant that had been through a jury trial in 2019, in which the jury had made an award to the Plaintiff that was monetary only, and did not include said shares - following the jurys decision in the 2019 trial, the Plaintiff accepted the award and waived their right to appeal. Voip-Pal vigorously disputed the Plaintiffs 2020 claims on the basis of claim preclusion (the 2020 claims were addressed in the previous action in 2019 and are now precluded); that Plaintiffs claims are untimely, and that the Plaintiffs no longer have standing to bring their claims.\nDuring the year ended September 30, 2022, the Court entered a judgment in favor of VoIP-Pal.com Inc and co-defendants, dismissing the 2020 case. The Plaintiffs filed an appeal with the Nevada Supreme Court.\nDuring the year ended September 30, 2023, following a hearing of the appeal, the Nevada Supreme Court ruled to reverse the lower courts judgment and remanded the case back to the lower court for further proceedings. The Defendants (Voip-Pal et al) filed a motion to the Supreme Court for reconsideration, however that motion was denied, and a trial date was set for November 28, 2023.\nSubsequent to the year ended September 30, 2023,on November 30, 2023, after the completion of trial, the Eighth Judicial District Court for the State of Nevada rendered its decision in favor of VoIP-Pal upon all claims in the case, ruling that the Plaintiffs had not met their burden of proof with respect to any of its claims against VoIP-Pal et al, awarding no damages to Locksmith and specifically ruling that Locksmith take nothing as a result of the litigation. The case is now closed.\nPerformance Bonus Payable\nIn 2016, the board of directors authorized the Company to provide a performance bonus (the Performance Bonus) of up to 3% of the capital stock of the Company by way of the issuance of Common shares from its treasury to an as yet undetermined group of related and non-related parties upon the occurrence of a bonusable event, defined as the successful completion of a sale of the Company or substantially all its assets, or a major licensing transaction. In order to provide maximum flexibility to the Company with respect to determining the level of Performance Bonus payable, and who may qualify to receive a pro-rata share of such a Performance Bonus, the Company authorized full discretion to the Board in making such determinations.\nIn 2019, the board of directors authorized the increase of the Performance Bonus to up to 10% of the capital stock of the Company, and also authorized 66.67% of the Performance Bonus to be issued in an advance payment of an aggregate 127,000,000 Common shares (Bonus Shares) to members of management, a director and several consultants. 30,000,000 of the issued Bonus Shares continue to be restricted from trading under Rule 144 and subject to a voluntary lock-up agreement under which they cannot be traded, transferred, pledged or sold by the holders until such time as the Company has met the requirements of the bonusable event as described above.\nAs at September 30, 2023 and 2022, no bonusable event has occurred and there was no Performance Bonus payable. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nThere have been no changes in or disagreements with accountants on accounting or financial disclosure matters. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nManagement conducted an evaluation of the effectiveness of the Companys internal control over financial reporting as of September 30, 2023. In making this assessment, management used the criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission, or COSO. The COSO framework summarizes each of the components of a companys internal control system, including (i) the control environment, (ii) risk assessment, (iii) control activities, (iv) information and communication, and (v) monitoring. In managements assessment of the effectiveness of internal control over financial reporting (as defined in Exchange Act Rule 13a-15(f)) as required by Exchange Act Rule 13a-15(c), our management concluded as of the end of the fiscal year covered by this Annual Report on Form 10-K that our internal control over financial reporting has not been completely efficient. The Company intends to address this deficiency in internal controls as soon as possible.\nAs defined by Auditing Standard No. 5, An Audit of Internal Control Over Financial Reporting that is Integrated with an Audit of Financial Statements and Related Independence Rule and Conforming Amendments, established by the Public Company Accounting Oversight Board (PCAOB), a material weakness is a deficiency or combination of deficiencies that results more than a remote likelihood that a material misstatement of annual or interim financial statements will not be prevented or detected. In connection with the assessment described above, management identified the following control deficiencies that represent material weaknesses as of September 30, 2023:\n1) Lack of segregation of duties. Now, our resources and size prevent us from being able to employ sufficient resources to enable us to have adequate segregation of duties within our internal control system. Management will periodically reevaluate this situation.\n2) Lack of an independent audit committee. Although the Board of Directors has an audit committee it is not comprised solely of independent directors. We may establish an audit committee comprised solely of independent directors when we have sufficient capital resources and working capital to attract qualified independent directors and to maintain such a committee.\n3) Insufficient number of independent directors. Now, our Board of Directors does not consist of a majority of independent directors, a factor that is counter to corporate governance practices as set forth by the rules of various stock exchanges.\n4) Insufficient period-end balance sheet reconciliations and review of journal entries. Due to our size, we have insufficient accounting staff resources to review accounting entries on a timely basis. Management will periodically reevaluate this situation.\n5) No formal codes of conduct. Due to our management remote working in different locations, we can not ensure that our management involve in day-to-day operations and regular communications of ethical and appropriate behavior.\nA deficiency in internal control exists when the design or operation of a control does not allow management or employees, in the normal course of performing their assigned functions, to prevent, or detect and correct misstatements on a timely basis. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the entitys annual or interim financial statements will not be prevented, or detected and corrected on a timely basis.\nOur management determined that if these deficiencies persist they could constitute material weaknesses. Due to a lack of financial resources, we are not able to immediately take any action to remediate these potential material weaknesses. We will not be able to do so until we acquire sufficient financing to do so. We will implement further controls as circumstances, cash flow, and working capital permit. Notwithstanding the assessment that our ICFR was not entirely efficient and that there were potential material weaknesses as identified in this report, we believe that our financial statements fairly present our financial position, results of operations and cash flows for the years covered thereby in all material respects.\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under the Exchange Act are recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed in our reports filed under the Exchange Act is accumulated and communicated to management, including our Chief Executive Officer, to allow timely decisions regarding required disclosure.\nLimitations on the Effectiveness of Internal Controls\nOur management does not expect that our disclosure controls and procedures or our internal control over financial reporting will necessarily prevent all fraud and material error. Our disclosure controls and procedures are designed to provide reasonable assurance of achieving our objectives and our Chief Executive Officer concluded that our disclosure controls and procedures are effective at that reasonable assurance level. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the internal control. The design of any system of controls also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Over time, control may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal controls over financial reporting during the year ended September 30, 2023 that have materially affected or are reasonably likely to materially affect such controls. Item 9B. Other Information.\nNot Applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe following table sets forth the names and ages of our current directors and executive officers, the principal offices and positions with us held by each person and the date of their appointment. Our executive officers were appointed by our Board of Directors. Our directors serve until the earlier occurrence of the election of his or her successor at the next meeting of stockholders, death, resignation or removal by the Board of Directors. There are no family relationships among our directors and executive officers.\nName\nAge\nPosition\nYear Appointed\nEmil Malak (1)\nDirector, Chief Executive Officer, President\nJin Kuang\nChief Financial Officer\nKevin Williams\nDirector, Former Chief Financial Officer\nDennis Chang\nIndependent Director\nClifton Saylor\nIndependent Director\nSet forth below is a brief description of the background and recent business experience of each executive officer and director:\n- Emil Malak was the co-founder of Digifonica in 2003 and oversaw the development of the patents acquired by the Company in 2013. Mr. Malak also serves as Chairman of the Board for a biotech company currently conducting cancer research in Germany.\n- Jin Kuang has over 15 years of extensive professional expertise in various financial domains gained across the USA and Canada. She has also spent over a decade in progressively responsible financial leadership roles within publicly traded companies. Over the years, Jin has served as CFO for multiple publicly listed companies, in addition to her years of auditing experience with KPMG LLP Chartered Accounts.\n- Kevin Williams is an experienced financial consultant with over 30 years of business expertise in the banking, brokerage, energy, and aerospace industries. He has an extensive history in funding start-ups, corporate accounting and compliance for both private and publicly traded companies.\n- Dennis Chang is a former Management Consultant with over twenty years of experience. He is the founder of a computer manufacturing company in the Silicon Valley area and built it to $100+ Million in sales in the 1980s, serving as its President and CEO. He was included in the 100 Most Influential People in the Microcomputer Industry by MicroTimes Magazine in 1988.\n- Clifton Saylor is a successful entrepreneur and business owner and a long-time shareholder of VoIP-Pal. Item 11. Executive Compensation.\nName and Principal Position\nYear\nSalary ($)\nBonus ($)\nShares Awarded\nPrice per Share ($) Award Value ($) Option Awards ($) All Other Compensation ($)\nTotal ($)\nEmil Malak(1) 5,557 - - - - - 12,161 (1) 17,718\nCEO, President, Director 20,820 - - - - - 835 (1) 21,655\nJin Kuang(2) 15,000 - - - - - - 15,000\nCFO - - - - - - - -\nKevin Williams(3) 18,000 - - - - - - 18,000\nFormer CFO, Director 18,000 - - - - - - 18,000\nRyan L. Thomas(4) Nil - - - - - - Nil\nDirector Nil - - - - - - Nil\nDennis Chang(3) 49,500 - - - - - - 49,500\nDirector 34,600 - - - - - - 34,600\nClifton Saylor(5) Nil - - - - - - Nil\nDirector Nil - - - - - - Nil\n(1) Emil Malak received 121,611 Series A Preferred shares with an aggregate value of $12,161 for services during the year ended September 30, 2023 and received 475,000 Series A Preferred shares with an aggregate value of $835 for services during the year ended September 30, 2022.\n(2) Jin Kuang was appointed as CFO in July 2023.\n(3) Kevin Williams and Dennis Chang were appointed as directors in March 2021. Kevin Williams resigned as a CFO in July 2023.\n(4) Ryan Thomas resigned as a director in June 2022.\n(5) Clifton Saylor was appointed to the board of directors in July 2022. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth certain ownership information with respect to our common stock for those persons who directly or indirectly own, control or hold, with the power to vote five percent or more of our outstanding common stock, and all officers and directors, as a group.\nName of\nBeneficial Owner\nAmount of Direct Ownership Amount of Indirect Ownership Percent of Class\nEmil Malak Nil Nil 0.00 %\nJin Kuang Nil Nil 0.00 %\nKevin Williams 4,691,358 Nil 0.02 %\nDennis Chang 4,691,358 Nil 0.02 %\nClifton Saylor 2,345,679 87,333,334 (1) 2.97 %\n(1) These shares are owned by Saylor Marketing, Inc. Profit Sharing Plan, of which Mr. Saylor is the trustee. Item 13. Certain Relationships and Related Transactions.\nRelated Party Transactions\nDuring the year ended September 30, 2023, the Company paid cash of $83,057 (2022 - $55,655), and issued preferred shares of $12,161 (2022 - $835) for key management compensation totaling $100,218 (2022 - $74,255), as shown in the above table included in item 11. During the year ended September 30, 2023. $10,866,260 (2022 - $446,835) stock-based compensation expenses were incurred from options and warrants granted to directors and officers. At September 30, 2023, included in accounts payable and accrued liabilities is $5,000 (September 30, 2022 - $8,100) owed to current officers and directors.\nAt September 30, 2023, included in prepaid expense is $6,000 (September 30, 2022 - $Nil) of prepaid compensation to a director.\nDuring the year ended September 30, 2023, a director of the Company forgave $2,100 (2022 - $Nil) of accrued director fees.\nDirector Independence\nWe are not subject to the listing requirements of any national securities exchange or national securities association and, as a result, we are not at this time required to have our Board comprised of a majority of independent directors. Two of our four directors (see Item 10 above) are independent as defined under the Nasdaq Marketplace Rules. Item 14. Principal Accounting Fees and Services.\nAudit Fees and Services\nFor the fiscal year ended September 30, 2023 professional services were performed by Davidson & Company LLP, Chartered Professional Accountants. The aggregate fees billed by Davidson & Company LLP, Chartered Professional Accountants for the fiscal year ended September 30, 2023 were as follows:\n2022 to 2023\nAudit Fees $ 48,586 CAD\nAudit-Related Fees $ 25,305 CAD\nTax Fees $ Nil\nAll Other Fees $ Nil\nAudit Fees: Aggregate fees billed for professional services rendered for the audit of the Companys annual financial statements.\nAudit Related Fees: Aggregate fees billed for professional services rendered for assurance and related services that were reasonably related to the performance of the audit or review of our financial statements and are not reported under Audit Fees above.\nAll services listed were pre-approved by the Board of Directors, functioning as the Audit Committee in accordance with Section 2(a) 3 of the Sarbanes-Oxley Act of 2002.\nThe Board has considered whether the services described above are compatible with maintaining the independent accountants independence and has determined that such services have not adversely affected Davidson & Company LLPs independence. Item 15. Financial Statements and Exhibits.\n(a) Financial Statements. Our financial statements begin on page 16 of this report.\n(b) Exhibits. The following are furnished as exhibits hereto:\nExhibit No.\nDescription of Exhibits\n3.1\nArticles of Incorporation (Incorporated by reference to the Form 10 filed on April 22, 2016)\n3.2\nBy-Laws (Incorporated by reference to the Form 10 filed on April 22, 2016)\n10.1\nDigifonica Share Purchase Agreement (Incorporated by reference to the Form 10 filed on June 14, 2016)\n10.2\nIncentive Stock Option Plan (Incorporated by reference to the Form 10 filed on January 12, 2018)\n31.1\nCertification of Chief Executive Officer pursuant to Securities Exchange Act Rule 13a-14(a)/15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002*\n31.2\nCertification of Chief Financial Officer pursuant to Securities Exchange Act Rule 13a-14(a)/15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002*\n32.1\nCertification by the Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002*\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed herewith\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nVoIP-Pal.Com Inc.\nDate: December 22, 2023 By:\n/s/ Emil Malak\nEmil Malak\nChief Executive Officer\nDate: December 22, 2023 By:\n/s/ Jin Kuang\nJin Kuang\nChief Financial Officer"
}