{
    "cik": "1415744",
    "company": "NORTHERN MINERALS & EXPLORATION LTD.",
    "filing_type": "10-K",
    "filing_date": "2022-10-31",
    "period_of_report": "2022-07-31",
    "sic": "1040",
    "state_of_inc": "NV",
    "state_location": "TX",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1415744/0001654954-22-014390-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1415744/000165495422014390/ndm_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1415744/0001654954-22-014390.txt",
    "filename": "1415744_10K_2022_0001654954-22-014390.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\nForward-Looking Statements\nCertain statements, other than purely historical information, including estimates, projections, statements relating to our business plans, objectives, and expected operating results, and the assumptions upon which those statements are based, are forward-looking statements. These forward-looking statements generally are identified by the words believes, project, expects, anticipates, estimates, intends, strategy, plan, may, will, would, will be, will continue, will likely result, and similar expressions. Forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties which may cause actual results to differ materially from the forward-looking statements. Our ability to predict results or the actual effect of future plans or strategies is inherently uncertain. Factors which could have a material adverse effect on our operations and future prospects include, but are not limited to: changes in economic conditions, legislative/regulatory changes, availability of capital, interest rates, competition, and generally accepted accounting principles. These risks and uncertainties should also be considered in evaluating forward-looking statements and undue reliance should not be placed on such statements.\nOur Corporate History and Background\nWe were incorporated on December 11, 2006, under the laws of the State of Nevada.\nWe were originally a company involved in the placing of strength testing amusement gaming machines called Boxers in venues such as bars, pubs and nightclubs in the Seattle area, in the State of Washington. We acquired one Boxer that had been placed in Lynnwood, Washington. However, the machine was de-commissioned as it needed material repairs. We were not able to secure sufficient capital for these repairs and our management decided to change our business focus to oil and gas and mineral exploration. On July 12, 2013, the stockholders approved an amendment to change the name of the Company from Punchline Resources Ltd. to Northern Mineral & Exploration Ltd. FINRA approved the name change on August 13, 2013.\nNorthern Minerals & Exploration Ltd. (the Company) is an emerging natural resource company operating in oil and gas production in central Texas and exploration for gold and silver in northern Nevada.\nOn November 22, 2017, the Company created a wholly owned subsidiary, Kathis Energy LLC (Kathis), a duly formed Limited Liability Company formed in the State of Texas, for the purpose of conducting oil and gas drilling programs in Texas.\nOn December 14, 2017, Kathis Energy, LLC and other Limited Partners, created Kathis Energy Fund 1, LP, a duly formed Limited Partnership formed in the State of Texas, created for the purpose of raising funds from investors for its drilling projects. There was no activity with Kathis Energy, LLC during 2021 fiscal year.\nOn May 7, 2018, the Company created a wholly owned subsidiary, ENMEX Operations LLC (ENMEX), a duly formed Limited Liability Company in the State of Quintana Roo, Mexico for the purpose of conducting business in Mexico in prospective real estate development projects. There has been no activity from inception to date.\nCurrent Business\nRefer to NOTE 4 and NOTE 5 for property information.\nOil & Gas Sector\nCompetition\nThe petroleum industry is highly competitive. Many of the oil and gas exploration companies with whom we compete have greater financial and technical resources than we do. Accordingly, these competitors may be able to spend greater amounts on acquisitions of properties of merit and on exploration. In addition, they may be able to afford greater geological expertise in the targeting and exploration of resource properties. This competition could result in our competitors having resource properties of greater quality and interest to prospective investors who may finance additional exploration, and to senior exploration companies that may purchase resource properties or enter into joint venture agreements with junior exploration companies. This competition could adversely impact our ability to finance property acquisitions and further exploration.\nWe compete with other exploration and early stage operating companies for financing from a limited number of investors prepared to make investments in junior companies exploring for conventional and unconventional oil and gas resources. The presence of competing oil and gas exploration companies, both major and independent, may impact our ability to raise additional capital in order to fund our exploration programs if investors are of the view that investments in competitors are more attractive based on the merit of the properties under investigation, and the price of the investment offered to investors.\nGovernmental Regulation\nOur business is affected by numerous laws and regulations, including energy, environmental, conservation, tax and other laws and regulations relating to the oil and natural gas industry. We have developed internal procedures and policies to ensure that our operations are conducted in full and substantial environmental regulatory compliance.\nFailure to comply with any laws and regulations may result in the assessment of administrative, civil and/or criminal penalties, the imposition of injunctive relief or both. Moreover, changes in any of these laws and regulations could have a material adverse effect on business. In view of the many uncertainties with respect to current and future laws and regulations, including their applicability to us, we cannot predict the overall effect of such laws and regulations on our future operations.\nWe believe that our operations comply in all material respects with applicable laws and regulations and that the existence and enforcement of such laws and regulations have no more restrictive an effect on our operations than on other similar companies in the oil and natural gas industry.\nPricing and Marketing of Natural Gas\nIn the US, historically, the sale of natural gas in interstate commerce has been regulated pursuant to the Natural Gas Act of 1938, or the NGA, the Natural Gas Policy Act of 1978, or the NGPA, and regulations promulgated thereunder by the Federal Energy Regulatory Commission, or the FERC. In 1989, Congress enacted the Natural Gas Wellhead Decontrol Act, or the Decontrol Act. The Decontrol Act removed all NGA and NGPA price and non-price controls affecting wellhead sales of natural gas effective January 1, 1993 and sales by producers of natural gas are uncontrolled and can be made at market prices. The natural gas industry historically has been heavily regulated and from time to time proposals are introduced by Congress and the FERC and judicial decisions are rendered that impact the conduct of business in the natural gas industry. We cannot assure you that the less stringent regulatory approach recently pursued by the FERC and Congress will continue.\nPricing and Marketing of Oil\nIn the US, sales of crude oil, condensate and natural gas liquids are not regulated and are made at negotiated prices. Effective January 1, 1995, the FERC implemented regulations establishing an indexing system for transportation rates for oil that allowed for an increase in the cost of transporting oil to the purchaser.\nEnvironmental\nLike the oil and natural gas industry in general, our properties are subject to extensive and changing federal, state and local laws and regulations designed to protect and preserve natural resources and the environment. The recent trend in environmental legislation and regulation in the oil and natural gas industry is generally toward stricter standards, and this trend is likely to continue. These laws and regulations often require a permit or other authorization before construction or drilling commences and for certain other activities; limit or prohibit access, especially in wilderness areas with endangered or threatened plant or animal species; impose restrictions on construction, drilling and other exploration and production activities; regulate air emissions, wastewater and other production and waste streams from our operations; impose substantial liabilities for pollution that may result from our operations; and require the reclamation of certain lands.\nThe permits required for many of our operations are subject to revocation, modification and renewal by issuing authorities. Governmental authorities have the power to enforce compliance with their regulations, and violations are subject to fines, compliance orders, and other enforcement actions. We are not aware of any material noncompliance with current applicable environmental laws and regulations, and we have no material commitments for capital expenditures to comply with existing environmental requirements, however, given the complex regulatory requirements applicable to our operations, and the rapidly changing nature of environmental laws in our industry, we cannot predict our future exposure concerning such matters, and our future costs to achieve compliance, or remedy potential violations, could be significant. Our operations require permits and are regulated under environmental laws, and current or future noncompliance with such laws, as well as changes to existing laws or interpretations thereof, could have a significant impact on us, as well as the oil and natural gas industry in general.\nWaste Disposal and Contamination Issues\nThe federal Comprehensive Environmental Response, Compensation and Liability Act and comparable state laws may impose strict and joint and several liability on owners and operators of contaminated sites and on persons who disposed of or arranged for the disposal of hazardous substances found at such sites. Under these and other laws, the government, neighboring landowners and other third parties may recover the costs of responding to soil and groundwater contamination and threatened releases of hazardous substances, and seek recovery for related natural resources damages, personal injury and property damage. Some of our properties have been used for exploration and production activities for a number of years by third parties, and such properties could result in unknown cleanup liabilities for us.\nThe federal Resource Conservation and Recovery Act (the \"RCRA\") and comparable state statutes govern the management, storage, treatment and disposal of solid waste and hazardous waste and authorize imposition of substantial fines and penalties for noncompliance. Although RCRA classifies certain oil field wastes as \"non-hazardous\" (for example, the waters produced from hydraulic fracturing operations), such wastes could be reclassified as hazardous wastes in the future, thereby making them subject to more stringent handling and disposal requirements which could have a material impact on us.\nWater Regulation\nThe federal Clean Water Act (the \"CWA\"), the federal Safe Drinking Water Act (the \"SWDA\") and analogous state laws restrict the discharge of wastewater and other pollutants into surface waters or underground wells and the construction of facilities in wetland areas without a permit. Federal regulations also require certain owners or operators of facilities that store or otherwise handle oil, such as us, to prepare and implement spill prevention, control countermeasure and response plans relating to the possible discharge of oil into surface waters. In addition, the Oil Pollution Act (the \"OPA\") contains numerous requirements relating to the prevention of and response to oil spills into waters of the United States. For onshore and offshore facilities that may affect waters of the United States, the OPA requires an operator to demonstrate financial responsibility. Regulations are currently being developed or considered under federal and state laws concerning oil pollution prevention and other matters that may impose additional regulatory burdens on us.\nThese and similar state laws also govern the management and disposal of produced waters from the extraction process. Currently, wastewater associated with oil and natural gas production is prohibited from being directly discharged to waterways and other waters of the U.S. While some of the wastewater is reused or re-injected, a significant amount still requires proper disposal. As a result, some wastewater is transported to third-party treatment plants. In October 2011, citing concerns that third-party treatment plants may not be properly equipped to handle wastewater from shale gas operations, the United States Environmental Protection Agency (the \"EPA\") announced that it will consider federal pre-treatment standards for these wastewaters. We cannot predict the EPA's future actions in this regard, but future regulation of our produced waters or other waste streams could have a material impact on us.\nAir Emissions and Climate Change\nThe federal Clean Air Act (\"CAA\") imposes permit requirements and operational restrictions on certain sources of emissions used in our operations. In July 2011, the EPA published proposed New Source Performance Standards (\"NSPS\") and National Emissions Standards for Hazardous Air Pollutants (\"NESHAPs\") that would, if adopted, amend existing NSPS and NESHAP standards for oil and natural gas facilities and create new NSPS standards for oil and natural gas production, transmission and distribution facilities. Importantly, these standards would include standards for hydraulically fractured wells. The standards would apply to newly drilled and fractured wells as well as existing wells that are refractured. A court has directed the EPA to issue final rules by April 1, 2012. In a report issued in late 2011, the Shale Gas Production Subcommittee of the Department of Energy (the \"DOE Shale Gas Subcommittee\") called on the EPA to complete the rulemaking quickly and recommended expanding the shale gas emission sources to be covered by the new rules. The DOE Shale Gas Subcommittee also encouraged states to take similar action, and included several other recommendations for studying and reducing air emissions from shale gas production activities. Because the EPA's regulations have not yet been finalized, we cannot at this time predict the impact they may have on our financial condition or results of operation.\nThe issue of climate change has received increasing regulatory attention in recent years. The EPA has issued regulations governing carbon dioxide, methane and other greenhouse gas (\"GHG\") emissions citing its authority under the CAA Several of these regulations have been challenged in litigation that is currently pending before the federal D.C. Circuit Court of Appeals. In December 2011, the EPA issued amendments to a final rule issued in 2010 requiring reporting of GHG emissions from the oil and natural gas industry. Under this rule, we are obligated to report to the EPA certain GHG emissions from our operations. We do not expect that the costs of this new reporting will be material to us. In a late 2011 report, the DOE Shale Gas Subcommittee recommended that the EPA expand reporting requirements for GHG emissions from shale gas emission sources and include methane in reporting requirements. More generally, several proposals to regulate GHG emissions have been proposed in the U.S. Congress, and various states have taken steps to regulate GHG emissions. The adoption and implementation of regulations or legislation imposing restrictions or other regulatory obligations on emissions of GHGs from oil and natural gas operations could require us to obtain permits or allowances for our GHG emissions, install new pollution controls, increase our operational costs, limit our operations or adversely affect demand for the oil and natural gas produced from our lands.\nResearch and Development Expenditures\nWe have not incurred any research and development expenditures over the past two fiscal years.\nEmployees\nAs of July 31, 2022, we do not have any employees. Our three officers, Ivan Webb, Noel Schaefer and Rachel Boulds act as consultants.\nWe engage contractors from time to time to consult with us on specific corporate affairs or to perform specific tasks in connection with our exploration programs. ITEM 1A. RISK FACTORS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and, as such, are not required to provide the information under this Item. Item 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nOur principal executive offices are located at 881 West State Road, Pleasant Grove, UT. ITEM 3. LEGAL PROCEEDINGS\nWe know of no material, existing or pending legal proceedings against us, nor are we involved as a plaintiff in any material proceeding or pending litigation. There are no proceedings in which any of our directors, officers or affiliates, or any registered or beneficial shareholder, is an adverse party or has a material interest adverse to our company. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock is quoted under the symbol NMEX on the OTCPINK operated by the Financial Industry Regulatory Authority, Inc. (FINRA) and the OTCQB operated by OTC Markets Group, Inc. Few market makers continue to participate in the OTCBB system because of high fees charged by FINRA. The criteria for listing on either the OTCBB or OTCQB are similar and include that we remain current in our SEC reporting.\nOur shares are subject to Section 15(g) and Rule 15g-9 of the Securities and Exchange Act, commonly referred to as the penny stock rule. The rule defines penny stock to be any equity security that has a market price less than $5.00 per share, subject to certain exceptions. These rules may restrict the ability of broker-dealers to trade or maintain a market in our common stock and may affect the ability of shareholders to sell their shares. Broker-dealers who sell penny stocks to persons other than established customers and accredited investors must make a special suitability determination for the purchase of the security. Accredited investors, in general, include individuals with assets in excess of $1,000,000 (not including their personal residence) or annual income exceeding $200,000 or $300,000 together with their spouse, and certain institutional investors. The rules require the broker-dealer to receive the purchasers written consent to the transaction prior to the purchase and require the broker-dealer to deliver a risk disclosure document relating to the penny stock prior to the first transaction. A broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative, and current quotations for the security. Finally, monthly statements must be sent to customers disclosing recent price information for the penny stocks.\nOn October 6, 2022, there were approximately 91 holders of record of our common stock, although there may be other persons who are beneficial owners of our common stock held in street name. The transfer agent and registrar for our common stock is Issuer Direct Corporation, 1981 Murray Holiday Road, #100, Salt Lake City, UT 84117.\nDividend Policy\nWe have never paid any cash dividends and intend, for the foreseeable future, to retain any future earnings for the development of our business. Our Board of Directors will determine our future dividend policy on the basis of various factors, including our results of operations, financial condition, capital requirements and investment opportunities.\nRECENT ISSUANCES OF UNREGISTERED SECURITIES\nDuring the fourth quarter, the Company sold 333,334 shares of common stock at $0.03 per share for total cash proceeds of $10,000.\nDuring the fourth quarter, the Company issued 200,000 shares of common stock in conversion of a $5,000 note payable. The shares were value at $0.03, the closing stock price on the date of grant.\nDuring the fourth quarter, the Company sold 833,333 shares of common stock to Mr. Miranda at $0.03 per share for total cash proceeds of $25,000.\nOn July 27, 2022, Mr. Webb assumed the obligation to pay $23,175 of accrued liabilities previously incurred on one of the Companys prior projects. The Company then agreed to convert the amount into 579,350 shares of common stock.\nOther than as disclosed above, we did not sell any equity securities which were not registered under the Securities Act during the year ended July 31, 2022 that were not otherwise disclosed on our quarterly reports on Form 10-Q or our current reports on Form 8-K filed during the year ended July 31, 2022.\nISSUER REPURCHASES OF EQUITY SECURITIES\nNone ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nResults of Operations for the Years Ended July 31, 2022 and 2021\nRevenue\nWe did not recognize any revenue for the years ended July 31, 2022 and 2021.\nOfficer compensation\nOfficer compensation was $26,400 and $26,400 for the years ended July 31, 2022 and 2021, respectively, We incur monthly compensation expense of $2,200 for our CFO.\nConsulting - related party\nConsulting - related party services were $65,000 and $60,000 for the years ended July 31, 2022 and 2021. Fees are paid to Noel Schaefer, Director, but are billed as consulting fees.\nConsulting expense\nConsulting fees were $0 and $8,000 for the years ended July 31, 2022 and 2021, respectively. When needed the Company hires experts in the mining, oil and gas industries to assist with its current projects. With no active projects in the current year, we did not hire any outside consultants.\nProfessional fees\nProfessional fees were $35,615 and $49,566 for the years ended July 31, 2022 and 2021, respectively, a decrease of $13,951, or 28%. Professional fees generally consist of legal, audit and accounting expense. In the current year our audit and legal fees decreased $9,000 and $4,951, respectively.\nMineral property expenditures\nMineral property expenditures were $0 and $1,000 for the years ended July 31, 2022 and 2021, respectively. The decrease in in the current period can be attributed to a decrease in expenditures while the Company pursues additional funding.\nGeneral and administrative\nGeneral and administrative expense was $25,487 and $32,944 for the years ended July 31, 2022 and 2021, respectively, a decrease of $7,457 or 23%. In the prior year we recognized $10,000 of bad debt expense that we did not incur in the current year. This decrease was offset with increases in travel and office expense in the current period.\nOther expense\nDuring the year ended July 31, 2022, we had total other income of $3,219 compared to a loss of $65,058 in the prior year. During the current year we incurred interest expense of $15,235, and a loss on debt conversion of $1,000, which was offset with a gain on forgiveness of debt of $17,167, and other income of $2,287. During the prior year we incurred interest expense of $93,017, which included a $72,631 expense for the issuance of warrants on a loan conversion, a loss on the impairment of oil rights of $28,800 and a loss on debt conversion of $6,857, which was offset with a gain on forgiveness of debt of $38,616, and other income of $25,000.\nNet Loss\nFor the year ended July 31, 2022, we had a net loss of $149,283 as compared to a net loss of $242,968 for year ended July 31, 2021. Our net loss in the current year decreased mainly due to the expense incurred for the issuance of warrants in the prior year.\nLiquidity and Financial Condition\nOperating Activities\nCash used by operating activities was $165,704 for the year ended July 31, 2022 compared to cash used for operating activities of $168,873 for the year ended July 31, 2021.\nInvesting Activities\nWe used $0 for investing activities for the years ended July 31, 2022 and 2021.\nFinancing Activities\nNet cash provided by financing activities was $190,550 for year ended July 31, 2022 compared to $163,000 for the year ended July 31, 2021. During the year ended July 31, 2022, we received $220,550 from the sale of common stock. We also received $5,000 from a loan payable and repaid $15,000. During the year ended July 31, 2021, we received $163,000 from the sale of common stock.\nWe had the following loans outstanding as of July 31, 2022:\nOn April 16, 2017, the Company executed a promissory note for $15,000 with a third party. The note matures in two years and interest is set at $3,000 for the full two years. As of July 31, 2022, there is $15,000 and $6,375 of principal and accrued interest, respectively, due on this loan. As of July 31, 2021, there was $15,000 and $4,875 of principal and accrued interest, respectively, due on this loan. This loan is currently in default.\nOn June 11, 2020, a third party loaned the Company $14,000. On March 3, 2021, the party loaned another $5,000 to the Company. During the year ended July 31, 2022, the Company repaid $15,000 of the loan. The loan is unsecured, non-interest bearing and due on demand. As of July 31, 2022, there is a balance due of $4,000.\nDuring the year ended July 31, 2020, a third party loaned the Company $60,000. The loan is unsecured, bears interest at 8% per annum and matures on September 1, 2021. As of July 31, 2022, there is $13,585 of interest accrued on this note. This note is in default.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to stockholders.\nCritical Accounting Policies\nRefer to Note 2 of our financial statements contained elsewhere in this Form 10-K for a summary of our critical accounting policies and recently adopting and issued accounting standards. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nSmaller reporting companies are not required to provide the information required by this Item. ITEM 8. CONSOLIDATED FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nNORTHERN MINERALS & EXPLORATION LTD.\nCONSOLIDATED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of July 31, 2022 and 2021\nConsolidated Statements of Operations for the Years ended July 31, 2022 and 2021\nConsolidated Statement of Changes in Stockholders Equity (Deficit) for the Years ended July 31, 2022 and 2021\nConsolidated Statements of Cash Flows for the Years ended July 31, 2022 and 2021\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Northern Minerals & Exploration, LTD.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Northern Minerals & Exploration, LTD. (the Company) as of July 31, 2022 and 2021, and the related consolidated statements of operations, stockholders equity (deficit), and cash flows for each of the years in the two-year period ended July 31, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended July 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nConsideration of the Companys Ability to Continue as a Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As shown in the accompanying consolidated financial statements, the Company has significant net losses, cash flow deficiencies, negative working capital and an accumulated deficit. Those conditions raise substantial doubt about the Companys ability to continue as a going concern. Managements plans regarding those matters are described in Note 3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\nPCAOB ID 457\nHaynie & Company\nSalt Lake City, Utah\nOctober 28, 2022\nWe have served as the Companys auditor since 2020.\nNORTHERN MINERALS & EXPLORATION LTD.\nCONSOLIDATED BALANCE SHEETS\nJuly 31,\nJuly 31,\nASSETS\nCurrent Assets:\nCash\n$ 25,813\n$ 967\nTotal Current Assets\n25,813\nTOTAL ASSETS\n$ 25,813\n$ 967\nLIABILITIES & STOCKHOLDERS DEFICIT\nCurrent Liabilities:\nAccounts payable\n$ 48,364\n$ 56,936\nAccounts payable - related party\n28,400\n34,700\nAccrued liabilities\n305,413\n348,344\nConvertible debt\n-\n25,000\nLoans payable\n79,000\n109,000\nLoans payable - related party\n-\n23,210\nTotal Current Liabilities\n461,177\n597,190\nTOTAL LIABILITIES\n461,177\n597,190\nCommitments and Contingencies\n-\n-\nStockholders Deficit:\nPreferred stock, $0.001 par value, 50,000,000 shares authorized; no shares issued\n-\n-\nCommon stock, $0.001 par value, 250,000,000 shares authorized; 87,509,357 shares issued, 82,509,357 shares outstanding as of July 31, 2022; 77,818,338 shares issued, 72,818,338 shares outstanding as of July 31, 2021\n82,509\n72,819\nCommon stock to be issued\n-\n18,000\nAdditional paid-in-capital\n2,873,468\n2,555,016\nAccumulated deficit\n(3,391,341 )\n(3,242,058 )\nTotal Stockholders Deficit\n(435,364 )\n(596,223 )\nTOTAL LIABILITIES & STOCKHOLDERS DEFICIT\n$ 25,813\n$ 967\nThe accompanying notes are an integral part of these consolidated financial statements.\nNORTHERN MINERALS & EXPLORATION LTD.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended\nJuly 31,\nOperating expenses:\nOfficer compensation\n$ 26,400\n$ 26,400\nConsulting - related party\n65,000\n60,000\nConsulting\n-\n8,000\nProfessional fees\n35,615\n49,566\nMineral property expenditures\n-\n1,000\nGeneral and administrative expenses\n25,487\n32,944\nTotal operating expenses\n152,502\n177,910\nLoss from operations\n(152,502 )\n(177,910 )\nOther income (expense):\nInterest expense\n(15,235 )\n(93,017 )\nOther income\n2,287\n25,000\nGain on forgiveness of debt\n17,167\n38,616\nLoss on impairment of oil rights\n-\n(28,800 )\nLoss on conversion of debt\n(1,000 )\n(6,857 )\nTotal other income (expense)\n3,219\n(65,058 )\nLoss before provision for income taxes\n(149,283 )\n(242,968 )\nProvision for income taxes\n-\n-\nNet Loss\n$ (149,283 )\n$ (242,968 )\nNet loss per share from operations, basic and diluted\n$ (0.00 )\n(0.00 )\nWeighted average number of common shares outstanding, basic and diluted\n77,905,754\n68,102,636\nThe accompanying notes are an integral part of these consolidated financial statements.\nNORTHERN MINERALS & EXPLORATION LTD.\nCONSOLIDATED STATEMENT OF CHANGES IN STOCKHOLDERS EQUITY (DEFICIT)\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Unaudited)\nCommon\nCommon Stock\nAdditional Paid-in\nCommon Stock To\nAccumulated\nTotal Stockholders\nStock\nAmount\nCapital\nbe Issued\nDeficit\nDeficit\nBalance, July 31, 2020\n63,078,479\n63,079\n2,184,218\n-\n(2,999,090 )\n(751,793 )\nCommon stock issued for cash\n2,667,200\n2,667\n77,333\n-\n-\n80,000\nCommon stock issued for cash - related party\n3,000,000\n3,000\n62,000\n18,000\n-\n83,000\nCommon stock issued for conversion of debt\n4,072,659\n4,073\n231,465\n-\n-\n235,538\nNet loss\n-\n-\n-\n-\n(242,968 )\n(242,968 )\nBalance, July 31, 2021\n72,818,338\n72,819\n2,555,016\n18,000\n(3,242,058 )\n(596,223 )\nCommon stock issued for cash\n1,633,336\n1,633\n50,917\n-\n-\n52,550\nCommon stock issued for cash - related party\n5,533,333\n5,533\n160,467\n(18,000 )\n-\n148,000\nCommon stock issued for conversion of debt and accrued interest\n945,000\n53,455\n-\n-\n54,400\nCommon stock issued for conversion of debt and accrued interest - related party\n1,579,350\n1,579\n53,513\n-\n-\n55,092\nContributed capital\n-\n-\n-\n-\nNet loss\n-\n-\n-\n-\n(149,283 )\n(149,283 )\nBalance, July 31, 2022\n82,509,357\n$ 82,509\n$ 2,873,468\n$ -\n$ (3,391,341 )\n$ (435,364 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nNORTHERN MINERALS & EXPLORATION LTD.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended\nJuly 31,\nCash Flows from Operating Activities:\nNet loss\n$ (149,283 )\n$ (242,968 )\nAdjustments to reconcile net loss to net cash used in Operating activities:\nGain on forgiveness of debt\n(17,167 )\n(38,616 )\nLoss on conversion of debt\n1,000\n6,857\nLoss on disposal of oil rights\n-\n28,800\nCost of borrowing\n-\n72,631\nChanges in Operating Assets and Liabilities:\nAccounts receivable\n-\n1,146\nOther receivable\n-\n10,000\nAccounts payables and accrued liabilities\n(9,189 )\n(39,345 )\nAccounts payable - related party\n(6,300 )\n27,236\nAccrued liabilities\n15,235\n12,244\nNet cash used in operating activities\n(165,704 )\n(168,873 )\nCash Flows used in Investing Activities:\n-\n-\nCash Flows from Financing Activities:\nProceeds from loan payable\n5,000\n5,000\nRepayment of loan payable\n(15,000 )\n(5,000 )\nProceeds from the sale of common stock\n200,550\n163,000\nNet cash provided by financing activities\n190,550\n163,000\nNet change in cash\n24,846\n(5,873 )\nCash at beginning of the year\n6,840\nCash at end of the year\n$ 25,813\n$ 967\nCash paid during the period for:\nInterest\n$ -\n$ -\nTaxes\n$ -\n$ -\nSupplemental disclosure of non-cash activity:\nConversion of debt and accrued interest\n$ 108,491\n$ 166,580\nThe accompanying notes are an integral part of these consolidated financial statements.\nNorthern Minerals & Exploration Ltd.\nNotes to Consolidated Financial Statements\nJuly 31, 2022\nNOTE 1 - ORGANIZATION AND BUSINESS OPERATIONS\nNorthern Minerals & Exploration Ltd. (the Company) is an emerging natural resource company operating in oil and gas production in central Texas and exploration for gold and silver in northern Nevada.\nThe Company was incorporated in Nevada on December 11, 2006 under the name Punchline Entertainment, Inc. On August 22, 2012, the Companys board of directors approved an agreement and plan of merger to effect a name change of the Company from Punchline Entertainment, Inc. to Punchline Resources Ltd. On July 12, 2013, the stockholders approved an amendment to change the name of the Company from Punchline Resources Ltd. to Northern Mineral & Exploration Ltd. FINRA approved the name change on August 13, 2013.\nOn November 22, 2017, the Company created a wholly owned subsidiary, Kathis Energy LLC (Kathis) for the purpose of conducting oil and gas drilling programs in Texas.\nOn December 14, 2017, Kathis Energy, LLC and other Limited Partners, created Kathis Energy Fund 1, LP, a limited partnership created for raising investor funds.\nOn May 7, 2018, the Company created ENMEX LLC, a wholly owned subsidiary in Mexico, for the purposes of managing and operating its investments in Mexico including but not limited to the Joint Venture opportunity being negotiated with Pemer Bacalar on the 61 acres on the Bacalar Lagoon on the Yucatan Peninsula. There was no activity from inception to date.\nNOTE 2 - SIGNIFICANT ACCOUNTING POLICIES\nBasis of presentation\nThe accounting and reporting policies of the Company conform to U.S. generally accepted accounting principles (US GAAP).\nUse of estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results may differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all cash accounts, which are not subject to withdrawal restrictions or penalties, and all highly liquid debt instruments purchased with a maturity of three months or less as cash and cash equivalents. The carrying amount of financial instruments included in cash and cash equivalents approximates fair value because of the short maturities for the instruments held. The Company had no cash equivalents as of July 31, 2022 and 2021.\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries, Kathis Energy LLC, Kathis Energy Fund 1, LLP and Enmex Operations LLC. All financial information has been prepared in conformity with accounting principles generally accepted in the United States of America. All significant intercompany transactions and balances have been eliminated.\nMineral Property Acquisition and Exploration Costs\nMineral property acquisition and exploration costs are expensed as incurred until such time as economic reserves are quantified. Cost of lease, exploration, carrying and retaining unproven mineral lease properties are expensed as incurred. We have chosen to expense all mineral exploration costs as incurred given that it is still in the exploration stage. Once our company has identified proven and probable reserves in its investigation of its properties and upon development of a plan for operating a mine, it would enter the development stage and capitalize future costs until production is established. When a property reaches the production stage, the related capitalized costs will be amortized over the estimated life of the probable-proven reserves. When our company has capitalized mineral properties, these properties will be periodically assessed for impairment of value and any diminution in value.\nOil and Gas Properties\nThe Company follows the successful efforts method of accounting for its oil and gas properties. Under this method of accounting, all property acquisition costs and costs of exploratory and development wells are capitalized when incurred, pending determination of whether the well found proved reserves. If an exploratory well does not find proved reserves, the costs of drilling the well are charged to expense. The costs of development wells are capitalized whether those wells are successful or unsuccessful. Other exploration costs, including certain geological and geophysical expenses and delay rentals for oil and gas leases, are charged to expense as incurred. Maintenance and repairs are charged to expense, and renewals and betterments are capitalized to the appropriate property and equipment accounts. Depletion and amortization of oil and gas properties are computed on a well-by-well basis using the units-of-production method. Although the Company has recognized minimal levels of production and revenue in the past, none of its property have proved reserves. Therefore, the Companys properties are designated as unproved properties.\nUnproved property costs are not subject to amortization and consist primarily of leasehold costs related to unproved areas. Unproved property costs are transferred to proved properties if the properties are subsequently determined to be productive and are assigned proved reserves. Proceeds from sales of partial interest in unproved leases are accounted for as a recovery of cost without recognizing any gain until all cost is recovered. Unproved properties are assessed periodically for impairment based on remaining lease terms, drilling results, reservoir performance, commodity price outlooks or future plans to develop acreage.\nAsset Retirement Obligation\nAccounting Standards Codification (ASC) Topic 410, Asset Retirement and Environmental Obligations (ASC 410) requires an entity to recognize the fair value of a liability for an asset retirement obligation in the period in which it is incurred. The net estimated costs are discounted to present values using credit-adjusted, risk-free rate over the estimated economic life of the oil and gas properties. Such costs are capitalized as part of the related asset. The asset is depleted on the equivalent unit-of-production method based upon estimates of proved oil and natural gas reserves. The liability is periodically adjusted to reflect (1) new liabilities incurred, (2) liabilities settled during the period, (3) accretion expense and (4) revisions to estimated future cash flow requirements. To date, the Company has very few operating wells. Currently, the Company has one working well. Because there is only one active well on the Ritchie Lease with a 24% working interest, the Company estimates the asset retirement obligation to be trivial and has not recorded an ARO liability.\nBasic and Diluted Earnings Per Share\nNet income (loss) per common share is computed pursuant to ASC 260-10-45, Earnings per Share-Overall-Other Presentation Matters. Basic net income (loss) per common share is computed by dividing net income (loss) by the weighted average number of shares of common stock outstanding during the period. Diluted net income (loss) per common share is computed by dividing net income (loss) by the weighted average number of shares of common stock and potentially outstanding shares of common stock during the period.\nFor the year ended July 31, 2022, the Company had no potentially dilutive shares of common stock. For the year ended July 31, 2021, the Company had 1,911,330 of potentially dilutive shares from warrants. The diluted loss per share is the same as the basic loss per share for the years ended July 31, 2022 and 2021, as the inclusion of any potential shares would have had an antidilutive effect due to our loss from operations.\nRecently issued accounting pronouncements\nIn August 2020, the FASB issued ASU 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40)-Accounting for Convertible Instruments and Contracts in an Entitys Own Equity. ASU 2020-06 reduces the number of accounting models for convertible debt instruments and convertible preferred stock. For convertible instruments with conversion features that are not required to be accounted for as derivatives under Topic 815, Derivatives and Hedging, or that do not result in substantial premiums accounted for as paid-in capital, the embedded conversion features no longer are separated from the host contract. ASU 2020-06 also removes certain conditions that should be considered in the derivatives scope exception evaluation under Subtopic 815-40, Derivatives and Hedging-Contracts in Entitys Own Equity, and clarify the scope and certain requirements under Subtopic 815-40. In addition, ASU 2020-06 improves the guidance related to the disclosures and earnings-per-share (EPS) for convertible instruments and contract in entitys own equity. ASU 2020-06 is effective for public business entities that meet the definition of a Securities and Exchange Commission (SEC) filer, excluding entities eligible to be smaller reporting companies as defined by the SEC, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. For all other entities, the amendments are effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years. The Board specified that an entity should adopt the guidance as of the beginning of its annual fiscal year.\nThe Company has implemented all new accounting pronouncements that are in effect. These pronouncements did not have any material impact on the financial statements unless otherwise disclosed, and the Company does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations.\nNOTE 3 - GOING CONCERN\nThe accompanying financial statements are prepared and presented on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. Accordingly, they do not include any adjustments relating to the realization of the carrying value of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern. Since inception to July 31, 2022, the Company has an accumulated deficit of $3,391,341. The Company intends to fund operations through equity financing arrangements, which may be insufficient to fund its capital expenditures, working capital and other cash requirements for the next twelve months. These factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nNOTE 4 - WINNEMUCCA MOUNTAIN PROPERTY\nOn September 14, 2012, we entered into an option agreement with AHL Holdings Ltd., and Golden Sands Exploration Inc. (Optionors), wherein we acquired an option to purchase an 80% interest in and to certain mining claims, which claims form the Winnemucca Mountain Property in Humboldt County, Nevada (Property). This property currently is comprised of 138 unpatented mining claims covering approximately 2,700 acres.\nOn July 23, 2018, the Company entered into a New Option Agreement with the Optionors. This agreement provided for the payment of $25,000 and the issuance of 3,000,000 shares of the Companys common stock and work commitments. The Company issued the shares and made the initial payment of $25,000 per the terms of the July 31, 2018 agreement. The second payment of $25,000 per the terms of the agreement was not paid when it became due on August 31, 2018 causing the Company to default on the terms of the July 23, 2018 agreement.\nOn March 25, 2019 the Company entered into a New Option Agreement with the Optionors. As stated in the New Option Agreement the Company has agreed to certain terms and conditions to have the right to earn an 80% interest in the Property, these terms include cash payments, issuance of common shares of the Company and work commitments.\nThe Companys firm commitments per the March 25, 2019, option agreement total $381,770 of which cash payments total $181,770 and a firm work commitment of $200,000. These commitments include payments for rentals payable to BLM and also for the staking of new claims adjoining the existing claims. The work commitment was to be conducted prior to December 31, 2020. As of July 31, 2022 and 2021, the Company has accounted for $285,453 and $285,453, respectively, in its accrued liabilities.\nThe Company has received notice from the Optionors, effective October 27, 2020, that its Option Agreement to earn an interest in the Winnemucca Mountain Gold Property has been terminated for being in default of certain terms and conditions of the Agreement. Management is in discussions with the principals of the Winnemucca property to resolve any outstanding obligations.\nDuring the year ended July 31, 2021, the Company received notice from the Optionors of the current amount due resulting in the reduction of the liability to $285,453. As a result, the Company recognized a gain on debt forgiveness of $23,616.\nThe Company does not fully agree with the amount due and is working to resolve the issue.\nNOTE 5 - CONVERTIBLE DEBT\nOn August 22, 2013, the Company entered into a $50,000 Convertible Loan Agreement with an un-related party. The Loan and interest are convertible into Units at $0.08 per Unit with each Unit consisting of one common share of the Company and ½ warrant with each full warrant exercisable for one year to purchase one common share at $0.30 per share. On July 10, 2014, a further $35,000 was received from the same unrelated party under the same terms. On July 31, 2018, this Note was amended whereby the principal and interest are now convertible into Units at $0.04 per Unit with each Unit consisting of one common share of the Company and ½ warrant with each full warrant exercisable for one year to purchase one common share at $0.08 per share. The Loan shall bear interest at the rate of Eight Percent (8%) per annum and matured on March 26, 2020. On July 31, 2021, the Note holder converted this note in full into 3,822,659 shares of common stock and 1,911,330 warrants. The shares were value at $0.04. The Company recognized a loss on the conversion of $6,857.\nOn October 20, 2017, the Company executed a convertible promissory note for $25,000 with a third party. The note accrues interest at 6%, matures in two years and is convertible into shares of common stock at maturity, at a minimum of $0.10 per share, at the option of the holder. During the year ended July 31, 2022, the note holder converted the $25,000 of principal and $6,000 of interest into 310,000 shares of common stock.\nNOTE 6 - LOANS PAYABLE\nOn April 16, 2017, the Company executed a promissory note for $15,000 with a third party. The note matures in two years and interest is set at $3,000 for the full two years. As of July 31, 2022, there is $15,000 and $6,375 of principal and accrued interest, respectively, due on this loan. As of July 31, 2021, there was $15,000 and $4,875 of principal and accrued interest, respectively, due on this loan. This loan is currently in default.\nOn June 11, 2020, a third party loaned the Company $14,000. On March 3, 2021, the party loaned another $5,000 to the Company. During the year ended July 31, 2022, the Company repaid $15,000 of the loan. The loan is unsecured, non-interest bearing and due on demand. As of July 31, 2022, there is a balance due of $4,000.\nDuring the year ended July 31, 2020, a third party loaned the Company $15,000. The loan is unsecured, bears interest at 8% per annum and matures on September 1, 2021. On September 30, 2021, the note holder converted the $15,000 of principal and $2,400 of interest into 435,000 shares of common stock.\nDuring the year ended July 31, 2020, a third party loaned the Company $60,000. The loan is unsecured, bears interest at 8% per annum and matures on September 1, 2021. As of July 31, 2022, there is $13,585 of interest accrued on this note. This note is in default.\nNOTE 7 - COMMON STOCK\nDuring the year ended July 31, 2021, the Company sold 2,667,200 shares of common stock at $0.03 per share for total cash proceeds of $80,000.\nOn July 31, 2021, the Company issued 250,000 shares of common stock in conversion of a $25,000 accounts payable. The shares were value at $0.04, the closing stock price on the date of grant. The Company recognized a $15,000 gain on the conversion.\nOn May 5, 2021, the Company issued 5,000,000 shares of common stock to Foster S Zeiders, per the terms of the agreement with Calihoma Partners LLC (Note 10). The shares are being held by the transfer agent and are disclosed as issued but not outstanding.\nAs discussed in Note 6 a note holder converted his note in full into 3,822,659 shares of common stock during the year ended July 31, 2021.\nDuring the year ended July 31, 2022, the Company sold 50,000 shares of common stock at $0.10 per share for total cash proceeds of $5,000.\nDuring the year ended July 31, 2022, the Company sold 1,583,336 shares of common stock at $0.03 per share for total cash proceeds of $47,550.\nOn July 20, 2022, an individual converted a $5,000 loan payable into 200,000 shares of common stock. The shares were valued at $0.03, the closing price on the date of conversion, resulting in the recognition of a $1,000 loss on conversion.\nAs discussed in Note 6 a note holder converted their note in full into 310,000 shares of common stock during the year ended July 31, 2022.\nAs discussed in Note 7 a note holder converted their note in full into 435,000 shares of common stock during the year ended July 31, 2022.\nRefer to Note 11 for stock issued to related parties.\nNOTE 8 - WARRANTS\nThe Company issued 1,911,330 warrants as part of a debt conversion in the prior year. The warrants were evaluated for purposes of classification between liability and equity. The warrants do not contain features that would require a liability classification and are therefore considered equity. The Black Scholes pricing model was used to estimate the fair value of $72,631 of the Warrants with the following inputs: stock price of $0.04, exercise price of $0.08, 2-year term, volatility of 313%, and a risk free rate of 0.19.\nNumber of Warrants\nWeighted\nAverage\nExercise Price\nWeighted Average Remaining Contract Term\nExercisable at July 31, 2020\n500,000\n0.15\n.27\nGranted\n1,911,330\n0.08\nExpired\n(500,000 )\n0.15\n-\nExercised\n-\n-\n-\nExercisable at July 31, 2021\n1,911,330\n$ 0.08\nGranted\n-\n-\n-\nExpired\n(1,911,330 )\n-\n-\nExercised\n-\n-\n-\nExercisable at July 31, 2022\n-\n$ -\n-\nNOTE 9 - COMMITMENTS AND CONTINGENCIES\nOn April 13, 2021, the Company entered into an agreement with Foster S. Zeiders, one of the owners of the Calihoma Partners LLC (Fosters). Per the terms of the agreement Foster is willing to transfer to NMEX Natural Gas LLC, (a subsidiary of the Company still to be created), all of his interest, including but not limited to a 35% back-in after payout interest in Calihoma Partners LLC which has 60% ownership in West Lenapah Project including the assets and project definition as described in the agreement. Foster hereby agrees to transfer one hundred (100%) percent of his membership interests in Calihoma Partners LLC, in exchange for 5,000,000 shares of common stock to be issued to him and an additional 5,000,000 shares to be issued pursuant to a specified timeframe.\nDuring the initial period of this Agreement if either party hereto for reasonable cause determines that membership interests in Calihoma Partners LLC should no longer be held by NMEX Natural Gas LLC. Foster shall exchange his shares in Northern for the membership interests in NMEX Natural Gas LLC, and Northern will convey such membership interests to Foster in exchange for his stock in Northern, and NMEX Natural Gas LLC shall become wholly owned by Foster. Foster shall serve as Manager of NMEX Natural Gas LLC until Northern determines to convey the interests in Calihoma Partners or one year whichever is shorter. As of July 31, 2022, the initial 5,000,000 shares of common stock have been issued but are being held by the transfer agent pending final confirmation that the agreement is finalized.\nNOTE 10 - RELATED PARTY TRANSACTIONS\nFor the Years ended July 31, 2022 and 2021, total payments of $71,000 and $60,000, respectively, were made to Noel Schaefer, a Director of the Company, for consulting services. As of July 31, 2022, and 2021 there is $26,500 and $32,500 credited to accounts payable.\nAs of July 31, 2022 and 2021, there is $1,900 and $2,200, respectively, credited to accounts payable for amounts due to Rachel Boulds, CFO, for consulting services.\nOn September 25, 2018, the Company executed a loan agreement with Winona Webb, the wife of the Ivan Webb, CEO, for $6,800. The loan was to be repaid by December 15, 2018, with an additional $680 to cover interest and fees. On October 10, 2018, the Company executed another loan agreement for $15,000. The loan was to be repaid by December 15, 2018, with an additional $1,500 to cover interest and fees. On January 30, 2022, Mr. Webb assumed the obligation from Ms. Webb to pay all interest and principal due totaling $31,917. The Company then agreed to convert the amount into 1,000,000 shares of common stock.\nOn January 28, 2022, Mr. Webb, purchased 2,000,000 shares of common stock for $60,000.\nOn July 27, 2022, Mr. Webb assumed the obligation to pay $23,175 of accrued liabilities previously incurred on one of the Companys prior projects. The Company then agreed to convert the amount into 579,350 shares of common stock.\nVictor Miranda, a Director of the Company is also President and owner of Labrador Capital SAPI DE CV (Labrador), a major shareholder of the Company owning 8.8% of its issued and outstanding shares. The Company has entered into a Memorandum of Understanding with Labrador to jointly pursue developing real estate projects in Mexico. As of the date of this report no projects have been identified to jointly pursue. In the event of a decision to go forward with Labrador, Victor Miranda will abstain from voting to avoid any conflict of interest.\nDuring the year ended July 31, 2021, Mr. Miranda purchased 600,000 shares of common stock at $0.03 per share for $18,000. The 600,000 shares were issued in September 2021.\nDuring the year ended July 31, 2022, Mr. Miranda purchased 2,933,333 shares of common stock at $0.03 per share for $88,000.\nNOTE 11 - INCOME TAX\nDeferred taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment. The U.S. federal income tax rate of 21% is being used.\nThe provision for Federal income tax consists of the following July 31:\nFederal income tax benefit attributable to:\nCurrent Operations\n$ 31,300\n$ 231,000\nOther nondeductible expenses\n3,400\n194,600\nLess: valuation allowance\n(34,700 )\n(425,600 )\nNet provision for Federal income taxes\n$ -\n$ -\nThe cumulative tax effect at the expected rate of 21% of significant items comprising our net deferred tax amount is as follows:\nDeferred tax asset attributable to:\nNet operating loss carryover\n$ 108,200\n$ 250,700\nLess: valuation allowance\n(108,200 )\n(250,700 ) )\nNet deferred tax asset\n$ -\n$ -\nAt July 31, 2022, the Company had net operating loss carry forwards of approximately $416,000 that maybe offset against future taxable income. No tax benefit has been reported in the July 31, 2022 or 2021 financial statements since the potential tax benefit is offset by a valuation allowance of the same amount.\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cut and Jobs Act (the Tax Act). The Tax Act establishes new tax laws that affects 2018 and future years, including a reduction in the U.S. federal corporate income tax rate to 21% effective January 1, 2018. For certain deferred tax assets and deferred tax liabilities.\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry forwards for Federal income tax reporting purposes are subject to annual limitations. Should a change in ownership occur, net operating loss carry forwards may be limited as to use in future years.\nASC Topic 740 provides guidance on the accounting for uncertainty in income taxes recognized in a companys financial statements. Topic 740 requires a company to determine whether it is more likely than not that a tax position will be sustained upon examination based upon the technical merits of the position. If the more-likely-than-not threshold is met, a company must measure the tax position to determine the amount to recognize in the financial statements.\nThe Company includes interest and penalties arising from the underpayment of income taxes in the statements of operations in the provision for income taxes. As of July 31, 2022, the Company had no accrued interest or penalties related to uncertain tax positions. The Company is subject to examination by the various taxing authorities beginning with the tax year ended December 31, 2017 (or the tax year ended December 31, 2003 if the Company were to utilize its NOLs)\nNOTE 12 - SUBSEQUENT EVENTS\nManagement has evaluated subsequent events pursuant to the requirements of ASC Topic 855, from the balance sheet date through the date the financial statements were issued and has determined that no material subsequent events exist. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURES\nNone ITEM 9A. CONTROLS AND PROCEDURES\nManagements Report Disclosure Controls and Procedures\nWe carried out an evaluation, under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, of the effectiveness of our disclosure controls and procedures (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)). Based upon that evaluation, our principal executive officer and principal financial officer concluded that, as of the end of the period covered in this report, our disclosure controls and procedures were ineffective to ensure that information required to be disclosed in reports filed under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported within the required time periods specified in the Commissions rules and forms and is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nOur principal executive officer and principal financial officer, do not expect that our disclosure controls and procedures or our internal controls will prevent all error or fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. During the fourth quarter of the fiscal year ended July 31, 2022, we carried out an evaluation, under the supervision and with the participation of our principal executive officer and principal financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures. Based on that evaluation and due to the identified material weaknesses discussed below, our principal executive officer and principal financial officer concluded that our disclosure controls and procedures were ineffective as of the end of the period covered by this report.\nTo address the material weaknesses, we performed additional analysis and other post-closing procedures in an effort to ensure our financial statements included in this annual report have been prepared in accordance with generally accepted accounting principles. Accordingly, management believes that the financial statements included in this report fairly present in all material respects our financial condition, results of operations and cash flows for the periods presented.\nManagements Report on Internal Control over Financial Reporting\nInternal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) is a process designed by, or under the supervision of, our principal executive and principal financial officers, and effected by our board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. The management is responsible for establishing and maintaining adequate internal control over our financial reporting. Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting using the Internal Control - Integrated Framework (2013) developed by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that our internal control over financial reporting was not effective as of July 31, 2022.\nWe are aware of the following material weaknesses in internal control that could adversely affect the Companys ability to record, process, summarize and report financial data:\n●\nDue to our size and limited resources, we currently do not employ the appropriate accounting personnel to ensure (a) we maintain proper segregation of duties, (b) that all transactions are entered timely and accurately, and (c) we properly account for complex or unusual transactions\n●\nDue to our size and limited resources, we have not properly documented a complete assessment of the effectiveness of the design and operation of our internal control over financial reporting.\nInherent limitations on effectiveness of controls\nInternal control over financial reporting has inherent limitations, which include but is not limited to the use of independent professionals for advice and guidance, interpretation of existing and/or changing rules and principles, segregation of management duties, scale of organization, and personnel factors. Internal control over financial reporting is a process, which involves human diligence and compliance and is subject to lapses in judgment and breakdowns resulting from human failures. Internal control over financial reporting also can be circumvented by collusion or improper management override. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements on a timely basis, however these inherent limitations are known features of the financial reporting process and it is possible to design into the process safeguards to reduce, though not eliminate, this risk. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal controls over financial reporting that occurred during the fourth quarter of the fiscal year ended July 31, 2022, that have materially or are reasonably likely to materially affect, our internal controls over financial reporting. ITEM 9B. OTHER INFORMATION\nNone\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nAll directors of our company hold office until the next annual meeting of the security holders or until their successors have been elected and qualified. The officers of our company are appointed by our board of directors and hold office until their death, resignation or removal from office. Our directors and executive officers, their ages, positions held, and duration as such, are as follows:\nName\nAge\nPosition with the Company\nDate Appointed\nNoel Schaefer\nChief Operating Officer, Secretary & Director\nJuly 6, 2018\nVictor Miranda\nDirector\nJuly 6, 2018\nIvan Webb\nPresident & Chief Executive Officer\nJuly 6, 2018\nRachel Boulds\nChief Financial Officer\nFebruary 7, 2020\nNoel Schaefer, Director, Secretary & Chief Operations Officer, (COO) has served in a variety of executive and director positions in his 30 plus year career with both domestic and international companies. His emphasis has been with startups by setting up market profiles, developing strategic market placement and refining corporate objectives. Mr. Schaefer has successfully helped to raise funds from both the public and private sectors. He has worked extensively in Far East and Latin America with a particular focus on Mexico. He holds a Bachelor of Science degree from Brigham Young University with an emphasis in Marketing and Finance.\nVictor Miranda, Director, is the CEO of an insurance broker firm, passionate about ventures developing USA/MEXICO cross border opportunities. He has 15 years of hands on experience in the sales management for the financial sector, with particular focus on developing a savers culture through employee benefits, and 7 years developing successful real estate development projects in Quintana Roo. Quintana Roo is the State in Mexico where the Pemer Bacalar property is located.\nIvan Webb, Chief Executive Officer, is a seasoned and successful entrepreneur, with over 35 years of experience in the oil and gas industry internationally and in the United States. He is experienced with acquiring oil and gas concessions and leases, drilling of new wells and reworking/ re-completing existing wells, production management, working with service companies and regulatory compliance. Internationally, he has successfully leased more than 18,000,000 acres. Domestically he has been involved with the acquisition and or management of more than 250 wells in Kansas, Oklahoma and Texas.\nMr. Webb has also over 30 years of experience in managing or assisting public companies in both the US and Canada with regulatory compliance. His public company experience includes assisting companies with initial public offerings, reverse mergers, obtaining listings, and assisting with ongoing regulatory compliance.\nRachel Boulds, Chief Financial Officer of the Company. Ms. Boulds currently works for the Company on a part-time basis while also operating her sole accounting practice which she has led since 2009 and which provides all aspects of consulting and accounting services to clients, including the preparation of full disclosure financial statements for public companies to comply with GAAP and SEC requirements. Ms. Boulds also currently provides outsourced chief financial officer services for two other companies. From August 2004 through July 2009, she was employed as a Senior Auditor for HJ & Associates, LLC, where she performed audits and reviews of public and private companies, including the preparation of financial statements to comply with GAAP and SEC requirements. From 2003 through 2004, Ms. Boulds was employed as a Senior Auditor at Mohler, Nixon and Williams. From September 2001 through July 2003, Ms. Boulds worked as an ABAS Associate for PriceWaterhouseCoopers. From April 2000 through February 2001, Ms. Boulds was employed as an e-commerce Accountant for the Walt Disney Groups GO.com. Ms. Boulds earned a B.S. in Accounting from San Jose University in 2001 and is licensed as a CPA in the state of Utah.\nNone of our directors or officers are related to each other. There are no arrangements or understandings with any of our principal stockholders, customers, suppliers, or any other person, pursuant to which any of our directors or executive officers were appointed.\nFamily Relationships\nNone of our directors or officers are related to each other. There are no arrangements or understandings with any of our principal stockholders, customers, suppliers, or any other person, pursuant to which any of our directors or executive officers were appointed.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers has, during the past ten years:\n1.\nbeen convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offences);\n2.\nhad any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\n3.\nbeen subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n4.\nbeen found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n5.\nbeen the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n6.\nbeen the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26)), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29)), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nDirector Independence\nWe currently act with two directors, Noel Schaefer and Victor Miranda. We have determined that we do not have an independent director as defined in NASDAQ Marketplace Rule 4200(a)(15).\nWe do not have a standing audit, compensation or nominating committee, but our directors and officer act in such capacities. We believe that our sole director is capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. Our sole director does not believe that it is necessary to have an audit committee because we believe that the functions of an audit committee can be adequately performed by the sole director. In addition, we believe that retaining an independent director who would qualify as an audit committee financial expert would be overly costly and burdensome and is not warranted in our circumstances given the early stages of our development.\nCode of Ethics\nThe Company has not yet adopted a Code of Ethics. ITEM 11. EXECUTIVE COMPENSATION\nThe table below summarizes all compensation awarded to, earned by, or paid to each named executive officer for our last two completed fiscal years for all services rendered to us.\nSUMMARY COMPENSATION TABLE\nName\nand Principal\nPosition\nYear\nSalary\n($)\nBonus\n($)\nStock Awards\n($)\nOption Awards\n($)\nNon- Equity\nIncentive\nPlan\nCompensa-\ntion\n($)\nChange in Pension\nValue and\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensa-\ntion\n($)\nTotal\n($)\nNoel Schaefer\nChief Operating Officer & Director\n$60,000\n$60,000\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\n$60,000\n$60,000\nVictor Miranda\nDirector\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nNA\nNA\nIvan Web)\nChief Executive Officer & Director\n$0\n$0\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\n$0\n$0\nRachel Boulds\nChief Financial Officer\n$26,400\n$26,400\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\n$26,400\n$26,400\nNoel Schaefer was appointed Chief Operating Officer on July 6, 2018.\nVictor Miranda was Chief Financial Officer from July 6, 2018 until February 7, 2020.\nIvan Webb was appointed Vice President on March 16, 2015 and on July 6, 2018 was appointed Chief Executive Officer\nRachel Boulds was appointed Chief Financial Officer on February 7, 2020.\nOther than as set out below, there are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. Our directors and executive officers may receive share options at the discretion of our board of directors in the future. We do not have any material bonus or profit sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that share options may be granted at the discretion of our board of directors.\nStock Option Grants\nWe have not granted any stock options to the executive officers since our inception.\nOutstanding Equity Awards at Fiscal Year End\nFor the year ended July 31, 2022, no director or executive officer has received compensation from us pursuant to any compensatory or benefit plan. There is no plan or understanding, express or implied, to pay any compensation to any director or executive officer pursuant to any compensatory or benefit plan.\nCompensation of Directors\nNo member of our Board of Directors received any compensation for his services as a director during the year ended July 31, 2022 and 2021. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth, as of October 6, 2022, information regarding the beneficial ownership of each class of our voting securities by: (i) our officers and directors; (ii) all of our officers and directors as a group; and (iii) each person known by us to beneficially own 5% or more of any class of our outstanding voting securities. Generally, a person is deemed to be a beneficial owner of a security if that person has or shares the power to dispose or to direct the disposition of such security. A person is also deemed to be a beneficial owner of any securities of which the person has the right to acquire beneficial ownership within 60 days.\nName and Address of Beneficial Owner\nTitle of Class\nAmount and Nature of Beneficial\nOwnership\n(1)\nPercent of\nClass\n(2)\nIvan Webb, Chief Executive Officer\nCommon stock\n2,364,350\n2.70 %\nNoel Schaefer, Chief Operating Officer, Secretary & Director\nCommon stock\n2,000,000\n2.29 %\nVictor Miranda, Director\nCommon stock\n12,033,333\n13.75 %\nRachel Boulds, CFO\nCommon stock\n-\n-\nAll officers and director as a group (4 persons)\nCommon stock\n16,397,683\n18.74 %\nLabrador Capital SAPI CV (3)\nCommon stock\n5,000,000\n5.71 %\nStarcom SA DE CV\nCommon stock\n5,000,000\n5.71 %\nAll others as a group (2 persons)\n10,000,000\n11.42 %\n(1)\nUnder SEC rules, beneficial ownership includes shares over which the individual or entity has voting or investment power and any shares which the individual or entity has the right to acquire within sixty days.\n(2)\nPercentage ownership of common stock is based on 87,509,357 shares of our common stock.\n(3)\nVictor Miranda is the president of Labrador Capital SAPI CV which is the holder of 5,000,000 shares of the Companys common stock. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nFor the Years ended July 31, 2022 and 2021, total payments of $71,000 and $60,000, respectively, were made to Noel Schaefer, a Director of the Company, for consulting services. As of July 31, 2022, and 2021 there is $26,500 and $32,500 credited to accounts payable.\nAs of July 31, 2022 and 2021, there is $1,900 and $2,200, respectively, credited to accounts payable for amounts due to Rachel Boulds, CFO, for consulting services.\nOn September 25, 2018, the Company executed a loan agreement with Winona Webb, the wife of the Ivan Webb, CEO, for $6,800. The loan was to be repaid by December 15, 2018, with an additional $680 to cover interest and fees. On October 10, 2018, the Company executed another loan agreement for $15,000. The loan was to be repaid by December 15, 2018, with an additional $1,500 to cover interest and fees. On January 30, 2022, Mr. Webb assumed the obligation from Ms. Webb to pay all interest and principal due totaling $31,917. The Company then agreed to convert the amount into 1,000,000 shares of common stock.\nOn January 28, 2022, Mr. Webb, purchased 2,000,000 shares of common stock for $60,000.\nOn July 27, 2022, Mr. Webb assumed the obligation to pay $23,175 of accrued liabilities previously incurred on one of the Companys prior projects. The Company then agreed to convert the amount into 579,350 shares of common stock.\nVictor Miranda, a Director of the Company is also President and owner of Labrador Capital SAPI DE CV (Labrador), a major shareholder of the Company owning 8.8% of its issued and outstanding shares. The Company has entered into a Memorandum of Understanding with Labrador to jointly pursue developing real estate projects in Mexico. As of the date of this report no projects have been identified to jointly pursue. In the event of a decision to go forward with Labrador, Victor Miranda will abstain from voting to avoid any conflict of interest.\nDuring the year ended July 31, 2021, Mr. Miranda purchased 600,000 shares of common stock at $0.03 per share for $18,000. The 600,000 shares were issued in September 2021.\nDuring the year ended July 31, 2022, Mr. Miranda purchased 2,933,333 shares of common stock at $0.03 per share for $88,000. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe aggregate fees billed for the most recently completed fiscal year ended July 31, 2022 and 2021 for professional services rendered by the principal accountant for the audit of our annual financial statements and review of the financial statements included in our quarterly reports on Form 10-Q and services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for these fiscal periods were as follows:\nYear Ended\nJuly 31, 2022\nJuly 31, 2021\nAudit Fees\n$ 34,000\n$ 43,000\nAudit Related Fees\n-\n-\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTotal\n$ 34,000\n$ 43,000\nOur board of directors pre-approves all services provided by our independent auditors. All of the above services and fees were reviewed and approved by the board of directors either before or after the respective services were rendered.\nOur board of directors has considered the nature and amount of fees billed by our independent auditors and believes that the provision of services for activities unrelated to the audit is compatible with maintaining our independent auditors independence.\nPART IV ITEM 15. EXHIBITS\nExhibit Number\nExhibit Description\n31.1\nSection 302 Certification under Sarbanes-Oxley Act of 2002.\n31.2\nSection 302 Certification under Sarbanes-Oxley Act of 2002.\n32.1\nSection 906 Certification under Sarbanes-Oxley Act of 2002.\n(101)\nInteractive Data File (Form 10-K for the Year Ended July 31, 2022)\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nNORTHERN MINERALS & EXPLORATION LTD.\n(Registrant)\nDated: October 28, 2022\n/s/ Ivan Webb\nIvan Webb\nChief Executive Officer\n/s/ Noel Schaefer\nNoel Schaefer\nChief Operating Officer & Director\n/s/ Victor Miranda\nVictor Miranda\nDirector\n/s/ Rachel Boulds\nRachel Boulds\nChief Financial Officer"
}