{
    "cik": "1423221",
    "company": "Quanex Building Products CORP",
    "filing_type": "10-K",
    "filing_date": "2022-12-16",
    "period_of_report": "2022-10-31",
    "sic": "3350",
    "state_of_inc": "DE",
    "state_location": "TX",
    "fiscal_year_end": "1031",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1423221/0001423221-22-000014-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1423221/000142322122000014/nx-20221031.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1423221/0001423221-22-000014.txt",
    "filename": "1423221_10K_2022_0001423221-22-000014.htm",
    "content": "Item 1. Business.\nOur Company\nQuanex was incorporated in Delaware on December 12, 2007, as Quanex Building Products Corporation. We currently manufacture components for original equipment manufacturers (OEM) in the building products industry. The majority of these components can be categorized as window and door (fenestration) components and kitchen and bath cabinet components. Examples of fenestration components include (1) energy-efficient flexible insulating glass spacers, (2) extruded vinyl profiles, (3) window and door screens, and (4) precision-formed metal and wood products. In addition, we provide certain other non-fenestration components and products, which include solar panel sealants, trim moldings, vinyl decking, vinyl fencing, water retention barriers, and conservatory roof components. We use low-cost production processes and engineering expertise to provide our customers with specialized products for their specific applications. We believe these capabilities provide us with unique competitive advantages. We serve a primary customer base in North America and the United Kingdom (U.K.), and also serve customers in international markets through our operating plants in the U.K. and Germany, as well as through sales and marketing efforts in other countries.\nOur History\nOur predecessor company, Quanex Corporation, was organized in Michigan in 1927 as Michigan Seamless Tube Company, and was later reincorporated in Delaware in 1968. In 1977, Michigan Seamless Tube Company changed its name to Quanex Corporation. On December 12, 2007, Quanex Building Products Corporation was incorporated as a wholly-owned subsidiary in the state of Delaware, in order to facilitate the separation of Quanex Corporation's vehicular products and building products businesses. This separation became effective on April 23, 2008, through a spin-off of the building products business to Quanex Corporation's then-existing shareholders. Immediately following the spin-off, our former parent company, consisting principally of the vehicular products business and all non-building products related corporate accounts, merged with a wholly-owned subsidiary of Gerdau S.A.\nSince the spin-off in 2008, we have evolved our business by making investments in organic growth initiatives and taking a disciplined approach to new business and strategic acquisition opportunities, while disposing of non-core businesses.\nAs of October 31, 2022, we operated 27 manufacturing facilities located in 15 states in the U.S., two facilities in the U.K., and one in Germany. These facilities feature efficient plant design and flexible manufacturing processes, enabling us to produce a wide variety of custom engineered products and components primarily focused on the window and door segment of the residential building products markets. We are able to maintain minimal levels of finished goods inventories at most locations because we typically manufacture products upon order to customer specifications. We believe the primary drivers of our operating results are residential remodeling and replacement activity and new home construction in the markets we serve.\nOur Industry\nOur business is largely based in North America and dependent upon the spending and growth activity levels of our customers which include national and regional residential window, door and cabinet manufacturers. Our international presence includes vinyl extruded lineals for large house systems to smaller individual customers. We also have insulating glass businesses in the U.K. and Germany.\nWe use data related to housing starts and window shipments in the U.S., as published by or derived from third-party sources, to evaluate the fenestration market. We also use data related to cabinet demand in the U.S. to evaluate the residential cabinet market.\nThe following table presents calendar-year annual housing starts information as of November 2022 from the National Association of Home Builders (NAHB) (units in thousands):\nSingle-family Units Multi-family Units Manufactured Units\nPeriod Units % Change Units % Change Units % Change Total Units\nAnnual Data\n2018 871 3% 376 6% 96 3% 1,343\n2019 889 2% 402 7% 95 (1)% 1,386\n2020 1,002 13% 393 (2)% 94 (1)% 1,489\n2021 1,131 13% 474 21% 106 13% 1,711\nAnnual Data - Forecast\n2022 978 (14)% 560 18% 119 12% 1,657\n2023 886 (9)% 515 (8)% 120 1% 1,521\n2024 1,035 17% 490 (5)% 126 5% 1,651\nDucker Worldwide LLC, a consulting and research firm, indicated in November 2022 that window shipments in the residential remodeling and replacement (R&R) market are expected to increase approximately 3% for the calendar-year 2022 and approximately 2% in 2023. Derived from reports published by Ducker, the overall increase in window shipments for the trailing twelve months ended September 30, 2022 was 3%. During this period, new construction activity increased 2% and R&R replacement increased 4% respectively.\nProjections from Catalina Research, a consulting and research firm, as of November 2022 include growth rates for semi-custom (the cabinet market we primarily operate in) and overall cabinet markets. The semi-custom market increased 11% in calendar-year 2021, and is forecasted to increase 13% in 2022 followed by a forecasted decrease of 4% in 2023. The overall cabinet market increased 16% in 2021 calendar-year, and is forecasted to increase 15% in 2022 followed by a forecasted decrease of 3% in 2023.\nWe have noted the following trends which we believe affect our industry:\nthe recent growth in the housing market over the past several years has been predominately in new construction which has outpaced the growth in the residential remodeling and replacement sector;\nprograms in the U.S. such as Energy Star have improved customer awareness of the technological advances in window and door energy-efficiency, but the government has been reluctant to enforce stricter energy standards;\nsupply chain disruptions and inflationary pressures related to transportation, labor, and raw materials have increased causing delays in production and higher prices;\nforeign currency rates in the U.K. and other European nations have changed significantly relative to the United States Dollar due in part to Brexit in the U.K., as well as other international unrest or uncertainties;\ncommodity prices have fluctuated in recent years, and to the extent we cannot pass this cost to our customers, this impacts the cost of critical materials used in our manufacturing processes such as resin, which affects margins related to our vinyl extrusion products; oil products such as butyl, which affects our insulating glass products; and aluminum, wood and silicone products used by our other businesses; and\nhigher energy efficiency standards in Europe should favorably impact sales of our insulating glass spacer products in the short- to mid-term.\nStrategy\nOur vision is to be the preferred supplier to our customers in each market we serve. Our strategy to achieve this vision includes the following:\nfocus on growth with a purpose and explore markets that are synergistic with existing manufacturing capabilities and expand our market share with national and regional customers and collaborative partnerships by providing: (1) a quality product; (2) a high level of customer service; (3) product choices at different price points; and (4) an expanded product portfolio or enhancements to existing product offerings. These enhancements may include higher thermal efficiency, enhanced functionality, improved weatherability, better appearance and best-in-class quality for our fenestration and cabinet door products;\nrealize improved profitability in our manufacturing processes through: (1) ongoing preventive maintenance programs; (2) better utilization of our capacity by focusing on operational efficiencies and reducing scrap; (3) marketing our value added products; and (4) focusing on employee safety;\noffer logistics solutions that provide our customers with just-in-time service which can reduce their processing costs;\nrecognize the importance of environmental, social, and corporate governance by continually looking for ways to reduce our environmental impact, including reducing our carbon footprint, protecting the health and safety of our employees and communities, and engaging diverse workers and leaders, and remain committed to doing good in our community;\npursue targeted business acquisitions that allow us to expand our existing footprint, enhance our existing product offerings, acquire complementary technology, enhance our leadership position within the markets we serve, and expand into adjacent markets or service lines; and\nexit unprofitable service lines or customer relationships.\nOur Strengths\nWe believe our strengths include design expertise, new technology development capability, high quality manufacturing, just-in-time delivery systems, customer service and the ability to generate unique patented products.\nRaw Materials and Supplies\nWe purchase a diverse range of raw materials, which include PVC resin, epoxy resin, butyl, titanium dioxide (TiO2) desiccant powder, silicone and EPDM rubber compounds, coated and uncoated aluminum sheet and wood (both hardwood and softwood). These raw materials are generally available from several suppliers at market prices. We may enter into sole sourcing arrangements with our suppliers from time to time if we believe we can realize beneficial savings, but only after we have determined that the vendor can reliably supply our raw material requirements. These sole sourcing arrangements generally have termination clauses to protect us if a sole sourced vendor could not provide raw materials timely and on economically feasible terms. We believe there are other qualified suppliers from which we could purchase raw materials and supplies.\nCompetition\nOur products are sold under highly competitive conditions. We compete with a number of companies, some of which have greater financial resources than us. We believe the primary competitive factors in the markets we serve include price, product quality, delivery and the ability to manufacture to customer specifications. The volume of engineered building products that we manufacture represents a small percentage of annual domestic consumption. Similarly, our subsidiaries in the U.K. compete against some larger vinyl producers and smaller window manufacturers. For our kitchen and bathroom cabinet door business, we believe we are the largest supplier to OEMs in the U.S., but we compete with other national and regional businesses, including OEMs who are vertically integrated.\nWe compete against a range of small and mid-size metal, vinyl and wood products suppliers, wood molding companies, and the in-house operations of customers who have vertically integrated fenestration operations. We also compete against insulating glass (IG) spacer manufacturing firms. IG systems are used in numerous end markets including residential housing, commercial construction, appliances and transportation vehicles, but we primarily serve the residential housing market. Competition is largely based on regional presence, custom engineering, product development, quality, service and price. Primary competitors include, but are not limited to, Veka, Deceuninck, Energi, Vision Extrusions, GED Integrated Solutions, Technoform, Swiss Spacer, Thermix, RiteScreen, Allmetal, Endura, Klinger, Thermoseal and Fenzi Group. Competitors in the vinyl extrusion business in the U.K. include Epwin, Veka, Profine UK Extrusions Ltd., Eurocell and others. Primary competitors in the cabinet door business in the U.S. include Conestoga, Appalachian Wood, Olon, Northern Contours and others.\nSales, Marketing, and Distribution\nWe sell our products to customers in various countries. Therefore, we have sales representatives whose territories essentially cover the U.S., Canada, Europe, and to a lesser extent, the Middle East, Latin and South America, Australia, New Zealand and Asia. Our sales force is tasked with selling and marketing our complete range of components, products and systems to national and regional OEMs through a direct sales force in North America and Europe, supplemented with the limited use of distributors and independent sales agents.\nCustomers\nCertain of our businesses or product lines are largely dependent on a relatively few large customers. See Note 1, Nature of Operations, Basis of Presentation and Significant Accounting Policies - Concentration of Credit Risk and Allowance for Credit Losses, of the accompanying financial statements in this Annual Report on Form 10-K for related disclosure.\nSales Backlog\nGiven the short lead times involved in our business, we have a backlog of approximately $56 million as of October 31, 2022. The criteria for revenue recognition has not been met with regard to sales backlog, and therefore, we have not recorded revenue or deferred revenue pursuant to these sales orders. If these sales orders result in a sale, we will record revenue in fiscal 2023 in accordance with our revenue recognition accounting policy.\nSeasonal Nature of Business\nOur business is impacted by seasonality. We have historically experienced lower sales for our products during the first half of our fiscal year as winter weather reduces homebuilding and home improvement activity. Our operating income tends to decline during this period of lower sales because a higher percentage of our operating expenses are fixed overhead. We typically experience more favorable results in the third and fourth quarters of the fiscal year. Our exposure to seasonality was somewhat tempered with the entry into the kitchen and bathroom cabinet door industry, which is focused \"inside the house\" and less susceptible to inclement weather. Expenses for labor and other costs are generally semi-variable throughout the year.\nWorking Capital\nWe fund operations through a combination of available cash and cash equivalents, cash flow generated from our operations, and borrowings from our revolving credit facility. We extend credit to our domestic customers in the ordinary course of business generally for a term of 30 days, while the terms for our international customers vary from cash advances to 90 days. Inventories of raw materials are carried in quantities deemed necessary to ensure a smooth production process, some of which are governed by consignment agreements with suppliers. We strive to maintain minimal finished goods inventories, while ensuring an adequate supply on hand to service customer needs.\nService Marks, Trademarks, Trade Names, and Patents\nOur federally registered trademarks or service marks include QUANEX, QUANEX and design, Q design, TRUSEAL TECHNOLOGIES, DURASEAL, DURALITE, SOLARGAIN, ENVIROSEALED WINDOWS, EDGETHERM, EDGETECH, ECOBLEND, SUPER SPACER, TSS, TRUE WARM, E & Design, QUIET EDGE, HEALTH SMART WINDOWS, ENERGY WISE WINDOWS, DESI-ROPE, 360 and design, INTELLICLIP, SUSTAINAVIEW, MIKRON, MIKRONWOOD, MIKRONBLEND, MIKRON BLEND and design, ENERGYCORE, FUSION INSULATED SYSTEM, AIRCELL, SUPERCOAT, SUPERCAP, STYLELOCK, STYLELOCK and design, MIKRON and design, HOMESHIELD, HOMESHIELD and design, STORM SEAL, and TENON. We consider the following marks, design marks and associated trade names to be valuable in the conduct of our business: HOMESHIELD, TRUSEAL TECHNOLOGIES, EDGETECH, MIKRON, WOODCRAFT and QUANEX. Through Liniar, we hold a number of registered designs, patents and trademarks registered in the U.K., which include: MODLOK, LINIAR, SUPER CUT, ENERGY PLUS & Device, FLAMSTEAD HOLDINGS & Device, HL PLASTICS & Device, VINTAGE WINDOWS & Device, RESURGENCE, FUSE, ELEVATE, SWITCHBOARD and various other trademarks and patents which are pending approval. Generally, our business does not depend on patent protection, but patents obtained with regard to our vinyl extrusion products and processes, fabricated metal components and IG spacer products business remain a valuable competitive advantage over other building products manufacturers. We obtain patent protection for various dyes and other tooling created in connection with the production of customer-specific vinyl profile designs and vinyl extrusions. Our fabricated metal components business obtains patent protection for its thresholds. Our window sealant business unit relies on patents to protect the design of several of its window spacer products. Although we hold numerous patents, the proprietary process technology that has been developed is also considered a source of competitive advantage.\nEnvironmental and Employee Safety Matters\nWe are subject to extensive laws and regulations concerning worker safety, the discharge of materials into the environment and the remediation of chemical contamination. To satisfy such requirements, we must make capital and other expenditures on an ongoing basis. The cost of worker safety and environmental matters has not had a material adverse effect on our operations or financial condition in the past, and we are not currently aware of any existing conditions that we believe are likely to have a material adverse effect on our operations, financial condition, or cash flows.\nSafety and Environmental Policies\nFor many years, we have maintained compliance policies that are designed to help protect our workforce, to identify and reduce the potential for job-related accidents, and to minimize liabilities and other financial impacts related to worker safety and environmental issues. These policies include extensive employee training and education, as well as internal policies embodied in our Code of Business Conduct and Ethics. We have a Director of Environmental, Health and Safety and maintain a company-wide committee, comprising leaders from across the organization, which meets regularly to discuss safety issues and drive safety improvements. We plan to continue to focus on safety in particular as a core strategy to improve our operational efficiency and financial performance.\nRemediation\nUnder applicable state and federal laws, we may be responsible for, among other things, all or part of the costs required to remove or remediate wastes or hazardous substances at locations we, or our predecessors, have owned or operated. From time to time, we also have been alleged to be liable for all or part of the costs incurred to clean up third-party sites where there might have been an alleged improper disposal of hazardous substances. At present, we are not involved in any such matters.\nEnvironmental Compliance Costs\nFrom time to time, we incur routine expenses and capital expenditures associated with compliance with existing environmental regulations, including control of air emissions and water discharges, and plant decommissioning costs. We have not incurred any material expenses or capital expenditures related to environmental matters during the past three fiscal years, and do not expect to incur a material amount of such costs in fiscal 2023. While we will continue to have future expenditures related to environmental matters, any such amounts are impossible to reasonably estimate at this time. Based upon our experience to date, we do not believe that our compliance with environmental requirements will have a material adverse effect on our operations, financial condition or cash flows.\nHuman Capital\nWe track human capital metrics that we consider to be key to our business, including employee headcount, temporary workers, health and safety, and turnover. As of October 31, 2022, we had 3,875 employees. Of these employees, 3,141 were domiciled in the U.S., 622 in the U.K., and 112 in Germany. Generally, the total number of employees of Quanex and its subsidiaries does not significantly fluctuate throughout the year. Currently, none of our employees are subject to collective bargaining agreements.\nEmployee turnover rates are monitored monthly at the division and plant levels. Both voluntary and involuntary terminations, including retirements, are used to calculate the turnover rate. Our human capital objectives include attracting, developing, motivating, rewarding, and retaining our existing and new employees. We offer our employees online training courses and on-the-job training on job duties, safety requirements, and leadership skills.\nFor Investors\nWe periodically file or furnish documents to the Securities and Exchange Commission (SEC), including our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and other reports as required. These reports are also available free of charge from the Investor Relations Section of our website at http://www.quanex.com, as soon as reasonably practicable after we file such material or furnish it to the SEC. As permitted by the SEC rules, we post relevant information on our website. However, the information contained on our website is not incorporated by reference into this Annual Report on Form 10-K and should not be considered part of this report. Item 1A. Risk Factors.\nThe following risk factors, along with other information contained elsewhere in this Annual Report on Form 10-K and our other public filings with the SEC, should be carefully considered before deciding to invest in our securities. Additional risks and uncertainties that are not currently known to us or that we may view as immaterial could impair our business if such risks were to develop into actual events. Therefore, any of these risks could have a material adverse effect on our financial condition, results of operations and cash flows. This listing of risk factors is not all-inclusive and is not necessarily presented in order of importance.\nIndustry Risks\nAny sustained decline in residential remodeling, replacement activities, or housing starts could have a material adverse effect on our business, financial condition and results of operations.\nThe primary drivers of our business are residential remodeling, replacement activities and housing starts. The home building and residential construction industry is cyclical and seasonal, and product demand is based on numerous factors such as interest rates, general economic conditions, consumer confidence and other factors beyond our control. Declines in the number of housing starts and remodeling expenditures resulting from such factors could have a material adverse effect on our business, results of operations and financial condition.\nIf the availability of critical raw materials were to become scarce or if the price of these items were to increase significantly, we might not be able to timely produce products for our customers or maintain our profit levels.\nWe purchase from outside sources significant amounts of raw materials, such as butyl, titanium dioxide, vinyl resin, aluminum, steel, silicone and wood products for use in our manufacturing facilities. Because we do not have long-term contracts for the supply of many of our raw materials, their availability and price are subject to market fluctuation and may be subject to curtailment or change. Any of these factors could affect our ability to timely and cost-effectively manufacture products for our customers.\nCompliance with, or liabilities under, existing or future environmental laws and regulations could significantly increase our costs of doing business.\nWe are subject to extensive federal, state and local laws and regulations concerning the discharge of materials into the environment and the prevention and/or remediation of chemical contamination. To satisfy such requirements, we must make capital and other expenditures on an ongoing basis. Future expenditures relating to environmental matters will necessarily depend upon whether such regulations and future governmental decisions or interpretations of these regulations apply to us and our facilities. It is likely that we will be subject to increasingly stringent environmental standards, and we will incur additional expenditures to comply with such standards. Furthermore, if we fail to comply with applicable environmental regulations, we could be subject to substantial fines or penalties and to civil and criminal liability.\nOur goodwill and indefinite-lived intangible assets may become impaired and could result in a charge to income.\nWe evaluate our goodwill and indefinite-lived intangible assets at least annually to determine whether we must test for impairment. In making this assessment, we must use judgment to make estimates of future operating results and appropriate residual values. Actual future operating results and residual values associated with our operations could differ significantly from these estimates, which may result in an impairment charge in a future period, resulting in a decrease in net income from operations in the year of the impairment, as well as a decline in our recorded net worth. Goodwill totaled $137.9 million at October 31, 2022. The results of goodwill impairment testing are described in the accompanying notes to the audited financial statements, Note 6, Goodwill and Intangible Assets of the accompanying financial statements in this Annual Report on Form 10-K.\nWe may not be able to protect our intellectual property.\nWe rely on a combination of copyright, patent, trade secrets, confidentiality procedures and contractual commitments to protect our proprietary information. However, these measures can only provide limited protection and unauthorized third parties may try to copy or reverse engineer portions of our products or may otherwise obtain and use our intellectual property. If we cannot protect our proprietary information against unauthorized use, we may not be able to retain a perceived competitive advantage and we may lose sales to the infringing sellers, which may have a material adverse effect on our financial condition, results of operations and cash flows.\nWe are subject to various existing and contemplated laws, regulations and government initiatives that may materially impact the demand for our products, our profitability or our costs of doing business.\nOur business may be materially impacted by various governmental laws, regulations and initiatives that may artificially create, deflate, accelerate, or decelerate consumer demand for our products. For example, when the government issues tax credits designed to encourage increased homebuilding or energy-efficient window purchases, the credits may create a spike in demand that would not otherwise have occurred and our production capabilities may not be able to keep pace, which could materially impact our profitability. Likewise, when such laws, regulations or initiatives expire, our business may experience a material loss in sales volume or an increase in production costs as a result of the decline in consumer demand.\nOur operations outside the U.S. require us to comply with a number of U.S. and international anti-corruption regulations, violations of which could have a material adverse effect on our consolidated results of operations and consolidated financial condition.\nOur international operations require us to comply with a number of U.S. and international regulations, including the Foreign Corrupt Practices Act (FCPA) and the United Kingdom Bribery Act 2010. While we have implemented appropriate training and compliance programs to prevent violations of these anti-bribery regulations, we cannot ensure that our policies, procedures and programs will always protect us from reckless or criminal acts committed by our employees or agents. Allegations of violations of applicable anti-corruption laws, may result in internal, independent, or government investigations, and violations of anti-corruption laws may result in severe criminal or civil sanctions or other liabilities which could have a material adverse effect on our business, consolidated results of operations and financial condition.\nFailure to achieve and maintain effective internal controls could have a material adverse effect on our business and on our stock price.\nEffective internal controls are necessary for us to effectively monitor our business, prevent fraud or theft, remain in compliance with our credit facility covenants, and provide reliable financial reports, both to the public and to our lenders. If we fail to maintain the adequacy of our internal controls, both in accordance with current standards and as standards are modified over time, we could trigger an event of default under our credit facilities or lose the confidence of the investing community, both of which could result in a material adverse effect on our stock price, limit our ability to borrow funds, or result in the application of unfavorable commercial terms to borrowings then outstanding.\nThe impact of foreign trade relations and associated tariffs could adversely impact our business.\nWe currently source a number of raw materials from international suppliers. Import tariffs, taxes, customs duties and/or other trading regulations imposed by the U.S. government on foreign countries, or by foreign countries on the U.S., could significantly increase the prices we pay for certain raw materials, such as aluminum and wood, that are critical to our ability to manufacture our products. In addition, we may be unable to find a domestic supplier to provide the necessary raw materials on an economical basis in the amounts we require. If the cost of our raw materials increases, or if we are unable to procure the necessary raw materials required to manufacture our products, then we could experience a negative impact on our operating results, profitability, customer relationships and future cash flows.\nCompany Risks\nOur business, financial condition, and results of operations could be adversely affected by disruptions in the global economy caused by the war in Ukraine.\nU.S. and global markets are experiencing volatility and disruption following the escalation of geopolitical tensions and the start of the military conflict between Russia and Ukraine. This conflict in Ukraine could lead to market or operational disruptions, including significant volatility in commodity prices, credit and capital markets, as well as supply chain interruptions. Russia, Europes largest provider of natural gas, has significantly reduced the export of natural gas compared to the same time last year resulting in the increase in natural gas prices and the potential for natural gas shortages. In many European countries, including Germany, alternatives to natural gas have limited capacity. This has had and may continue to have a negative impact on the energy costs of our European manufacturing facilities and may also negatively impact our customers and their demand for our products. If supply chain interruptions or other disruptions result in an increase to the price of raw materials or other commodities, we could experience a negative impact on our operating results, profitability and future cash flows.\nOur business will suffer if we are unable to adequately address potential supplier or customer pricing pressures, both with respect to OEMs that have significant pricing leverage over suppliers, and to large suppliers who have significant pricing leverage over their customers.\nOur primary customers are OEMs, who have substantial leverage in setting purchasing and payment terms. In addition, many of our suppliers are large international conglomerates with numerous customers that are much larger than us, which lessens our leverage in pricing and supply negotiations. We attempt to manage this pricing pressure and to preserve our business relationships with suppliers and OEMs by negotiating reasonable price concessions when needed, and by reducing our production costs through various measures, which may include managing our purchase process to control the cost of our raw materials and components, maintaining multiple supply sources where possible, and implementing cost-effective process improvements. However, our efforts in this regard may not be successful and our operating margins could be negatively impacted.\nOur revenues could decline or we may lose business if our customers vertically integrate their operations, diversify their supplier base, or transfer manufacturing capacity to other regions.\nCertain of our businesses or product lines are largely dependent on a relatively few large customers. Although we believe we have an extensive customer base, if we were to lose one of these large customers or if one such customer were to materially reduce its purchases as a result of vertical integration, supplier diversification, or a shift in regional focus, our revenue, general financial condition and results of operations could be adversely affected.\nOur credit facility contains certain operational restrictions, reporting requirements, and financial covenants that limit the aggregate availability of funds.\nOur revolving credit facility contains certain financial covenants and other operating and reporting requirements that could present risk to our operating results or limit our ability to access capital for use in the business. For a full discussion of the various covenants and operating requirements imposed by our revolving credit facility and information related to the potential limitations on our ability to access capital, see Item 7, Managements Discussion and Analysis of Financial Conditions and Results of Operations-Liquidity and Capital Resources, included elsewhere in this Annual Report on Form 10-K.\nWe may not be able to successfully manage or integrate acquisitions, and if we are unable to do so, then our profitability could be adversely affected.\nWe cannot provide assurance that we will successfully manage or integrate acquisition targets once we have purchased them. If we acquire a business for which we do not fully understand or appreciate the specific business risks, if we overvalue or fail to conduct effective due diligence on an acquisition, or if we fail to effectively and efficiently integrate a business that we acquire, then there could be a material adverse effect on our ability to achieve the projected growth and cash flow goals associated with the new business, which could result in an overall material adverse effect on our long-term profitability or revenue generation.\nIf our information technology systems fail, or if we experience an interruption in our operations due to an aging information system infrastructure, then our results of operations and financial condition could be materially adversely affected.\nThe failure of our information technology systems, our inability to successfully maintain, enhance and/or replace our information technology systems when necessary, or a significant compromise of the integrity or security of the data that is generated from our information technology systems, could adversely affect our results of operations and could disrupt business and prevent or severely limit our ability to respond to data requests from our customers, suppliers, auditors, shareholders, employees or government authorities.\nWe are subject to data security and privacy risks that could negatively affect our results or operations.\nIn addition to our own sensitive and proprietary business information, we collect transactional and personal information about our customers and employees. Any breach, including ransomware attacks or other cybersecurity breaches, of our or our service providers network or other vendor systems, may result in the loss of confidential business and financial data, misappropriation of our consumers or employees personal information or a disruption of our business. Any of these outcomes could have a material adverse effect on our business or our vendor and customer relationships, and could also result in unwanted media attention, reputational damage, or the imposition of fines, lawsuits, or significant legal or remediation expenses.\nEpidemics, pandemics or other disease outbreaks could significantly disrupt our operations or those of our customers or suppliers.\nIf the COVID-19 coronavirus, or any other epidemic or pandemic, disrupts the worldwide economy, or if similar widespread disease outbreaks occur in the future, our business, financial condition and results of operations could be negatively affected to the extent such event harms the economy or region in which we operate.\nOur business could be materially and adversely affected by the occurrence of a widespread health epidemic or pandemic. In particular, any outbreak or resurgence of COVID-19 such as the spread of the Omicron variant, Delta variant or any other future variants, or governmental imposition of mandatory or voluntary closures in areas where our manufacturing facilities, suppliers or customers are located, could severely disrupt our operations and result in (a) plant slowdowns or shutdowns, (b) difficulty obtaining necessary supplies, and (c) reduced customer orders and revenues. In addition to this potential direct\nimpact on our facilities and operations, continuing outbreaks of the virus could negatively impact our industry and end markets as a whole, or result in a longer-term economic recession. Any of these factors could negatively affect our business, financial condition, cash flows, profitability, and results of operations.\nThe COVID-19 pandemic has had and may continue to create inefficiencies or interruptions in the supply chain as our suppliers may be forced to close their own plants or prove unable to obtain their own raw materials. If our suppliers are unable to timely meet our supply needs, it could impact our ability to provide our customers with high quality products on a timely basis, which could result in order cancellations, delivery refusals, price concessions, or other negative customer outcomes, any of which could negatively impact our business, revenues, financial condition, results of operations and liquidity. We could also be forced to pay higher prices for the supplies we purchase, which could negatively impact our results of operations and profitability.\nWe may not have the right personnel in place to achieve our operating goals, and the rural location of some of our operations may make it difficult to locate or hire highly skilled employees.\nWe operate in some rural areas and small towns where the competition for labor can be fierce, and where the pool of qualified employees may be very small. If we are unable to obtain or retain skilled workers and adequately trained professionals to conduct our business, we may not be able to manage our business to the necessary high standards. In addition, we may be forced to pay higher wages or offer other benefits that might impact our cost of labor and thereby negatively impact our profitability.\nEquipment failures or catastrophic loss at any of our manufacturing facilities could prevent us from producing our products.\nAn interruption in production capabilities at any of our facilities due to equipment failure, catastrophic loss, or other reasons could result in our inability to manufacture products, which could severely affect delivery times, return or cancellation rates, and future sales, any of which could result in lower sales and earnings or the loss of customers. Although we have a disaster recovery plan in place, we currently have one plant which is the sole source for our insulating glass spacer business in the U.S. If that plant were to experience a catastrophic loss and our disaster recovery plan were to fail, it could have a material adverse effect on our results of operations or financial condition.\nProduct liability claims and product replacements could harm our reputation, revenue generation and financial condition, or could result in costs related to litigation, warranty claims, or customer accommodations.\nWe have, on occasion, found flaws and deficiencies in the manufacturing, design, testing or installation of our products, which may result from a product defect, a defect in a component part provided by our suppliers, or as a result of the product being installed incorrectly by our customer or an end user. The failure of products before or after installation could result in litigation or claims by our customers or other users of the products, or in the expenditure of costs related to warranty coverage, claim settlement, litigation, or customer accommodation. In addition, we are currently party to certain legal claims related to a commercial sealant product, and there is no assurance that we will prevail on those claims. We may be required to expend legal fees, expert costs, and other costs associated with defending the claims and/or lawsuits. We may elect to enter into legal settlements or be forced to pay any judgments that result from an adverse court decision. Any such settlements, judgments, fees and/or costs could negatively impact our profitability, results of operations, cash flows and financial condition.\nOur insurance coverage may be inapplicable or inadequate to cover certain liabilities, and our insurance policies may exclude coverage for certain matters.\nWhile we maintain a robust insurance program that is reasonably designed to cover our known and unknown risks, there is no assurance that our insurance carriers will voluntarily agree to cover every potential liability, or that our insurance policies include limits high enough to cover all liabilities associated with our business or products. In addition, coverage under our insurance policies may be unavailable in the future for certain products. For example, during a prior renewal of our insurance program, our insurance carriers excluded future coverage of a product line we no longer manufacture or sell. If our insurers refuse to cover claims, in whole or in part, or if we exhaust our available insurance coverage at some point in the future, then we might be forced to expend legal fees and settlement or judgment costs, which could negatively impact our profitability, results of operations, cash flows and financial condition.\nClimate change and related extreme weather events could disrupt our supply chain, decrease customer demand for our products, or damage our manufacturing facilities.\nWe, along with many of our customers and suppliers, operate manufacturing facilities in areas at risk for extreme weather events such as hurricanes, tornadoes, drought, wildfires, winter storms, or floods. Ongoing climate change has increased the frequency and severity of these events and the related risk of a catastrophic weather event affecting one of our plants, or a plant owned by one of our customers or suppliers. If such an event occurs at a facility belonging to one of our customers, we could see reduced demand for our products. If such an event occurs at a facility belonging to us or one of our suppliers, we may be unable to timely and cost-effectively manufacture products for our customers. These declines in demand or impacts to our ability to manufacture our products could negatively impact our revenues, earnings, cash flow, and other operating results.\nChanges in taxation as well as the inherent difficulty in quantifying potential tax effects of business decisions could have a material adverse effect on the results of our operations, financial condition, or cash flows.\nWe file income tax returns, including tax returns for our subsidiaries, with federal, state, local, and foreign jurisdictions. We consider the United States to be our most significant jurisdiction; however, all tax returns are subject to routine compliance review by the taxing authorities in the jurisdictions in which we file tax returns in the ordinary course of business. We make judgments regarding the utilization of existing deferred tax assets and the potential tax effects of various financial transactions and results of operations to estimate our obligations to taxing authorities. Tax obligations include income, franchise, real estate, sales and use, and employment-related taxes. These judgments include reserves for potential adverse outcomes regarding tax positions that have been taken. Changes in federal, state, or local tax laws, adverse tax audit results, or adverse tax rulings on positions taken could have a material adverse effect on the results of our operations, financial condition, or cash flows.\nRisks Associated with Investment in Quanex Securities\nOur corporate governance documents and the provisions of Delaware law may delay or preclude a business acquisition or divestiture that stockholders may consider to be favorable, which might result in a decrease in the value of our common shares.\nOur certificate of incorporation and bylaws and Delaware law contain provisions that could make it more difficult for a third party to acquire us without the consent of our Board of Directors. These provisions include restrictions on the ability of our stockholders to remove directors and supermajority voting requirements for stockholders to amend our organizational documents and limitations on action by our stockholders by written consent. In addition, our Board of Directors has the right to issue preferred stock without stockholder approval, which could be used to dilute the stock ownership of a potential hostile acquirer. Although we believe these provisions protect our stockholders from coercive or otherwise unfair takeover tactics, and thereby provide for an opportunity for us to receive a higher bid by requiring potential acquirers to negotiate with our Board of Directors, these provisions apply even if the offer may be considered beneficial by some stockholders.\nWe have the ability to issue additional equity securities, which would lead to dilution of our issued and outstanding common stock.\nWe are authorized to issue, without stockholder approval, 1,000,000 shares of preferred stock, no par value, in one or more series, which may give other stockholders dividend, conversion, voting, and liquidation rights, among other rights, which may be superior to the rights of holders of our common stock. The issuance of additional equity securities or securities convertible into equity securities would result in dilution of existing stockholders' equity interests. Our Board of Directors has no present intention to issue any such preferred shares, but has the right to do so in the future. In addition, we were authorized, by prior stockholder approval, to issue up to 125,000,000 shares of our common stock, $0.01 par value per share, of which 37,211,056 were issued at October 31, 2022. These authorized shares can be issued, without stockholder approval, as securities convertible into either common stock or preferred stock. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nThe following table lists our principal properties by location, general character and use as of October 31, 2022.\nLocation Character & Use of Property\nExecutive Offices\nHouston, Texas* Executive corporate office\nNorth American Fenestration Segment\nAkron, Ohio* Segment executive office and R&D facility\nRice Lake, Wisconsin Fenestration products\nCambridge, Ohio* Flexible spacer and solar adhesives\nRichmond, Kentucky Vinyl and composite extrusions\nKent, Washington* Vinyl and composite extrusions\nEuropean Fenestration Segment\nDenby, United Kingdom* Vinyl and composite extrusions\nHeinsberg, Germany* Flexible spacer\nNorth American Cabinet Components Segment\nSt. Cloud, Minnesota Hardwood doors & components for kitchen and bath\n* These locations are leased as of October 31, 2022.\nIn addition to the locations identified above, our North American Fenestration Segment maintains 14 additional facilities for the manufacture and distribution of fenestration, spacer and extrusion products within the continental U.S., our European Fenestration Segment maintains one additional location for the production of spacer in the U.K., and our North American Cabinet Components Segment maintains 11 locations to manufacture hardwood doors and other wood components for kitchen and bath cabinets. See Note 1, Nature of Operations, Basis of Presentation and Significant Accounting Policies - Restructuring, to the accompanying consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nWe believe our operating properties are in good condition and well maintained, and are generally suitable and adequate to carry on our business. In fiscal 2022, on a consolidated basis, our facilities operated at approximately 58% of machine capacity. This capacity utilization is subject to variability by product line, seasonality, location, labor shortages and supply chain interruptions. Item 3. Legal Proceedings.\nFrom time to time, we, along with our subsidiaries, are involved in various litigation matters arising in the ordinary course of our business, including those arising from or related to contractual matters, commercial disputes, intellectual property, personal injury, environmental matters, product performance or warranties, product liability, insurance coverage and personnel and employment disputes.\nWe regularly review with legal counsel the status of all ongoing proceedings, and we maintain insurance against these risks to the extent deemed prudent by our management and to the extent such insurance is available. However, there is no assurance that we will prevail in these matters or that our insurers will accept full coverage of these matters, and we could, in the future, incur judgments, enter into settlements of claims, or revise our expectations regarding the outcome or insurability of matters we face, which could materially impact our results of operations.\nWe have been and are currently party to multiple claims, some of which are in litigation, relating to alleged defects in a commercial sealant product that was manufactured and sold during the 2000s. Several claims were resolved during fiscal 2020, 2021 and 2022, and we continue to defend the remaining claims. While we believe that our product was not defective and that we would prevail in these commercial sealant product claims if taken to trial, the timing, ultimate resolution and potential impact of these claims is not currently determinable. Nevertheless, after taking into account all currently available information, including our defenses, the advice of our counsel, and the extent and currently-expected availability of our existing insurance coverage, we believe that the eventual outcome of these commercial sealant claims will not have a material adverse effect on our overall financial condition, results of operations or cash flows, and we have not recorded any accrual with regard to these claims.\nWe reserve for litigation loss contingencies that are both probable and reasonably estimable. We do not expect that losses resulting from any current legal proceedings will have a material adverse effect on our consolidated financial statements if or when such losses are incurred.\nFor discussion of environmental issues, see Item 1, Business - Environmental and Employee Safety Matters, discussed elsewhere in this Annual Report on Form 10-K. Item 4. Mine Safety Disclosures.\nNot Applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nOur common stock has been listed on the New York Stock Exchange under the ticker symbol NX since April 24, 2008. Electronic copies of our public filings are available on the Securities and Exchange Commission's website (www.sec.gov). There were approximately 1,631 holders of our common stock (excluding individual participants in securities positions listings) on record as of December 8, 2022.\nEquity Compensation Plan Information\nThe following table summarizes certain information regarding equity compensation to our employees, officers and directors under equity compensation plans as of October 31, 2022:\n(a) (b) (c)\nPlan Category Number of securities\nto be issued upon\nexercise of outstanding\noptions, warrants and\nrights(1)\nWeighted-average\nexercise price of\noutstanding options,\nwarrants and rights(2)\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\nEquity compensation plans approved by security holders\n361,567 $ 19.39 2,863,024\n(1) Column (a) includes securities that may be issued upon future vesting of performance restricted stock units that have been previously granted to key employees and officers. The number of securities reflected in this column includes the maximum number of shares that would be issued pursuant to these performance restricted stock units assuming the performance measures are achieved. The performance measures may not be achieved.\n(2) The weighted-average exercise price in column (b) does not include the impacts of the performance share awards or any securities that may be issued thereunder. For additional details, see Note 13, Stock-Based Compensation, of the accompanying financial statements in this Annual Report on Form 10-K.\nIssuer Purchases of Equity Securities\nOn August 30, 2018, our Board of Directors approved a stock repurchase program that authorized the repurchase of up to $60.0 million worth of shares of our common stock. As of October 31, 2021, this share repurchase authorization was exhausted and the program was complete. During December 2021, our Board of Directors approved a new stock repurchase program that authorized the repurchase of up to $75.0 million worth of shares of our common stock. Repurchases under the new program will be made in open market transactions or privately negotiated transactions, subject to market conditions, applicable legal requirements and other relevant factors. During the three months ended October 31, 2022, we did not purchase any shares under this program and as of October 31, 2022 we had a maximum of $68.4 million available to purchase shares under this program. During the years ended October 31, 2022, 2021 and 2020, we purchased 291,000, 478,311 and 450,000 shares, respectively, at a cost of $6.6 million, $11.2 million and $7.2 million, respectively, under these programs. The new program does not have an expiration date or a limit on the number of shares that may be purchased.\nStock Performance Graph\nThe following chart represents a comparison of the five year total return of our common stock to the Standard & Poors 500 Index (S&P 500 Index), the Russell 2000 Index, and a peer group index selected by us, which includes companies offering similar products and services to ours. The companies in our peer group for the year ended October 31, 2022 are AAON Inc., American Woodmark Corp, Apogee Enterprises Inc., Armstrong Flooring Inc., Cornerstone Building Brands Inc., CSW Industrials Inc., Gibraltar Industries Inc., Griffon Corporation, Insteel Industries Inc., L.B. Foster Company, Masonite International Corp, Mueller Water Products, Inc., Patrick Industries Inc., PGT Innovations, Inc., Simpson Manufacturing Company Inc., Tredegar Corp, and Trex Company Inc.\nINDEXED RETURNS For the Years Ended\nCompany Name / Index 10/31/2017 10/31/2018 10/31/2019 10/31/2020 10/31/2021 10/31/2022\nQuanex Building Products Corporation $ 100.00 $ 68.21 $ 90.57 $ 87.29 $ 100.71 $ 109.28\nS&P 500 Index $ 100.00 $ 107.35 $ 122.72 $ 134.64 $ 192.42 $ 164.31\nRussell 2000 Index $ 100.00 $ 101.87 $ 106.87 $ 106.72 $ 160.93 $ 131.10\nPeer Group $ 100.00 $ 91.74 $ 115.76 $ 134.75 $ 186.72 $ 140.43  Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis contains forward-looking statements based on our current assumptions, expectations, estimates and projections about our business and the homebuilding industry, and therefore, it should be read in conjunction with our consolidated financial statements and related notes thereto, as well as our Cautionary Note Regarding Forward-Looking Statements discussed elsewhere within this Annual Report on Form 10-K. For a listing of potential risks and uncertainties which impact our business and industry, see Item 1A. Risk Factors. Actual results could differ from our expectations due to several factors which include, but are not limited to: the impact of market price and demand for our products, economic and competitive conditions, capital expenditures, new technology, regulatory changes and other uncertainties. Unless otherwise required by law, we undertake no obligation to publicly update any forward-looking statements, even if new information becomes available or other events occur in the future.\nOur Business\nWe currently manufacture components for original equipment manufacturers in the building products industry. The majority of these components can be categorized as window and door (fenestration) components and kitchen and bath cabinet components. Examples of fenestration components include (1) energy-efficient flexible insulating glass spacers, (2) extruded vinyl profiles, (3) window and door screens, and (4) precision-formed metal and wood products. In addition, we provide certain other non-fenestration components and products, which include solar panel sealants, trim moldings, vinyl decking, vinyl fencing, water retention barriers, and conservatory roof components. We use low-cost production processes and engineering expertise to provide our customers with specialized products for their specific applications. We believe these capabilities provide us with unique competitive advantages. We serve a primary customer base in North America and the U.K., and also serve customers in international markets through our operating plants in the U.K. and Germany, as well as through sales and marketing efforts in other countries.\nWe continue to invest in organic growth initiatives and we intend to continue evaluating business acquisitions that allow us to expand our existing fenestration and cabinet component footprint, enhance our product offerings, provide new complementary technology, enhance our leadership position within the markets we serve, and expand into new markets or service lines. We have disposed of non-core businesses in the past, and continue to evaluate our business portfolio to ensure that we are investing in markets where we believe there is potential future growth.\nWe currently have three reportable business segments: (1) North American Fenestration segment (NA Fenestration), comprising three operating segments, manufacturing vinyl profiles, IG spacers, screens and other fenestration components; (2) European Fenestration segment (EU Fenestration), comprising our U.K.-based vinyl extrusion business, manufacturing vinyl profiles and conservatories, and the European insulating glass business manufacturing IG spacers; and (3) North American Cabinet Components segment (NA Cabinet Components), comprising our North American cabinet door and components business and two wood-manufacturing plants. We maintain a grouping called Unallocated Corporate & Other, which includes transaction expenses, stock-based compensation, long-term incentive awards based on the performance of our common stock and other factors, certain severance and legal costs not deemed to be allocable to all segments, depreciation of corporate assets, interest expense, other, net, income taxes and inter-segment eliminations, and executive incentive compensation and medical expense fluctuations relative to planned costs as determined during the annual planning process. Other corporate general and administrative costs have been allocated to the reportable business segments, based upon a relative measure of profitability in order to more accurately reflect each reportable business segment's administrative costs. We allocate corporate expenses to businesses acquired mid-year from the date of acquisition. The accounting policies of our operating segments are the same as those used to prepare our accompanying consolidated financial statements. Corporate general and administrative expenses allocated during the years ended October 31, 2022, 2021 and 2020 were $24.5 million, $21.6 million and $21.7 million, respectively.\nRecent Transactions and Events\nU.S. and global markets are experiencing volatility and disruption following the escalation of geopolitical tensions and the start of the military conflict between Russia and Ukraine. Although the length and impact of the ongoing military conflict is highly unpredictable, the conflict in Ukraine could lead to market or operational disruptions, including significant volatility in commodity prices, credit and capital markets, as well as supply chain interruptions. Russia, Europes largest provider of natural gas, has significantly reduced the export of natural gas compared to the same time last year resulting in the increase in natural gas prices and the potential for natural gas shortages. If this trend continues, this would not only negatively impact our European manufacturing facilities, this may also negatively impact our customers and their demand for our products. We continue to monitor these situations and their impact on our business.\nOn March 11, 2020, the WHO declared the outbreak of COVID-19 to be a global pandemic and recommended containment and mitigation measures. Many of the limitations and mandates on operations have been lifted, however, the COVID-19 pandemic and its related effects continue to have an adverse effect on many sectors of the economy and we may be further impacted.\nThe war in Ukraine and the impact of COVID-19 on the global economy including inflation and the price of raw materials, supply chain disruptions, and the volatility in interest rates including home mortgage rates are unpredictable and there may be developments outside our control requiring us to adjust our operating plan.\nMarket Overview and Outlook\nWe believe the primary drivers of our operating results continue to be North American residential remodeling and replacement (R&R) and new home construction activity. We believe that housing starts and window shipments are indicators of activity levels in the homebuilding and window industries, and we use this data, as published by or derived from third-party sources, to evaluate the market. We have historically evaluated the market using data from the National Association of Homebuilders (NAHB) with regard to housing starts, and published reports by Ducker Worldwide, LLC (Ducker), a consulting and research firm, with regard to window shipments in the U.S. We obtain market data from Catalina research, a consulting and research firm, for insight into the U.S. residential wood cabinet demand.\nIn November 2022, the NAHB forecasted calendar-year housing starts (excluding manufactured units) to be 1.5 million, 1.4 million and 1.5 million in 2022, 2023 and 2024 calendar-years, respectively. The November 2022, Ducker forecast indicated that window shipments in the R&R market are expected to increase approximately 3% and 2% in the calendar-years ended 2022 and 2023, respectively, and window shipments in the new construction market are expected to decrease 4% and 13% in the calendar-years ended 2022 and 2023, respectively, resulting in overall window shipment declines of 1% in 2022 and 5% in 2023. Derived from reports published by Ducker, the overall increase in window shipments for the trailing twelve months ended September 30, 2022 was 3%. During this period, new construction activities increased 2% and R&R increased 4%. In November 2022, Catalina Research estimated that residential semi-custom cabinet demand in the U.S. is estimated to increase 13% in 2022 and decrease 4% in 2023.\nOur U.K. vinyl business (commonly referred to as Liniar) is largely focused on the sale of vinyl house systems under the trade name Liniar to smaller window manufacturers in the U.K. Liniar is one of the larger providers of vinyl extruded products in the U.K. in terms of volume shipped. Currently, the U.K. is experiencing a shortage in affordable housing, with rising demand due in part to a growing immigrant population. Liniars current primary customers are smaller window fabricators, as opposed to the larger OEMs that comprise a large portion of the North American market. These manufacturers seek the quality and technology of the specific products identified by the Liniar trade name. In addition, Liniar services non-fenestration markets including the manufacture of roofing for conservatories, vinyl decking and vinyl water retention barriers used for landscaping. We believe there are growth opportunities within these markets in the U.K. and potential synergies which may enable us to sell complementary products.\nNA Cabinet Components manufactures kitchen and bathroom cabinet doors and components, amongst other products, using a variety of woods from traditional hardwoods to engineered wood products. Currently, most of the revenue in the NA Cabinet Components is earned in the U.S., so domestic housing starts and R&R activity constitute the primary drivers of this business as well. The cabinet door market is stratified as follows: stock (low-cost, low-variations), semi-custom (more customized, just-in-time manufacturing, higher price point) and custom (precise customer specifications, just-in-time manufacturing, high-end price point). NA Cabinet Component's primary market is semi-custom.\nOur business is seasonal, particularly our fenestration business, as inclement weather during the winter months tends to slow down construction, particularly as related to outside of the house construction. To some extent, we believe our kitchen and bathroom cabinet door business lessens the impact of seasonality on our operating results, as the cabinet business is inside of the house and less susceptible to weather.\nWe are impacted by regulation of energy standards. Although the U.S. government has been less aggressively pursuing higher energy efficiency standards in recent years, other countries have implemented higher energy efficiency standards which should bode well for our fenestration-related business in these markets, particularly our warm-edge spacer products.\nSeveral commodities in our business are subject to pricing fluctuations, including polyvinyl resin (PVC), titanium dioxide (TiO2), petroleum products, aluminum and wood. For the majority of our customers and critical suppliers, we have price adjusters in place which effectively share the base pass-through price changes for our primary commodities with our customers commensurate with the market at large. Our long-term exposure to these price fluctuations is somewhat mitigated due to the contractual component of the adjuster program. However, these adjusters are not in place with all customers and for all\ncommodities, and there is a level of exposure to such volatility due to the lag associated with the timing of price updates in accordance with our customer agreements, particularly with regard to hardwoods. In addition, some of these commodities are in high demand, particularly in Europe, which can affect the cost of the raw materials, a portion of which we may not be able to fully recover. We continue to experience some supply disruptions as high demand reduced availability of raw materials.\nThe global economy remains uncertain due to global supply chain interruptions, inflationary pressures, currency devaluations, political unrest, terror threats, global pandemics such as COVID-19, and even the political landscape in the U.S. These and other macro-economic factors have impacted the global financial markets, which may have contributed to significant changes in foreign currencies. We continue to monitor our exposure to changes in exchange rates.\nComparison of the fiscal years ended October 31, 2022 and 2021\nThis table sets forth our consolidated results of operations for the twelve-month periods ended October 31, 2022 and 2021.\nFor the Years Ended October 31,\n2022 2021 $ Change Variance %\n(Dollars in thousands)\nNet sales $ 1,221,502 $ 1,072,149 $ 149,353 14%\nCost of sales (excluding depreciation and amortization) 953,004 831,541 121,463 (15)%\nSelling, general and administrative 117,108 115,967 1,141 (1)%\nRestructuring charges - 39 (39) 100%\nDepreciation and amortization 40,109 42,732 (2,623) 6%\nOperating income 111,281 81,870 29,411 36%\nInterest expense (2,559) (2,530) (29) (1)%\nOther, net 1,041 754 287 38%\nIncome tax expense (21,427) (23,114) 1,687 7%\nNet income $ 88,336 $ 56,980 $ 31,356 55%\nOur year-over-year results by reportable segment follow. Our comparison of the results for the fiscal years ended October 31, 2021 and 2020 by reportable segment for the prior year comparative periods can be found in the annual report on Form 10-K for the year ended October 31, 2021.\nChanges Related to Operating Income by Reportable Segment:\nNA Fenestration\nFor the Years Ended October 31,\n2022 2021 $ Change Variance %\n(Dollars in thousands)\nNet sales $ 687,458 $ 578,332 $ 109,126 19%\nCost of sales (excluding depreciation and amortization) 537,900 450,356 87,544 (19)%\nSelling, general and administrative 58,735 52,959 5,776 (11)%\nRestructuring charges - 39 (39) 100%\nDepreciation and amortization 16,253 18,730 (2,477) 13%\nOperating income $ 74,570 $ 56,248 $ 18,322 33%\nOperating income margin 11 % 10 %\nNet Sales. Net sales increased $109.1 million, or 19%, for the twelve months ended October 31, 2022 compared to the same period in 2021, which was primarily driven by an increase in price and raw material surcharges of $68.5 million and a $40.7 million increase in volumes.\nCost of Sales. Cost of sales increased $87.5 million, or 19%, for the twelve months ended October 31, 2022 compared to the same period in 2021. Cost of sales, including labor, increased primarily due to higher volumes during the period as well as\nthe inflation of raw materials.\nSelling, General and Administrative. Our selling, general and administrative expenses increased by $5.8 million, or 11%, for the twelve months ended October 31, 2022 compared to the same period in 2021. This increase was due primarily to an increase in compensation expense, professional fees and general expenses year-over-year.\nDepreciation and Amortization. Depreciation and amortization expense decreased $2.5 million, or 13%, for the twelve months ended October 31, 2022 compared to the same period in 2021, reflecting the run-off of depreciation expense related to existing assets and disposals during the period.\nEU Fenestration\nFor the Years Ended October 31,\n2022 2021 $ Change Variance %\n(Dollars in thousands)\nNet sales $ 262,058 $ 251,599 $ 10,459 4%\nCost of sales (excluding depreciation and amortization) 180,268 172,033 8,235 (5)%\nSelling, general and administrative 31,846 29,894 1,952 (7)%\nDepreciation and amortization 9,674 10,373 (699) 7%\nOperating income $ 40,270 $ 39,299 $ 971 2%\nOperating income margin 15 % 16 %\nNet Sales. Net sales increased $10.5 million, or 4%, when comparing the twelve months ended October 31, 2022 compared to the same period in 2021, which was primarily driven by a $47.4 million of base price increases partially offset by $22.1 million of foreign currency rate changes and a $14.8 million decrease in volumes.\nCost of Sales. The cost of sales increased $8.2 million, or 5%, for the twelve months ended October 31, 2022 compared to the same period in 2021. Cost of sales increased primarily due to inflation of raw materials partially offset by a decrease in volumes and foreign currency impacts.\nSelling, General and Administrative. Our selling, general and administrative expense increased $2.0 million, or 7%, for the twelve months ended October 31, 2022 compared to the same period in 2021. The increase is primarily due to higher compensation and general expenses partially offset by foreign currency impacts year-over-year.\nNA Cabinet Components\nFor the Years Ended October 31,\n2022 2021 $ Change Variance %\n(Dollars in thousands)\nNet sales $ 275,704 $ 246,075 $ 29,629 12%\nCost of sales (excluding depreciation and amortization) 236,695 211,088 25,607 (12)%\nSelling, general and administrative 21,934 20,828 1,106 (5)%\nDepreciation and amortization 13,830 13,263 567 (4)%\nOperating income $ 3,245 $ 896 $ 2,349 262%\nOperating income margin 1 % - %\nNet Sales. Net sales increased $29.6 million, or 12%, for the twelve months ended October 31, 2022 compared to the same period in 2021, which was primarily driven by a $57.1 million increase in price and raw material indexes partially offset by $27.5 million decrease in volumes due to labor and material shortages throughout the supply chain.\nCost of Sales. The cost of sales increased $25.6 million, or 12%, for the twelve months ended October 31, 2022 compared to the same period in 2021, primarily as a result of lumber price inflation, which is recovered on a lag, partially offset by lower volumes during the period.\nSelling, General and Administrative. Our selling, general and administrative expense increased $1.1 million, or 5%, for the twelve months ended October 31, 2022 compared to the same period in 2021. The increase is primarily due to an increase in general expenses year-over-year.\nUnallocated Corporate & Other\nFor the Years Ended October 31,\n2022 2021 $ Change Variance %\n(Dollars in thousands)\nNet sales $ (3,718) $ (3,857) $ 139 4%\nCost of sales (excluding depreciation and amortization) (1,859) (1,936) 77 (4)%\nSelling, general and administrative 4,593 12,286 (7,693) 63%\nDepreciation and amortization 352 366 (14) 4%\nOperating loss $ (6,804) $ (14,573) $ 7,769 53%\nNet Sales. Net sales for Unallocated Corporate & Other represents the elimination of inter-segment sales for the twelve months ended October 31, 2022 and 2021.\nCost of Sales. Cost of sales for Corporate & Other consists of the elimination of inter-segment sales, profit in inventory, and other costs.\nSelling, General and Administrative. Our selling, general and administrative expenses decreased $7.7 million, or 63%, for the twelve months ended October 31, 2022 compared to the same period in 2021. This decreased due to $4.0 million of decreased compensation expense including the valuations of our stock based compensation awards, a decrease of $3.2 million related to medical expense claims, and a decrease of $0.5 million related to workers compensation claims partially offset by an increase of $1.4 million professional fees during the twelve months ended October 31, 2022 compared to the same period in 2021. Additionally, we recorded a $1.4 million loss on the sale of a plant during the twelve months ended December 31, 2021, for which we did not have a comparable expense in the corresponding twelve months ended October 31, 2022.\nChanges Related to Non-Operating Items:\nInterest Expense. Interest expense remained flat for the twelve months ended October 31, 2022 compared to the same period in 2021. The weighted average interest rate for borrowings outstanding for the twelve months ended October 31, 2022 was 2.16% compared with 1.42% for the twelve months ended October 31, 2021.\nOther, net. Other, net increased $0.3 million for the twelve months ended October 31, 2022 compared to the same period in 2021. The increase is primarily due to an increase in foreign currency transaction gains partially offset by pension benefits year-over-year.\nIncome Taxes. We recorded income tax expense of $21.4 million on pre-tax income of $109.8 million for the twelve months ended October 31, 2022, an effective rate of 19.5%, and income tax expense of $23.1 million on pre-tax income of $80.1 million for the twelve months ended October 31, 2021, an effective rate of 28.9%. The October 31, 2022 effective rate is lower than the U.S. federal statutory rate of 21% primarily due to the rate differential of non-U.S. income taxes, U.S. foreign tax credits and tax benefits associated with stock-based compensation, partially offset by U.S. taxes and non-U.S. earnings and the true-up of our accruals and related deferred taxes from prior year filings. The effective rate for the twelve months ended October 31, 2021 was impacted by state income taxes, global intangible low-taxed income, and changes in uncertain tax positions, partially offset by U.S. foreign tax credits.\nLiquidity and Capital Resources\nOverview\nHistorically, our principal sources of funds have been cash on hand, cash flow from operations, and borrowings under our credit facilities. As of October 31, 2022, we had $55.1 million of cash and cash equivalents, $13.0 million outstanding under our credit facilities, $5.0 million of outstanding letters of credit and $19.2 million outstanding under finance leases. We had $307.0 million available for use under a revolving credit facility at October 31, 2022.\nOn July 6, 2022, we entered into our Second Amended and Restated Credit Agreement (the Credit Facility) with Wells Fargo Securities, LLC, as Agent, Swingline Lender and Issuing Lender, and BofA Securities, Inc. serving as Syndication Agent. We capitalized $1.2 million of deferred financing fees related to the Credit Facility during the year ended October 31, 2022. This $325.0 million revolving credit facility has a five-year term, maturing on July 6, 2027, and replaces our previous credit facility we entered into on October 18, 2018.\nInterest payments for the Credit Facility are calculated, at our election and depending upon the Consolidated Net Leverage Ratio, at a Base Rate (0.25% to 1.00%) plus an applicable margin or at the same rate as Risk-Free Rate (RFR) Loans for\ndomestic borrowings or Eurocurrency Rate Loans (1.25% to 2.00%) plus an applicable margin. In addition, we are subject to commitment fees (0.150% to 0.250) for the unused portion of the Credit Facility. As of October 31, 2022, the applicable rate was RFR + 1.25%.\nThe weighted average interest rate of borrowings outstanding for the twelve-month periods ended October 31, 2022 and 2021 was 2.16% and 1.42%, respectively. We were in compliance with our debt covenants as of October 31, 2022. For additional details of the Revolving Credit Facility, see Note 8, Debt, included elsewhere within this Annual Report on Form 10-K.\nWe expect to repatriate excess cash moving forward and use the funds to retire debt or meet current working capital needs. We believe our business model, our current cash reserves and the recent steps we have taken to strengthen our balance sheet leave us well-positioned to manage our business and remain in compliance with our debt covenants.\nAnalysis of Cash Flow\nThe following table summarizes our cash flow results for the years ended October 31, 2022, 2021, and 2020:\nYear Ended October 31,\n2022 2021 2020\n(In millions)\nCash flows provided by operating activities $ 98.0 $ 78.6 $ 100.8\nCash flows used for investing activities $ (33.0) $ (18.7) $ (25.2)\nCash flows used for financing activities $ (45.9) $ (71.9) $ (55.1)\nOur year-over-year cash flow analysis follows. Our cash flow analysis for the fiscal years ended October 31, 2021 and 2020 for the prior year comparative periods can be found in the annual report on Form 10-K for the year ended October 31, 2021.\nOperating Activities\nOperating cash flow for the year ended October 31, 2022 increased $19.4 million while cash flow for the year ended October 31, 2021 decreased by $22.2 million. The increase in operating cash flows is primarily due to higher net income year-over-year due to increased pricing offset by unfavorable changes in working capital. The unfavorable changes in working capital were largely driven by changes in accounts receivable and payable, as well as an increase in accrued incentives year over year.\nInvesting Activities\nCash used for investing activities for the year ended October 31, 2022 increased $14.3 million compared to the year ended October 31, 2021 due to an increase of $9.1 million in capital expenditures and a decrease of $5.2 million proceeds from the disposition of capital assets.\nAt October 31, 2022, we had firm purchase commitments of approximately $1.7 million for the purchase or construction of capital assets. We plan to fund these capital expenditures through cash from operations or borrowings under our revolving credit facility.\nFinancing Activities\nFor the year ended October 31, 2022, cash used for financing activities was $45.9 million and related primarily to net debt repayments of $26.7 million, payment of dividends of $10.6 million and share repurchases of $6.6 million. For the year ended October 31, 2021, cash used for financing activities was $71.9 million and related primarily to net debt repayments of $65.7 million, share repurchases of $11.2 million and payment of dividends of $10.8 million, partially offset by $16.3 million of proceeds from the exercise of stock options.\nLiquidity Requirements\nOur strategy for deploying cash is to invest in organic growth opportunities, develop our infrastructure, and explore strategic acquisitions. Other uses of cash include paying cash dividends to our shareholders and repurchasing our own stock. We maintain cash balances in foreign countries which totaled $13.6 million and $10.6 million as of October 31, 2022 and 2021. During the years ended October 31, 2022 and 2021, we repatriated $28.9 million and $28.4 million, respectively, of foreign earnings from our international divisions.\nWe believe that we have sufficient funds and adequate financial resources available to meet our anticipated liquidity needs. We expect to use our cash flow from operations to fund operations for the next twelve months and the foreseeable future. We believe these funds should be adequate to provide for our working capital requirements, capital expenditures, and dividends, while continuing to meet our debt service requirements.\nRevolving Credit Facility\nWe maintain our $325.0 million Credit Facility, which contains a revolving credit facility, with Wells Fargo Securities, LLC, as Agent, Swingline Lender and Issuing Lender, and BofA Securities, Inc. serving as Syndication Agent. The Credit Facility has a five-year term, maturing on July 6, 2027, and requires interest payments calculated, at our election and depending upon our Consolidated Net Leverage Ratio, at a Base Rate plus an applicable margin or at the same rate as Risk-Free Rate (RFR) Loans for domestic borrowings or Eurocurrency Rate Loans plus an applicable margin. At the time of the initial borrowing, the applicable rate was RFR + 1.25%. In addition, we are subject to commitment fees for the unused portion of the Credit Facility. The applicable margin and commitment fees range from 0.15% to 0.25%, depending upon the type of loan and Consolidated Net Leverage Ratio.\nThe Credit Facility provides for revolving credit commitments for a minimum principal amount of $10.0 million, up to an aggregate amount of $150.0 million or 100% of Consolidated EBITDA, subject to the lender's discretion to elect or decline the incremental increase. We can also borrow up to the lesser of $15.0 million or the revolving credit commitment, as defined, under a Swingline feature of the Credit Facility.\nThe Credit Facility contains a: (1) Consolidated Interest Coverage Ratio requirement whereby we must not permit the Consolidated Interest Coverage Ratio, as defined, to be less than 3.00 to 1.00, and (2) Consolidated Net Leverage Ratio requirement, whereby we must not permit the Consolidated Net Leverage Ratio, as defined, to be greater than 3.25 to 1.00.\nIn addition to maintaining these financial covenants, the Credit Facility also limits our ability to enter into certain business transactions, such as to incur indebtedness or liens, to acquire businesses or dispose of material assets, make restricted payments, pay dividends (limited to $25.0 million per year) and to conduct other transactions as further defined in the Credit Facility. Some of these limitations, however, do not take effect so long as Consolidated Net Leverage Ratio is less than or equal to 2.75 to 1.00 and available liquidity exceeds $25.0 million. Substantially all of our domestic assets, with the exception of real property, are pledged as collateral for the Credit Facility.\nIssuer Purchases of Equity Securities\nOn August 30, 2018, our Board of Directors approved a stock repurchase program that authorized the repurchase of up to $60.0 million worth of shares of our common stock. As of October 31, 2021, this share repurchase authorization was exhausted and the program was complete. During December 2021, our Board of Directors approved a new stock repurchase program that authorized the repurchase of up to $75.0 million worth of shares of our common stock. During the years ended October 31, 2022, 2021 and 2020, we purchased 291,000, 478,311 and 450,000 shares, respectively, at a cost of $6.6 million, $11.2 million and $7.2 million, respectively, under these programs.\nCritical Accounting Policies and Estimates\nThe preparation of our financial statements in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP) requires us to make estimates and assumptions that affect the reported amount of assets, liabilities, revenues and expenses and related disclosures of contingent assets and liabilities. Estimates and assumptions about future events and their effects cannot be perceived with certainty. Estimates may change as new events occur, as more experience is acquired, as additional information becomes available and as our operating environment changes. We base our estimates on historical experience and on various other assumptions that we believe are reasonable under the circumstances, and that we believe provide a basis for making judgments about the carrying value of assets and liabilities that are not readily available through open market quotes. We must use our judgment with regard to uncertainties in order to make these estimates. Actual results could differ from these estimates.\nWe believe the following are the most critical accounting policies used in the preparation of our consolidated financial statements as well as the significant judgments and uncertainties affecting the application of these policies. We consider an estimate to be critical if it is subjective and if changes in the estimate using different assumptions would result in a material impact to our financial position or results of operations.\nImpairment or Disposal of Long-Lived Assets\nProperty, Plant and Equipment and Intangible Assets with Defined Lives\nWe make judgments and estimates in conjunction with the carrying value of our long-term assets, including property, plant and equipment, and identifiable intangibles. These judgments may include the basis for capitalization, depreciation and amortization methods and the useful lives of the underlying assets. In accordance with U.S. GAAP, we review the carrying values of these assets for impairment whenever events or changes in circumstances indicate that the carrying value may not be recoverable. We determine that the carrying amount is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset. If the carrying value exceeds the sum of the undiscounted cash flows and after considering alternate uses for the asset, an impairment charge would be recorded in the period in which such review is performed. We measure the impairment loss as the amount by which the carrying amount of the long-lived asset exceeds its fair value. Fair value is determined by reference to quoted market prices in active markets, if available, or by calculating the discounted cash flows associated with the use and eventual disposition of the asset. Therefore, if there are indicators of impairment, we are required to make long-term forecasts of our future revenues and costs related to the assets subject to review. Forecasts require assumptions about demand for our products and future market conditions. Although there may be no indicators of impairment in the current period, unanticipated changes to assumptions or circumstances in future periods could result in an impairment charge in the period of the change. No impairment charges were incurred with regard to our property, plant and equipment for the years ended October 31, 2022, 2021 and 2020.\nWe monitor relevant circumstances, including industry trends, general economic conditions, and the potential impact that such circumstances might have on the valuation of our identifiable intangibles. Events and changes in circumstances that may cause a triggering event and necessitate such a review include, but are not limited to: a decrease in sales for certain customers, improvements or changes in technology, and/or a decision to phase-out a trademark or trade name. Such events could negatively impact the carrying value of our identifiable intangibles. It is possible that changes in such circumstances or in the numerous variables associated with the judgments, assumptions, and estimates made by us in assessing the appropriate valuation of our identifiable intangibles could require us to further write down a portion of our identifiable intangibles and record related non-cash impairment charges in the future. We apply a variety of techniques to establish the carrying value of our intangible assets, including the relief from royalty and excess current year earnings methods.\nGoodwill\nWe use the acquisition method to account for business combinations and, to the extent that the purchase price exceeds the fair value of the net assets acquired, we record goodwill. In accordance with U.S. GAAP, we are required to evaluate our goodwill at least annually. We perform our annual goodwill assessment as of August 31, or more frequently if indicators of impairment exist. Qualitative factors that indicate impairment could include, but are not limited to, (i) macroeconomic conditions, (ii) industry and market considerations, (iii) cost factors, (iv) overall financial performance of the reporting unit, and (v) other relevant entity-specific events. The first step in our annual goodwill assessment is to perform the optional qualitative assessment allowed by ASC Topic 350 Intangibles - Goodwill and Other (ASC 350). In our qualitative assessment, we evaluate relevant events or circumstances to determine whether it is more likely than not (i.e., greater than 50%) that the fair value of a reporting unit is less than its carrying amount. If we determine that it is more likely than not that the fair value of a reporting unit is less than its carrying amount, ASC 350 requires us to compare the fair value of such reporting unit to its carrying value including goodwill. To determine the fair value of our reporting units, we use multiple valuation techniques including a discounted cash flow analysis, using the applicable weighted average cost of capital, in combination with a market approach that uses market multiples and a selection of guideline public companies. This test requires us to make assumptions about the future growth of our business and the market in general, as well as other variables such as the level of investment in capital expenditure, growth in working capital requirements and the terminal or residual value of our reporting units beyond the periods of estimated annual cash flows. We use a third-party valuation firm to assist us with this analysis. If the fair value of each reporting unit exceeds its carrying value, no action is required. Otherwise, an impairment loss is recorded to the extent that the carrying amount of the reporting unit including goodwill exceeds the fair value of that reporting unit. We believe the estimates and assumptions used in our impairment assessment are reasonable based on available market information, but variations in any of the assumptions could result in materially different calculations of fair value and determinations of whether or not an impairment is indicated during current or future periods.\nAt our annual testing date, August 31, 2022, we had five reporting units with goodwill balances: two reporting units included in our NA Fenestration operating segment, two reporting units included in our EU Fenestration operating segment, and one reporting unit included in our NA Cabinet Components operating segment. We performed a qualitative assessment of one of the two reporting units in the NA Fenestration segment and the two reporting units in the EU Fenestration segment. This review included an analysis of historical goodwill test results, operating results relative to forecast, projected results over the next five years, and other measures and concluded that there were no indicators of potential impairment associated with these reporting units. Therefore, no additional testing was deemed necessary for the reporting units in the NA Fenestration segment and the EU Fenestration segment that were assessed qualitatively. We also updated the quantitative assessments for the reportable unit in the NA Cabinet Components segment and the second reportable unit in the NA Fenestration segment. We determined the fair value of these reportable units exceeded the carrying value by 12.0% and 384.9%, respectively, and concluded that no impairment was necessary.\nIncome Taxes\nWe operate in various jurisdictions and therefore our income tax expense relates to income taxes in the U.S., U.K., Canada, and Germany, as well as local and state income taxes. We recognize the effect of a change in tax rates in the period of the change. We record the estimated future tax effects of temporary differences between the tax basis of assets and liabilities and the amounts reported in our consolidated balance sheets, as well as net operating losses and tax credit carry forward. We evaluate the carrying value of our net deferred tax assets and determine if our business will generate sufficient future taxable income to realize the net deferred tax assets. We perform this review for recoverability on a jurisdictional basis, whereby we consider both positive and negative evidence related to the likelihood of realization of the deferred tax assets. The weight given to the positive and negative evidence is commensurate with the extent to which the evidence can be objectively verified. We evaluate recoverability based on an estimate of future taxable income using the long-term forecasts we use to evaluate long-lived assets, goodwill and intangible assets for impairment, taking into consideration the future reversal of existing taxable temporary differences and reviewing our current financial operations. In the event that our estimates and assumptions indicate we will not generate sufficient future taxable income to realize our deferred tax assets, we will record a valuation allowance, to the extent indicated, to reduce our deferred tax assets to their realizable value.\nAnnually, we evaluate our tax positions to determine if there have been any changes in uncertain tax positions or if there has been a lapse in the statute of limitations with regard to such positions. Our liability for uncertain tax positions at October 31, 2022 and 2021 totaled $1.4 million and are related to certain federal and state tax items regarding the interpretation of tax laws and regulations.\nWe believe we will have sufficient taxable income in the future to fully utilize our deferred tax assets recorded as of October 31, 2022, net of our valuation allowance. There is a risk that our estimates related to the future use of loss carry forwards and our ability to realize our deferred tax assets may not come to fruition, and that the results could materially impact our financial position and results of operations. Our total gross deferred tax assets at October 31, 2022 and 2021 totaled $13.9 million and $13.8 million, respectively, against which we had recorded a valuation allowance of $0.5 million and $1.2 million, respectively.\nInventory\nWe record inventory at the lower of cost or net realizable value. Inventories are valued using the first-in first-out (FIFO) method. Fixed costs related to excess manufacturing capacity have been expensed in the period, and therefore, are not capitalized into inventory. Inventory quantities are regularly reviewed and provisions for excess or obsolete inventory are recorded primarily based on our forecast of future demand and market conditions. Significant unanticipated changes to our forecasts or changes in the net realizable value of our inventory would require a change in the provision for excess or obsolete inventory. For the years ended October 31, 2022, 2021 and 2020, our inventory reserves are approximately 3%, 3%, and 10% of gross inventory, respectively.\nRetirement Plans\nWe sponsor a defined benefit pension plan and an unfunded postretirement plan that provides health care and life insurance benefits for a limited pool of eligible retirees and dependents. On January 1, 2020, we enacted changes to our pension plan whereby the benefits for all participants were frozen and thereafter those participants will receive increased benefits in the company sponsored defined contribution plan in lieu of participation in a defined benefit plan. During the three months ended October 31, 2022, we notified participants that our pension plan will be terminated effective November 1, 2022, with final settlement expected to occur in fiscal 2024. The measurement of liabilities related to these plans is based on our assumptions related to future events, including expected return on plan assets and healthcare cost trend rates. The discount rate reflects the rate at which benefits could be effectively settled on the measurement date. We determine our discount rate using a FTSE Above Median Model whereby target yields are developed from bonds across a range of maturity points, and a curve is fitted to those targets. Spot rates (zero coupon bond yields) are developed from the curve and used to discount benefit payments associated with each future year. This model assumes spot rates will remain level beyond the 30-year point. We determine the present value of plan benefits by applying the discount rates to projected benefit cash flows. Actual pension plan asset investment performance, as well as other economic experience such as discount rate and demographic experience, will either reduce or increase unamortized pension losses at the end of any fiscal year, which ultimately affects future pension costs.\nAs of October 31, 2022, our projected benefit obligation (PBO) and accumulated benefit obligation (ABO) each exceeded the fair value of the plan assets by $3.9 million. As a comparison, our PBO and ABO exceeded the fair value of plan assets by $4.7 million as of October 31, 2021. During fiscal 2022, no contributions to the pension plan were needed to meet minimum contribution requirements. Expected contributions are dependent on many variables, including the variability of the market value of the assets as compared to the obligation and other market or regulatory conditions. In addition, we take into consideration our business investment opportunities and our cash requirements. Accordingly, actual funding may differ greatly from current estimates.\nUnder U.S. GAAP, we are not required to immediately recognize the effects of a deviation between actual and assumed experience under our pension plan, or to revise our estimate as a result. This approach allows the favorable and unfavorable effects that fall within an acceptable range to be netted and disclosed as an unrecognized gain or loss. As of October 31, 2022 and 2021, a net actuarial loss of $3.6 million and $4.5 million, respectively, was included in our accumulated other comprehensive income. There were no net prior service costs or transition obligations for the years ended October 31, 2022 and 2021. The effect on fiscal years after 2022 will depend on the actual experience of the plans.\nMortality assumptions used to determine the obligations for our pension plans are based on the Pri-2012 base mortality table with MP-2021 mortality improvement scale.\nContractual Obligations and Commercial Commitments\nOur contractual obligations and commercial commitments include unconditional purchase obligations which consist of commitments to buy miscellaneous parts, inventory, and expenditures related to capital projects in progress. In addition, during fiscal 2023, we do not expect to need to contribute to our pension plan to meet our minimum contribution requirements. Pension contributions beyond 2023 cannot be determined since the amount of any contribution is heavily dependent on the future economic environment and investment returns on pension plan assets. Obligations are based on current and projected obligations of the plans, performance of the plan assets, if applicable, and the timing and amount of funding contributions. At October 31, 2022, we have recorded a long-term liability for deferred pension benefits totaling $3.9 million. We believe the effect of the plans on liquidity is not significant to our overall financial condition.\nOur supplemental benefit plan and deferred compensation plan liabilities fluctuate based on changes in the market value of certain equity securities, including our common stock. As of October 31, 2022, our liability under the supplemental benefit plan and the deferred compensation plan was approximately $1.9 million and $3.3 million, respectively.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements, as such term is defined in the rules promulgated by the SEC, that we believe would be material to investors and for which it is reasonably likely to have a current or future effect on our financial condition, results of operations, liquidity, capital expenditures or capital resources.\nEffects of Inflation\nWe have experienced the impact of inflation on our cost of raw materials, labor, freight and overhead, particularly during the year ended October 31, 2022. Although we use contractual price indexing along with periodic base price increases to\nminimize the effect of inflation on our results, we have not been able to fully recover all of the inflationary cost increases. We cannot provide assurance, however, that our results of operations and financial position will not be materially impacted by inflation in the future.\nRecent Accounting Pronouncements\nFrom time to time, new accounting pronouncements are issued by the Financial Accounting Standards Board (FASB) or other standards setting bodies that we adopt as of the specified effective date. We did not adopt any new accounting pronouncements during the twelve months ended October 31, 2022. As of October 31, 2022, we believe the impact of any recently issued standards that are not yet effective are either not applicable to us at this time or will not have a material impact on our condensed consolidated financial statements upon adoption. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nThe following discussion of our exposure to various market risks contains forward looking statements regarding our estimates, assumptions and beliefs concerning our exposure. Although we believe these estimates and assumptions are reasonable in light of information currently available to us, we cannot provide assurance that these estimates will not materially differ from actual results due to the inherent unpredictability of interest rates, foreign currency rates and commodity prices as well as other factors. We do not use derivative financial instruments for speculative or trading purposes.\nInterest Rate Risk\nOur outstanding debt bears interest at variable rates and accordingly is sensitive to changes in interest rates. Based upon the balances of the variable rate debt at October 31, 2022, a hypothetical 1.0% increase or decrease in interest rates could result in approximately $0.1 million of additional pre-tax charges or credit to our operating results. This sensitivity pertains primarily to our outstanding revolving credit facility borrowings outstanding under the Credit Facility as of October 31, 2022.\nForeign Currency Rate Risk\nOur international operations have exposure to foreign currency rate risks, primarily due to fluctuations in the Euro, the British Pound Sterling and the Canadian Dollar. From time to time, we enter into foreign exchange contracts associated with our operations to manage a portion of the foreign currency rate risk. There were no derivatives outstanding as of October 31, 2022 or 2021. These foreign currency derivative contracts hedge cross-border intercompany and commercial activity for our insulating glass spacer business. Although these derivatives hedge our exposure to fluctuations in foreign currency rates, we do not apply hedge accounting and therefore, the change in the fair value of these foreign currency derivatives is recorded directly to other income and expense in the accompanying consolidated statements of income. To the extent the gain or loss on the derivative instrument offsets the gain or loss from the re-measurement of the underlying foreign currency balance, changes in exchange rates should have no effect.\nCommodity Price Risk\nWe purchase PVC as the significant raw material consumed in the manufacture of vinyl extrusions. We have resin adjusters in place with a majority of our customers and our resin supplier that is adjusted based upon published indices for lagging resin prices. These adjusters effectively share the base pass-through price changes of PVC with our customers commensurate with the market at large. Our long-term exposure to changes in PVC prices is somewhat mitigated due to the contractual component of the resin adjuster program. However, there is a level of exposure to short-term volatility due to timing lags.\nWe adjust the pricing of petroleum-based raw materials for the majority of our customers who purchase products using these materials. This is intended to offset the fluctuating cost of products which are highly correlated to the price of oil including butyl and other oil-based raw materials. This program is adjusted monthly based upon the 90-day average published price for Brent crude. The oil-based raw materials that we purchase are subject to similar pricing schemes. As such, our long-term exposure to increases in oil-based raw material prices is significantly reduced under this program.\nSimilarly, NA Cabinet Components includes a price index provision in the majority of its customer arrangements to insulate against significant fluctuations in the price for various hardwood products used as the primary raw material for kitchen and bathroom cabinet doors. Like our vinyl extrusion business, we are exposed to short-term volatility in wood prices due to a lag in the timing of price updates which generally could extend for up to three months.\nWe have begun implementing additional programs for other raw materials to facilitate more accurate pricing and reduce our exposure to changing material costs when necessary, however these are also subject to timing lags. While we maintain surcharges and other adjusters to manage our exposure to changes in the prices of our critical raw materials, we use several\ncommodities in our business that are not covered by contractual surcharges or adjusters for which pricing can fluctuate, including PVC compound micro ingredients, silicone and other inputs. Item 8. Financial Statements and Supplementary Data.\nQuanex Building Products Corporation\nPage\nReports of Independent Registered Public Accounting Firm (PCAOB ID 248)\nManagement's Annual Report on Internal Control over Financial Reporting 34\nConsolidated Financial Statements\nConsolidated Balance Sheets 35\nConsolidated Statements of Income 36\nConsolidated Statements of Comprehensive Income 37\nConsolidated Statement of Stockholders Equity 38\nConsolidated Statements of Cash Flow 39\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Stockholders\nQuanex Building Products Corporation\nOpinion on the financial statements\nWe have audited the accompanying consolidated balance sheets of Quanex Building Products Corporation (a Delaware corporation) and subsidiaries (the Company) as of October 31, 2022 and 2021, the related consolidated statements of income, changes in stockholders equity, and cash flows for each of the three years in the period ended October 31, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of October 31, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended October 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of October 31, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO), and our report dated December 16, 2022 expressed an unqualified opinion.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical audit matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nQuantitative goodwill impairment assessment of the reporting unit included in the North American Cabinet Components operating segment\nAs described in Note 1 to the financial statements, the Company performs its annual goodwill impairment test as of August 31. The Company performed a quantitative assessment of the reporting unit included in the North American Cabinet Components operating segment primarily due to the history of a narrow margin of fair value over carrying value in the quantitative assessments performed in prior years. We identified the estimation of the fair value of this reporting unit as a critical audit matter.\nThe principal considerations for our determination that the estimation of the fair value of this reporting unit is a critical audit matter relates to the use of the income approach which is one method management uses to estimate the fair value of the reporting unit. Auditing the fair value of the reporting unit involved a high degree of auditor judgment, subjectivity and audit effort in evaluating managements significant assumptions used in the income approach, including future cash flows related to the reporting unit and the weighted average cost of capital (WACC). In addition, the audit effort involved the use of valuation specialists to assist in performing these procedures and evaluating the audit evidence obtained.\nOur audit procedures related to the estimation of the fair value of this reporting unit included the following, among others.\nWe tested the effectiveness of controls over goodwill impairment including those over the determination of fair value, including controls relating to managements development of forecasts of future revenues, earnings, cash flows and WACC.\nWe evaluated managements ability to accurately forecast revenues, earnings and cash flows by comparing actual results to managements historical forecasts.\nWe evaluated the reasonableness of managements forecasts of revenues, earnings and cash flows by comparing the forecasts to historical revenues, earnings and cash flows, current budgets, our understanding of the current business strategy, communications to the Board of Directors, press releases and industry reports.\nWe utilized our valuation specialists to evaluate the reasonableness of the WACC used by management, including the testing of underlying source information and developing a range of independent estimates and comparing those to the rate selected by management.\n/s/ GRANT THORNTON LLP\nWe have served as the Company's auditor since 2014.\nHouston, Texas\nDecember 16, 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Stockholders\nQuanex Building Products Corporation\nOpinion on internal control over financial reporting\nWe have audited the internal control over financial reporting of Quanex Building Products Corporation (a Delaware corporation) and subsidiaries (the Company) as of October 31, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of October 31, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by COSO.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements of the Company as of and for the year ended October 31, 2022, and our report dated December 16, 2022 expressed an unqualified opinion on those financial statements.\nBasis for opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Annual Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and limitations of internal control over financial reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ GRANT THORNTON LLP\nHouston, Texas\nDecember 16, 2022\nMANAGEMENTS ANNUAL REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement of the Company, including the Chief Executive Officer and Chief Financial Officer, is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934, as amended. The Companys internal control system was designed to provide reasonable assurance to management and the Companys Board of Directors regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nAll internal control systems, no matter how well designed, have inherent limitations. A system of internal control may become inadequate over time because of changes in conditions, or deterioration in the degree of compliance with the policies or procedures. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of October 31, 2022 using the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control - Integrated Framework (2013). Based on this assessment, management has concluded that, as of October 31, 2022, the Companys internal control over financial reporting was effective to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles based on such criteria.\nGrant Thornton LLP, the Companys independent registered public accounting firm, has issued an attestation report on the effectiveness of the Companys internal control over financial reporting.\nQUANEX BUILDING PRODUCTS CORPORATION\nCONSOLIDATED BALANCE SHEETS\nAs of October 31, 2022 and 2021\nOctober 31,\n2022 2021\n(In thousands, except share\namounts)\nASSETS\nCurrent assets:\nCash and cash equivalents $ 55,093 $ 40,061\nAccounts receivable, net of allowance for credit losses of $289 and $340\n96,018 108,309\nInventories, net 120,890 92,529\nPrepaid and other current assets 8,664 8,148\nTotal current assets 280,665 249,047\nProperty, plant and equipment, net of accumulated depreciation of $348,528 and $336,493\n180,400 178,630\nOperating lease right-of-use assets 56,000 52,708\nGoodwill 137,855 149,205\nIntangible assets, net 65,035 82,410\nOther assets 4,662 5,323\nTotal assets $ 724,617 $ 717,323\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable $ 77,907 $ 86,765\nAccrued liabilities 52,114 56,156\nIncome taxes payable 1,049 6,038\nCurrent maturities of long-term debt 1,046 846\nCurrent operating lease liabilities 7,727 8,196\nTotal current liabilities 139,843 158,001\nLong-term debt 29,628 52,094\nNoncurrent operating lease liabilities 49,286 45,367\nDeferred pension and postretirement benefits 3,917 4,737\nDeferred income taxes 22,277 21,965\nLiability for uncertain tax positions 1,361 1,388\nOther liabilities 13,470 13,989\nTotal liabilities 259,782 297,541\nCommitments and contingencies\nStockholders equity:\nPreferred stock, no par value, shares authorized 1,000,000 issued and outstanding - none\n- -\nCommon stock, $0.01 par value, shares authorized 125,000,000 issued 37,211,056 and 37,273,510 respectively; outstanding 33,129,250 and 33,274,785, respectively\n372 373\nAdditional paid-in-capital 251,947 254,162\nRetained earnings 337,456 259,718\nAccumulated other comprehensive loss (49,422) (21,770)\nLess: Treasury stock at cost, 4,081,806 and 3,998,725 shares, respectively\n(75,518) (72,701)\nTotal stockholders equity 464,835 419,782\nTotal liabilities and stockholders' equity $ 724,617 $ 717,323\nSee notes to consolidated financial statements.\nQUANEX BUILDING PRODUCTS CORPORATION\nCONSOLIDATED STATEMENTS OF INCOME\nFor the Years Ended October 31, 2022, 2021 and 2020\nYear Ended October 31,\n2022 2021 2020\n(In thousands, except per share amounts)\nNet sales $ 1,221,502 $ 1,072,149 $ 851,573\nCost and expenses:\nCost of sales (excluding depreciation and amortization) 953,004 831,541 658,750\nSelling, general and administrative 117,108 115,967 89,707\nRestructuring charges - 39 622\nDepreciation and amortization 40,109 42,732 47,229\nOperating income 111,281 81,870 55,265\nNon-operating (expense) income:\nInterest expense (2,559) (2,530) (5,245)\nOther, net 1,041 754 280\nIncome before income taxes 109,763 80,094 50,300\nIncome tax expense (21,427) (23,114) (11,804)\nNet income $ 88,336 $ 56,980 $ 38,496\nBasic earnings per common share $ 2.67 $ 1.72 $ 1.18\nDiluted earnings per common share $ 2.66 $ 1.70 $ 1.17\nWeighted-average common shares outstanding:\nBasic 33,048 33,193 32,689\nDiluted 33,205 33,495 32,821\nCash dividends per share\n$ 0.32 $ 0.32 $ 0.32\nSee notes to consolidated financial statements.\nQUANEX BUILDING PRODUCTS CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nFor the Years Ended October 31, 2022, 2021 and 2020\nYear Ended October 31,\n2022 2021 2020\n(In thousands)\nNet income $ 88,336 $ 56,980 $ 38,496\nOther comprehensive income:\nForeign currency translation adjustments (loss) gain (28,334) 7,152 1,078\nChange in pension from net unamortized gain (loss) (pretax) 897 5,477 (376)\nChange in pension from net unamortized gain (loss) tax (expense) benefit (215) (1,375) 91\nTotal other comprehensive (loss) income, net of tax (27,652) 11,254 793\nComprehensive income $ 60,684 $ 68,234 $ 39,289\nSee notes to consolidated financial statements.\nQUANEX BUILDING PRODUCTS CORPORATION\nCONSOLIDATED STATEMENT OF STOCKHOLDERS EQUITY\nFor the Years Ended October 31, 2022, 2021 and 2020\nCommon Stock Accumulated Treasury Stock Total\nShares Amount Additional Paid-in\nCapital Retained\nEarnings Other Comprehensive Loss Shares Amount Stockholders\nEquity\n(In thousands, except share amounts)\nBalance at October 31, 2019 37,370,402 $ 374 $ 254,673 $ 185,703 $ (33,817) (4,348,613) $ (76,746) $ 330,187\nNet income - - - 38,496 - - - 38,496\nForeign currency translation adjustments - - - - 1,078 - - 1,078\nChange in pension from net unamortized loss (net of tax benefit of $91)\n- - - - (285) - - (285)\nCommon dividends ($0.32 per share)\n- - - (10,534) - - - (10,534)\nTreasury shares purchased, at cost - - - - - (450,000) (7,233) (7,233)\nExpense related to stock-based compensation - - 879 - - - 879\nStock options exercised - - 66 (242) - 215,733 3,801 3,625\nRestricted stock awards granted - - (1,212) 94 - 63,400 1,118 -\nPerformance share awards vested - - (495) - - 28,051 495 -\nOther (74,236) (1) (453) - - - - (454)\nBalance at October 31, 2020 37,296,166 $ 373 $ 253,458 $ 213,517 $ (33,024) (4,491,429) $ (78,565) $ 355,759\nNet income - - - 56,980 - - - 56,980\nForeign currency translation adjustments - - - - 7,152 - - 7,152\nChange in pension from net unamortized gain (net of tax of expense of $1,375)\n- - - - 4,102 - - 4,102\nCommon dividends ($0.32 per share)\n- - - (10,779) - - - (10,779)\nExpense related to stock-based compensation - - 1,970 - - - 1,970\nTreasury shares purchased, at cost - - - - - (478,311) (11,182) (11,182)\nStock options exercised - - 1,073 - - 865,393 15,199 16,272\nRestricted stock awards granted - - (1,282) - - 73,300 1,282 -\nPerformance share awards vested - - (565) - - 32,322 565 -\nOther (22,656) - (492) - - - - (492)\nBalance at October 31, 2021 37,273,510 $ 373 $ 254,162 $ 259,718 $ (21,770) (3,998,725) $ (72,701) $ 419,782\nNet income - - - 88,336 - - - 88,336\nForeign currency translation adjustments - - - - (28,334) - - (28,334)\nChange in pension from net unamortized gain (net of tax expense of $215)\n- - - - 682 - - 682\nCommon dividends ($0.32 per share)\n- - - (10,598) - - - (10,598)\nTreasury shares purchased, at cost - - - - - (291,000) (6,600) (6,600)\nExpense related to stock-based compensation - - 2,291 - - - 2,291\nStock options exercised - - 38 - - 35,600 651 689\nRestricted stock awards granted - - (1,534) - - 84,400 1,534 -\nPerformance share awards vested - - (1,598) - - 87,919 1,598 -\nOther (62,454) (1) (1,412) - - - - (1,413)\nBalance at October 31, 2022 37,211,056 $ 372 $ 251,947 $ 337,456 $ (49,422) (4,081,806) $ (75,518) $ 464,835\nSee notes to consolidated financial statements.\nQUANEX BUILDING PRODUCTS CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOW\nFor the Years Ended October 31, 2022, 2021 and 2020\nYear Ended October 31,\n2022 2021 2020\n(In thousands)\nOperating activities:\nNet income $ 88,336 $ 56,980 $ 38,496\nAdjustments to reconcile net income to cash provided by operating activities:\nDepreciation and amortization 40,109 42,732 47,229\nLoss on disposition of capital assets 109 3,039 -\nStock-based compensation 2,291 1,970 879\nDeferred income tax 2,097 1,785 (189)\nOther, net 1,905 2,126 1,689\nChanges in assets and liabilities:\nDecrease (increase) in accounts receivable 6,945 (19,017) (5,766)\n(Increase) decrease in inventory (32,035) (31,382) 6,119\n(Increase) decrease in other current assets (970) (1,817) 2,896\n(Decrease) increase in accounts payable (3,047) 7,097 15,922\n(Decrease) increase in accrued liabilities (3,159) 16,212 (3,156)\n(Decrease) increase in income taxes payable (5,192) (378) 237\nIncrease (decrease) in deferred pension and postretirement benefits 77 (708) (2,775)\nIncrease (decrease) in other long-term liabilities 305 477 (236)\nOther, net 194 (528) (549)\nCash provided by operating activities 97,965 78,588 100,796\nInvesting activities:\nCapital expenditures (33,121) (24,008) (25,726)\nProceeds from disposition of capital assets 159 5,300 502\nCash used for investing activities (32,962) (18,708) (25,224)\nFinancing activities:\nBorrowings under credit facility 70,500 - 114,500\nRepayments of credit facility borrowings (95,500) (65,000) (154,000)\nDebt issuance costs (1,210) - -\nRepayments of other long-term debt (1,747) (680) (1,027)\nCommon stock dividends paid (10,598) (10,779) (10,534)\nIssuance of common stock 689 16,272 3,626\nPayroll tax paid to settle shares forfeited upon vesting of stock (1,413) (492) (454)\nPurchase of treasury stock (6,600) (11,182) (7,233)\nCash used for financing activities (45,879) (71,861) (55,122)\nEffect of exchange rate changes on cash and cash equivalents (4,092) 421 303\nIncrease (decrease) in cash and cash equivalents 15,032 (11,560) 20,753\nCash and cash equivalents at beginning of period 40,061 51,621 30,868\nCash and cash equivalents at end of period $ 55,093 $ 40,061 $ 51,621\nSee notes to consolidated financial statements.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. Nature of Operations, Basis of Presentation and Significant Accounting Policies\nNature of Operations\nQuanex Building Products Corporation is a component supplier to original equipment manufacturers (OEMs) in the building products industry. These components can be categorized as window and door (fenestration) components and kitchen and bath cabinet components. Examples of fenestration components include: (1) energy-efficient flexible insulating glass spacers, (2) extruded vinyl profiles, (3) window and door screens, and (4) precision-formed metal and wood products. We also manufacture cabinet doors and other components for OEMs in the kitchen and bathroom cabinet industry. In addition, we provide certain other non-fenestration components and products, which include solar panel sealants, trim moldings, vinyl decking, fencing, water retention barriers, and conservatory roof components. We have organized our business into three reportable business segments: (1) North American Fenestration (NA Fenestration), (2) European Fenestration (EU Fenestration) and (3) North American Cabinet Components (NA Cabinet Components). For additional discussion of our reportable business segments, see Note 16, Segment Information. We use low-cost production processes and engineering expertise to provide our customers with specialized products for their specific window, door, and cabinet applications. We believe these capabilities provide us with unique competitive advantages. We serve a primary customer base in North America and the United Kingdom (U.K.), and also serve customers in international markets through our operating plants in the U.K. and Germany, as well as through sales and marketing efforts in other countries.\nUnless the context indicates otherwise, references to Quanex, the Company, we, us and our refer to the consolidated business operations of Quanex Building Products Corporation and its subsidiaries.\nBasis of Presentation and Principles of Consolidation\nOur consolidated financial statements have been prepared by us in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP). We consolidate our wholly-owned subsidiaries and eliminate intercompany sales and transactions. We have no cost or equity investments in companies that are not wholly-owned. In our opinion, these audited financial statements contain all adjustments necessary to fairly present our financial position, results of operations and cash flows for the periods presented.\nUse of Estimates\nIn preparing financial statements, we make informed judgments and estimates that affect the reported amounts of assets and liabilities as of the date of the financial statements and affect the reported amounts of revenues and expenses during the reporting period. We review our estimates on an ongoing basis, including those related to impairment of long lived assets and goodwill, pension and retirement liabilities, contingencies and income taxes. Changes in facts and circumstances may result in revised estimates and actual results may differ from these estimates.\nA summary of our significant accounting policies consistently applied in the preparation of the accompanying consolidated financial statements follows:\nRevenue from Contracts with Customers\nRevenue recognition\nWe recognize revenue that reflects the consideration we expect to receive for product sales upon transfer to customers. Revenue for product sales is recognized when control of the promised products is transferred to our customers, and we are entitled to consideration in exchange for such transfer. We account for a contract when a customer provides us with a firm purchase order that identifies the products to be provided, the payment terms for those products, and when collectability of the consideration due is probable.\nPerformance obligations\nA performance obligation is a promise to provide the customer with a good or service. Our performance obligations include product sales, with each product included in a customer contract being recognized as a separate performance obligation. For contracts with multiple performance obligations, the standalone selling price of each product is generally readily observable.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nRevenue from product sales is recognized at a point in time when the product is transferred to the customer, in accordance with the shipping terms, which is generally upon shipment. We estimate a provision for sales returns and warranty allowances to account for product returns related to general returns and product nonconformance.\nWe generally expense incremental costs of obtaining a contract when incurred because the amortization period would be less than one year. Additionally, we do not disclose the value of unsatisfied performance obligations for contracts with an original expected length of one year or less.\nPricing and sales incentives\nPricing is established at or prior to the time of sale with our customers and we record sales at the agreed-upon net selling price, reflective of current and prospective discounts.\nShipping and handling costs\nWe account for shipping and handling services as fulfillment services; accordingly, freight revenue is combined with the product deliverable rather than being accounted for as a distinct performance obligation within the terms of the agreement. Shipping and handling costs incurred by us for the delivery of goods to customers are considered a cost to fulfill the contract and are included in cost of sales in the accompanying consolidated statements of income.\nContract assets and liabilities\nDeferred revenue, which is not significant, is recorded when we have remaining unsatisfied performance obligations for which we have received consideration.\nDisaggregation of revenue\nWe produce a wide variety of products that are used in the fenestration industry, including insulating glass spacer systems; extruded vinyl products; metal fabricated products; and astragals, thresholds and screens. In addition, we produce certain non-fenestration products, including kitchen and bath cabinet doors and components, flooring and trim moldings, solar edge tape, plastic decking, fencing, water retention barriers, conservatory roof components, and other products.\nThe following table summarizes our product sales for the three years ended October 31, 2022, 2021, and 2020 into groupings by segment which we believe depicts how the nature, amount, timing and uncertainty of our revenues and cash flows are affected by economic factors. For further details regarding our results by segment, refer to Note 16, Segment Information.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nYear Ended October 31,\n2022 2021 2020\n(in thousands)\nNA Fenestration:\nUnited States - fenestration $ 609,572 $ 507,634 $ 427,616\nInternational - fenestration 35,906 34,610 28,585\nUnited States - non-fenestration 29,039 24,534 19,279\nInternational - non-fenestration 12,941 11,554 7,935\n$ 687,458 $ 578,332 $ 483,415\nEU Fenestration:\nInternational - fenestration $ 194,854 $ 199,511 $ 134,432\nInternational - non-fenestration 67,204 52,088 26,622\n$ 262,058 $ 251,599 $ 161,054\nNA Cabinet Components:\nUnited States - fenestration $ 17,696 $ 13,326 $ 11,842\nUnited States - non-fenestration 254,726 230,559 196,479\nInternational - non-fenestration 3,282 2,190 1,778\n$ 275,704 $ 246,075 $ 210,099\nUnallocated Corporate & Other:\nEliminations $ (3,718) $ (3,857) $ (2,995)\n$ (3,718) $ (3,857) $ (2,995)\nNet sales $ 1,221,502 $ 1,072,149 $ 851,573\nCash and Cash Equivalents\nCash equivalents include all highly liquid investments with an original maturity of three months or less. Such securities with an original maturity which exceeds three months are deemed to be short-term investments. We maintain cash and cash equivalents at several financial institutions, which at times may not be federally insured or may exceed federally insured limits. We have not experienced any losses in such accounts and believe we are not exposed to any significant credit risks on such accounts.\nConcentration of Credit Risk and Allowance for Credit Losses\nCertain of our businesses or product lines are largely dependent on a relatively few large customers. Although we believe we have an extensive customer base, the loss of one of these large customers or if such customers were to incur a prolonged period of decline in business, our financial condition and results of operations could be adversely affected. For the years ended October 31, 2022 and 2020, one customer provided more than 10% of our consolidated net sales. For the year ended October 31, 2021, no customer provided more than 10% of our consolidated net sales.\nWe have established an allowance for credit losses to estimate the risk of loss associated with our accounts receivable balances. Our policy for determining the allowance is based on factors that affect collectability, including: (a) historical trends of write-offs, recoveries and credit losses; (b) the credit quality of our customers; and (c) projected economic and market conditions. We believe our allowance is adequate to absorb any known or probable losses as of October 31, 2022. Different assumptions or changes in economic circumstances could result in changes to the allowance.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nBusiness Combinations\nWe apply the acquisition method of accounting for business combinations, which requires us to make use of estimates and judgments to allocate the purchase price paid for acquisitions to the fair value of the assets and liabilities acquired. We account for contingent assets and liabilities at fair value on the acquisition date, and record changes to fair value associated with these assets and liabilities as a period cost as incurred. We use established valuation techniques and engage reputable valuation specialists to assist us with these valuations. However, there is a risk that we may not identify all pre-acquisition contingencies or that our estimates may not reflect the actual results when realized. We use a reasonable measurement period to record any adjustment related to the opening balance sheet (generally, less than one year). After the measurement period, changes to the opening balance sheet can result in the recognition of income or expense as period costs. To the extent these items stem from contingencies that existed at the balance sheet date, but are contingent upon the realization of future events, the cost is charged to expense at the time the future event becomes known.\nInventory\nWe record inventory at the lower of cost or net realizable value. Inventories are valued using the first-in first-out (FIFO) method. Fixed costs related to excess manufacturing capacity are evaluated and expensed in the period, to ensure that inventory is properly capitalized. Inventory quantities are regularly reviewed and provisions for excess or obsolete inventory are recorded primarily based on our forecast of future demand and our estimates regarding current and future market conditions. Significant unanticipated variances to our forecasts could require a change in the provision for excess or obsolete inventory, resulting in a charge to net income during the period of the change.\nLong-Lived Assets\nProperty, Plant and Equipment and Intangible Assets with Defined Lives\nWe make judgments and estimates related to the carrying value of property, plant and equipment, intangible assets with defined lives, and long-lived assets, which include determining when to capitalize costs, the depreciation and amortization methods to use and the useful lives of these assets. We evaluate these assets for impairment when there are indicators that the carrying values of these assets might not be recoverable. Such indicators of impairment may include changes in technology, significant market fluctuations, historical losses or loss of a significant customer, or other changes in circumstance that could affect the assets ability to generate future cash flows. When we evaluate these assets for impairment, we compare the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset to its carrying value. If the carrying value exceeds the sum of the undiscounted cash flows, and there is no alternative use for the asset, we determine that the asset is impaired. To measure the impairment charge, we compare the carrying amount of the long-lived asset to its fair value, as determined by quoted market prices in active markets, if available, or by discounting the projected future cash flows. This calculation of fair value requires us to develop and employ long-term forecasts of future operating results related to these assets. These forecasts are based on assumptions about demand for our products and future market conditions. Future events and unanticipated changes to these assumptions could require a provision for impairment, resulting in a charge to net income during the period of the change.\nWe monitor relevant circumstances, including industry trends, general economic conditions, and the potential impact that such circumstances might have on the valuation of our identifiable intangible assets with finite lives. Events and changes in circumstance that may cause a triggering event and necessitate such a review include, but are not limited to: a decrease in sales for certain customers, improvements or changes in technology, and/or a decision to discontinue the use of a trademark or trade name, or to allow a patent to lapse. Such events could negatively impact the fair value of our identifiable intangible assets. In such circumstances, we may evaluate the underlying assumptions and estimates made by us in order to assess the appropriate valuation of these identifiable intangible assets and compare to the carrying value of the assets. We may be required to write down these identifiable intangible assets and record a non-cash impairment charge. When we originally value our intangible assets, we use a variety of techniques to establish the carrying value of the assets, including the relief from royalty method, excess current year earnings method and income method.\nThe World Health Organization's (WHO), declaration of COVID-19 as a global pandemic also created significant changes in market conditions throughout 2020 that have continued into 2021. We determined that these conditions were indicators of a triggering event in 2020 which necessitated an evaluation of certain long-term assets used in these businesses for potential impairment. We compared the projected undiscounted cash flows we expected to realize associated with these assets over the remaining useful lives of the primary operating assets to the net book value of the long-term assets, including goodwill, and determined that these assets were not impaired.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nDuring the year ended October 31, 2022, our North American vinyl extrusion operations in our NA Fenestration segment experienced lower-than-expected operating results due to the continued impact of inflation and historical customer contracts which prevent us from passing on the full impact of higher costs to our customers. We determined that this condition was an indicator of a triggering event which necessitated an evaluation of certain long-term assets used in this business for potential impairment. We compared the projected undiscounted cash flows we expected to realize associated with these assets over the remaining useful lives of the primary operating assets to the net book value of the long-term assets and determined that these assets were not impaired. Should we be unable to successfully increase prices to offset inflation, it is possible that we could incur an impairment in the future.\nThere were no indicators of triggering events noted for any period in the year ended October 31, 2021. Therefore, we did not record an impairment charge related to property, plant and equipment or intangible assets with defined lives during the years ended October 31, 2022, 2021 and 2020.\nSoftware development costs, including costs incurred to purchase third-party software, are capitalized when we have determined that the technology is capable of meeting our performance requirements, and we have authorized funding for the project. We cease capitalization of software costs when the software is substantially complete and is ready for its intended use. The software is then amortized over its estimated useful life. When events or circumstances indicate the carrying value of internal use software might not be recoverable, we assess the recoverability of these assets by comparing the carrying value of the asset to the undiscounted future cash flows expected to be generated from the assets use, consistent with the methodology to test other property, plant and equipment for impairment.\nProperty, plant and equipment is stated at cost and is depreciated using the straight-line method over the estimated useful lives of the assets. We capitalize betterments which extend the useful lives or significantly improve the operational efficiency of assets. We expense repair and maintenance costs as incurred.\nThe estimated useful lives of our primary asset categories at October 31, 2022 were as follows:\nUseful Life (in Years)\nLand improvements 7 to 25\nBuildings 25 to 40\nBuilding improvements 5 to 20\nMachinery and equipment 2 to 15\nLeasehold improvements are depreciated over the shorter of their estimated useful lives or the term of the lease.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nGoodwill\nWe use the acquisition method to account for business combinations and, to the extent that the purchase price exceeds the fair value of the net assets acquired, we record goodwill. In accordance with U.S. GAAP, we are required to evaluate our goodwill at least annually. We perform our annual goodwill assessment as of August 31, or more frequently if indicators of impairment exist. Qualitative factors that indicate impairment could include, but are not limited to, (i) macroeconomic conditions, (ii) industry and market considerations, (iii) cost factors, (iv) overall financial performance of the reporting unit, and (v) other relevant entity-specific events. The first step in our annual goodwill assessment is to perform the optional qualitative assessment allowed by ASC Topic 350 Intangibles - Goodwill and Other (ASC 350). In our qualitative assessment, we evaluate relevant events or circumstances to determine whether it is more likely than not (i.e., greater than 50%) that the fair value of a reporting unit is less than its carrying amount. If we determine that it is more likely than not that the fair value of a reporting unit is less than its carrying amount, ASC 350 requires us to compare the fair value of such reporting unit to its carrying value including goodwill. To determine the fair value of our reporting units, we use multiple valuation techniques including a discounted cash flow analysis, using the applicable weighted average cost of capital, in combination with a market approach that uses market multiples and a selection of guideline public companies. This test requires us to make assumptions about the future growth of our business and the market in general, as well as other variables such as the level of investment in capital expenditure, growth in working capital requirements and the terminal or residual value of our reporting units beyond the periods of estimated annual cash flows. We use a third-party valuation firm to assist us with this analysis. If the fair value of each reporting unit exceeds its carrying value, no action is required. Otherwise, an impairment loss is recorded to the extent that the carrying amount of the reporting unit including goodwill exceeds the fair value of that reporting unit. We believe the estimates and assumptions used in our impairment assessment are reasonable based on available market information, but variations in any of the assumptions could result in materially different calculations of fair value and determinations of whether or not an impairment is indicated during current or future periods.\nAt our annual testing date, August 31, 2022, we had five reporting units with goodwill balances: two reporting units included in our NA Fenestration operating segment, two reporting units included in our EU Fenestration operating segment, and one reporting unit included in our NA Cabinet Components operating segment. We performed a qualitative assessment of one of the reporting units in the NA Fenestration segment and two of the reporting units in the EU Fenestration segment. This review included an analysis of historical goodwill test results, operating results relative to forecast, projected results over the next five years, and other measures and concluded that there were no indicators of potential impairment associated with these reporting units. Therefore, no additional testing was deemed necessary for these three reporting units. Also, at our annual testing date, we performed a quantitative assessment of the reporting unit in our NA Cabinet Components segment primarily due to the impairment of goodwill during the second and fourth quarters of 2019 and the history of a narrow margin of fair value above carrying value in quantitative assessments performed in prior years. We determined that the fair value of this reporting unit exceeded their carrying values by approximately 12.0%. We also elected to update the quantitative assessment of the other reportable unit in the NA Fenestration operating segment. We determined that the fair value of this reporting unit exceeded their carrying values by approximately 384.9%. We concluded that no impairment was necessary.\nRestructuring\nWe accrue one-time severance costs pursuant to an approved plan of restructuring at the communication date, when affected employees have been notified of the potential severance and sufficient information has been provided for the employee to calculate severance benefits, in the event the employee is involuntarily terminated. In addition, we accrue costs associated with the termination of contractual commitments including leases at the time the lease is terminated pursuant to the lease provisions or in accordance with another agreement with the landlord. Otherwise, we continue to recognize lease expense through the cease-use date. After the cease-use date, we determine if our operating lease payments are at market. We assume sublet of the facility at the market rate. To the extent our lease obligations exceed the fair value rentals, we discount to arrive at the present value and record a liability. If the facility is not sublet, we expense the amount of the assumed sublet in the current period. For other costs directly related to the restructuring effort, such as equipment moving costs, we expense in the period incurred.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nInsurance\nWe manage our exposure to losses for workers compensation, group medical, property, casualty and other insurance claims through a combination of self-insurance retentions and insurance coverage with third-party carriers. We record undiscounted liabilities associated with our portion of these exposures, which we estimate by considering various factors such as our historical claims experience, severity factors and estimated claims incurred but not reported, for which we have developed loss development factors, which are estimates as to how claims will develop over time until closed. While we consider a number of factors in preparing the estimates, sensitive assumptions using significant judgment are made in determining the amounts that are accrued in the financial statements. Actual claims could differ significantly from these estimated liabilities, depending on future claims experience. We do not record insurance recoveries until any contingencies relating to the claim have been resolved.\nRetirement Plans\nWe sponsor a defined benefit pension plan and an unfunded postretirement plan that provides health care and life insurance benefits for a limited pool of eligible retirees and dependents. To measure our liabilities associated with these plans, we make assumptions related to future events, including expected return on plan assets, rate of compensation increases, and healthcare cost trend rates. The discount rate reflects the rate at which benefits could be effectively settled on the measurement date. We determine our discount rate using a FTSE Above Median pension discount curve whereby target yields are developed from bonds across a range of maturity points, and a curve is fitted to those targets. Spot rates (zero coupon bond yields) are developed from the curve and used to discount benefit payments associated with each future year. Actual pension plan asset investment performance, as well as other economic experience such as discount rate and demographic experience, will either reduce or increase unamortized pension losses at the end of any fiscal year, which ultimately affects future pension costs.\nWarranty Obligations\nWe accrue warranty obligations when we recognize revenue for certain products. Our provision for warranty obligations is based on historical costs incurred for such obligations and is adjusted, where appropriate, based on current conditions and factors. Our ability to estimate our warranty obligations is subject to significant uncertainties, including changes in product design and our overall product sales mix.\nIncome Taxes\nWe record the estimated future tax effects of temporary differences between the tax basis of assets and liabilities and the amounts reported in our consolidated balance sheets, as well as net operating losses and tax credit carry forwards. We evaluate the carrying value of the net deferred tax assets and determine whether we will be able to generate sufficient future taxable income to realize our deferred tax assets. We perform this review for recoverability on a jurisdictional basis, whereby we consider both positive and negative evidence related to the likelihood of realization of the deferred tax assets. The weight given to the positive and negative evidence is commensurate with the extent to which the evidence can be objectively verified. Cumulative losses in recent years is a significant piece of negative evidence that is difficult to overcome in determining that a valuation allowance is not needed against deferred tax assets. Thus, it is generally difficult for positive evidence regarding projected future taxable income exclusive of reversing taxable temporary differences to outweigh objective negative evidence of recent financial reporting losses. We believe we will fully realize our deferred tax assets, net of a recorded valuation allowance. We project future taxable income using the same forecasts used to test long-lived assets and intangibles for impairment, scheduling out the future reversal of existing taxable temporary differences and reviewing our most recent financial operations. In the event the estimates and assumptions indicate we will not generate sufficient future taxable income to realize our deferred tax assets, we record a valuation allowance against a portion of our deferred tax assets.\nWe evaluate our ongoing tax positions to determine if it is more-likely-than-not we will be successful in defending such positions if challenged by taxing authorities. To the extent that our tax positions do not meet the more-likely-than-not criteria, we record a liability for uncertain tax positions. We have recorded a liability for uncertain tax positions which stem from certain federal and state tax items related to the interpretation of tax laws and regulations. We continue to evaluate our positions regarding various state tax interpretations at each reporting date, until the applicable statute of limitations lapse.\nOn August 16, 2022, the Inflation Reduction Act of 2022 was enacted into U.S. law. We are continuing to evaluate the regulation but do not anticipate a material impact to our consolidated financial statements.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nDerivative Instruments\nWe have historically used financial and commodity-based derivative contracts to manage our exposure to fluctuations in foreign currency exchange rates and aluminum prices. All derivatives are measured at fair value on a recurring basis. We have not designated the derivative instruments we use as cash flow hedges under ASC Topic 815 Derivatives and Hedging (ASC 815). Therefore, all gains and losses, both realized and unrealized, are recognized in the consolidated statements of income (loss) in the period of the change as the underlying assets and liabilities are marked-to-market. We do not enter into derivative instruments for speculative or trading purposes. As such, these instruments are considered economic hedges, and are reflected in the operating activities section of the consolidated statements of cash flow.\nForeign Currency Translation\nOur consolidated financial statements are presented in our reporting currency, the United States Dollar. Our German and U.K. operations are measured using the local currency as the functional currency. The assets and liabilities of our foreign operations which are denominated in other currencies are translated to United States Dollars using the prevailing exchange rates as of the balance sheet date. Revenues and expenses are translated at the average exchange rates for the applicable period. The resulting translation adjustments are recorded as a component of accumulated other comprehensive loss on the consolidated balance sheets.\nOccasionally, we enter into transactions that are denominated in currencies other than our functional currency. At each balance sheet date, we translate these asset or liability accounts to our functional currency and record unrealized transaction gains or losses. When these assets or liabilities settle, we record realized transaction gains or losses. These realized and unrealized gains or losses are included in the accompanying consolidated statements of income under the caption, Other, net.\nStock-Based Compensation\nWe have issued stock-based compensation in the form of stock options to directors, employees and officers, and non-vested restricted stock awards to certain key employees and officers. We apply the provisions of ASC Topic 718 Compensation - Stock Compensation (ASC 718), to determine the fair value of stock option awards on the date of grant using the Black-Scholes valuation model. We recognize the fair value as compensation expense on a straight-line basis over the requisite service period of the award based on awards ultimately expected to vest. Stock options granted to directors vest immediately while the stock options granted to our employees and officers typically vest ratably over a three-year period with service and continued employment as the vesting conditions. For new option grants to retirement-eligible employees, we recognize expense and vest immediately upon grant, consistent with the retirement vesting acceleration provisions of these grants. For employees near retirement age, we amortize such grants over the period from the grant date to the retirement-eligibility date if such period is shorter than the standard vesting schedule. For grants of non-vested restricted stock, we calculate the compensation expense at the grant date as the number of shares granted multiplied by the closing stock price of our common stock on the date of grant. This expense is recognized ratably over the vesting period. Our non-vested restricted stock grants to officers and employees cliff vest over a three-year period with service and continued employment as the only vesting criteria. Our fair value determination of stock-based payment awards on the date of grant using an option-pricing model is affected by our stock price as well as assumptions regarding a number of highly complex and subjective variables. These variables include, but are not limited to, our expected stock price volatility over the term of the awards, actual and projected employee stock option exercise behavior over the expected term, our dividend rate, risk-free rate and expectation with regards to forfeitures. Option-pricing models were developed for use in estimating the value of traded options that have no vesting or hedging restrictions and are fully transferable. Because our employee stock options have certain characteristics that are significantly different from traded options, and because changes in the subjective assumptions can materially affect the estimated value, the valuation models may not provide an accurate measure of the fair value of our employee stock options. Accordingly, that value may not be indicative of the fair value observed in a willing buyer/willing seller market transaction.\nWe have granted other awards which are linked to the performance of our common stock, but will settle in cash rather than the issuance of shares of our common stock. The value of these awards fluctuates with changes in our stock price, with the resulting gains or losses reflected in the period of the change. We have recorded current and non-current liabilities related to these awards reflected in the accompanying consolidated balance sheets at October 31, 2022 and 2021. See Note 13, Stock-based Compensation.\nIn addition, we have granted performance share awards which use return on net assets as the vesting condition and the awards settle in cash. We use a Monte Carlo simulation model to value the market condition and our stock price on the date of grant to value the internal performance condition and recognize expense ratably over the vesting period of three years. We estimate that the performance measures will be met and shares will vest at target until the year of settlement (third year of cliff\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nvesting). As of October 31, 2022, we have deemed 101,200 performance share awards related to the December 2019 grants as probable to vest.\nWe have also granted performance restricted stock units which settle in shares upon vesting. These awards cliff vest upon a three-year service period with the absolute performance of our common stock as the vesting criteria. The number of performance restricted stock units earned is variable depending on the metric achieved, and the settlement method is 100% in our common stock, with accrued dividends paid in cash at the time of vesting, assuming the shares had been outstanding throughout the performance period. To value the performance restricted stock units, we use a Monte Carlo simulation model to arrive at a grant-date fair value. This amount will be adjusted for forfeitures and expensed over the three-year term of the award with a credit to additional paid-in-capital. Similar to performance shares, the performance restricted stock units are not considered outstanding shares, do not have voting rights, and are excluded from diluted weighted-average shares used to calculate earnings per share until the performance criteria is probable to result in the issuance of contingent shares. As of October 31, 2022, we have deemed 32,680 shares related to the December 2019 grants of performance restricted stock units as probable to vest.\nTreasury Stock\nWe use the cost method to record treasury stock purchases whereby the entire cost of the acquired shares of our common stock is recorded as treasury stock (at cost). When we subsequently reissue these shares, proceeds in excess of cost upon the issuance of treasury shares are credited to additional paid-in-capital, while any deficiency is charged to retained earnings.\nEarnings per Share Data\nWe calculate basic earnings per share based on the weighted average number of our common shares outstanding for the applicable period. We calculate diluted earnings per share based on the weighted average number of our common shares outstanding for the period plus all potentially dilutive securities using the treasury stock method, whereby we assume that all such shares are converted into common shares at the beginning of the period, if deemed to be dilutive. If we incur a loss from continuing operations, the effects of potentially dilutive common stock equivalents (stock options and unvested restricted stock awards) are excluded from the calculation of diluted earnings per share because the effect would be anti-dilutive. Performance shares and performance restricted stock units are excluded from contingent shares for purposes of calculating diluted weighted average shares until the performance measure criteria is probable and shares are likely to be issued.\nSupplemental Cash Flow Information\nThe following table summarizes our supplemental cash flow information for the years ended October 31, 2022, 2021 and 2020 (in thousands):\nYear Ended October 31,\n2022 2021 2020\nCash paid for interest $ 1,982 $ 1,993 $ 4,715\nCash paid for income taxes 26,410 22,160 12,118\nCash received from income tax refunds 2,235 381 352\nNoncash investing and financing activities:\n(Decrease) increase in capitalized expenditures in accounts payable $ (1,692) $ 1,124 $ 2,370\nRelated Party Transactions\nNet sales for the year ended October 31, 2022 included approximately $1.9 million of transactions with a customer which is a related party with one of our non-employee directors. We performed a review of these transactions, of which no single transaction or series of related transactions exceeded $120,000 in amount, and determined that these transactions were enacted independently of each other in fair transactions. We are not aware of any other related party transactions with any of our current non-employee directors or officers outside of their normal business functions or expected contractual duties.\nSubsequent Events\nWe have evaluated events occurring after the balance sheet date for possible disclosure as a subsequent event through the\ndate the financial statements were issued. For additional discussion of our subsequent events, see Note 20, Subsequent Events.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n2. Accounts Receivable and Allowance for Credit Losses\nAccounts receivable consisted of the following as of October 31, 2022 and 2021 (in thousands):\nOctober 31,\n2022 2021\nTrade receivables $ 95,851 $ 107,725\nOther 456 924\nTotal 96,307 108,649\nLess: Allowance for credit losses 289 340\nAccounts receivable, net $ 96,018 $ 108,309\nThe changes in our allowance for credit losses were as follows (in thousands):\nYear Ended October 31,\n2022 2021 2020\nBeginning balance as of November 1, 2021, 2020 and 2019 $ 340 $ 161 $ 393\nCurrent period provision for expected credit\nlosses 314 267 262\nAmounts written off (299) (88) (494)\nRecoveries 10 - -\nForeign currency translation adjustments (76) - -\nBalance as of October 31, 2022, 2021 and 2020 $ 289 $ 340 $ 161\n3. Inventories\nInventories consisted of the following at October 31, 2022 and 2021 (in thousands):\nOctober 31,\n2022 2021\nRaw materials $ 68,455 $ 49,867\nFinished goods and work in process 54,013 43,499\nSupplies and other 1,551 2,099\nTotal 124,019 95,465\nLess: Inventory reserves 3,129 2,936\nInventories, net $ 120,890 $ 92,529\nThe changes in our inventory reserve accounts were as follows (in thousands):\nYear Ended October 31,\n2022 2021 2020\nBeginning balance as of November 1, 2021, 2020 and 2019 $ 2,936 $ 6,484 $ 3,790\nCharged to cost of sales 494 (568) 2,713\nWrite-offs (133) (3,060) -\nOther (168) 80 (19)\nBalance as of October 31, 2022, 2021 and 2020 $ 3,129 $ 2,936 $ 6,484\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n4. Property, Plant and Equipment\nProperty, plant and equipment consisted of the following at October 31, 2022 and 2021 (in thousands):\nOctober 31,\n2022 2021\nLand and land improvements $ 10,702 $ 10,285\nBuildings and building improvements 105,696 101,740\nMachinery and equipment 384,023 386,996\nConstruction in progress 28,507 16,102\nProperty, plant and equipment, gross 528,928 515,123\nLess: Accumulated depreciation 348,528 336,493\nProperty, plant and equipment, net $ 180,400 $ 178,630\nDepreciation expense for the years ended October 31, 2022, 2021, and 2020 was $26.9 million, $28.8 million and $31.8 million, respectively.\nIf there are indicators of potential impairment, we evaluate our property, plant and equipment for recoverability over the remaining useful lives of the assets. We did not incur impairment losses associated with these assets for the years ended October 31, 2022, 2021, and 2020. See further discussion at Note 1, Nature of Operations, Basis of Presentation and Significant Accounting Policies - Long-Lived Assets - Property, Plant and Equipment and Intangible Assets with Defined Lives.\n5. Leases\nWe recognize a right-of-use (ROU) asset and lease liability for each operating and finance lease with a contractual term greater than 12 months at the time of lease inception. We include ROU assets and lease liabilities for leases that exist within other contracts. Leases with an original term of 12 months or less are not recognized on the balance sheet, and the rent expense related to those short-term leases is recognized over the lease term. We do not account for lease and non-lease (e.g. common area maintenance) components of contracts separately for any underlying asset class.\nWe lease certain manufacturing plants, warehouses, office space, vehicles and equipment under finance and operating leases. Lease commencement occurs on the date we take possession or control of the property or equipment. Original terms for our real estate-related leases are generally between five and twenty years. Original terms for equipment-related leases, primarily manufacturing equipment and vehicles, are generally between one and ten years. Some of our leases also include rental escalation clauses. Renewal options are included in the determination of lease payments when management determines the options are reasonably certain of exercise, considering financial performance, strategic importance and/or invested capital.\nIf readily determinable, the rate implicit in the lease is used to discount lease payments to present value; however, substantially all of our leases do not provide a readily determinable implicit rate. When the implicit rate is not determinable, our estimated incremental borrowing rate is utilized, determined on a collateralized basis, to discount lease payments based on information available at lease commencement.\nTotal lease costs recorded include fixed operating lease costs and variable lease costs. Most of our real estate leases require we pay certain expenses, such as common area maintenance costs, of which the fixed portion is included in operating lease costs. We recognize operating lease costs on a straight-line basis over the lease term. In addition to the above costs, variable lease costs are recognized when probable and are not included in determining the present value of our lease liability.\nThe ROU asset is measured at the initial amount of the lease liability (calculated as the present value of lease payments over the term of the lease) adjusted for lease payments made at or before the lease commencement date and initial direct costs. For operating leases, ROU assets are reduced over the lease term by the recognized straight-line lease expense less the amount of accretion of the lease liability determined using the effective interest method. For finance leases, ROU assets are amortized on a straight-line basis over the shorter of the useful life of the leased asset or the lease term. Interest expense on each finance lease liability is recognized utilizing the effective interest method. ROU assets are tested for impairment in the same manner as long-lived assets and we determined there have been no triggering events for impairment. Additionally, we monitor for events or changes in circumstances that may require a reassessment of one of our leases and determine if a remeasurement is required.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe table below presents the lease-related assets and liabilities recorded on the balance sheet at October 31, 2022 and 2021 (in thousands):\nOctober 31,\nLeases Classification 2022 2021\nAssets\nOperating lease assets Operating lease right-of-use assets $ 56,000 $ 52,708\nFinance lease assets Property, plant and equipment (less accumulated depreciation of $3,726 and $2,300)\n22,003 16,921\nTotal lease assets $ 78,003 $ 69,629\nLiabilities\nCurrent\nOperating Current operating lease liabilities $ 7,727 $ 8,196\nFinance Current maturities of long-term debt 1,336 1,114\nNoncurrent\nOperating Noncurrent operating lease liabilities 49,286 45,367\nFinance Long-term debt 17,816 14,335\nTotal lease liabilities $ 76,165 $ 69,012\nThe table below presents the components of lease costs for the year ended October 31, 2022 and 2021 (in thousands):\nYear Ended October 31,\n2022 2021\nOperating lease cost\n$ 9,934 $ 10,125\nFinance lease cost\nAmortization of leased assets 1,332 1,165\nInterest on lease liabilities 583 561\nVariable lease costs\n977 983\nTotal lease cost $ 12,826 $ 12,834\nThe table below presents supplemental cash flow information related to leases for the year ended October 31, 2022 and 2021 (in thousands):\nYear Ended October 31,\n2022 2021\nCash paid for amounts included in the measurement of lease liabilities:\nFinance leases - financing cash flows $ 1,162 $ 1,003\nFinance leases - operating cash flows $ 583 $ 561\nOperating leases - operating cash flows $ 9,955 $ 9,621\nRight-of-use assets obtained in exchange for lease liabilities:\nOperating leases $ 13,872 $ 8,737\nFinance leases $ 6,467 $ 469\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe table below presents the weighted average remaining lease terms and weighted average discount rates for the Company's leases as of October 31, 2022 and 2021:\nOctober 31,\n2022 2021\nWeighted average remaining lease term (in years)\nOperating leases 10.8 7.7\nFinancing leases 13.7 15.1\nWeighted average discount rate\nOperating leases 3.84 % 3.23 %\nFinancing leases 3.78 % 3.72 %\nThe table below presents the maturity of the lease liabilities as of October 31, 2022 (in thousands):\nOperating Leases Finance Leases\n2023 $ 9,668 $ 2,027\n2024 8,920 1,980\n2025 7,213 1,922\n2026 6,229 1,807\n2027 5,589 1,709\nThereafter 33,769 15,123\nTotal lease payments 71,388 24,568\nLess: present value discount\n14,378 5,418\nTotal lease liabilities $ 57,010 $ 19,150\n6. Goodwill and Intangible Assets\nGoodwill\nThe change in the carrying amount of goodwill for the years ended October 31, 2022 and 2021 was as follows (in thousands):\nYear Ended October 31,\n2022 2021\nBeginning balance as of November 1, 2021 and 2020\n$ 149,205 $ 146,154\nForeign currency translation adjustment (11,350) 3,051\nBalance as of October 31, 2022 and 2021\n$ 137,855 $ 149,205\nAt our annual testing date, August 31, 2022, we had five reporting units with goodwill balances. Two of these units were included in our NA Fenestration segment and had goodwill balances of $35.9 million and $2.8 million, two units were included in our EU Fenestration segment with goodwill balances of $45.1 million and $14.9 million, and our NA Cabinet Components segment had one unit with a goodwill balance of $39.2 million. The details of the results of our goodwill assessments during the year ended October 31, 2022 are more fully described at Note 1, Nature of Operations, Basis of Presentation and Significant Accounting Policies - Long-Lived Assets - Goodwill. For a summary of the change in the carrying amount of goodwill by segment, see Note 16, Segment Information.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nIdentifiable Intangible Assets\nAmortizable intangible assets consisted of the following as of October 31, 2022 and 2021 (in thousands):\nOctober 31, 2022 October 31, 2022 October 31, 2021\nRemaining Weighted Average Useful Life Gross Carrying\nAmount Accumulated\nAmortization Gross Carrying\nAmount Accumulated\nAmortization\nCustomer relationships 8 years $ 139,607 $ 88,646 $ 146,207 $ 81,086\nTrademarks and trade names 7 years 54,389 40,610 56,437 39,589\nPatents and other technology 5 years 22,390 22,095 22,525 22,084\nTotal $ 216,386 $ 151,351 $ 225,169 $ 142,759\nWe do not estimate a residual value associated with these intangible assets. See additional disclosure at Note 1, \"Nature of Operations, Basis of Presentation and Significant Accounting Policies - Restructuring.\"\nDuring the years ended October 31, 2022 and 2021, we retired fully amortized identifiable intangible assets of zero and $9.9 million, respectively, related to customer relationships.\nThe aggregate amortization expense associated with identifiable intangible assets for the years ended October 31, 2022, 2021, and 2020 was $11.9 million, $12.8 million and $14.3 million, respectively.\nEstimated remaining amortization expense, assuming current intangible balances and no new acquisitions, for future fiscal years as of October 31, 2022 (in thousands):\nEstimated\nAmortization Expense\n2023 $ 10,908\n2024 10,156\n2025 8,930\n2026 8,855\n2027 8,856\nThereafter 17,330\nTotal $ 65,035\nWe did not incur impairment losses related to our identifiable intangible assets during the years ended October 31, 2022, 2021, and 2020.\n7. Accrued Liabilities\nAccrued liabilities consisted of the following at October 31, 2022 and 2021 (in thousands):\nOctober 31,\n2022 2021\nPayroll, payroll taxes and employee benefits $ 23,878 $ 30,039\nAccrued insurance and workers compensation 7,232 6,340\nSales allowances 7,456 8,590\nDeferred compensation (current portion) - 395\nDeferred revenue 792 627\nWarranties 13 77\nAudit, legal, and other professional fees 3,136 1,886\nAccrued taxes 2,864 3,258\nOther 6,743 4,944\nAccrued liabilities $ 52,114 $ 56,156\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n8. Debt\nLong-term debt consisted of the following at October 31, 2022 and 2021 (in thousands):\nOctober 31,\n2022 2021\nRevolving Credit Facility $ 13,000 $ 38,000\nFinance lease obligations and other 19,202 15,537\nUnamortized deferred financing fees (1,528) (597)\nTotal debt 30,674 52,940\nLess: Current maturities of long-term debt 1,046 846\nLong-term debt $ 29,628 $ 52,094\nRevolving Credit Facility\nOn July 6, 2022, we entered into our Second Amended and Restated Credit Agreement (the Credit Facility) with Wells Fargo Securities, LLC, as Agent, Swingline Lender and Issuing Lender, and BofA Securities, Inc. serving as Syndication Agent. We capitalized $1.2 million of deferred financing fees related to the Credit Facility during the year ended October 31, 2022. This $325.0 million revolving credit facility has a five-year term, maturing on July 6, 2027, and replaced our previous credit facility we entered into on October 18, 2018. Our previous credit facility is more fully described in our Annual Report on Form 10-K for the fiscal year ended October 31, 2021.\nInterest payments for the Credit Facility are calculated, at our election and depending upon the Consolidated Net Leverage Ratio, at a Base Rate plus an applicable margin or at the same rate as Risk-Free Rate (RFR) Loans for domestic borrowings or Eurocurrency Rate Loans plus an applicable margin. In addition, we are subject to commitment fees for the unused portion of the Credit Facility. As of October 31, 2022, the applicable rate was RFR + 1.25%.\nThe applicable margin and commitment fees are outlined in the following table:\nPricing Level Consolidated Leverage Ratio Commitment Fee Eurocurrency Rate Loans and RFR Loans Base Rate Loans\nI Less than or equal to 1.50 to 1.00 0.150% 1.25% 0.25%\nII Greater than 1.50 to 1.00, but less than or equal to 2.25 to 1.00 0.175% 1.50% 0.50%\nIII Greater than 2.25 to 1.00, but less than or equal to 3.00 to 1.00 0.200% 1.75% 0.75%\nIV Greater than 3.00 to 1.00 0.250% 2.00% 1.00%\nIn the event of default, outstanding borrowings accrue interest at the Default Rate, as defined, whereby the obligations will bear interest at a per annum rate equal to 2% above the total per annum rate otherwise applicable.\nThe Credit Facility provides for incremental revolving credit commitments for a minimum principal amount of $10.0 million, up to an aggregate amount of $150.0 million or 100% of Consolidated EBITDA, subject to the lender's discretion to elect or decline the incremental increase. We can also borrow up to the lesser of $15.0 million or the revolving credit commitment, as defined, under a Swingline feature of the Credit Agreement.\nThe Credit Facility contains a: (1) Consolidated Interest Coverage Ratio requirement whereby we must not permit the Consolidated Interest Coverage Ratio, as defined, to be less than 3.00 to 1.00, and (2) Consolidated Net Leverage Ratio requirement whereby the Consolidated Net Leverage Ratio, as defined, must be greater than 3.25 to 1.00.\nIn addition to maintaining these financial covenants, the Credit Facility also limits our ability to enter into certain business transactions, such as to incur indebtedness or liens, to acquire businesses or dispose of material assets, make restricted payments, pay dividends (limited to $25.0 million per year) and other transactions as further defined in the Credit Facility. Some of these limitations, however, do not take effect so long as total leverage is less than or equal to 2.75 to 1.00 and available liquidity exceeds $25.0 million. Substantially all of our domestic assets, with the exception of real property were used as collateral for the Credit Agreement.\nAs of October 31, 2022, we had $13.0 million of borrowings outstanding under the Credit Facility (reduced by unamortized debt issuance costs of $1.5 million), $5.0 million of outstanding letters of credit and $19.2 million outstanding\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nunder finance leases. We had $307.0 million available for use under the Credit Facility at October 31, 2022. The borrowings outstanding as of October 31, 2022 under the Credit Facility accrue interest at 5.08% per annum, and our weighted average borrowing rate for borrowings outstanding during the years ended October 31, 2022 and 2021 was 2.16% and 1.42%, respectively. We were in compliance with our debt covenants as of October 31, 2022.\nWe maintain certain finance lease obligations related to equipment purchases, vehicles, and warehouse space. Refer to Note 5 Leases for further information regarding our finance leases.\nThe table below presents the scheduled maturity dates of our long-term debt outstanding (excluding deferred financing fees of $1.5 million) at October 31, 2022 (in thousands):\nRevolving Credit Facility Finance Leases and Other Obligations Aggregate Maturities\n2023 $ - $ 2,065 $ 2,065\n2024 - 1,992 1,992\n2025 - 1,922 1,922\n2026 - 1,807 1,807\n2027 13,000 1,709 14,709\nThereafter - 15,125 15,125\nTotal debt payments 13,000 24,620 37,620\nLess: present value discount of finance leases - (5,418) (5,418)\nTotal $ 13,000 $ 19,202 $ 32,202\n9. Retirement Plans\nWe have a number of retirement plans covering substantially all employees. We provide both defined benefit and defined contribution plans. In general, an employees coverage for retirement benefits depends on the location of employment.\nDefined Benefit Plan\nOur non-contributory, single employer defined benefit pension plan covers certain of our employees in the U.S. On January 1, 2020 we enacted changes to our pension plan whereby the benefits for all participants were frozen and thereafter those participants will receive increased benefits in the Company sponsored defined contribution plan in lieu of participation in a defined benefit plan. As a result of freezing the plan on January 1, 2020, we remeasured the pension assets and obligations for the pension plan, which resulted in a decrease to our projected benefit obligation and a corresponding net actuarial gain that was recorded in accumulated other comprehensive income.\nDuring the three months ended October 31, 2022, we notified participants that our pension plan will be terminated effective November 1, 2022, with final settlement expected to occur in fiscal 2024. Until such time that the termination is complete, the participants will receive an interest related credit on their respective balance equivalent to the prevailing 30-year Treasury rate. The majority of our pension plan participants have their benefit determined pursuant to the cash balance formula. For the remaining participants, the benefit formula is a traditional formula for retirement benefits, whereby the plan pays benefits to employees upon retirement, using a formula which considers years of service and pensionable compensation prior to retirement.\nThe Medicare Prescription Drug, Improvement and Modernization Act of 2003 was signed into law on December 8, 2003. This Act introduces a Medicare prescription-drug benefit beginning in 2006 as well as a federal subsidy to sponsors of retiree health care plans that provide a benefit at least actuarially equivalent to the Medicare benefit. We concluded that our plans are at least actuarially equivalent to the Medicare benefit. For those who are otherwise eligible for the subsidy, we have not included this subsidy per the Act in our benefit calculations. The impact to net periodic benefit cost and to benefits paid did not have a material impact on the consolidated financial statements.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nFunded Status and Net periodic Benefit Cost\nThe changes in benefit obligation and plan assets, and our funded status (reported in deferred pension and postretirement benefits on the consolidated balance sheets) were as follows (in thousands):\nOctober 31,\nChange in Benefit Obligation: 2022 2021\nBeginning balance as of November 1, 2021 and 2020\n$ 42,379 $ 44,825\nService cost 860 850\nInterest cost 806 756\nActuarial loss (6,944) (849)\nBenefits paid (349) (359)\nAdministrative expenses (604) (732)\nSettlements (3,619) (2,112)\nProjected benefit obligation at October 31, 2022 and 2021\n$ 32,529 $ 42,379\nChange in Plan Assets:\nBeginning balance as of November 1, 2021 and 2020\n$ 37,642 $ 34,120\nActual return on plan assets (4,458) 6,225\nEmployer contributions - 500\nBenefits paid (349) (359)\nAdministrative expenses (604) (732)\nSettlements (3,619) (2,112)\nFair value of plan assets at October 31, 2022 and 2021\n$ 28,612 $ 37,642\nNoncurrent liability - Funded Status $ (3,917) $ (4,737)\nAs of October 31, 2022 and 2021, included in our accumulated comprehensive loss was a net actuarial loss of $3.6 million and $4.5 million, respectively. There were no net prior service costs or transition obligations for the years ended October 31, 2022 and 2021.\nAs of October 31, 2022 and 2021, the accumulated benefit obligation was $32.5 million and $42.4 million, respectively. The accumulated benefit obligation is the present value of pension benefits (whether vested or unvested) attributed to employee service rendered before the measurement date, and based on employee service and compensation prior to that date. The accumulated benefit obligation differs from the projected benefit obligation in that it includes no assumption about future compensation levels.\nThe net periodic benefit cost for the years ended October 31, 2022, 2021 and 2020, was as follows (in thousands):\nYear Ended October 31,\n2022 2021 2020\nService cost $ 860 $ 850 $ 1,262\nInterest cost 806 756 1,139\nExpected return on plan assets (1,991) (1,960) (2,006)\nAmortization of net loss 6 143 162\nSettlements 396 222 462\nNet periodic benefit cost $ 77 $ 11 $ 1,019\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe changes in plan assets and projected benefit obligations which were recognized in our other comprehensive loss for the years ended October 31, 2022, 2021 and 2020 were as follows (in thousands):\nYear Ended October 31,\n2022 2021 2020\nNet (gain) loss arising during the period $ (495) $ (5,112) $ 2,141\nLess: Amortization of net loss 6 143 162\nLess: Curtailments - - 1,141\nLess: Settlements 396 222 462\nTotal recognized in other comprehensive (income) loss $ (897) $ (5,477) $ 376\nMeasurement Date and Assumptions\nWe generally determine our actuarial assumptions on an annual basis, with a measurement date of October 31. The following table presents our assumptions for pension benefit calculations for the years ended October 31, 2022, 2021 and 2020:\nFor the Year Ended October 31,\n2022 2021 2020 2022 2021 2020\nWeighted Average Assumptions: Benefit Obligation Net Periodic Benefit Cost\nDiscount rate 5.36% 2.77% 3.22% 2.77% 2.60% 3.10%\nRate of compensation increase -% -% -% -% -% -%\nExpected return on plan assets n/a n/a n/a 5.50% 6.00% 6.50%\nThe discount rate was used to calculate the present value of the projected benefit obligation for pension benefits. The rate reflects the amount at which benefits could be effectively settled on the measurement date. We used the FTSE Above Median Model whereby target yields are developed from bonds across a range of maturity points, and a curve is fitted to those targets. Spot rates (zero coupon bond yields) are developed from the curve and used to discount benefit payments associated with each future year. This model assumes spot rates will remain level beyond the 30-year point. We determine the present value of plan benefits by applying the discount rates to projected benefit cash flows.\nThe expected return on plan assets was used to determine net periodic pension expense. The rate of return assumptions were based on projected long-term market returns for the various asset classes in which the plans were invested, weighted by the target asset allocations. We review the return assumption at least annually. The rate of compensation increase represents the long-term assumption for expected increases in salaries.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nPlan Assets\nThe following tables provide our target allocation for the year ended October 31, 2022, as well as the actual asset allocation by asset category and fair value measurements as of October 31, 2022 and 2021:\nTarget Allocation Actual Allocation\nOctober 31, 2022 October 31, 2022 October 31, 2021\nEquity securities - % - % 51.0 %\nFixed income 100.0 % 100.0 % 49.0 %\nFair Value Measurements at\nOctober 31, 2022 October 31, 2021\n(In thousands)\nMoney market fund $ 22,508 $ 300\nLarge capitalization - 8,231\nSmall capitalization - 1,493\nInternational equity - 6,992\nOther - 2,236\nEquity securities $ - $ 18,952\nHigh-quality core bond 4,980 13,787\nHigh-quality government bond 547 2,301\nHigh-yield bond 577 2,302\nFixed income $ 6,104 $ 18,390\nTotal securities(1)\n$ 28,612 $ 37,642\n(1)Quoted prices in active markets for identical assets (Level 1).\nInputs and valuation techniques used to measure the fair value of plan assets vary according to the type of security being valued. All of the equity and debt securities held directly by the plans were actively traded and fair values were determined based on quoted market prices.\nOur investment objective for defined benefit plan assets is to meet the plans benefit obligations, while minimizing the potential for future required plan contributions. As steps were initiated to implement the termination of the defined benefit plan, the investments were transitioned to more liquid assets in order to reflect the upcoming settlement charges which will be incurred upon finalization of the termination plan.\nExpected Benefit Payments and Funding\nOur pension funding policy is to make the minimum annual contributions required pursuant to the plan. For the fiscal years ended October 31, 2022, 2021 and 2020, we made total pension contributions of zero, $0.5 million and $3.7 million, respectively.\nDuring fiscal year 2024, we expect to make a contribution which will fully fund the remaining liability and complete the pension plan termination process. This expected contribution will be dependent on many variables, including the market value of the assets compared to the obligation, as well as other market or regulatory conditions. Accordingly, actual funding amounts and the timing of such funding may differ from current estimates.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe following table presents the total benefit payments expected to be paid to participants by year, which includes payments funded from our assets, as well as payments paid from the plan for the year ended October 31, (in thousands):\nPension Benefits\n2023 $ 22,880\n2024 729\n2025 770\n2026 750\n2027 704\n2028 - 2032 3,415\nTotal $ 29,248\nDefined Contribution Plan\nWe also sponsor two defined contribution plans into which we and our employees make contributions. As of January 1, 2020, we match 100% up to the first 5% of employee annual salary deferrals under our plan for all employees excluding NA Cabinet Components participants, who receive a 100% match up to 4% of employee annual salary deferrals. Between January 1, 2018 and January 1, 2020, we matched 50% up to the first 5% of employee salary deferrals. We do not offer our common stock as a direct investment option under these plans. For the years ended October 31, 2022, 2021 and 2020, we contributed approximately $6.8 million, $6.3 million and $4.8 million for these plans, respectively.\nOther Plans\nWe have supplemental benefit plans covering certain executive officers and a non-qualified deferred compensation plan covering members of the Board of Directors and certain key employees. Our liability under the supplemental benefit plan was approximately $1.9 million and $2.9 million as of October 31, 2022 and 2021, and our liability under the deferred compensation plan was approximately $3.3 million and $3.4 million, respectively. As of October 31, 2022 and 2021, the current portion of these liabilities was recorded under the caption Accrued Liabilities, and the long-term portion was included under the caption Other Liabilities in the accompanying balance sheets.\n10. Income Taxes\nThe provision or benefit for income taxes includes U.S. federal income taxes (determined on a consolidated return basis), foreign income taxes and state income taxes. We provide for income taxes on taxable income at the applicable statutory rates. The following table summarizes the components of income tax expense for the years ended October 31, 2022, 2021 and 2020 (in thousands):\nYear Ended October 31,\n2022 2021 2020\nCurrent\nFederal $ 11,553 $ 10,993 $ 6,043\nState and local 740 3,447 1,505\nNon-United States 7,037 6,889 4,445\nTotal current 19,330 21,329 11,993\nDeferred\nFederal 2,127 (842) (64)\nState and local (229) (277) (315)\nNon-United States 199 2,904 190\nTotal deferred 2,097 1,785 (189)\nTotal income tax expense $ 21,427 $ 23,114 $ 11,804\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nFor financial reporting purposes, income before income taxes for the years ended October 31, 2022, 2021 and 2020 includes the following components (in thousands):\nYear Ended October 31,\n2022 2021 2020\nDomestic $ 64,850 $ 36,879 $ 26,229\nForeign 44,913 43,215 24,071\nTotal income before income taxes $ 109,763 $ 80,094 $ 50,300\nThe following table reconciles our effective income tax rate to the federal statutory rate for the years ended October 31, 2022, 2021 and 2020:\nYear Ended October 31,\n2022 2021 2020\nUnited States tax at statutory rate 21.0 % 21.0 % 21.0 %\nState and local income tax 0.4 % 3.1 % 1.7 %\nNon-United States income tax (0.8) % 2.3 % 1.2 %\nU.K. patent box benefit (1.2) % (1.4) % (2.0) %\nU.S. income tax credits (3.2) % (4.2) % (2.3) %\nNet U.S. tax on non-United States earnings 3.2 % 4.2 % 2.5 %\nNon-cash compensation (1.7) % 1.9 % (0.3) %\nOther 1.8 % 2.0 % 1.7 %\nEffective tax rate 19.5 % 28.9 % 23.5 %\nOur earnings from our foreign subsidiaries are not subject to significant withholding taxes upon remittances to the U.S.. As a result, we do not anticipate any significant future tax impacts from any potential repatriation of previously unremitted foreign earnings. The amount of undistributed foreign earnings from international operations as of the years ended October 31, 2022 and 2021, respectively, was $19.8 million and $15.1 million.\nSignificant components of our net deferred tax liabilities and assets were as follows (in thousands):\nOctober 31,\n2022 2021\nDeferred tax assets:\nEmployee benefit obligations $ 8,046 $ 7,591\nAccrued liabilities and reserves 1,430 1,425\nPension and other benefit obligations 1,426 1,934\nInventory 1,409 894\nLoss and tax credit carry forwards 1,589 1,857\nOther - 107\nTotal gross deferred tax assets 13,900 13,808\nLess: Valuation allowance\n534 1,174\nTotal deferred tax assets, net of valuation allowance 13,366 12,634\nDeferred tax liabilities:\nProperty, plant and equipment 15,467 11,187\nGoodwill and intangibles 20,162 23,412\nOther 14 -\nTotal deferred tax liabilities 35,643 34,599\nNet deferred tax liabilities $ 22,277 $ 21,965\nAt October 31, 2022, state operating loss carry forwards totaled $31.3 million. The majority of these losses begin to expire in 2033. We evaluate tax benefits of operating losses and tax credit carry forwards on an ongoing basis, including a review of\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nhistorical and projected future operating results, the eligible carry forward period and other circumstances. We have recorded a valuation allowance for certain state net operating losses as of October 31, 2022 and 2021, totaling $0.5 million and $1.2 million, respectively. During the year ended October 31, 2022, we recorded a net $0.7 million decrease in our state valuation allowances. The valuation allowances can be affected in future periods by changes to tax laws, changes to statutory tax rates, and changes in estimates of future taxable income. To fully realize these net deferred tax assets, we will need to generate sufficient future taxable income in the countries where these tax attributes exist during the periods in which the attributes can be utilized. As of each reporting date, management considers the weight of all evidence, both positive and negative, to determine if a valuation allowance is necessary for each jurisdictions net deferred tax assets. We place greater weight on historical evidence over future predictions of our ability to utilize net deferred tax assets. We consider future reversals of existing taxable temporary differences, future taxable income exclusive of reversing temporary differences, and taxable income in prior carryback year(s) if carryback is permitted under applicable law.\nThe following table shows the change in the unrecognized income tax benefit associated with uncertain tax positions for the years ended October 31, 2022, 2021 and 2020 (in thousands):\nUnrecognized\nIncome Tax Benefits\nBalance at October 31, 2019\n$ 556\nAdditions for tax positions related to the prior year 15\nReassessment of position (49)\nBalance at October 31, 2020\n$ 522\nAdditions for tax positions related to the prior year 953\nReassessment of position (87)\nBalance at October 31, 2021\n$ 1,388\nReassessment of position (27)\nBalance at October 31, 2022\n$ 1,361\nAs of October 31, 2022, our liability for unrecognized tax benefits of $1.4 million related to certain U.S. federal and state tax items regarding the interpretation of tax laws and regulations, including a minimal amount of interest and penalties. We include all interest and penalties related to uncertain tax benefits within our income tax provision account. To the extent interest and penalties are not assessed with respect to uncertain tax positions or the uncertainty of deductions in the future, amounts accrued will be reduced and reflected as a reduction of the overall income tax provision.\nWe, along with our subsidiaries, file income tax returns in the U.S. and various state jurisdictions as well as in the U.K., Germany and Canada. In certain jurisdictions, the statute of limitations has not yet expired. We generally remain subject to examination of our U.S. income tax returns for 2018 and subsequent years. We generally remain subject to examination of our various state and foreign income tax returns for a period of four to five years from the date the return was filed. The state impact of any federal changes remains subject to examination by various states for a period of up to one year after formal notification to the state of the federal change.\nJudgment is required in assessing the future tax consequences of events that have been recognized in our financial statements or tax returns. The final outcome of the future tax consequences of legal proceedings, if any, changes in regulatory tax laws or interpretation of those tax laws could impact our financial statements. We are subject to the effect of these matters occurring in various jurisdictions. Our total unrecognized tax benefits, if recognized, would not materially affect our effective tax rate. The recorded amount of unrecognized tax benefits may decrease by approximately $1.0 million with in the next twelve months as a result of the upcoming closing of a statute of limitations.\n11. Commitments and Contingencies\nPurchase Obligations\nWe are a party to non-cancelable purchase obligations primarily for door hardware, primary and secondary steel and primary and secondary aluminum used in our manufacturing processes, as well as expenditures related to capital projects in progress. We paid $11.0 million and $9.9 million pursuant to these arrangements for the years ended October 31, 2022 and 2021, respectively. These obligations total $7.6 million and $23.4 million at October 31, 2022 and 2021, respectively, and extend through fiscal 2023. Future amounts paid pursuant to these arrangements will depend, to some extent, on our usage.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nAsset Retirement Obligation\nWe maintain an asset retirement obligation associated with a leased facility in Kent, Washington. We have estimated our future cash flows associated with this asset retirement obligation and recorded an asset and corresponding liability. We are depreciating the asset and accreting the liability over a seven-year term, to culminate in an asset retirement obligation of $2.3 million as of February 2025, which is located in Other Liabilities on the Consolidated Balance Sheets.\nRemediation and Environmental Compliance Costs\nUnder applicable state and federal laws, we may be responsible for, among other things, all or part of the costs required to remove or remediate wastes or hazardous substances at locations we, or our predecessors, have owned or operated. From time to time, we also have been alleged to be liable for all or part of the costs incurred to clean up third-party sites where there might have been an alleged improper disposal of hazardous substances. At present, we are not involved in any such matters.\nFrom time to time, we incur routine expenses and capital expenditures associated with compliance with existing environmental regulations, including control of air emissions and water discharges, and plant decommissioning costs. We have not incurred any material expenses or capital expenditures related to environmental matters during the past three fiscal years, and do not expect to incur a material amount of such costs in fiscal 2023. While we will continue to have future expenditures related to environmental matters, any such amounts are impossible to reasonably estimate at this time. Based upon our experience to date, we do not believe that our compliance with environmental requirements will have a material adverse effect on our operations, financial condition or cash flows.\nLitigation\nFrom time to time, we, along with our subsidiaries, are involved in various litigation matters arising in the ordinary course of our business, including those arising from or related to contractual matters, commercial disputes, intellectual property, personal injury, environmental matters, product performance or warranties, product liability, insurance coverage and personnel and employment disputes.\nWe regularly review with legal counsel the status of all ongoing proceedings, and we maintain insurance against these risks to the extent deemed prudent by our management and to the extent such insurance is available. However, there is no assurance that we will prevail in these matters or that our insurers will accept full coverage of these matters, and we could, in the future, incur judgments, enter into settlements of claims, or revise our expectations regarding the outcome or insurability of matters we face, which could materially impact our results of operations.\nWe have been and are currently party to multiple claims, some of which are in litigation, relating to alleged defects in a commercial sealant product that was manufactured and sold during the 2000s. While we believe that our product was not defective and that we would prevail in these commercial sealant product claims if taken to trial, the timing, ultimate resolution and potential impact of these claims is not currently determinable. Nevertheless, after taking into account all currently available information, including our defenses, the advice of our counsel, and the extent and currently-expected availability of our existing insurance coverage, we believe that the eventual outcome of these commercial sealant claims will not have a material adverse effect on our overall financial condition, results of operations or cash flows, and we have not recorded any accrual with regard to these claims.\n12. Fair Value Measurements of Assets and Liabilities\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The fair value hierarchy distinguishes between (1) market participant assumptions developed based on market data obtained from independent sources (observable inputs) and (2) an entity's own assumptions about market participant assumptions developed based on the best information available in the circumstances (unobservable inputs). The fair value hierarchy consists of three broad levels, which gives the highest priority to Level 1 and the lowest priority to Level 3. The three levels of the fair value hierarchy are described below:\nLevel 1 - Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities.\nLevel 2 - Inputs other than quoted prices included within Level 1 that are observable for the asset or liability either directly or indirectly including quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; inputs other than quoted prices that are observable for the\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nasset or liability (e.g., interest rates) and inputs that are derived principally from or corroborated by observable market data by correlation or other means.\nLevel 3 - Inputs that are both significant to the fair value measurement and unobservable.\nCarrying amounts reported on the balance sheets for cash, cash equivalents, accounts receivable and accounts payable approximate fair value due to the short-term maturity of these instruments. Our outstanding debt is variable rate debt that re-prices frequently, thereby limiting our exposure to significant changes in interest rate risk. As a result, the fair value of our debt instruments approximates carrying value at October 31, 2022 and 2021 (Level 2 measurement).\nOur restricted stock units and performance share awards are marked-to-market on a quarterly basis during a three-year vesting period based on market data (Level 2 measurement). For further information refer to Note 13. Stock-Based Compensation - Performance Share Awards.\n13. Stock-Based Compensation\nWe have established and maintain an Omnibus Incentive Plan (2020 Plan) that provides for the granting of restricted stock awards, stock options, restricted stock units, performance share awards, performance restricted stock units, and other stock-based and cash-based awards. The 2020 Plan is administered by the Compensation and Management Development Committee of the Board of Directors.\nThe aggregate number of shares of common stock authorized for grant under the 2020 Plan is 3,139,895 as approved by the shareholders. Any officer, key employee and/or non-employee director is eligible for awards under the 2020 Plan. We grant restricted stock units to non-employee directors on the first business day of each fiscal year. As approved by the Compensation & Management Development Committee of our Board of Directors annually, we grant a mix of restricted stock awards, performance shares and/or performance restricted stock units to officers, management and key employees. We also historically granted stock options to certain officers, directors and key employees. Occasionally, we may make additional grants to key employees at other times during the year.\nRestricted Stock Awards\nRestricted stock awards are granted to key employees and officers annually, and typically cliff vest over a three-year period with service and continued employment as the only vesting criteria. The recipient of a restricted stock award is entitled to all of the rights of a shareholder, except that the awards are nontransferable during the vesting period. The fair value of the restricted stock award is established on the grant date and then expensed over the vesting period resulting in an increase in additional paid-in-capital. Shares are generally issued from treasury stock at the time of grant.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nA summary of non-vested restricted stock award activity during the years ended October 31, 2022, 2021 and 2020, follows:\nRestricted Stock Awards Weighted Average\nGrant Date Fair Value per Share\nNon-vested at October 31, 2019 230,100 $ 17.02\nGranted 63,400 18.82\nVested (55,000) 19.45\nForfeited (51,000) 17.30\nNon-vested at October 31, 2020 187,500 16.82\nGranted 73,300 20.68\nVested (44,400) 20.70\nForfeited - -\nNon-vested at October 31, 2021 216,400 17.28\nGranted 84,400 22.54\nVested (88,700) 13.74\nForfeited - -\nNon-vested at October 31, 2022 212,100 $ 20.86\nThe total weighted average grant-date fair value of restricted stock awards that vested during the years ended October 31, 2022, 2021 and 2020 was $1.2 million, $0.9 million and $1.1 million, respectively. As of October 31, 2022, total unrecognized compensation cost related to unamortized restricted stock awards totaled $1.9 million. We expect to recognize this expense over the remaining weighted average period of 1.8 years.\nStock Options\nHistorically, stock options have been awarded to key employees, officers and non-employee directors. In December 2017, the Compensation & Management Development Committee of the Board of Directors approved a change to the long-term incentive award program eliminating the grant of stock options and replacing this award with a grant of performance restricted stock units as further described below. As a result, stock options were not granted during the years ended October 31, 2020, 2019, and 2018. Stock options typically vested ratably over a three-year period with service and continued employment as the vesting conditions. Our stock options may be exercised up to a maximum of ten years from the date of grant. The fair value of the stock options was determined on the grant date and expensed over the vesting period resulting in an increase in additional paid-in-capital. We used the Black-Scholes pricing model to estimate the grant date fair value. The inputs to this model included expected volatility, expected term, a risk-free rate and expected dividend rate at the time of grant. For employees who were nearing retirement-eligibility, we recognized stock option expense ratably over the shorter of the vesting period or the period from the grant-date to the retirement-eligibility date.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe following table summarizes our stock option activity for the years ended October 31, 2022, 2021 and 2020.\nStock Options Weighted Average\nExercise Price Weighted Average\nRemaining Contractual\nTerm (in years) Aggregate\nIntrinsic\nValue (000s)\nOutstanding at October 31, 2019 1,416,186 $ 18.71 4.2 $ 1,449\nGranted - -\nExercised (215,733) 17.09\nForfeited/Expired (105,124) 20.28\nOutstanding at October 31, 2020 1,095,329 $ 18.88 3.6 $ 561\nGranted - -\nExercised (865,393) 18.80\nForfeited/Expired (11,632) 18.22\nOutstanding at October 31, 2021 218,304 $ 19.37 3.4 $ 297\nGranted - -\nExercised (35,600) 19.36\nForfeited/Expired (7,587) 19.04\nOutstanding at October 31, 2022 175,117 $ 19.39 2.9 $ 485\nVested at October 31, 2022 175,117 $ 19.39 2.9 $ 485\nExercisable at October 31, 2022 175,117 $ 19.39 2.9 $ 485\nIntrinsic value is the amount by which the market price of the common stock on the date of exercise exceeds the exercise price of the stock option. For the years ended October 31, 2022, 2021 and 2020, the total intrinsic value of our stock options that were exercised totaled $0.2 million, $4.2 million and $0.5 million, respectively. The total fair value of stock options vested during the years ended October 31, 2022, 2021 and 2020, was zero, zero and $0.6 million, respectively.\nRestricted Stock Units\nRestricted stock units may be awarded to key employees and officers from time to time, and annually to non-employee directors. The non-employee director restricted stock units vest immediately but are payable only upon the director's cessation of service unless an election is made by the non-employee director to settle and pay the award on an earlier specified date. Restricted stock units awarded to employees and officers typically cliff vest after a three-year period with service and continued employment as the vesting conditions. Restricted stock units are not considered outstanding shares and do not have voting rights, although the holder does receive a cash payment equivalent to the dividend paid, on a one-for-one basis, on our outstanding common shares. Once the vesting criteria is met, each restricted stock unit is payable to the holder in cash based on the market value of one share of our common stock. Accordingly, we record a liability for the restricted stock units on our balance sheet and recognize any changes in the market value during each reporting period as compensation expense.\nDuring the years ended October 31, 2022, 2021 and 2020, 36,669, 28,826 and 25,621 restricted stock units, respectively, were granted with corresponding weighted average grant date fair value of $22.52, $18.79, and $18.18, respectively. As of October 31, 2022 there were 21,774 unvested restricted stock units from the fiscal 2020 grant with corresponding weighted average grant date fair value of $17.08. During the years ended October 31, 2022, 2021 and 2020, we paid $1.0 million, $0.8 million and $0.2 million to settle restricted stock units.\nPerformance Share Awards\nWe have awarded annual grants of performance shares to key employees and officers. Beginning with the fiscal year ended October 31, 2019, performance share awards vest with return on net assets (RONA) as the vesting condition, pay out 100% in cash, and are accounted for as liability.\nThe expected cash settlement of the performance share award is recorded as a liability and is being marked to market over the three-year term of the award, and could fluctuate depending on the number of shares ultimately expected to vest. Depending on the achievement of the performance conditions, 0% to 200% of the awarded performance shares may ultimately vest.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe following table summarizes our performance share grants and the grant date fair value for the RONA performance metric:\nGrant Date Shares Awarded Grant Date Fair Value Shares Forfeited\nDecember 5, 2019 55,900 $ 19.40 5,300\nDecember 2, 2020 65,300 $ 20.68 -\nDecember 9, 2021 80,900 $ 22.54 -\nIn December 2021, 183,000 shares vested pursuant to the December 2018 grant, which were settled with a cash payment of $3.8 million. In December 2020, the December 2017 grant vested, however, no shares were awarded as performance criteria were not met.\nPerformance share awards are payable in cash based upon the number of performance shares ultimately earned, and are therefore not considered outstanding shares.\nPerformance Restricted Stock Units\nWe awarded performance restricted stock units to key employees and officers. These awards cliff vest upon a three-year service period with the absolute total shareholder return of our common stock over this three-year term as the vesting criteria. The number of performance restricted stock units earned is variable depending on the metric achieved, and the settlement method is 100% in our common stock, with accrued dividends paid in cash at the time of vesting, assuming the shares had been outstanding throughout the performance period.\nTo value the performance restricted stock units, we utilized a Monte Carlo simulation model to arrive at a grant-date fair value. This amount will be adjusted for forfeitures and expensed over the three-year term of the award with a credit to additional paid-in-capital. Depending on the achievement of the performance conditions, a minimum of 0% and a maximum of 150% of the awarded performance restricted stock units may vest. Specifically, the awards vest on a continuum with the following Absolute Total Shareholder Return (A-TSR) milestones:\nVesting Level Vesting Criteria Percentage of Award Vested\nLevel 1 A-TSR greater than or equal to 50% 150%\nLevel 2 A-TSR less than 50% and greater than or equal to 20% 100%\nLevel 3 A-TSR less than 20% and greater than or equal to -20% 50%\nLevel 4 A-TSR less than -20% -%\nThe following table summarizes our performance restricted stock unit grants and the grant date fair value for the A-TSR performance metric:\nGrant Date Shares Awarded Grant Date Fair Value Shares Forfeited\nDecember 5, 2019 35,000 $ 19.40 -\nDecember 2, 2020 38,400 $ 20.68 -\nDecember 9, 2021 50,900 $ 21.06 -\nThe performance restricted stock units are not considered outstanding shares, do not have voting rights, and are excluded from diluted weighted-average shares used to calculate earnings per share until the performance criteria is probable to result in the issuance of contingent shares.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe following table summarizes amounts expensed as selling, general and administrative expense related to restricted stock awards, stock options, restricted stock units, performance share awards and performance restricted stock units for the years ended October 31, 2022, 2021 and 2020 (in thousands):\nYear Ended October 31,\n2022 2021 2020\nRestricted stock awards $ 1,452 $ 1,235 $ 625\nStock options - - 10\nRestricted stock units 1,167 1,197 186\nPerformance share awards 2,373 4,039 (170)\nPerformance restricted stock units 840 729 515\nTotal compensation expense 5,832 7,200 1,166\nIncome tax effect 1,138 2,078 274\nNet compensation expense\n$ 4,694 $ 5,122 $ 892\n14. Stockholders' Equity\nAs of October 31, 2022, our authorized capital stock consists of 125,000,000 shares of common stock, at par value of $0.01 per share, and 1,000,000 shares of preferred stock, with no par value. As of October 31, 2022 and 2021, we had 37,211,056 and 37,273,510 shares of common stock issued, respectively, and 33,129,250 and 33,274,785 shares of common stock outstanding, respectively. There were no shares of preferred stock issued or outstanding at October 31, 2022 and 2021.\nStock Repurchase Program and Treasury Stock\nOn August 30, 2018, our Board of Directors approved a stock repurchase program that authorized the repurchase of up to $60.0 million worth of shares of our common stock. As of October 31, 2021, this share repurchase authorization was exhausted and the program was complete. During December 2021, our Board of Directors approved a new stock repurchase program that authorized the repurchase of up to $75.0 million worth of shares of our common stock. Repurchases under the program are made in open market transactions or privately negotiated transactions, subject to market conditions, applicable legal requirements and other relevant factors. The program does not have an expiration date or a limit on the number of shares that may be purchased. During the years ended October 31, 2022 and 2021, we purchased 291,000 shares and 478,311 shares, respectively, at a cost of $6.6 million and $11.2 million respectively, under these programs.\nWe record treasury stock purchases under the cost method whereby the entire cost of the acquired stock is recorded as treasury stock. Shares are generally issued from treasury stock at the time of grant of restricted stock awards, upon the exercise of stock options, and upon the vesting of performance shares and performance restricted stock units. On the subsequent issuance of treasury shares, we record proceeds in excess of cost as an increase in additional paid-in-capital. A deficiency of such proceeds relative to costs would be applied to reduce paid-in-capital associated with prior issuances to the extent available, with the remainder recorded as a charge to retained earnings. We recorded a charge to retained earnings of zero, zero and $0.1 million, in the years ended October 31, 2022, 2021, and 2020, respectively.\nFor a summary of treasury stock activity for the years ended October 31, 2022, 2021 and 2020, refer to the Consolidated Statement of Stockholders' Equity located elsewhere herein.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n15. Other, net\nOther income included under the caption Other, net on the accompanying consolidated statements of income (loss), consisted of the following (in thousands):\nYear Ended October 31,\n2022 2021 2020\nForeign currency transaction gains (losses) $ 386 $ (98) $ (42)\nForeign currency exchange derivative gains (losses) 19 - (15)\nPension service benefit 783 839 243\nInterest income 19 5 28\nOther (166) 8 66\nOther income $ 1,041 $ 754 $ 280\n16. Segment Information\nWe present three reportable business segments: (1) NA Fenestration, comprising three operating segments primarily focused on the fenestration market in North America including vinyl profiles, insulating glass spacers, screens & other fenestration components; (2) EU Fenestration, comprising our U.K.-based vinyl extrusion business, manufacturing vinyl profiles & conservatories, and the European insulating glass business manufacturing insulating glass spacers; and (3) NA Cabinet Components, comprising our cabinet door and components segment. We maintain a grouping called Unallocated Corporate & Other, which includes transaction expenses, stock-based compensation, long-term incentive awards based on the performance of our common stock and other factors, certain severance and legal costs not deemed to be allocable to all segments, depreciation of corporate assets, interest expense, other, net, income taxes and inter-segment eliminations, and executive incentive compensation and medical expense fluctuations relative to planned costs as determined during the annual planning process. Other general and administrative costs associated with the corporate office are allocated to the reportable segments, based upon a relative measure of profitability in order to more accurately reflect each reportable business segment's administrative costs. We allocate corporate expenses to businesses acquired mid-year from the date of acquisition. The accounting policies of our operating segments are the same as those used to prepare the accompanying consolidated financial statements. Corporate general and administrative expenses allocated during the years ended October 31, 2022, 2021 and 2020 were $24.5 million, $21.6 million and $21.7 million, respectively.\nASC Topic 280-10-50, Segment Reporting (ASC 280) permits aggregation of operating segments based on factors including, but not limited to: (1) similar nature of products serving the building products industry, primarily the fenestration business; (2) similar production processes, although there are some differences in the amount of automation amongst operating plants; (3) similar types or classes of customers, namely the primary OEMs; (4) similar distribution methods for product delivery, although the extent of the use of third-party distributors will vary amongst the businesses; (5) similar regulatory environment; and (6) converging long-term economic similarities.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nSegment information for the years ended October 31, 2022, 2021 and 2020 was as follows (in thousands):\nNA Fenestration EU Fenestration NA Cabinet Comp. Unallocated Corp. & Other Total\nYear Ended October 31, 2022\nNet sales $ 687,458 $ 262,058 $ 275,704 $ (3,718) $ 1,221,502\nDepreciation and amortization 16,253 9,674 13,830 352 40,109\nOperating income (loss) 74,570 40,270 3,245 (6,804) 111,281\nCapital expenditures 18,758 7,810 6,454 99 33,121\nTotal assets $ 279,139 $ 223,729 $ 176,154 $ 45,595 $ 724,617\nYear Ended October 31, 2021\nNet sales $ 578,332 $ 251,599 $ 246,075 $ (3,857) $ 1,072,149\nDepreciation and amortization 18,730 10,373 13,263 366 42,732\nOperating income (loss) 56,248 39,299 896 (14,573) 81,870\nCapital expenditures 9,966 8,155 5,559 328 24,008\nTotal assets $ 268,773 $ 236,755 $ 178,671 $ 33,124 $ 717,323\nYear Ended October 31, 2020\nNet sales $ 483,415 $ 161,054 $ 210,099 $ (2,995) $ 851,573\nDepreciation and amortization 23,555 9,468 13,732 474 47,229\nOperating income (loss) 39,909 20,076 (2,502) (2,218) 55,265\nCapital expenditures $ 15,761 $ 5,435 $ 4,423 $ 107 $ 25,726\nThe following table summarizes the change in the carrying amount of goodwill by segment for the years ended October 31, 2022 and 2021 (in thousands):\nNA Fenestration EU Fenestration NA Cabinet Comp. Unallocated Corp. & Other Total\nBalance as of October 31, 2020 $ 38,712 $ 68,295 $ 39,147 $ - $ 146,154\nForeign currency translation adjustment - 3,051 - - 3,051\nBalance as of October 31, 2021 $ 38,712 $ 71,346 $ 39,147 $ - $ 149,205\nForeign currency translation adjustment - (11,350) - - (11,350)\nBalance as of October 31, 2022 $ 38,712 $ 59,996 $ 39,147 $ - $ 137,855\nFor further details of Goodwill, see Note 6, Goodwill and Intangible Assets, located herewith.\nWe did not allocate non-operating expense or income tax expense to the reportable segments. The following table reconciles operating income as reported above to net income for the years ended October 31, 2022, 2021 and 2020 (in thousands):\nYear Ended October 31,\n2022 2021 2020\nOperating income $ 111,281 $ 81,870 $ 55,265\nInterest expense (2,559) (2,530) (5,245)\nOther, net 1,041 754 280\nIncome tax expense (21,427) (23,114) (11,804)\nNet income $ 88,336 $ 56,980 $ 38,496\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nGeographic Information\nOur manufacturing facilities and all long-lived assets are located in the U.S., U.K. and Germany. We attribute our net sales to a geographic region based on the location of the customer. The following tables provide information concerning our net sales for the years ended October 31, 2022, 2021 and 2020, and our long-lived assets as of October 31, 2022 and 2021 (in thousands):\nYear Ended October 31,\nNet sales 2022 2021 2020\nUnited States $ 911,180 $ 778,486 $ 654,802\nEurope 255,400 244,308 158,831\nCanada 31,442 25,007 18,213\nAsia 15,021 18,445 11,504\nOther foreign countries 8,459 5,903 8,223\nTotal net sales $ 1,221,502 $ 1,072,149 $ 851,573\nOctober 31,\nLong-lived assets, net 2022 2021\nUnited States $ 279,616 $ 291,282\nGermany 41,669 25,513\nUnited Kingdom 118,005 146,158\nTotal long-lived assets, net $ 439,290 $ 462,953\nLong-lived assets, net includes: property, plant and equipment, net; goodwill, intangible assets, net, and operating leases.\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n17. Earnings Per Share\nWe compute basic earnings per share by dividing net income by the weighted average number of common shares outstanding during the period. Diluted earnings per common and potential common shares include the weighted average of additional shares associated with the incremental effect of dilutive employee stock options, non-vested restricted stock as determined using the treasury stock method and contingent shares associated with performance share awards, if dilutive.\nThe computation of basic and diluted earnings per share for the years ended October 31, 2022, 2021 and 2020 follows (in thousands, except per share data):\nYear Ended October 31, 2022 Net Income Weighted Average Shares Per Share\nBasic earnings per common share $ 88,336 33,048 $ 2.67\nEffect of dilutive securities:\nStock options 25\nRestricted stock awards 100\nPerformance restricted stock units 32\nDiluted earnings per common share $ 88,336 33,205 $ 2.66\nYear Ended October 31, 2021\nBasic earnings per common share $ 56,980 33,193 $ 1.72\nEffect of dilutive securities:\nStock options 82\nRestricted stock awards 132\nPerformance restricted stock units 88\nDiluted earnings per common share $ 56,980 33,495 $ 1.70\nYear Ended October 31, 2020\nBasic earnings per common share $ 38,496 32,689 $ 1.18\nEffect of dilutive securities:\nStock options 10\nRestricted stock awards 90\nPerformance restricted stock units 32\nDiluted earnings per common share $ 38,496 32,821 $ 1.17\nWe do not include equity instruments in our calculation of diluted earnings per share if those instruments would be antidilutive. Such dilution is dependent on the excess of the market price of our stock over the exercise price and other components of the treasury stock method. The following table shows anti-dilutive instruments for the three years ended October 31, 2022, 2021 and 2020 (shares in thousands):\nYear Ended October 31,\n2022 2021 2020\nStock options - - 1,032\nRestricted stock awards - - -\nPerformance share awards - - -\nTotal - - 1,032\nQUANEX BUILDING PRODUCTS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n18. Unaudited Quarterly Data\nSelected quarterly financial data for the years ended October 31, 2022 and 2021 was as follows (amounts in thousands, except per share amounts):\nFor the Quarter Ended January 31, 2022 April 30, 2022 July 31, 2022 October 31, 2022\nNet sales $ 267,040 $ 322,893 $ 324,037 $ 307,532\nCost of sales (excluding depreciation and amortization) 211,834 249,651 251,446 240,073\nDepreciation and amortization 10,257 10,563 9,734 9,555\nOperating income 14,126 34,550 34,035 28,570\nNet income 11,239 26,522 25,908 24,667\nBasic earnings per share 0.34 0.80 0.79 0.75\nDiluted earnings per share 0.34 0.80 0.78 0.75\nCash dividends paid per common share 0.08 0.08 0.08 0.08\nFor the Quarter Ended January 31, 2021 April 30, 2021 July 31, 2021 October 31, 2021\nNet sales $ 230,147 $ 270,357 $ 279,877 $ 291,768\nCost of sales (excluding depreciation and amortization) 176,397 208,460 219,866 226,818\nDepreciation and amortization 11,015 10,845 10,683 10,189\nOperating income 11,835 21,380 21,562 27,093\nNet income 7,852 14,551 13,679 20,898\nBasic earnings per share 0.24 0.44 0.41 0.63\nDiluted earnings per share 0.24 0.43 0.41 0.62\nCash dividends paid per common share 0.08 0.08 0.08 0.08\nQuarterly earnings per share results may not sum to the consolidated earnings per share results on the accompanying consolidated statements of income due to rounding and changes in weighted average shares during the respective periods.\n19. New Accounting Guidance\nFrom time to time, new accounting pronouncements are issued by the Financial Accounting Standards Board (FASB) or other standards setting bodies that we adopt as of the specified effective date. We did not adopt any new accounting pronouncements during the twelve months ended October 31, 2022. As of October 31, 2022, we believe the impact of any recently issued standards that are not yet effective are either not applicable to us at this time or will not have a material impact on our condensed consolidated financial statements upon adoption.\n20. Subsequent Events\nOn November 1, 2022, we entered into an Asset Purchase Agreement (the Purchase Agreement) with LMI Custom Mixing, LLC (LMI) and the equity owners of LMI, Lauren International, Ltd. and Meteor-US-Beteiligungs GMBH. Under the Purchase Agreement, we acquired substantially all of the operating assets comprising LMIs polymer mixing and rubber compound production business (collectively, the Purchased Assets) and also agreed to assume certain liabilities relating to the Purchased Assets (collectively, the Acquisition). As consideration for the Purchased Assets, we agreed to pay LMI $92 million in cash, with $7.1 million of this amount funded into escrow substantially as security for the seller parties indemnification obligations. To fund the amounts paid in connection with the Acquisition, we used a combination of cash on hand and funds borrowed under our Credit Facility. Subsequent to the acquisition, we had approximately $215 million available for use under the Credit Facility. In connection with the Acquisition, we amended our existing lease with Lauren Real Estate Holding LLC for the purpose of adding an additional lease renewal option and increasing rental space by approximately 60,000 square feet of rental space which was added to the 313,595 square feet of rentable area located in Cambridge, Ohio. The initial accounting for this business combination is in process which includes conducting a valuation analysis to value the assets and liabilities assumed as a result of the Acquisition. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including the Chief Executive Officer and Chief Financial Officer, we have evaluated the effectiveness of our disclosure controls and procedures pursuant to Rule 13a-15(e) under the Securities Exchange Act of 1934 (1934 Act) as of October 31, 2022. Based on that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that, as of October 31, 2022, the disclosure controls and procedures are effective.\nManagements Annual Report on Internal Control over Financial Reporting\nRefer to Managements Annual Report on Internal Control over Financial Reporting located in Part 2, Item 8. Financial Information of this Annual Report on Form 10-K.\nAuditor's Report Relating to Effectiveness of Internal Control over Financial Reporting\nRefer to the Report of Independent Registered Public Accounting Firm located in Part 2, Item 8. Financial Information in this Annual Report on Form 10-K.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in internal controls over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the 1934 Act) during the most recent fiscal quarter that have materially affected or are reasonably likely to materially affect our internal control over financial reporting. Item 9B. Other Information.\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nPursuant to General Instruction G(3) to Form 10-K, the information on Directors, Executive Officers and Corporate Governance is incorporated herein by reference from the Registrant's Definitive Proxy Statement relating to the 2023 Annual Meeting of Stockholders of Quanex Building Products Corporation or an amendment to this Form 10-K, which is to be filed with the SEC pursuant to Regulation 14A under the Securities Exchange Act of 1934, as amended, within 120 days after the close of the fiscal year ended October 31, 2022. Item 11. Executive Compensation.\nPursuant to General Instruction G(3) to Form 10-K, the information on Executive Compensation is incorporated herein by reference from the Registrant's Definitive Proxy Statement relating to the 2023 Annual Meeting of Stockholders of Quanex Building Products Corporation or an amendment to this Form 10-K, which is to be filed with the SEC pursuant to Regulation 14A under the Securities Exchange Act of 1934, as amended, within 120 days after the close of the fiscal year ended October 31, 2022. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nPursuant to General Instruction G(3) to Form 10-K, the information on Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters is incorporated herein by reference from the Registrant's Definitive Proxy Statement relating to the 2023 Annual Meeting of Stockholders of Quanex Building Products Corporation or an amendment to this Form 10-K, which is to be filed with the SEC pursuant to Regulation 14A under the Securities Exchange Act of 1934, as amended, within 120 days after the close of the fiscal year ended October 31, 2022. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nPursuant to General Instruction G(3) to Form 10-K, the information on Certain Relationships and Related Transactions, and Director Independence is incorporated herein by reference from the Registrant's Definitive Proxy Statement relating to the 2023 Annual Meeting of Stockholders of Quanex Building Products Corporation or an amendment to this Form 10-K, which is to be filed with the SEC pursuant to Regulation 14A under the Securities Exchange Act of 1934, as amended, within 120 days after the close of the fiscal year ended October 31, 2022. Item 14. Principal Accountant Fees and Services.\nPursuant to General Instruction G(3) to Form 10-K, the information on Principal Accountant Fees and Services is incorporated herein by reference from the Registrant's Definitive Proxy Statement relating to the 2023 Annual Meeting of Stockholders of Quanex Building Products Corporation or an amendment to this Form 10-K, which is to be filed with the SEC pursuant to Regulation 14A under the Securities Exchange Act of 1934, as amended, within 120 days after the close of the fiscal year ended October 31, 2022.\nPART IV Item 15. Exhibits and Financial Statement Schedules.\n1. Financial Statements\nThe financial statements included in this report are listed in the Index to Financial Statements located elsewhere in this Annual Report on Form 10-K.\n2. Financial Statement Schedules\nSchedules for which provision is made in the applicable accounting regulations of the SEC are either not required under the related instructions or inapplicable.\n3. Exhibits\nThe exhibits required to be filed pursuant to Item 15(b) of Form 10-K are listed in the Exhibit Index filed herewith, which Exhibit Index is incorporated herein by reference. Certain of our exhibits as denoted with a between exhibits 10.1 through 10.40 listed in the Exhibit Index filed herewith, are management or compensatory plans or arrangements required to be filed as exhibits to this Annual Report on Form 10-K pursuant to Item 15(b) thereof.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nQUANEX BUILDING PRODUCTS CORPORATION\nDate: December 16, 2022 /s/ Scott M. Zuehlke\nScott M. Zuehlke\nSenior Vice President - Chief Financial Officer and Treasurer\n(Principal Financial Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nName Title Date\n/s/ William C. Griffiths Chairman of the Board December 16, 2022\nWilliam C. Griffiths\n/s/ Susan F. Davis Director December 16, 2022\nSusan F. Davis\n/s/ Curtis M. Stevens Director December 16, 2022\nCurtis M. Stevens\n/s/ Donald R. Maier Director December 16, 2022\nDonald R. Maier\n/s/ Meredith W. Mendes Director December 16, 2022\nMeredith W. Mendes\n/s/ William E. Waltz Director December 16, 2022\nWilliam E. Waltz\n/s/ Jason D. Lippert Director December 16, 2022\nJason D. Lippert\n/s/ Bradley E. Hughes Director December 16, 2022\nBradley E. Hughes\n/s/ George L. Wilson President and Chief Executive Officer December 16, 2022\nGeorge L. Wilson (Principal Executive Officer)\n/s/ Scott M. Zuehlke Senior Vice President - Chief Financial Officer and Treasurer December 16, 2022\nScott M. Zuehlke (Principal Financial Officer)\n/s/ Mark A. Livingston Vice President, Chief Accounting Officer and Controller December 16, 2022\nMark A. Livingston (Principal Accounting Officer)\nEXHIBIT INDEX\nExhibit Number Description of Exhibits\n2.1\nDistribution Agreement among Quanex Corporation, Quanex Building Products LLC and Quanex Building Products Corporation (incorporated by reference to Exhibit 10.1 to Quanex Corporations Current Report on Form 8-K (Reg. No. 001-05725) filed with the Commission on December 24, 2007).\n2.2\nAgreement and Plan of Merger, dated as of January 31, 2011, by and among Quanex Building Products Corporation, QSB Inc., Lauren Holdco Inc., Lauren International, Inc. and Kevin E. Gray, as agent for the shareholders of Lauren Holdco Inc., filed as Exhibit 2.1 of the Registrants Current Report on Form 8-K (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on February 2, 2011, and incorporated herein by reference.\n2.3\nLimited Liability Company Interest Purchase Agreement dated February 7, 2014, by and among Quanex Building Products Corporation, Nichols Aluminum, LLC and Aleris International Inc., filed as Exhibit 2.1 of the Registrants Current Report on Form 8-K (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on February 10, 2014, and incorporated herein by reference.\n2.4\nFirst Amendment to Limited Liability Company Interest Purchase Agreement dated April 1, 2014, by and among Quanex Building Products Corporation, Nichols Aluminum, LLC and Aleris International Inc., filed as Exhibit 10.1 of the Registrants Current Report on Form 8-K (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on April 7, 2014, and incorporated herein by reference.\n2.5\nShare Purchase Agreement dated June 15, 2015 by and among R.L. Hartshorn and others, and Quanex Building Products Corporation, filed as Exhibit 2.1 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on June 16, 2015, and incorporated herein by reference.\n2.6\nAgreement and Plan of Merger, dated as of August 30, 2015, by and among Quanex Building Products Corporation, QWMS, Inc., WII Holding, Inc., and Olympus Growth Fund IV, L.P, solely in its capacity as the representative of the stockholders of WII Holding, Inc, filed as Exhibit 2.1 to the Registrant's Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on August 30, 2015, and incorporated herein by reference.\n2.7\nAsset Purchase Agreement, dated November 1, 2022, among Quanex IG Systems, Inc., LMI Custom Mixing, LLC, Lauren International, Ltd. and Meteor-US-Beteiligungs GMBH, filed as Exhibit 2.1 to the Registrant's Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on November 1, 2022 and incorporated herein by reference.\n3.1\nRestated Certificate of Incorporation of the Registrant dated as of March 4, 2016, filed as Exhibit 3.1 of the Registrants Current Report on Form 8-K (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on March 7, 2016, and incorporated herein by reference.\n3.2\nFourth Amended and Restated Bylaws of the Registrant dated as of February 27, 2020, filed as Exhibit 3.2 of the Registrant's Quarterly Report on Form 10-Q (Reg. No. 001-33913) for the quarter ended January 31, 2020.\n4.1\nForm of Registrants common stock certificate, filed as Exhibit 4.1 of Amendment No. 1 to the Registrants Registration Statement on Form 10 (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on February 14, 2008, and incorporated herein by reference.\n4.2\nSecond Amended and Restated Credit Agreement dated as of July 6, 2022, by and among the Company; the lenders party thereto; and Wells Fargo Bank, National Association, as Agent; filed as Exhibit 10.1 of the Registrant's Current Report on Form 8-K (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on July 6, 2022, and incorporated herein by reference.\n10.1\nQuanex Building Products Corporation Amended and Restated 2008 Omnibus Incentive Plan, filed as Exhibit 10.1 to the Registrant's Current Report on Form 8-K (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on February 27, 2014, and incorporated herein by reference.\n10.2\nQuanex Building Products Corporation Deferred Compensation Plan as amended, filed as Exhibit 10.2 to the Registrant's Quarterly Report on Form 10-Q (Reg. No. 001-33913) for the quarter ended January 31, 2014, as filed with the Securities and Exchange Commission on March 6, 2014, and incorporated herein by reference.\n10.3\nQuanex Building Products Corporation Restoration Plan, filed as Exhibit 10.8 of Amendment No. 4 to the Registrants Registration Statement on Form 10 (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on March 17, 2008, and incorporated herein by reference.\n10.4\nQuanex Building Products Corporation Supplemental Employees Retirement Plan, filed as Exhibit 10.9 of Amendment No. 4 to the Registrants Registration Statement on Form 10 (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on March 17, 2008, and incorporated herein by reference.\nEXHIBIT INDEX\nExhibit Number Description of Exhibits\n10.5\nForm of Executive Severance Policy applicable to the Registrant and certain of its executive officers, filed as Exhibit 10.1 of the Registrant's current report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on March 2, 2020 and incorporated herein by reference.\n10.6\nForm of Indemnity Agreement between the Registrant and each of its independent directors, filed as Exhibit 10.1 of the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on August 29, 2008, and incorporated herein by reference.\n10.7\nForm of Indemnity Agreement between the Registrant and each of its officers, filed as Exhibit 10.2 of the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on August 29, 2008, and incorporated herein by reference.\n10.8\nForm of Stock Option Agreement for Employees under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.1 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on April 29, 2014, and incorporated herein by reference.\n10.9\nForm of Stock Option Agreement for Section 16 Officers under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.2 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on April 29, 2014, and incorporated herein by reference.\n10.10\nForm of Stock Option Agreement for Key Leaders under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.3 to the Registrants Current Report on Form 8-K ( Reg. No. 001-33913), as filed with the Securities and Exchange Commission on April 29, 2014, and incorporated herein by reference.\n10.11\nForm of Stock Option Agreement for Non-Employee Directors under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.4 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on April 29, 2014, and incorporated herein by reference.\n10.12\nForm of Restricted Stock Award Agreement for Section 16 Officers under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.6 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on April 29, 2014, and incorporated herein by reference.\n10.13\nForm of Restricted Stock Award Agreement for Key Leaders under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.7 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on April 29, 2014, and incorporated herein by reference.\n10.14\nForm of Restricted Stock Unit Award Agreement for Section 16 Officers under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.10 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on April 29, 2014, and incorporated herein by reference.\n10.15\nForm of Restricted Stock Unit Award Agreement for Key Leaders under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.11 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on April 29, 2014, and incorporated herein by reference.\n10.16\nForm of Restricted Stock Unit Award Agreement for Non-Employee Directors under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.12 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on April 29, 2014, and incorporated herein by reference.\n10.17\nAmended Form of Performance Share Award Agreement for Section 16 Officers under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.2 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on December 7, 2015, and incorporated herein by reference.\n10.18\nAmended Form of Performance Share Award Agreement for Key Leaders under the Quanex Building Products Corporation 2008 Omnibus Incentive Plan, as amended, filed as Exhibit 10.3 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on December 7, 2015, and incorporated herein by reference.\nEXHIBIT INDEX\nExhibit Number Description of Exhibits\n10.19\nAgreement between Quanex Building Products Corporation and Scott Zuehlke, effective November 1, 2019, filed as Exhibit 10.1 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on November 1, 2019, and incorporated herein by reference.\n10.20\nLease dated February 9, 2016, between Garner Properties Ltd. and HL Plastics Limited, filed as Exhibit 10.44 to the Registrant's Annual Report on Form 10-K (Reg. No. 001-33913) for the year ended October 31, 2016, as filed with the Securities and Exchange Commission on December 16, 2016, and incorporated herein by reference.\n10.21\nAmended and Completely Restated Lease Agreement dated August 25, 2016, between Lauren Real Estate Holding LLC and Quanex IG Systems, Inc., filed as Exhibit 10.1 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on August 26, 2016, and incorporated herein by reference.\n10.22\nAmended and Restated Employee Stock Purchase Plan, as amended and restated effective April 1, 2017, filed as Annex A to the Registrants Definitive Proxy Statement on Schedule 14A for its 2017 Annual Meeting of Stockholders (Reg. No 001-33919), as filed with the Securities and Exchange Commission on January 31, 2017, and incorporated herein by reference.\n10.23\nAgreement between Quanex Building Products Corporation and George Wilson, effective August 1, 2017, filed as Exhibit 10.1 of the Registrants Current Report on Form 8-K (Reg. No. 001-33919) as filed with the Securities and Exchange Commission on July 27, 2017, and herein incorporated by reference.\n10.24\nForm of Key Leader Stock Settled Performance Restricted Stock Units Award Agreement filed as Exhibit 10.50 to the Registrant's Annual Report on Form 10-K (Reg. No. 001-33913) for the year ended October 31, 2017, as filed with the Securities and Exchange Commission on December 12, 2017, and incorporated herein by reference.\n10.25\nForm of Section 16 Officer Stock Settled Performance Restricted Stock Units Award Agreement filed as Exhibit 10.51 to the Registrant's Annual Report on Form 10-K (Reg. No. 001-33913) for the year ended October 31, 2017, as filed with the Securities and Exchange Commission on December 12, 2017, and incorporated herein by reference.\n10.26\nAgreement between Quanex Building Products Corporation and Mark Livingston, effective November 1, 2019, filed as Exhibit 10.2 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on November 1, 2019, and incorporated herein by reference.\n10.27\nAgreement between Quanex Building Products Corporation and Paul Cornett, effective November 1, 2019, filed as Exhibit 10.4 to the Registrants Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on November 1, 2019, and incorporated herein by reference.\n10.28\nQuanex Building Products Corporation 2020 Omnibus Incentive Plan filed as Exhibit 10.2 to the Registrant's Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on March 2, 2020, and incorporated herein by reference.\n10.29\nForm of Restricted Stock Award Agreement for Employees under the Quanex Building Products Corporation 2020 Omnibus Incentive Plan, filed as Exhibit 10.1 of the Registrants Quarterly Report on Form 10-Q (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on March 6, 2020, and incorporated herein by reference.\n10.30\nForm of Annual Incentive Award Agreement for Employees under the Quanex Building Products Corporation 2020 Omnibus Incentive Plan, filed as Exhibit 10.1 of the Registrants Quarterly Report on Form 10-Q (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on June 5, 2020, and incorporated herein by reference.\n10.31\nForm of Restricted Stock Award Agreement for Employees under the Quanex Building Products Corporation 2020 Omnibus Incentive Plan, filed as Exhibit 10.2 of the Registrants Quarterly Report on Form 10-Q (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on June 5, 2020, and incorporated herein by reference.\n10.32\nForm of Restricted Stock Unit Award Agreement for Employees under the Quanex Building Products Corporation 2020 Omnibus Incentive Plan, filed as Exhibit 10.3 of the Registrants Quarterly Report on Form 10-Q (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on June 5, 2020, and incorporated herein by reference.\nEXHIBIT INDEX\nExhibit Number Description of Exhibits\n10.33\nForm of Performance Share Award Agreement for Employees under the Quanex Building Products Corporation 2020 Omnibus Incentive Plan, filed as Exhibit 10.4 of the Registrants Quarterly Report on Form 10-Q (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on June 5, 2020, and incorporated herein by reference.\n10.34\nForm of Performance Restricted Stock Unit Award Agreement for Employees under the Quanex Building Products Corporation 2020 Omnibus Incentive Plan, filed as Exhibit 10.5 of the Registrants Quarterly Report on Form 10-Q (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on June 5, 2020, and incorporated herein by reference.\n10.35\nForm of Restricted Stock Unit Award Agreement for independent Directors under the Quanex Building Products Corporation 2020 Omnibus Incentive Plan, filed as Exhibit 10.39 of the Registrants Annual Report on Form 10-K (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on December 11, 2020, and incorporated herein by reference.\n10.36\nLease Relating to Land and Buildings at Denby Hall Business Park, Denby, Ripley, Derbyshire, DE5 8JX, dated as of October 21, 2022, by and among Garner Holdings Limited, Liniar Limited, and Ryfields Close Management Company Limited, filed as Exhibit 10.1 of the Registrants Current Report on Form 8-K (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on October 26, 2022 and incorporated herein by reference.\n10.37\nFirst Amendment to the Amended and Completely Restated Lease Agreement by and among Quanex IG Systems, Inc. and Lauren Real Estate Holding LLC, dated November 1, 2022, filed as Exhibit 10.1 to the Registrant's Current Report on Form 8-K (Reg. No. 001-33913), as filed with the Securities and Exchange Commission on November 1, 2022 and incorporated herein by reference.\n10.38\nAmended Form of Restricted Stock Award Agreement under the Quanex Building Products Corporation 2020 Omnibus Incentive Plan, as amended, filed as Exhibit 10.1 of the Registrants Current Report on Form 8-K (Reg. No. 001-33913) as filed with the Securities and Exchange Commission on December 9, 2022 and incorporated herein by reference.\n*21.1\nSubsidiaries of the Registrant.\n*23.1\nConsent of Grant Thornton LLP.\n*31.1\nCertification by chief executive officer pursuant to Rule 13a-14(a)/15d-14(a).\n*31.2\nCertification by chief financial officer pursuant to Rule 13a-14(a)/15d-14(a).\n*32\nCertification pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n*101.INS XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n*101.SCH XBRL Taxonomy Extension Schema Document\n*101.CAL XBRL Taxonomy Extension Calculation Linkbase Document\n*101.DEF XBRL Taxonomy Extension Definition Linkbase Document\n*101.LAB XBRL Taxonomy Extension Label Linkbase Document\n*101.PRE XBRL Taxonomy Extension Presentation Linkbase Document\n* Filed herewith\nManagement Compensation or Incentive Plan\nAs permitted by Item 601(b)(4)(iii)(A) of Regulation S-K, the Registrant has not filed with this Annual Report on Form 10-K certain instruments defining the rights of holders of long-term debt of the Registrant and its subsidiaries because the total amount of securities authorized under any of such instruments does not exceed 10% of the total assets of the Registrant and its subsidiaries on a consolidated basis. The Registrant agrees to furnish a copy of any such agreements to the Securities and Exchange Commission upon request."
}