{
    "cik": "1424844",
    "company": "SOUTHWEST IOWA RENEWABLE ENERGY, LLC",
    "filing_type": "10-K",
    "filing_date": "2022-12-09",
    "period_of_report": "2022-09-30",
    "sic": "2860",
    "state_of_inc": "IA",
    "state_location": "IA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1424844/0001437749-22-028804-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1424844/000143774922028804/sire20220930_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1424844/0001437749-22-028804.txt",
    "filename": "1424844_10K_2022_0001437749-22-028804.htm",
    "content": "Item 1. Business.\nThe Company is an Iowa limited liability company located in Council Bluffs, Iowa, formed in March 2005. The Company is permitted to produce 147 million gallons of ethanol. We began producing ethanol in February 2009 and sell our ethanol, distillers grains and corn oil in the United States, Mexico and the Pacific Rim.\nOur production facility (the Facility) is located in Pottawattamie County in southwestern Iowa, south of Council Bluffs. It is near two major interstate highways, I-29 and I-80, within a mile of the Missouri River and has access to five major rail carriers. This location is in close proximity to a significant amount of corn and has convenient product market access. The Facility receives corn and chemical deliveries primarily by truck and is able to utilize rail delivery if necessary. Finished products are shipped by rail and truck. The site has access to water from ground wells and from the Missouri River. Additionally, in close proximity to the Facility are providers of our primary energy sources (natural gas and electricity), with two natural gas providers available, both with infrastructure immediately accessible to the Facility, and one electrical provider.\nFinancial Information\nPlease refer to Item 7 - Managements Discussion and Analysis of Financial Condition and Results of Operations for information about our revenue, profit and loss measurements and total assets and liabilities, as they relate to our overall financial condition, results of operations, and material cash requirements, as well as Item 8 - Financial Statements and Supplementary Data for our financial statements and supplementary data.\nOperations\nDuring the first part of 2021, the Company, and the ethanol industry as a whole, experienced significant adverse conditions as a result of industry-wide record low ethanol prices due to reduced demand and high industry inventory levels, primarily attributable to the decrease in travel brought on by the COVID-19 pandemic. At the beginning of our fiscal year ended September 30, 2022, (\"Fiscal 2022\"), the ethanol industry experienced a significant increase in ethanol prices due to increased demand as the population of the United States began to go back to work after the pandemic, but supply remained low due to many ethanol companies reducing production or going completely idle. Ethanol prices remained at higher levels throughout Fiscal 2022, however the price of corn also increased during that time period, reducing the record margins we experienced during the first quarter of Fiscal 2022.\nPaycheck Protection Program Loan\nOn April 14, 2020, the Company received $1.1 million under the new Paycheck Protection Program legislation passed in response to the economic downturn triggered by COVID-19, and on January 28, 2021, the Company received an additional $1.1 million under Phase II of the PPP legislation (collectively the PPP Loans\"). Our PPP Loan may be forgiven based upon various factors, including, without limitation, our payroll cost over an eight-to-twenty-four week period starting upon our receipt of the funds. Expenses for approved payroll costs, lease payments on agreements before February 15, 2020, and utility payments under agreements before February 1, 2020 and certain other specified costs can be paid with these funds and eligible for payment forgiveness by the federal government. At least 60% of the proceeds must be used for approved payroll costs, and no more than 40% on non-payroll expenses. PPP loan proceeds used by a borrower for the approved expense categories have generally been fully forgiven by the lender if the borrower satisfies certain employee headcount and compensation requirements. The Company applied for forgiveness on its PPP Loans from the Small Business Administration (\"SBA\") and was notified on December 24, 2021 that the PPP Loans had been forgiven in full. The gain on the debt extinguishment was recorded in other income.\nRail Access\nWe own a six-mile loop railroad track for rail service to our Facility, which accommodates several unit trains. We are party to an Industrial Track Agreement with CBEC Railway, Inc. (the Track Agreement ), which governs our use of the loop railroad and requires, among other things, that we maintain the loop track.\nOn March 24, 2019, the Company entered into an amendment to the Amended and Restated Railcar Lease Agreement (Railcar Agreement) with Bunge North America, Inc. (Bunge), for the lease of 323 ethanol cars and 111 hopper cars which are used for the delivery and marketing of our ethanol and distillers grains.\nThe Railcar Agreement was amended to 110 hopper cars effective November 2019 and effective July 17, 2020, Bunge sold their tankers to Trinity Leasing. Trinity Leasing entered into a lease agreement with the Company which incorporates the terms of the original Bunge Railcar Agreement but reduced the ethanol car level to 320 ethanol cars. Under the Railcar Agreement, the original DOT111 tank cars are leased over a four-year term from March 24, 2019 to April 30, 2023, with the ability to start returning cars after January 1, 2023 to conform to the requirement for DOT117 tank cars with enhanced safety specifications which is scheduled to be effective in May 2023. The 110 hopper cars are leased over a three-year term running from March 24, 2019 to March 31, 2022 which term continued on a month-to-month basis thereafter. We were notified during Fiscal 2022 that Bunge required us to return the 110 hoppers by November 1, 2022. As of November 7, 2022 all hoppers have been returned to Bunge. As of September 30, 2022, we had secured 35 hoppers in leases that began September 1, 2022 and run through August of 2027. In February 2019, we entered into a second 36-month lease for an additional 30 tank cars from Trinity Leasing, which lease ran through January 2022 and is month-to-month thereafter, and in June 2021 we leased an additional 70 tank cars from Trinity Leasing, which lease runs through April 2023.\nEmployees\nOur employees are the cornerstone of the Company's operations. We had 68 full time employees, as of September 30, 2022. We are not subject to any collective bargaining agreements and we have not experienced any work stoppages. Our management considers our employee relationships to be favorable. We employ individuals in the local region around our one facility, though we have attracted talent from across the country as needed to fill our roles which require technical or professional backgrounds. We compete for employees with competitive wages and benefits. Employee safety remains our top priority and the Company develops and administers company-wide policies to ensure the safety of each team member and compliance with Occupational Safety and Health Administration (OSHA) standards. This includes routine safety training, and assessments as well as annual safety audits.\nPrincipal Products\nThe principal products we produce are ethanol, distillers grains, distillers corn oil, and carbon dioxide (\"CO2\").\nEthanol\nOur primary product is ethanol. Ethanol is ethyl alcohol, a fuel component made primarily from corn and various other grains, which can be used as: (i) an octane enhancer in fuels; (ii) an oxygenated fuel additive for the purpose of reducing ozone and carbon monoxide vehicle emissions; and (iii) a non-petroleum-based gasoline substitute. More than 99% of all ethanol produced in the United States is used in its primary form for blending with unleaded gasoline and other fuel products. The principal purchasers of ethanol are generally wholesale gasoline marketers or blenders. Ethanol is shipped by truck in the local markets, and by rail in the regional, national and international markets.\nWe produced 121.9 million and 129.8 million gallons of ethanol for Fiscal 2022 and the fiscal year ended September 30, 2021 (Fiscal 2021), respectively, and approximately 75% of our revenue was derived from the sale of ethanol in Fiscal 2022 and Fiscal 2021. The decrease in gallons produced, during Fiscal 2022, resulted from additional maintenance time that was needed to repair various items within the plant.\nDistillers Grain\nThe principal co-product of the ethanol production process is distillers grains, a high protein, high-energy animal feed marketed primarily to the beef and dairy industries. Distillers grains contain by-pass protein that is superior to other protein supplements such as cottonseed meal and soybean meal. We produce two forms of distillers grains: wet distillers grains with solubles (WDGS) and dried distillers grains with solubles (DDGS). WDGS are processed corn mash that has been dried to approximately 50% to 65% moisture. WDGS have a shelf life of approximately seven days and are sold to local markets. DDGS are processed corn mash that has been dried to approximately 10% to 12% moisture. It has a longer shelf life and may be sold and shipped to any market.\nIn Fiscal 2022, we sold 2% less tons of distillers grains compared to Fiscal 2021. Approximately 16.3% and 18.3% of our revenue was derived from the sale of distillers grains in Fiscal 2022 and Fiscal 2021, respectively. The decrease in distillers grains produced and sold during Fiscal 2022 resulted principally from the plant operating fewer hours in Fiscal 2022 than Fiscal 2021 due to the increased plant maintenance time during Fiscal 2022.\nCorn Oil\nOur system separates corn oil from the post-fermentation syrup stream as it leaves the evaporators of the ethanol plant. The corn oil is then routed to storage tanks, and the remaining concentrated syrup is routed to the plants syrup tank. Corn oil can be marketed as either a feed additive or a biodiesel feedstock. We sold 10.7% greater tons of corn oil in Fiscal 2022 than in Fiscal 2021, with approximately 8% and 6.3% of our revenue generated from corn oil sales, respectively.\nCarbon Dioxide\nIn April 2013, we entered into a Carbon Dioxide Purchase and Sale Agreement (the CO2 Agreement) with Air Products and Chemicals, Inc., formerly known as EPCO Carbon Dioxide Products, Inc. (\"Air Products\") under which we agreed to supply, and Air Products agreed to purchase, a portion of raw CO2 gas produced by our facility. In addition, we entered into a Non-Exclusive CO2 Facility Site Lease Agreement under which we granted Air Products a non-exclusive right of entry and license to construct, maintain and operate a carbon dioxide liquefaction plant (the CO2 Plant) on a site near our facility. The term of the CO2 Agreement runs for ten (10) years from the startup of the CO2 Plant (the Initial Term) and then renews automatically for two (2) additional five (5) year periods thereafter, unless written notice of termination is submitted within six (6) months prior to the end of the then-current term.\nAir Products pays us a base price per ton, which acts as a floor price, Air Products will pay us an additional amount based on Air Products profits above a minimum targeted margin. The CO2 Agreement also contains a take or pay obligation pursuant to which Air Products agrees to pay us for a minimum number of tons each year. CO2 was 0.2% of our revenue for Fiscal 2022 and 0.3% in Fiscal 2021.\nPrincipal Product Markets\nAs described below in Distribution Methods, we market and distribute all of our denatured ethanol through Bunge pursuant to the terms of an Ethanol Agreement effective January 1, 2020, and we market and distribute all of our distiller grains and corn oil ourselves.\nOur ethanol, distillers grains and distillers corn oil are primarily sold in the domestic market; however, as markets allow, our products can be, and have been, sold in the export markets. We explore all markets for our distillers grains and corn oil products, and we expect Bunge to explore all markets for our ethanol, including export markets. We believe that there is some potential for increased international sales of our products; however, due to high transportation costs, and the fact that we are not located near a major international shipping port, we expect a majority of our products to continue to be marketed and sold domestically.\nAccording to the U.S. Energy Information Administration (the \"EIA\"), in the first eight months of 2022, ethanol exports increased 27% as compared to the first eight months of 2021, and 15% as compared to the first eight months of 2020. This puts exports at their highest level for this period since 2018.Canada remains the country importing the largest percentage of ethanol produced in the United States. South Korea has become the second largest export market for ethanol produced in the United States, while India remains close behind as the third largest destination of U.S. ethanol exports. Exports of the U.S. ethanol to these three countries constitute roughly 52% of all U.S. ethanol exports. The Netherlands and Brazil represent the remaining countries in the top 5 for destinations for U.S. ethanol exports in the first eight months of 2022.\nEthanol export demand is more unpredictable than domestic demand, and tends to fluctuate over time as it is subject to monetary and political forces in other nations. For instance, a strong U.S. Dollar is an example of a force that may negatively impact ethanol exports from the United States. In addition, the Chinese and Brazil tariffs have had, and likely will continue to have, a negative impact on the export market demand and prices for ethanol produced in the United States. There is also potential for the imposition of tariffs by other countries in addition to Brazil and China due to trade disputes with the United States which could reduce the overall export demand and therefore could have a negative impact on ethanol prices.\nDistillers grains have become more accepted as animal feed throughout the world and therefore, distillers grains exports have increased and may continue to increase as worldwide acceptance grows. According to the Renewable Fuels Association (the \"RFA\"), U.S. distillers grains annual exports through September 30, 2022 were approximately 1% higher than distillers grains exports for the same nine month period last year. Mexico, South Korea and Vietnam are now the top destinations for U.S. distillers grains.\nWe market and distribute all of the corn oil we produce directly to end users or middlemen within the domestic market. Corn oil can be used as the feedstock to produce biodiesel, as a feed ingredient and has other industrial uses.\nDistribution Methods\nThe Company is a party to an Amended and Restated Ethanol Purchase Agreement effective January 1, 2020 with Bunge (the Ethanol Agreement). Under the Ethanol Agreement, the Company sells Bunge denatured ethanol produced by the Company, and Bunge purchases the same. The Company pays Bunge a flat monthly marketing fee for its services under the Ethanol Agreement. The term of the Ethanol Agreement expires on December 31, 2026.\nRail lease charges are the monthly lease payment for rail cars along with all administrative and tax filing fees for such leased rail cars.\nRaw Materials\nCorn Requirements\nThe principal raw material necessary to produce ethanol, distillers grain and corn oil is corn. We are significantly dependent on the availability and price of corn which are affected by supply and demand factors such as crop production, carryout, exports, government policies and programs, risk management and weather. With the volatility of the weather and commodity markets, we cannot predict the future price of corn. Because the market price of ethanol is not directly related to corn prices, we, like most ethanol producers, are not able to compensate for increases in the cost of corn through adjustments in our prices for our ethanol although we do see increases in the prices of our distillers grain during times of higher corn prices. However, given that ethanol sales comprise a majority of our revenues, our inability to adjust our ethanol prices can result in a negative impact on our profitability during periods of high corn prices.\nHigh corn prices have a negative effect on our operating margins unless the price of ethanol and distillers grains out paces rising corn prices. During Fiscal 2022, corn prices were higher compared to Fiscal 2021. Overall corn acres planted in 2022 were down 3.3% over 2021 and the nationwide yield was 2.4% lower than in 2021 as well. Drought conditions varied widely across Iowa and Nebraska which has resulted in lower bushels received during the 2022 harvest compared to the 2021 harvest.\nOur management expects that corn prices will remain steady or move slightly higher through the first two quarters of our fiscal year ending September 30, 2023 (\"Fiscal 2023\") due to the expected yield reductions that are forecasted by the United States Department of Agriculture (the \"USDA\"). If corn prices continue to be at the higher price levels seen in 2021 and 2022, it would have an adverse impact on our operating margins unless the prices we receive for our ethanol and distillers grains are able to outpace the higher corn prices. Management continually monitors corn prices and the availability of corn near the Facility and also continually attempts to minimize the effects of the volatility of corn costs on profitability through its risk management strategies, including hedging positions taken in the corn market.\nOur Facility would need approximately 48.3 million bushels of corn annually, to produce 140 million gallons of ethanol, or approximately 132,300 bushels per day. During Fiscal 2022 we purchased 8.5% less corn compared to Fiscal 2021, which was obtained entirely from local markets. The Company is responsible for procuring the corn necessary for the operation of the Facility.\nEnergy Requirements\nThe production of ethanol is an energy intensive process which uses significant amounts of electricity and steam or natural gas as a heat source. Presently, 21,000 to 22,000 MMBTUs of energy are required to produce a gallon of ethanol. It is our goal to operate the plant as safely and profitably as possible, optimizing the amount of energy consumed per gallon of ethanol produced, balanced with the relative values of WDGS as compared to DDGS.\nIn September 2019, the Company went on line with the Whitefox Integrated Cartridge Efficiency (ICE) system to push towards more efficient operations in our plant. This technology benefits the plant through energy reduction, purity flexibility and debottlenecking of the distillation and dehydration processes. Energy efficiency improved by approximately 1,000 BTU's per gallon of ethanol produced, which results in steam savings and carbon emission reductions In April 2020, the Company implemented Bioleap's Dryer Exhaust Energy Recovers (\"DEER\"). The DEER system reduces the steam load on the boilers, providing immediate energy savings and freeing up capacity on the current boiler system.\nSteam\nWe are party to a Steam Service Contract (Steam Contract) with MidAmerican Energy Company (MidAm), under which MidAm agreed to provide up to 475,000 pounds of steam per hour. The Steam Contract links our net energy rates and charges for steam to certain specified energy indexes, subject to certain minimum and maximum rates. The Steam Contract expires in November 2024. During Fiscal 2022, we did not purchase any steam from MidAm and steam availability from MidAm continues to be volatile as a result of MidAms increased utilization of wind energy, rather than coal, since Fiscal 2017.\nNatural Gas\nNatural gas accounted for approximately 67.7% of our energy usage (natural gas and electricity) in Fiscal 2022, compared to 66.3% in Fiscal 2021. The increase in our natural gas usage was due to decreased steam availability and certain minimum payment obligations specified in our contract with MidAm. We have two natural gas boilers for use when our steam service is unavailable. Natural gas is also needed for incidental purposes. We entered into a natural gas supply agreement with Encore Energy in April of 2012 to fulfill our natural gas needs at the Gas Daily Midpoint pricing.\nElectricity\nOur Facility requires a large continuous supply of electrical energy. In Fiscal 2022 we used approximately 1.4% more electricity compared to Fiscal 2021. The slight increase was due to high usage at peak times. The Company continues to explore technology improvements that reduce the amount of electricity we use and automating the timing of turning on equipment that requires large electrical loads.\nWater\nWe require a supply of water typical for the industry for our production process. Our primary water source comes from the underground Missouri River aquifer via our three onsite wells. The majority of the water used in an ethanol plant is recycled back into the plant. All our ground water is treated through our onsite water oxidation system. This filtered water is used throughout our process. We do treat (polish) some of this filtered water for boiler and cooling tower make-up with our Reverse Osmosis (RO) system to minimize any elements that will harm the boiler and steam systems as permitted. We send some of our non-process contact water back to the Missouri River. The makeup water requirements for the cooling tower are primarily a result of evaporation and cooling. We also evaporate much of our water through our dryer system for dried corn distillers grains. The rest of our process water is recycled back into the plant, which minimizes waste of our water supply.\nPatents, Trademarks, Licenses, Franchises and Concessions\nSIRE® and our SIRE® logo are registered trademarks of the Company in the United States. Other trademarks, service marks and trade names used in this report constitute common law trademarks and/or service marks of the Company. Other parties marks referred to in this report are the property of their respective owners. We were granted a perpetual license by ICM, Inc. (ICM) to use certain ethanol production technology necessary to operate our Facility. There is no ongoing fee or definitive calendar term for this license.\nSeasonality of Sales\nWe experience some seasonality of demand for our ethanol. Since ethanol is predominantly blended with conventional gasoline for use in automobiles, ethanol demand tends to shift in relation to gasoline demand. As a result, we experience some seasonality of demand for ethanol in the summer months related to increased driving. In addition, we experience some increased ethanol demand during holiday seasons related to increased gasoline demand.\nRisk Management and Hedging Transactions\nThe profitability of our operations is highly dependent on the impact of market fluctuations associated with commodity prices. We use various derivative instruments as part of an overall strategy to manage market risk and to reduce the risk that our ethanol production will become unprofitable when market prices among our principal commodities and products do not correlate. In order to mitigate our commodity and product price risks, we enter into hedging transactions, including forward corn, ethanol, distillers grain and natural gas contracts, in an attempt to partially offset the effects of price volatility for corn and ethanol. We also enter into over-the-counter and exchange-traded futures and option contracts for corn, ethanol and distillers grains, designed to limit our exposure to increases in the price of corn and manage ethanol price fluctuations. Although we believe that our hedging strategies can reduce the risk of price fluctuations, the financial statement impact of these activities depends upon, among other things, the prices involved and our ability to physically receive or deliver the commodities involved. Our hedging activities could cause net income to be volatile from quarter to quarter due to the timing of the change in value of the derivative instruments relative to the cost and use of the commodity being hedged. As corn and ethanol prices move in reaction to market trends and information, our income statement will be affected depending on the impact such market movements have on the value of our derivative instruments.\nHedging arrangements expose us to the risk of financial loss in situations where the counterparty to the hedging contract defaults or, in the case of exchange-traded contracts, where there is a change in the expected differential between the price of the commodity underlying the hedging agreement and the actual prices paid or received by us for the physical commodity bought or sold. There are also situations where the hedging transactions themselves may result in losses, as when a position is purchased in a declining market or a position is sold in a rising market. Hedging losses may be offset by a decreased cash price for corn and natural gas and an increased cash price for ethanol and distillers grains.\nWe continually monitor and manage our commodity risk exposure and our hedging transactions as part of our overall risk management policy. As a result, we may vary the amount of hedging or other risk mitigation strategies we undertake, and we may choose not to engage in hedging transactions. Our ability to hedge is always subject to our liquidity and available capital.\nDependence on One or a Few Major Customers\nAs discussed above, we have a marketing agreement with Bunge for the purpose of marketing and distributing our denatured ethanol product. Currently, we do not have the ability to market our ethanol internally should Bunge be unable or refuse to market our ethanol at acceptable prices. However, we anticipate that we would be able to very quickly secure competitive marketers should we need to replace Bunge for any reason.\nIn Fiscal 2022, Bunge constituted 65.7% of total revenues, compared to almost 74% of revenue in Fiscal 2021.\nCompetition\nDomestic Ethanol Competitors\nThe ethanol we produce is similar to ethanol produced by other domestic plants. At the end of 2021, the Renewable Fuels Association (\"RFA\") estimated that there were 208 installed ethanol production facilities in the United States with a total capacity of 17.7 billion gallons based on nameplate capacity and 5 additional plants under expansion or construction. In Fiscal 2022 we have seen a rebound in the ethanol margin environment that shows a substantial improvement from the decade lows experienced in 2020. As a result, competing plants have come back on line or otherwise resumed operations and expansion has resumed within the industry, primarily in North Dakota. While it is important to note that 2020 was an atypical year as transportation fuel demand was severely reduced because of COVID-19 restrictions and lockdowns, there is renewed optimism in the market as ethanol commodity prices have pushed through the $2.00/ gallon mark, a feat last accomplished in 2014.\nSince ethanol is a commodity product, competition in the industry is predominately based on price. The top five producers account for almost half of domestic production. We are in direct competition with many of these top five producers as well as other national producers, many of whom have greater resources and experience than we have and each of which is producing significantly more ethanol than we produce. In addition, we believe that the ethanol industry will continue to consolidate leading to a market where a small number of large ethanol producers with substantial production capacities will control an even larger portion of the U.S. ethanol production. In recent years, the ethanol industry has also seen increased competition from oil companies that have purchased ethanol production facilities. These oil companies are required to blend a certain amount of ethanol each year.\nWe may be at a competitive disadvantage compared to our larger competitors and the oil companies who are capable of producing a significantly greater amount of ethanol, have multiple ethanol plants that may help them achieve certain efficiencies and other benefits that we cannot achieve with one ethanol plant or are able to operate at times when it is unprofitable for us to operate. For instance, ethanol producers that own multiple plants may be able to compete in the marketplace more effectively, especially during periods when operating margins are unfavorable, because they have the flexibility to run certain production facilities while reducing production or shutting down production at other facilities. These large producers may also be able to realize economies of scale which we are unable to realize or they may have better negotiating positions with purchasers. Further, new products or methods of ethanol production developed by larger and better-financed competitors could create competitive advantages over us.\nForeign Ethanol Competitors\nIn recent years, the ethanol industry has experienced increased competition from international suppliers of ethanol and although ethanol imports have decreased during the past few years, if competition from ethanol imports were to increase again, such increased imports could negatively impact demand for domestic ethanol which could adversely impact our financial results. Large international companies with much greater resources than ours have developed, or are developing, increased foreign ethanol production capacities.\nMany international suppliers produce ethanol primarily from inputs other than corn, such as sugarcane, and have cost structures that may be substantially lower than U.S. based ethanol producers including us. Many of these international suppliers are companies with much greater resources than us with greater production capacities.\nBrazil is the worlds second largest ethanol producer. Brazil makes ethanol primarily from sugarcane as opposed to corn, and depending on feedstock prices, may be less expensive to produce. Brazilian imports account for less than 1% of U.S. ethanol consumed. Many in the ethanol industry are concerned that certain provisions of the Renewable Fuel Standard (the \"RFS\") as adopted may disproportionately benefit ethanol produced from sugarcane. This could make sugarcane based ethanol, which is primarily produced in Brazil, more competitive in the United States ethanol market. If this were to occur, it could reduce demand for the ethanol that we produce. In recent years, sugarcane ethanol imported from Brazil has been one of the most economical means for certain obligated parties to comply with the RFS requirement to blend 5 billion gallons of advanced biofuels. U.S. imports of ethanol produced in Brazil are flat through the first eight months of 2022 compared to the same period in 2021. During 2021, U.S. ethanol imports declined due to lower production and higher prices of Brazilian ethanol, declining prices of California Low Carbon Fuel Standard credits, and volatile RFS credit price dynamics. Per the RFA, virtually all imports of fuel ethanol in 2021 entered the United States in California, where they can take advantage of the state's Low Carbon Fuel Standard and get premium values for \"advanced biofuel\" RFS credits.\nDepending on feedstock prices, ethanol imported from foreign countries, including Brazil, may be less expensive than domestically-produced ethanol. However, foreign demand, transportation costs and infrastructure constraints may temper the market impact on the United States.\nLocal Ethanol Production\nBecause we are located on the border of Iowa and Nebraska, and because ethanol producers generally compete primarily with local and regional producers, the ethanol producers located in Iowa and Nebraska presently constitute our primary competition. According to the RFA, Iowa had 43 operating ethanol refineries in production, with a combined nameplate capacity to produce 4.7 billion gallons of ethanol. For Nebraska, the RFA reports there are currently 26 existing ethanol plants in production in Nebraska, with a combined ethanol nameplate production capacity of approximately 2.4 billion gallons. Given the recent highs in ethanol margins, local competition continues to strengthen following the downturn in 2020 caused primarily by the impacts of the COVID-19 pandemic.\nCompetition from Alternative Renewable Fuels\nMany of the current ethanol production incentives are designed to encourage the production of renewable fuels using raw materials other than corn, including cellulose. Cellulose is the main component of plant cell walls and is the most common organic compound on earth. Cellulose is found in wood chips, corn stalks, rice straw, amongst other common plants. Cellulosic ethanol is ethanol produced from cellulose. Research continues regarding cellulosic ethanol, and various companies are in various stages of developing and constructing some of the first generation cellulosic plants. Several companies have commenced pilot projects to study the feasibility of commercially producing cellulosic ethanol and are producing cellulosic ethanol on a small scale and, at a few companies in the United States have begun producing on a commercial scale. Additional commercial scale cellulosic ethanol plants could be completed in the near future, although these cellulosic ethanol plants have continued to face financial and technological issues. If this technology can be profitably employed on a commercial scale, it could potentially lead to ethanol that is less expensive to produce than corn based ethanol. Cellulosic ethanol may also capture more government subsidies and assistance than corn based ethanol. This could decrease demand for our product or result in competitive disadvantages for our ethanol production process.\nBecause our Facility is designed as a single-feedstock facility, we have limited ability to adapt the plant to a different feedstock or process system without additional capital investment and retooling.\nA number of automotive, industrial and power generation manufacturers are developing alternative clean power systems using fuel cells, plug-in hybrids, electric cars or clean burning gaseous fuels. Like ethanol, the emerging fuel cell and electric-powered vehicle industries offer technological options to address worldwide energy costs, the long-term availability of petroleum reserves and environmental concerns. Fuel cells have emerged as a potential alternative to certain existing power sources because of their higher efficiency, reduced noise and lower emissions. Fuel cell industry participants are currently targeting the transportation, stationary power and portable power markets in order to decrease fuel costs, lessen dependence on crude oil and reduce harmful emissions. The same can be said of electric-powered vehicles. If the fuel cell industry continues to expand and gain broad acceptance and becomes readily available to consumers for motor vehicle use, we may not be able to compete effectively. Likewise, participants in the emerging electric-powered vehicle industry are currently targeting the transportation market to decrease dependence on crude oil and reduce harmful emissions. If the electric-powered vehicle industry continues to expand and gain broad acceptance, the ethanol and larger gasoline industry may not be able to compete effectively. This additional competition could reduce the demand for ethanol, which would negatively impact our profitability.\nDistillers Grain Competition\nEthanol plants in the Midwest produce the majority of distillers grains and primarily compete with other ethanol producers in the production and sales of distillers grains. According to the RFA 2022 Ethanol Outlook (the \"RFA 2022 Outlook\"), ethanol plants produced almost 35.4 million metric tons of distillers grains and other animal feed in 2021 and 3.8 billion pounds of distillers corn oil. We compete with other producers of distillers grains products both locally and nationally.\nThe primary customers of distillers grains are dairy and beef cattle, according to the RFA 2022 Outlook, which comprises 74% of distiller grains consumption. In recent years, an increasing amount of distillers grains have been used in the swine, poultry and fish markets. Numerous feeding trials show advantages in milk production, growth, rumen health, and palatability over other dairy cattle feeds. With the advancement of research into the feeding rations of poultry and swine, we expect these markets to expand and create additional demand for distillers grains; however, no assurance can be given that these markets will in fact expand, or if they do, that we will benefit from such expansion.\nThe market for distillers grains is generally confined to locations where freight costs allow it to be competitively priced against other feed ingredients. Distillers grains compete with three other feed formulations: corn gluten feed, dry brewers grain and mill feeds. The primary value of these products as animal feed is their protein content. Dry brewers grain and distillers grains have about the same protein content, and corn gluten feed and mill feeds have slightly lower protein contents. Distillers grains contain nutrients, fat content, and fiber that we believe will differentiate our distillers grains products from other feed formulations. However, producers of other forms of animal feed may also have greater experience and resources than we do and their products may have greater acceptance among producers of beef and dairy cattle, poultry and hogs.\nPrincipal Supply & Demand Factors\nEthanol\nEthanol prices increased dramatically during Fiscal 2022 , reaching heights not seen since 2014 as the rebounding demand for blended gasoline and decreased supply following slow-downs in production during Fiscal 2020 caused prices to rise. The average price received for a gallon of ethanol averaged $2.41 in Fiscal 2022 compared to $1.76 in Fiscal 2021. The same price increases were also experienced with the inputs where the price of corn increased from an average of $5.47 a bushel in Fiscal 2021 to an average of $6.43 a bushel in Fiscal 2022.\nManagement currently expects ethanol prices will continue to adjust to the supply and demand factors of ethanol and oil and will generally fluctuate with, but not be directly correlated to, the price of corn.\nManagement believes the industry will need to align the retail product delivery infrastructure and demand for ethanol in order to increase production margins in the near and long term. The supply and demand in the industry remain in relative balance at current production values.\nManagement also believes it is important that ethanol blending capabilities of the gasoline market be expanded to increase demand for ethanol. Recently, there has been increased awareness of the need to expand retail ethanol distribution and blending infrastructure, which would allow the ethanol industry to supply ethanol to markets in the United States that are not currently selling significant amounts of ethanol. On April 29, 2022, the U.S. Environmental Protection Agency, (the \"EPA\"), issued an emergency waiver, allowing E15 (gasoline containing 15 percent ethanol) to be sold during the summer driving season. As of this filing, according to Prime the Pump, E15 is sold year-round at approximately 2,743 stations in 31 states. The EPA has stated that it will continue to monitor the supply with industry and federal partners, and the EPA expects to issue new waivers effectively extending the emergency fuel waiver until such time as the extreme and unusual fuel supply circumstances due to the war in Ukraine are no longer present.\nDistillers Grains\nDistillers grains compete with other protein-based animal feed products. Every bushel of corn used in the dry grind ethanol process yields approximately 17 pounds of dry distillers grains, which is an excellent source of energy and protein for livestock and poultry. The price of distillers grains may decrease when the prices of competing feed products decrease. The prices of competing animal feed products are based in part on the prices of the commodities from which these products are derived. Downward pressure on commodity prices, such as soybeans and corn, will generally cause the price of competing animal feed products to decline, resulting in downward pressure on the price of distillers grains.\nHistorically, sales prices for distillers grains have correlated with prices of corn. However, there have been occasions when the price increase for this co-product has not been directly correlated to changes in corn prices. In addition, our distillers grains compete with products made from other feedstocks, the cost of which may not rise when corn prices rise. Consequently, the price we may receive for distillers grains may not rise as corn prices rise, thereby lowering our cost recovery percentage relative to corn.\nManagement expects that distillers grain prices will continue to generally follow the price of corn during Fiscal 2023.\nCompetition for Supply of Corn\nDuring crop year 2022/23, according to the USDA October 2022 report, 80.8 million acres of corn were harvested, which is down 5.3% from 2021/22. The expected yield is 172.5 bushels per acre, which is down 2.4% compared to 2021's results. The higher prices for corn experienced in Fiscal 2022 are expected to continue due to drought conditions and supply constraints.\nCompetition for corn supply from other ethanol plants and other corn customers exists around our Facility. According to the RFA 2022 Outlook, there were 43 operational ethanol plants in Iowa. The plants are concentrated, for the most part, in the northern and central regions of the state where a majority of the corn is produced.\nWe compete with other users of corn, including ethanol producers regionally and nationally, producers of food and food ingredients for human consumption (such as high fructose corn syrup, starches, and sweeteners), producers of animal feed and industrial users. According to the USDA, for 2022/2023, 5.3 billion bushels of U.S. corn are expected to be used in ethanol production, with 6.8 billion bushels being used in food and other industrial uses, and 2.3 billion bushels used for export. In 2021/2022, 5.3 billion bushel were used in ethanol production, with 6.8 billion used in food and other industrial uses and 2.5 billion used for export.\nFederal Ethanol Support and Governmental Regulations\nRenewable Fuel Standard\nThe ethanol industry receives support through the Federal Renewable Fuels Standard (the \"RFS\") which has been, and continues to be, a driving factor in the growth of ethanol usage. The RFS requires that each year a certain amount of renewable fuels must be used in the United States. The RFS is a national program that allows refiners to use renewable fuel blends in those areas of the country where it is most cost-effective. The EPA is responsible for revising and implementing regulations to ensure that transportation fuel sold in the United States contains a minimum volume of renewable fuel. The RFS statutory volume requirement increases incrementally each year until the United States is statutorily required to use 36 billion gallons of renewable fuels by calendar year 2022. The EPA has the authority, however, to waive the RFS statutory volume requirements, in whole or in part, provided that there is either inadequate domestic renewable fuel supply or the implementation of the requirement would severely harm the economy or environment of a state, region or the United States.\nAnnually, the EPA is required by statute to pass a rule that establishes the number of gallons of different types of renewable fuels that must be used in the United States which is called the renewable volume obligation. For 2020, 2021, and 2022 the statutory volume requirements for renewable fuels were 30 billion gallons, 33 billion gallons, and 36 billion gallons, respectively. On June 3, 2022, the EPA released the final rules for the renewable volume obligations (\"RVOs\") for 2020, 2021 and 2022, and set the RVOs at 17.13 billion gallons for 2020, 18.84 billion gallons for 2021 and 20.63 billion gallons for 2022. An additional 250 million supplemental gallons were added to the RVOs for 2022 in order to address the court-ordered remand of previously lowered RVOs for 2014-2016.\nOn December 1, 2022, the EPA released a proposed rule to set the RVOs for 2023, 2024 and 2025 which set the annual volume requirement for renewable fuel at 20.82 billion gallons for 2023, 21.87 billion gallons for 2024 and 22.68 billion gallons for 2025 (the Proposed Rule). This is the first time that the EPA has set RVOs without using the volume requirements set out in the Energy Independent and Security Act of 2002 (the EISA) which provided statutory volume requirements through 2022. When setting the volume requirements beyond the statutory mandates within the EISA, the EPA has more discretion and takes into consideration various factors including, without limitation, costs, air quality, climate change, energy security and infrastructure issues. Under the Proposed Rule, the number of gallons which may be met by conventional renewable fuels such as corn-based ethanol is set at 15.0 billion gallons for 2023 and increases to 15.25 billion gallons in 2024 and 2025. The Proposed Rule also provides for an additional 250 million gallon supplemental volume requirement in 2023 to continue to address the court-ordered remand of previously lowered RVOs as a result of denied small refinery waivers. The EPA is currently soliciting comments on the Proposed Rule and a public hearing on the Proposed Rule will be held in January 10, 2023.\nFederal regulations supporting the use of renewable fuels like the RFS are a significant driver of ethanol demand in the U.S. Under the RFS, the EPA assigns individual refiners, blenders, and importers the volume of renewable fuels they are obligated to use based on their percentage of total domestic transportation fuel sales. The mechanism that provides accountability in RFS compliance is the Renewable Identification Number (\"RIN\"). RINs are a tradeable commodity given that if refiners (obligated parties) need additional RINs to be compliant, they have to purchase them from those that have excess. Thus, there is an economic incentive to use renewable fuels like ethanol, or in the alternative, buy RINs. Obligated parties use RINs to show compliance with RFS-regulated volumes. RINs are attached to renewable fuels by ethanol producers and detached when the renewable fuel is blended with transportation fuel or traded in the open market. The market price of detached RINs affects the price of ethanol in certain markets and influences the purchasing decisions by obligated parties.\nThe Proposed Rule also sets out proposed regulations relating to the generation of RINS for renewable electricity used to fuel vehicles (eRINS). Under the Proposed Rule, car manufacturers would be able to register with the EPA and generate eRINs for power produced from qualifying renewable biomass, including biogas from methane digesters and anaerobic digestion facilities. The Proposed Rule specifies that qualifying renewable electricity must be generated from a feedstock that qualifies as renewable biomass under Section 211(o)(1)(I) of the Clean Air Act and that other forms of renewable electricity, such as solar, wind and hydropower, will not qualify for eRINs. Manufacturers could start earning eRINs in 2024. As noted above, the Proposed Rule is currently open for public comment and in the Proposed Rule, the EPA notes that it is open to comments on alternative approaches to eRINs, including allowing renewable electricity producers, public access charging stations, independent third parties, or a combination of entities to generate credits. We cannot predict at this time the impact, if any, that the generation of eRINs will have on the traditional RIN market.\nAlthough renewable volume obligations establish the number of gallons of renewable fuel that must be blended into the nations fuel supply, these obligations do not take into account waivers granted by the EPA to small refiners for \"hardship.\" The EPA can, in consultation with the Department of Energy, waive the obligation for individual smaller refineries that are suffering disproportionate economic hardship due to compliance with the RFS. To qualify for this small refinery waiver, the refineries must be under total throughput of 75,000 barrels per day and state their case for an exemption in an application to the EPA each year. On June 3, 2022, the EPA announced the denial of 69 petitions from small refineries seeking small refinery exemptions(SREs) from the RFS program for one or more of the compliance years between 2016 and 2021. Having a final conclusion to this issue that has been ongoing for many years will help provide more stability within the RIN's market; however, there are multiple legal challenges to how the EPA has handled SREs and RFS rulemakings.\nInflation Reduction Act of 2022\nAmong its other provisions, the Inflation Reduction Act of 2022 (IRA), which was signed into law on August 16, 2022, significantly expands clean energy incentives by providing an estimated $370 billion of new energy related tax credits over the next ten years. It also permits more flexibility for taxpayers to use the credits with direct-pay and transferable credit options.\nMore specifically, the IRA legislation (a) created a new Clean Fuel Production Credit, section 45Z of the Internal Revenue Code, which runs from 2025 to 2027 of up to $1.00 per gallon, which could apply to our fuel ethanol, depending on the level of GHG reduction for each gallon; (b) created a new tax credit for sustainable aviation fuel of $1.25 to $1.75 per gallon, depending on the GHG reduction for each gallon, that could possibly involve some of our low carbon ethanol through an alcohol to jet pathway, depending on the life cycle analysis model being used (this credit expires after 2024 and shifts to the Clean Fuel Production Credit, where it qualifies for up to $1.75 per gallon); (c) expanded the carbon capture and sequestration credit, section 45Q, to $85 for each metric ton of carbon sequestered, which could impact potential carbon capture investments; (d) extended the biodiesel tax credit which could impact our distillers corn oil values, as this co-product serves as a low-carbon feedstock for renewable diesel and biomass based diesel production; (e) funded biofuel refueling infrastructure, which could impact the availability of higher level ethanol blended fuel; (f) increased funding for working lands conservation programs for farmers by $20 billion; and (g) provided credits for the production and purchase of electric vehicles, which could impact the amount of internal combustion engines built and sold longer term, and by extension impact the demand for liquid fuels including ethanol.\nThe IRA is a sweeping policy that could have many potential impacts on our business and the Company continues to evaluate the provisions of the IRA and its potential benefits.\nState Initiatives and Mandates\nIn 2006, Iowa passed legislation promoting the use of renewable fuels in Iowa. One of the most significant provisions of the Iowa renewable fuels legislation was a renewable fuels targeted set of tax credits encouraging an escalating percentage of the gasoline sold in Iowa to consist of, be blended with, or be replaced by, renewable fuels. To receive the tax credit, retailers of gasoline are required to reach escalating annual targets of the percentage of their gasoline sales that consist of, are blended with, or are replaced by, renewable fuels. This renewable fuel tax credit originally required 10% of the gasoline that retailers sold to fall within the renewable fuels definitions to receive the credit and has increased incrementally to 25% as of January 1, 2020. This tax credit automatically repealed itself on January 1, 2021 for tax years beginning on or after that date.\nEnvironmental and Other Regulations and Permits\nEthanol production involves the emission of various airborne pollutants, including particulate matters, carbon monoxide, oxides of nitrogen, volatile organic compounds and sulfur dioxide. Ethanol production also requires the use of significant volumes of water, a portion of which is treated and discharged into the environment. We are required to maintain various environmental and operating permits. Even though we have successfully acquired the permits necessary for our operations, any retroactive change in environmental regulations, either at the federal or state level, could require us to obtain additional or new permits or spend considerable resources on complying with such regulations. In addition, if we sought to expand the Facilitys capacity in the future, above our current 140 million gallons, we would likely be required to acquire additional regulatory permits and could also be required to install additional pollution control equipment. Our failure to obtain and maintain any environmental and/or operating permits currently required or which may be required in the future could force us to make material changes to our Facility or to shut down altogether.\nThe U.S. Supreme Court has classified carbon dioxide as an air pollutant under the Clean Air Act in a case seeking to require the EPA to regulate carbon dioxide in vehicle emissions. As stated above, we believe the final RFS2 regulations grandfather our plant at its current operating capacity, though expansion of our plant will need to meet a threshold of a 20% reduction in greenhouse gas (GHG) emissions from a baseline measurement to produce ethanol eligible for the RFS2 mandate. In order to expand capacity at our plant above our current permitted 147 million gallons, we will be required to obtain additional permits and install improved technology.\nPart of our business is regulated by environmental laws and regulations governing the labeling, use, storage, discharge and disposal of hazardous materials. Other examples of government policies that can have an impact on our business include tariffs, duties, subsidies, import and export restrictions and outright embargos.\nWe also employ maintenance and operations personnel at our Facility. In addition to the attention that we place on the health and safety of our employees, the operations at our Facility are governed by the regulations of the Occupational Safety and Health Administration, or OSHA.\nWe have obtained all of the necessary permits to operate the plant. Although we have been successful in obtaining all of the permits currently required, any retroactive change in environmental regulations, either at the federal or state level, could require us to obtain additional or new permits or spend considerable resources in complying with such regulations.\nAvailable Information\nOur annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act are available free of charge on our website at www.sireethanol.com as soon as reasonably practicable after we file or furnish such information electronically with the SEC. The information found on our website is not incorporated by reference into this report or any other report we file with or furnish to the SEC.\nThe public may read and copy any materials we file with the SEC at the SECs Public Reference Room at 100 F Street, NE, Washington, DC. The public may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC also maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at www.sec.gov. Item 1A. Risk Factors.\nYou should carefully read and consider the risks and uncertainties below and the other information contained in this report. The risks and uncertainties described below are not the only ones we may face. The following risks, together with additional risks and uncertainties not currently known to us or that we currently deem immaterial, could impair our financial condition and results of operation.\nRisks Associated With Our Capital Structure\nOur units have no public trading market and are subject to significant transfer restrictions which could make it difficult to sell units and could reduce the value of the units.\nThere is not an active trading market for our membership units. To maintain our partnership tax status, our units may not be publicly traded. Within applicable tax regulations, we utilize a qualified matching service (QMS) to provide a limited market to our members, but we have not and will not apply for listing of the units on any stock exchange. Finally, applicable securities laws may also restrict the transfer of our units. As a result, while a limited market for our units may develop through the QMS, members may not sell units readily, and use of the QMS is subject to a variety of conditions and limitations. The transfer of our units is also restricted by our Fifth Amended and Restated Operating Agreement dated June 19, 2020 (the Operating Agreement) unless the Board of Directors (the Board or Board of Directors) approves such a transfer. Furthermore, the Board will not approve transfer requests which would cause the Company to be characterized as a publicly traded partnership under the regulations adopted under the Internal Revenue Code of 1986, as amended (the Code). The value of our units will likely be lower because they are illiquid. Members are required to bear the economic risks associated with an investment in us for an indefinite period of time.\nOur current indebtedness requires us to comply with certain restrictive loan covenants which may limit our ability to operate our business.\nUnder the terms of our Credit Agreement, we have made certain customary representations and we are subject to customary affirmative and negative covenants, including restrictions on our ability to incur additional debt that is not subordinated, create additional liens, transfer or dispose of assets, make distributions, consolidate, dissolve or merge, and customary events of default (including payment defaults, covenant defaults, cross defaults and bankruptcy defaults). The Credit Agreement also contains financial covenants including a minimum working capital and a minimum debt service coverage ratio. We can provide no assurance that, if we are unable to comply with these covenants in the future, we will be able to obtain the necessary waivers or amend our loan agreements to prevent a default.\nA breach of any of these covenants or requirements could result in a default under our Credit Agreement. If we default under our Credit Agreement and we are unable to cure the default or obtain a waiver, we will not be able to access the credit available under our Credit Agreement and there can be no assurance that we would be able to obtain alternative financing. Our Credit Agreement also includes customary default provisions that entitle our lenders to take various actions in the event of a default, including, but not limited to, demanding payment for all amounts outstanding. If this occurs, we may not be able to repay such indebtedness or borrow sufficient funds to refinance. Even if new financing is available, it may not be on terms that are acceptable to us. No assurance can be given that our future operating results will be sufficient to achieve compliance with the covenants and requirements of our Credit Agreement.\nRisks Associated With Operations\nThe ongoing impacts of the COVID-19 pandemic and its variants may negatively affect our operations, financial condition, and demand for our products.\nThe COVID-19 pandemic and the new variants of the virus are still impacting countries, communities, supply chains and commodities markets, in addition to the global financial markets. This pandemic has resulted in social distancing, travel bans, governmental stay-at-home orders, and quarantines, and if any of these measures are reinstituted or prolonged, they may limit access to our facilities, customers, suppliers, management, support staff and professional advisors. At this time it is not possible to fully assess the impact of the COVID-19 pandemic on the Companys operations and capital requirements, but the aforementioned factors, among other things, may impact our operations, financial condition and demand for our products, as well as our overall ability to react timely and mitigate the impact of this event. Depending on its severity and longevity, the COVID-19 pandemic may have a material adverse effect on our business, customers, and members.\nThe impact of adverse economic conditions on gasoline could have a material adverse impact on the price and demand for ethanol and our financial performance.\nThe demand for gasoline correlates closely with general economic growth rates. The occurrence of recessions or other periods of low or negative economic growth will typically have a direct adverse impact on gasoline prices. Other factors that affect general economic conditions in the world or in a major region, such as changes in population growth rates, periods of civil unrest, pandemics (e.g. COVID-19), government austerity programs, or currency exchange rate fluctuations, can also impact the demand for gasoline. Sovereign debt downgrades, defaults, inability to access debt markets due to credit or legal constraints, liquidity crises, the breakup or restructuring of fiscal, monetary, or political systems such as the European Union, and other events or conditions (e.g. pandemics such as COVID-19), that impair the functioning of financial markets and institutions also may adversely impact the demand for gasoline. Reduced demand for gasoline may impair demand for ethanol, harm our operations and negatively impact our financial condition.\nInflation may impact the cost and/or availability of materials, inputs and labor, which could adversely affect our operating results.\nWe have experienced inflationary impacts on raw materials, labor costs, wages, components, equipment, other inputs and services across our business and inflation and its impact could escalate in future quarters, many of which are beyond our control. Moreover, we may not be able to pass those costs along in the products we sell. As such, inflationary pressures could have a material adverse effect on our performance and financial statements.\nDeclines in the price of ethanol or distillers grain would significantly reduce our revenues.\nThe sales prices of ethanol and distillers grains can be volatile as a result of a number of factors such as overall supply and demand, the price of gasoline and corn, levels of government support, and the availability and price of competing products. We are dependent on a favorable spread between the price we receive for our ethanol and distillers grains and the price we pay for corn and natural gas. Any lowering of ethanol and distillers grains prices, especially if it is associated with increases in corn and natural gas prices, may affect our ability to operate profitably. We anticipate the price of ethanol and distillers grains to continue to be volatile in the next fiscal year as a result of the net effect of changes in the price of gasoline and corn and increased ethanol supply. Declines in the prices we receive for our ethanol and distillers grains will lead to decreased revenues and may result in our inability to operate the ethanol plant profitably for an extended period of time which could decrease the value of our units.\nOne of the most significant factors influencing the price of ethanol has been the substantial increase in ethanol production in recent years. According to the RFA, domestic ethanol production capacity increased from an annualized rate of 1.5 billion gallons per year in 1999 to a record 16.9 billion gallons in 2019 with additional production capacity still under construction. Given the near record ethanol crush margin at present, owners of ethanol production facilities may increase production levels to pre-pandemic levels or to even greater production levels, resulting in further increases in domestic ethanol inventories. Any increase in the supply of ethanol may not be commensurate with increases in the demand for ethanol, thus leading to lower ethanol prices. Also, demand for ethanol could be impaired due to a number of other factors, including regulatory developments and reduced United States gasoline consumption. Reduced gasoline consumption has occurred in the past and could occur in the future as a result of increased gasoline or oil prices or other factors such as increased automobile fuel efficiency. Any of these outcomes could have a material adverse effect on our results of operations, cash flows and financial condition.\nIncreased demand for ethanol may require an increase in higher percentage blends for conventional automobiles.\nCurrently, ethanol is blended with conventional gasoline for use in standard (non-flex fuel) vehicles to create a blend which is 10% ethanol and 90% conventional gasoline. In order to expand demand for ethanol, higher percentage blends of ethanol must be utilized in conventional automobiles. Such higher percentage blends of ethanol have become a contentious issue with automobile manufacturers and environmental groups having fought against higher percentage ethanol blends. E15 is a blend which is 15% ethanol and 85% conventional gasoline. Although there have been significant developments towards the availability of E15 in the marketplace, there are still obstacles to meaningful market penetration by E15. As a result, the approval of E15 may not significantly increase demand for ethanol.\nReduced ethanol exports due to the imposition of tariffs on U.S. ethanol could have a negative impact on ethanol prices.\nBrazil has historically been a top destination for ethanol produced in the United States. However, Brazil has imposed a tariff on ethanol which is produced in the United States and exported to Brazil. This tariff has resulted in a decline in demand for ethanol from Brazil. Additionally, China has imposed a tariff on ethanol which is produced in the United States and exported to China which has negatively impacted exports of ethanol to China. These tariffs and their associated effects on international demand for ethanol produced in the United States have negatively impacted the market price of ethanol in the United States and could adversely impact our ability to profitably operate the Company in the future.\nOur business is not diversified.\nOur success depends largely on our ability to profitably operate our ethanol plant. We do not have any other lines of business or other sources of revenue if we are unable to operate our ethanol plant and manufacture ethanol, distillers grains, corn oil and carbon dioxide. If economic or political factors adversely affect the market for ethanol, distillers grains, corn oil or carbon dioxide, we have no other line of business to fall back on. Our business would also be significantly harmed if the ethanol plant could not operate at full capacity for any extended period of time.\nAny site near a major waterway system presents potential for flooding risk.\nWhile our site is located in an area designated as above the 100-year flood plain, it does exist within an area at risk of a \"500-year flood\". Even though our site is protected by levee systems, its existence next to a major river and major creeks present a risk that flooding could occur at some point in the future. During the last half of our fiscal year ended September 30, 2011, the Missouri River experienced significant flooding, as a result of unprecedented amounts of rain and snow in the Missouri River basin. This produced a sustained flood lasting many weeks at a \"500-year flood\" level (a level which has a 0.2 percent chance of occurring). While there were levee failures elsewhere, the levees held around our facility. We did experience minimal rail disruption due to flooding in the surrounding areas to the north and south of the Facility, but our operations were not significantly impacted. We have procured flood insurance as a means of risk mitigation; however, there is a chance that such insurance will not cover certain costs in excess of our insurance associated with flood damage or loss of income during a flood period. Our current insurance may not be adequate to cover the losses that could be incurred in a flood of a 500-year magnitude.\nWe may experience delays or disruption in the operation of our rail line and loop track, which may lead to decreased revenues.\nWe have entered into the Track Agreement to service our track and railroad cars. There may be times when we have to slow production at our ethanol plant due to our inability to ship all of the ethanol and distillers grains we produce, or getting rail cars returned on a timely basis. Due to increased rail traffic nationally because of shipments of crude oil, rail shipment delays have been experienced from time to time, especially during severe winter conditions. Additionally, threats of railroad worker strikes have been frequently discussed. If we cannot operate our plant at full capacity, we may experience decreased revenues which may affect the profitability of the Facility.\nHedging transactions, which are primarily intended to stabilize our corn costs, may be ineffective and involve risks and costs that could reduce our profitability and have an adverse impact on our liquidity.\nWe are exposed to market risk from changes in commodity prices. Exposure to commodity price risk results principally from our dependence on corn in the ethanol production process. In an attempt to minimize the effects of the volatility of corn costs on our operating profits, we enter into forward corn, ethanol, and distillers grain contracts and engage in other hedging transactions involving over-the-counter and exchange-traded futures and option contracts for corn; provided, we have sufficient working capital to support such hedging transactions. Hedging is an attempt to protect the price at which we buy corn and the price at which we will sell our products in the future and to reduce profitability and operational risks caused by price fluctuation. The effectiveness of our hedging strategies, and the associated financial impact, depends upon, among other things, the cost of corn and our ability to sell sufficient amounts of ethanol and distillers grains to utilize all of the corn subject to our futures contracts. Our hedging activities may not successfully reduce the risk caused by price fluctuations which may leave us vulnerable to high corn prices. We have experienced hedging losses in the past and we may experience hedging losses again in the future. We may vary the amount of hedging or other price mitigation strategies we undertake, or we may choose not to engage in hedging transactions in the future and our operations and financial conditions may be adversely affected during periods in which corn prices increase.\nHedging arrangements also expose us to the risk of financial loss in situations where the other party to the hedging contract defaults on its contract or, in the case of over-the-counter or exchange-traded contracts, where there is a change in the expected differential between the underlying price in the hedging agreement and the actual prices paid or received by us.\nOur attempts to reduce market risk associated with fluctuations in commodity prices through the use of over-the-counter or exchange-traded futures results in additional costs, such as brokers commissions, and may require cash deposits with brokers or margin calls. Utilizing cash for these costs and to cover margin calls has an impact on the cash we have available for our operations which could result in liquidity problems during times when corn prices fall significantly. Depending on our open derivative positions, we may require additional liquidity with little advance notice to meet margin calls. We have had to in the past, and in the future will likely be required to, cover margin calls. While we continuously monitor our exposure to margin calls, we cannot guarantee that we will be able to maintain adequate liquidity to cover margin calls in the future.\nEthanol production is energy intensive and interruptions in our supply of energy, or volatility in energy prices, could have a material adverse impact on our business.\nEthanol production requires a constant and consistent supply of energy. If our production is halted for any extended period of time, it will have a material adverse effect on our business. If we were to suffer interruptions in our energy supply, our business would be harmed. We have entered into the Steam Contract with MidAm and we also are able to operate at full capacity using natural gas-fired boilers, which mitigates the risk of disruption in steam supply. However, the amount of natural gas we are permitted to use for this purpose is currently limited and the price of natural gas may be significantly higher than our steam price. In addition, natural gas and electricity prices have historically fluctuated significantly. Increases in the price of steam, natural gas or electricity would harm our business by increasing our energy costs. The prices which we will be required to pay for these energy sources will have a direct impact on our costs of producing ethanol and our financial results.\nOur ability to successfully operate depends on the availability of water.\nTo produce ethanol, we need a significant supply of water, and water supply and quality are important requirements to operate an ethanol plant. Our water requirements are supplied by our wells, but there are no assurances that we will continue to have a sufficient supply of water to sustain the Facility in the future, or that we can obtain the necessary permits to obtain water directly from the Missouri River as an alternative to our wells.\nAdverse weather conditions, including as a result of climate change, may adversely affect the availability, quality and price of raw materials required for our operations as well as our operations and operating results.\nAdverse weather conditions have historically caused volatility in the agricultural commodity industry and consequently in our operating results by causing crop failures or significantly reduced harvests, which may affect the supply and pricing of the raw materials required to operate our Facility. Higher basis levels or adverse crop conditions in our corn purchase area can increase the input costs or lower the market value of our products relative to other market participants that do not have the same geographic concentration. Additionally, the potential physical impacts of climate change are uncertain and may vary by region. These potential effects could include changes in rainfall patterns, water shortages, changing sea levels, changing storm patterns and intensities, and changing temperature levels that could adversely impact our costs and business operations. Extreme weather conditions can interfere with our operations and increase our costs, and damage resulting from extreme weather may not be fully insured. However, at this time, we are unable to determine the extent to which any potential climate change may lead to increased weather hazards affecting our operations.\nWe have executed an output contract for the purchase of all of the ethanol we produce, which may result in lower revenues because of decreased marketing flexibility and inability to capitalize on temporary or regional price disparities.\nBunge is the exclusive purchaser of our ethanol and markets our ethanol in national, regional and local markets. We do not plan to build our own sales force or sales organization to support the sale of ethanol. As a result, we are dependent on Bunge to sell our principal product. When there are temporary or regional disparities in ethanol market prices, it could be more financially advantageous to have the flexibility to sell ethanol ourselves through our own sales force. We have decided not to pursue this route.\nWe are increasingly dependent on information technology and disruptions, failures or security breaches of our information technology infrastructure could have a material adverse effect on our operations.\nInformation technology is critically important to our business operations. We rely on information technology networks and systems, including the Internet, to process, transmit and store electronic and financial information, to manage a variety of business processes and activities, including production, manufacturing, financial, logistics, sales, marketing and administrative functions. We depend on our information technology infrastructure to communicate internally and externally with employees, customers, suppliers and others. We also use information technology networks and systems to comply with regulatory, legal and tax requirements. These information technology systems, many of which are managed by third parties or used in connection with shared service centers, may be susceptible to damage, disruptions or shutdowns due to failures during the process of upgrading or replacing software, databases or components thereof, power outages, hardware failures, computer viruses, attacks by computer hackers or other cybersecurity risks, telecommunication failures, user errors, natural disasters, terrorist attacks or other catastrophic events. If any of our significant information technology systems suffer severe damage, disruption or shutdown, and our disaster recovery and business continuity plans do not effectively resolve the issues in a timely manner, our product sales, financial condition and results of operations may be materially and adversely affected, and we could experience delays in reporting our financial results.\nIn addition, if we are unable to prevent physical and electronic break-ins, cyber-attacks and other information security breaches, we may encounter significant disruptions in our operations including our production and manufacturing processes, which can cause us to suffer financial and reputational damage, be subject to litigation or incur remediation costs or penalties. Any such disruption could materially and adversely impact our reputation, business, financial condition and results of operations.\nSuch breaches may also result in the unauthorized disclosure of confidential information belonging to us or to our partners, customers, suppliers or employees which could further harm our reputation or cause us to suffer financial losses or be subject to litigation or other costs or penalties. The mishandling or inappropriate disclosure of non-public sensitive or protected information could lead to the loss of intellectual property, negatively impact planned corporate transactions or damage our reputation and brand image. Misuse, leakage or falsification of legally protected information could also result in a violation of data privacy laws and regulations and have a negative impact on our reputation, business, financial condition and results of operations.\nContinued price volatility and fluctuations in the price of corn may adversely impact our operating results and profitability.\nOur operating results and financial condition are significantly affected by the price and supply of corn. Because ethanol competes with non-corn derived fuels, we generally are unable to readily pass along increases in corn costs to our customers. At certain levels, corn prices may make the production of ethanol uneconomical. There is significant price pressure on local corn markets caused by nearby ethanol plants, livestock industries and other corn consuming enterprises. Additionally, local corn supplies and prices could be adversely affected by rising prices for alternative crops, increasing input costs, changes in government policies, shifts in global markets, or damaging growing conditions such as plant disease or adverse weather conditions, including but not limited to drought.\nTrade actions by the Biden Administration and foreign governments, particularly those affecting the agriculture sector and related industries, could adversely affect our operations and profitability.\nIn a global economy domestic and foreign government policies and regulations significantly impact domestic agricultural commodity production and trade flows. Governmental policies affecting the agricultural industry, such as taxes, trade tariffs, duties, subsidies, import and export restrictions on commodities and commodity products, can influence industry profitability, the planting of certain crops, the location and size of crop production, whether unprocessed or processed commodity products are traded, and the volume and types of imports and exports. International trade disputes can also adversely affect trade flows by limiting or disrupting trade between countries or regions. Future governmental policies, regulations or actions affecting our industry may adversely affect the supply of, demand for and prices of our products, restrict our ability to do business and cause our financial results to suffer.\nDeclines in the price of ethanol or distillers grain would significantly reduce our revenues.\nThe sales prices of ethanol and distillers grains can be volatile as a result of a number of factors such as overall supply and demand, the price of gasoline and corn, levels of government support, and the availability and price of competing products. We are dependent on a favorable spread between the price we receive for our ethanol and distillers grains and the price we pay for corn and natural gas. Any lowering of ethanol and distillers grains prices, especially if it is associated with increases in corn and natural gas prices, may affect our ability to operate profitably. We anticipate the price of ethanol and distillers grains to continue to be volatile in during our 2023 fiscal year as a result of the net effect of changes in the price of gasoline and corn and increased ethanol supply offset by increased export demand and the continuing impact of the COVID-19 pandemic. In addition, growing conditions in a particular seasons harvest may cause the corn crop to be of poor quality resulting in corn shortages and a decrease in distillers grains prices. Declines in the prices we receive for our ethanol and distillers grains will lead to decreased revenues and may result in our inability to operate the ethanol plant profitably for an extended period of time.\nWe compete with larger, better financed entities, which could negatively impact our ability to operate profitably.\nThere is significant competition among ethanol producers with numerous producers and privately-owned ethanol plants planned and operating throughout the Midwest and elsewhere in the United States. Our business faces a competitive challenge from larger plants, from plants that can produce a wider range of products than we can, and from other plants similar to ours. Large ethanol producers such as Archer Daniels Midland, Green Plains Inc., Valero Renewable Fuels and POET Biorefining, among others, are capable of producing a significantly greater amount of ethanol than we produce. Further, many believe that there will be further consolidation occurring in the ethanol industry in the near future which will likely lead to a few companies who control a significant portion of the ethanol production market. We may not be able to compete with these larger entities. These larger ethanol producers may be able to affect the ethanol market in ways that are not beneficial to us which could affect our financial performance.\nIncreased ethanol industry penetration by oil companies may adversely impact our margins.\nThe ethanol industry is a highly competitive environment and it is principally comprised of smaller entities that engage exclusively in ethanol production and large integrated grain companies that produce ethanol along with their base grain businesses. We have historically always faced competition with other small independent producers as well as larger, better financed producers for capital, labor, corn and other resources. Until recently, oil companies, petrochemical refiners and gasoline retailers have not been engaged in ethanol production to a large extent. These companies, however, form the primary distribution networks for marketing ethanol through blended gasoline. During the past few years, several large oil companies have begun to penetrate the ethanol production market. If these companies increase their ethanol plant ownership or other oil companies seek to engage in direct ethanol production, there may be a decrease in the demand for ethanol from smaller independent ethanol producers like us which could result in an adverse effect on our operations, cash flows and financial condition.\nChanges and advances in ethanol production technology could require us to incur costs to update our Facility or could otherwise hinder our ability to compete in the ethanol industry or operate profitably.\nAdvances and changes in the technology of ethanol production are expected to occur. Such advances and changes may make the ethanol production technology installed in our plant less desirable or obsolete. These advances could also allow our competitors to produce ethanol at a lower cost than us. If we are unable to adopt or incorporate technological advances, our ethanol production methods and processes could be less efficient than our competitors, which could cause our plant to become uncompetitive or completely obsolete. If our competitors develop, obtain or license technology that is superior to ours or that makes our technology obsolete, we may be required to incur significant costs to enhance or acquire new technology so that our ethanol production remains competitive. Alternatively, we may be required to seek third-party licenses, which could also result in significant expenditures. We cannot guarantee or assure that third-party licenses will be available or, once obtained, will continue to be available on commercially reasonable terms, if at all. These costs could negatively impact our financial performance by increasing our operating costs and reducing our net income.\nCompetition from the advancement of alternative fuels may decrease the demand for ethanol and negatively impact our profitability.\nAlternative fuels, gasoline oxygenates and ethanol production methods are continually under development. A number of automotive, industrial and power generation manufacturers are developing alternative clean power systems using fuel cells or clean burning gaseous fuels. Like ethanol, the emerging fuel cell and electric-powered vehicle industries offer a technological options to address increasing worldwide energy costs, the long-term availability of petroleum reserves and environmental concerns. Fuel cells have emerged as a potential alternative to certain existing power sources because of their higher efficiency, reduced noise and lower emissions. Fuel cell industry participants are currently targeting the transportation, stationary power and portable power markets in order to lower fuel costs, decrease dependence on crude oil and reduce harmful emissions. The same can largely be said of electric-powered vehicles. If the fuel cell and hydrogen industries continue to expand and gain broad acceptance, and hydrogen becomes readily available to consumers for motor vehicle use, we may not be able to compete effectively. Likewise, participants in the emerging electric-powered vehicle industry are currently targeting the transportation market to decrease dependence on crude oil and reduce harmful emissions. If the electric-powered vehicle industry continues to expand and gain broad acceptance, the ethanol and larger gasoline industry may not be able to compete effectively. This additional competition could reduce the demand for ethanol, which would negatively impact our profitability.\nThe broad commercialization and acceptance of Electric Vehicles (EV) and other Alternative Fuel Source Vehicles may have a negative impact on gasoline and biofuels, including ethanol, which could negatively impact our profitability.\nA number of automotive, industrial and power generation manufacturers are developing alternative clean power systems using fuel cells, plug-in hybrids, electric cars or clean burning gaseous fuels. Like ethanol, the emerging fuel cell and electric-powered vehicle industries offer technological options to address worldwide energy costs, the long-term availability of petroleum reserves and environmental concerns. Fuel cells have emerged as a potential alternative to certain existing power sources because of their higher efficiency, reduced noise and lower emissions. Fuel cell industry participants are currently targeting the transportation, stationary power and portable power markets in order to decrease fuel costs, lessen dependence on crude oil and reduce harmful emissions. The same can be said of electric-powered vehicles. If the fuel cell industry continues to expand and gain broad acceptance and becomes readily available to consumers for motor vehicle use, we may not be able to compete effectively. Likewise, participants in the emerging electric-powered vehicle industry are currently targeting the transportation market to decrease dependence on crude oil and reduce harmful emissions. If the electric-powered vehicle industry continues to expand and gain broad acceptance, the ethanol and larger gasoline industry may not be able to compete effectively. This additional competition could reduce the demand for ethanol, which would negatively impact our profitability\nThe inability to become a carbon-neutral or carbon-negative fuel source could affect our future ability to compete in the market, which could negatively impact our profitability.\nRFA members have pledged to achieve a net-zero carbon footprint by 2050 or sooner. To stay competitive with electric vehicles and other Alternative Fuel Source Vehicles in an economy which continues to highly-value carbon neutral or zero-carbon alternatives, it is likely going to be imperative that the ethanol industry and the Company become producers of carbon neutral or carbon-negative fuel sources in the future. In order for the Company to achieve this reduction in carbon impact, the Company anticipates that a solution for carbon capture must be identified and implemented with respect to the Companys plant. There are various solutions to this issue and the Company must determine which path forward is the most effective while also being a fiscally sound decision. If the Company is unable to maintain its competitive edge in the marketplace, or if the Company were to select an improper technology in its attempts to reduce its carbon impact, it could have a negative effect on the Companys results of operations and profitability.\nCorn-based ethanol may compete with cellulose-based ethanol in the future, which could make it more difficult for us to produce ethanol on a cost-effective basis.\nMost ethanol produced in the U.S. is currently produced from corn and other raw grains, such as milo or sorghum - especially in the Midwest. The current trend in ethanol production research is to develop an efficient method of producing ethanol from cellulose-based biomass, such as agricultural waste, forest residue, municipal solid waste and energy crops. This trend is driven by the fact that cellulose-based biomass is generally cheaper than corn, and producing ethanol from cellulose-based biomass would create opportunities to produce ethanol in areas which are unable to grow corn. The Energy Independence and Security Act of 2007 and the 2008 Farm Bill offer a very strong incentive to develop commercial scale cellulosic ethanol. The statutory volume requirement in the RFS requires that 16 billion gallons per year of advanced bio-fuels be consumed in the United States by 2022. The EPA will be required to set RFS volumes for 2023 and beyond, according to certain criteria defined in the statute. Additionally, state and federal grants have been awarded to several companies who are seeking to develop commercial-scale cellulosic ethanol plants. As a result, at least three companies have reportedly already begun producing on a commercial scale and a handful of other companies have begun construction on commercial scale cellulosic ethanol plants some of which may be completed in the near future. If an efficient method of producing ethanol from cellulose-based biomass is developed, we may not be able to compete effectively. It may not be practical or cost-effective to convert our Facility into a plant which will use cellulose-based biomass to produce ethanol. If we are unable to produce ethanol as cost-effectively as cellulose-based producers, our ability to generate revenue will be negatively impacted.\nDepending on commodity prices, foreign producers may produce ethanol at a lower cost than we can, which may result in lower ethanol prices which would adversely affect our financial results.\nWe face competition from foreign ethanol producers with Brazil currently the second largest ethanol producer in the world. Brazils ethanol production is sugarcane based, as opposed to corn based, and, depending on feedstock prices, may be less expensive to produce. Under the RFS, certain parties are obligated to meet an advanced biofuel standard and sugarcane ethanol imported from Brazil has historically been one of the most economical means for obligated parties to meet this standard. Other foreign producers may be able to produce ethanol at lower input costs, including costs of feedstock, facilities and personnel, than we can. While foreign demand, transportation costs and infrastructure constraints may temper the market impact throughout the United States, competition from imported ethanol may affect our ability to sell our ethanol profitably, which may have an adverse effect on our operations, cash flows and financial position. If significant additional foreign ethanol production capacity is created, such facilities could create excess supplies of ethanol on world markets, which may result in lower prices of ethanol throughout the world, including the United States. Such foreign competition is a risk to our business. Any penetration of ethanol imports into the domestic market may have a material adverse effect on our operations, cash flows and financial position.\nRisks Associated With Government Regulation and Subsidization\nThe ethanol industry is highly dependent on government mandates relating to the production and use of ethanol and changes to such mandates and related regulations could adversely affect the market for ethanol and our results of operations.\nThe domestic market for ethanol is largely dictated by federal mandates for blending ethanol with gasoline. Future demand for ethanol will be largely dependent upon the economic incentives to blend based upon the relative value of gasoline versus ethanol, taking into consideration the relative octane value of ethanol, environmental requirements and the RFS mandate. The RFS mandate helps support a market for ethanol that might disappear without this incentive.\nThe compliance mechanism for RFS is the generation of renewable identification numbers, or RINs, which are generated and attached to renewable fuels such as the ethanol we produce and detached when the renewable fuel is blended into the transportation fuel supply. Detached RINs may be retired by obligated parties to demonstrate compliance with RFS or may be separately traded in the market. The market price of detached RINs may affect the price of ethanol in certain U.S. markets as obligated parties may factor these costs into their purchasing decisions. Moreover, at certain price levels for various types of RINs, it becomes more economical to import foreign sugarcane ethanol. If changes to RFS2 result in significant changes in the price of various types of RINs, it could negatively affect the price of ethanol, and our operations could be adversely impacted.\nFederal law mandates the use of oxygenated gasoline in the winter in areas that do not meet Clean Air Act standards for carbon monoxide. If these mandates are repealed, the market for domestic ethanol could be significantly reduced. Additionally, flexible-fuel vehicles receive preferential treatment in meeting corporate average fuel economy, or CAFE, standards. However, high blend ethanol fuels such as E85 result in lower fuel efficiencies. Absent the CAFE preferences, it may be unlikely that auto manufacturers would build flexible-fuel vehicles. Any change in these CAFE preferences could reduce the growth of E85 markets and result in lower ethanol prices, which could adversely impact our operating results.\nTo the extent that such federal or state laws or regulations are modified, the demand for ethanol may be reduced, which could negatively and materially affect our ability to operate profitably.\nWe are subject to extensive environmental regulation and operational safety regulations that impact our expenses and could reduce our profitability.\nEthanol production involves the emission of various airborne pollutants, including particulate matters, carbon monoxide, oxides of nitrogen, volatile organic compounds and sulfur dioxide. We are subject to regulations on emissions from the EPA and the IDNR (Iowa Department of Natural Resources). The EPAs and IDNRs environmental regulations are subject to change and often such changes are not favorable to industry. Consequently, even if we have the proper permits now, we may be required to invest or spend considerable resources to comply with future environmental regulations.\nOur failure to comply or the need to respond to threatened actions involving environmental laws and regulations may adversely affect our business, operating results or financial condition. We must follow procedures for the proper handling, storage, and transportation of finished products and materials used in the production process and for the disposal of waste products. In addition, state or local requirements also restrict our production and distribution operations. We could incur significant costs to comply with applicable laws and regulations. Changes to current environmental rules for the protection of the environment may require us to incur additional expenditures for equipment or processes.\nWe could be subject to environmental nuisance or related claims by employees, property owners or residents near the Facility arising from air or water discharges. Ethanol production has been known to produce an odor to which surrounding residents could object. We believe our plant design mitigates most odor objections. However, if odors become a problem, we may be subject to fines and could be forced to take costly curative measures. Environmental litigation or increased environmental compliance costs could significantly increase our operating costs.\nWe are subject to federal and state laws regarding operational safety. Risks of substantial compliance costs and liabilities are inherent in ethanol production. Costs and liabilities related to worker safety may be incurred. Possible future developments-including stricter safety laws for workers or others, regulations and enforcement policies and claims for personal or property damages resulting from our operation could result in substantial costs and liabilities that could reduce the amount of cash that we would otherwise have to distribute to members or use to further enhance our business.\nCarbon dioxide may be regulated by the EPA in the future as an air pollutant, requiring us to obtain additional permits and install additional environmental mitigation equipment, which may adversely affect our financial performance.\nOur Facility emits carbon dioxide as a by-product of the ethanol production process and we sell a portion of our carbon dioxide by-product to Air Products and Chemicals, Inc. pursuant to a Carbon Dioxide Purchase and Sale Agreement. The United States Supreme Court has classified carbon dioxide as an air pollutant under the Clean Air Act in a case seeking to require the EPA to regulate carbon dioxide in vehicle emissions. Similar lawsuits have been filed seeking to require the EPA to regulate carbon dioxide emissions from stationary sources such as our ethanol plant under the Clean Air Act. While there are currently no regulations applicable to us concerning carbon dioxide, if Iowa or the federal government, or any appropriate agency, decides to regulate carbon dioxide emissions by plants such as ours, we may have to apply for additional permits or we may be required to install carbon dioxide mitigation equipment or take other steps unknown to us at this time in order to comply with such law or regulation. Compliance with future regulation of carbon dioxide, if it occurs, could be costly and may prevent us from operating the Facility profitably.\nThe California Low Carbon Fuel Standard may limit access to the California market which could negatively impact our profitability.\nCalifornia passed the Low Carbon Fuels Standard (\"LCFS\") which requires that renewable fuels used in California must accomplish certain reductions in greenhouse gases which reductions are measured using a lifecycle analysis. Fuels entering California must meet the LCFS carbon-intensity lifecycle requirements before being sold and consumed in California. These LCFS regulations could preclude corn-based ethanol produced in the Midwest from being used in California. California represents a significant ethanol demand market and if we are unable to meet the requirements of the LCFS, we will be unable to sell our products into the California market which could result in a reduction of our revenues and negatively impact our ability to profitably operate the ethanol plant.\nOther states and countries, including Oregon, Brazil and Canada have adopted similar LCFS regulations which could further negatively impact the market and demand for conventional corn based ethanol, depending on how the regulations are crafted, enforced and modified which could further adversely impact our operating performance if we are unable to access such markets.\nInvestor sentiment towards climate change, fossil fuels, and other environmental, social, and corporate governance (ESG) matters could adversely affect our business, cost of capital, and the price of our stock and other securities.\nThe issue of global climate change continues to attract considerable public and scientific attention with widespread concern about the impacts of human activity, especially the emissions of greenhouse gases such as carbon dioxide and methane. With the current administration, climate change legislation in the U.S. is likely to receive increased focus and consideration over the next several years. Based on the issuance of new SEC requirements along with numerous other regulatory and legislative proposals having been made, the focus on global climate change is likely to continue at the international, national, regional and state levels of government that are intended to limit emissions of greenhouse gases and capture carbon. Several states have already adopted measures requiring reduction of greenhouse gases within state boundaries. Other states have elected to participate in voluntary regional cap-and-trade programs. While we believe our products are low carbon and result in a reduction of greenhouse gas emissions compared to alternatives, any significant legislative changes at the international, national, state or local levels could significantly affect our ability to produce and sell our products, could increase the cost of the production and sale of our products and could materially reduce the value of our products.\nApart from governmental regulation, some investment banks and traditional banking institutions based both domestically and internationally have announced that they have adopted environmental, social and corporate governance guidelines (ESG). Members of the investment community are also increasing their focus on ESG practices and disclosures, including practices and disclosures related to GHG emissions and climate change in the energy industry in particular, and diversity and inclusion initiatives and governance standards among companies more generally. As a result, we may face increasing pressure regarding our ESG practices and disclosures. Additionally, members of the investment community may screen companies such as ours for ESG performance. If we are unable to meet the ESG standards or investment or lending criteria set by these institutions, our access to the capital and financial markets, the price and demand for our securities and our reputation may be adversely impacted.  Item 2. Properties.\nWe own the Facility site located near Council Bluffs, Iowa, which consists of three parcels totaling nearly 275 acres. This property is encumbered under the mortgage agreement with our Lender. We lease 45 acres on the south end of the property to an unrelated third party for farming, and we custom farm for our own use on ten acres. Item 3. Legal Proceedings.\nFrom time to time, the Company may be subject to legal proceedings, claims, and litigation arising in the ordinary course of business. While the outcome of these matters, if any, are currently not determinable, we do not expect that the ultimate costs to resolve these matters, if any, would have a material adverse effect on the Company consolidated financial position, results of operations, or cash flows. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Member Matters, and Issuer Purchases of Equity Securities.\nAs of September 30, 2022, we had 8,975 Series A Units issued and outstanding held by 818 persons. We do not have any established trading market for our units, nor is one contemplated. However, we do provide access to a Qualified Matching Service for our members, which provides a system for limited transfers of our units.\nTo date, we have made distributions totaling $40.1 million to our members, with $11.2 million in distributions made during Fiscal 2022 and no distributions made in Fiscal 2021. We cannot be certain if or when we will be able to make additional distributions. Further, our ability to make distributions is restricted under the terms of the Credit Agreement. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operation.\nGeneral Overview and Recent Developments\nThe following discussion and analysis provides information which management believes is relevant to an assessment and understanding of our financial condition, results of operations, and material cash requirements. This discussion should be read in conjunction with the financial statements included herewith and notes to the financial statements thereto and the risk factors contained herein.\nThe Company is an Iowa limited liability company located in Council Bluffs, Iowa, formed in March, 2005. The Company was permitted to produce 140 million gallons of ethanol. We began producing ethanol in February, 2009 and sell our ethanol, distillers grains, and corn oil in the United States, Mexico and the Pacific Rim.\nOn November 26, 2019, the EPA approved the Company's petition as an \"Efficient Producer\" to increase the D-6 RINs generated for up to 147 million gallons of ethanol produced annually, provided the non-grandfathered ethanol produced satisfies the 20% lifecycle GHG (\"Greenhouse gas\" impacts) reduction requirements specified in the Clean Air Act for renewable fuel. The Company must comply with all registration provisions in order to register for the production of non-grandfathered ethanol, and the registration application must be accepted by the EPA before the facility is eligible to generate RIN's for non-grandfathered ethanol produced. The Company completed the registration process during Fiscal 2022.\nOn December 6, 2022, our Board of Directors declared a distribution of $2,500 per unit to its members. The distributions are expected to be paid on or around December 23, 2022 to members of record on December 6, 2022. Based on the current number of units outstanding, the aggregate payment will be approximately $22.4 million.\nIndustry Factors Affecting our Results of Operations\nFor the fiscal year ended September 30, 2022 (\"Fiscal 2022\") compared to the fiscal year ended September 30, 2021 (\"Fiscal 2021\"), the average price per gallon of ethanol sold increased by 36.9% due to reduced stocks, increasing demand and higher corn and energy prices. There have also been increased prices for crude oil and gasoline in Fiscal 2022 compared to Fiscal 2021 due to reduced supply world-wide, and an increase in driving compared to Fiscal 2021 when there were lockdown orders and restrictions on travel imposed by many authorities.\nCorn prices increased 17.6% during Fiscal 2022 compared to Fiscal 2021 due to the anticipated high demand for corn in China and portions of the United States experiencing severe droughts. Weather, world supply and demand, current and anticipated stocks, agricultural policy and other factors can contribute to volatility in corn prices, and such changes have a material effect on our cost of goods sold with corn being one of our primary inputs.\nManagement anticipates that ethanol prices will continue to change in relation to changes in corn and energy prices. If corn, crude oil and gasoline prices remain high or further increase, that could have a significant impact on the market price of ethanol and our net income, particularly should ethanol stocks remain low.\nDuring Fiscal 2022, the Company faced significant challenges with respect to inflation of both tangible goods, primarily experienced in the cost of chemicals needed for the ethanol production process, and payroll costs due to labor shortages and a general increase in wages due to inflation.\nThe average market price per ton of distillers grains sold in Fiscal 2022, increased by 25.6% compared to the average price per ton of distillers grains sold in Fiscal 2021. This increase in the market price of distillers grains is primarily due to higher corn and soybean meal prices. Management anticipates that distillers grains prices will continue to be affected by the price of corn and soybean meal. If there continues to be an oversupply of soybean meal, that could have a negative effect on the price of distillers grains. An increase in supply as certain ethanol plants return to higher production levels as operating conditions improve could also have a negative effect on distillers grains prices.\nResults of Operations\nThe following table shows our results of operations, stated as a percentage of revenue for Fiscal 2022 and Fiscal 2021.\nFiscal 2022\nFiscal 2021\nAmounts in 000's\n% of Revenues\nAmounts in 000's\n% of Revenues\nIncome Statement Data\nRevenues\n$ 387,125\n100.0 %\n$ 302,820\n100.0 %\nCost of Goods Sold\nMaterial Costs\n274,870\n71.0 %\n245,478\n81.1 %\nVariable Production Expense\n33,686\n8.7 %\n28,145\n9.3 %\nFixed Production Expense\n17,802\n4.6 %\n13,872\n4.6 %\nGross Margin (Loss)\n60,767\n15.7 %\n15,325\n5.1 %\nGeneral and Administrative Expenses\n7,241\n1.9 %\n5,733\n1.9 %\nOther Income (Expenses), net\n4,236\n1.1 %\n1,008\n0.3 %\nNet Income (Loss)\n$ 57,762\n14.9 %\n$ 8,584\n2.8 %\nRevenues\nOur revenue from operations is derived from three primary sources: sales of ethanol, distillers grains, and distillers corn oil. The chart below displays statistical information regarding our revenues. The increase in revenue from Fiscal 2022 compared to Fiscal 2021 is primarily attributable to increased price for ethanol due to increased demand but a reduced supply. For our main product ethanol, there was a 36.9% increase in the average price per gallon of ethanol in Fiscal 2022 as compared to Fiscal 2021 driven by the tight supply of ethanol coupled with rising demand post-pandemic, and a 2.46% decrease in the volume of ethanol sold during Fiscal 2022 compared to Fiscal 2021. There was also a decrease of 2% in the volume of distillers grains sold and an increase in the average price per ton of distillers grains of approximately 25.6% primarily attributable to the prevailing prices of distillers grains compared to competing feed products. Distillers corn oil revenue also increased 66% in Fiscal 2022 compared to Fiscal 2021 due to an increase of 10.7% in tons sold in Fiscal 2022 as compared to Fiscal 2021, along with an increase of 51.6% in the price of distillers corn oil due to biodiesel processors utilizing higher quantities of distillers corn oil, thereby substantially increasing demand.\nIn Fiscal 2022, we witnessed a greater recovery in ethanol prices, distillers grains prices and distillers corn oil prices driven by strong demand for each product coupled with lower supply attributable to industry slowdowns in 2020 and early 2021. Ethanol prices are typically directionally consistent with changes in corn and energy prices, and in Fiscal 2022, we did see the price of ethanol increase 36.9% over the course of the year with an increase in the cost of corn of 17.6%.\nThe 25.6% increase in the average price of distillers grains was tempered with a 2% decrease in tonnage sold resulting in a 14.9% increase in this revenue category.\nDuring Fiscal 2022, corn oil prices increased 51.6% and pounds sold increased 10.7% compared to Fiscal 2021, due to biodiesel processors utilizing higher quantities of corn oil. Although management believes that corn oil prices will remain relatively steady at the current price levels, prices may decrease if there is an oversupply of corn oil production resulting from increased production rates or if biodiesel producers begin to utilize lower-priced alternatives such as soybean oil.\nOn December 18, 2019, Congress extended the biodiesel tax credit through 2022 with retroactive application to January 1, 2018. The extension of the tax credit has increased demand for distillers corn oil, which is a feedstock for renewable diesel, and could continue to have a positive impact on distillers corn oil prices for the remainder of Fiscal 2022. The Inflation Reduction Act of 2022 (the \"IRA\") provided for the further extension of the biodiesel tax credit until December 31, 2024 which could result in continued positive impact on the value of our distillers corn oil.\nFiscal 2022\nFiscal 2021\nAmounts in 000's\n% of Revenues\nAmounts in 000's\n% of Revenues\nProduct Revenue Information\nEthanol\n$ 289,812\n74.9 %\n$ 227,036\n75.0 %\nDistiller's Grains\n63,840\n16.5 %\n55,561\n18.3 %\nCorn Oil\n31,532\n8.1 %\n18,996\n6.3 %\nOther\n1,941\n0.5 %\n1,227\n0.4 %\nCost of Goods Sold\nOur cost of goods sold as a percentage of our revenues was 85% and 95% for Fiscal 2022 and 2021, respectively, and decreased due to the increase in prices for ethanol, distillers corn oil and distillers grains. Our two primary costs of producing ethanol and distillers grains are corn and energy, with natural gas and electricity as our primary energy sources. Cost of goods sold also includes net (gains) or losses from derivatives and hedging relating to corn. Material costs increased as a result of the average price of corn used in ethanol production per bushel increasing by 17.6% in Fiscal 2022 from Fiscal 2021 on a 5% decrease in ethanol production in Fiscal 2022 compared to Fiscal 2021.\nRealized and unrealized (gains) or losses related to our derivatives and hedging related to corn resulted in a decrease of $16.6 million in our cost of goods sold for Fiscal 2022, compared to a decrease of $4.4 million in our cost of goods sold for Fiscal 2021. We recognize the gains or losses that result from the changes in the value of our derivative instruments related to corn in cost of goods sold as the changes occur. As corn prices fluctuate, the value of our derivative instruments are impacted, which affects our financial performance. We anticipate continued volatility in our cost of goods sold due to the timing of the changes in value of the derivative instruments relative to the cost and use of the commodity being hedged.\nOur average natural gas energy cost increased 19.5% per MMBTU comparing Fiscal 2022 to Fiscal 2021 due to the increased cost of natural gas during Fiscal 2022. Natural gas on the spot market increased 69% when comparing Fiscal 2022 to Fiscal 2021. We were able to mitigate the full impact of the rise in the natural gas spot market through locking in MMBTU's during the fiscal year. Variable production expenses increased when comparing Fiscal 2022 to Fiscal 2021 due to higher energy costs and higher chemical costs. Fixed production expenses also increased when comparing Fiscal 2022 to Fiscal 2021 due to higher maintenance costs and increased lease costs.\nGeneral & Administrative Expense\nOur general and administrative expenses as a percentage of revenues were 1.8% for Fiscal 2022 and 1.9% for Fiscal 2021. General and administrative expenses include salaries and benefits of administrative employees, professional fees and other general administrative costs. Our general and administrative expenses for Fiscal 2022 increased 26.3% compared to Fiscal 2021. The increase in general and administrative expenses from Fiscal 2021 to Fiscal 2022 is due mainly to higher legal and professional fees and dues and subscription costs which include annual software licensing fees.\nOther Income (Expense)\nOur other income (expense) was approximately $4.2 million for Fiscal 2022 and ($1) million for Fiscal 2021, and were approximately 1.1% and (0.3%) of our revenues for Fiscal 2022 and Fiscal 2021, respectively. The increase in other income (expense) during Fiscal 2022 was due to the USDA COVID relief payment we received in May for $3.1 million. The remainder is due to patronage dividends we receive from our lending partners and the forgiveness of the PPP loans.\nKey Operating Measures\nFiscal 2022\nFiscal 2021\nProduction (denatured gallons)\n121.9\n129.8\nEthanol Yield (den gal/bu)\n2.915\n2.931\nEthanol Price (per gal)\n2.41\n1.76\nCorn Price (per bu)\n6.43\n5.47\nCorn Oil Yield (lbs/bu)\n1.093\n0.942\nBTU's / gallon\n21,395\n22,154\nSteam / Nat Gas Cost per MMBTU\n3.947\n3.302\nkWh/gallon\n0.695\n0.642\nChemical Cost ($/gal)\n0.127\n0.095\nOur production decreased 6% when comparing Fiscal 2021 to Fiscal 2022 due to extended maintenance shutdowns to make various repairs. The average ethanol price per gallon increased 36.9% year over year due to the increased demand and constraints on supply and transportation. The price of corn increased 17.6% on average due to input costs, drought conditions and transportation constraints. While the overall cost of natural gas went up 19.5%, the Company was able to reduce its BTU's per gallon by 3.4% due to energy efficiency improvements throughout the plant. The cost of chemicals increased 33.7% year over year due to reduced supply, higher natural gas prices (impacting nitrogen based chemicals) and labor shortages.\nPaycheck Protection Program Loan\nOn April 14, 2020, the Company received $1.1 million under the new Paycheck Protection Program legislation passed in response to the economic downturn triggered by COVID-19 and on January 28, 2021, the Company received an additional $1.1 million under Phase II of the PPP legislation (collectively the \"PPP Loans\"). Our PPP Loans may be forgiven based upon various factors, including, without limitation, our payroll cost over an eight-to-twenty-four week period starting upon our receipt of the funds. Expenses for approved payroll costs, lease payments on agreements before February 15, 2020, and utility payments under agreements before February 1, 2020 and certain other specified costs can be paid with these funds and eligible for payment forgiveness by the federal government. At least 60% of the proceeds must be used for approved payroll costs, and no more than 40% on non-payroll expenses. PPP loan proceeds used by a borrower for the approved expense categories have generally been fully forgiven by the lender if the borrower satisfies certain employee headcount and compensation requirements. The Company applied for forgiveness on its PPP Loans from the Small Business Administration (\"SBA\") and was notified on December 24, 2021 that the PPP Loans had been forgiven in full. The gain on the debt extinguishment was recorded in other income.\nLiquidity and Capital Resources\nAs of September 30, 2022, we had a cash balance of $7.2 million, $39.6 million available under the Revolving Term Loan (defined below) and working capital (per the definition stated within the \"Restated Credit Agreement\") of $71.7 million.\nThe Company has certain loan agreements with Farm Credit Services of America, FLCA, (\"FLCA\"), Farm Credit Services of America, PCA (\"PCA\") and CoBank, ACB, (\"CoBank\") (collectively, the \"FCSA Credit Facility\"), which provide the Company with a term loan in the amount of $30 million (the \"Term Loan\") which matures November 15, 2024, a revolving term loan in the amount of $18.75 million (the \"Term Loan\") which matures September 1, 2027 and a $40 million revolving line of credit (the \"Revolving Credit Loan\") which matures February 1, 2023. The FCSA Credit Facility is secured by a security interest on all of the Company's assets and requires the Company to comply with specified financial covenants related to minimum current working capital, a minimum debt service coverage ratio and limitation on unit holder distributions.\nAs of September 30, 2022, there was $15 million outstanding under the Term Loan, $442 thousand outstanding under the Revolving Term Loan with $39.6 million available under the Revolving Credit Loan.\nThe Term Loan provides for semi-annual payments by the Company to FCSA of $3.75 million, on March 1 and September 1, beginning September 1, 2020. The Term Loan was amended in February 2021 to only require a single principal payment of $3.75 during 2021. All remaining amounts due under the Term Note are due and payable on the maturity date of November 15, 2024.\nEffective July 18, 2022, the Company, FLCA, PCA and CoBank entered into the First Amendment and Restated Credit Agreement (the \"Restated Credit Agreement\") which amended and restated the Company's Credit Agreement dated as of June 24, 2014, as amended by Amendment No. 1 dated as of February 11, 2015, Amendment No. 2 dated as of February 11, 2015, Amendment No. 3 dated as of January 25, 2016, Amendment No. 4 dated as of November 14, 2019, Amendment No. 5 dated as of February 26, 2021, Amendment No. 6 dated as of July 30, 2021, Amendment No. 7 dated as of October 29, 2021 and Amendment No 8. dated February 25, 2022 (collectively the \"Original Credit Agreement\").\nThe Restated Credit Agreement amended and restated the Original Credit Agreement to incorporate all of the prior amendments to the Original Credit Agreement into the Restated Credit Agreement. The Restated Credit Agreement and continues to be secured by substantially all of the Company's assets. The Restated Credit agreement also:\nReplaced the Second Amended and Restated Term Note dated February 26, 2021 in its entirety with the Third Amended and Restated Term Note dated July 18, 2022 (the \"Third Restated Term Note\") and provided for a maximum principal amount of $18,750,000 and for all borrowings thereunder to bear interest at a Daily Simple SOFR Rate plus a spread equal to 3.25% per annum. The maturity date of the Third Restated Term Note remains November 15, 2024.\nReplaced the First Amended and Restated Revolving Term Note dated November 8, 2019 in its entirety with the Second Amended and Restated Revolving Term Note dated July 18, 2022 (the Second Restated Revolving Term Note). The Second Restated Revolving Term Note continues to provide for a maximum principal amount of $40 million but was amended to provide for all borrowings thereunder to bear interest at a rate of Daily Simple SOFR plus a spread of 3.25% per annum.\nReplaced the Third Amended and Restated Revolving Credit Note dated February 25, 2022 in its entirety with the Fourth Amended and Restated Revolving Term Note dated July 18, 2022 (the \"Fourth Restated Revolving Credit Note\"). The Fourth Restated Revolving Credit Note continues to provide for a maximum principal amount of $10 million and all borrowings thereunder bear an interest rate equal to the Daily Simple SOFR rate plus a spread of 3.10%. The maturity date of the Fourth Restated Revolving Credit Note remains February 1, 2023.\nEffective September 21, 2022, the Company entered into Amendment No. 1 to the Restated Credit Agreement. The amendment amended and restated the Company's Second Restated Revolving Term Note in its entirety replacing it with the Third Amended and Restated Revolving Term Note dated September 21, 2022 (the Third Restated Revolving Term Note). The Third Restated Revolving Term Note extended the maturity date to September 1, 2027 and also:\namended the definition of Permitted Indebtedness to increase the aggregate principal amount of indebtedness the Company may incur to $5 million (less the current balance of any Existing Indebtedness).\namended the negative covenant related to the payment of dividends or other distributions to include the purchase, redemption, retirement or acquisition of the Company's units.\nincreased the amount of payments the Company can make under its Operating Leases to $1 million.\nPrimary Working Capital Needs\nCash provided by operations for Fiscal 2022 and Fiscal 2021 was $64.8 million and $6.4 million, respectively. This change is primarily due to the increased price received for ethanol and co-products. For Fiscal 2022 and Fiscal 2021, net cash (used in) investing activities was $(4.8) million and $(8.2) million, respectively, primarily for fixed asset additions. For Fiscal 2022 and Fiscal 2021, net cash flows provided by (used in) financing activities was $(54.7) million and $2.7 million, respectively due to significant debt paydowns made possible as a result of the increased sale price of ethanol and co-products.\nWe believe that our existing sources of liquidity, including cash on hand, available revolving credit and cash provided by operating activities, will satisfy our projected liquidity requirements, which primarily consists of working capital requirements, for the next twelve months. However, in the event that the market experiences significant price volatility and negative crush margins at or in excess of the levels experienced in previous years, we may be required to explore alternative methods to meet our short-term liquidity needs including temporary shutdowns of operations, temporary reductions in our production levels, or negotiating short-term concessions from our lenders.\nCommodity Price Risk\nOur operations are highly dependent on commodity prices, especially prices for corn, ethanol and distillers grains and the spread between them ( the \"crush margin\"). As a result of price volatility for these commodities, our operating results may fluctuate substantially. The price and availability of corn are subject to significant fluctuations depending upon a number of factors that affect commodity prices in general, including crop conditions, weather, governmental programs and foreign purchases. We may experience increasing costs for corn and natural gas and decreasing prices for ethanol and distillers grains which could significantly impact our operating results. Because the market price of ethanol is not directly related to corn prices, ethanol producers are generally not able to compensate for increases in the cost of corn through adjustments in prices for ethanol. We continue to monitor corn and ethanol prices and manage the \"crush margin\" to affect our longer-term profitability.\nWe enter into various derivative contracts with the primary objective of managing our exposure to adverse price movements in the commodities used for, and produced in, our business operations and, to the extent we have working capital available and available market conditions are appropriate, we engage in hedging transactions which involve risks that could harm our business. We measure and review our net commodity positions on a daily basis. Our daily net agricultural commodity position consists of inventory, forward purchase and sale contracts, over-the-counter and exchange traded derivative instruments. The effectiveness of our hedging strategies is dependent upon the cost of commodities and our ability to sell sufficient products to use all of the commodities for which we have futures contracts. Although we actively manage our risk and adjust hedging strategies as appropriate, there is no assurance that our hedging activities will successfully reduce the risk caused by market volatility which may leave us vulnerable to high commodity prices. Alternatively, we may choose not to engage in hedging transactions in the future. As a result, our future results of operations and financial conditions may also be adversely affected during periods in which price changes in corn, ethanol and distillers grain to not work in our favor.\nIn addition, as described above, hedging transactions expose us to the risk of counterparty non-performance where the counterparty to the hedging contract defaults on its contract or, in the case of over-the-counter or exchange-traded contracts, where there is a change in the expected differential between the price of the commodity underlying the hedging agreement and the actual prices paid or received by us for the physical commodity bought or sold. We have, from time to time, experienced instances of counterparty non-performance but losses incurred in these situations were not significant.\nAlthough we believe our hedge positions accomplish an economic hedge against our future purchases and sales, management has chosen not to use hedge accounting, which would match any gain or loss on our hedge positions to the specific commodity purchase being hedged. We are using fair value accounting for our hedge positions, which means as the current market price of our hedge positions changes, the realized or unrealized gains and losses are immediately recognized in the current period (commonly referred to as the mark to market method). The immediate recognition of hedging gains and losses under fair value accounting can cause net income to be volatile from quarter to quarter due to the timing of the change in value of the derivative instruments relative to the cost and use of the commodity being hedged. As corn prices move in reaction to market trends and information, our income statement will be affected depending on the impact such market movements have on the value of our derivative instruments. Depending on market movements, crop prospects and weather, our hedging strategies may cause immediate adverse effects, but are expected to produce long-term positive impact.\nIn the event we do not have sufficient working capital to enter into hedging strategies to manage our commodities price risk, we may be forced to purchase our corn and market our ethanol at spot prices and as a result, we could be further exposed to market volatility and risk. However, during the past year, the spot market has been advantageous.\nCredit and Counterparty Risks\nThrough our normal business activities, we are subject to significant credit and counterparty risks that arise through normal commercial sales and purchases, including forward commitments to buy and sell, and through various other over-the-counter (OTC) derivative instruments that we utilize to manage risks inherent in our business activities. We define credit and counterparty risk as a potential financial loss due to the failure of a counterparty to honor its obligations. The exposure is measured based upon several factors, including unpaid accounts receivable from counterparties and unrealized gains (losses) from OTC derivative instruments (including forward purchase and sale contracts). We actively monitor credit and counterparty risk through credit analysis (by our marketing agent).\nImpact of Hedging Transactions on Liquidity\nOur operations and cash flows are highly impacted by commodity prices, including prices for corn, ethanol, distillers grains and natural gas. We attempt to reduce the market risk associated with fluctuations in commodity prices through the use of derivative instruments, including forward corn contracts and over-the-counter exchange-traded futures and option contracts. Our liquidity position may be positively or negatively affected by changes in the underlying value of our derivative instruments. When the value of our open derivative positions decrease, we may be required to post margin deposits with our brokers to cover a portion of the decrease or we may require significant liquidity with little advanced notice to meet margin calls. Conversely, when the value of our open derivative positions increase, our brokers may be required to deliver margin deposits to us for a portion of the increase. We continuously monitor and manage our derivative instruments portfolio and our exposure to margin calls and while we believe we will continue to maintain adequate liquidity to cover such margin calls from operating results and borrowings, we cannot estimate the actual availability of funds from operations or borrowings for hedging transactions in the future.\nThe effects, positive or negative, on liquidity resulting from our hedging activities tend to be mitigated by offsetting changes in cash prices in our business. For example, in a period of rising corn prices, gains resulting from long grain derivative positions would generally be offset by higher cash prices paid to farmers and other suppliers in local corn markets. These offsetting changes do not always occur, however, in the same amounts or in the same period.\nWe expect that a $1.00 per bushel fluctuation in market prices for corn would impact our cost of goods sold by approximately $48 million, or $0.34 per gallon, assuming our plant operates at 100% of our capacity and assuming no increase in the price of ethanol. We expect the annual impact to our results of operations due to a $0.50 decrease in ethanol prices will result in approximately a $70 million decrease in revenue.\nSummary of Critical Accounting Policies and Estimates\nNote 2 to our financial statements contains a summary of our significant accounting policies, many of which require the use of estimates and assumptions. Accounting estimates are an integral part of the preparation of financial statements and are based upon managements current judgment. We used our knowledge and experience about past events and certain future assumptions to make estimates and judgments involving matters that are inherently uncertain and that affect the carrying value of our assets and liabilities. We believe that of our significant accounting policies, the following are noteworthy because changes in these estimates or assumptions could materially affect our financial position and results of operations:\nRevenue Recognition\nThe Company recognizes revenue when a customer obtains control of promised goods or services in an amount that reflects the consideration the entity expects to receive in exchange for those goods or services. In addition, the standard requires disclosures of the nature, amount, timing and uncertainty of revenue and cash flows arising from the contracts with customers. The Company applies the five-step method to all contracts with customers.\nThe Company sells ethanol (pursuant to a marketing agreement) and related products (direct sales). Revenues are recognized when the control has been transferred to the marketing company (or direct buyer) and the marketing company or direct buyer has taken title to the product, prices are fixed or determinable and collectability is reasonably assured.\nThe Companys products are generally shipped Free on Board (\"FOB\") shipping point, and recorded as a sale upon delivery of the applicable bill of lading and transfer of control. The Companys ethanol sales are handled through an ethanol purchase agreement (the Ethanol Agreement) with Bunge North America, Inc. (Bunge). The Company markets and distributes all of the syrup, distillers grains and distillers corn oil it produces directly to end users at market prices. Carbon dioxide is sold through a Carbon Dioxide Purchase and Sale Agreement (the CO2 Agreement) with Air Products and Chemicals, Inc. Shipping and handling costs are booked as a direct offset to revenue for ethanol sales. Marketing fees, agency fees, and commissions due to the marketer are calculated separately from the settlement for the sale of the ethanol products and co-products and are included as a component of cost of goods sold. Shipping and handling costs for co-products are included in cost of goods sold.\nAccounts Receivable\nAccounts receivable are recorded at original invoice amounts less an estimate made for doubtful receivables based on a review of all outstanding amounts on a quarterly basis. Management determines the allowance for doubtful accounts by regularly evaluating customer receivables and considering the customer's financial condition, credit history and current economic conditions. As of September 30, 2022 and September 30, 2021, management had determined an allowance of $0.2 million was necessary. Receivables are written off when deemed uncollectible and recoveries of receivables written off are recorded when received.\nInvestment in Commodities Contracts, Derivative Instruments and Hedging Activities\nThe Companys operations and cash flows are subject to fluctuations due to changes in commodity prices. The Company is subject to market risk with respect to the price and availability of corn, the principal raw material used to produce ethanol and ethanol by-products. Exposure to commodity price risk results from its dependence on corn in the ethanol production process. In general, rising corn prices result in lower profit margins and, therefore, represent unfavorable market conditions. This is especially true when market conditions do not allow the Company to pass along increased corn costs to customers. The availability and price of corn is subject to wide fluctuations due to unpredictable factors such as weather conditions, farmer planting decisions, governmental policies with respect to agriculture and international trade and global demand and supply.\nTo minimize the risk and the volatility of commodity prices, primarily related to corn and ethanol, the Company uses various derivative instruments, including forward corn, ethanol and distillers grains purchase and sales contracts, over-the-counter and exchange-trade futures and option contracts. When the Company has sufficient working capital available, it enters into derivative contracts to hedge its exposure to price risk related to forecasted corn needs and forward corn purchase contracts.\nManagement has evaluated the Companys contracts to determine whether the contracts are derivative instruments. Certain contracts that literally meet the definition of a derivative may be exempted from derivative accounting as normal purchases or normal sales. Normal purchases and normal sales are contracts that provide for the purchase or sale of something other than a financial instrument or derivative instrument that will be delivered in quantities expected to be used or sold over a reasonable period in the normal course of business. Gains and losses on contracts that are designated as normal purchases or normal sales contracts are not recognized until quantities are delivered or utilized in production.\nThe Company applies the normal purchase and sale exemption to forward contracts relating to ethanol and distillers grains and solubles and therefore these forward contracts are not marked to market. As of September 30, 2022, the Company had 4.6 million gallons in open contracts for ethanol, 58 thousand tons of open contracts on dried distillers grains, 94 thousand tons of wet distillers grains, 4.8 million pounds of corn oil on open contracts, and 2.9 million gallons of 190 proof undenatured ethanol.\nCorn purchase contracts are treated as derivative financial instruments. Changes in fair value of forward corn contracts, which are marked to market each period, are included in costs of goods sold. As of September 30, 2022, the Company was committed to purchasing 3.6 million bushels of corn on a forward contract basis resulting in a total commitment of $23.6 million. In addition, the Company was committed to purchasing 55 thousand bushels of corn using basis contracts.\nIn addition, the Company enters into short-term cash, options and futures contracts as a means of managing exposure to changes in commodity prices. The Company enters into derivative contracts to hedge the exposure to volatile commodity price fluctuations. The Company maintains a risk management strategy that uses derivative instruments to minimize significant, unanticipated earnings fluctuations caused by market volatility. The Companys specific goal is to protect itself from large moves in commodity costs. All derivatives are designated as non-hedge derivatives and the contracts will be accounted for at fair value. Although the contracts will be effective economic hedges of specified risks, they are not designated as and accounted for as hedging instruments.\nInventory\nInventory is valued at the lower of average cost or net realizable value. In the valuation of inventories and purchase commitments, net realizable value is defined as estimated selling price in the ordinary course of business less reasonably predictable costs of completion, disposal and transportation. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot applicable. Item 8. Financial Statements and Supplementary Data.\nReport of Independent Registered Public Accounting Firm\nTo the Members and Board of Directors of Southwest Iowa Renewable Energy, LLC\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Southwest Iowa Renewable Energy, LLC (the Company) as of September 30, 2022 and 2021, the related statements of operations, members equity and cash flows for each of the years then ended, and the related notes to the financial statements (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ RSM US LLP\nFirm ID: 49\nWe have Served as the Company's auditor since 2008.\nDes Moines, Iowa, USA\nDecember 9, 2022\nSOUTHWEST IOWA RENEWABLE ENERGY, LLC\nBalance Sheets\n(Dollars in thousands)\nSeptember 30, 2022\nSeptember 30, 2021\nASSETS\nCurrent Assets\nCash and cash equivalents\n$ 7,229 $ 1,945\nAccounts receivable, net of allowance for doubtful accounts\n13,982 12,766\nDerivative financial instruments\n6,071 1,556\nInventory\n28,518 28,677\nPrepaid expenses and other\n225 443\nTotal current assets\n56,025 45,387\nProperty, Plant and Equipment\nLand\n2,064 2,064\nPlant, building and equipment\n261,235 255,623\nOffice and other equipment\n1,975 1,892\n265,274 259,579\nAccumulated depreciation\n(164,969 ) (153,546 )\nNet property, plant and equipment\n100,305 106,033\nOther Assets\nRight of use asset operating leases, net\n3,213 3,937\nOther assets 843 1,069\nTotal Assets\n$ 160,386 $ 156,426\nLIABILITIES AND MEMBERS' EQUITY\nCurrent Liabilities\nAccounts payable\n$ 10,420 $ 7,695\nAccrued expenses\n5,980 4,556\nCurrent maturities of notes payable\n7,609 10,019\nCurrent portion of operating lease liability\n1,977 2,922\nTotal current liabilities\n25,986 25,192\nLong Term Liabilities\nNotes payable, less current maturities\n8,396 51,677\nOther long-term liabilities\n3,836 4,154\nOperating lease liability, less current portion\n1,236 1,015\nTotal long term liabilities\n13,468 56,846\nMembers' Equity\nMembers' Capital, 8,975 units issued and outstanding\n64,106 64,106\nRetained earnings\n56,826 10,282\nTotal members' equity\n120,932 74,388\nTotal Liabilities and Members' Equity\n$ 160,386 $ 156,426\nSee Notes to Financial Statements\nSOUTHWEST IOWA RENEWABLE ENERGY, LLC\nStatements of Operations\n(Dollars in thousands, except per unit data)\nYear Ended\nYear Ended\nSeptember 30, 2022\nSeptember 30, 2021\nRevenues\n$ 387,125\n$ 302,820\nCost of Goods Sold\nCost of goods sold-non hedging\n342,935\n291,890\nRealized & unrealized hedging losses (gains), net\n(16,577 )\n(4,395 )\n$ 326,358\n287,495\nGross Margin (Loss)\n60,767\n15,325\nGeneral and administrative expenses\n$ 7,241\n5,733\nOperating Income (Loss)\n53,526\n9,592\nOther (Income) Expense\nInterest expense\n1,518\n2,025\nOther (income) expense, net\n(5,754 )\n(1,017 )\nInterest and other (income) expense, net\n$ (4,236 )\n1,008\nNet Income (Loss)\n$ 57,762\n$ 8,584\nWeighted Average Units Outstanding -basic and diluted\n8,975\n8,975\nIncome (Loss) per unit -basic and diluted\n$ 6,435.88\n$ 956.43\nSee Notes to Financial Statements\nSOUTHWEST IOWA RENEWABLE ENERGY, LLC\nStatements of Members' Equity\n(Dollars in thousands)\nMembers' Capital\nRetained Earnings\nTotal\nBalance, September 30, 2020\n$ 64,106 $ 1,698 $ 65,804\nNet Income (Loss)\n- 8,584 8,584\nBalance, September 30, 2021\n$ 64,106 $ 10,282 $ 74,388\nDistributions\n- $ (11,218 ) $ (11,218 )\nNet Income (Loss)\n- 57,762 57,762\nBalance, September 30, 2022\n$ 64,106 $ 56,826 $ 120,932\nSee Notes to Financial Statements\nSOUTHWEST IOWA RENEWABLE ENERGY, LLC\nStatements of Cash Flows\n(Dollars in thousands)\nYear Ended\nYear Ended\nSeptember 30, 2022\nSeptember 30, 2021\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet Income (Loss)\n$ 57,762 $ 8,584\nAdjustments to reconcile net (loss) to net cash provided by operating activities:\nDepreciation\n11,443 11,114\nAmortization\n45 78\nGain on extinguishment of debt\n(2,177 ) -\nChange in other assets, net\n226 103\nBad debt expense\n- 79\n(Increase) decrease in current assets:\nAccounts receivable\n(1,216 ) (4,357 )\nInventory\n159 (15,308 )\nPrepaid expenses and other\n218 (19 )\nDerivative financial instruments\n(4,515 ) (851 )\nIncrease (decrease) in current liabilities:\nAccounts payable\n2,725 4,491\nAccrued expenses\n470 380\nIncrease (decrease) in other long-term liabilities\n(318 ) 2,076\nNet cash (used in) provided by operating activities\n64,822 6,370\nCASH FLOWS FROM INVESTING ACTIVITIES\nPurchase of property and equipment\n(4,761 ) (8,262 )\nNet cash (used in) provided by investing activities\n(4,761 ) (8,262 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nDividends paid to members\n(11,218 ) -\nPayments for financing costs\n- (33 )\nProceeds from notes payable\n232,919 244,441\nPayments of notes payable\n(276,478 ) (241,687 )\nNet cash (used in) provided by financing activities\n(54,777 ) 2,721\nNet increase (decrease) in cash and cash equivalents\n5,284 829\nCASH AND CASH EQUIVALENTS\nBeginning\n1,945 1,116\nEnding\n$ 7,229 $ 1,945\nSUPPLEMENTAL CASH FLOW INFORMATION\nCash paid for interest\n$ 1,574 $ 2,026\nPurchases of property and equipment included in accrued expenses 954 -\nOperating lease liability arising from obtaining right of use assets 1,616 -\nSee Notes to Financial Statements\nSOUTHWEST IOWA RENEWABLE ENERGY, LLC\nNotes to Financial Statements\nSeptember 30, 2022\nNote 1: Nature of Business\nSouthwest Iowa Renewable Energy, LLC (the Company), located in Council Bluffs, Iowa, was formed in March 2005, operates a 147 million gallon capacity ethanol plant and began producing ethanol in February 2009. The Company sold 123.3 million gallons and 127.0 million gallons of ethanol in Fiscal 2022 and Fiscal 2021, respectively. The Company sells its ethanol, distillers grains, corn syrup, and distillers corn oil in the continental United States, Mexico and the Pacific Rim.\nNote 2: Summary of Significant Accounting Policies\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from these estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments purchased with a maturity of three months or less when purchased to be cash equivalents.\nConcentration of Credit Risk\nThe Companys cash balances are maintained in bank deposit accounts which at times may exceed federally-insured limits. The Company has not experienced any losses in such accounts.\nRevenue Recognition\nThe Company recognizes revenue when a customer obtains control of promised goods or services in an amount that reflects the consideration the entity expects to receive in exchange for those goods or services. In addition, the standard requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from the contracts with customers. The Company applies the five-step method to all contracts with customers.\nThe Company sells denatured ethanol pursuant to a marketing agreement. Revenues are recognized when the control has been transferred to the marketing company and the marketing company has taken title to the product, prices are fixed or determinable and collectability is reasonably assured.\nThe Companys products are generally shipped Free on Board (\"FOB\") shipping point, and recorded as a sale upon delivery of the applicable bill of lading and transfer of control. The Companys denatured ethanol sales are handled through an ethanol purchase agreement (the Ethanol Agreement) with Bunge North America, Inc. (Bunge). The Company markets and distributes all of the syrup, distillers grains, ethanol not sold under the Ethanol Agreement, and distillers corn oil it produces directly to end users at market prices. Carbon dioxide is sold through a Carbon Dioxide Purchase and Sale Agreement (the CO2 Agreement) with Air Products and Chemicals, Inc. Shipping and handling costs are booked as a direct offset to revenue for ethanol sales. Marketing fees, agency fees, and commissions due to the marketer are calculated separately from the settlement for the sale of the ethanol products and co-products and are included as a component of cost of goods sold. Shipping and handling costs for co-products are included in cost of goods sold.\nAccounts Receivable\nAccounts receivable are recorded at original invoice amounts less an estimate made for doubtful receivables based on a review of all outstanding amounts on a monthly basis. Management determines the allowance for doubtful accounts by regularly evaluating individual customer receivables and considering customers financial condition, credit history and current economic conditions. As of September 30, 2022 and 2021, management had determined an allowance of $206 thousand was necessary. Receivables are written off when deemed uncollectible, and recoveries of receivables written off are recorded when received.\nRisks and Uncertainties\nThe Company's operating and financial performance is largely driven by the prices at which ethanol is sold and the net expense of corn. The price of ethanol is influenced by factors such as supply and demand, weather, government policies and programs, and unleaded gasoline and the petroleum markets with ethanol selling, in general, for less than gasoline at the wholesale level. Excess ethanol supply in the market, in particular, puts downward pressure on the price of ethanol. The Company's largest cost of production is corn. The cost of corn is generally impacted by factors such as supply and demand, weather, government policies and programs. The Company's risk management program is used to protect against the price volatility of these commodities.\nInvestment in Commodities Contracts, Derivative Instruments and Hedging Activities\nThe Companys operations and cash flows are subject to fluctuations due to changes in commodity prices. The Company is subject to market risk with respect to the price and availability of corn, the principal raw material used to produce ethanol and ethanol by-products. Exposure to commodity price risk results from its dependence on corn in the ethanol production process. In general, rising corn prices result in lower profit margins and, therefore, represent unfavorable market conditions. This is especially true when market conditions do not allow the Company to pass along increased corn costs to customers. The availability and price of corn is subject to wide fluctuations due to unpredictable factors such as weather conditions, farmer planting decisions, governmental policies with respect to agriculture and international trade and global demand and supply.\nTo minimize the risk and the volatility of commodity prices, primarily related to corn and ethanol, the Company uses various derivative instruments, including forward corn, ethanol and distillers grains purchase and sales contracts, over-the-counter and exchange-trade futures and option contracts. When the Company has sufficient working capital available, it enters into derivative contracts to hedge its exposure to price risk related to forecasted corn needs and forward corn purchase contracts.\nManagement has evaluated the Companys contracts to determine whether the contracts are derivative instruments. Certain contracts that literally meet the definition of a derivative may be exempted from derivative accounting as normal purchases or normal sales. Normal purchases and normal sales are contracts that provide for the purchase or sale of something other than a financial instrument or derivative instrument that will be delivered in quantities expected to be used or sold over a reasonable period in the normal course of business. Gains and losses on contracts that are designated as normal purchases or normal sales contracts are not recognized until quantities are delivered or utilized in production.\nThe Company applies the normal sale exemption to forward contracts relating to ethanol, distillers grains, and corn oil and therefore these forward contracts are not marked to market. As of September 30, 2022, the Company had commitments to sell 4.6 million gallons of ethanol, 58 thousand tons of dried distillers grains, 94 thousand tons of wet distillers grains, 4.8 million pounds of corn oil and 2.9 million gallons of 190 proof undenatured ethanol.\nCorn purchase contracts are treated as derivative financial instruments. Changes in fair value of forward corn contracts, which are marked to market each period, are included in costs of goods sold. As of September 30, 2022, the Company was committed to purchasing 3.6 million bushels of corn on a forward contract basis resulting in a total commitment of $23.6 million. In addition the Company was committed to purchasing 55 thousand bushels of corn using basis contracts.\nIn addition, the Company enters into short-term cash, options and futures contracts as a means of managing exposure to changes in commodity prices. The Company enters into derivative contracts to hedge the exposure to volatile commodity price fluctuations. The Company maintains a risk management strategy that uses derivative instruments to minimize significant, unanticipated earnings fluctuations caused by market volatility. The Companys specific goal is to protect itself from large moves in commodity costs. All derivatives are designated as non-hedge derivatives and the contracts will be accounted for at fair value. Although the contracts are considered effective economic hedges of specified risks, they are not designated as or accounted for as hedging instruments for accounting purposes.\nDerivatives not designated as hedging instruments along with cash due to brokers at September 30, 2022 and 2021 are as follows:\nBalance Sheet Classification\nSeptember 30, 2022\nSeptember 30, 2021\nin 000's\nin 000's\nFutures and option contracts:\nIn gain position\n$ 4,778 $ 196\nIn loss position\n(2,223 ) (1,386 )\nCash held by broker\n1,935 2,012\nForward contracts, corn:\nIn gain position 1,921 1,576\nIn loss position (340 ) (842 )\nNet futures, options, and forward contracts\n$ 6,071 $ 1,556\nThe net realized and unrealized gains and losses on the Companys derivative contracts for the years ended September 30, 2022 and 2021 consist of the following:\nStatement of Operations Classification\nSeptember 30, 2022\nSeptember 30, 2021\nNet realized and unrealized (gains) losses related to:\n(in 000's)\n(in 000's)\nForward purchase contracts (corn)\nCost of Goods Sold\n$ (6,585 ) $ (8,831 )\nFutures and option contracts (corn)\nCost of Goods Sold\n(9,992 ) 4,436\nFutures contracts (ethanol) Revenues 5,649 -\nThe presentation of the realized loss on ethanol futures contracts of $5.6 million has been changed as a result of our accounting policy change to present realized and unrealized hedging losses (gains) as a component of revenue rather than cost of goods sold to align with common industry presentation.\nInventory\nInventory is stated at the lower of average cost or net realizable value. In the valuation of inventories and purchase commitments, net realizable value is defined as estimated selling price in the ordinary course of business less reasonable predictable costs of completion, disposal and transportation. At both September 30, 2022 and 2021, there was no lower of cost or market adjustment.\nLeases\nIn February 2016, Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2016-02 \"Leases (\"ASU 2016-02\"). ASU 2016-02 requires the recognition of lease assets and lease liabilities by lessees for all leases greater than one year in duration and classified as operating leases under previous GAAP. Under the guidance, lessees are required to recognize the following for all leases (with the exception of short-term leases): 1) a lease liability, which is a lessee's obligation to make lease payments arising from a lease, measured on a discounted cash flow basis; and 2) a \"right of use\" asset, which is an asset that represents the lessee's right to use the specified asset for the lease term. The Company has elected to account for lease and related non-lease components as a single lease component. See Note 10 for more detailed information regarding leases.\nProperty and Equipment\nProperty and equipment are stated at cost. Depreciation is computed using the straight-line method over the following estimated useful lives:\n(in years)\nBuildings\nProcess Equipment\n10 - 20\nOffice Equipment\n3-7\nMaintenance and repairs are charged to expense as incurred; major improvements are capitalized.\nLong-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the asset group may not be recoverable. An impairment loss would be recognized when estimated undiscounted future cash flows from operations are less than the carrying value of the asset group. An impairment loss would be measured by the amount by which the carrying value of the asset exceeds the fair value of the asset. Management has determined there were no events or changes in circumstances that required an impairment evaluation during Fiscal 2022 or Fiscal 2021.\nIncome Taxes\nThe Company has elected to be treated as a partnership for federal and state income tax purposes and generally does not incur income taxes. Instead, the Companys earnings and losses are included in the income tax returns of the members. Therefore, no provision or liability for federal or state income taxes has been included in these financial statements.\nManagement has evaluated the Companys tax positions under the Financial Accounting Standards Board issued guidance on accounting for uncertainty in income taxes and concluded that the Company has taken no uncertain tax positions that require adjustment to the financial statements to comply with the provisions of this guidance.\nNote 3: Inventory\nInventory is comprised of the following at:\nSeptember 30, 2022\nSeptember 30, 2021\n(in 000's)\n(in 000's)\nRaw Materials - corn\n$ 9,972 $ 9,275\nSupplies and Chemicals\n6,343 5,589\nWork in Process\n3,251 2,762\nFinished Goods\n8,952 11,051\nTotal\n$ 28,518 $ 28,677\nNote 4: Revolving Loan/Credit Agreements\nFCSA/CoBank\nThe Company is a party to a credit agreement with Farm Credit Services of America, FLCA (\"FCSA\"), Farm Credit Services of America, PCA and CoBank, ACB, as cash management provider and agent (\"CoBank\") which provides the Company with a term loan in the amount of $30.0 million (the \"Term Loan\") and a revolving term loan in the amount of up to $40.0 million (the \"Revolving Term Loan\") and a $10 million revolving line of credit (the \"Revolving Credit Loan\") (collectively, the FCSA Credit Facility\"). The FCSA Credit Facility is secured by a security interest on all of the Company's assets.\nThe Term Loan provides for semi-annual payments by the Company to FCSA of $3.75 million with a maturity date of November 15, 2024. The Term Loan required the Company to make one principal payment of $3.75 million during 2021, which payment was made on March 1, 2021, and thereafter requires the Company to make four equal semi-annual payments of $3.75 million on each March 1 and September 1, through September 1, 2023. All remaining amounts due under the Term Loan are due and payable on the maturity date of November 15, 2024. Effective July 18, 2022, the maximum principal available under the Term Loan was reduced from $30 million to $18.75 million and the interest rate is based on the Daily Simple SOFR rate plus a rate spread of 3.25% per annum. As of September 30, 2022, there was an outstanding balance of $15.0 million on the Term Loan.\nThe current maturity date of the Revolving Credit Loan is February 1, 2023 and the current maturity date of the Revolving Term loan is September 1, 2027. As of September 30, 2022, there was $442 thousand outstanding under the Revolving Credit Loan, with $39.6 million available under the Revolving Term Loan.\nGovernment Programs\nOn April 14, 2020, the Company received $1.1 million under the new Paycheck Protection Program legislation passed in response to the economic downturn triggered by COVID-19, and on January 28, 2021, the Company received an additional $1.1 million under Phase II of the PPP legislation (collectively the \"PPP Loans\"). Our PPP Loan may be forgiven based upon various factors, including, without limitation, our payroll cost over an eight-to-twenty-four week period starting upon our receipt of the funds. Expenses for approved payroll costs, lease payments on agreements before February 15, 2020, and utility payments under agreements before February 1, 2020 and certain other specified costs can be paid with these funds and eligible for payment forgiveness by the federal government. At least 60% of the proceeds must be used for approved payroll costs, and no more than 40% on non-payroll expenses. PPP loan proceeds used by a borrower for the approved expense categories have generally been fully forgiven by the lender if the borrower satisfies certain employee headcount and compensation requirements. The Company applied for forgiveness of its PPP Loans from the Small Business Administration (\"SBA\") and was notified on December 24, 2021, that the PPP Loans had been forgiven in full. The gain on the debt extinguishment was recorded in other income.\nOn May 23, 2022, the Company received $3.1 million from the USDA's Biofuel Producer Program. This amount was deemed \"other income\" to the Company and there are no additional requirements the Company must fulfill to keep the funds.\nNote 5: Notes Payable\nNotes payable consists of the following (in 000's):\nSeptember 30, 2022\nSeptember 30, 2021\nTerm loan bearing interest at Daily Simple SOFR plus 3.25% (6.24% at September 30, 2022)\n$ 15,000 $ 22,500\nNote payable, PPP Loan bearing interest at 1.00%, forgiven in December of 2021\n- 1,063\nNote payable, PPP Loan bearing interest at 1.00%, forgiven in December of 2021\n- 1,114\nRevolving term loan bearing interest at Daily Simple SOFR plus 3.25% (6.24% at September 30, 2022)\n442 34,999\nOther with interest rates from 3.50% to 4.15% and maturities through 2027\n563 2,020\n16,005 61,696\nLess Current Maturities\n7,609 10,019\nTotal Long Term Debt\n8,396 51,677\nApproximate aggregate maturities of notes payable as of September 30, 2022 are as follows (in 000's):\n$ 7,609\n7,612\n2028 and thereafter\n-\nTotal\n$ 16,005\nNote 6: Fair Value Measurement\nFair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. In determining fair value, the Company used various methods including market, income and cost approaches. Based on these approaches, the Company often utilizes certain assumptions that market participants would use in pricing the asset or liability, including assumptions about risk and/or the risks inherent in the inputs to the valuation technique. These inputs can be readily observable, market corroborated, or generally unobservable inputs. The Company utilizes valuation techniques that maximize the use of observable inputs and minimize the use of unobservable inputs. Based on the observable inputs used in the valuation techniques, the Company is required to provide the following information according to the fair value hierarchy.\nThe fair value hierarchy ranks the quality and reliability of the information used to determine fair values. Financial assets and liabilities carried at fair value will be classified and disclosed in one of the following three categories:\nLevel 1 - Valuations for assets and liabilities traded in active markets from readily available pricing sources for market transactions involving identical assets or liabilities.\nLevel 2 - Valuations for assets and liabilities traded in less active dealer or broker markets. Valuations are obtained from third-party pricing services for identical or similar assets or liabilities.\nLevel 3 - Valuations incorporate certain assumptions and projections in determining the fair value assigned to such assets or liabilities.\nA description of the valuation methodologies used for instruments measured at fair value, including the general classifications of such instruments pursuant to the valuation hierarchy, is set forth below.\nDerivative financial statements. Commodity futures and exchange traded options are reported at fair value utilizing Level 1 inputs. For these contracts, the Company obtains fair value measurements from an independent pricing service. The fair value measurements consider observable data that may include dealer quotes and live trading levels from the Chicago Mercantile Exchange (CME) market. Ethanol contracts are reported at fair value utilizing Level 2 inputs from third-party pricing services. Forward purchase contracts are reported at fair value utilizing Level 2 inputs. For these contracts, the Company obtains fair value measurements from local grain terminal values. The fair value measurements consider observable data that may include live trading bids from local elevators and processing plants which are based off the CME market.\nThe following table summarizes financial instruments measured at fair value on a recurring basis as of September 30, 2022 and 2021, categorized by the level of the valuation inputs within the fair value hierarchy: (dollars in '000s)\nSeptember 30, 2022\nLevel 1\nLevel 2\nLevel 3\nAssets:\nDerivative financial instruments\n$ 4,778 $ 1,581 $ -\nLiabilities:\nDerivative financial instruments\n$ (2,223 ) - -\nSeptember 30, 2021\nLevel 1\nLevel 2\nLevel 3\nAssets:\nDerivative financial instruments\n$ 196 $ 734 $ -\nLiabilities:\nDerivative financial instruments\n$ (1,386 ) - -\nNote 7: Incentive Compensation\nThe Company has an equity incentive plan which provides that the Board of Directors may make awards of equity appreciation units (EAU) and equity participation units (EPU) to employees from time to time, subject to vesting provisions as determined for each award. There are no EAUs outstanding. The EPUs are valued in accordance with the agreement which is based on the book value per unit of the Company. The Company had 50.7 unvested EPUs outstanding under this plan as of September 30, 2022, which will vest three years from the dates of the awards.\nDuring the Fiscal 2022 and Fiscal 2021, the Company recorded compensation expenses related to this plan of approximately $182,000 and $189,000, respectively. As of September 30, 2022 and 2021, the Company had a liability of approximately $569,000 and $416,000, respectively, recorded within accrued expenses on the balance sheet. The incentive compensation expense is recognized over three years from the date of the awards.\nNote 8: Major Customers\nThe Company is party to the Ethanol Agreement with Bunge for the marketing, selling and distributing of all the denatured ethanol produced by the Company through December 31, 2026. Revenues from Bunge were$258.2 million during Fiscal 2022 and$223.2 million during Fiscal 2021. The revenue is for ethanol only. Under the Ethanol Agreement, the Company pays Bunge a flat monthly marketing fee. The term of the Ethanol Agreement expires on December 31, 2026. The Company paid Bunge ethanol marketing fees of $1.5 million during both Fiscal 2022 and Fiscal 2021.\nNote 9: Commitments\nThe Company has entered into a steam contract with an unrelated party under which the vendor agreed to provide the steam required by the Company, up to 475,000 pounds per hour. The Company agreed to pay a net energy rate for all steam provided under the contract as well as a monthly demand charge. The net energy rate is set for the first three years then adjusted each year beginning on the third anniversary date. The steam contract was renewed effective January 1, 2013, and will remain in effect until November 30, 2024. Expenses under this agreement for the years ended September 30, 2022 and 2021 were $0.1 million during both years.\nNote 10: Lease Obligations\nEffective October 1, 2019, the Company adopted ASU 2016-02, Leases (Topic 842). The Company elected the short-term lease exception provided for in the standard and therefore only recognized right-of-use assets and lease liabilities for leases with a term greater than one year.\nA lease exists when a contract conveys to a party the right to control the use of identified property, plant, or equipment for a period of time in exchange for consideration. The Company recognized a lease liability at the lease commencement date, as the present value of future lease payments, using an estimated rate of interest that the Company would pay to borrow equivalent funds on a collateralized basis. A lease asset is recognized based on the lease liability value and adjusted for any prepaid lease payments, initial direct costs, or lease incentive amounts. The lease term at the commencement date includes any renewal options or termination options when it is reasonably certain that the Company will exercise or not exercise those options, respectively.\nThe Company leases rail cars and rail moving equipment with original terms up to 3 years for hopper cars and 4 years for tanker cars from Trinity Leasing and Bunge. During Fiscal 2022 and Fiscal 2021, a portion of the railcars were subleased to third parties. The sub-lease income was $0.1 million for Fiscal 2022 and $0.1 million for Fiscal 2021. All of the subleased rail cars were returned during Fiscal 2022 and all of the hopper cars were returned to Bunge by November 1, 2022. The Company entered into new leases at the end of Fiscal 2022 for hoppers with two different third parties equating to a total of 35 hoppers with leases starting September 1, 2022 and running through August 2027. The average remaining life of the lease term for these leases was 2.3 years as of September 30, 2022. The Company incurred $4.5 million in lease cost during Fiscal 2022 and $3.5 million during Fiscal 2021.\nThe discount rate used in determining the lease liability for each individual lease was the Company's estimated incremental borrowing rate of 6.24% . The operating lease liability, included in current and long term liabilities was $3.2 million as of September 30, 2022.\nThe Company's aggregate minimum rental commitments under non-cancellable operating leases as of September 30, 2022 are as follows (in 000's):\n$ 2,027\n2027 and after\nTotal\n3,506\nUndiscounted future payments\n3,506\nDiscount effect\n(293 )\nPresent value\n$ 3,213\nNote 11: Subsequent Events\nOn December 6, 2022, our Board of Directors declared a distribution of $2,500 per unit to its members. The distributions are expected to be paid on or around December 23, 2022 to members of record on December 6, 2022. Based on the current number of units outstanding, the aggregate payment will be approximately $22.4 million. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nThere are no items to report. Item 9A. Controls and Procedures.\nThe Companys management, including its President and Chief Executive Officer (our principal executive officer), Michael D. Jerke, along with its Chief Financial Officer (our principal financial officer), Ann M. Reis, have reviewed and evaluated the effectiveness of the Companys disclosure controls and procedures (as defined in Rule 13a-15 under the Securities Exchange Act of 1934, as amended, the Exchange Act), as of September 30, 2022. The Companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements. Based upon this review and evaluation, these officers believe that the Company's disclosure controls and procedures are presently effective in ensuring that material information related to us is recorded, processed, summarized and reported within the time periods required by the forms and rules of the Securities and Exchange Commission (the \"SEC\").\nThe Companys management assessed the effectiveness of the Companys internal control over financial reporting as of September 30, 2022. In making this assessment, the Companys management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework (the 2013 Framework). Based on this assessment, the Companys management concluded that, as of September 30, 2022, the Companys integrated controls over financial reporting were effective. This annual report does not include an attestation report on internal controls by the companys registered public accounting firm pursuant to the exemption under Section 989G of the Dodd-Frank Act of 2010. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe Information required by this Item is incorporated by reference from the definitive proxy statement for the Companys 2023 Annual Meeting of Members (the 2023 Proxy Statement) to be filed with the SEC within 120 days after the end of the Companys fiscal year ended September 30, 2022. Item 11. Executive Compensation.\nThe Information required by this Item is incorporated by reference in the 2023 Proxy Statement. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Member Matters.\nThe Information required by this Item is incorporated by reference in the 2023 Proxy Statement. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe Information required by this Item is incorporated by reference in the 2023 Proxy Statement. Item 14. Principal Accountant Fees and Services.\nThe Information required by this Item is incorporated by reference in the 2023 Proxy Statement.\nPART IV Item 15. Exhibits and Financial Statement Schedules.\n(a) Documents filed as part of this Report.\nBalance Sheets\nStatements of Operations\nStatements of Members Equity\nStatements of Cash Flows\nNotes to Financial Statements\n(b) The following exhibits are filed herewith or incorporated by reference as set forth below:\nOmitted - Inapplicable.\n3(i)\nArticles of Organization, as filed with the Iowa Secretary of State on March 28, 2005 (incorporated by reference to Exhibit 3(i) of Registration Statement on Form 10 filed by the Company on January 28, 2008).\n4(i)\nFifth Amended and Restated Operating Agreement dated June 19, 2020 (incorporated by reference to Exhibit 3.2.1 on Form 8-K filed by the Company on June 23, 2020.\n4(ii)\nUnit Transfer Policy, including QMS Manual - attached as Appendix 1 (incorporated by reference to Exhibit 4(ii) on Form 10-K filed by the Company on December 23, 2021).\n4(vi) Description of Our Securities (incorporated by reference to Exhibit 4(vi) on Form 10-K filed by the Company on December 23, 2021)\nOmitted - Inapplicable.\n10.1\nElectric Service Contract dated December 15, 2006 with MidAmerican Energy Company (incorporated by reference to Exhibit 10.6 of Registration Statement on Form 10 filed by the Company on January 28, 2008).\n10.2\nLicense Agreement dated September 25, 2006 between the Company and ICM, Inc. (incorporated by reference to Exhibit 10.10 on Form S-1/A filed by the Company on February 24, 2011). Portions of the Agreement have been omitted pursuant to a request for confidential treatment.\n10.3\nSteam Service Contract dated January 22, 2007 between the Company and MidAmerican Energy Company, as amended October 3, 2008, January 1, 2009, January 1, 2009, December 1, 2009, January 1, 2013, and August 20, 2015 (incorporated by reference to Exhibit 10.3 of Form 10-K filed by the Company on December 11, 2020). Portions of the Agreement and amendments thereto have been omitted pursuant to Item 601(b)(10)(iv) of Regulation S-K (17 CFR § 229.601(b)(10)(iv)) because such information is both not material and would likely cause competitive harm to the company if publicly disclosed\n10.4\nAmended and Restated Railcar Sublease Agreement dated March 25, 2009 with Bunge North America, Inc. (incorporated by reference to Exhibit 10.4 of Form 10-K filed by the Company on December 11, 2020). Portions of the Agreement have been omitted pursuant to Item 601(b)(10)(iv) of Regulation S-K (17 CFR § 229.601(b)(10)(iv)) because such information is both not material and would likely cause competitive harm to the company if publicly disclosed.\n10.5*\nSouthwest Iowa Renewable Energy Equity Incentive Plan (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on July 6, 2010).\n10.6\nJoint Defense Agreement between ICM, Inc. and the Company dated July 13, 2010 (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on July 16, 2010).\n10.7 Tricanter Purchase and Installation Agreement by and between ICM, Inc. and the Company dated August 25, 2010 (incorporated by reference to Exhibit 10.1 of Form 8-K/A filed by the Company on January 12, 2011). Portions of the Agreement have been omitted pursuant to a request for confidential treatment.\n10.8 Base Contract for Sale and Purchase of Natural Gas between Encore Energy Services, Inc. and the Company effective April 1, 2012. Portions of this Agreement have been omitted pursuant to a request for confidential treatment (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on May 1, 2012).\n10.7*\nSouthwest Iowa Renewable Energy Equity Incentive Plan (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company of July 6, 2010).\n10.8\nJoint Defense Agreement between ICM, Inc. and the Company dated July 13, 2010 (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on July 16, 2010).\n10.9\nConfirming Order between Encore Energy Services, Inc. and the Company dated April 25, 2012. Portions of the Agreement have been omitted pursuant to a request for confidential treatment. (incorporated by reference to Exhibit 10.2 of Form 8-K filed by the Company on May 1, 2012).\n10.10 Carbon Dioxide Purchase and Sale Agreement by and among the Company and EPCO Carbon Dioxide Products, Inc. named therein dated effective as of April 2, 2013 (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on April 11, 2013).\n10.10*\nEmployment Agreement dated effective January 1, 2012 by and between the Company and Brian T. Cahill. (incorporated by reference to Exhibit 10.2 of Form 8-K filed by the Company on January 5, 2012).\n10.11 Non-Exclusive CO2 Facility Site Lease Agreement by and among the Company and EPCO Carbon Dioxide Products, Inc. named therein dated effective April 2, 2013 (incorporated by reference to Exhibit 10.2 of Form 8-K filed by the Company of April 11, 2013).\n10.12\nCredit Agreement by and between the Company, Farm Credit Services of America, FLCA, as Lender and CoBank, ACB as cash management provider and agent dated as of June 24, 2014 (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on June 30, 2014).\n10.13\nGlobal Modification Agreement dated February 26, 2021 by and among the Company, Farm Credit Services of America, FLCA, Farm Credit Services of America, PCA and CoBank, ACB (incorporated by reference to Exhibit 10.1 on Form 8-K filed by the Company on March 4, 2021)\n10.14\nTerm Note by and between the Company and Farm Credit Services of America, FLCA dated June 24, 2014 (incorporated by reference to Exhibit 10.2 of Form 8-K filed by the Company on June 30, 2014).\n10.15\nRevolving Term Note by and between the Company and Farm Credit Services of America, FLCA dated as of June 24, 2014 (incorporated by reference to Exhibit 10.3 of Form 8-K filed by the Company on June 30, 2014).\n10.16\nSecond Amended and Restated Ethanol Purchase Agreement effective as of January 1, 2020 by and among the Company and Bunge North America, Inc. (incorporated by reference to Exhibit 10.3 of Form 8-K filed by the Company on January 2, 2020).\n10.17\nEmployment Agreement between the Company and Michael D. Jerke effective October 22, 2018 (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on September 28, 2018).\n10.18\nAmendment No. 4 to Credit Agreement dated November 8, 2019 by and among Southwest Iowa Renewable Energy, LLC, Farm Credit Services of American, FLCA and CoBank, ACB (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on November 14, 2019).\n10.19\nAmendment No. 5 to Credit Agreement dated February 26, 2021 by and among the Company, Farm Credit Services of America, FLCA, Farm Credit Services of America, PCA and CoBank, ACB (incorporated by reference to Exhibit 10.2 on Form 8-K filed by the Company on March 4, 2019).\n10.20 Amendment No. 6 to Credit Agreement dated July 30, 2021 by and among the Company, Farm Credit Services of America, FLCA, Farm Credit Services of America, PCA and CoBank, ACB (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on August 12, 2021).\n10.21\nAmendment No. 7 to Credit Agreement dated October 29, 2021 by and among the Company, Farm Credit Services of America, FLCA, Farm Credit Services of America, PCA and CoBank, ACB (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on November 4, 2021).\n10.22\nAmendment No. 8 to Credit Agreement dated February 25, 2022 by and among Southwest Iowa Renewable Energy, LLC, Farm Credit Services of America, FLCA, Farm Credit Services of America, PCA and CoBank, ACB (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on March 3, 2022).\n10.23\nRevolving Credit Note dated February 26, 2021 (incorporated by reference to Exhibit 10.4 on Form 8-K filed by the Company on March 4, 2021).\n10.24\nAmended and Restated Revolving Credit Note dated July 30, 2021 (incorporated by reference to Exhibit 10.2 of Form 8-K filed by the Company on August 12, 2021).\n10.25\nSecond Amended and Restated Revolving Credit Note dated October 29, 2021 (incorporated by reference to Exhibit 10.2 of Form 8-K filed by the Company on November 4, 2021).\n10.26\nLetter Agreement to the Second Amended and Restated Revolving Credit Note dated October 29, 20212021 (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on February 7, 2022).\n10.27\nThird Amended and Restated Revolving Credit Note dated February 25, 2022 (incorporated by reference to Exhibit 10.2 of Form 8-K filed by the Company on March 3, 2022).\n10.28\nFourth Amended and Restated Revolving Credit Note dated July 18, 2022 (incorporated by reference to Exhibit 10.4 of Form 8-K filed by the Company on July 22, 2022).\n10.29\nSecond Amended and Restated Term Note dated February 26, 2021 (incorporated by reference to Exhibit 10.3 on Form 8-K filed by the Company on March 4, 2021)\n10.30\nThird Amended and Restated Term Note dated July 18, 2022(incorporated by reference to Exhibit 10.2 of Form 8-K filed by the Company on July 22, 2022).\n10.31\nAmended and Restated Term Note by and between the Company and Farm Credit Services of America, FLCA dated November 8, 2019 (incorporated by reference to Exhibit 10.2 of Form 8-K filed by the Company on November 14, 2019).\n10.32\nAmended and Restated Revolving Term Note by and between the Company and Farm Credit Services of America, FLCA dated November 8, 2019 (incorporated by reference to Exhibit 10.3 of Form 8-K filed by the Company on November 14, 2019).\n10.33 First Amended and Restated Credit Agreement dated July 18, 2022 by and among Southwest Iowa Renewable Energy, LLC, Farm Credit Services of America, FLCA, Farm Credit Services of America, PCA and CoBank, ACB (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on July 22, 2022).\n10.34 Amendment No. 1 to the First Amended and Restated Credit Agreement dated September 21, 2022 by and among Southwest Iowa Renewable Energy, LLC, Farm Credit Services of America, FLCA, Farm Credit Services of America, PCA and CoBank, ACB (incorporated by reference to Exhibit 10.1 of Form 8-K filed by the Company on September 23, 2022).\n10.35 Second Amended and Restated Revolving Term Note dated July 18, 2022 (incorporated by reference to Exhibit 10.3 of Form 8-K filed by the Company on July 22, 2022).\n10.36 Third Amended and Restated Revolving Term Note dated September 21, 2022 (incorporated by reference to Exhibit 10.2 of Form 8-K filed by the Company on September 23, 2022).\nOmitted - Inapplicable.\nOmitted - Inapplicable.\nOmitted - Inapplicable.\nOmitted - Inapplicable.\nOmitted - Inapplicable.\nOmitted - Inapplicable.\nOmitted - Inapplicable.\nOmitted - Inapplicable.\nOmitted - Inapplicable.\nOmitted - Inapplicable.\n31.1\nRule 13a-14(a)/15d-14(a) Certification (pursuant to Section 302 of the Sarbanes-Oxley Act of 2002) executed by the Principal Executive Officer. (filed herewith)\n31.2\nRule 13a-14(a)/15d-14(a) Certification (pursuant to Section 302 of the Sarbanes-Oxley Act of 2002) executed by the Principal Financial Officer. (filed herewith)\n32.1**\nRule 15d-14(b) Certifications (pursuant to Section 906 of the Sarbanes-Oxley Act of 2002) executed by the Principal Executive Officer. (furnished herewith)\n32.2**\nRule 15d-14(b) Certifications (pursuant to Section 906 of the Sarbanes-Oxley Act of 2002) executed by the Principal Financial Officer. (furnished herewith)\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL Document and include in Exhibit 101)\n_________________\n*\nDenotes exhibit that constitutes a management contract, or compensatory plan or arrangement\n**\nThis certification is not deemed filed for purposes of Section 18 of the Securities Exchange Act of 1934, or otherwise subject to the liability of that section. Such certification will not be deemed to be incorporated by reference into any filing under the Securities Act of 1933 or the Securities Exchange Act of 1934, except to the extent that the Company specifically incorporates it by reference\nSIGNATURES\nIn accordance with the requirements of the Exchange Act, the Registrant has caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nSOUTHWEST IOWA RENEWABLE ENERGY, LLC\nDate:\nDecember 9, 2022\n/s/ Michael D. Jerke\nMichael D. Jerke, President and Chief Executive Officer\nDate:\nDecember 9, 2022\n/s/ Ann M. Reis\nAnn M. Reis, Chief Financial Officer and Chief Accounting Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report has been signed below by the following persons on behalf of the Registrant in the capacities and on the dates indicated.\nSignature\nDate\n/s/ Karol D. King\nDecember 9, 2022\nKarol D. King, Chairman of the Board\n/s/ Theodore V. Bauer\nDecember 9, 2022\nTheodore V. Bauer, Director\n/s/ Michael K. Guttau\nDecember 9, 2022\nMichael K. Guttau, Director\n/s/ Jill E. Euken\nDecember 9, 2022\nJill E. Euken, Director\n/s/ Kevin J. Ross December 9, 2022\nKevin J. Ross, Director"
}