{
    "cik": "1424864",
    "company": "Rise Gold Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-10-30",
    "period_of_report": "2023-07-31",
    "sic": "1000",
    "state_of_inc": "NV",
    "state_location": "A1",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1424864/0001062993-23-019828-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1424864/000106299323019828/form10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1424864/0001062993-23-019828.txt",
    "filename": "1424864_10K_2023_0001062993-23-019828.htm",
    "content": "Item 1. Business\nDESCRIPTION OF BUSINESS\nWe are a mineral exploration company that was incorporated in the state of Nevada in 2007. Our primary asset is our interest in the Idaho-Maryland Gold Mine property (the \"I-M Mine Property\"), which is a major past producing high-grade property near Grass Valley, California, United States, which we own outright through our wholly owned Nevada subsidiary, Rise Grass Valley Inc. (\"Rise Grass Valley\").\nOur common stock is currently listed in Canada on the Canadian Securities Exchange (the \"CSE\") under the symbol \"RISE\". We are a reporting issuer in British Columbia, Alberta, and Ontario in Canada. Our common stock is also currently traded in the United States on the OTCQX Market under the symbol \"RYES\". We are an SEC reporting company by virtue of our class of common stock being registered under Section 12(g) of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\").\nBusiness Development\nDevelopments in our Company's business during the July 31, 2023 fiscal year and subsequent to year end, include the following:\nOn September 6, 2023, the Company submitted a Petition to the County of Nevada, California (the \"County\") asserting its vested right to mine at the I-M Mine Property. As demonstrated in the Petition, mining operations on the I-M Mine Property are a vested use, protected under the California and federal Constitutions, and a use permit is not required for mining operations to continue. The Company owns the I-M Mine Property consisting of 175 acres of surface land and a 2,560 acre mineral estate (the \"Vested Mine Property\"), located in the County. Before the I-M Mine Property was consolidated into its current configuration in 1941, it existed as multiple historical mines and operations.\n- 4 -\nFor the vested right to be recognized by the County, the Company needs to demonstrate the fact that mine operations were being conducted both before and immediately after the County first required a permit to mine in 1954. The Petition and its exhibits are replete with historical evidence that mining was conducted at the I-M Mine Property prior to, during, and after 1954, when the County first required a use permit.\nOnce vested, this right to mine endures unless it is abandoned, which has not occurred. Abandonment only occurs if two conditions are met: (1) there is evidence of a property owner's actual intent to abandon the vested mining right; and (2) an overt act (or failure to act) demonstrating such intent. The California Supreme Court has held that a vested mining right is not abandoned merely because the mine has been inactive for periods of time, and the Court has found that cessation of use alone does not constitute abandonment of a mine. The evidence set out in the Petition establishes the various previous owners evidenced their intent to retain the vested right to mine by continuously recording mineral reservations, entering into leases, and making plans for resuming mining in the future, even when mining operations were suspended. There is no evidence that any owner of the I-M Mine Property intended to abandon the vested mining right or took an overt act demonstrating that intent (let alone both). In addition, the vested right was already confirmed in 1980 by the County.\nThe Nevada County Board of Supervisors (\"Board of Supervisors\") will hold a public hearing regarding the Company's Petition on December 13 and 14, 2023. We are subject to the vested rights being confirmed by the County. A decision on the Petition is not discretionary, rather the Board of Supervisors must decide whether to confirm the vested rights by reviewing the historical facts in light of how the California Supreme Court has interpreted the relevant legal principles.\nOn September 26, 2023, the Company announced that it intends to raise up to $500,000 through the issuance of 2,500,000 units at a price of $0.20 per unit. Each unit consists of one share of common stock and one-half of one share purchase warrant. Each whole warrant entitles the holder to acquire one additional share of common stock at an exercise price of $0.30 for a period of two years from the date of issuance. Proceeds from the financing will be for general working capital.\nOn September 26, 2023, the Company granted a total of 397,780 stock options to officers and directors of the Company. The stock options are exercisable at a price of $0.26 per share until September 22, 2028.\nSubsequent to July 31, 2023, the Company appointed Joseph Mullin as President and CEO of the Company as at September 25, 2023. Ben Mossman will continue in his position as a director of the Company and serve as an advisor. The Company also appointed two new directors in Clynton Nauman on September 7, 2023, and Daniel Oliver Jr. on July 10, 2023.\nOn June 5, 2023, the Company sent a letter to the Board of Supervisors that highlights significant irregularities with the May 10 to 11, 2023 Planning Commission Hearing regarding the Company's proposed mining operations at the I-M Mine Property (the \"Idaho-Maryland Mine Project\"). The letter details Brown Act violations, egregious abuses of the Company's constitutionally protected rights to due process, as well as the Planning Commission's noncompliance with the County's ethics training and adopted policies for conducting the business of Board-appointed bodies. To view the full version of the press release, please visit https://www.risegoldcorp.com/news_items.\nOn May 12, 2023, the Company announced the result of the County Planning Commission (the \"Planning Commission\") hearing on the Idaho-Maryland Mine Project. The Planning Commission held a public hearing on May 10 and May 11, 2023 to consider the Final Environmental Impact Report (the \"FEIR\"). At the conclusion of the public hearing the Planning Commission recommended to the Nevada County Board of Supervisors that the FEIR not be certified and that the Use Permit be denied. The remaining milestone in the Use Permit process, including the consideration of the FEIR will take place at a Board of Supervisors public hearing to consider and make a final decision on the Idaho-Maryland Mine Project. A majority vote of the five supervisors is required for approval.\n- 5 -\nIn February 2023, the Company renegotiated its debt agreement with Eridanus Capital LLC, whereby the Company agreed to pay $250,000 to Eridanus to reduce the outstanding balance of the loan and issue 575,000 share purchase warrants to Eridanus. The maturity date of the loan has been extended by one year to September 4, 2024, and the interest rate has been reduced to 15% for a period of 12 months following the date of issuance of the Eridanus warrants. Each warrant entitles the holder to acquire one share of common stock at an exercise price of $0.60 for a period of two years from the date of issuance. The Eridanus warrants and any shares of common stock acquired upon the exercise of the Eridanus warrants will be subject to statutory hold periods in accordance with applicable United States and Canadian securities laws. The fair value of these warrants was calculated to be $154,218, which was netted against the loan payable balance.\nOn February 21, 2023, the Company granted a total of 1,045,000 stock options to employees, officers, directors, and consultants of the Company, exercisable at a weighted average price of $0.53 per share for a period of five years.\nOn February 17, 2023, the Company completed a non-brokered private placement over two tranches for gross proceeds totaling $3,000,000 through the issuance of 7,500,000 units in total at a price of $0.40 per unit, where each unit consisted of one share of common stock and one-half of one share purchase warrant. Each whole warrant entitles the holder to acquire one additional share of common stock at an exercise price of $0.60 until January 31, 2025 and February 17, 2025. Certain directors of the Company purchased an aggregate of 3,870,662 units of the private placement for gross proceeds of $1,548,265. The Company paid fees of $4,014 and issued 10,440 finders warrants, where each finders warrant entitles the holder to acquire one share of common stock at a price of $0.60 until January 31, 2025 and February 17, 2025. The Company paid legal fees of $10,563 in connection with this financing.\nPlan of Operations\nAs at July 31, 2023, the Company had a cash balance of $758,272, compared to a cash balance of $471,918 as of July 31, 2022.\nOur plan of operations for the next 12 months is to complete the vested rights hearings in the County. We are subject to the vested rights being confirmed by the County. If the Board approves the Petition, the next step would be the certification of the Final Environmental Impact Report and approval of the reclamation plan. If the Board denies the Petition, the County will schedule a public hearing with the Board of Supervisors to consider approval of the original Use Permit application.\n- 6 -\nOn September 6, 2023, the Company submitted a Petition to the County asserting its vested right to mine at the I-M Mine Property. As demonstrated in the Petition, mining operations on the I-M Mine Property are a vested use, protected under the California and federal Constitutions, and a use permit is not required for mining operations to continue. The Board of Supervisors will hold a public hearing regarding the Company's Petition on December 13 and 14, 2023.\nThe Company had previously submitted the application for a Use Permit to the County on November 21, 2019. On April 28, 2020, with a vote of 5-0, the Board of Supervisors approved the contract for Raney Planning & Management Inc. (\"Raney\") to prepare an Environmental Impact Report (\"EIR\") and conduct contract planning services on behalf of the County for the proposed Idaho-Maryland Mine Project. On January 4, 2022, the Company announced that the County government released the Draft EIR for the Idaho-Maryland Mine Project. The public comment period ended on April 4, 2022. On December 16, 2022, the Company announced that the County released the FEIR for the Idaho-Maryland Mine Project.\nThe County Planning Commission held a public hearing on May 10 and May 11, 2023 to consider the FEIR. At the conclusion of the public hearing, the Planning Commission recommended to the Board of Supervisors that the FEIR not be certified and that the Use Permit be denied.\nProject Design\nThe Use Permit application proposes underground mining to recommence at an average throughput of 1,000 tons per day. The existing Brunswick Shaft, which extends to ~3400 feet depth below surface, would be used as the primary rock conveyance from the I-M Mine Property. A second service shaft would be constructed by raising from underground to provide for the conveyance of personnel, materials, and equipment. Gold processing would be done by gravity and flotation to produce gravity and flotation gold concentrates. Processing equipment and operations would be fully enclosed in attractive modern buildings and numerous mature trees located on the perimeter of the Brunswick site would be retained to provide visual shielding of aboveground project facilities and operations.\nThe Company would produce barren rock from underground tunnelling and sand tailings as part of the project which would be used for creation of approximately 58 acres of level and useable industrial zoned land for future economic development in the County.\nA water treatment plant and pond, using conventional processes, would ensure that groundwater pumped from the mine is treated to regulatory standards before being discharged to the local waterways.\nDetailed studies by professionals in the fields of civil and electrical engineering, biology, hydrology, cultural resources, traffic, air quality, human health, vibration, and sound have guided the design of the project.\nApproximately 300 employees would be required if the mine reaches full production.\nEmployees\nDuring the year ended July 31, 2023, and until September 23, 2023, the Company had one full-time employee, which was the former Chief Executive Officer and President, who now serves as an advisor to the Company. Our current Chief Executive Officer and President provides services pursuant to a consulting agreement, and other officers and directors provide services to us on an as-needed basis. We plan to rely on their efforts, as well as those of a number of independent consultants, to manage our operations for the foreseeable future.\n- 7 -\nGovernment Regulations\nWe plan to engage in mineral exploration and development activities and will accordingly be exposed to environmental risks associated with mineral exploration activity. We are the operator of the I-M Mine Property.\nOur exploration and development activities will be subject to extensive federal, state and local laws, regulations and permits governing protection of the environment. Among other things, its operations must comply with the provisions of the Federal Mine Safety and Health Act of 1977 as administered by the United States Department of Labor.\nOur plan is to conduct our operations in a way that safeguards public health and the environment. We believe that our operations comply with applicable environmental laws and regulations in all material respects.\nThe costs associated with implementing and complying with environmental requirements can be substantial and possible future legislation and regulations could cause us to incur additional operating expenses, capital expenditures, restrictions and delays in developing or conducting operations on its properties, including the I-M Mine Property, the extent of which cannot be predicted with any certainty. Item 1A. Risk Factors\nRisks Related to Our Business\nIncreased levels of volatility or a rapid destabilization of global economic conditions could have a material adverse effect on our operations and financial condition.\nIn recent years, global financial conditions have been characterized by increased volatility which has impacted many industries, including the mining industry. Global financial conditions are subject to sudden and rapid destabilization in response to current and future events, as governmental authorities may have limited resources to respond to such events. Global capital markets continue to experience increased volatility in response to global events such as the significant increase in the rate of inflation in recent years, and the effects of certain countermeasures taken by central banks including increased interest rates. Future economic crises may be precipitated by any number of causes, including natural disasters, epidemics (such as the COVID-19 virus pandemic), geopolitical instability and war (such as the Russian invasion of Ukraine and the current escalating Israel-Palestine conflict), the failure of financial institutions, terrorism, material changes in the price of oil, the volatility of metal prices, and the volatility of global financial markets. Continued increased levels of volatility or a sudden or rapid destabilization of global economic conditions could negatively impact our ability to obtain equity or debt financing or to make other suitable arrangements to finance our Idaho-Maryland Mine Project which, in turn, could have a material adverse effect on our operations and financial condition.\nOur ability to continue to operate as a going concern depends on our ability to obtain adequate financing in the future.\nThe ability of the Company to continue as a going concern is dependent on the Company's ability to maintain continued support from its shareholders and creditors and to raise additional capital and implement its business plan.\n- 8 -\nThere is no assurance that the Company will be able to obtain adequate financing in the future or that such financing will be on terms advantageous to the Company. However, management believes that the Company can raise sufficient working capital to meet its projected minimum financial obligations for the next fiscal year. The accompanying financial statements have been prepared under the assumption that we will continue as a going concern. We are an exploration stage company and we have incurred losses since our inception.\nWe will require significant additional capital to fund our business plan.\nWe will be required to expend significant funds to determine whether proven and probable mineral reserves exist at our properties, to continue exploration and, if warranted, to develop our existing properties, and to identify and acquire additional properties to diversify our property portfolio. We anticipate that we will be required to make substantial capital expenditures for the continued exploration and, if warranted, development of our I-M Mine Property. We have spent and will be required to continue to expend significant amounts of capital for drilling, geological, and geochemical analysis, assaying, permitting, and feasibility studies with regard to the results of our exploration at our I-M Mine Property. We may not benefit from some of these investments if we are unable to identify commercially exploitable mineral reserves.\nOur ability to obtain necessary funding for these purposes, in turn, depends upon a number of factors, including the status of the national and worldwide economy and the price of metals. Capital markets worldwide were adversely affected by substantial losses by financial institutions, caused by investments in asset-backed securities and remnants from those losses continue to impact the ability for us to raise capital. We may not be successful in obtaining the required financing or, if we can obtain such financing, such financing may not be on terms that are favorable to us.\nOur inability to access sufficient capital for our operations could have a material adverse effect on our financial condition, results of operations, or prospects. Sales of substantial amounts of securities may have a highly dilutive effect on our ownership or share structure. Sales of a large number of shares of our common stock in the public markets, or the potential for such sales, could decrease the trading price of those shares and could impair our ability to raise capital through future sales of common stock. We have not yet commenced commercial production at any of our properties and, therefore, have not generated positive cash flows to date and have no reasonable prospects of doing so unless successful commercial production can be achieved at our I-M Mine Property. We expect to continue to incur negative investing and operating cash flows until such time as we enter into successful commercial production. This will require us to deploy our working capital to fund such negative cash flow and to seek additional sources of financing. There is no assurance that any such financing sources will be available or sufficient to meet our requirements. There is no assurance that we will be able to continue to raise equity capital or to secure additional debt financing, or that we will not continue to incur losses.\nWe have a limited operating history on which to base an evaluation of our business and prospects.\nSince our inception, we have had no revenue from operations. We have no history of producing products from any of our properties. Our Idaho-Maryland Mine Project is a historic, past-producing mine which, apart from the exploration work that we have completed since 2016, has had very little recent exploration work since 1956. We would require further exploration work in order to reach the development stage. Advancing our I-M Mine Property into the development stage will require significant capital and time, and successful commercial production from the I-M Mine Property will be subject to completing feasibility studies, permitting and re-commissioning of the mine, constructing processing plants, and other related works and infrastructure. As a result, we are subject to all of the risks associated with developing and establishing new mining operations and business enterprises including:\n- 9 -\ncompletion of feasibility studies to verify reserves and commercial viability, including the ability to find sufficient ore reserves to support a commercial mining operation;\nthe timing and cost, which can be considerable, of further exploration, preparing feasibility studies, permitting and construction of infrastructure, mining and processing facilities;\nthe availability and costs of drill equipment, exploration personnel, skilled labor, and mining and processing equipment, if required;\nthe availability and cost of appropriate smelting and/or refining arrangements, if required;\ncompliance with stringent environmental and other governmental approval and permit requirements;\nthe availability of funds to finance exploration, development, and construction activities, as warranted;\npotential opposition from non-governmental organizations, local groups or local inhabitants that may delay or prevent development activities;\npotential increases in exploration, construction, and operating costs due to changes in the cost of fuel, power, materials, and supplies; and\npotential shortages of mineral processing, construction, and other facilities related supplies.\nThe costs, timing, and complexities of exploration, development, and construction activities may be increased by the location of our properties and demand by other mineral exploration and mining companies. It is common in exploration programs to experience unexpected problems and delays during drill programs and, if commenced, development, construction, and mine start-up. In addition, our management and workforce will need to be expanded, and sufficient support systems for our workforce will have to be established. This could result in delays in the commencement of mineral production and increased costs of production. Accordingly, our activities may not result in profitable mining operations, and we may not succeed in establishing mining operations or profitably producing metals at any of our current or future properties, including our I-M Mine Property.\nWe have a history of losses and expect to continue to incur losses in the future.\nWe have incurred losses since inception, have had negative cash flow from operating activities, and expect to continue to incur losses in the future. We have incurred the following losses from operations during each of the following periods:\n$3,660,382 for the year ended July 31, 2023\n$3,464,127 for the year ended July 31, 2022\n$1,603,878 for the year ended July 31, 2021\nWe expect to continue to incur losses unless and until such time as one of our properties enters into commercial production and generates sufficient revenues to fund continuing operations. We recognize that if we are unable to generate significant revenues from mining operations and/or dispositions of our properties, we will not be able to earn profits or continue operations. At this early stage of our operation, we also expect to face the risks, uncertainties, expenses, and difficulties frequently encountered by companies at the start-up stage of their business development. We cannot be sure that we will be successful in addressing these risks and uncertainties and our failure to do so could have a materially adverse effect on our financial condition.\n- 10 -\nDamage to our reputation could adversely affect our company's operations and financial condition.\nOur relationship with the communities where we operate is critical to ensure the future success of our existing operations and the construction and development of our I-M Mine Property. Reputational damage can be the result of the actual or perceived occurrence of any number of events, and could include any negative publicity, whether true or not. There is an increasing level of public concern relating to the perceived effect of mining activities on the environment and on communities impacted by such activities. Certain individuals and groups who oppose resource development can often be vocal critics of the mining industry and its practices, including the use of hazardous substances in processing activities and effects on the environment. The increased use of social media and other web-based tools used to generate, publish and discuss user-generated content and to connect with other users has made it increasingly easier for such individuals and groups to communicate and share their opinions and views regarding our company and our activities. Adverse publicity generated by such persons related to extractive industries generally, or our operations or development activities specifically, could have an adverse effect on our reputation. Reputation loss, including reputation loss by other similar mining companies, may result in decreased investor confidence, increased challenges in developing and maintaining community and stakeholder relations and an impediment to our overall ability to advance our I-M Mine Property (including our ability to obtain permits), which could have a material adverse impact on our results of operations, financial condition and prospects. While we are committed to operating in a socially responsible manner, there is no guarantee that our efforts in this respect will mitigate this potential risk. We do not ultimately have direct control over how we are perceived by others and reputational damage could adversely affect our operations and financial condition.\nIncreasing attention to environmental, social, and governance (ESG) matters may impact our business.\nIncreasing attention to ESG matters, including those related to climate change and sustainability, and increasing societal, investor and legislative pressure on companies to address ESG matters may result in increased costs, increased investigations and litigation or threats thereof, negative impacts on our stock price and access to capital markets, and damage to our reputation. Increasing attention to climate change, for example, may result in additional governmental investigations and private litigation, or threats thereof, against our company. In addition, some organizations that provide information to investors on corporate governance and related matters have developed ratings processes for evaluating companies on their approach to ESG matters, including climate change and climate-related risks. Such ratings are used by some investors to inform their investment and voting decisions. Unfavorable ESG ratings may lead to negative investor sentiment toward our company and to the diversion of investment to other industries, which could have a negative impact on our stock price and our access to and costs of capital. Additionally, evolving expectations on various ESG matters, including biodiversity, waste, and water, may increase costs, require changes in how we operate and lead to negative stakeholder sentiment.\nRisks Related to Mining and Exploration\nThe I-M Mine Property is in the exploration stage. There is no assurance that we can establish the existence of any mineral reserve on the I-M Mine Property or any other properties we may acquire in commercially exploitable quantities. Unless and until we do so, we cannot earn any revenues from these properties and if we do not do so we will lose all of the funds that we expend on exploration. If we do not establish the existence of any mineral reserve in a commercially exploitable quantity, the exploration component of our business could fail.\nWe have not established that any of our mineral properties contain any mineral reserve according to recognized reserve guidelines, nor can there be any assurance that we will be able to do so.\n- 11 -\nA mineral reserve is defined in subpart 1300 of Regulation S-K under the Securities Act of 1933, as amended (the \"Securities Act\") and the Exchange Act (\"Subpart 1300\") as an estimate of tonnage and grade or quality of \"indicated mineral resources\" and \"measured mineral resources\" (as those terms are defined in Subpart 1300) that, in the opinion of a \"qualified person\" (as defined in Subpart 1300), can be the basis of an economically viable project. In general, the probability of any individual prospect having a \"reserve\" that meets the requirements of Subpart 1300 is small, and our mineral properties may not contain any \"reserves\" and any funds that we spend on exploration could be lost. Even if we do eventually discover a mineral reserve on one or more of our properties, there can be no assurance that they can be developed into producing mines and that we can extract those minerals. Both mineral exploration and development involve a high degree of risk, and few mineral properties that are explored are ultimately developed into producing mines.\nThe commercial viability of an established mineral deposit will depend on a number of factors including, by way of example, the size, grade, and other attributes of the mineral deposit, the proximity of the mineral deposit to infrastructure such as processing facilities, roads, rail, power, and a point for shipping, government regulation, and market prices. Most of these factors will be beyond our control, and any of them could increase costs and make extraction of any identified mineral deposit unprofitable.\nThe nature of mineral exploration and production activities involves a high degree of risk and the possibility of uninsured losses.\nExploration for and the production of minerals is highly speculative and involves greater risk than many other businesses. Most exploration programs do not result in mineralization that may be of sufficient quantity or quality to be profitably mined. Our operations are, and any future development or mining operations we may conduct will be, subject to all of the operating hazards and risks normally incidental to exploring for and development of mineral properties, such as, but not limited to:\neconomically insufficient mineralized material;\nfluctuation in production costs that make mining uneconomical;\nlabor disputes;\nunanticipated variations in grade and other geologic problems;\nenvironmental hazards;\nwater conditions;\ndifficult surface or underground conditions;\nindustrial accidents;\nmetallurgic and other processing problems;\nmechanical and equipment performance problems;\nfailure of dams, stockpiles, wastewater transportation systems, or impoundments;\nunusual or unexpected rock formations; and\npersonal injury, fire, flooding, cave-ins and landslides.\nAny of these risks can materially and adversely affect, among other things, the development of properties, production quantities and rates, costs and expenditures, potential revenues, and production dates. If we were to determine that capitalized costs associated with any of our mineral interests are not likely to be recovered, we would incur a write-down of our investment in these interests. All of these factors may result in losses in relation to amounts spent that are not recoverable, or that result in additional expenses.\n- 12 -\nCommodity price volatility could have dramatic effects on the results of operations and our ability to execute our business plan.\nThe price of commodities varies daily. Our future revenues, if any, will likely be derived from the extraction and sale of base and precious metals. The price of those commodities has fluctuated widely, particularly in recent years, and is affected by numerous factors beyond our control, including economic and political trends, expectations of inflation, currency exchange fluctuations, interest rates, global and regional consumptive patterns, speculative activities and increased production due to new extraction developments and improved extraction and production methods. The effect of these factors on the price of base and precious metals, and therefore the economic viability of our business, could negatively affect our ability to secure financing or our results of operations.\nEstimates of mineralized material and resources are subject to evaluation uncertainties that could result in project failure.\nOur exploration and future mining operations, if any, are and would be faced with risks associated with being able to accurately predict the quantity and quality of mineralized material and resources/reserves within the earth using statistical sampling techniques. Estimates of any mineralized material or resource/reserve on any of our properties would be made using samples obtained from appropriately placed trenches, test pits, underground workings, and intelligently designed drilling. There is an inherent variability of assays between check and duplicate samples taken adjacent to each other and between sampling points that cannot be reasonably eliminated. Additionally, there also may be unknown geologic details that have not been identified or correctly appreciated at the current level of accumulated knowledge about our properties. This could result in uncertainties that cannot be reasonably eliminated from the process of estimating mineralized material and resources/reserves. If these estimates were to prove to be unreliable, we could implement an exploitation plan that may not lead to commercially viable operations in the future.\nAny material changes in mineral resource/reserve estimates and grades of mineralization will affect the economic viability of placing a property into production and a property's return on capital.\nAs we have not completed feasibility studies on our I-M Mine Property and have not commenced actual production, we do not have mineral resources and any estimates may require adjustments or downward revisions. In addition, the grade of ore ultimately mined, if any, may differ from that indicated by future feasibility studies and drill results. Minerals recovered in small scale tests might not be duplicated in large scale tests under on-site conditions or in production scale.\nOur exploration activities on our properties may not be commercially successful, which could lead us to abandon our plans to develop our properties and our investments in exploration.\nOur long-term success depends on our ability to identify mineral deposits on our I-M Mine Property and other properties we may acquire, if any, that we can then develop into commercially viable mining operations. Mineral exploration is highly speculative in nature, involves many risks, and is frequently non-productive. These risks include unusual or unexpected geologic formations, and the inability to obtain suitable or adequate machinery, equipment, or labor. The success of commodity exploration is determined in part by the following factors:\nthe identification of potential mineralization;\navailability of government-granted exploration permits;\nthe quality of our management and our geological and technical expertise; and\nthe capital available for exploration and development work.\n- 13 -\nSubstantial expenditures are required to establish proven and probable reserves through drilling and analysis, to develop metallurgical processes to extract metal, and to develop the mining and processing facilities and infrastructure at any site chosen for mining. Whether a mineral deposit will be commercially viable depends on a number of factors that include, without limitation, the particular attributes of the deposit, such as size, grade, and proximity to infrastructure; commodity prices; and government regulations, including, without limitation, regulations relating to prices, taxes, royalties, land tenure, land use, importing and exporting of minerals, and environmental protection. We may invest significant capital and resources in exploration activities and may find it necessary to abandon such investments if we are unable to identify commercially exploitable mineral reserves. The decision to abandon a project may have an adverse effect on the market value of our securities and the ability to raise future financing.\nWe are subject to significant governmental regulations that affect our operations and costs of conducting our business and may not be able to obtain all required permits and licenses to place our properties into production.\nMining operations on the I-M Mine Property are a vested use, protected under the California and federal Constitutions, and a use permit is not required for mining operations to continue. The Company owns the I-M Mine Property, consisting of 175 acres of surface land and a 2,560 acre mineral estate, located in the County. Before the I-M Mine Property was consolidated into its current configuration in 1941, it existed as multiple historical mines and operations.\nFor the vested right to be recognized by the County, the Company needs to demonstrate the fact that mine operations were being conducted both before and immediately after the County first required a permit to mine in 1954. The Petition and its exhibits are replete with historical evidence that mining was conducted at the I-M Mine Property prior to, during, and after 1954, when the County first required a use permit.\nOnce vested, this right to mine endures unless it is abandoned, which has not occurred. Abandonment only occurs if two conditions are met: (1) there is evidence of a property owner's actual intent to abandon the vested mining right; and (2) an overt act (or failure to act) demonstrating such intent. The California Supreme Court has held that a vested mining right is not abandoned merely because the mine has been inactive for periods of time, and the Court has found that cessation of use alone does not constitute abandonment of a mine. The evidence set out in the Petition establishes the various previous owners evidenced their intent to retain the vested right to mine by continuously recording mineral reservations, entering into leases, and making plans for resuming mining in the future, even when mining operations were suspended. There is no evidence that any owner of the I-M Mine Property intended to abandon the vested mining right or took an overt act demonstrating that intent (let alone both). We are subject to the vested rights being confirmed by the County. On September 6, 2023, the Company submitted a Petition to the County asserting its vested right to mine at the I-M Mine Property. The Board of Supervisors will hold a public hearing regarding the Company's Petition on December 13 and 14, 2023.\nAs previously applied by the Company, under the Use Permit process, the Company's operations, including exploration and, if warranted, development of the I-M Mine Property, require permits from governmental authorities and will be governed by laws and regulations, including:\nlaws and regulations governing mineral concession acquisition, prospecting, development, mining, and production;\nlaws and regulations related to exports, taxes, and fees;\nlabor standards and regulations related to occupational health and mine safety; and\nenvironmental standards and regulations related to waste disposal, toxic substances, land use reclamation, and environmental protection.\n- 14 -\nCompanies engaged in exploration activities often experience increased costs and delays in production and other schedules as a result of the need to comply with applicable laws, regulations, and permits. Failure to comply with applicable laws, regulations, and permits may result in enforcement actions, including the forfeiture of mineral claims or other mineral tenures, orders issued by regulatory or judicial authorities requiring operations to cease or be curtailed, and may include corrective measures requiring capital expenditures, installation of additional equipment, or costly remedial actions. We cannot predict if all permits that we may require for continued exploration, development, or construction of mining facilities and conduct of mining operations will be obtainable on reasonable terms, if at all. Costs related to applying for and obtaining permits and licenses may be prohibitive and could delay our planned exploration and development activities. We may be required to compensate those suffering loss or damage by reason of our mineral exploration or our mining activities, if any, and may have civil or criminal fines or penalties imposed for violations of, or our failure to comply with, such laws, regulations, and permits.\nExisting and possible future laws, regulations, and permits governing operations and activities of exploration companies, or more stringent implementation of such laws, regulations and permits, could have a material adverse impact on our business and cause increases in capital expenditures or require abandonment or delays in exploration. Our I-M Mine Property is located in California, which has numerous clearly defined regulations with respect to permitting mines, which could potentially impact the total time to market for the project.\nSubsurface mining is allowed in the County M1 Zoning District, where the I-M Mine Property is located, with approval of a \"Use Permit\". Approval of a Use Permit for mining operations requires a public hearing before the County Planning Commission, whose decision may be appealed to the Board of Supervisors. Use Permit approvals include conditions of approval, which are designed to minimize the impact of conditional uses on neighboring properties.\nOn November 21, 2019, the Company submitted an application for a Use Permit to the County. On April 28, 2020, with a vote of 5-0, the Board of Supervisors approved the contract for Raney to prepare an EIR and conduct contract planning services on behalf of the County for the proposed Idaho-Maryland Mine Project. The Planning Commission held a public hearing on May 10 and May 11, 2023 to consider the FEIR. At the conclusion of the public hearing, the Planning Commission recommended to the Board of Supervisors that the FEIR not be certified and that the Use Permit be denied.\nThe Use Permit application proposes underground mining to recommence at the I-M Mine Property at an average throughput of 1,000 tons per day. The existing Brunswick Shaft, which extends to ~3400 feet depth below surface, would be used as the primary rock conveyance from the I-M Mine Property. A second service shaft would be constructed by raising from underground to provide for the conveyance of personnel, materials, and equipment. Processing would be done by gravity and flotation to produce gravity and flotation gold concentrates.\nWe propose to produce barren rock from underground tunneling and sand tailings as part of the project which would be used for creation of approximately 58 acres of level and useable industrial zoned land for future economic development in the County. A water treatment plant and pond, using conventional processes, would ensure that groundwater pumped from the mine is treated to regulatory standards before being discharged to the local waterways. There is no assurance our Use Permit application will be accepted as submitted. If substantial revisions are required, our ability to execute our business plan will be further delayed.\n- 15 -\nIn 1975, the California Legislature enacted the Surface Mining and Reclamation Act (\"SMARA\"), which required that all surface mining operations in California have approved reclamation plans and financial assurances. SMARA was adopted to ensure that land used for mining operations in California would be reclaimed post-mining to a useable condition. Pursuant to SMARA, we would be required to obtain approval of a Reclamation Plan from and provide financial assurances to the County for any surface component of the underground mining operation before mining operations could commence. Approval of a Reclamation Plan will require a public hearing before the Planning Commission.\nTo approve a Reclamation Plan and Use Permit, the County would need to satisfy the requirements of California Environmental Quality Act (\"CEQA\"). CEQA requires that public agency decision makers study the environmental impacts of any discretionary action, disclose the impacts to the public, and minimize unavoidable impacts to the extent feasible. CEQA is triggered whenever a California governmental agency is asked to approve a \"discretionary project\". The approval of a Reclamation Plan is a \"discretionary project\" under CEQA. Other necessary ancillary permits like the California Department of Fish and Wildlife (\"CDFW\") Streambed Alteration Agreement (if applicable) also triggers CEQA compliance.\nIn this situation, the lead agency for the purposes of CEQA would be the County. Other public agencies in charge of administering specific legislation will also need to approve aspects of the Project, such as the CDFW (the California Endangered Species Act), the Air Pollution Control District (Authority to Construct and Permit to Operate), and the Regional Water Quality Control Board (National Pollutant Discharge Elimination System (authorized to state governments by the US Environmental Protection Agency) and Report of Waste Discharge). However, CEQA's Guidelines provide that if more than one agency must act on a project, the agency that acts first is generally considered the lead agency under CEQA. All other agencies are considered \"responsible agencies.\" Responsible agencies do need to consider the environmental document approved by the lead agency, but they will usually accept the lead agency's document and use it as the basis for issuing their own permits. There is no assurance that other agencies will not require additional assessments in their decision-making process. If such assessments are required, additional time and costs will delay the execution of, and may even require us to re-evaluate the feasibility of, our business plan.\nOur activities are subject to environmental laws and regulations that may increase our costs of doing business and restrict our operations.\nAll phases of our operations are subject to environmental regulation in the jurisdictions in which we operate. Environmental legislation is evolving in a manner that may require stricter standards and enforcement, increased fines and penalties for non-compliance, more stringent environmental assessments of proposed projects, and a heightened degree of responsibility for companies and their officers, directors, and employees. These laws address emissions into the air, discharges into water, management of waste, management of hazardous substances, protection of natural resources, antiquities and endangered species, and reclamation of lands disturbed by mining operations. Compliance with environmental laws and regulations, and future changes in these laws and regulations, may require significant capital outlays and may cause material changes or delays in our operations and future activities. It is possible that future changes in these laws or regulations could have a significant adverse impact on our properties or some portion of our business, causing us to re-evaluate those activities at that time.\n- 16 -\nRegulations and pending legislation governing issues involving climate change and our obligation to monitor and report on how our operations may impact climate change could result in increased operating costs, which could have a material adverse effect on our business.\nA number of governments or governmental bodies have introduced or are contemplating legislative and/or regulatory changes in response to concerns about the potential impact of climate change. Legislation and increased regulation regarding climate change could impose significant costs on us, on our future venture partners, if any, and on our suppliers, including costs related to increased energy requirements, capital equipment, environmental monitoring and reporting, and other costs necessary to comply with such regulations. Many governments and other stakeholders are seeking enhanced disclosure and are moving to enact climate change legislation and treaties at the international, national, state, provincial and local levels. In the United States, the U.S. Securities and Exchange Commission (the \"SEC\") has proposed climate-related disclosure rules: \"The Enhancement and Standardization of Climate-Related Disclosures for Investors\". In Canada, the Canadian Securities Administrators have proposed their own climate-related disclosure rules in National Instrument 51-107 - Disclosure of Climate-related Matters. The International Sustainability Standards Board has two proposed international standards for disclosure (\"General Requirements for Disclosure of Sustainability Related Information\" and \"Climate Related Disclosures\") which were developed to provide a global baseline of financial reporting disclosure rules for reporting environmental, social and governance (ESG) related issues. Any adopted future climate change regulations and our obligations to report on them could also negatively impact our ability to compete with companies situated in areas not subject to such limitations. Given the emotional and political significance and uncertainty surrounding the impact of climate change and how it should be dealt with, we cannot predict how legislation and regulation will ultimately affect our financial condition, operating performance, and ability to compete. Furthermore, even without such regulation, increased awareness and any adverse publicity in the global marketplace about potential impacts on climate change by us or other companies in our industry could harm our reputation. The potential physical impacts of climate change on our operations are highly uncertain, could be particular to the geographic circumstances in areas in which we operate and may include changes in rainfall and storm patterns and intensities, water shortages, changing sea levels, and changing temperatures. Extreme weather events, such as forest fires, severe storms, floods, drought or more extreme temperatures, all of which may be more frequent and more extreme due to climate change, may affect our operations. Our operations could be adversely affected in various ways, including through damage to our facilities or from increased costs for insurance. Such extreme weather events can also lead to community evacuations, temporary labour shortages, and delays in receiving critical supplies. Water will be a key resource for our operations and inadequate water management and stewardship could have a material adverse effect on our company and our operations. While certain aspects relating to water management are within our ability to control, extreme weather events, resulting in too much or too little water, can negatively impact our water management practices. The effects of climate change may adversely impact the cost, production, and financial performance of our operations.\nLand reclamation requirements for our properties may be burdensome and expensive.\nAlthough variable depending on location and the governing authority, land reclamation requirements are generally imposed on mineral exploration companies (as well as companies with mining operations) in order to minimize long term effects of land disturbance.\nReclamation may include requirements to:\ncontrol dispersion of potentially deleterious effluents;\ntreat ground and surface water to drinking water standards; and\nreasonably re-establish pre-disturbance landforms and vegetation.\n- 17 -\nIn order to carry out reclamation obligations imposed on us in connection with our potential development activities, we must allocate financial resources that might otherwise be spent on further exploration and development programs. We plan to set up a provision for our reclamation obligations on our properties, as appropriate, but this provision may not be adequate. If we are required to carry out unanticipated reclamation work, our financial position could be adversely affected.\nWe face intense competition in the mining industry.\nThe mining industry is intensely competitive in all of its phases. As a result of this competition, some of which is with large established mining companies with substantial capabilities and with greater financial and technical resources than ours, we may be unable to acquire additional properties, if any, or financing on terms we consider acceptable. We also compete with other mining companies in the recruitment and retention of qualified managerial and technical employees. If we are unable to successfully compete for qualified employees, our exploration and development programs may be slowed down or suspended. We compete with other companies that produce our planned commercial products for capital. If we are unable to raise sufficient capital, our exploration and development programs may be jeopardized or we may not be able to acquire, develop, or operate additional mining projects.\nA shortage of equipment and supplies could adversely affect our ability to operate our business.\nWe are dependent on various supplies and equipment to carry out our mining exploration and, if warranted, development operations. Any shortage of such supplies, equipment, and parts could have a material adverse effect on our ability to carry out our operations and could therefore limit, or increase the cost of, production.\nJoint ventures and other partnerships, including offtake arrangements, may expose us to risks.\nWe may enter into joint ventures, partnership arrangements, or offtake agreements, with other parties in relation to the exploration, development, and production of the properties in which we have an interest. Any failure of such other companies to meet their obligations to us or to third parties, or any disputes with respect to the parties' respective rights and obligations, could have a material adverse effect on us, the development and production at our properties, including the I-M Mine Property, and on future joint ventures, if any, or their properties, and therefore could have a material adverse effect on our results of operations, financial performance, cash flows and the price of our common stock.\nWe may experience difficulty attracting and retaining qualified management to meet the needs of our anticipated growth, and the failure to manage our growth effectively could have a material adverse effect on our business and financial condition.\nWe are dependent on a relatively small number of key employees, including our Chief Executive Officer and Chief Financial Officer. The loss of any officer could have an adverse effect on us. We have no life insurance on any individual, and we may be unable to hire a suitable replacement for them on favorable terms, should that become necessary.\nOur results of operations could be affected by currency fluctuations.\nOur properties are currently all located in the United States, and, while most costs associated with these properties are paid in U.S. dollars, a significant amount of our administrative expenses are payable in Canadian dollars. There can be significant swings in the exchange rate between the U.S. dollar and the Canadian dollar. There are no plans at this time to hedge against any exchange rate fluctuations in currencies.\n- 18 -\nTitle to our properties may be subject to other claims that could affect our property rights and claims.\nThere are risks that title to our properties may be challenged or impugned. Our I-M Mine Property is located in California and may be subject to prior unrecorded agreements or transfers and title may be affected by undetected defects.\nWe may be unable to secure surface access or purchase required surface rights.\nAlthough we obtain the rights to some or all of the minerals in the ground subject to the mineral tenures that we acquire, or have the right to acquire, in some cases we may not acquire any rights to, or ownership of, the surface to the areas covered by such mineral tenures. In such cases, applicable mining laws usually provide for rights of access to the surface for the purpose of carrying on mining activities; however, the enforcement of such rights through the courts can be costly and time consuming. It is necessary to negotiate surface access or to purchase the surface rights if long-term access is required. There can be no guarantee that, despite having the right at law to carry on mining activities, we will be able to negotiate satisfactory agreements with any such existing landowners/occupiers for such access or purchase of such surface rights, and therefore we may be unable to carry out planned mining activities. In addition, in circumstances where such access is denied, or no agreement can be reached, we may need to rely on the assistance of local officials or the courts in such jurisdiction the outcomes of which cannot be predicted with any certainty. Our inability to secure surface access or purchase required surface rights could materially and adversely affect our timing, cost, or overall ability to develop any mineral deposits we may locate.\nOur properties and operations may be subject to litigation or other claims.\nFrom time to time our properties or operations may be subject to disputes that may result in litigation or other legal claims. We may be required to take countermeasures or defend against these claims, which will divert resources and management time from operations. The costs of these claims or adverse filings may have a material effect on our business and results of operations.\nWe do not currently insure against all the risks and hazards of mineral exploration, development, and mining operations.\nExploration, development, and mining operations involve various hazards, including environmental hazards, industrial accidents, metallurgical and other processing problems, unusual or unexpected rock formations, structural cave-ins or slides, flooding, fires, and periodic interruptions due to inclement or hazardous weather conditions. These risks could result in damage to or destruction of mineral properties, facilities, or other property, personal injury, environmental damage, delays in operations, increased cost of operations, monetary losses, and possible legal liability. We may not be able to obtain insurance to cover these risks at economically feasible premiums or at all. We may elect not to insure where premium costs are disproportionate to our perception of the relevant risks. The payment of such insurance premiums and of such liabilities would reduce the funds available for exploration and production activities.\n- 19 -\nRisks Related to Our Common Stock\nOur share price may be volatile and as a result you could lose all or part of your investment.\nIn addition to volatility associated with equity securities in general, the value of your investment could decline due to the impact of any of the following factors upon the market price of our common stock:\nDisappointing results from our exploration efforts;\nDecline in demand for our common stock;\nDownward revisions in securities analysts' estimates or changes in general market conditions;\nTechnological innovations by competitors or in competing technologies;\nInvestor perception of our industry or our prospects; and\nGeneral economic trends.\nOur share price on the CSE and the OTCQX has experienced significant price and volume fluctuations. Stock markets in general have experienced extreme price and volume fluctuations, and the market prices of securities have been highly volatile. These fluctuations are often unrelated to operating performance and may adversely affect the market price of the Shares. As a result, you may be unable to sell any Shares you acquire at a desired price.\nWe have never paid dividends on our common stock.\nWe have not paid dividends on our common stock to date, and we do not expect to pay dividends for the foreseeable future. We intend to retain our initial earnings, if any, to finance our operations. Any future dividends on common stock will depend upon our earnings, our then-existing financial requirements, and other factors, and will be at the discretion of the Board.\nInvestors' interests in our company will be diluted and investors may suffer dilution in their net book value per share of common stock if we issue additional employee/director/consultant options or if we sell additional common stock and/or warrants to finance our operations.\nIn order to further expand our operations and meet our objectives, any additional growth and/or expanded exploration activity will likely need to be financed through sale of and issuance of additional common stock, including, but not limited to, raising funds to explore the I-M Mine Property. Furthermore, to finance any acquisition activity, should that activity be properly approved, and depending on the outcome of our exploration programs, we likely will also need to issue additional common stock to finance future acquisitions, growth, and/or additional exploration programs of any or all of our projects or to acquire additional properties. We will also in the future grant to some or all of our directors, officers, and key employees and/or consultants options to purchase common stock as non-cash incentives. The issuance of any equity securities could, and the issuance of any additional common stock will, cause our existing stockholders to experience dilution of their ownership interests.\nIf we issue additional common stock or decide to enter into joint ventures with other parties in order to raise financing through the sale of equity securities, investors' interests in our company will be diluted and investors may suffer dilution in their net book value per share of common stock depending on the price at which such securities are sold.\n- 20 -\nThe issuance of additional shares of common stock may negatively impact the trading price of our securities.\nWe have issued common stock in the past and will continue to issue common stock to finance our activities in the future. In addition, newly issued or outstanding options, warrants, and broker warrants to purchase common stock may be exercised, resulting in the issuance of additional common stock. Any such issuance of additional common stock would result in dilution to our stockholders, and even the perception that such an issuance may occur could have a negative impact on the trading price of the common stock.\nWe are subject to the continued listing criteria of the CSE, and our failure to satisfy these criteria may result in delisting of our common stock from the CSE.\nOur common stock is currently listed for trading on the CSE. In order to maintain the listing on the CSE or any other securities exchange we may trade on, we must maintain certain financial and share distribution targets, including maintaining a minimum number of public shareholders. In addition to objective standards, these exchanges may delist the securities of any issuer if, in the exchange's opinion, our financial condition and/or operating results appear unsatisfactory; if it appears that the extent of public distribution or the aggregate market value of the security has become so reduced as to make continued listing inadvisable; if we sell or dispose of our principal operating assets or cease to be an operating company; if we fail to comply with the listing requirements; or if any other event occurs or any condition exists which, in their opinion, makes continued listing on the exchange inadvisable.\nIf the CSE or any other exchange or market were to delist the common stock, investors may face material adverse consequences, including, but not limited to, a lack of trading market for the common stock, reduced liquidity, decreased analyst coverage, and/or an inability for us to obtain additional financing to fund our operations. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nSelective Glossary of Technical Terms\naccretion - Process by which material is added to a tectonic plate or landmass. This material may be sediment, volcanic arcs, seamounts or other igneous features.\nalbite - A kind of plagioclase mineral within the feldspar group with formula NaAlSi3O8. Its colour is white to grey.\namphibolite - A gneiss or schist largely made up of amphibole and plagioclase minerals.\nankerite - A calcium, iron, magnesium, manganese carbonate mineral of the group of rhombohedral carbonates.\narsenic - Chemical element with the symbol As and occurs in many minerals, usually in combination with sulfur and metals, but also as a pure elemental crystal.\ncarbonate - Class of sedimentary rocks composed primarily of carbonate minerals; the two major types are limestone and dolomite.\nchalcopyrite - A sulphide mineral of copper common in the zone of secondary enrichment.\n- 21 -\nchlorite - Group name for about 10 related minerals and a member of the mica group of minerals. Chlorite is very common and is often an uninteresting green mineral coating the surface of more important minerals.\nen-echelon - Roughly parallel but staggered structures.\nepizonal - Depth of formation of an orogenic deposit (<6 km / <3.7 mi).\nfacies - The characteristics of a rock unit that reflect its environment of deposition and allow it to be distinguished from rock deposited in an adjacent environment.\nfoliation - Repetitive layering in metamorphic rocks; the thickness of the layers can vary.\nfootwall - The rock on the underside of a vein or mineralized structure.\nfree gold - Gold, uncombined with other minerals, found in a pure state.\nfree milling - Mineralized material of gold from which the precious metals can be recovered by concentrating methods without resorting to pressure leaching or other chemical treatment.\ngabbro - A dark, coarse-grained igneous rock.\ngalena - Lead sulphide, the most common form of lead.\ngangue - The worthless minerals in an mineralized deposit.\ngreenschist - Metamorphic rocks that formed under the lowest temperatures and pressures usually produced by regional metamorphism, typically 300-450 °C (570-840 °F) and 2-10 kilobars (14,500-58,000 psi).\nhanging wall - The rock on the upper side of an inclined vein or mineralized deposit.\nhydrothermal - Relating to hot fluids circulating in the earth's crust.\nhydrothermal gold deposit - During the reaction between mineral-bearing hydrothermal fluids and wall-rocks, some elements are concentrated in specific locations to form hydrothermal gold deposits. They are usually controlled by faults or shear structures, occurring as veins and stockworks, or by strata.\nhypozonal - Depth of Formation of an orogenic deposit (>12 km / >7.5 mi).\nintrusive - A body of igneous rock formed by the consolidation of magma intruded into other rocks, in contrast to lavas, which are extruded upon the surface.\nJura-Triassic arc belt - One of the geologic packages of the Sierra Nevada Foothills belt which consists of a Paleozoic basement of disrupted ophiolite, serpentinite mélange, and ultra-mafic rocks overlain by uppermost Triassic-Early Jurassic arc volcanics and coeval 200 Ma intrusive rocks.\nlithology - Description of its physical characteristics of a rock unit at outcrop, in hard or core samples or with microscopy, such as colour, texture, grain size, or composition.\nlow-sulphide Au-quartz vein - Gold-bearing quartz veins and veinlets with minor sulphides crosscutting a wide variety of host rocks and are localized along major regional faults and related splays. The wall rock is typically altered to silica, pyrite and muscovite within a broader carbonate alteration halo.\nmafic - Igneous rocks composed mostly of dark, iron- and magnesium-rich minerals.\nmariposite - A mineral which is a chromium-rich variety of mica, which imparts an attractive green colour to the generally white dolomitic marble in which it is commonly found.\nmélange - A large-scale breccia, a mappable body of rock characterized by a lack of continuous bedding and the inclusion of fragments of rock of all sizes, contained in a fine-grained deformed matrix.\nmatrix - Finer-grained mass of material wherein larger grains, crystals or clasts are embedded.\n- 22 -\nmeta-volcanic rocks - A type of metamorphic rock that was first produced by a volcano, either as lava or tephra and then buried underneath subsequent rock and subjected to high pressure and temperatures, causing the rock to recrystallize.\nmesothermal quartz vein - Also known as and are type-examples of low-sulfide Au-quartz vein deposits.\nmesozonal - Depth of formation of an orogenic deposit (6-12 km / 3.7-7.5 mi).\nmetamorphosed - Rocks which have undergone a change in texture or composition as the result of heat and/or pressure.\nmill head grade - The grade of the mineralized material which is fed into the processing plant to be concentrated into gold bullion. The mill head grade includes mining dilution from un-mineralized rock adjacent to the veins. The mill head grade does not account for metallurgical recovery of gold during the processing of the mineralized material.\nophiolitic rock - An assemblage of the Earth's oceanic crust and the underlying upper mantle that has been uplifted and exposed above sea level and often emplaced onto continental crustal rocks.\norogeny - An episode of intense deformation of the rocks in a region, generally accompanied by metamorphism and plutonic activity.\norogenic gold deposit - Dominantly form in metamorphic rocks in the mid- to shallow crust (5-15 km depth), at or above the brittle-ductile transition, in compressional settings that facilitate transfer of hot gold bearing fluids from deeper levels. The term \"orogenic\" is used because these deposits likely form in accretionary and collisional orogens.\nPaleozoic - Geological era that followed the Precambrian and during which began with the appearance of complex life, as indicated by fossils (from 245 to 570 million years ago).\npyrite - A yellow iron sulphide mineral, normally of little value. It is sometimes referred to as \"fool's gold\".\nquartz - Common rock-forming mineral consisting of silicon and oxygen.\nsedimentary rock - Secondary rocks formed from material derived from other rocks and laid down under water. Examples are limestone, shale, and sandstone.\nserpentinite - Type of metamorphic rock composed mostly of mineral serpentine. It is usually dark green to greenish-black in colour, massive and macroscopically dense.\nschistosity - Geological foliation (metamorphic arrangement in layers) with medium to large-grained flakes in a preferred sheetlike orientation.\nscheelite - A variously colored mineral, CaWO4, found in igneous rocks and a common form of tungsten.\nsericite - A fine grained mica and a common alteration mineral of orthoclase or plagioclase feldspars in areas that have been subjected to hydrothermal alteration typically associated with hydrothermal deposits.\nsplay - A series of branching faults near the termination of a major fault which spread the displacement over a large area.\nstope - An excavation in a mine from which mineralized material is or has been extracted.\ntectonism - Geological term used to describe major structural features and the processes that create them, including compressional or tensional movements on a planetary surface that produce faults, mountains, ridges, or scarps.\nterrane - A crustal block or fragment that is typically bounded by faults and that has a geologic genesis distinct from those of surrounding areas.\n- 23 -\nTertiary - Former term for the geologic period from 65 million to 2.6 million years ago, a timespan that occurs between the Cretaceous and the Quaternary.\nthermal gradient - Rate of increasing temperature with respect to increasing depth in the Earth's interior.\nton - A unit of mass equal to 2,000 pounds\ntonne - A unit of mass equal to 1,000 kilograms\nultra-mafic - Igneous and meta-igneous rocks with a very low silica content, composed entirely or almost entirely of ferromagnesian minerals, and are composed of usually greater than 90% mafic minerals.\nAbbreviations\nImperial Metric\nAC acres m meter\nSF square foot km kilometer\nlb pound ha hectare\noz ounce g grams\nmi mile kg kilogram\nft foot gpt grams per tonne\nConversions\nImperial to Metric\nMetric to Imperial\nImperial Measure Metric Unit\nMetric Measure Imperial Unit\n2.47 acres 1 hectare 0.4047 hectare 1 acre\n3.28 feet 1 metre 0.3048 metre 1 foot\n0.62 mile 1 kilometre 1.609 kilometres 1 mile\n0.03215 troy ounce 1 gram 31.1035 grams 1 troy ounce\n0.02917 troy ounce per ton 1 gpt 34.2857 gpt 1 troy ounce per ton\n1.102 short ton 1 tonne 0.907 tonne 1 short ton\n2.2046 pounds 1 kilogram 0.4536 kilogram 1 pound\nI-M Mine Property, California\nOur principal mineral property is the I-M Mine Property.\nI-M Mine Project Location, Description and Access\nProperty Location\nThe I-M Mine Property comprises approximately 175 acres (71 hectares) surface land and 2,560 acres (1,036 hectares) of mineral rights located near Grass Valley in the County in northern California, USA. The I-M Mine Property is situated in the Grass Valley-Nevada City Mining District along the western slope of the Sierra Nevada, as shown on the overview map and regional map in Figure 1 and Figure 2, respectively and is located approximately 60 miles northeast of Sacramento, CA and 90 miles west of Reno, NV.\n- 24 -\nFigure 1: Idaho-Maryland Mine Property Location Overview\n- 25 -\nFigure 2: Idaho-Maryland Mine Property, Regional Map\n- 26 -\nProperty Description\nThe recorded owner of the surface land and mineral rights associated with the I-M Mine Property is Rise Grass Valley, a Nevada Corporation and subsidiary of Rise Gold Corp. Rise Grass Valley purchased the I-M Mine Property, inclusive of its mineral rights from the Grantors of the BET Group Estate, as described in the Quitclaim Deed (Document #: 20170001985), on the 25th of January 2017 and additional surface land described as the Mill Site in 2018.\nSurface Rights\nThe I-M Mine Property surface rights include three parts of fee simple land, (1) Idaho land representing 56 acres (23 hectares), (2) Brunswick land representing 37 acres (15 hectares), and (3) the Mill Site property representing 82 acres (33 hectares) as displayed in Figure 3.\nThe I-M Mine Property consists of parcels of surface land located in portions of Section 26 and 36, Township 16 North - Range 8 East Mount Diablo Base and Meridian (MDM) and Section 31, Township 16 North - Range 9 East MDM as detailed in Table 1 and displayed in Figure 3.\nTable 1: Idaho-Maryland Mine Property - Surface Land Legal Description\nParcel Number Description Lot Size\n09-550-32 SEC 26, TWN 16N, RNG 8E, MDM, PTN N 1/2 26-16-8 20,908 SF\n(0.48 AC)\n09-550-37 SEC 26, TWN 16N, RNG 8E, MDM, PTN NE 1/4 26-16-8 4.47 AC\n09-550-38 SEC 26, TWN 16N, RNG 8E, MDM, PTN NE 1/4 26-16-8 40.1 AC\n09-550-39 SEC 26, TWN 16N, RNG 8E, MDM, PTN NE 1/4 26-16-8 42,668 SF\n344 CENTENNIAL DRIVE GRASS VALLEY, CA 95945 (0.98 AC)\n09-550-40 SEC 26, TWN 16N, RNG 8E, MDM, PTN NE 1/4 26-16-8 5,662 SF\n(0.13 AC)\n09-560-36 SEC 26, TWN 16N, RNG 8E, MDM, PTN N 1/2 SE 1/4 26-16-8 10.25 AC\n09-630-37 SEC 36, TWN 16N, RNG 8E, MDM, LOT 6 BET ACRES 21.8 AC\n09-630-39 SEC 36, TWN 16N, RNG 8E, MDM & SEC 31, TWN 16N, RNG 9E, MDM,\nLOT 7 BET ACRES 15.07 AC\n06-441-03 SEC 36, TWN 16N, RNG 8E, MDM & SEC 31, TWN 16N, RNG 9E 15.19 AC\n06-441-04 SEC 36, TWN 16N, RNG 8E, MDM & SEC 31, TWN 16N, RNG 9E 0.85 AC\n06-441-05 SEC 36, TWN 16N, RNG 8E, MDM & SEC 31, TWN 16N, RNG 9E 50.01 AC\n06-441-34 SEC 36, TWN 16N, RNG 8E, MDM & SEC 31, TWN 16N, RNG 9E 16.01 AC\n- 27 -\nFigure 3: Idaho-Maryland Mine Property, Surface and Mineral Land Holdings\n- 28 -\nSurface Land Obligations\nFee simple ownership entitles the owner to all rights of a property, which are only restricted by law or private restrictions, such as zone ordinances or covenants. Fee simple owners retain possession of their property permanently, assuming all obligations to the land are met.\nThe surface land is subject to a tax lien imposed by and payable to the County. The parcels comprising the surface land are currently assessed by the County at a total of approximately US$4.2 million and have a combined annual property tax of US$47,912 for the 2023 tax year. The total amount includes County taxes and Agency taxes. The I-M Mine Property remains in good standing with property taxes for the 2022 tax year paid in full. Property taxes for the 2023 tax year of $23,956 is due on December 11, 2023, and $23,956 is due on April 10, 2024.\nThe Nevada Irrigation District supplies treated water to the I-M Mine Property. Water to the Brunswick land is delivered from the Loma Rica System, while water to the Idaho land is delivered from the E. George System. A nominal service fee is charged.\nThe secured loan from Eridanus Capital LLC is registered against the property by a Deed of Trust filed with the Nevada County Recorder. There are no further interests registered against the title of the surface rights.\nLand Designation\nThe Brunswick land and Mill Site is located approximately 1 to 2 miles southeast of the city limits of the City of Grass Valley in the County. The Idaho land is located on Idaho-Maryland Rd adjacent to the city limits of the City of Grass Valley in the County. The I-M Mine Property in relation to city limits is shown on Figure 3. Due to its proximity, the I-M Mine Property is located within the City of Grass Valley's planning area boundary, with Brunswick and Mill Site land located in the \"Long-term Annexation\" and Idaho land located in the \"Near-term Annexation\" Sphere of Influence. Based on the City of Grass Valley 2020 General Plan, the planned land use designation for the Brunswick land remains \"M-1\" Manufacturing/Industrial, while the planned land use designation for the Idaho land is \"BP\" Business Park (CoGV-CDD, 2009).\nEach of the parcels of Brunswick land and Idaho land are positioned within the County's \"M1\" Light Industrial Zone. Within the \"M1\" District, surface access to subsurface mining (e.g., vent and escape shafts) is allowed with a Use Permit (County Code § L-II 3.21.). Mineral exploration, however, is distinct from the definitions of \"subsurface mining\" and \"surface mining.\" Exploration involves the search for economic minerals through the use of geological surveys, geophysical or geochemical prospecting, bore holes and trial pits, and surface or underground headings, drifts, or tunnels (NCC § L-II 3.22(B)(5).). Exploration diamond drilling on M1-Industrial Land is an allowed use and does not require a discretionary permit provided that no water is discharged offsite and disturbance per site is less than 1 acre and 1,000 yd3 material (NCC, 2017).\nThe Idaho-Maryland Mine Project area is private land and no permits or consultations with the US Bureau of Land Management (BLM) or the US Forest Service (USFS) are required.\n- 29 -\nMineral Rights\nThe I-M Mine Property consists of mineral rights on 10 parcels, including 55 sub parcels, totaling 2,560 acres (1,036 hectares), of full or partial interest, as detailed in Table 2 and displayed in Figure 4. The mineral rights encompass the past producing I-M Mine Property which includes the Idaho and Brunswick underground gold mines.\nThe original mineral rights were granted at various times since 1851. Through various patents and agreements since the original grants, there has been a succession of ownership of the mineral rights.\nThe Quitclaim Deed describes the mineral rights as follows:\nThe I-M Mine Property consists of all rights to minerals within, on, and under the land shown upon the Subdivision Map of BET ACRES, No. 85-7, filed in the Office of the County Records, Nevada County, California, on February 24, 1987, in Book 7 of Subdivisions, at Page 75 et seq.\nThe I-M Mine Property consists of all rights to minerals within, on, and under the land located in portions of Sections 23, 24, 25, 26, 35, and 36 in Township 16 North - Range 8 East MDM, Sections 19, 29, 30, and 31 in Township 16 North - Range 9 East MDM, and Section 6 in Township 15 North - Range 9 East MDM and all other mineral rights associated with the Idaho-Maryland Mine.\nThe mineral rights are defined as parcels and sub parcels in a Quitclaim Deed (Document #: 20170001985). All property is described in that Quitclaim Deed by Idaho Maryland Industries Inc. in favor of William Ghidotti and Marian Ghidotti, his wife as tenants in common, dated June 10, 1963. The Quitclaim deed is located at vol. 337, pp. 175-196 in the official records of the County, as recorded on June 12, 1963.\nMineral rights pertain to all minerals, gas, oil and mineral deposits of every kind and nature beneath the surface of all such real property, together with all necessary and convenient rights to explore for, develop, produce, extract and take the same, subject to the express limitation that the fore-going exception and reservation shall not include any right of entry upon the surface of said land without the consent of the owner of such surface of said land, as excepted in the Quitclaim Deed recorded the 26th of January 2017 (Document #: 20170001985). Mineral rights are severed from surface rights at a depth of 200 ft (61 m) below surface, with all mineral rights being contiguous below 200 ft (61 m) of surface.\nThe secured loan from Eridanus Capital LLC is registered against the property by a Deed of Trust filed with the County Recorder. There are no other interests registered against or obligations required of the mineral rights of the I-M Mine Property.\n- 30 -\nFigure 4: Idaho-Maryland Mine Property, Surface and Mineral Rights\nProperty Access\nThe I-M Mine Property is situated east of the City of Grass Valley and south of Nevada City, in the western part of the County. State Route 49, State Route 20, and State Route 174 (state highways) connect the Grass Valley area regionally. The Brunswick land and the adjacent Mill Site are situated on the southwestern quadrant of the intersection of the East Bennett Road and Brunswick Road, a road connecting Grass Valley with State Highway 174. Access to the Brunswick land is on East Bennet Road, approximately 2.8 miles east of Grass Valley Center. The Idaho land can be accessed by Idaho Maryland Road or Centennial Drive.\n- 31 -\nAgreements\nRise owns a 100% interest in the I-M Mine Property and there are no known royalties on future gold production. The secured loan from Eridanus Capital LLC is registered against the property by a Deed of Trust filed with the County Recorder. There are no other known agreements or encumbrances to which the I-M Mine Property is subject.\nEnvironmental Liabilities\nEnvironmental studies have been completed on all the surface holdings owned by Rise. The environmental studies were completed prior to Rise purchasing the Idaho land and Brunswick land.\nIdaho Land\nIn 2016, a Draft Preliminary Endangerment Assessment (PEA) report on the Idaho Land was prepared for the City of Grass Valley by Geocon Consultants Inc. This report provided conclusions and recommendations to support redevelopment of this site for commercial and industrial use. Geocon noted the metal of greatest concern with respect to potential health risks for future site occupants is arsenic which is present in mine tailings and waste berms located on the site. Geocon noted that the presence of arsenic in mine waste on the site does not currently appear to pose a significant risk to public health or the environment in its current state and that an expedited response action does not appear warranted at this time (Geocon, 2016).\nOn behalf of Rise Grass Valley, NV5 prepared a Draft Final Preliminary Endangerment Assessment (PEA) report that summarizes the findings of additional investigation and presents the results of risk assessment as required by the California EPA. The Draft Final PEA report was conditionally approved by the California EPA in a letter dated June 11, 2020. NV5 addressed the conditions of approval and issued the Final PEA report on June 12, 2020.\nOn behalf of Rise Grass Valley, NV5 prepared a Draft Remedial Action Plan (RAP, July 1, 2020)) to outline procedures for excavation, on-site transport and consolidation of mine waste as engineered fill in a 5.6-acre area on the eastern edge of the property. The RAP is based on the findings of the Final PEA and risk assessment (NV5, June 12, 2020). The RAP presents the findings of engineering evaluation, cost analysis and remedial action planning, and includes procedures for remedial implementation, verification sampling and analysis, and reporting. The 5.6-acre mine waste consolidation area will be subject to a land use covenant that restricts future disturbance of the consolidated mine waste. The mine waste consolidation area is to be covered with additional material from future mining operations that will be used to prepare the property for future commercial/industrial uses. The RAP was reviewed by Cal EPA, and approval of the Final RAP is currently in progress.\nBrunswick & Mill Site Land\nIn 2007, a Phase I Environmental Site Assessment (ESA) for the Round-Hole and New Brunswick Mine Sites was prepared by Engineering/Remediation Resources Group, Inc. (\"ERRG\") for Idaho-Maryland Mining Corporation. The report concluded that there were no current recognized environmental conditions on the I-M Mine Property at the time, although there are suspect environmental concerns regarding spills of hydrocarbons from vandalism at the New Brunswick Shaft, roofing asphalt on the property, debris from illegal dumping on the property boundaries, and the potential for naturally occurring asbestos in serpentinite rocks on the property. ERRG did not complete an analysis to determine if contamination from historic mining and mineral processing was present, although ERRG has recommended further sampling and studies to determine this (ERRG, 2007).\n- 32 -\nIn 2006 a Phase II Environmental Site Assessment (ESA) for the Mill Site was completed by Geomatrix Consultants Inc. for Sierra Pacific Industries, Inc. Extensive reclamation and environmental work had previously taken place on the Mill Site. There is mine waste rock on the property which has elevated arsenic levels however Geomatrix concluded that this rock is not discharging elevated metals into the local watershed. Ground water samples taken on the site as part of the ESA had residual Volatile Organic Compounds (VOC). The evaluation concluded that the residual VOC contamination presents no threat to human health from vapor migration to indoor air. The property has a deed restriction which restricts the use of groundwater for any domestic purpose and the construction of wells for the purpose of extracting water unless expressly permitted by the Regional Water Board (Geomatrix, 2006).\nOn behalf of Rise Grass Valley, NV5 prepared a Phase I/II ESA (June 16, 2020) presenting the results of additional investigation and addressing historical conditions identified in previous reports. Results indicated that the mine waste fill was generally less than five feet deep except at locations south of the New Brunswick Shaft and in the central-eastern portion of the property. Laboratory test results indicated that arsenic concentrations detected in mine waste samples were relatively low except for the mixed soil and rock fill located at a paved area in the southeastern portion of the property. This soil and rock fill was generally located beneath pavement and was typically less than five feet deep. This mine waste is believed to have originated from offsite rather than from the New Brunswick shaft.\nExploration Permits\nAll parcels included in the I-M Mine Property are within the M1 Light Industrial Zoning District of the County. Mineral exploration is allowed in M1 Districts subject to zoning compliance and building permit issuance, if required. Under a Use Permit process, a Use Permit is only required for mineral exploration if one of the following conditions are triggered, as per NCC § L-II 3.22(D)(2):\n(a) Overburden or mineral deposits in excess of 1,000 cubic yards are disturbed, or\n(b) The operation in any one location exceeds one acre in size, or\n(c) Dewatering will occur or water will be discharged from the site as a result of the operation.\nAdditionally, all exploratory operations shall require a reclamation plan and secure adequate financial assurances to ensure site reclamation unless:\n(a) Less than 1,000 cubic yards of overburden are disturbed, and\n(b) The size of the operation in any one location is one acre or less.\nIn those instances where a reclamation plan is not required, an erosion control plan as per NCC § L-V 13.14., approved by the County Planning Department, and a grading permit shall be required for those operations in which 50 cubic yards or more of overburden are disturbed as per NCC § L-II 3.22(D)(2) (NCC, 2017).\nA building permit, issued by the County, may be required for construction or installation of drilling facilities. A building permit is a ministerial approval. Ministerial approval is a non-discretionary approval.\nSurface exploration drilling will be subject to County Noise Regulations. The Noise Element of the County General Plan (2014) establishes maximum allowable exterior noise levels for various land use categories (NC-BOS, 2014).\n- 33 -\nSubsurface and Surface Mining Permits\nSubsurface mining is allowed in the M1 District with approval of a Use Permit. (NCC § L-II 3.21.) Under a Use Permit process, approval of a Use Permit for mining operations requires a noticed public hearing before the Planning Commission, which decision may be appealed to the Board of Supervisors. (NCC § L-II 5.6.) Use Permit approvals include conditions of approval, which are designed to minimize the impact of conditional uses on neighboring properties.\nSubsurface mining, including ancillary surface uses, would require the following permits and approvals under a Use Permit process:\nCounty Approvals\nA. Use Permit for surface and subsurface mining activities\nB. Reclamation Plan for surface disturbance\nC. Mitigated Negative Declaration or Environmental Impact Report in compliance with the California Environmental Quality Act (\"CEQA\") to analyze and mitigate environmental impacts\nD. Water Well Permit by the County for the drilling of any well\nE. Building Permits for construction of any structures\nF. Spill Prevention Control and Countermeasures Plan for underground storage of more than 42,000 gallons of petroleum or above ground storage of more than 10,000 gallons of petroleum\nThe following permits and approvals may also be required depending on the configuration of the Idaho-Maryland Mine Project and the characteristics of the natural resources found in the Project-vicinity:\nCalifornia Department of Fish and Wildlife (\"CDFW\") Approvals\nG. Streambed Alteration Agreement\nH. Incidental Take Permit for take of any species listed under the California Endangered Species Act (\"CESA\")\nState Water Resources Control Board (\"SWRCB\") and/or Central Valley Regional Water Quality Control Board (\"RWQCB\") Approvals\nI. National Pollution Discharge Elimination System (\"NPDES\") permit for discharges of stormwater\nJ. Report of Waste Discharge for any discharges of water from mining processes\nK. Clean Water Act Section 401 Water Quality Certification from the RWQCB (only if a CWA Section 404 permit is required from the U.S. Army Corps of Engineers)\nU.S. Army Corps of Engineers (\"Corps\")\nL. Clean Water Act Section 404 permit for any discharge of dredge or fill material into the waters of the United States,\nM. Environmental Assessment compliant with the National Environmental Policy Act by either the Corps or the USFWS\nUnited States Fish and Wildlife Service (\"USFWS\")\nN. Issuance of a Biological Opinion and Incidental Take Statement for take of any species listed under the Endangered Species Act\nNorthern Sierra Air Quality Management District (\"AQMD\")\nO. Authority to Construct and Permit to Operate for any regulated air pollutant emitting sources such as diesel generators\n- 34 -\nHistory\nThe I-M Mine Property located in the Grass Valley mining district of northern California was one of the most productive and best-known gold mines in the Unites States, with gold production from the I-M Mine Property dating back to 1863.\nThe I-M Mine Property, as it now exists, represents a consolidation of a number of important early day producing mines including Eureka, Idaho, Maryland, Brunswick, and Union Hill Mines. Based on historic production records, the I-M Mine Property produced a total of 2.4 Moz of gold at an average mill head grade of approximately 0.5 oz/ton (17.1 gpt). The I-M Mine Property was reportedly the second largest gold mine in the United States in 1941 (Clark, 2005), producing up to 129,000 oz gold per year before being forced to shut down by the US government in 1942 (Shore, 1943). Due to lack of development, a decline in gold production was experienced and recovery from war-time shutdown never occurred.\nHistoric Exploration & Mine Development\nThe I-M Mine Propoerty has a rich history of mining work completed between 1863 and 1956 by various operators. Extensive exploration and underground mine development were completed during that time on the I-M Mine Property. The I-M Mine Property and its comprehensive collection of original documents was rediscovered in 1990 by Consolidated Del Norte Ventures Inc., the predecessor company of Emgold Mining Corporation (\"Emgold\"), and efforts were made to reopen the historic mine.\nExploration & Mine Development 1851-1956\nExploration by historic operators from 1851 through to 1956 was mainly completed by lateral exploration (drift development) and raise or winze development. Levels were driven along the strike of the veins to determine their extent. Raises were developed upwards following the inclination of the vein and winzes were sunk down along the dip of the vein. Chip samples were assayed for mineralization of the quartz vein. In 1923, the first prospect drill was purchased. Following that, exploration holes were completed ahead of mine development to confirm vein locations and to locate vein extensions.\nThe I-M Mine Property encompasses a system of underground tunnels, many raises, numerous winzes, four inclined shafts, and two vertical shafts. An estimated equivalent of 72.8 miles (117 km) of underground tunnel occur at the I-M Mine Property, assuming typical drift dimensions of 7.5 ft x 8.5 ft (W x H).\nBased on available historic records, 883 exploratory holes totaling approximately 234,100 ft (71,354 m) were diamond drilled at a diameter of 7/8\" (EX-size). Historic drill logs were not available for review and no historic drill core was preserved from past mining operations at the I-M Mine Property.\nExploration & Mine Development 2003-2004\nEmgold and its former entities leased the I-M Mine Property from 1990 to 2013. Development work during this period included completion of a preliminary investigation of the mine records, publishing various technical reports on the I-M Mine Property, leasing or purchasing adjacent properties, various permit applications and associated environmental studies, development of a ceramics technology process, and completion of an exploration program. Emgold was unsuccessful in reopening the historic mine due to inability to raise necessary funding in the midst of unfavourable market conditions.\nEmgold completed an exploration program on the I-M Mine Property in 2003 and 2004. Gold exploration consisted of 31 diamond drill holes totaling 21,335 ft (6,502 m) and 7 drill holes totaling 3,537 ft (1,078 m) were completed for geotechnical and ceramics feedstock work.\n- 35 -\nThe surface exploration drill program focused on the westernmost portion of what Emgold termed the Idaho Deformation Corridor, along the Idaho Fault Zone. Exploration drilling was mainly conducted from two sites: 1) west of the Eureka shaft and 2) west of the Idaho shaft, both targeting near surface mineralization around historic workings.\nThe Emgold diamond drill hole database was acquired by Rise in the purchase of the I-M Mine Property. As per the purchase agreement with the BET Group, ownership transfer of the I-M Mine Property included all historical documents to which the BET Group held rights, inclusive of Emgold data.\nProduction History\nRise has completed a compilation of the mine production data of the I-M Mine Property during historic operation from 1866 through 1955, the final year of production from the mine. Rise estimates that the I-M Mine Property produced a total of 2,414,000 oz of gold from 5,298,000 tons of mill feed and that the life of mine average mill head-grade averaged approximately 0.50 oz/ton (17.1 gpt). Total production for the I-M Mine is detailed in Table 3.\nTable 3: Total Idaho-Maryland Mine Production from 1866-1955*\nMined & Milled Mill Head Grade Metallurgical\nRecovery Yield Gold\nProduced\nTons tonnes oz/ton gpt % oz/ton oz\nIdaho Mine\n#1 Vein 978,000 887,000 1.12 38.6 85% 0.96 935,000\n3 Vein system 1,215,000 1,102,000 0.60 20.4 95% 0.56 686,000\nTotal 2,193,000 1,989,000 0.83 28.4 89% 0.74 1,621,000\nBrunswick Mine\nOld Brunswick 41,000 37,000 0.56 19.3 85% 0.49 20,000\nUnion Hill 35,000 32,000 1.21 41.5 85% 1.03 36,000\nNew Brunswick 3,029,000 2,748,000 0.26 8.8 95% 0.24 737,000\nTotal 3,105,000 2,817,000 0.27 9.3 94% 0.26 793,000\nTotal I-M Mine 5,298,000 4,806,000 0.50 17.1 91% 0.46 2,414,000\n*Details regarding data verification are presented under the heading \"Data Verification\" below.\nIn 1926, Errol MacBoyle took over management of the I-M Mine and, as President and General Manager, led the mine into its most successful period of production. A graph of production from the Idaho and Brunswick Mines from 1926 to 1955 is displayed in Figure 5. The historic mine workings of the I-M Mine are displayed in Figure 6.\n- 36 -\nFigure 5: I-M Mine Gold Production from 1926-1955*\n- 37 -\nFigure 6: Idaho-Maryland Mine Workings, Plan View\n- 38 -\nMill Head Grade\nThe mill head grade is the grade of the mineralized material which is fed into the processing plant to be concentrated into gold bullion. The mill head grade includes mining dilution from un-mineralized rock adjacent to the veins. The mill head grade does not account for metallurgical recovery of gold during the processing of the mineralized material.\nData Verification\nDetailed production information from the internal records of the I-M Mine property is available for the period from 1926 through 1955. Whenever possible, mill reports were reconciled against financial statements and submissions by Rise to the US Bureau of Mines. Where reconciliation between documents was possible, only minor variations in production reporting were noted. The entire library of documents is no longer fully complete but there is sufficient material to make an accurate estimate of historic production during this period. The following materials were used to prepare an estimate during the period from 1926-1955:\nIdaho Maryland Mines Co. Financial Statements (1926-1932, 1934-1942)\nIdaho Maryland Mines Co. Mill Reports (1933-1942, 1946-1950)\nIdaho Maryland Mines Co. Final Distributions Sheets (1944, 1945)\nIdaho Maryland Mines Co. Breakdown of Income and Expenses (1946-1949)\nIdaho Maryland Mines Co. Cost Data & Cost Sheets from (1946-1949)\nIdaho Maryland Mines Corp. Lode Mine Production Report to US Bureau of Mines (1944-1945, 1947-1948, 1950, 1952, 1953, 1955)\nFor the period prior to 1926 there are no internal corporate records regarding historic production. The following documents were used to prepare an estimate during the period from 1866-1925:\nLindgren, Waldemar. The Gold Quartz Veins of Nevada City and Grass Valley Districts, California (1896)\nHamilton, Fletcher. Mines and Mineral Resources of Nevada County (1918)\nClark, Jack. Gold in Quartz: The Legendary Idaho Maryland Mine (2005)\nDetailed records of metallurgical recoveries from the I-M Mine prior to 1924 are also not available. From 1924-1930 gold recoveries ranged from 72% to 89% using a similar process to that used in the years prior to 1924. Lindgren (1896) estimated that gold mills in the Grass Valley mines averaged 75% metallurgical gold recovery but noted that the I-M Mine was unique in that it treated the tailings from its concentrates by secondary processes. Rise has assumed a metallurgical recovery of 85% for the pre-1924 processing at the I-M Mine which it believes is the best estimate possible given the information available.\nGeological Setting, Mineralization and Deposit Types\nGeology\nThe I-M Mine Property is located in the Grass Valley area of the Western Sierra Nevada Foothills of Northern California. This belt of rocks consists of late Paleozoic marine sedimentary and ophiolitic rocks, and early and late Mesozoic submarine volcanic-arc and basinal terranes.\n- 39 -\nThe Jura-Triassic arc belt has yielded the majority of gold production in the Western Sierra Nevada Foothills. Gold deposits in Jura-Triassic arc belt are associated with second, third, and fourth-order faults related to the regionally significant Wolf Creek/Bear Mountain and Melones faults.\nThe Grass Valley area is dominated by blocks of variably metamorphosed volcanic, mafic plutonic, and minor sedimentary rocks hosted in a serpentinite matrix. The whole package of rocks exhibits a region foliation and is interpreted as a serpentinite-matrix tectonic mélange. These rocks were variably metamorphosed from lower greenschist to amphibolite facies during and after accretion to the continental margin. Two distinct gold vein groups exist within the Grass Valley district: steeply dipping E-W-trending veins in the northern and generally N-S trending veins with gentler dips averaging 35° in the southern part of the district. The most important E-W veins are associated with the I-M Mine Property. Both vein sets have extraordinary vertical and lateral persistence; individual veins extend for kilometers.\nMineralization\nAll of the significant gold production from the I-M Mine was localized within and around the Brunswick Block, which consists of variably metamorphosed volcanic and intrusive, and minor sedimentary rocks. The Brunswick Block is surrounded to the west, north, and east by gabbro and serpentinite rocks. Overlying Tertiary volcanic rocks mask rock units along the southern boundary of the Brunswick Block. The contacts between the Brunswick Block and surrounding gabbro and serpentinite are dominated by the 6-3, the Idaho, and the Morehouse Fault domains. Mineralization is closely associated with these significant second or third order structures close to the contact between the Brunswick block and serpentinite contact. Gold in the quartz veins occurs as native gold, ranging from very fine grains to large nuggets within the quartz. Sulfide minerals, primarily pyrite with lesser galena, chalcopyrite, from 1% to 4% are commonly associated with gold mineralization. Scheelite is common in the Union Hill area near the Brunswick mine. Gangue minerals include quartz, carbonate, sericite, chlorite, mariposite, and albite. Ankerite is a common alteration mineral and may occur in the mafic and ultra-mafic rocks and the meta-volcanic rocks. The mineralized wall rock is strongly carbonate altered.\nGold mineralization on the I-M Mine Property can be divided into three significant vein systems: the Idaho, the Brunswick, and the Morehouse systems.\nIdaho System\nThe #1 Vein, #2 Vein, and 3 Vein System comprise the Idaho Vein System.\nThe Eureka discovery showing outcropped at the western end of the #1 Vein system but had only minor gold concentration and could not be traced on surface east or west. High grade mineralization plunging to the southeast was intersected starting at approximately 100 ft (30 m) below surface at this showing. Follow-up exploration and mining led to the development of the prolific Eureka-Idaho ore shoot which plunges at approximately 30° to the southeast and has a pitch length of almost 1 mile (1.6 km) and a breadth of 500 ft to 1,000 ft (152 m to 305 m). The width of the vein within the ore shoot averaged approximately 3 ft (~1 m) and in places ranged up to 8 ft (~2.4 m). The average insitu grade of the #1 Vein would likely have been slightly higher than the estimated mill head grade of 1.12 oz/ton (39 gpt). The trend of the shoot is approximately parallel to an expected trend of the intersection of the Idaho and Morehouse faults suggesting the interaction of the Idaho and Morehouse faults may have played a role on the formation of the rich mineralization encountered in the Eureka-Idaho stope. Alternatively, the shape of the Brunswick Block may have influenced this trend.\nThe Idaho #1 Vein occurs coincident with a diabase dike hosted in ankerite, in close proximity to the serpentinite-Brunswick Block contact. Just west of the Idaho shaft, at the western end of the Idaho #1 Vein, the diabase dike bends in an arc to the south mimicking a fold around the nose of the Brunswick Block. The Eureka-Idaho ore shoot pinches out at the I1500 Level but significant gold grades coincident with a diabase dike hosted in serpentinite in close proximity to the serpentinite-Brunswick contact were exposed in workings on the I2400 Level suggesting the vein may open up again or a second vein is present. To the east, the Eureka-Idaho ore shoot pinches out near the #2 Vein. All rocks are highly altered and contain much ankerite. The cross section in Figure 7 shows the general form and relationship of the #1 Vein with the serpentinite and diabase dike.\n- 40 -\nFigure 7: #1 Vein Cross Section, Section looking East (Lindgren, 1896)\nThe #2 Vein is a disrupted zone of quartz veins trending northeast and dipping steeply to the southeast. This vein system is hosted in the serpentinite approximately coincident with where the serpentinite-Brunswick Block contact bends abruptly to the north before turning east again. #2 Vein trends northeast into the 3 Vein System.\nThe 3 Vein System, like the #1 Vein system, hosts a prolific ore shoot. The 3 Vein System comprises an Idaho fault split into four main branches. Connecting diagonal structures between the four fault branches were also mineralized. As with the #1 Vein, gold mineralization is associated with a diabase dike sub parallel to the serpentine-Brunswick Block contact. The main 3 Vein was mined continuously over a vertical distance of approximately 1,500 ft (457 m) and an average horizontal strike length of approximately 700 ft (213 m). There were several important veins which splayed from the main 3 Vein, forming the larger 3 Vein System. The most important of which were named the 5 Vein, 13 Vein, and 22 Vein. Minor splays from the main 3 Vein included 19 Vein, 4 Vein, and 6 Vein. The 3 Vein ranged in dip from 45° to 70°, with an average dip of approximately 55°. An average vein width of approximately 5 ft (1.5 m) was typical but in places reached widths of over 20 ft (6 m).\nIn the 3 Vein System, the best mineralization was typically found in quartz veins where the Idaho structures intersected areas where diabase dikes or Brunswick Block rocks are in contact with the serpentinite unit. Veins hosted solely in serpentinite were rarely of economic importance due to the ductile nature of the serpentinite which typically does not allow wide or continuous open structures to form from faulting. The 23 Vein is an exception. Also known as the Rose Garden, it was intersected by exploration drifting 2,000 ft (610 m) east of the main 3 Vein System on I2000 Level. The mine operator was following the Idaho #5 Vein towards the 6-3 Fault and located the 23 Vein by diamond drilling. The 23 Vein dips to the northwest as opposed to the southwest and is hosted entirely in ankerite/serpentinite. It is quite narrow but was noted to contain abundant visible gold. The 23 Vein was followed along strike to the southeast directly to its intersection with the 6-3 Fault.\nBrunswick System\nThe Brunswick vein system constitutes a distinct vein system within meta-volcanic rocks of the Brunswick Block. The veins strike northwesterly and have a southwesterly dip. These parallel, vertically dipping mineralized veins were mined above 1600L along continuous strike lengths ranging from 430 ft (131 m) to 1,000 ft (305 m) with continuous vertical heights reaching up to 1,000 ft (305 m). These veins generally range from several inches up to 8 ft (2.4 m) in width. A few veins with opposite strike and dip occur. The veins are most numerous and have the highest grades near the 6-3 Fault. The veins nearest to the fault turn to the north on the footwall side, suggesting a northward component of movement of the hanging wall. A quartz-carbonate stockwork develops near the fault. The quartz stringers dip from the veins toward the fault and many have connecting diagonals extending from an upper to a lower stringer toward the fault. The Brunswick veins generally pinch out before rarely coming in contact with the fault footwall. No significant mineralization is present in the fault. Only a few unimportant veins are known beyond its hanging wall.\n- 41 -\nIn the area of the Brunswick veins there are layers of meta-sedimentary rocks within the meta-volcanic rocks that exhibit the regional N-W schistosity dipping very steeply to the north. Where the Brunswick veins cross these meta-sedimentary rocks vein splitting and en-echelon crossings occur forming what is known in the historical records as \"Zebra Rock.\" The \"Zebra Rock\" produced \"fair\" to \"good\" grades of large tonnage and the presence of free gold was reported. A large \"Zebra Rock\" zone was intersected and mined along the western extents of 16 Vein from levels 1300L to 1000L. Mining in this zone occurred over strike lengths from 360 ft to 525 ft (110 m to 160 m) and reached widths of up to 110 ft (34 m) on 1100 level.\nMorehouse System\nThe Morehouse vein system is not as well understood as the Idaho #1, #2, 3 Vein System, and Brunswick vein systems. It is defined by fault and quartz-vein and quartz stockwork intersections in workings and drill holes in only a few areas such as the Morehouse, 16 Vein, 52 Vein, and 60 Winze. There is little historic production from the Morehouse Vein system.\nThe Morehouse vein is associated with the serpentinite-hosted diabase dike wrapping around the western end of the Brunswick Block. Underground working show the Morehouse connects directly to the Idaho #1 Vein. The extension of the Idaho shaft in 1923 to I1500 Level intersected the Morehouse splay and the shaft station on I1500 Level is right above the #1 Vein.\nThe best Morehouse mineralization intersected to date, and the only significant production, occurs within the Brunswick Block at the 52 Vein and 60 Winze areas. There is very little other exploration of this vein in the Brunswick Block.\nMineral Deposit Type\nThe Idaho System deposits on the I-M Mine Property can be described as an orogenic gold deposit. Orogenic gold deposits encompass a broad range of depth of formation and different host lithologies; however, common to orogenic gold deposits is a spatial association with compressional to transpressional deformation processes at convergent plate margins in accretionary and collisional orogens. Most ores are post-orogenic with respect to tectonism of their immediate host rocks but are simultaneously syn-orogenic with respect to ongoing deep-crustal, subduction-related thermal gradient. Depth of formation of orogenic deposits are best subdivided into epizonal (<6 km / <3.7 mi), mesozonal (6-12 km / 3.7-7.5 mi), and hypozonal (>12 km / >7.5 mi).\nThe gold deposits on the I-M Mine Property have been classified as Mesothermal Quartz Veins (Lindgren, 1894), are also known as and are type-examples of low-sulfide Au-quartz vein deposits (Berger, 1986), and gold quartz vein deposits (Ash, 2001). These classifications are sub-groups of orogenic gold deposit type.\nExploration\nRise has completed an exploration drilling program on the I-M Mine Property in June of 2019. Rise has completed seventeen drill holes, B-17-01, B-18-02 thru B-18-07, Z-18-08 & Z-18-09, I-18-10-I-18-12, I-19-13, I-1913A, I-19-12A, I-19-12B, I-19-14, & I-19-14A. Total drilling completed to July 31, 2019 by Rise Gold is ~20,584 meters. Assay results for all drill holes have been released as of July 31, 2019.\n- 42 -\nExploration drilling at the Brunswick portion of the Idaho-Maryland Gold project has been successful with numerous gold-bearing veins intersected and previously released in 2018 on January 3rd, June 28th, July 23rd, August 7th and December 13th and in 2019 on March 19, May 21st, and June 28th, 2019. A summary of drill highlights for the program released through July 31th, 2019 is presented in the table.\nDrill Intercept Highlights Released to July 30th 2019\nHole From\n(m) To (m) Gold\n(gpt) Intercept\nLength (m) Estimated\nTrue\nWidth\n(m) Vein\nB-17-01 638.89 653.80 12.2 14.90 7.8 B1\nIncluding 643.74 646.48 62.7 2.74\nB1 Center\nIncluding 644.96 645.57 266.0 0.61\nB-17-01 1111.61 1126.85 4.5 15.24 ? ?\nIncluding 1112.06 1113.59 40.6 1.52\nB-18-02 578.42 582.78 7.9 4.36 1.0 - 3.4 B116 or B1\nB-18-03 516.64 518.62 6.0 1.98 1.7 B1 East\nB-18-04 516.94 520.96 8.0 4.02 3.0 B32\nIncluding 516.94 518.01 23.0 1.07\nB-18-04 625.27 628.04 4.0 2.77 2.1 B10 HW\nB-18-04 637.03 640.08 4.4 3.05 2.3 B10 FW\nB-18-04 711.92 715.21 5.1 3.29 1.8 B18\nB-18-05 667.88 671.38 5.9 3.51 2.0 B10 HW\nIncluding 670.32 671.38 13.0 1.07\nB-18-05 682.90 690.37 2.4 7.47 4.1 B10 FW\nB-18-05 748.28 763.58 2.6 15.30 11.0 B41\nB-18-05 899.59 905.53 2.5 5.94 3.4 B39\nB-18-05 978.10 983.28 22.4 5.18 2.6 B40\nIncluding 978.10 979.32 93.2 1.22\nB-18-05 1590.14 1594.56 23.7 4.42 3.2 IB30\nIncluding 1593.59 1594.01 230.0 0.43\nB-18-05 1887.47 1890.43 10.9 2.96 2.0 IB50\nIncluding 1889.36 1889.85 61.0 0.49\nB-18-06 682.75 688.54 2.6 5.79 4.1 B10\nB-18-06 766.54 775.50 4.9 8.96 8.2 B41\nB-18-07 733.35 736.40 3.0 3.05 2.4 B6\nB-18-07 746.49 750.14 4.0 3.66 2.8 B10 HW\nB-18-07 756.97 760.78 1.9 3.81 5.4 B10 FW\nZ-18-08 No Significant Intercepts\nZ-18-09 309.68 316.38 3.3 6.71 ? Zebra\nI-18-10 171.08 174.60 4.7 3.52 ? Zebra\n- 43 -\nI-18-10 958.02 965.61 1.8 7.59 ? 52 HW\nI-18-10 965.61 972.01 3.2 6.40 ?\nI-18-10 977.98 978.44 97.3 0.46 ? 52 FW\nI-18-10 987.77 994.58 149.3 6.81 ? 52 FW\nIncluding 993.42 993.88 2190.0 0.46\nI-18-11 259.16 262.04 8.5 2.88 ? ?\nIncluding 261.14 262.04 18.8 0.90\nI-18-11 975.50 976.70 19.2 1.20 ?\nI-18-11 992.25 993.88 15.4 1.63 ?\nIncluding 992.70 993.22 35.6 0.52\nI-18-11 1046.17 1052.58 3.9 6.42 ?\nI-18-11 1142.33 1144.08 5.4 1.75 ?\nI-18-11 1381.86 1384.33 3.6 2.47 ? I1\nI-18-12 950.50 960.49 2.6 9.98 ?\nI-19-12B 1367.27 1373.22 9.4 5.94 ? I1\nIncluding 1367.27 1370.11 18.5 2.83 ? I1\nIncluding 1369.04 1370.11 46.3 1.07 ? I1\nIncluding 1369.74 1370.11 111.5 0.37 ? I1\nI-19-13 1007.97 1013.09 5.5 5.12 ? I1\nI-19-13A 1005.31 1009.57 90.4 4.27 ? I1\nIncluding 1008.77 1009.57 458.0 0.81\nI-19-14A 1014.42 1029.31 1.4 14.9 13.59 I2\nIncluding 1014.42 1016.36 6.2 1.9 1.77 I2\nRise has prepared a drill hole database derived from information contained in the collection of historic documents and records acquired through the purchase of the I-M Mine Property. The drill hole database is divided into I-M Mine drilling completed before the mine shut down in 1956 and Emgold drilling completed in 2004.\nSampling, Analysis and Data Verification\nSample Preparation and Analysis\nRise Gold has implemented a quality control program for our drill program to ensure best practices in the sampling and analysis of the drill core. This includes the insertion of blind blanks, duplicates, and certified standards. HQ- and NQ-sized drill core is saw cut with half of the drill core sampled at intervals based on geological criteria including lithology, visual mineralization, and alteration. The remaining half of the core is stored on-site at our warehouse in Grass Valley, California. Drill core samples are transported in sealed bags to ALS Minerals analytical assay lab in Reno, Nevada.\nAll gold assays were obtained using a method of screen fire assaying. The historic I-M Mine project is known to contain 'coarse' gold, for which a screen fire assay is the best way to obtain a definitive result. This procedure involves screening a large, pulverized sample of up to 1 kg at 100 microns. The entire oversize (including the disposable screen) is fire assayed as this contains the 'coarse' gold and a duplicate determination is made on the 'minus' 100-micron fraction. A calculation can then be made to determine the total weight of gold in the sample. Any +100-micron material remaining on the screen is retained and analyzed in its entirety by fire assay with gravimetric finish and reported as the Au (+) fraction result. The -100-micron fraction is homogenized and two sub-samples of 50 grams are analyzed by fire assay with AAS finish. If the grade of the material exceeds 10 gpt the sample is re-assayed using a gravimetric finish. The average of the two results is taken and reported as the Au (-) fraction result. All three values are used in calculating the combined gold content of the plus and minus fractions.\n- 44 -\nThere is no detailed information describing sample preparation, analysis and security procedures applied by mine operators prior to 2002. The historical samples were reportedly fire-assayed at former mine site laboratories. No records exist of any QA/QC program.\nEmgold sample preparation, analysis and security procedures for core collected by Emgold are described in a 2009 Technical Report prepared by Robert Pease, P.G., for Emgold titled \"Idaho-Maryland Mine Project, Grass Valley CA\". Three-foot core samples were cut in half by a wet saw. The half core samples were put in a sample bag, tagged, and shipped to a laboratory. All samples were crushed to 80% passing -10 mesh, rotary split to a 500 g subsample which was pulverized to 95% passing -150 mesh. All samples were analyzed using screened metallics fire assay methods. The QAQC program used Standard Reference Materials, blank samples, coarse reject and pulp duplicate samples, and third-party laboratory check assays. Insertion rate of SRMs and duplicates was approximately 1 in 20 samples. Blanks were only inserted immediately following mineralized intervals. The control samples were reportedly used to successfully control the assay quality process.\nHistorical Data Verification\nAlthough Rise has carefully digitized and checked the locations and values of drill hole results from level plans and other documents, the absence of drill hole related documentation, such as drill logs, drill hole deviation, core recovery and density measurements, assay certificates, and possible channel sample grade biases, could materially impact the accuracy and reliability of the reported results.\nMineral Processing and Metallurgical Testing\nRise has conducted mineral processing and metallurgical testing analyses on recent drill core from the I-M Mine Property for the purpose of environmental study in conjunction with permitting efforts.\nA significant amount of production has occurred on the I-M Mine Property which confirms that gold can be recovered, mainly by gravity and flotation methods. Nearly all gold at the I-M Mine Property is free milling, as demonstrated by cyanide leaching of concentrates and tailings by the I-M Mine during past production.\nMineral Resource and Mineral Reserve Estimates\nNo estimates of mineral resources have been prepared for the I-M Mine Property. We are not treating historical mineral resource estimates as current mineral resource estimates. In addition, there are no mineral reserves estimates for the I-M Mine Project.\nReferences\nAmerican Society for Testing Materials (ASTM). (2013). ASTM E1527-13, Standard Practice for Environmental Site Assessments: Phase 1 Environmental Site Assessment Process. ASTM International, West Conshohocken, PA. Retrieved at http://www.astm.org/cgi-bin/resolver.cgi?E1527-13\nAsh, Chris. (June 2001). Bulletin 108: Relationship Between Ophiolites and Gold-Quartz Veins in the North American Cordillera. Chapter 8. Geological Survey Branch. Victoria, BC. Retrieved at\nhttp://www.empr.gov.bc.ca/Mining/Geoscience/PublicationsCatalogue/BulletinInformation/BulletinsAfter1940/Pages/Bulletin108.aspx\nCalifornia Department of Conservation (CDC). (April 2017). SMARA Mines - AB 3098 List, Listing as of April 7, 2017). Retrieved at http://www.conservation.ca.gov/dmr/SMARA%20Mines/ab_3098_list/Pages/Index.aspx\nCal. Pub. Res. Code (CPRC). California Public Resources Code. Chapter 9 - Surface Mining and Reclamation Act of 1975. 1975.\nCal. Pub. Res. Code (CPRC). California Public Resources Code. Division 13 - Environmental Quality. 1979.\n- 45 -\nCalifornia Environmental Quality Act (CEQA). (February 1992). City of Sacramento v. State Water Resources Control Board. Retrieved at http://resources.ca.gov/ceqa/cases/1992/sac_swrcb.html\nCity of Grass Valley Community Development Dept. (CoGV-CDD). City of Grass Valley 2020 General Plan Map. Grass Valley, CA. November 2009.\nClark, Jack. Gold In Quartz - The Legendary Idaho Maryland Mine. Grass Valley, CA. 2005.\nEngineering/Remediation Resources Group, Inc. (ERRG). Phase 1 Environmental Site Assessment Round-Hole and New Brunswick Mine Sites. Concord, CA. March 2007.\nGeocon Consultants, Inc. (Geocon). Draft Preliminary Endangerment Assessment Report. Rancho Cordova, CA. August 2016.\nGeomatrix Consultants Inc. (Geomatrix). Summary - Phase II Investigation: Data Collection and Analysis, Brunswick Lumber Mill Site Nevada County, CA. September 2006.\nGroves, D.I., Goldfarb, R.J., Gebre-Mariam, M., Hagemann, S.G., Robert, F. Orogenic gold deposits: A proposed classification in the context of their crustal distribution and relationship to other gold deposit types. Ore Geol. Rev. Special Issue, 13, 7-27. 1998.\nKleinschmidt. City of Grass Valley Sphere of Influence Plan. Prepared for Nevada Local Agency Formation Commission (LAFCo). April 2011.\nLindgren, W. US Geological Survey Grass Valley Special Map. 1894.\nLindgren, Waldemar. The Gold Quartz Veins of Nevada City and Grass Valley Districts, California (1896).\nNevada County Code (NCC). (March 2017). Article 3 Specific Land Uses. Retrieved from http://qcode.us/codes/nevadacounty/?view=desktop&topic=3-ii-2-l__2\nPease, Robert C. Idaho-Maryland Mine Project, Grass Valley CA Technical Report. December 2009.\nShore, F.M for United States Bureau of Mines. Mineral Yearbook 1941. Pg. 252. Washington, D.C. 1943. Retrieved at\nhttp://digital.library.wisc.edu/1711.dl/EcoNatRes.MinYB1941 Item 3. Legal Proceedings\nOn September 17, 2014, we learned that our company, along with a number of additional defendants, was the subject of a notice of civil claim (the \"Claim\") filed in the Supreme Court of British Columbia by Wundr Software Inc. (\"Wundr\"), an eBook software developer. Wundr and our company were formerly parties to a binding letter of intent that was announced on November 12, 2013 (the \"Wundr LOI\"), pursuant to which we proposed to acquire 100% of the outstanding shares of Wundr. On January 10, 2014, we reported that the Wundr LOI had expired.\nAmong other things, the Claim alleges that we committed the tort of intentional interference with economic or contractual relations by virtue of our role in an alleged scheme to establish a competing business to Wundr, and that we, through our agents, breached the terms of the Wundr LOI by appropriating certain confidential information and intellectual property of Wundr for the purpose of establishing a competing business. The Claim also alleges that we are vicariously liable for the actions of our agents.\n- 46 -\nWundr is seeking general damages from our company as well as damages for conspiracy to cause economic harm. None of the allegations contained in the Claim have been proven in court, which we believe are without merit, and we therefore intend to vigorously defend our position against Wundr.\nOther than as described above, we are not aware of any material pending legal proceedings to which it is a party or of which the Property is the subject. We also know of no proceedings to which any of our directors, officers or affiliates, or any registered or beneficial holders of more than 5% of any class of our securities, or any associate of any such director, officer, affiliate or security holder are an adverse party or have a material interest adverse to our company. Item 4. Mine Safety Disclosures\nNone.\nPART II Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock is listed for trading in Canada on the CSE under the symbol \"RISE\" and is quoted in the United States on the OTCQX Market under the symbol \"RYES\".\nHolders\nAs of the date of this Report, there are approximately 163 registered holders of our common stock.\nRecent Sales of Unregistered Securities\nOther than as disclosed in previous quarterly reports on Form 10-Q and current reports on Form 8-K, we have not offered and sold any equity securities that were not registered under the Securities Act during the fiscal year ended July 31, 2023.\n- 47 - Item 6. [Reserved]\nNot applicable\n- 48 - Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion provides information regarding the results of operations for the years ended July 31, 2023 and 2022 and our financial condition, liquidity and capital resources as of July 31, 2023 and July 31, 2022.\nThe following discussion and analysis should be read in conjunction with the information set forth in our audited financial statements and the notes thereto as of and for the years ended July 31, 2023 and July 31, 2022.\nResults of Operations\nFor the Years Ended July 31, 2023 and 2022\nOur operating results for the years ended July 31, 2023 and 2022 are summarized as follows:\nFOR THE YEAR ENDED JULY 31,\nEXPENSES\nAccretion expense $ 149,505\n$ 114,907\nConsulting\n565,885\n527,320\nDirectors' fees\n81,209\n80,000\nFiling and regulatory\n57,751\n32,374\nForeign exchange loss\n45,134\n45,754\nGeneral and administrative\n363,287\n333,888\nGeological, mineral, and prospect costs\n772,636\n788,684\nInterest expense\n328,097\n273,036\nProfessional fees\n757,769\n738,119\nPromotion and shareholder communication\n183,340\n165,987\nSalaries\n135,000\n135,000\nShare-based payments\n466,527\n406,790\nLoss before other items $ (3,906,140 ) $ (3,641,859 )\nGain on fair value adjustment on warrant derivatives\n233,895\n67,856\nWrite-off on payable\n-\n30,739\nOther income\n11,863\n79,137\nNet loss and comprehensive loss for the year\n(3,660,382 )\n(3,464,127 )\nBasic and diluted loss per common share $ (0.10 ) $ (0.12 )\nWeighted average number of common shares outstanding (basic and diluted)\n36,393,029\n29,803,778\n- 49 -\nOur operating expenses increased during the year ended July 31, 2023 compared to the prior year primarily as a result of increased costs as a result of increased activities by our Company. These include salaries, filing and regulatory, general and administrative, professional fees, driven by the need for expenses related to obtaining a use permit while planning and researching our mineral properties, along with activities relating to raising funds in the recent private placements.\nAs a result of the ongoing activities, significant expenses during the year ended July 31, 2023 include:\nIncrease in mineral exploration costs to $772,636 (2022 - $788,684) related to activities surrounding the Use Permit application;\nIncrease in share-based payments to $466,527 (2022 - $406,790) for the grant of options pursuant to our stock option plan to incentivize management and certain consultants;\nIncrease in consulting and professional fees $565,885 and $757,769 respectively (2022 - $527,320 and $738,119, respectively) related to an increase in legal and regulatory items pertaining to the application for a Use Permit to Nevada County California;\nDecrease in other income to $11,863 (2022 - $79,137) as there were less rental income for property use in 2023;\nLiquidity and Capital Resources\nAs of July 31, 2023, the Company had $758,272 in cash, $980,843 in current assets, $5,658,361 in total assets, $508,571 in current liabilities and $2,086,500 in total liabilities, working capital of $472,272 and an accumulated deficit of $26,668,986.\nDuring the year ended July 31, 2023, the Company used $2,476,478 in net cash on operating activities, compared to $2,694,359 in net cash on operating activities during the prior year. The difference in net cash used in operating activities during the year was due to the gain on the fair value of the derivative liability.\nDuring the year ended July 31, 2023, we used net cash of $Nil (2022 - $Nil) in investing activities for the Company.\nDuring the year ended July 31, 2023, the Company received cash from financing activities of $2,762,832 (2022 - $2,392,998) related to the private placements during the year ended July 31, 2023.\nThe Company expects to operate at a loss for at least the next 12 months. It has no agreements for additional financing and cannot provide any assurance that additional funding will be available to finance its operations on acceptable terms in order to enable it to carry out its business plan. There are no assurances that the Company will be able to complete further sales of its common stock or any other form of additional financing. However, the Company has been able to obtain such financings in the past. If the Company is unable to achieve the financing necessary to continue its plan of operations, then it will not be able to carry out any exploration work on the I-M Mine Property or the other properties in which it owns an interest and its business may fail.\nIn recent years, global financial conditions have been characterized by increased volatility which has impacted many industries, including the mining industry. Global financial conditions are subject to sudden and rapid destabilization in response to current and future events, as governmental authorities may have limited resources to respond to such events. Global capital markets continue to experience increased volatility in response to global events such as the significant increase in the rate of inflation in recent years, and the effects of certain countermeasures taken by central banks including increased interest rates. Future economic crises may be precipitated by any number of causes, including natural disasters, epidemics (such as the COVID-19 virus pandemic), geopolitical instability and war (such as the Russian invasion of Ukraine and the current escalating Israel-Palestine conflict), the failure of financial institutions, terrorism, material changes in the price of oil, the volatility of metal prices, and the volatility of global financial markets. Continued increased levels of volatility or a sudden or rapid destabilization of global economic conditions could negatively impact our ability to obtain equity or debt financing or to make other suitable arrangements to finance our Idaho-Maryland Mine Project which, in turn, could have a material adverse effect on our operations and financial condition.\n- 50 -\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on its financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot required. Item 8. Financial Statements and Supplementary Data.\n- 51 -\nCONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in United States Dollars)\nFOR THE YEAR ENDED JULY 31, 2023\n- 52 -\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Directors of\nRise Gold Corp.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Rise Gold Corp. (the Company) as of July 31, 2023 and 2022, and the related consolidated statements of operations and comprehensive loss, changes in stockholders equity, and cash flows for the years then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of Rise Gold Corp. as of July 31, 2023 and 2022, and the results of its operations and its cash flows for the years ended July 31, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the consolidated financial statements, the Company incurred a loss of $3,660,382 for the year ended July 31, 2023 and as of that date, had an accumulated deficit of $26,668,986. These events and conditions raise substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 1. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entity's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\n- 53 -\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAssessment of impairment indicators of mineral property interests\nAs described in Note 5 to the consolidated financial statements, the carrying amount of the Companys mineral property interests was $4,149,053 as at July 31, 2023. As more fully described in Note 3, management applies judgment to evaluate its mineral property interests for indicators of impairment whenever events or changes in circumstance indicate that the carrying amount of the asset may not be recoverable.\nThe principal considerations for our determination that the assessment of impairment indicators of the mineral property interests is a critical audit matter are that there was judgment made by management when assessing whether there were indicators of impairment for the mineral property interests. This in turn led to a high degree of auditor judgment, subjectivity and effort in performing procedures to evaluate audit evidence relating to the judgments made by management in their assessment of indicators of impairment that could give rise to the requirement to prepare an estimate of the recoverable amount of the mineral property interests.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures include, among others:\nevaluating managements assessment of indicators of impairment;\nevaluation of future commodity pricing;\nassessing good standing of mineral property rights; and\nevaluating the Companys current, past, and planned exploration expenditures and ability to carry out future exploration activity.\nWe have served as the Company's auditor since 2013.\n/s/ DAVIDSON & COMPANY LLP\nVancouver, Canada\nChartered Professional Accountants\nOctober 25, 2023\n- 54 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nCONSOLIDATED BALANCE SHEETS\n((Expressed in United States Dollars)\nAS AT\nJuly 31, 2023\nJuly 31, 2022\nASSETS\nCurrent\nCash and cash equivalents $ 758,272\n$ 471,918\nReceivables\n82,529\n85,357\nPrepaid expenses (Note 4)\n140,042\n429,302\nTotal current assets\n980,843\n986,577\nNon-current\nMineral property interests (Note 5)\n4,149,053\n4,149,053\nEquipment (Note 6)\n528,465\n551,436\nTotal assets $ 5,658,361\n$ 5,687,066\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent\nAccounts payable and accrued liabilities $ 457,412\n$ 321,942\nPayable to related parties (Note 8)\n51,159\n28,018\nTotal current liabilities\n508,571\n349,960\nNon-current\nLoan payable (Note 9)\n1,437,914\n1,364,530\nDerivative liability (Note 10)\n140,015\n373,910\nTotal liabilities\n2,086,500\n2,088,400\nStockholders' equity\nCapital stock, $0.001 par value, 400,000,000 shares authorized;\n40,362,800 (July 31, 2022 - 32,787,798) shares issued and outstanding (Note 11)\n40,363\n32,788\nAdditional paid-in capital (Note 11)\n30,304,568\n26,678,566\nCumulative translation adjustment\n(104,084 )\n(104,084 )\nDeficit\n(26,668,986 )\n(23,008,604 )\nTotal stockholders' equity\n3,571,861\n3,598,666\nTotal liabilities and stockholders' equity $ 5,658,361\n$ 5,687,066\nNature and continuance of operations (Note 1)\nContingency (Note 7)\nSubsequent event (Note 15)\nApproved and authorized by the Board on October 25, 2023.\n\"Benjamin Mossman\"\nDirector\n\"Murray Flanigan\"\nDirector\nBenjamin Mossman\nMurray Flanigan\nThe accompanying notes are an integral part of these consolidated financial statements.\n- 55 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nCONSOLIDATED STATEMENT OF OPERATIONS AND COMPREHENSIVE LOSS\n(Expressed in United States Dollars)\nFOR THE YEAR ENDED JULY 31,\nEXPENSES\nAccretion expense (Note 9) $ 149,505\n$ 114,907\nConsulting\n565,885\n527,320\nDirectors' fees\n81,209\n80,000\nFiling and regulatory\n57,751\n32,374\nForeign exchange loss\n45,134\n45,754\nGeneral and administrative\n363,287\n333,888\nGeological, mineral, and prospect costs (Note 5)\n772,636\n788,684\nInterest expense (Note 9)\n328,097\n273,036\nProfessional fees\n757,769\n738,119\nPromotion and shareholder communication\n183,340\n165,987\nSalaries\n135,000\n135,000\nShare-based payments (Note 11)\n466,527\n406,790\nLoss before other items\n(3,906,140 )\n(3,641,859 )\nGain on fair value adjustment on derivative liability (Note 10)\n233,895\n67,856\nWrite-off on payable\n-\n30,739\nOther income\n11,863\n79,137\nNet loss and comprehensive loss for the year\n(3,660,382 )\n(3,464,127 )\nBasic and diluted loss per common share $ (0.10 ) $ (0.12 )\nWeighted average number of common shares outstanding (basic and diluted)\n36,393,029\n29,803,778\nThe accompanying notes are an integral part of these consolidated financial statements.\n- 56 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nCONSOLIDATED STATEMENT OF CASH FLOWS\n(Expressed in United States Dollars)\nFOR THE YEAR ENDED JULY 31,\nCASH FLOWS FROM OPERATING ACTIVITIES\nLoss for the year $ (3,660,382 ) $ (3,464,127 )\nItems not involving cash:\nInterest expense\n328,097\n273,036\nDepreciation\n22,971\n24,345\nShare-based payment\n466,527\n406,790\nAccretion expense\n149,505\n114,907\nGain on fair value adjustment on warrant derivatives\n(233,895 )\n(67,856 )\nNon-cash working capital item changes:\nReceivables\n2,828\n(41,244 )\nPrepaid expenses\n289,260\n(90,268 )\nAccounts payables and accrued liabilities\n135,470\n156,050\nPayable to related parties\n23,141\n(5,992 )\nNet cash used in operating activities\n(2,476,478 )\n(2,694,359 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nPrivate placement, net of issuance cost (Note 11)\n2,985,423\n2,392,998\nLoan repayment\n(250,000 )\n-\nProceeds from exercise of options\n27,409\n-\nNet cash provided by financing activities\n2,762,832\n2,392,998\nChange in cash and cash equivalents for the year\n286,354\n(301,361 )\nCash and cash equivalents, beginning of year\n471,918\n773,279\nCash and cash equivalents, end of year $ 758,272\n$ 471,918\nSupplemental disclosure with respect to cash flows (Note 13)\nThe accompanying notes are an integral part of these consolidated financial statements.\n- 57 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nCONSOLIDATED STATEMENT OF STOCKHOLDERS' EQUITY\n(Expressed in United States Dollars)\nCapital Stock\nCumulative\nAdditional Paid-in\nTranslation\nNumber\nAmount\nCapital\nAdjustment\nDeficit\nTotal\nBalance as at July 31, 2021\n26,770,298\n$ 26,770\n$ 23,884,796\n$ (104,084 ) $ (19,544,477 ) $ 4,263,005\nShares issued for cash, net of issuance cost\n6,017,500\n6,018\n2,386,980\n-\n-\n2,392,998\nShare-based compensation\n-\n-\n406,790\n-\n-\n406,790\nLoss for the year\n-\n-\n-\n-\n(3,464,127 )\n(3,464,127 )\nBalance as at July 31, 2022\n32,787,798\n$ 32,788\n$ 26,678,566\n$ (104,084 ) $ (23,008,604 ) $ $3,598,666\nShares issued for cash, net of issuance cost\n7,500,002\n7,500\n2,977,923\n-\n-\n2,985,423\nOptions exercise\n75,000\n27,334\n-\n-\n27,409\nWarrants issued for loan modification\n-\n-\n154,218\n-\n-\n154,218\nShare-based compensation\n-\n-\n466,527\n-\n-\n466,527\nLoss for the year\n-\n-\n-\n-\n(3,660,382 )\n(3,660,382 )\nBalance as at July 31, 2023\n40,362,800\n$ 40,363\n$ 30,304,568\n$ (104,084 ) $ (26,668,986 ) $ 3,571,861\nThe accompanying notes are an integral part of these consolidated financial statements.\n- 58 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n1. NATURE AND CONTINUANCE OF OPERATIONS\nRise Gold Corp. (the \"Company\") was originally incorporated as Atlantic Resources Inc. in the State of Nevada on February 9, 2007 and is in the exploration stage. On April 11, 2012, the Company merged its wholly-owned subsidiary, Patriot Minefinders Inc., a Nevada corporation, in and to the Company to effect a name change to Patriot Minefinders Inc. On January 14, 2015, the Company completed a name change to Rise Resources Inc. in the same manner. On March 29, 2017, the Company changed its name to Rise Gold Corp. These mergers were carried out solely for the purpose of effecting these changes of names.\nOn September 18, 2020, the Company increased its authorized capital from 40,000,000 shares to 400,000,000 shares.\nOn January 29, 2016, the Company completed an initial public offering in Canada and began trading on the Canadian Securities Exchange (\"CSE\") on February 1, 2016.\nThe Company is in the early stages of exploration and as is common with any exploration company, it raises financing for its acquisition activities. The accompanying consolidated financial statements have been prepared on the going concern basis, which presumes that the Company will continue operations for the foreseeable future and will be able to realize its assets and discharge its liabilities in the normal course of business. The Company has incurred a loss of $3,660,382 for the year ended July 31, 2023 and has accumulated a deficit of $26,668,986. The ability of the Company to continue as a going concern is dependent on the Company's ability to maintain continued support from its shareholders and creditors and to raise additional capital and implement its business plan. There is no assurance that the Company will be able to obtain adequate financing in the future or that such financing will be on terms advantageous to the Company. These events and conditions cast substantial doubt about the Company's ability to continue as a going concern. The consolidated financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nAt July 31, 2023, the Company had working capital of $472,272 (2022 - working capital of $636,617).\n2. BASIS OF PREPARATION\nGenerally accepted accounting principles\nThese consolidated financial statements have been prepared in conformity with generally accepted accounting principles of the United States of America (\"US GAAP\") for financial information with the instructions to Form 10-K and Regulation S-K.\n- 59 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n2. BASIS OF PREPARATION (continued)\nBasis of Consolidation\nThese consolidated financial statements include the accounts of the Company and its wholly owned subsidiary, Rise Grass Valley Inc. All significant intercompany accounts and transactions have been eliminated on consolidation.\nSubsidiaries\nSubsidiaries are all entities over which the Company has exposure to variable returns from its involvement and has the ability to use power over the investee to affect its returns. The existence and effect of potential voting rights that are currently exercisable or convertible are considered when assessing whether the Company controls another entity. Subsidiaries are fully consolidated from the date on which control is transferred to the Company until the date on which control ceases.\nThe accounts of subsidiaries are prepared for the same reporting period as the parent company, using consistent accounting policies. Intercompany transactions, balances and unrealized gains or losses on transactions are eliminated upon consolidation.\nUse of Estimates\nThe preparation of these financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates. Significant areas requiring the use of estimates include the carrying value and recoverability of mineral properties and the recognition of deferred tax assets based on the change in unrecognized deductible temporary tax differences. Actual results could differ from those estimates and would impact future results of operations and cash flows.\nFunctional and reporting currency\nThe Company and its wholly owned subsidiary, Rise Grass Valley Inc. functional and reporting currency is the United States dollar. Transactions in currencies other than the functional currency of the Company are initially translated into the functional currency by applying the exchange rates prevailing at the date of the transaction. Monetary assets and liabilities denominated in foreign currencies are translated at the exchange rate prevailing at the date of the statement of financial position. Non-monetary assets and liabilities are translated at historical exchange rates, unless the item is carried at fair value, in which case it will be translated at the exchange rate in effect at the date when the fair value was determined. Resulting foreign exchange gains and losses are recognized in income or loss.\n- 60 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n3. SIGNIFICANT ACCOUNTING POLICIES\nDerivative liability\nDerivatives are initially recognized at the fair value on the date the derivative contract is entered into and transaction costs are expensed. The Company's derivatives are subsequently re-measured at their fair value at each balance sheet date with changes in fair value recognized in profit or loss. As the exercise price of the Company's warrants are in Canadian Dollars, and the functional currency of the Company is the United States Dollar, these warrants are considered a derivative as a variable amount of cash in the Company's functional currency will be received upon exercise.\nReceivables\nThe Company reviews all receivables that exceed terms and establishes an allowance for doubtful accounts based on management's assessment of the collectability of trade and other receivables.\nMineral property\nThe costs of acquiring mineral rights are capitalized at the date of acquisition. After acquisition, various factors can affect the recoverability of the capitalized costs. If, after review, management concludes that the carrying amount of a mineral property is impaired, it will be written down to estimated fair value. Exploration costs incurred on mineral properties are expensed as incurred. Development costs incurred on proven and probable reserves will be capitalized. Upon commencement of production, capitalized costs will be amortized using the unit-of-production method over the estimated life of the ore body based on proven and probable reserves (which exclude non-recoverable reserves and anticipated processing losses). When the Company receives an option payment related to a property, the proceeds of the payment are applied to reduce the carrying value of the exploration asset.\nLong-lived assets\nLong-lived assets, consisting of equipment held and used by the Company are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. For purposes of evaluating the recoverability of long-lived assets, the recoverability test is performed using undiscounted net cash flows related to the long-lived assets. If such assets are considered to be impaired, the impairment recognized is measured by the amount by which the carrying amount of the assets exceeds the fair value of the assets. Assets to be disposed of are reported at the lower of the carrying amount or fair value less costs to sell.\nEquipment\nEquipment is recorded at cost less accumulated depreciation. Depreciation is provided over the assets' useful lives on a straight-line basis. Equipment purchased by the Company is depreciated over 15 years.\nAsset retirement obligations\nThe Company records the fair value of an asset retirement obligation as a liability in the period in which it incurs a legal obligation associated with the retirement of tangible long-lived assets that result from the acquisition, construction, development, and/or normal use of the long-lived assets. The Company also records a corresponding asset which is amortized over the life of the asset. Subsequent to the initial measurement of the asset retirement obligation, the obligation is adjusted at the end of each period to reflect the passage of time (accretion expense) and changes in the estimated future cash flows underlying the obligation (asset retirement cost).\n- 61 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n3. SIGNIFICANT ACCOUNTING POLICIES (continued)\nLoss per share\nBasic loss per common share is computed using the weighted average number of common shares outstanding during the year. To calculate diluted loss per share, the Company adjusts net income (loss) attributable to common shareholders and the weighted average number of common shares outstanding for the effects of all dilutive potential common shares such as stock options and warrants. As at July 31, 2023, 3,638,500 outstanding options and 16,661,247 outstanding warrants were excluded from the diluted calculation. In reporting periods when a loss is incurred, potential issuance of shares would be anti-dilutive and, therefore, basic and diluted loss per share are the same.\nFinancial instruments\nThe Company's financial instruments consist of cash, receivables, accounts payable and accrued liabilities, loan payable and payable to related parties. It is management's opinion that the Company is not exposed to significant interest, currency or credit risks arising from its financial instruments. The fair values of these financial instruments approximate their carrying values unless otherwise noted.\nFair value of financial assets and liabilities\nThe Company measures the fair value of financial assets and liabilities based on US GAAP guidance which defines fair value, establishes a framework for measuring fair value, and expands disclosures about fair value measurements.\nThe Company classifies financial assets and liabilities as held-for-trading, available-for-sale, held-to-maturity, loans and receivables or other financial liabilities depending on their nature. Financial assets and financial liabilities are recognized at fair value on their initial recognition, except for those arising from certain related party transactions which are accounted for at the transferor's carrying amount or exchange amount.\nFinancial assets and liabilities classified as held-for-trading are measured at fair value, with gains and losses recognized in net income. Financial assets classified as held-to-maturity, loans and receivables, and financial liabilities other than those classified as held-for-trading are measured at amortized cost, using the effective interest rate method of amortization. Financial assets classified as available-for-sale are measured at fair value, with unrealized gains and losses being recognized as other comprehensive income until realized, or if an unrealized loss is considered other than temporary, the unrealized loss is recorded in income.\nThe following indicates the fair value hierarchy of the valuation techniques the Company utilizes to determine the fair value of financial assets that are measured at fair value on a recurring basis.\nLevel 1 - Unadjusted quoted prices in active markets for identical assets and liabilities;\nLevel 2 - Inputs other than quoted prices that are observable for the asset or liability either directly or indirectly; and\nLevel 3 - Inputs that are not based on observable market data.\nCash is considered level 1 and classified as cash on hand and held at banks. The derivative liability is recognized at fair value using level 2 inputs as the fair value of derivatives was determined using a Black-Scholes option pricing formula.\nFinancial instruments, including payable to related parties, accounts payable, accrued liabilities and loan payable are classified as other financial liabilities and are carried at cost, which management believes approximates fair value due to the short-term nature of these instruments.\n- 62 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n3. SIGNIFICANT ACCOUNTING POLICIES (continued)\nConcentration of credit risk\nThe financial instrument which potentially subjects the Company to concentration of credit risk is cash. The Company maintains cash in bank accounts that, at times, may exceed federally insured limits. However, the Company has not experienced any losses in such accounts and believes it is not exposed to any significant risks on its cash in bank accounts.\nStock-based compensation\nThe Company accounts for share-based compensation under the provisions of ASC 718, \"Compensation-Stock Compensation\". Under the fair value recognition provisions, stock-based compensation expense is measured at the fair value of the consideration received, or the fair value of the equity instruments issued, or liabilities incurred, whichever is more reliably measured. Share-based compensation for all stock-based awards to employees and directors is recognized as an expense over the requisite service period, which is generally the vesting period. The Black-Scholes option valuation model is used to calculate fair value.\nIncome taxes\nThe Company accounts for income taxes under the asset and liability method, whereby deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Current income taxes are recognized for the estimated income taxes payable or receivable on taxable income or loss from the current year and any adjustment to income taxes payable related to previous years. Current income taxes are determined using tax rates and tax laws that have been enacted or subsequently enacted by the year-end date.\nDeferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Under the asset and liability method the effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance is recognized if it is more likely than not that some portion or all of the deferred tax asset will not be recognized.\nRecently adopted and recently issued accounting standards\nThe Company has determined that other significant newly issued accounting pronouncements are either not applicable to the Company's business or that no material effect is expected on the financial statements as a result of future adoption.\n4. PREPAID EXPENSES\nJuly 31, 2023\nJuly 31, 2022\nInsurance $ 79,758\n$ 71,424\nDeposits\n50,539\n342,987\nOther\n9,745\n14,891\n$ 140,042\n$ 429,302\n- 63 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n5. MINERAL PROPERTY INTERESTS\nThe Company's mineral properties balance consists of:\nIdaho-Maryland, California\nEnding balance, July 31, 2023 and 2022 $ 4,149,053\nTitle to mineral properties\nTitle to mineral properties involves certain inherent risks due to the difficulties of determining the validity of certain mineral titles as well as the potential for problems arising from the frequently ambiguous conveying history characteristic of many mineral properties. As at July 31, 2023, the Company holds title to the Idaho-Maryland Gold Mine Property.\nAs of July 31, 2023, based on management's review of the carrying value of mineral rights, management determined that there is no evidence that the cost of these acquired mineral rights will not be fully recovered and accordingly, the Company determined that no adjustment to the carrying value of mineral rights was required. As of the date of these consolidated financial statements, the Company has not established any proven or probable reserves on its mineral properties and has incurred only acquisition and exploration costs.\nIdaho-Maryland Gold Mine Property, California\nOn August 30, 2016, the Company entered into an option agreement with three parties to purchase a 100% interest in and to the Idaho-Maryland Gold Mine property located near Grass Valley, California, United States. Pursuant to the option agreement, in order to exercise the option, the Company was required to pay $2,000,000 by November 30, 2016. Upon execution of the option agreement, the Company paid the vendors a non-refundable cash deposit in the amount of $25,000, which would be credited against the purchase price of $2,000,000 upon exercise of the option. On November 30, 2016, the Company negotiated an extension on the closing date of the option agreement to December 26, 2016, in return for a cash payment of $25,000, which would be credited against the purchase price of $2,000,000 upon exercise of the option. On December 28, 2016, the Company negotiated a further no-cost extension of the closing date of the option agreement to April 30, 2017. On January 25, 2017, the Company exercised the option by paying $1,950,000 and acquired a 100% interest in the Idaho-Maryland Gold Mine property.\nIn connection with the option agreement, the Company agreed to pay a cash commission of $140,000 equal to 7% of the purchase price of $2,000,000. The commission was settled on January 25, 2017 through the issuance of 92,000 units valued at $1.16 (C$2.00) per unit. Each unit consisted of one share of common stock and one transferable share purchase warrant exercisable into one share of common stock at a price of $3.04 (C$4.00) for a period of two years from the date of issuance. The Company also incurred additional transaction costs of $109,053, which have been included in the carrying value of the Idaho-Maryland Gold Mine.\n- 64 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n5. MINERAL PROPERTY INTERESTS (cont'd...)\nOn January 6, 2017, the Company entered into an option agreement with Sierra Pacific Industries Inc. (\"Sierra\") to purchase a 100% interest in and to certain surface rights located near Grass Valley, California, United States, contiguous to the Idaho-Maryland Gold Mine property acquired by the Company on January 25, 2017. Pursuant to the option agreement, in order to exercise the option, the Company was required to pay $1,900,000 by March 31, 2017. Upon execution of the option agreement, the Company paid the vendors a non-refundable cash deposit in the amount of $100,000, which was credited against the purchase price of $1,900,000 upon exercise of the option. On April 3, 2017, the Company negotiated an extension of the closing date of the option agreement to June 30, 2017, in return for a cash payment of $200,000, at which time a payment of $1,600,000 was due in order to exercise the option. On June 7, 2017, the Company negotiated an extension of the closing date of the option agreement to September 30, 2017, in return for a cash payment of $300,000, at which time a payment of $1,300,000 was due in order to exercise the option.\nOn May 14, 2018, the Company completed the purchase of the surface rights by making final payments totalling $1,300,000.\nAs at July 31, 2023, the Company has incurred cumulative exploration expenditures of $8,730,982 on the Idaho-Maryland Gold Mine property as follows:\nYear ended\nJuly 31, 2023\nYear ended\nJuly 31, 2022\nIdaho-Maryland Gold Mine expenditures:\nOpening balance $ 7,958,346\n$ 7,169,662\nConsulting\n629,183\n549,468\nDepreciation\n22,971\n24,345\nEngineering\n20,370\n91,635\nExploration\n(28,183 )\n(15,856 )\nLogistics\n21,815\n3,037\nRent\n97,332\n88,517\nSupplies\n9,148\n23,433\nSampling\n-\n24,105\nTotal expenditures for the year\n772,636\n788,684\nClosing balance $ 8,730,982\n$ 7,958,346\n- 65 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n6. EQUIPMENT\nCost\nDrilling equipment\nAt July 31, 2021 $ 644,847\nAt July 31, 2022 $ 644,847\nAt July 31, 2023 $ 644,847\nAccumulated depreciation\nAt July 31, 2021 $ 69,066\nDepreciation\n24,345\nAt July 31, 2022 $ 93,411\nDepreciation\n22,971\nAt July 31, 2023 $ 116,382\nTotal carrying value, July 31, 2022 $ 551,436\nTotal carrying value, July 31, 2023 $ 528,465\nDepreciation of equipment is included in geological, mineral, and prospect costs (Note 5).\n7. CONTINGENCY\nDuring the year ended July 31, 2014, the Company entered into a binding letter of intent (\"LOI\") with Wundr Software Inc. (\"Wundr\"). Under the terms of the LOI, the Company would acquire 100% of the issued and outstanding common shares of Wundr. Due to unforeseen circumstances, the Company did not complete the transactions contemplated in the LOI, which the Company announced had expired on January 10, 2014.\nOn September 17, 2014, the Company learned that it was the subject, along with a number of additional defendants, of a notice of civil claim (the \"Claim\") filed in the Supreme Court of British Columbia by Wundr, under which Wundr is seeking general damages from the Company as well as damages for conspiracy to cause economic harm. None of the allegations contained in the Claim have been proven in court. Management has determined that the probability of the Claim resulting in an unfavourable outcome and financial loss to the Company is unlikely.\n8. RELATED PARTY TRANSACTIONS\nKey management personnel consist of the Chief Executive Officer, Chief Financial Officer, and the directors of the Company. The remuneration of the key management personnel is as follows:\na) Salaries of $135,000 (2022 - $135,000) were paid or accrued to the CEO of the Company.\nb) Directors' fees of $81,209 (2022 - $80,000) to directors of the Company.\nc) During the year ended July 31, 2023, the Company paid $134,140 (2022 - $141,822) in professional fees to a company controlled by a director of the Company.\nd) Share-based compensation of $421,883 (2022 - $394,158) for options granted during the year ended July 31, 2023.\ne) As at July 31, 2023, $51,159 (2022 - $28,018) was owed to related parties.\n- 66 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n9. LOAN PAYABLE\nOn September 3, 2019, the Company completed a debt financing with Eridanus Capital LLC (the \"Lender\") for $1,000,000 (the \"Loan\"). The Loan has a term of 4 years and an annual interest rate of 10% for the first two years increasing to 20% in year 3 and to 25% in year 4. Interest will accrue and be paid along with the principal upon the maturity date. The Lender received 1,150,000 bonus share purchase warrants as additional consideration for advancing the Loan. The fair value of these warrants was calculated to be $444,942 which was netted against the loan payable balance along with $15,000 paid to the lender for a total of $459,942 in issuance costs. Each warrant entitles the holder to acquire one share of common stock at an exercise price of $0.80 (C$1.00) for a period of three years from the date of issuance. The Loan may be repaid prior to the maturity date, in whole or in part, provided that all accrued interest is paid. In addition, if total interest payments are less than $200,000, the difference will be paid to the Lender as prepayment compensation. The Loan is secured against the assets of the Company and its subsidiary and will be used for permitting, engineering, and working capital at the Company's Idaho Maryland Gold Project.\nLoan Payable\nBalance, July 31, 2021 $ 976,587\nInterest expense\n273,036\nAccretion expense\n114,907\nBalance, July 31, 2022 $ 1,364,530\nInterest expense\n328,097\nAccretion expense\n149,505\nIssuance costs\n(154,218 )\nRepayment\n(250,000 )\nBalance, July 31, 2023 $ 1,437,914\nIn February 2023, the Company renegotiated its debt agreement with the Lender whereby the Company agreed to pay $250,000 applied against unpaid and accrued interest and issue 575,000 share purchase warrants to the Lender. The maturity date of the loan has been extended by one year to September 4, 2024 and the interest rate has been reduced to 15% compounding monthly for a period of 12 months after which it reverts to 25% per annum, compounding monthly. The renegotiation of the debt was accounted for as a non - substantial debt modification. Accordingly, no gain or loss was recorded and a new effective interest rate of 32.67% was established based on the carrying value of the debt and the revised cash flow. Each warrant entitles the holder to acquire one share at an exercise price of $0.60 for a period of two years from the date of issuance. The fair value of these warrants was calculated to be $154,218 which was netted against the loan payable balance.\nThe following weighted average assumptions were used for the Black-Scholes pricing model valuation of warrants:\nFebruary 17, 2023\nRisk-free interest rate 4.15%\nExpected life of warrants 2 years\nExpected annualized volatility 99.02%\nShare price at grant date $0.53\nExercise price $0.60\nFair value $0.27\nDividend Nil\nForfeiture rate 0%\n- 67 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n10. DERIVATIVE LIABILITY\nThe exercise price of the Company's share purchase warrants is fixed in Canadian dollars and the functional currency of the Company is the US dollar. These warrants are considered to be a derivative as a variable amount of cash in the Company's functional currency that will be received on exercise of the warrants. Accordingly, the share purchase warrants issued as part of past financings, are classified, and accounted for as warrant derivative. Share purchase warrants with a compensatory nature are not included in this calculation.\nThe following table shows a continuity of the Company's fair value of warrant derivative:\nWarrant derivative\nNumber of warrants\naccounted for as\nderivative liability\nBalance, July 31, 2021 $ 441,766\n5,480,083\nExpiry\n-\n(488,438 )\nFair value adjustment\n(67,856 )\n-\nBalance, July 31, 2022 $ 373,910\n4,991,645\nFair value adjustment\n(233,895 )\n-\nBalance, July 31, 2023 $ 140,015\n4,991,645\nDuring the year ended July 31, 2023, the Company recorded a gain on fair value adjustment on derivative liability of $233,895 (July 31, 2022 - gain of $67,856).\nThe following weighted average assumptions were used for the Black-Scholes pricing model valuation of warrants derivative as at July 31, 2023 and July 31, 2022:\nJuly 31, 2023 July 31, 2022\nRisk-free interest rate 4.67% 1.52%\nExpected life of warrants 0.93 to 1.05 years 1.93 to 2.05 years\nExpected annualized volatility 151.04% to 154.60% 89.49% to 90.89%\nDividend Nil Nil\nForfeiture rate 0% 0%\n- 68 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n11. CAPITAL STOCK AND ADDITIONAL PAID-IN CAPITAL\nPrivate Placements\nOn February 17, 2023, the Company completed a non-brokered private placement over two tranches for gross proceeds totaling $3,000,000 through the issuance of 7,500,000 units in total at a price of $0.40 per unit, where each unit consisted of one share of common stock and one-half of one share purchase warrant. Each whole warrant entitles the holder to acquire one additional share of common stock at an exercise price of $0.60 until January 31, 2025 and February 17, 2025. Certain directors of the Company purchased an aggregate of 2,394,299 units of the private placement for gross proceeds of $957,720. The Company paid fees of $4,014 and issued 10,440 finder's warrants relating to the first tranche, where each finder's warrant entitles the holder to acquire one share of common stock at a price of $0.60 until January 31, 2025 and February 17, 2025. The Company paid legal fees of $10,563 in connection with this financing.\nOn January 31, 2022, the Company completed a non-brokered private placement for gross proceeds totalling $2,407,000 through the issuance of 6,017,500 units at a price of $0.40 per unit, where each unit consisted of one share of common stock and one share purchase warrant. Each warrant entitles the holder to acquire one additional share of common stock at an exercise price of $0.60 until January 28, 2024. Certain directors of the Company purchased an aggregate of 2,075,000 units of this private placement for gross proceeds of $830,000. The Company has paid associated legal fees of $14,002 in connection with this financing.\nStock Options\nOn February 21, 2023, the Company granted a total of 1,045,000 stock options with a fair value of $466,527 to employees, officers, directors and consultants of the Company, exercisable at a weighted average price of $0.53 (C$0.72) per share until February 21, 2028.\nOn February 7, 2022, the Company granted a total of 805,000 stock options with a fair value of $406,790 to employees, officers, directors, and consultants of the Company, exercisable at a weighted average price of $0.65 (C$0.82) per share for a period of five years.\nThe following incentive stock options were outstanding and exercisable as at July 31, 2023:\nNumber\nof Options\nWeighted\nAverage\nExercise\nPrice (C$)\nExpiry Date\n170,000\n1.00\nNovember 30, 2023\n280,000\n0.70\nAugust 21, 2024\n1,338,500\n1.20\nSeptember 22, 2025\n805,000\n0.82\nFebruary 7, 2027\n1,045,000\n0.72\nFebruary 21, 2028\n3,638,500\n0.93\n- 69 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n11. CAPITAL STOCK AND ADDITIONAL PAID-IN CAPITAL (continued)\nAs at July 31, 2023, the aggregate intrinsic value of the Company's stock options is $Nil (2022 - $Nil).\nStock option transactions are summarized as follows:\nNumber of Options\nWeighted Average\nExercise Price ($C)\nBalance outstanding and exercisable, July 31, 2021 2,233,500\n1.09\nOptions granted 805,000\n0.82\nBalance outstanding and exercisable, July 31, 2022 3,038,500\n1.02\nOptions granted 1,045,000\n0.72\nOptions cancelled -60,000\n1.08\nOptions expired -310,000\n1.20\nOptions exercised -75,000\n0.50\nBalance outstanding and exercisable, July 31, 2023 3,638,500\n$\n0.93\nThe following weighted average assumptions were used for the Black-Scholes pricing model valuation of stock options issued during the year ended July 31:\nRisk-free interest rate 3.58% 1.38%\nExpected life of stock options\n5 years\n5 years\nExpected annualized volatility 122.01% 114.02%\nDividend Nil Nil\nForfeiture rate 0% 0%\nShare-Based Payments\nThe Company has a stock option plan under which it is authorized to grant options to executive officers and directors, employees and consultants enabling them to acquire up to 10% of the issued and outstanding common stock of the Company. Under the plan the exercise price of each option equals the market price of the Company's stock, less any applicable discount, as calculated on the date of grant. The options can be granted for a maximum term of 5 years with vesting determined by the board of directors.\nWarrants\nOn June 14, 2022, the Company amended the term of 6,308,310 common share purchase warrants by extending their expiry dates by two years and adding an accelerated expiry provision. Between July 3, 2019 and September 21, 2020 the Company issued a total of 6,308,310 warrants to purchase shares of common stock of the Company in connection with various private placement financings and debt financings. 3,959,727 of these warrants were granted with an exercise price of CAD$1.00 per share (\"CAD Priced Warrants\") or optional currency settlement choice with amended expiry dates ranging from July 3, 2024 to September 9, 2024, and 2,348,583 of these warrants were granted with an exercise price of US$1.00 per share (\"USD Priced Warrants\") with amended expiry dates ranging from July 31, 2024 to September 21, 2024. All other terms and conditions of the warrants remain unchanged.\n- 70 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n11. CAPITAL STOCK AND ADDITIONAL PAID-IN CAPITAL (continued)\nThe following warrants were outstanding as at July 31, 2023:\nNumber\nof Warrants\nExercise\nPrice\n(C$)\nExpiry Date\n518,406\n1.00\nJuly 3, 2024\n2,291,321\n1.00\nAugust 19, 2024\n1,150,000\n1.00\nSeptember 9, 2024\n2,181,917\n1.36\nJuly 31, 2024\n166,666\n1.36\nSeptember 21, 2024\n6,017,500\n0.76\nJanuary 28, 2024\n2,231,429\n0.80\nJanuary 31, 2025\n1,529,008\n0.80\nFebruary 17, 2025\n575,000\n0.80\nFebruary 17, 2025\n16,661,247\n0.91\nWarrant transactions are summarized as follows:\nNumber of Warrants\nWeighted Average\nExercise Price (C$)\nBalance, July 31, 2021 6,851,379\n1.14\nWarrants issued 6,017,500\n0.76\nWarrants expired (531,873 )\n(1.21 )\nBalance, July 31, 2022 12,337,006\n0.95\nWarrants issued 4,335,437\n0.80\nWarrants expired (11,196 )\n(1.00 )\nBalance, July 31, 2023 16,661,247\n$\n0.91\n- 71 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n12. INCOME TAXES\nA reconciliation of income taxes (recovery) at statutory rates with the reported taxes is as follows:\nLoss before income taxes $ (3,660,382 ) $ (3,464,127 )\nExpected income tax (recovery) at statutory tax rates $ (978,000 ) $ (887,000 )\nChange in statutory, foreign tax, foreign exchange rates and other\n703,000\n1,068,000\nPermanent differences\n125,000\n101,000\nAdjustment to prior years provision versus statutory tax returns and expiry of non-capital losses\n(1,391,000 )\n-\nChange in unrecognized deductible temporary difference\n1,541,000\n(282,000 )\nIncome tax recovery $ -\n$ -\nSignificant components of deferred tax assets (liabilities) that have not been included on the Company's consolidated balance sheet are as follows:\nDeferred tax assets (liabilities):\nExploration and evaluation assets $ 310,000\n$ 49,000\nMineral property interest\n(87,000 )\n(21,000 )\nNon-capital losses available for future period\n4,125,000\n1,630,000\n4,348,000\n1,658,000\nUnrecognized deferred tax assets\n(4,348,000 )\n(1,658,000 )\nNet deferred tax assets $ -\n$ -\nThe Company has approximately $11,502,000 (2022 - $6,100,000) in net operating losses which may be carried forward and applied against taxable income in future years.\nThe significant components of the Company's temporary differences, unused tax credits and unused tax losses that have not been included on the consolidated statement of financial position are as follows:\nExpiry Date Range\nExpiry Date Range\nTemporary Differences\nExploration and evaluation assets $ 1,161,000\nNo expiry date\n$ 181,000\nNo expiry date\nEquipment\n(326,000 )\nNo expiry date\n81,000\nNo expiry date\nNon-capital losses available for future period\n11,502,000\n2027 to Indefinite\n6,100,000\n2027 to Indefinite\nUSA $ 12,337,000\n2027 to Indefinite\n$ 6,362,000\n2027 to Indefinite\nTax attributes are subject to review and potential adjustments by tax authorities.\n- 72 -\nRISE GOLD CORP.\n(An Exploration Stage Company)\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2023\n(Expressed in United States Dollars)\n13. SUPPLEMENTAL DISCLOSURE WITH RESPECT TO CASH FLOWS\nDuring the years ended July 31, 2023 and 2022, the Company had the following non-cash financing and investing activities:\nFor the year ended July 31, 2023:\na) The Company accrued $328,097 of interest expense as part of the outstanding balance of loan payable.\nb) The Company issued a total of 575,000 share purchase warrants for loan modification entitling the holder to acquire one share an exercise price of $0.60 until May 17, 2025 with a total fair value of $154,218.\nFor the year ended July 31, 2022:\na) The Company accrued $273,036 of interest expense as part of the outstanding balance of loan payable.\nDuring the years ended July 31, 2023, the Company had the following cash financing and investing activities:\nThe Company paid $250,000 and applied it against unpaid and accrued interest on its loan payable.\n14. SEGMENTED INFORMATION\nA reporting segment is defined as a component of the Company that:\n- Engages in business activities from which it may earn revenues and incur expenses;\n- Operating results are reviewed regularly by the entity's chief operating decision maker; and\n- Discrete financial information is available\nThe Company has determined that it operates its business in one geographical segment located in California, United States, where all of its equipment and mineral property interests are located.\n15. SUBSEQUENT EVENT\nSubsequent to July 31, 2023, the Company granted a total of 397,780 stock options to officers and directors of the Company. The stock options are exercisable at a price of $0.26 per share until September 22, 2028.\n- 73 - Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nThe United States Securities and Exchange Commission (the \"SEC\") defines the term \"disclosure controls and procedures\" to mean controls and other procedures of an issuer that are designed to ensure that information required to be disclosed in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SEC's rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to the issuer's management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nAs of the end of the period covered by this Report, our management carried out an evaluation, with the participation of its Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures. Based on this evaluation, management concluded that our disclosure controls and procedures were not effective as of July 31, 2023 because of a material weakness in internal control over financial reporting that existed as of that date, as more fully described below.\nManagement's Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the company's assets that could have a material effect on the financial statements.\nWe carried out an evaluation, with the participation of our Chief Executive Officer and Chief Financial Officer, of the effectiveness of its internal control over financial reporting as of July 31, 2023. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\") in Internal Control-Integrated 2013 Framework. Management concluded that our company's internal control over financial reporting was not effective as of July 31, 2023 because a material weakness in internal control over financial reporting existed as of that date as a result of a lack of segregation of incompatible duties due to insufficient personnel. A material weakness is a deficiency or a combination of control deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of annual or interim financial statements will not be prevented or detected on a timely basis.\n- 74 -\nThis annual report does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting. Management's report was not subject to attestation by our independent registered public accounting firm pursuant to a provision under the Dodd-Frank Wall Street Reform and Consumer Protection Act which grants a permanent exemption for non-accelerated filers from complying with Section 404(b) of the Sarbanes-Oxley Act of 2002.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our company's internal control over financial reporting during the period ended July 31, 2023 that have materially affected, or are reasonably likely to materially affect, its internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe names, ages and titles of the members of our Board of Directors and our executive officers are as follows:\nName Age Position\nJoseph Mullin President and Chief Executive Officer\nVince W. Boon Chief Financial Officer, Treasurer\nMurray G. Flanigan Director\nJohn G. Proust Director\nBenjamin Mossman Director\nThomas I. Vehrs Director\nLawrence W. Lepard Director\nDaniel Oliver Jr. Director\nClynton R. Nauman Director\nDirectors serve as such until our next annual stockholder meeting, or until their successors are elected and qualified. Officers hold their positions at the will of the Board of Directors. As of July 31, 2023, there were no arrangements, agreements or understandings between non-management security holders and management under which non-management security holders may directly or indirectly participate in or influence the management of our company's affairs other than as disclosed in this Report.\nJoseph Mullin, President and Chief Executive Officer\nJoseph Mullin was appointed Chief Executive Officer and President of the Company on September 23, 2023. Mr Mullin has over 25 years of experience in corporate finance, private equity, restructuring, and early-stage mineral exploration. He was previously the President of Virginia Energy Resources Inc. and led its sale to Consolidated Uranium Inc. Prior to that Mr. Mullin was the CEO of QuestEx Gold & Copper Ltd. for two and a half years leading up to its sale to Skeena Resources Ltd. He began his career as a Financial Analyst at Goldman Sachs, and subsequently worked at Invesco Ltd. and Millennium Global Investments Ltd. Mr. Mullin is the Managing Member of Mount Arvon Partners LLC, and he is currently an Independent Director of FireFox Gold Corp. and Pure Energy Minerals Ltd. Mr. Mullin has been involved in metals and mining in the United States, Canada, Brazil and Europe. Mr. Mullin holds an A.B. from Harvard University.\n- 75 -\nVince W. Boon, Chief Financial Officer, Treasurer\nVince W. Boon was appointed as our Chief Financial Officer on May 1, 2018 and Treasurer on May 16, 2018. Mr. Boon is a Chartered Professional Accountant with over ten years of professional accounting experience with private and public companies focusing on financial reporting, regulatory compliance, internal control and corporate finance activities. Mr. Boon's experience includes financial reporting for both Canadian and U.S. listed companies with international subsidiaries, strategic planning, tax planning, corporate governance, equity financings and due diligence for acquisitions. Mr. Boon is currently the CFO of Japan Gold Corp., the CFO of Southern Arc Minerals Inc., and the CFO and director of Lincoln Ventures Ltd. Mr. Boon holds a Bachelor of Science degree from the University of British Columbia and is a Chartered Professional Accountant, CPA, CA.\nJohn G. Proust, Director\nJohn G. Proust was appointed to our Board of Directors on April 18, 2018. Mr. Proust has founded and managed a number of resource companies over the past 30 years. Mr. Proust has served on several boards and held senior operating positions and has directed and advised public and private companies regarding debt and equity financing, mergers and acquisitions and corporate restructuring since 1986. Mr. Proust is currently Chairman and CEO of Southern Arc Minerals Inc., Chairman and CEO of Japan Gold Corp; and the President and director of Lincoln Ventures Ltd. Mr. Proust has extensive experience in corporate governance, is a graduate of The Directors College, Michael G. De Groote School of Business at McMaster University and holds the designation of Chartered Director.\nBenjamin W. Mossman, Director\nBenjamin W. Mossman, P.Eng, was appointed to our Board of Directors on August 1, 2016. Prior to September 23, 2023, Mr. Mossman served as our Chief Executive Officer and President for more than six years. He currently serves as an advisor to the Company. Mr. Mossman is a mining engineer with over 20 years of experience in the mining industry including experience in capital markets, project evaluation, acquisitions, and mine operations and development. He was formerly the President, Chief Executive Officer and a director of Banks Island Gold Ltd., a dormant mining company, formerly listed on the TSX Venture Exchange and currently in receivership. See \"Involvement in Certain Legal Proceedings\" below.\nThomas I. Vehrs, Director\nThomas I. Vehrs was appointed to our Board of Directors on April 18, 2017. Dr. Vehrs is a highly regarded and experienced exploration geologist with over 40 years of experience in the Americas. During his career, Dr. Vehrs has conducted and managed numerous exploration programs resulting in the discovery and delineation of major copper, gold and silver deposits, including the Los Pelambres porphyry copper deposit in Chile, the Northumberland sediment-hosted gold deposit in central Nevada, the Rio Blanco porphyry copper deposit in northern Peru and orogenic gold deposits in Central Guatemala. For the past ten years, Dr. Vehrs held the position of Vice President of Exploration for Fortuna Silver Mines and was responsible for the development and execution of exploration programs at the Caylloma Mine in Peru and the San Jose Mine in southern Mexico. During this period, Fortuna Silver Mines was successful in expanding the resources, reserves and production rate at the San Jose Mine resulting in a market capitalization in excess of $1 billion. Dr. Vehrs holds a Ph.D. in geology from Syracuse University and served as an officer in the U.S. Army Corps of Engineers.\n- 76 -\nMurray G. Flanigan, Director\nMurray G. Flanigan was elected to our Board of Directors on June 27, 2019. Mr. Flanigan is a management consultant providing financial advisory services to a number of public and private oil and gas and technology companies in North America and abroad. Mr. Flanigan is a Chartered Professional Accountant and a Chartered Financial Analyst with expertise in corporate finance, mergers and acquisitions, international taxation, risk management, banking, treasury, corporate restructuring and accounting, and has served as Chief Financial Officer for various public and private companies. Mr. Flanigan was formerly a Managing Principal and the CFO of Kepis & Pobe Financial Group Inc., where he served for over ten years and was responsible for all aspects of the companys accounting, financing, treasury, tax, and legal affairs including overseeing the companys corporate development activities. Prior to founding his own consulting company, Mr. Flanigan served as Senior Vice President, Corporate Development and CFO of Qwest Investment Management Corp., where he was responsible for regulatory reporting and corporate filings for over 15 private and publicly listed companies and limited partnerships in Qwests portfolio, as well as arranging and closing numerous equity and debt financings. Mr. Flanigan also served as VP Corporate Development for Adelphia Communications Corporation, overseeing the companys financial restructuring and ultimate sale to Time Warner Inc. and Comcast Corporation for approximately US$18 billion.\nLawrence W. Lepard, Director\nLawrence W. Lepard was appointed to our Board of Directors on August 19, 2019. Mr. Lepard is Managing Partner at Equity Management Associates, an investment fund focused on the precious metals sector and which has over US$60M under management. Mr. Lepard previously spent 25 years as a professional investor and venture capitalist with Geocapital Partners in New Jersey and Summit Partners in Boston, MA. Mr. Lepard is currently a director for Lavras Gold and Cabral Gold. He has an MBA with Academic Distinction from Harvard Business School and a BA in Economics from Colgate University.\nDaniel Oliver Jr., Director\nDaniel Oliver Jr. was appointed to our Board of Directors on July 20, 2023. Mr. Oliver manages Myrmikan Gold Fund, which makes investments in the precious metals mining sector. Mr. Oliver brings finance and legal expertise to the board. He graduated from Columbia Law School with honors in 2001 and practiced law at Simpson Thacher & Bartlett in New York as well as at Wallison & Wallison, a boutique law firm specializing in high-dollar business litigation and appeals in the financial sector. Mr. Oliver obtained an MBA from INSEAD in 2005. After co-founding two venture companies, Mr. Oliver joined Bearing Capital, LLC, a private equity firm in Buenos Aires focused on Latin American commodities investments. He is currently a director of Guanajuato Silver Co. Ltd and President of the Committee for Monetary Research & Education, an organization founded by prominent economists and businessmen in 1970 in opposition to the Bretton Woods monetary system.\nClynton R. Nauman\nClynton R. Nauman was appointed to our Board of Directors on September 7, 2023. Mr. Nauman has more than 45 years of diversified operating experience in the mining industry ranging from exploration to mine construction and mine operations as well as business development, mine financing and senior management in the precious metals, base metals and coal sectors. Mr. Nauman also co-founded and grew a successful industrial environmental services company focused on reclamation of historical mine-related liabilities in Canada and the United States. Mr. Nauman was the Chairman and Chief Executive Officer of Alexco Resource Corp., Alexco Environmental Group Inc. and Asset Liability Management Group ULC until September 2022. He previously served as President of Viceroy Gold Corporation, Viceroy Minerals Corporation and was a director of Viceroy Resource Corporation, positions he held from February 1998 until February 2003. Mr. Nauman also previously served on the Boards of Novagold Resources Inc, Nova Copper Inc (now Trilogy Metals Inc), and Spectrum Gold Inc. Mr. Nauman was a General Manager of Kennecott Minerals from 1993 to 1998, where he oversaw the permitting, redevelopment, startup and operation of the Greens Creek Mine which lies within the Admiralty Island National Monument in Southeast Alaska. Mr. Nauman holds an Honours Bachelor of Science in Geology from Otago University, New Zealand.\n- 77 -\nNone of our directors has been a director of any other company with a class of securities registered pursuant to section 12 of the Exchange Act or subject to the requirements of section 15(d) of the Exchange Act, or any company registered as an investment company under the Investment Company Act of 1940, during the past five years.\nFamily Relationships\nThere are no family relationships among any of our directors or executive officers.\nInvolvement in Certain Legal Proceedings\nExcept as disclosed below, during the past ten years none of the persons serving as our executive officers and/or directors have been the subject of any of the following legal proceedings that are required to be disclosed pursuant to Item 401(f) of Regulation S-K, including: (a) any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time; (b) any criminal convictions or any criminal proceedings in which the person is a named subject (excluding traffic violations and other minor offenses); (c) any order, judgment, or decree permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities; (d) any finding by a court, the SEC or the CFTC to have violated a federal or state securities or commodities law, any law or regulation respecting financial institutions or insurance companies, or any law or regulation prohibiting mail or wire fraud in connection with any business entity; or (e) any sanction or order of any self-regulatory organization, any registered entity, or any equivalent exchange, association, entity or other organization that has disciplinary authority over its members or persons associated with a member. Further, no such legal proceedings are believed to be contemplated by governmental authorities against any director or executive officer.\nBenjamin W. Mossman was a director and officer of Banks Island Gold Ltd. (\"Banks\"), a company formerly listed on the TSX Venture Exchange that traded under the symbol \"BOZ\", during the time it assigned itself into bankruptcy on January 7, 2016. Banks appointed D. Manning & Associates as trustee in the bankruptcy proceedings. Subsequent to the bankruptcy, FTI Consulting of Vancouver, BC, was appointed as receiver by a major secured creditor. The trustee subsequently applied to be discharged from its role as trustee, which was granted on April 4, 2018. To the best of Mr. Mossman's knowledge, the secured creditor has taken possession of the property as of this date. To date, Banks remains undischarged from the bankruptcy proceedings.\nMr. Mossman, Banks, and two other former employees of Banks, were subject to summary conviction proceedings commenced in August 2016 for alleged violations of the British Columbia provincial Environmental Management Act (the \"EMA\"), the Provincial Water Act, and the federal Fisheries Act. The charges are related to the active mining operations conducted by Banks at and on Banks Island, BC during the period from 2014 to 2016. The court found Mr. Mossman not guilty and acquitted him of all, but two, charges under the EMA and Fisheries Act. For those two minor offences, the court imposed a C$15,000 global fine against Mr. Mossman. All charges were dropped against one former employee and against Banks, and the court dismissed all charges against the other former employee for whom charges were not dropped.\nIn a second trial, the Crown charged Mr. Mossman with obstruction of justice related to the investigation of the underlying charges laid under the EMA and the other provincial and federal environmental regulations. The court acquitted him of that charge on March 6, 2019. No appeal of the acquittal was filed by the Crown.\n- 78 -\nSubsequent to the decision in the first trial, the Crown filed an appeal regarding certain of the original determinations as they relate to Mr. Mossman. The summary conviction appeal was heard by the BC Supreme Court in May 2019. Mr. Mossman and the remaining employee cross-appealed the two convictions held against them. In February 2020, the court issued its decision and ordered a new trial in the matter for Mr. Mossman and the former employee. The two convictions and Mr. Mossman's C$15,000 fine relating to the incident were also set aside by the court. Counsel for Mr. Mossman sought leave to appeal the BC Supreme Court decision to the BC Court of Appeal, which was dismissed as part of the order for a new trial. The Supreme Court of Canada dismissed an application by Mr. Mossman to appeal the order for a new trial.\nThe new trial commenced in 2022 in which charges against the only remaining former employee of Banks, other than Mr. Mossman, were dropped, and concluded on July 26, 2023. Mr. Mossman was acquitted on charges of failing to report environment spills and the dumping or discharging of mine wastes and conducting unauthorized work in or about a stream on the property. He was found guilty of 13 environmental violations in relation to certain waste discharges at the Banks mining site and on September 26, 2023, Mr. Mossman was fined a total of approximately C$30,000 in connection with all of the offences.\nBoth Mr. Mossman and the Crown have filed appeals from this trial. The Crown has appealed all acquittals. Mr. Mossman has appealed all convictions. The hearing of both appeals has been scheduled for the week of January 15, 2024.\nDelinquent Section 16(a) Reports\nSection 16(a) of the Exchange Act requires a company's directors and officers, and persons who own more than 10% of any class of a company's equity securities which are registered under Section 12 of the Exchange Act, to file with the SEC initial statements of beneficial ownership on Form 3, reports of changes in ownership on Form 4, and annual reports on Form 5 concerning their ownership of and transactions concerning our common stock and other equity securities. Such officers, directors and 10% stockholders are also required to furnish the company with copies of all Section 16(a) reports they file. Based solely on our review of the copies of such forms received by the company, or written representations from the reporting persons as of the date of this Report, management believes that all Section 16(a) filing requirements applicable to directors, officers and 10% stockholders with respect to the fiscal year ended July 31, 2023 have been fulfilled, except that Daniel Oliver filed three late reports relating to five transactions.\nAudit Committee Financial Expert\nMurray G. Flanigan is an \"audit committee financial expert\" within the meaning of Item 401(h)(1) of Regulation S-K. In general, an \"audit committee financial expert\" is an individual member of the audit committee who (a) understands generally accepted accounting principles and financial statements, (b) is able to assess the general application of such principles in connection with the accounting for estimates, reserves and accruals, (c) has experience preparing, auditing, analyzing or evaluating financial statements that present a breadth and level of complexity of accounting issues that are generally comparable to the breadth and complexity of issues that can reasonably be expected to be raised by our company's financial statements, (d) understands internal controls over financial reporting, and (e) understands audit committee functions. We have determined that Mr. Flanigan is an independent director as defined in Nasdaq Listing Rule 5605(a)(2).\n- 79 -\nNomination of Directors\nThe Corporation does not have a formal process or committee for proposing new nominees for election to the Board or for stockholders to make such nominations, and there has been no change in that regard since our last annual report on Form 10-K. Management is in contact with individuals involved in the mineral exploration sector, and in the event that we require any new directors, such individuals will be brought to the attention of the Board. Management will conduct reference and background checks on suitable candidates. New nominees generally must have a track record in business management, areas of strategic interest to our company, the ability to devote the time required to carry out the obligations and responsibilities of a director and a willingness to serve in that capacity.\nCode of Ethics\nDuring our fiscal year ended July 31, 2008, the Board of Directors adopted a written Code of Ethics within the meaning of Item 406(b) of Regulation S-K under the Securities Act. The Code of Ethics obligates our directors, officers and employees to disclose potential conflicts of interest and prohibits those persons from engaging in such transactions without the Board's consent.\n- 80 - Item 11. Executive Compensation.\nThe following table sets forth information with respect to the compensation awarded or paid to Benjamin W. Mossman, our Chief Executive Officer, President and a director and Vince Boon, our Chief Financial Officer and Treasurer (the \"Named Executive Officers\"), for all services rendered in all capacities to our company during the past two fiscal years. As of July 31, 2023, we did not have any other executive officers or former executive officers who had received total compensation in excess of US$100,000 during the fiscal year ended July 31, 2023. Pursuant to Item 402(m)(4) of Regulation S-K, we have omitted certain columns from the table since there was no compensation awarded to, earned by or paid to the Named Executive Officer that was required to be reported in such columns in either year. Mr. Mossman continued to serve as our Chief Executive Officer and President during the current fiscal year until September 23, 2023, when he was succeeded by Joseph Mullin and Mr. Mossman became an advisor to our company.\nSummary Compensation Table\nName and Principal Position Year Ended July 31 Salary\n($) Stock Awards ($) Option Awards ($) (1)(2) Total\n($)\nBenjamin W. Mossman, Chief Executive Officer 135,000 - 198,750 333,750\n135,000 - 195,000 330,000\nVince W. Boon, Chief Financial Officer 46,787 - 39,750 86,537\n47,274 - 26,000 73,274\n(1) See Note 11 of the notes to our audited financial statements included in this Report for a description of the assumptions made in the valuation of option awards.\n(2) Represents share-based payments related to options vesting during the years presented.\n- 81 -\nOutstanding Equity Awards at Fiscal Year-End\nThe following table sets forth information relating to the options held by the Named Executive Officers as of July 31, 2023:\nOutstanding Equity Awards at Fiscal Year-End\nOption Awards Stock Awards\nName Number of Securities\nUnderlying\nUnexercised Options\n(#) Exercisable Option\nExercise Price\n($) Option Expiration\nDate Number of\nShares\nThat Have\nNot\nVested\n(#) Market\nValue of\nShares That\nHave Not\nVested ($)\nBenjamin W. Mossman 1,338,500 (1)\n300,000\n375,000 $0.90\n$0.65\n$0.53 September 22, 2025\nFebruary 7, 2027\nFebruary 21, 2028 Nil Nil\nVince W. Boon 10,000\n40,000\n75,000 C$0.70\n$0.65\n$0.53 August 21, 2024\nFebruary 7, 2027\nFebruary 21, 2028 Nil Nil\n- 82 -\nEmployment Agreements\nOn April 19, 2017, we entered into an executive employment agreement with Benjamin W. Mossman, which was amended on April 16, 2018 (the \"Executive Employment Agreement\"). The Executive Employment Agreement, which commenced on May 1, 2017, provides for an annual salary of $135,000 per year and that Mr. Mossman will, subject to the terms of the stock option plan and exchange policies, be granted options from time to time to maintain his right to purchase 5% of our issued and outstanding common stock. To date, Mr. Mossman has been granted options from time to time pursuant to the terms of his Executive Employment Agreement. See Item 13, \"Certain Relationships and Related Transactions, and Director Independence.\"\nThe Executive Employment Agreement included compensation provisions for Mr. Mossman if there is a change of control, he is terminated without just cause, he resigns under circumstances contemplated in the Executive Employment Agreement or he dies while in our employment. If there is a change of control and Mr. Mossman is terminated within one (1) year of the date of a change of control or if Mr. Mossman terminates his employment with us upon the occurrence of certain events, including a material adverse and fundamental change in his overall authority and responsibilities, Mr. Mossman will be entitled to a lump sum amount equal to three (3) years of Mr. Mossman's then applicable annual salary. If Mr. Mossman is otherwise terminated without just cause, Mr. Mossman will be entitled to an amount equal to three (3) months of Mr. Mossman's then applicable annual salary and will also be entitled to maintain in effect, until the earliest of the expiration of 18 months and the death of Mr. Mossman, participation in certain of our benefit plans and stock option plans. If Mr. Mossman dies while employed with us, Mr. Mossman's estate, subject to compliance with stock exchange requirements, our stock option plan, and the terms of the Executive Employment Agreement, will be entitled to continue Mr. Mossman's participation in our stock option plan.\nWhile serving as Chief Executive Officer and President, Mr. Mossman devoted all of his working time to our business. Currently, we expect our executive officers to allocate approximately 40-50% of their working time to our business.\nBenefit Plans\nWe do not currently have any pension plan, profit sharing plan or similar plan for the benefit of our officers, directors or employees; however, we may establish such plans in the future.\n- 83 -\nDirector Compensation\nOur directors are compensated for serving on the Board of Directors. Management directors are not paid fees for services as a director; however, they may receive compensation for their services as employees or consultants.\nThe following table sets out compensation for the year ended July 31, 2023 of those individuals who served as directors during that year but did not qualify as Named Executive Officers.\nName Fees Earned or Paid in\nCash Option Awards Total\nMurray G. Flanigan $20,000(1) $55,650 $75,650\nThomas I. Vehrs $20,000 (1) $55,650 $75,650\nJohn G. Proust $154,140(2) $55,650 $209,790\nLawrence W. Lepard $20,000(1) $55,650 $75,650\n(1) Represents directors' fees\n(2) Includes fees totaling $134,140 paid to a management services company owned by John Proust Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth the beneficial ownership of our common stock as of October 25, 2023 by (a) each person who serves as a director and/or is identified as a \"Named Executive Officer\" of Rise in Item 11, \"Executive Compensation,\" above, and by all of our current directors and executive officers as a group, and (b) each person known by us to beneficially own more than 5.0% of any class of our voting securities.\nA person or group of persons is considered to beneficially own any shares over which such person or group of persons, directly or indirectly, exercises sole or shared voting or investment power, or over which such person or group of persons has the right to acquire beneficial ownership at any time within 60 days through an exercise of stock options or warrants or otherwise. Unless otherwise indicated, voting and investment power relating to the shares shown in the table for our officers and directors is exercised solely by the beneficial owner thereof.\nFor the purposes of computing the percentage of outstanding shares of our common stock held by each person or group of persons named below, any shares that such person or group of persons has the right to acquire within 60 days of October 25, 2023 is deemed to be outstanding, but is not deemed to be outstanding for the purpose of computing the percentage ownership of any other person. The inclusion herein of any shares listed as beneficially owned does not constitute an admission of beneficial ownership.\n- 84 -\nName and Address of\nBeneficial Owner\nAmount and\nNature of\nBeneficial\nOwnership\nPercent of\nClass(1)\nNamed Executive Officer and Directors\nBenjamin W. Mossman 2,551,183 (2) 6.00%\nVince W. Boon 155,000 (3) *\nMurray G. Flanigan 478,125 (4) 1.17%\nJohn G. Proust 3,237,399 (5) 7.72%\nThomas I. Vehrs 327,500 (6) *\nLawrence W. Lepard 6,434,281(7) 15.06%\nDaniel Oliver Jr. 4,346,753 (8) 10.35%\nClynton R. Nauman 94,070(9) *\nExecutive Officers and Directors as a Group (9 persons) 17,624,311 (2)(3)(4)(5)(6)(7)(8)(9) 35.96%\n5% Owners\nEMA GARP FUND, LP\n211 Grove Street\nWellesley, Massachusetts 02482 3,367,156 (10)\n8.12%\nMyrmikan Gold Fund, LLC\n713 Silvermine Road\nNew Canaan, Connecticut 06840 3,763,683 (11)\n9.08%\nYamana Gold Inc.\nRoyal Bank Plaza, North Tower\n200 Bay Street, Suite 2200\nToronto, Ontario M5J 2J3 2,754,973 (12) 6.83%\nVBS Exchange Pty Ltd.\nLevel 12, 644 Chapel St.\nSouth Yarra, Melbourne\nVictoria, Australia 3141 4,750,000 (13) 11.28%\nMichael Gentile\n305 Av. Brock N\nMontreal, QC H4X 2G4 4,053,000 (14) 9.59 %\n(1)\nBased on 40,362,800 shares of common stock issued and outstanding as of October 25, 2023.\n(2)\nBenjamin W. Mossman, a director and our former Chief Executive Officer and President, holds 377,329 shares of common stock, 155,714 warrants, 35,714 of which are exercisable into common stock at a price of C$1.00 per share until July 3, 2024, 20,000 of which are exercisable into common stock at a price of $1.00 per share until July 31, 2024, 50,000 of which are exercisable into common stock at a price of $0.60 per share until January 28, 2024, and 50,000 of which are exercisable into common stock at a price of $0.60 per share until January 31, 2025 and 2,018,140 stock options, 1,338,500 of which are exercisable into common stock at a price of $0.90 per share until September 22, 2025, 300,000 of which are exercisable into common stock at a price of $0.65 per share until February 7, 2027, 375,000 of which are exercisable into common stock at a price of $0.53 per share until February 21, 2028, and 4,640 of which are exercisable into common stock at a price of $0.26 per share until September 22, 2028.\n- 85 -\n(3)\nVince W. Boon, our Chief Financial Officer and Treasurer, holds 155,000 stock options, 10,000 of which are exercisable into common stock at a price of C$0.70 per share until August 21, 2024, and 40,000 of which are exercisable into common stock at a price of $0.65 per share until February 7, 2027, 75,000 of which are exercisable into common stock at a price of $0.53 per share until February 21, 2028, and 30,000 of which are exercisable into common stock at a price of $0.26 per share until September 22, 2028.\n(4)\nMurray G. Flanigan, a director, indirectly beneficially owns 138,750 shares of common stock and 94,375 warrants, 50,000 which are exercisable into common stock at a price of $0.60 per share until January 28, 2024 and 44,375 of which are exercisable into common stock at a price of $0.60 per share until January 31, 2025. Mr. Flanigan also holds 245,000 stock options, 40,000 of which are exercisable into common stock at a price of C$0.70 per share until August 21, 2024, 100,000 of which are exercisable into common stock at a price of $0.65 per share until February 7, 2027 and 105,000 of which are exercisable into common stock at a price of $0.53 per share until February 21, 2028.\n(5)\nJohn G. Proust, a director, directly and indirectly beneficially owns 1,659,626 shares of common stock. Mr. Proust indirectly beneficially owns 1,027,773 warrants, 700,000 of which are exercisable into common stock at a price of $0.60 per share until January 28, 2024, 131,305 of which are exercisable into common stock at a price of $0.60 per share until January 31, 2025, 196,468 of which are exercisable into common stock at a price of $0.60 per share until February 17, 2025 and holds 550,000 stock options, 150,000 of which are exercisable into common stock at a price of C$1.00 per share until November 29, 2023, 75,000 of which are exercisable into common stock at a price of C$0.70 per share until August 21, 2024, 100,000 of which are exercisable into common stock at a price of $0.65 per share until February 7, 2027, 105,000 of which are exercisable into common stock at a price of $0.53 per share until February 21, 2028 and 120,000 of which are exercisable into common stock at a price of $0.26 per share until September 22, 2028.\n(6)\nThomas I. Vehrs, a director, holds 25,000 shares of common stock and 12,500 warrants which are exercisable into common stock at a price of $0.60 per share until January 31, 2025, and 290,000 stock options, 20,000 of which are exercisable into common stock at a price of C$1.00 per share until November 29, 2023, 40,000 of which are exercisable into common stock at a price of C$0.70 per share until August 21, 2024, 100,000 of which are exercisable into common stock at a price of C$0.65 per share until February 7, 2027, 105,000 of which are exercisable into common stock at a price of $0.53 per share until February 21, 2028 and 25,000 of which are exercisable into common stock at a price of $0.26 per share until September 22, 2028.\n(7)\nLawrence W. Lepard, a director, holds 766,875 shares of common stock and indirectly beneficially owns an additional 135,000 shares of common stock through his children and 904,000 shares of common stock held by Sea View Investments, LLC. Mr. Lepard also holds 305,000 stock options, 100,000 of which are exercisable into common stock at a price of C$0.70 per share until August 21, 2024, 100,000 of which are exercisable into common stock at a price of $0.65 per share until February 7, 2027 and 105,000 of which are exercisable into common stock at a price of $0.53 per share until February 21, 2028, and 362,500 warrants, 200,000 of which are exercisable into common stock at a price of C$1.00 per share until August 19, 2024, 150,000 of which are exercisable into common stock at a price of $0.60 per share until January 28, 2024 and 12,500 of which are exercisable into common stock at a price of $0.60 per share until February 17, 2025. Mr. Lepard is deemed to indirectly beneficially own 593,750 warrants held by Sea View Investments, LLC, 500,000 of which are exercisable into common stock at a price of $0.60 per share until January 28, 2024 and 93,750 of which are exercisable into common stock at a price of $0.60 per share until February 17, 2025. Mr. Lepard is the sole member and a manager of EMA GARP GP, LLC, which is the general partner of EMA GARP FUND, LP, and as such is deemed to indirectly beneficially own the securities that ar beneficially owned by EMA GARP FUND, LP. See note (10).\n(8)\nDaniel Oliver Jr., a director, holds 489,000 warrants, 374,000 of which are exercisable into common stock at a price of $1.00 per share until September 9, 2024 and 115,000 of which are exercisable into common stock at a price of $0.60 per share until February 17, 2025, and 94,070 stock options which are exercisable into common stock at a price of $0.26 per share until September 22, 2028. Mr. Oliver is deemed to indirectly beneficially own the securities that are beneficially owned by Myrmikan Gold Fund LLC. See note (11).\n- 86 -\n(9) Clynton R. Nauman, a director, holds 94,070 stock options which are exercisable into common stock at a price of $0.26 per share until September 22, 2028.\n(10) EMA GARP FUND, LP holds 2,279,656 shares of common stock and 1,087,500 warrants, 50,000 of which are exercisable into common stock at a price of C$1.00 per share until July 3, 2024, 250,000 of which are exercisable into common stock at a price of C$1.00 per share until August 19, 2024, 100,000 of which are exercisable into common stock at a price of $1.00 per share until July 31, 2024, 625,000 of which are exercisable into common stock at a price of $0.60 per share until January 28, 2024 and 62,500 of which are exercisable into common stock at a price of $0.60 per share until February 17, 2025. EMA GARP GP, LLC is the general partner of the EMA GARP FUND, LP. Lawrence Lepard, one of our directors, is the sole member and a manager of EMA GARP GP, LLC. See note (7).\n(11) Myrmikan Gold Fund LLC holds 2,692,849 shares of common stock and 1,070,834 warrants, 85,000 of which are exercisable into common stock at a price of C$1.00 per share until August 19, 2024, 173,334 of which are exercisable into common stock at a price of $1.00 per share until July 31, 2024, 625,000 of which are exercisable into common stock at a price of $0.60 per share until January 28, 2024 and 187,500 of which are exercisable into common stock at a price of $0.60 per share until January 31, 2025. Daniel Oliver Jr., one of our directors, is the managing member of Myrmikan Gold Fund LLC (the \"Fund\"). Myrmikan Capital, LLC, an investment adviser, is the manager of the Fund (the \"Manager\"). Mr. Oliver owns a 97.5% membership interest in, and is the manager of, the Manager. As the manager of the Fund, the Manager is deemed to share beneficial ownership of the shares beneficially owned by the Fund. As the manager of the Manager, Mr. Oliver is likewise deemed to share beneficial ownership of the shares beneficially owned by the Fund and the Manager. See note (8).\n(12) Beneficially owned through Meridian Jerritt Canyon Corp., a wholly owned subsidiary of Yamana Gold Inc.\n(13) VBS Exchange Pty Ltd. holds 3,000,000 shares of common stock and 1,750,000 warrants, 500,000 of which are exercisable into common stock at a price of $0.60 per share until January 28, 2024, 1,000,000 of which are exercisable into common stock at a price of $1.00 per share until July 31, 2024, and 250,000 of which are exercisable into common stock at a price of $0.60 per share until January 31, 2025. VBS Investments Pty Ltd. holds 100% of the issued share capital in VBS Exchange Pty Ltd and therefore indirectly beneficially owns all of our equity securities that are beneficially owned by VBS Exchange Pty Ltd.\n(14) Beneficially owned through 9458-2855 Quebec Inc., a company wholly owned by Michael Gentile. Includes 2,142,000 shares of common stock and 1,911,000 warrants, 1,680,000 of which are exercisable into common stock at a price of $0.60 per share until January 28, 2024 and 231,000 of which are exercisable into common stock at a price of $0.60 per share until February 17, 2025.\n* Less than 1%.\nChanges in Control\nWe are not aware of any arrangements, including any pledge by any person of its securities, the operation of which may at a subsequent date result in a change in control of our company.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nOn March 23, 2016, the Board of Directors approved the adoption of an incentive stock option plan that provides for the granting of options representing up to 10% of our common stock to its directors, officers, employees and consultants (the \"Plan\"). As of July 31, 2023, options to purchase 3,638,500 shares at prices of between C$0.70 and C$1.20 per share and at prices of between $0.65 and $0.90 per share, are outstanding to 15 persons under the Plan.\nWe do not have any other compensation plans under which our equity securities are authorized for issuance.\n- 87 -\nEquity Compensation Plan Information\nAs of July 31, 2023\nPlan Category\nNumber of\nsecurities to\nbe issued\nupon\nexercise\nof\noutstanding\noptions,\nwarrants\nand rights\nWeighted-\naverage\nexercise\nprice of\noutstanding\noptions,\nwarrants\nand rights\nNumber of\nsecurities\nremaining\navailable for\nfuture\nissuance\nunder equity\ncompensation\nplans\n(excluding\nsecurities\nreflected in\ncolumn (a))\n(a)\n(b)\n(c)\nEquity compensation plans approved by shareholders\n3,638,500\nC$0.93\n397,780\nEquity compensation plans not approved by shareholders\n-\n-\n-\nTotal\n3,638,500\nC$0.93\n397,780 Item 13. Certain Relationships and Related Transactions, and Director Independence.\nCertain Relationships and Related Transactions\nOn April 17, 2018, we entered into a consulting agreement with J. Proust & Associates Inc. (\"JPA\"), a management services company owned by one of our directors, John Proust. JPA agreed to provide the Company with such business advisory, finance, accounting and corporate administrative services as may be requested by the Company, including a Chief Financial Officer, a Controller and Corporate Secretary, plus use of a fully furnished office, for a monthly fee of C$7,100, or C$85,200 on an annualized basis. The agreement provides that the Company may grant stock options to JPA or its employees, as determined by the Board of Directors from time to time. The agreement had a one-year term that commenced on April 17, 2018. On December 13, 2018, the parties amended the agreement to increase the compensation to C$15,000 per month, or C$180,000 on an annualized basis, and to revise the term of the agreement, with a new one-year term commencing on January 1, 2019 that continues thereafter on a month-to-month basis, unless the agreement is terminated by the parties in accordance with its terms. During the year ended July 31, 2023, the Company paid $134,140 to JPA under this agreement.\nOn October 16, 2018, we entered into an agreement with Meridian Jerritt Canyon Corp. (\"Meridian\"), a wholly-owned subsidiary of Yamana Gold Inc., pursuant to which Meridian completed a strategic initial investment in our company of C$1.75 million through the purchase of 1,750,000 units (the \"Agreement\"). Under the Agreement, Meridian has the right, for as long as it owns 5% or more of our outstanding shares of common stock, to participate in any of our future equity financings in order to maintain its percentage equity interest or to increase its equity ownership up to 19.9% of our issued and outstanding shares. In addition, Meridian will be permitted to nominate one individual to our Board of Directors and to appoint two members to our advisory committee.\nDaniel Oliver Jr. is the manager of Myrmikan Capital, LLC, which, in turn, is the manager of Eridanus Capital, LLC (\"Eridanus\"). Eridanus provided a secured loan to our wholly owned subsidiary, Rise Grass Valley in 2019. Mr. Oliver currently has a 20% membership interest in Eridanus. Mr. Oliver was appointed to our Board of Directors on July 10, 2023.\nRise Grass Valley and Eridanus entered into a loan agreement dated for reference August 30, 2019 (the \"Loan Agreement\") pursuant to which Eridanus provided a $1,000,000 secured loan (the \"Loan\") to Rise Grass Valley. As partial consideration for entering into the Loan Agreement, we issued 1,150,000 share purchase warrants to Eridanus. Each warrant entitled Eridanus to purchase one share of our common stock at a price of CAD$1.00 per share for a period of 3 years from the date of issuance of the warrants, which expiry date has been extended to September 9, 2024. Eridanus subsequently transferred its warrants to its members. As a result, Mr. Oliver acquired 374,000 of those warrants. The Loan Agreement provided for an initial term of two years, with interest payable at 10% per annum compounded monthly, and an option to extend the term for an additional two years with interest payable at 20% per annum compounded monthly for the third year and at 25% per annum compounded monthly for the fourth year. Rise Grass Valley exercised the option to extend the term of the loan. Pursuant to an agreement dated January 27, 2023, Eridanus agreed to extend the maturity date of the Loan by one year to September 4, 2024 and to reduce the interest rate from 25% to 15% per annum compounded monthly for a period of 12 months from February 17, 2023. After February 17, 2024, the rate of interest will revert to 25% per annum compounded monthly. We paid $250,000 to Eridanus to reduce the outstanding Loan and we issued an aggregate of 575,000 share purchase warrants to the members of Eridanus in proportion to their respective interests. As a member of Eridanus, Mr. Oliver acquired 115,000 of those warrants. Each warrant entitles the holder to acquire one share of our common stock at an exercise price of US$0.60 until February 17, 2025. Rise Grass Valley may prepay the Loan and accumulated interest in whole or in part.\n- 88 -\nAs at July 31, 2023, $1,437,914 was owed to Eridanus under the Loan Agreement.\nDirector Independence\nBecause our common stock is not currently listed on a national securities exchange, we currently use the definition in Nasdaq Listing Rule 5605(a)(2) for determining director independence, which provides that an \"independent director\" is a person other than an executive officer or employee of the company or any other individual having a relationship which, in the opinion of the company's Board of Directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. The Nasdaq listing rules provide that a director cannot be considered independent if:\nthe director is, or at any time during the past three years was, an employee of the company;\nthe director or a family member of the director accepted any compensation from the company in excess of $120,000 during any period of 12 consecutive months within the three years preceding the independence determination (subject to certain exclusions, including, among other things, compensation for board or board committee service);\na family member of the director is, or at any time during the past three years was, an executive officer of the company;\nthe director or a family member of the director is a partner in, controlling stockholder of, or an executive officer of an entity to which the company made, or from which the company received, payments in the current or any of the past three fiscal years that exceed 5% of the recipient's consolidated gross revenue for that year or $200,000, whichever is greater (subject to certain exclusions);\nthe director or a family member of the director is employed as an executive officer of an entity where, at any time during the past three years, any of the executive officers of the company served on the compensation committee of such other entity; or\nthe director or a family member of the director is a current partner of the Company's outside auditor, or at any time during the past three years was a partner or employee of the company's outside auditor, and who worked on the company's audit.\n- 89 -\nWe have determined that Murray Flanigan, Lawrence Lepard, Clynton Nauman, Daniel Oliver, John Proust, and Thomas Vehrs meet this definition of independence. Item 14. Principal Accountant Fees and Services.\nThe following table shows the fees billed by our company's auditor, Davidson & Company LLP Chartered Accountants, for the fiscal years ended July 31, 2023 and 2022, and a summary of the services provided under each category follows the table:\nJuly 31, 2023\n(C$) July 31, 2022\n(C$)\nAudit Fees 42,006 42,006\nAudit-Related Fees 40,488 32,390\nTax Fees - -\nAll Other Fees - -\nAudit Fees consist of fees billed for professional services rendered for the audit of the consolidated financial statements and review of the quarterly interim consolidated financial statements.\nAudit-Related fees consist of the review of SEC comment letters and management responses.\nTax Fees consist of tax compliance fees and other tax planning advisory services.\nAll Other Fees: There were no fees billed by Davidson & Company for professional services rendered for other compliance purposes for the years ended July 31, 2023 and 2022.\nOur Board of Directors has established pre-approval policies and procedures, pursuant to which the Board approved the foregoing audit and audit-related services provided by Davidson & Company in fiscal years 2023 and 2022 consistent with the Board's responsibility for engaging our company's independent auditors.\nPART IV Item 15. Exhibits and Financial Statement Schedules.\n(a) The following financial statements are being filed as part of this Report:\nConsolidated Financial Statements of Rise Gold Corp.\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of July 31, 2023 and 2022\nConsolidated Statement of Operations and Comprehensive Loss for the years ended July 31, 2023 and 2022\nConsolidated Statement of Cash Flows for the years ended July 31, 2023 and 2022\nConsolidated Statement of Stockholders' Equity (Deficit) for the years ended July 31, 2023 and 2022\nNotes to the Consolidated Financial Statements\n(b) The following exhibits are being filed as part of this Report:\nNumber Exhibit Description\n3.1 Articles of Incorporation, as amended through March 29, 2017 (1)\n3.2 Certificate of Change made effective December 16, 2019 (2)\n- 90 -\n3.3 Certificate of Amendment dated September 18, 2020 (2)\n3.4 Bylaws (3)\n4.1 Description of Capital Stock (4)\n10.1 Incentive Stock Option Plan dated March 23, 2016 (1)\n10.2 Employment Agreement with Benjamin Mossman dated as of April 19, 2017 (1)\n10.3 April 16, 2018 Amendment to the Employment Agreement with Benjamin Mossman dated as of April 19, 2017 (5)\n10.4 Form of Subscription Agreement with Meridian Jerritt Canyon Corp., a wholly-owned subsidiary of Yamana Gold Inc., dated October 16, 2018 (6)\n10.5 Consulting Agreement with J. Proust & Associates Inc., as amended, dated December 13, 2018 (7)\n10.6 Loan Agreement between Rise Grass Valley Inc. and Eridanus Capital, LLC dated August 30, 2019 (8)\n10.7 Collateral Agreement in favor of Eridanus Capital, LLC, dated August 30, 2019 (8)\n10.8 Deed of Trust in favor of Jeremy A. M. Evans, as trustee, for the benefit of Eridanus Capital, LLC dated August 30, 2019 (8)\n10.9 January 27, 2023 Amendment to the Loan Agreement dated August 30, 2019 between Rise Grass Valley Inc. and Eridanus Capital, LLC\n14.1 Code of Ethics (9)\n21.1 Subsidiaries of the registrant (1)\n23.1 Consent of Davidson & Company\n31.1 Certificate of the Chief Executive Officer pursuant to Rule 13a-14(a) or 15d-14(a) under the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2 Certificate of the Chief Financial Officer pursuant to Rule 13a-14(a) or 15d-14(a) under the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1 Certificate of the Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2 Certificate of the Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS Inline XBRL Instance Document-the instance document does not appear in the Interactive Data File as its XBRL tags are embedded within the Inline XBRL document\n101.SCH Inline XBRL Taxonomy Extension Schema Document\n- 91 -\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n_____________________\n(1) Included as an exhibit to our registration statement on Form S-1 filed on September 5, 2017 and incorporated herein by reference.\n(2) Included as an exhibit to our Form 10-K annual report filed on October 29, 2020 and incorporated herein by reference.\n(3) Included as an exhibit to our registration statement on Form S-1 filed on February 19, 2008 and incorporated herein by reference.\n(4) Included as an exhibit to our Form 10-K annual report filed on October 29, 2019 and incorporated herein by reference.\n(5) Included as an exhibit to our registration statement on Form S-1 filed on May 29, 2018 and incorporated herein by reference.\n(6) Included as an exhibit to post-effective Amendment No. 1 to our Form S-1 registration statement filed on November 26, 2018 and incorporated herein by reference.\n(7) Included as an exhibit to our Form S-1 registration statement filed on January 17, 2019 and incorporated herein by reference.\n(8) Included as an exhibit to our Form S-1 registration statement filed on October 31, 2019 and incorporated herein by reference.\n(9) Included as an exhibit to Amendment No. 1 to our Form 10-K annual report filed on October 30, 2008 and incorporated herein by reference.\nItem 16. Form 10-K Summary.\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: October 30, 2023\nRISE GOLD CORP.\n/s/ Joseph Mullin\nJoseph Mullin\nPresident and Chief Executive Officer\n- 92 -\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n/s/ Joseph Mullin\nJoseph Mullin\nPresident and Chief Executive Officer\n(Principal Executive Officer)\nOctober 30, 2023\n/s/ Vince Boon\nVincent Boon\nChief Financial Officer and Treasurer\n(Principal Financial and Accounting Officer)\nOctober 30, 2023\n/s/ Murray Flanigan\nMurray Flanigan\nDirector\nOctober 30, 2023\n/s/ John Proust\nJohn Proust\nDirector\nOctober 30, 2023\n/s/ Benjamin Mossman\nBenjamin Mossman\nDirector\nOctober 30, 2023\n/s/ Thomas Vehrs\nDr. Thomas Vehrs\nDirector\nOctober 30, 2023\n/s/ Lawrence Lepard\nLawrence Lepard\nDirector\nOctober 30, 2023\n/s/ Daniel Oliver Jr.\nDaniel Oliver Jr.\nDirector\nOctober 30, 2023\n/s/ Clynt Nauman\nClynt Nauman\nDirector\nOctober 30, 2023\n- 94 -"
}