{
    "cik": "1427644",
    "company": "Telco Cuba, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-11-03",
    "period_of_report": "2016-11-30",
    "sic": "4813",
    "state_of_inc": "NV",
    "state_location": "FL",
    "fiscal_year_end": "1130",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1427644/0001099910-22-000217-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1427644/000109991022000217/telcocuba_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1427644/0001099910-22-000217.txt",
    "filename": "1427644_10K_2016_0001099910-22-000217.htm",
    "content": "ITEM 1. BUSINESS.\nOverview\nTelco Cuba, Inc., fka CaerVision Global, Inc. fka American Mineral Group Minerals Inc. (the Company or Telco Cuba) was incorporated under the laws of the State of Nevada on August 10, 2007. On June 15, 2015, the Company effectuated an amendment to its articles of incorporation to change its name from CaerVision Global, Inc. to Telco Cuba, Inc. following a share exchange with Amgentech, Inc. consummated on June 12, 2015 under which the shareholders of Amgentech became the majority shareholders of the company and Amgentech elected to become the successor issuer to CaerVision Global.\nAbout Our Company\nTelco Cuba, Inc. (fka CaerVision Global, Inc. fka American Mineral Group Inc.) (The Company) was incorporated under the laws of the State of Nevada on August 10, 2007. On June 15, 2015, the Company effectuated an amendment to its articles of incorporation to change its name from CaerVision Global, Inc. to Telco Cuba, Inc.\nThe Company was an early stage Mining and Exploration Company throughout the fiscal year ended November 30, 2014 and early 2015, seeking to acquire, develop, and manage various oil, gas, and mineral properties and resources. In August 2009, the Company entered into an agreement to acquire the mineral rights to 331 unpatented lode mining claims known as the Conglomerate Mesa, located in Inyo County, California. In March 2011, the Company added an additional 217 unpatented lode mining claims. In fiscal year 2012, the Company determined that the effort and cost of developing these claims required more resources that could be more effectively used on other opportunities, and abandoned the Conglomerate Mesa project. In February 2013, the Company acquired a 28% Working Interest in the Grand Chenier oil and gas prospect in Louisiana. The property contains an estimate 9.0 million barrels of oil and was in production until approximately 2009 when the then operator failed to manage the interests and certain repairs were not made leading to the cessation of production.\nOn June 12, 2015, the Company consummated a Share Exchange with Amgentech, Inc., a Florida corporation. Under the terms of the Share Exchange, the holders of Amgentech received 50,088 shares of Series B Preferred Stock that had been previously issued to third parties in exchange for 100% of the issued and outstanding capital of Amgentech. Each shares of Series B preferred is convertible into 5,000 shares of common stock (254,440,000 shares total) and has voting rights of 5,000 per share (254,440,000 votes). As a result of this transaction, Amgentech became a wholly-owned subsidiary of the Company with control transferring to the previous owners of Amgentech. Amgentech elected to be treated as the successor issuer for SEC reporting and accounting purposes. The Share Exchange was accounted for as a reverse acquisition and re-capitalization. The Amgentech Shareholders obtained approximately 60% of voting control on the date of Share Exchange. Amgentech was the acquirer for financial reporting purposes and the Company was the acquired company. The Company filed an amendment to its articles of incorporation and changed its name to Telco Cuba, Inc.\nAmgentech, Inc. is a Florida based Corporation engaged in the business of providing technology solutions, integrating and building technology infrastructure and software and website development. Amgentech, Inc. also offers managed collocated and leased servers. Originally founded in 2001, Amgentech, Inc. has been providing Internet based solutions, VoIP infrastructure and consulting services for over 14 years to diverse clients in The United States of America, the counties of El Salvador, Nicaragua, Costa Rica, Panama, Colombia and Venezuela. Amgentech, Inc. continues to provide these same services, in addition to providing the technical and Internet know how to implement the technological vision that is envisioned for Telco Cuba, Inc., Amgentech will be the sole technical services provider.\nTelco Cuba, Inc. offers telecommunication services and equipment, including mobile phones, mobile voice service, VoIP service, and calling cards. The services and devices initially offered will be for consumption solely in The United States of America. Telco Cuba, Inc. has positioned itself to offer low cost mobile cell phone service/plans in The United States. Telco Cuba, Inc. will offer prepaid service/plans that include predefined minute/unlimited minute plans. Telco Cuba, Inc. is positioning itself to enter the telecommunications market in Cuba once able to.\nTelco Cuba is foremost a technology solutions service provider offering services under the brand name Amgentech and Telco Cuba.\nUnder the brand name Telco Cuba, the company is targeting the Cuban American demographic in the United States. The vast majority of Telco Cubas potential subscribers are currently customers of lower-end cellular providers such as Metro PCS, Boost and Simple Mobile. Telco Cuba plans to offer low cost international rates commensurate with that of lower end cellular providers on any of its prepaid all-you-can-talk/text with and without data plans. All of Telco Cubas calling plans will allow international calls at similar or lower rates than competitive landline rates. Additionally, as an MVNO of Sprint, Telco Cuba will offer direct text messaging and calling to the Country of Cuba. As part of a landmark deal, Telco Cuba will offer cell phone roaming services in Cuba. In Addition to its cell phone services, Telco Cuba offers digital home phone service and will be bundling its digital and cell phone service. Currently there is no provider of these services targeting the Cuban American demographic. Telco Cuba has already received a license with the FCC, allowing it to directly peer with telephone providers outside of the United States. This license fits into the long term plan Telco Cuba has of building out its own infrastructure. The companys strategy is to offer different price plans targeted to U.S. based Cubans and travelers. The target market not only includes U.S.-based Cubans but also native Cubans worldwide. Telco Cuba has engaged IDT, the only American long distance carrier with a direct relationship with ETECSA and will be offering digital calling plans (calling cards, digital phone service, and Cell phone service) targeted to the Cuban market in the states with the largest Cuban demographic: Florida, New Jersey, and Chicago.\nUnder the brand name Amgentech, the company offers best of breed technology solutions which include, but are not limited to Software and Network architecture services, software development, web site development, hosting and colocation services, managed network and managed server services, voice over ip servers and bulk mailing services. Amgentech has been providing services since 2001, building out networks and services in the international markets of Costa Rica, Panama, Colombia, and Panama.\nGovernmental Regulations and Environmental Compliance\nThe Companys operations is subject to various federal regulations. Telco Cuba has received all of the necessary licenses to operate as a cell phone service provider, digital phone service provider and calling card service provider.\nPlan of Operation\nTelco Cuba has received the necessary licenses with the FCC and is able to offer cell phone services in the United States and abroad. The companys strategy is to offer different price plans with included service roaming in the nation of Cuba targeted to travelers going to the nation of Cuba. The target market not only includes U.S.-based Cubans but also expat Cubans worldwide. Telco Cuba has engaged IDT, the only American long distance carrier with a direct relationship with ETECSA and will be offering calling cards targeted to the Cuban market in the states with the largest Cuban demographic: Florida, New Jersey, and Chicago.\nIn July of 2015, Telco Cuba executed an agreement with Next Communications, an MVNE (Mobile Virtual Network Enabler) provider with Sprint Corporation. Telco Cuba intends to create a first of its kind niche market by implementing its pre-paid mobile service to the Cuban-American market with primary focus in the South Florida market. The cellular services are expected to include unlimited talk, text, and web offerings at low-cost competitive market rates. Aside from competitive mobile monthly pricing plans, Telco Cuba will also offer its customers the ability to call internationally (namely to Cuba) directly from the GSM mobile handset, using the MVNE network. This unprecedented service should greatly improve the connectivity of all Cuban-Americans residing in U.S., thus allowing Telco Cuba to capture U.S. to Cuba long distance market share.\nThe portfolio of services that Telco Cuba is putting together includes government contract work. Telco Cuba has signed a teaming agreement to offer services to the US Government through the governments NS2020 initiative.\nTelco Cubas Cuba centric plans, marketing and promotions will address the needs of over 2 million Cubans residing in the United States. Telco Cubas approach will allow the company to access a highly profitable market.\nThe Company still controls its interest in the Grand Chenier oil and gas project in Louisiana which is listed as Assets Held for Sale in the accompanying financial statements. There are no current plans to develop the oil and gas asset.\nAmgentech, a subsidiary of Telco Cuba, Inc. continues to provide hosting, colocation, software development and website design services.\nEmployees\nThe Company presently has 2 employees, of which 0 are management and 2 are involved in operations. We expect that as we begin rolling out new services, additional personnel will be added. We believe that our relationship with employees is satisfactory. We have not suffered any labor problems during the last two years. ITEM 1A. RISK FACTORS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information under this item. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone. ITEM 2. PROPERTIES\nHeadquarters and administration offices\nCurrently, Telco Cuba occupies approximately 500 Square Feet of office space at a cost of $649.38 a month. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in various lawsuits and legal proceedings, which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business.\n1. Mammoth West Corporation brought a lawsuit against the company on April 4, 2016. Case number: 16L353 in the 19th circuit court of Lake County, Illinois. The note holder sued for enforcement of two promissory notes issued to Mammoth on November 18, 2010, and June 30, 2011. The case was settled for a debt conversion amount of $132,000.00 on December, 2016. The terms of the notes were amended to reflect a 0% discount, 0 day look back, and no additional interest. The terms of the settlement have been met and the amount paid back.\n2. Redwood Management, LLC., brought a lawsuit against the company on November 14, 2014. Case number: CACE14021854 in the 17th circuit court of Broward County, Florida. The note holder sued for enforcement of two promissory notes issued by the company to Redwood on November 11, 2010 and March 31, 2011. The case was settled on December 21, 2017 for a debt conversion amount of $57,640.83. The terms of the note were amended to reflect the new balance, and the terms were changed to a (25%) discount rate, and a total monthly conversion restriction. The company is working with the note holder to convert the settled amount into stock of the company.\n3. Anthony J Rivera brought a lawsuit against the company on May 29, 2018. Case number: CACE18012914 in the 17th circuit court of Broward County, Florida. The note holder sued for enforcement of a note issued by the company on December 1, 2015. The case was settled, and the note was amended with a more favorable 50% discount, 5 day look back term on the note. The settlement occurred on September, 2018. The company is working with the note holder to convert the settled amount into stock of the company.\n4. On September 28, 2018, the company filed a lawsuit against Cuentas, Inc. (NASDAQ: CUEN), f/k/a Next Group Holdings, Inc/Meimoun & Mammon, LLC/Next Mobile, LLC in the 11th circuit court of Miami-Dade County, Florida. Case number: 2018-032974-CA-01 is still ongoing. The case was filed due to CUEN failing to perform on a contract signed on July, 2015. The company is suing for damages and the return of the funds paid for the undelivered Mobile Virtual Network Operator (MVNO) platform. (https://www2.miami-dadeclerk.com/ocs/search.aspx) During the month of February, 2020, the company hired Attorney Jonathan Leinwand, to take over the lawsuit against Cuentas, Inc. NASDAQ: CUEN During the month of September, 2021 the company filed a summary judgement motion based on CUEN failure to deliver on the contract. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDERS MATTERS, AND ISSUER PURCHASE OF EQUITY SECURITIES.\nMarket Information.\nPublic Market for Common Stock\nOur common stock, par value $.001 per share (the Common Stock), is currently quoted on the OTCBB under the symbol QBAN. The OTCBB is a quotation service that displays real-time quotes, last-sale prices, and volume information in over-the-counter, or the OTC, equity securities. An OTCBB equity security generally is any equity that is not listed or traded on a national securities exchange. The following table shows, for the periods indicated, the high and low bid prices per share of our common stock as reported by the OTCBB quotation service. These bid prices represent prices quoted by broker-dealers on the OTCBB quotation service. The quotations reflect inter-dealer prices, without retail mark-up, mark-down or commissions, and may not represent actual transactions.\nPrice range of common stock\nHigh Close Low Close\nFiscal Year Ended November 30, 2016\n1st Quarter $ 0.0049 $ 0.0011\n2nd Quarter $ 0.0026 $ 0.0010\n3rd Quarter $ 0.0005 $ 0.0012\n4th Quarter $ 0.0007 $ 0.0004\nFiscal Year Ended November 30, 2015\n1st Quarter $ 0.011 $ 0.011\n2nd Quarter $ 0.025 $ 0.025\n3rd Quarter $ 0.006 $ 0.0045\n4th Quarter $ 0.0039 $ 0.0039\nFiscal Year Ended November 30, 2014\n1st Quarter $ 0.0028 $ 0.0001\n2nd Quarter $ 0.01 $ 0.0031\n3rd Quarter $ 0.0199 $ 0.0005\n4th Quarter $ 0.0180 $ 0.0035\nThe market price of our common stock will be subject to significant fluctuations in response to variations in our quarterly operating results, general trends in the market, and other factors, over many of which we have little or no control. In addition, broad market fluctuations, as well as general economic, business and political conditions, may adversely affect the market for our common stock, regardless of our actual or projected performance.\nHolders of Common Stock\nWe had 120 record holders of our common stock as of November 30, 2016.\nWe had 114 record holders of our common stock as of November 30, 2015.\nPenny Stock\nThe SEC has adopted rules that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a market price of less than $5.00, other than securities registered on certain national securities exchanges or quoted on the NASDAQ system, provided that current price and volume information with respect to transactions in such securities is provided by the exchange or system. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock, to deliver a standardized risk disclosure document prepared by the SEC, that: (a) contains a description of the nature and level of risk in the market for penny stocks in both public offerings and secondary trading; (b) contains a description of the brokers or dealers duties to the customer and of the rights and remedies available to the customer with respect to a violation of such duties or other requirements of the securities laws; (c) contains a brief, clear, narrative description of a dealer market, including bid and ask prices for penny stocks and the significance of the spread between the bid and ask price; (d) contains a toll-free telephone number for inquiries on disciplinary actions; (e) defines significant terms in the disclosure document or in the conduct of trading in penny stocks; and (f) contains such other information and is in such form, including language, type size and format, as the SEC shall require by rule or regulation.\nThe broker-dealer also must provide, prior to effecting any transaction in a penny stock, the customer with (a) bid and offer quotations for the penny stock; (b) the compensation of the broker-dealer and its salesperson in the transaction; (c) the number of shares to which such bid and ask prices apply, or other comparable information relating to the depth and liquidity of the market for such stock; and (d) a monthly account statement showing the market value of each penny stock held in the customers account.\nIn addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from those rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written acknowledgment of the receipt of a risk disclosure statement, a written agreement as to transactions involving penny stocks, and a signed and dated copy of a written suitability statement.\nThese disclosure requirements may have the effect of reducing the trading activity for our Common Stock. Therefore, stockholders may have difficulty selling our securities.\nDividend Policy\nWe have never declared or paid any cash dividends on our common stock. We currently intend to retain future earnings, if any, to finance the expansion of our business. As a result, we do not anticipate paying any cash dividends in the foreseeable future.\nRecent Sales of Unregistered Securities\nThe following sets forth certain information regarding sales of, and other transactions with respect to, our securities, which sales and other transactions were not registered pursuant to the Securities Act of 1933, during the last year. Unless otherwise indicated, no underwriters were involved in such transactions.\nDuring the month of December 2015, 3,000 Series A shares were returned to the company from the holder.\nBetween February 1st 2016 and July 31st 2016, the company issued 57,525,192 common shares in connection with the conversion of $26,394 of convertible debentures and accrued interest. The conversions had an average price of $0.0003 per share and resulted in no gain or loss.\nDuring the month of February 2016, the Company issued 1,200,000 common shares to unaffiliated third-party accredited investors in connection with the conversion of 240 preferred B shares. This conversion was within the terms of preferred stock conversion feature and resulted in no gain or loss on the exchange.\nDuring the month of March 2016, the Company issued 5,800,000 common shares to unaffiliated third-party accredited investors in connection with the conversion of 1,160 preferred B shares. This conversion was within the terms of preferred stock conversion feature and resulted in no gain or loss on the exchange.\nDuring the month of March 2016, the Company issued 5,000,000 shares as payment for consulting services valued at $14,370.\nDuring the month of March 2016, the Company sold and issued 15,000 preferred B shares for $112,500.\nOn November 1, 2016, the Company issued 100,000 shares of Series C Preferred Stock to the Companys CEO in exchange for services rendered to the Company.\nDuring the month of November 2016, the Company sold and issued 55,555 Series A shares for $25,000.\nDuring the month of November 2016, the Company sold and issued 10,000,000 common stock shares for $5,000.00.\nDuring the month of November 2016, William Sanchez converted 2,400 Preferred B shares into 12,000,000 common shares. This conversion was within the terms of preferred stock conversion feature and resulted in no gain or loss on the exchange.\nFor the year ended November 30, 2015:\nDuring December 2014, the Company converted a total of $17,520 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 12,130,729 shares of restricted common stock resulting in no gain or loss.\nBetween February and April 2015, the Company issued 12,230,000 common shares to unaffiliated third-party accredited investors in connection with the conversion of 2,446 shares of Preferred B Shares, resulting in no gain or loss.\nBetween May 2015 and November 1, 2015, the Company issued 49,450,000 common shares to unaffiliated third-party accredited investors in connection with the conversion of 9,890 preferred B shares resulting in no gain or loss.\nOn September 4, 2015, the Company issued 100,000 shares of Series C Preferred Stock to the Companys CEO and 3,007,146 common shares in exchange for services rendered to the Company. ITEM 6. SELECTED FINANCIAL DATA\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information under this item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe financial data presented below should be read in conjunction with the more detailed financial statements and related notes, which are included elsewhere in this report. Information discussed herein, as well as elsewhere in this Annual Report on Form 10-K, includes forward-looking statements or opinions regarding future events or the future financial performance of the Company, and are subject to a number of risks and other factors which could cause the actual results to differ materially from those contained in forward-looking statements. Among such factors are general business and economic conditions, and risk factors as listed in this Form 10-K or listed from time to time in documents filed by the Company with the Securities and Exchange Commission.\nFinancial Condition\nAs of November 30, 2016, the Company had total current assets of $26,864 and total current liabilities of $5,381,900 for a net working capital deficit of $5,355,036. As of November 30, 2015, the Company had total current assets of $17,100 and total current liabilities of $6,200,054 for a net working capital deficit of $6,182,954.\nWe need to raise additional money to meet our general and administrative expenses, and we need to raise money to achieve our business objectives. The additional funding will come from equity financing from the sale of Telco Cubas common stock or the issuance of debt securities. If we are successful in completing an equity financing, existing shareholders will experience dilution of their interest in Telco Cuba. The Company does not have any financing arranged and we cannot provide investors with any assurance that the Company will be able to raise sufficient funding from the sale of its common stock or debt securities. In the absence of such financing, our business will fail.\nBased on the nature of Telco Cubas business, management anticipates incurring operating losses in the foreseeable future. Management bases this expectation, in part, on the fact that unrolling a telecommunications operation will cost a substantial amount of money, and possibly take several years before becoming profitable. The Companys future financial results are also uncertain due to a number of factors, some of which are outside its control. These factors include, but are not limited to:\nTelco Cubas ability to raise additional funding;\nTelco Cubas ability to capture market share; and\nDue to the Companys lack of operating history and present inability to generate revenues, our independent auditors have added an explanatory paragraph to their audit opinion issued in connection with our financial statements for 2015, and 2016 indicating substantial doubt about Telco Cubas ability to continue as a going concern. This means that there is substantial doubt whether the Company can continue as an ongoing business for the next 12 months unless we obtain additional capital to pay our bills.\nLiquidity\nThe Companys internal sources of liquidity will be loans that may be available from management as well as revenue from its subsidiaries. Although Telco Cuba has no written arrangements with its management, we expect that the officers may provide the Company with nominal liquidity, when and if it is required.\nThe Companys external sources of liquidity will be private placements for equity and debt financing. There are no assurances that Telco Cuba will be able to achieve further sales of its common stock or any other form of additional financing. If we are unable to achieve the financing necessary to continue its plan of operations, then the Company will not be able to continue its operations and its business will fail.\nCapital Resources\nAs of November 30, 2016, the Company had total assets of $41,602, total liabilities $5,381,900, and a working capital deficit of $5,355,036.\nAs of November 30, 2015, the Company had total assets of $32,101, total liabilities $6,200,054, and a working capital deficit of $6,182,954.\nThe Companys current cash is not sufficient to fully finance its operations at current and planned levels for the next 12 months. Management intends to manage the Companys expenses and payments to preserve cash until the Company is profitable, otherwise additional financing must be arranged. Specifically, management is deferring payments due them until such time as there is sufficient financing in place to permit their payment or the possible issuance of the Companys stock in settlement of amounts due.\nResults of Operations\nWe earned total revenues of $146,731 for the fiscal year ended November 30, 2016.\nWe earned total revenues of $173,560 for the fiscal year ended November 30, 2015.\nWe are presently in the development stage of our business, and we can provide no assurance that we will be able to generate revenues from the sale of telecommunications services in the future. The companys subsidiary, Amgentech, Inc., has been actively providing infrastructure and telecommunication services during these periods. The revenue presented is attributed to the acquisition of Amgentech, Inc.\nWe incurred operating expenses in the amount of $359,634 during the fiscal year ended November 30, 2016.\nWe incurred operating expenses in the amount of $657,927 during the fiscal year ended November 30, 2015.\nOther Income and Expense\nDuring the years ended November 30, 2016 and 2015, the Company incurred interest expense of $335,120, and $290,819, respectively, which was incurred on the Companys third-party debt and convertible debentures.\nFor the years ended November 30, 2016 and 2015, the Company recorded a gain of $1,192,310, and a loss of $(222,251), respectively, attributable to fluctuations in the valuation of the derivative liability.\nOff-Balance Sheet Arrangements\nThe Company has no off-balance sheet arrangements.\nMaterial Agreements\nIn July 2015, the Company entered into an agreement with Next Group Holdings pursuant to which Next Group agreed to provide a virtual call processing platform for telecommunications, a web portal and sales portal. In exchange, the Company agreed to pay $50,000 and use Next Group as its provider for local and international voice, data, and text services as part of its operational platform.\nSubsequent Events\nThe Company evaluated subsequent events from December 1, 2016 through the date this filing was completed, noting the following:\nDuring the month of December 2016, the company issued 10,000,000 common shares in connection with the conversion of $2,000.00 of convertible debentures and accrued interest. The conversions had an average price of $0.0003\nIn February 2017, an officer converted a portion ($1,344) of salary due to him into 2,240,000 common shares.\nDuring the month of February 2017, the company wrote off accrued expenses and payroll former officers which resulted in a 1.3 million gain, which is reported in the statements of operations as other income.\nDuring the month of July 2017, the company procured settlements with three note holders. The settlements were a result of the companys renegotiating of the terms of the original notes. The new terms included the waiving of all additional interest, waiving of default fees, conversion standstill and restrictions on the number of conversions per month, and fixed balances. The notes affected by these settlements were with EMA Financial, Essex Global Investment Corp, and LG Capital.\nDuring the month of August 2017, the company wrote off a promissory note which resulted in a $2,000,000 gain, which is reported in the statements of operations as other income. The write off occurred as a result of the rescission, by the prior owner of a transaction involving a working interest the company had in a certain oil property. The original transaction occurred during the month of July, in the year 2014.\nOn October 25, 2017, the Company entered into a definitive purchase agreement with Net Bee Wireless, Inc. The purchase was contingent on the Company making the purchase price payment. The deal was rescinded in February 2018 as a result of the company not opting to follow through on the purchase.\nDuring the month of December 2017, the company issued a promissory note in the amount of $60,000 in exchange for the assets of Naked Papers, Inc.\nDuring the month of December 2017, the Company converted a total of $26,031.55 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 276,163,333 shares of restricted common stock.\nDuring the month of December 2017, the Company issued 500,000 Preferred C Stock to the Companys CEO in exchange for services rendered to the Company.\nDuring the first quarter 2018, the company acquired the assets of Naked Papers and is currently selling the product under its brand name, Naked Papers under the subsidiary, Naked Papers Brand, Inc., incorporated in the state of Florida.\nDuring the month of January 2018, the Company converted a total of $63,734.00 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 1,262,266,666 shares of restricted common stock.\nDuring the month of February 2018, the Company converted a total of $38,925.56 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 768,225,915 shares of restricted common stock.\nDuring the month of March 2018, the Company converted a total of $14,550.00 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 306,000,000 shares of restricted common stock.\nAnthony J Rivera brought a lawsuit against the company on May 29, 2018. Case number: CACE18012914 in the 17th circuit court of Broward County, Florida. The note holder sued for enforcement of a note issued by the company on December 1, 2015. The case was settled, and the note was amended with a more favorable 50% discount, 5 day look back term on the note. The settlement occurred on September, 2018. The company is working with the note holder to convert the settled amount into stock of the company.\nOn September 28, 2018, the company filed a lawsuit against Cuentas, Inc. (OTCQB: CUEN), f/k/a Next Group Holdings, Inc/Meimoun & Mammon, LLC/Next Mobile, LLC in the 11th circuit court of Miami-Dade County, Florida. Case number: 2018-032974-CA-01 is still ongoing. The case was filed due to CUEN failing to perform on a contract signed on July, 2015. The company is suing for damages and the return of the funds paid for the undelivered Mobile Virtual Network Operator (MVNO) platform.\nDuring the first quarter 2019, the company acquired Advanced Satellite Systems, Inc. and all of its assets, and is continuing to offer its services under the Advanced Cable service mark. Advanced Satellite Systems, Inc, is incorporated in the state of Florida and is registered as a subsidiary of Telco Cuba, Inc.\nDuring the month of February 2019, the company issued a promissory note in the amount of $100,000.00 to purchase Advanced Satellite Systems, Inc.\nDuring the month of February 2019, the Company converted a total of $16,900.00 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 338,000,000 shares of restricted common stock.\nDuring the month of March 2019, the Company converted a total of $18,500.00 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 370,000,000 shares of restricted common stock.\nDuring the month of March 2019, the Company issued 250,000,000 shares to Mr. Roland H Malo as part of the compensation he received for staying on with Advanced Satellite Systems, Inc.\nDuring the month of May 2019, JMZ Alliance forgave all debt owed to JMZ Alliance by Telco Cuba, Inc. The note securing the debt as well as all interest was forgiven by JMZ.\nDuring the month of April 2019, the Company converted a total of $15,000.00 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 300,000,000 shares of restricted common stock.\nDuring the month of December 2020, the Company converted a total of $3,900.00 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 93,000,000 shares of common stock.\nDuring the month of January 2021, the Company converted a total of $51,388.81 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 599,867,533 shares of common stock.\nDuring the month of January 2021, the Company converted the partial monetary value of a consultants contract into 441,977,932 restricted common shares.\nDuring the month of February 2021, the Company converted the partial monetary value of a consultants contract into 34,000,000 restricted common shares.\nDuring the month of February 2021, a shareholder converted 55,555 Series A shares into 55,555,000 restricted common shares. These common shares have an effective date of February 11, 2021 and are denoted as such in section 3A of this disclosure.\nDuring the month of February 2021, the Company converted a total of $49,259.66 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 164,198,867 shares of common stock.\nDuring the month of March 2021, 23,574,570 restricted common shares were issued to appointed members of the board of directors.\nDuring the month of March 2021, preferred B shareholders converted 6,000 preferred shares into 30,000,000 restricted common shares.\nDuring the month of March 2021, the Company converted a total of $7,000.00 in convertible debt to an unaffiliated third-party accredited investor into 46,666,667 shares of common stock.\nDuring the month of April 2021, the company converted a total of $62,966 in convertible debt and accrued interest owed to an unaffiliated third-party accredited investor into 155,471,605 shares of common stock.\nDuring the month of May 2021, the company restated a promissory note as convertible in the amount of $100,000.00. The holder, an unaffiliated third-party unaccredited investor converted the note principle and accrued interest owed into 400,000,000 restricted common shares. These common shares have an effective date of May 6, 2021, and are denoted as such in section 3A of this disclosure.\nDuring the month of May 2021, the company converted a total of $54,934.69 in convertible debt and accrued interest owed to an unaffiliated third-party accredited investor into 73,246,253 shares of common stock. These common shares have an effective date of May 6, 2021, and are denoted as such in section 3A of this disclosure.\nDuring the month of May 2021, a third-party accredited investor/noteholder cancelled and returned 155,471,605 common shares to the company due to a reversal of a third party note purchase.\nDuring the month of May 2021, 25,000,000 restricted common shares were issued to appointed members of the board of directors.\nDuring the month of May 2021, the company converted a total of $52,021.00 in convertible debt and accrued interest owed to an unaffiliated third-party accredited investor into 115,602,222 shares of common stock.\nDuring the month of May 2021, the company sold 40,000,000 shares of restricted common stock to an unaffiliated third-party accredited investor for $10,000.00. These common shares have an effective date of May 26, 2021.\nWe evaluated subsequent events after the balance sheet date through the date the financial statements were issued. We did not identify any additional material events or transactions occurring during this subsequent event reporting period that required further recognition or disclosure in these financial statements.\nCritical Accounting Policies\nThe following accounting policies were in effect for all periods presented:\nAccounting Principles\nThe accounting and reporting policies of the Company conform to United States generally accepted accounting principles. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS OF SMALLER REPORTING COMPANIES\nThe financial statements and related notes are included as part of this report as indexed in the appendix on page. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\n(a) On June 1 2015, the Company was advised that the Companys as independent auditors, Sherb & Co., were no longer conducting business, necessitating the appointment of new independent auditors. Besides a standard going concern qualification, the report of Sherb & Co. on the Companys financial statements for fiscal year ended November 30, 2011 did not contain an adverse opinion or a disclaimer of opinion and were not qualified or modified as to uncertainty, audit scope or accounting principles. In connection with the audit of the Companys financial statement for the fiscal year ended November 30, 2011 (1) there were no disagreements with Sherb & Co. on any matter of accounting principles or practices, financial statement disclosure and procedure which, if not resolved to the satisfaction of Sherb & Co., would have caused Sherb & Co. to make reference to the matter in the filing and (2) there were no reportable events as that term is defined in Item 304 of Regulation S-K promulgated under the Securities Exchange Act of 1934 (Item 304).\n(b) On June 9, 2015, the Company engaged RBSM LLP in New York as the Companys independent accountant to audit the Companys financial statements and to perform reviews of interim financial statements. During the fiscal years ended November 30, 2012 through November 30, 2014, neither the Company nor anyone acting on its behalf consulted with RBSM regarding (i) either the application of any accounting principles to a specific completed or contemplated transaction of the Company, or the type of audit opinion that might be rendered by RBSM on the Companys financial statements; or (ii) any matter that was either the subject of a disagreement with Sherb & Co. or a reportable event with respect to Sherb & Co..\n(c) On August 18, 2021, the Company engaged M&K CPAS, PLLC in Houston, Texas as the Companys independent accountant to audit the Companys financial statements and to perform reviews of interim financial statements. During the fiscal years ended November 30, 2016 through November 30, 2015, neither the Company nor anyone acting on its behalf consulted with M&K CPAS, PLLC (i) either the application of any accounting principles to a specific completed or contemplated transaction of the Company, or the type of audit opinion that might be rendered by M&K CPAS, PLLC on the Companys financial statements; or (ii) any matter that was either the subject of a disagreement with RBSM LLP or a reportable event with respect to RBSM LLP. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nUnder the supervision and with the participation of the Companys management, including the Companys principal executive officer and principal financial officer, the Company has evaluated the effectiveness of the design and operation of its disclosure controls and procedures pursuant to Exchange Act Rule 13a-15(e) and Rule 15d-15(e) as of the end of the fiscal years covered by this annual report. Based on that evaluation, the principal executive officer and principal financial officer believe the disclosure controls and procedures were not effective to ensure that information required to be disclosed by us in the reports we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Securities and Exchange Commissions rules and forms and that our disclosure and controls are designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is accumulated and communicated to our management, including our principal executive officer and principal financial officer, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. Subsequent to November 30, 2014, the Company implemented several changes to the Companys internal controls to address the deficiencies and material weaknesses that led to the previous late filings. Chief among these changes included hiring a new independent audit firm and retaining the services of a consulting firm specializing in financial statement preparation, US GAAP, and Securities Act reporting.\nInternal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Internal control over financial reporting is a process designed under the supervision of our principal executive and principal financial officers to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. All internal control systems, no matter how well designed, have inherent limitations. Even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nUnder the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of November 30, 2014 based on the framework established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on managements assessment, management concluded that, as of November 30, 2014, the Companys internal control over financial reporting was ineffective. Subsequent to November 30, 2014, the Company implemented several changes to the Companys internal controls to address the deficiencies and material weaknesses that led to the misstatements and errors. Chief among these changes included hiring a new independent audit firm and retaining the services of a consulting firm specializing in financial statement preparation, US GAAP, and Securities Act reporting.\nThis Annual Report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this Annual Report. ITEM 9B. OTHER INFORMATION\nNone\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nExecutive Officers and Directors\nThe following table sets forth the directors and executive officers of our Company, their ages and positions with our Company, during the periods covered by this report. Pursuant to our bylaws, our directors are elected at our annual meeting of stockholders and each director holds office until his successor is elected and qualified. Officers are elected by our Board of Directors and hold office until an officers successor has been duly appointed and qualified unless an officer sooner dies, resigns or is removed by the Board.\nThere are no arrangements or understandings regarding the length of time a director of our company is to serve in such a capacity.\nThe following table sets forth information about our executive officers and directors.\nName and Address\nAge\nPosition\nWilliam Sanchez\nHollywood, FL\nChairman, CEO, and CFO\nMaria Anez(1)\nHollywood, FL\nDirector, Secretary\nLinnette Miller(2)\nFt. Lauderdale, FL\nDirector\nThese individuals were appointed to their positions in June 2015.\nNote 1. Maria Anez resigned from her position as director on February, 2018.\nNote 2. Linnette Miller resigned from her position as director on December 2, 2016.\nWilliam J Sanchez has served as our President, Chief Executive Officer and Chairman of the board since June 15th, 2015. Mr. Sanchez has over 20 years experience serving fortune 50, 100 and smaller companies. Mr. Sanchez has held positions at CBS Sports fka Sportsline USA, Tribune Interactive Services, Knight Ridder, DLJ Direct and has been instrumental in the creation of several nascent companies such as Starmedia, Inc., Sportsline, USA, and Picknation, Inc.\nMaria Beatriz Anez has served as our corporate secretary and public relations manager since July, 2015. Mrs. Anez has honed a career in business analysis and sales relationships. A native of Venezuela, she was part of a team that ran a highly successful health care concern. Her responsibilities included negotiating contracts with the Venezuela government, supply negotiations and public relations.\nLinnette Miller is a Manager in the Tax Services practice at Daszkal Bolton LLP, with more than 20 years of experience in public accounting. She focuses on domestic and international tax planning, as well as tax compliance for companies/ individuals, including those with cross border income tax issues and income tax filing. Ms. Miller also assists companies in maximizing their assets and minimizing their liabilities through tax planning and tax efficient structuring. Prior to joining Daszkal Bolton LLP, Ms. Miller held the position of Tax and Audit Director for Chaves & Armstrong, PA, a firm with expertise in international tax, technical accounting and complex audit services. During her professional career, Ms. Miller also worked for KPMG in Panama, where she assisted companies and individuals with tax planning, tax efficient structuring and tax filing requirements.\nCommittees of the Board of Directors\nThe functions of the Audit Committee are currently carried out by our Board of Directors. Our Board of Directors has determined that we do not have an audit committee financial expert on our Board of Directors carrying out the duties of the Audit Committee. The Board of Directors has determined that the cost of hiring a financial expert to act as a director and to be a member of the Audit Committee or otherwise perform Audit Committee functions outweighs the benefits of having a financial expert on the Audit Committee. Our Board of Directors has three members.\nWe do not have a compensation committee, nominating committee, executive committee of our board of directors, stock plan committee or any other committees.\nCode of Ethics\nWe have adopted a code of ethics that applies to our Chief Executive Officer, Chief Financial Officer, Principal Executive Officer, Principal Financial Officer, Principal Accounting Officer, Controller and persons performing similar functions within the Company. A copy of the code of ethics is filed with the SEC as an exhibit to the Companys Form S-1 filed on February 22, 2008. If we make any substantive amendments to the Code of Ethics or grant any waiver, including any implicit waiver, from a provision of the Code of Ethics to our directors, officers and employees, we will disclose the nature of such amendment or waiver in a report on Form 8-K.\nSection 16(a) Beneficial Ownership Reporting Compliance\nUnder Section 16(a) of the Exchange Act, requires that our directors and executive officers and persons who beneficially own more than 10% of our Common Stock (referred to herein as the Reporting Persons) file with the SEC various reports as to their ownership of and activities relating to our Common Stock. Such Reporting Persons are required by the SEC regulations to furnish us with copies of all Section 16(a) reports they file. Based on the information available to us, there are no beneficial owners of common stocks based on the rule promulgated under section 16(a).\nSignificant Personnel\nWe have no significant personnel other than our officers and directors. We presently rely on consultants and other third party contractors to perform administrative and geological services for the Company. We have no formal contracts with any of these consultants and contractors.\nNominating Committee\nWe do not have a standing nominating committee; our Board of Directors is responsible for identifying new candidates for nomination to the Board. We have not adopted a policy that permits shareholders to recommend candidates for election as directors or a process for shareholders to send communications to the Board of Directors. ITEM 11. EXECUTIVE COMPENSATION\nTo date, our directors do not currently receive and have never received any compensation for serving as a director of the Company. Effective July, 2015 the Company entered into Employment Agreement with our CEO.\nThe following table sets forth all compensation awarded to, earned by, or paid for services rendered to officers and directors in all capacities for the last three fiscal years.\nSummary Compensation Table\nAnnual Compensation Long-Term Compensation\nName &\nPrincipal Position Fiscal Year\nNov 30, Salary Bonus Other Annual Compensation Restricted\nStock Awards\nin US$(1)\nOptions/SARs LTIP Payouts All Other\nCompensation\nWilliam J Sanchez (1) $ 240,000.00 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nChief Executive Officer, Director $ 240,000.00 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nMaria Beatriz Anez $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nSecretary, Director $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nLinnette Miller $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nDirector $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nSee notes below:\n(1) The named executive officers salary was accrued and paid during the years 2015 and 2016. An evergreen employment contract was signed with the named executive with no expiration date.\nWe do not presently have a stock option plan but intend to develop an incentive based stock option plan for our officers and directors in the future and may reserve up to ten percent of our outstanding shares of common stock for that purpose.\nCompensation Committee\nWe do not have a compensation committee. The functions of the compensation committee are currently carried out by our Board of Directors. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nSecurities authorized for issuance under equity compensation plans\nThe Company has no securities authorized for issuance under equity compensation plans.\nSecurity Ownership of Certain Beneficial Owners and Management\nThe following table sets forth certain information as of September 30, 2021 with respect to the beneficial ownership of our Companys common stock with respect to each named director and executive officer of our Company, each person known to our Company to be the beneficial owner of more than 5% of said securities, and all directors and executive officers of our Company as a group:\nName and Address Title of Class Amount and Nature of Beneficial Ownership Percentage of\nClass (1)\nWilliam Sanchez (1) Preferred B 43,885 82,35 %\nChief Executive Officer Series C 700,000 100 %\nCommon 49,382,857 0.68 %\nCamille Whiddon, director Common 25,000,000 0.36 %\nFrancis X Flinn, director Common 10,416,670 0.15 %\nPatrick T Wall, director Common 13,157,900 0.20 %\nSayis Tequia, director Preferred B 0.18 %\nSantiago Munoz, director Preferred B 1,503 2.8 %\nFrank Gerardi Common 531,532,932 6.87 %\nSamuel Fromkin Preferred B 3,000 5.6 %\nPinecroft LLC / Paul Konigsberg Preferred B 3,000 5.6 %\nRoland Malo Common 400,000,000 5.8 %\nAll officers, directors, and beneficial owners as a group Common 582,347,502 14.9 %\nPreferred B 51,488 96.60 %\nSeries C 700,000 100 %\n1. This individual was appointed to their position on June 2015.\nThe persons named above have full voting and investment power with respect to the shares indicated, unless otherwise indicated. Under the rules of the Securities and Exchange Commission, a person (or group of persons) is deemed to be a beneficial owner of a security if he or she, directly or indirectly, has or shares the power to vote or to direct the voting of such security, or the power to dispose of or to direct the disposition of such security. Accordingly, more than one person may be deemed to be a beneficial owner of the same security. A person is also deemed to be a beneficial owner of any security, which that person has the right to acquire within 60 days, such as options or warrants to purchase our common stock. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nSince the beginning of the Companys last fiscal year, no director, executive officer, security holder, or any immediate family of such director, executive officer, or security holder owing more than 5% of our shares of common stock has had any direct or indirect material interest in any transaction or currently proposed transaction, which the Company was or is to be a participant, that exceeded the lesser of (1) $120,000, or (2) 1% of the average of the Companys total assets at year-end for the last two completed fiscal years.\nIn July 2015, the Company entered into a 5 year employment agreement with its CEO. Below is a summary of the basic terms of the Agreements:\nBase Salary for the CEO is $240,000 per year\nA vehicle allowance is provided\nOther normal benefits provided such as health, life, and auto insurance as negotiated by the Company\nThe Companys transactions with its officers, directors and affiliates have been and such future transactions will be, on terms no less favorable to the Company than could have been realized by the Company in arms length transactions with non-affiliated persons and will be approved by a majority of the independent disinterested directors.\nDirectors Independence\nThe only independent director on our board as of November 30, 2015 was Linnette Miller, our other director Mr. Sanchez, was not independent, pursuant to the definition of an independent director set forth in Rule 5605(a)(2) of the NASDAQ Manual. In summary, an independent director means a person other than an executive officer or employee of the issuer or any other individual having a relationship which, in the opinion of the issuers board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director.\nWe do not have a compensation committee, nominating committee or audit committee; the functions of these committees are performed by our directors and Chief Financial Officer.\nThe Company is currently traded on the OTC Market Pink Sheet, which does not require that a majority of the Board be independent. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe fees billed to the Company for the fiscal years ending November 30, 2014, and 2015 were as follows:\nYear ended\nNov, 30,\nYear ended\nNov. 30,\nYear ended\nNov. 30,\nAudit Fees $ 24,000 $ 16,000 $ 25,000\nAudit-Related Fees $ 0 $ 0 $ 0\nTax Fees $ 0 $ 0 $ 0\nAll Other Fees $ 0 $ 0 $ 0\nBecause the Company does not have an audit committee, it has not instituted pre-approval policies and procedures as described in paragraph (c)(7)(i) of Rule 2-01 of regulation S-X.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\nFinancial Statements and Schedules\nThe financial statements are set forth under Item 8 of this Annual Report on Form 10-K. Financial statement schedules have been omitted since they are either not required, not applicable, or the information is otherwise included.\nExhibit Listing\nExhibit No.\nFiled herewith\nIncorporated by reference\nDescription of Exhibit\nForm\nExhibit\nFiling date\n3.1\nArticles of Incorporation\nS-1\n3.1\n02/22/08\n3.2\nCertificate of Change dated July 20, 2009\n8-K\n3.1\n08/03/09\n3.3\nBylaws\nS-1\n3.2\n02/22/08\n4.1\nSpecimen Stock Certificate\nS-1\n4.1\n02/22/08\nCode of Ethics\nS-1\n02/22/08\n31.1\nCertifications of Principal Executive Officer and Principal Financial Officer Pursuant to Section 302 of the Sarbanes Oxley Act of 2002\nX\n32.1\nCertifications of Principal Executive Officer and Principal Financial Officer Pursuant to Section 906 of the Sarbanes Oxley Act of 2002\nX\nTelco Cuba, Inc.\nFINANCIAL STATEMENTS ADDENDUM\nFINANCIAL STATEMENT\nPage Number\nReport of Independent Registered Public Accounting Firm\nBalance Sheets as of November 30, 2016 and 2015\nStatements of Operations for the Years Ended November 30, 2016 and 2015\nStatement of Stockholders Deficit for the Year Ended November 30, 2015\nStatement of Stockholders Deficit for the Year Ended November 30, 2016\nStatements of Cash Flows for the Years Ended November 30, 2016 and 2015\nNotes to Financial Statements\nto\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Telco Cuba, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Telco Cuba, Inc. (the Company) as of November 30, 2015 and 2016, and the related statements of operations, stockholders deficit, and cash flows for each of the years in the two-year period ended November 30, 2015 and 2016, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of November 30, 2015 and 2016, and the results of its operations and cash flows for each of the years in the two-year period ended November 30, 2015 and 2016 in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has suffered a net loss from operations and has a net capital deficiency, which raises substantial doubt about its ability to continue as a going concern. Managements plans regarding those matters are discussed in Note 1. The financial statements do not include any adjustments that might result from this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities Exchange Commission and PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the Companys financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and the significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe our audits provide a reasonable basis for our opinion\n/s/ M&K CPAS, PLLC\nWe have served as the Companys auditors since 2021.\nHouston, TX\nSeptember 28,\nTelco Cuba, Inc.\nBALANCE SHEETS\nNovember 30,\nNovember 30,\nASSETS\nCURRENT ASSETS:\nCash $ 21,414 $ 7,592\nDeposits - 6,201\nAccounts receivable - 3,307\nInventories 5,450 -\nTOTAL CURRENT ASSETS 26,864 17,100\nFIXED ASSETS (net of accumulated depreciation of $6,686 in 2016 and $6,423 in 2015) 14,738 15,001\nTOTAL ASSETS $ 41,602 $ 32,101\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCURRENT LIABILITIES:\nAccounts payable $ 167,854 $ 103,436\nAccrued expenses 2,088,082 2,010,792\nNotes payable - related parties 120,577 132,577\nConvertible debentures - related parties 15,000 1,973\nNotes payable 2,236,446 2,233,361\nConvertible debentures 621,843 393,506\nDerivative liability (Note 7) 132,098 1,324,409\nTOTAL CURRENT LIABILITIES 5,381,900 6,200,054\nTOTAL LIABILITIES 5,381,900 6,200,054\nSTOCKHOLDERS DEFICIT:\nPreferred A stock, $.001 par value; authorized shares - 100,000 shares; 3,000 and 3,000 issued and outstanding\nPreferred B stock, $.001 par value; authorized shares - 100,000 shares; 71,000 and 87,500 issued and outstanding\nPreferred C stock, $.001 par value; authorized shares - 100,000 shares; 87,500 and 87,500 issued and outstanding\nCommon stock, $.001 par value; authorized shares - 975,000,000 shares; 214,631,331 in 2016 and 123,106,039 shares in 2015 issued and outstanding 214,631 123,106\nAdditional paid-in capital 558,926 467,247\nAccumulated deficit (6,114,193 ) (6,758,480 )\nTOTAL STOCKHOLDERS DEFICIT $ (5,340,298 ) $ (6,167,953 )\nTOTAL LIABILITIES AND STOCKHOLDERS DEFICIT $ 41,602 $ 32,101\nThe accompanying notes are an integral part of these financial statements\nTelco Cuba, Inc.\nSTATEMENTS OF OPERATIONS\nFor the Years ended\nNovember 30,\nNovember 30,\nREVENUES $ 146,731 $ 173,560\nOPERATING EXPENSES 359,634 831,489\nOPERATING (LOSS) (212,903 ) (657,927 )\nOTHER (INCOME) EXPENSE:\nInterest expense 335,120 290,819\nChange in fair value of derivative liability (1,192,310 ) 222,251\nTOTAL OTHER (INCOME) EXPENSE 857,190 513,070\nNET INCOME (LOSS) $ 644,287 $ (1,170,997 )\nNET INCOME (LOSS) PER SHARE:\nBASIC $ 0.004 $ (0.02 )\nDILUTED $ 0.001 $ (0.02 )\nWEIGHTED AVERAGE COMMON SHARES OUTSTANDING\nBASIC 172,312,161 63,865,281\nDILUTED 671,516,358 452,789,678\nThe accompanying notes are an integral part of these financial statements\nTelco Cuba, Inc.\nCONSOLIDATED STATEMENT OF STOCKHOLDERS DEFICIT\nFOR THE YEAR ENDED NOVEMBER 30, 2015\nPreferred A Stock Preferred B Stock Preferred C Stock Common Stock Additional\nTotal\n($.0001 par\nvalue) ($.0001 par\nvalue) ($.0001 par\nvalue) ($.0001 par\nvalue) Paid-In\nCapital Accumulated\nDeficit Stockholders\nDeficit\nBalance, November 30, 2014 - - - - - - - $ 1,000 $ - $ 5,991 $ 6,991\nDistributions -\n$ (62,135 ) $ (62,135 )\nRecapitalization - Telco Cuba\n3,000 $ 3 83,680 $ 83 - - 46,288,164 $ 46,288 (5,471,140 ) - (5,424,766 )\nRecapitalization - Telco Cuba\n$ (1,000 )\n$ 1,000 -\nCommon and Preferred Stock Issuance:\nConversion of debentures\n12,130,729 $ 12,131 $ 5,389\n$ 17,520\nConversion of Preferred B shares to common shares\n(12,336 ) $ (12 )\n61,680,000 $ 61,680 $ (61,668 )\n-\nIssuance of common shares as payment for consulting services\n3,007,146 $ 3,007 $ 67,710\n$ 70,717\nIssuance of Preferred C shares\n100,000 $ 100\n394,618\n$ 394,718\nInsufficient Additional Paid-in-Capital balance transferred to Accumulated Deficit\n5,532,337 (5,532,337 ) -\nNet Loss\n$ (1,170,997 ) $ (1,170,997 )\nBalance, November 30, 2015 3,000 $ 3 71,344 $ 71 100,000 $ 100 123,106,039 $ 123,106 $ 467,247 $ (6,758,480 ) $ (6,167,953 )\nThe accompanying notes are an integral part of these financial statements\nTelco Cuba, Inc.\nCONSOLIDATED STATEMENT OF STOCKHOLDERS DEFICIT\nFOR THE YEAR ENDED NOVEMBER 30, 2016\nPreferred A Stock Preferred B Stock Preferred C Stock Common Stock\nTotal\n($.0001 par\nvalue) ($.0001 par\nvalue) ($.0001 par\nvalue) ($.0001 par\nvalue) Additional\nPaid-In Accumulated\nDeficit Stockholders\nDeficit\nBalance, November 30, 2015 3,000 $ 3 71,344 $ 71 100,000 $ 100 123,106,039 $ 123,106 $ 467,247 (6,758,480 ) $ (6,167,953 )\nSale of common and preferred stock 55,555 $ 56 15,000 $ 15\n$ - 10,000,000 $ 10,000 $ 132,429\n$ 142,500\nPreferred A shares returned to Company (3,000 ) $ (3 )\n$ 3\n$ -\nIssuance of stock for:\nNote Payable conversion\n57,525,192 $ 57,525 $ (31,131 )\n$ 26,394\nConversion of Preferred B to common shares\n(3,800 ) $ (4 )\n19,000,000 $ 19,000 $ (18,996 )\n$ -\nIssuance of common shares as payment for consulting services\n5,000,000 $ 5,000 $ 9,374\n$ 14,374\nIssuance of Preferred C shares\n100,000 $ 100\n$ 100\nNet Income\n644,287 $ 644,287\nBalance, November 30, 2016\n55,555 $ 56 82,544 $ 82 200,000 $ 200 214,631,331 $ 214,631 $ 558,926 (6,114,193 ) $ (5,340,298 )\nThe accompanying notes are an integral part of these financial statements\nTelco Cuba, Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the years ended\nNovember 30, November 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet Income (Loss) $ 644,287 $ (1,170,997 )\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nChange in fair value of derivative (1,192,311 ) 222,252\nDiscount amortization 119,366 60,977\nStock based compensation 14,474 465,436\nDepreciation (13,192 )\nChanges in operating assets and liabilities:\nAccounts receivable 9,508 (953 )\nInventory (5,450 ) -\nAccounts payable 64,417 3,453\nAccrued expenses 77,290 304,833\nNET CASH USED IN OPERATING ACTIVITIES (268,156 ) (128,191 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from Sale of Stock 142,500 -\nProceeds from Borrowing 219,728 335,343\nPrincipal Payments on Debt (80,250 ) (149,150 )\nDistributions to shareholder - (62,137 )\nNET CASH PROVIDED BY FINANCING ACTIVITIES 281,978 124,056\nNET (DECREASE) INCREASE IN CASH 13,822 (4,135 )\nCASH - BEGINNING OF PERIOD 7,592 11,727\nCASH - END OF PERIOD $ 21,414 $ 7,592\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid for interest $ - $ -\nNON-CASH INVESTING AND FINANCING ACTIVITIES:\nPreferred B Stock conversion to common shares $ 19,000 $ 61,680\nStock issued in connection with conversion of debentures $ 26,394 $ 17,520\nMerger with Amgentech and Recapitalization: $ - $ -\nTransfer insufficient Additional Paid-in-Capital balance to Retained Earnings $ - $ 5,532,337\nCommon Stock issued for merger and recapitalization, net $ - $ 5,470,140\nThe accompanying notes are an integral part of these financial statements\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\n1. Nature of Operations and Going Concern\nTelco Cuba, Inc. (fka CaerVision Global, Inc., fka American Mineral Group Minerals Inc.) (the Company) was incorporated in the State of Nevada on August 10, 2007. Up until June 12, 2015, the company was previously engaged in the exploration, development, and acquisition of mineral properties.\nOn June 12, 2015, the Company consummated a Share Exchange with Amgentech, Inc., a Florida corporation. Under the terms of the Share Exchange, the holders of Amgentech received 50,088 shares of Series B Preferred Stock that had been previously issued to third parties in exchange for 100% of the issued and outstanding capital of Amgentech. Each share of Series B preferred is convertible into 5,000 shares of common stock (254,440,000 shares total) and has voting rights of 5,000 per share (254,440,000 votes). As a result of this transaction, Amgentech became a wholly owned subsidiary of the Company with control transferring to the previous owners of Amgentech. Amgentech elected to be treated as the successor issuer for SEC reporting and accounting purposes. The Share Exchange was accounted for as a reverse acquisition and re-capitalization. The Amgentech Shareholders obtained approximately 60% of voting control on the date of Share Exchange. Amgentech was the acquirer for financial reporting purposes and the Company was the acquired company. The Company filed an amendment to its articles of incorporation and changed its name to Telco Cuba, Inc. Telco Cuba is foremost a technology solutions service provider offering services under the brand names Amgentech and Telco Cuba.\nGoing Concern\nThe accompanying financial statements have been prepared on the basis of accounting principles applicable to a going concern; accordingly, they do not give effect to adjustments that would be necessary should the Company be unable to continue as a going concern and therefore be required to realize its assets and retire its liabilities in other than the normal course of business and at amounts different from those in the accompanying financial statements. As shown in the accompanying financial statements, the Company has an accumulated deficit of more than $5.7 million. The Company currently does not have the cash resources to meet its operating commitments for the next twelve months and expects to have ongoing requirements for capital investment or debt to implement its business plan. These factors, among others, raise substantial doubt that the Company will be able to continue as a going concern for a reasonable period of time. Management plans to raise cash from public or private debt or equity financing, on an as needed basis. The Companys ability to continue as a going concern is in substantial doubt unless it can achieve profitable operations and/or upon obtaining additional financing. The outcome of these matters cannot be predicted at this time.\n2. Significant Accounting Policies\na) Accounting Principles\nThe accounting and reporting policies of the Company conform to United States generally accepted accounting principles.\nb) Basic and Diluted Loss per Share\nBasic and diluted loss per share is based on the weighted average number of shares outstanding. Fully diluted shares are calculated as follows:\nSchedule Of Earnings Per Share Basic And Diluted\nNovember 30,\nNovember 30,\nWeighted average shares - basic 172,312,161 63,865,281\nConvertible debentures 499,204,197 388,924,397\nWeighted average shares - fully diluted 671,516,358 452,789,678\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\nc) Fair Value Measurements\nValuation Hierarchy\nASC 820 establishes a valuation hierarchy for disclosure of the inputs to valuation used to measure fair value. This hierarchy prioritizes the inputs into three broad levels as follows. Level 1 inputs are quoted prices (unadjusted) in active markets for identical assets or liabilities. Level 2 inputs are quoted prices for similar assets and liabilities in active markets or inputs that are observable for the asset or liability, either directly or indirectly through market corroboration, for substantially the full term of the financial instrument. Level 3 inputs are unobservable inputs based on the Companys own assumptions used to measure assets and liabilities at fair value. A financial asset or liabilitys classification within the hierarchy is determined based on the lowest level input that is significant to the fair value measurement.\nThe following table provides the assets and liabilities carried at fair value measured on a recurring and non-recurring basis as of November 30, 2016, and 2015:\nDerivative liabilities\nSchedule of Fair Value Measurements, Recurring and Nonrecurring\nFair Value Measurements\nTotal Carrying\nvalue Quoted prices\nin active markets\n(Level 1) Significant other\nobservable inputs\n(Level 2) Significant\nunobservable inputs\n(Level 3)\nNovember 30, $ 132,098\n$ 132,098\nNovember 30, $ 1,324,409 - - $ 1,324,409\nThe derivative liabilities are measured at fair value using quoted market prices and estimated volatility factors based on historical quoted market prices for the Companys common stock, and are classified within Level 3 of the valuation hierarchy.\nThe following is a reconciliation of the beginning and ending balances for assets and liabilities measured at fair value on a recurring basis using significant unobservable inputs (Level 3):\nSchedule of Fair Value, Liabilities Measured on Recurring Basis\nNovember 30,\nNovember 30,\nBeginning balance $ 1,324,409 $ 921,815\nDerivative liabilities recorded - 180,343\nUnrealized (gain) loss attributable due to the change in liabilities (1,192,311 ) 222,251\nEnding balance $ 132,098 $ 1,324,409\nThe fair value of the derivative liabilities was calculated using the Black-Scholes Option Pricing model under the assumptions detailed in Note 8. Gains and losses (realized and unrealized) included in earnings (to change in fair value of derivative liability) for the years ended November 30, 2016, and 2015, are reported in other expenses as follows:\nSchedule of change in fair value of derivative liability\nNovember 30,\nNovember 30,\n(Gain) Loss on derivative liabilities recorded during the period - -\nDebt discount attributable to derivative liabilities recorded - -\nDerivative liabilities converted during the period - -\nUnrealized (gain) attributable due to the change in liabilities $ (1,192,311 ) $ (222,251 )\nNet unrealized (gain) loss included in earnings $ (1,192,311 ) $ (222,251 )\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\nThe Company did not have any Level 1 or Level 2 assets or liabilities as of November 30, 2016, and November 30, 2015 and had Level 3 liabilities consisting of notes payable. The carrying amount of the notes payable at November 30, 2016, and 2015 approximate their respective fair value based on the Companys incremental borrowing rate.\nCash and cash equivalents include money market securities that are considered to be highly liquid and easily tradable as of November 30, 2016, and 2015, respectively. These securities are valued using inputs observable in active markets for identical securities and are therefore classified as Level 1 within our fair value hierarchy.\nIn addition, FASB ASC 825-10-25 Fair Value Option was effective at the time of adoption. ASC 825-10-25 expands opportunities to use fair value measurements in financial reporting and permits entities to choose to measure many financial instruments and certain other items at fair value. The Company did not elect the fair value options for any of its qualifying financial instruments.\nd) Income Taxes\nIncome taxes are accounted for in accordance with the provisions of FASB ASC 740, Accounting for Income Taxes. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amounts expected to be realized.\ne) Cash and Cash Equivalents\nFor purposes of the statement of cash flows, cash includes demand deposits, saving accounts and money market accounts. The Company considers all highly liquid instruments with maturities of three months or less when purchased to be cash equivalents.\nf) Revenue Recognition\nThe Companies follow the guidance of the FASB ASC 605-10-S99 Revenue Recognition Overall - SEC Materials. The Companies record revenue when persuasive evidence of an arrangement exists, product delivery has occurred, the sales price to the customer is fixed or determinable, and collectability is reasonably assured. Revenues consist primarily of product sales.\ng) Estimates\nThe preparation of financial statements in conformity with US generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amount of assets and liabilities and disclosure of contingent liabilities at the date of the financial statements, and the reported amounts of revenues and expenditures during the reporting period. Actual results could differ from those reported.\nh) Accounts receivable and concentration of credit risk\nThe Company provides credit to its clients in the form of payment terms. The Company limits its credit risk by performing credit evaluations of its clients and maintaining a reserve, if deemed necessary, for potential credit losses. Such evaluations include the review of a customers outstanding balances with consideration towards such customers historical collection experience, as well as prevailing economic and market conditions and other factors. The Company currently has no accounts receivable in 2016 and, therefore, does not currently have a concentrated credit risk associated with trade receivables.\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\ni) Inventory\nInventory is carried at the lower of cost or net realizable value, with the cost being determined on a first-in, first-out (FIFO) basis. The Company reviews physical inventory for obsolescence and/or excess and will record a reserve if necessary. As of the date of this report, no reserve was deemed necessary.\nj) Fixed Assets\nFixed assets are stated at cost less accumulated depreciation, with depreciation recognized on a straight-line basis over the shorter of the estimated useful life of the asset or the lease term, if applicable. When assets are retired or disposed, the cost and accumulated depreciation are removed from the accounts, and any resulting gains or losses are included in income. Repairs and maintenance are charged to expense in the period incurred.\nFixed assets consist primarily of computer equipment and furniture and fixtures. The estimated useful lives range from three to five years..\nThe Companys property and equipment are individually reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable from the undiscounted future cash flows of such asset over the anticipated holding period. An impairment loss is measured by the excess of the assets carrying amount over its estimated fair value.\nImpairment analyses are based on managements current plans, asset holding periods, and currently available market information. If these criteria change, the Companys evaluation of impairment losses may be different and could have a material impact to the consolidated financial statements.\nFor the years ended November 30, 2016, and 2015, based on the results of managements impairment analyses, there were no impairment losses.\nAt November 30, 2016 and 2015, fixed assets consisted of the following:\nSchedule of fixed assets\nNovember 30,\nNovember 30,\nFurniture and fixtures $ 3,153 $ 3,153\nComputer equipment 18,271 18,271\nLess: accumulated depreciation (6,686 ) (6,423 )\nFixed assets, net $ 14,738 $ 15,001\nDuring the years ended November 30, 2016, and 2015, there were no additions to fixed assets. Depreciation expense for the years ended November 30, 2016, and 2015 was $263 and $13,192, respectively.\nk) Recently Adopted Accounting Pronouncements\nManagement does not believe that any recently issued but not yet effective accounting pronouncements if currently adopted would have a material effect on the accompanying financial statements.\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\n3. Capital Stock\na) Authorized\nAs of November 30, 2016, authorized capital stock consists of:\n975,000,000 common shares with a par value of $0.001 per share; and\n400,000 preferred shares with a par value of $0.001 per share\nAs of November 30, 2015, authorized capital stock consists of:\n975,000,000 common shares with a par value of $0.001 per share; and\n300,000 preferred shares with a par value of $0.001 per share\nb) Share Issuances\nFor the year ended November 30, 2016:\nDuring the month of December 2015, 3,000 Series A shares were returned to the company from the holder.\nBetween February 1st 2016 and July 31st 2016, the company issued 57,525,192 common shares in connection with the conversion of $26,394 of convertible debentures and accrued interest. The conversions had an average price of $0.0003 per share and resulted in no gain or loss.\nDuring the month of February 2016, the Company issued 1,200,000 common shares to unaffiliated third-party accredited investors in connection with the conversion of 240 preferred B shares. This conversion was within the terms of preferred stock conversion feature and resulted in no gain or loss on the exchange.\nDuring the month of March 2016, the Company issued 5,800,000 common shares to unaffiliated third-party accredited investors in connection with the conversion of 1,160 preferred B shares. This conversion was within the terms of preferred stock conversion feature and resulted in no gain or loss on the exchange.\nDuring the month of March 2016, the Company issued 5,000,000 shares as payment for consulting services valued at $14,370.\nDuring the month of March 2016, the Company sold and issued 15,000 preferred B shares for $112,500.\nOn November 1, 2016, the Company issued 100,000 shares of Series C Preferred Stock to the Companys CEO in exchange for services rendered to the Company.\nDuring the month of November 2016, the Company sold and issued 55,555 Series A shares for $25,000.\nDuring the month of November 2016, the Company sold and issued 10,000,000 common stock shares for $5,000.00.\nDuring the month of November 2016, William Sanchez converted 2,400 Preferred B shares into 12,000,000 common shares. This conversion was within the terms of preferred stock conversion feature and resulted in no gain or loss on the exchange.\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\nFor the year ended November 30, 2015:\nDuring December 2014, the Company converted a total of $17,520 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 12,130,729 shares of restricted common stock resulting in gain or loss.\nBetween February and April 2015, the Company issued 12,230,000 common shares to unaffiliated third-party accredited investors in connection with the conversion of 2,446 shares of Preferred B Shares resulting in no gain or loss.\nBetween May 2015 and November 1, 2015, the Company issued 49,450,000 common shares to unaffiliated third-party accredited investors in connection with the conversion of 9,890 preferred B shares resulting in no gain or loss.\nOn September 4, 2015, the Company issued 100,000 shares of Series C Preferred Stock to the Companys CEO and 3,007,146 common shares in exchange for services rendered to the Company.\nc) Preferred Stock\nFor the year ended November 30, 2016:\nThe Company has 400,000 shares of preferred stock authorized of which 300,000 shares were designated in three series as follows:\nSeries A Senior Convertible Voting Non-Redeemable Preferred Stock (the Series A Preferred) - 100,000 shares authorized, 3,000 shares issued and outstanding;\nSeries B Senior Subordinated Convertible Voting Redeemable Preferred Stock (the Series B Preferred) - 100,000 shares authorized, 71,344 shares issued and outstanding; and\nSeries C Senior Subordinated Convertible Voting Redeemable Preferred Stock (the Series C Preferred) - 200,000 shares authorized, issued and outstanding;\nEach share of Series A Preferred is convertible into 1,000 restricted shares of common stock. Each share of Series B Preferred is convertible into 5,000 restricted shares of common stock. Series C Preferred Stock is convertible into 100,000 votable shares, but not convertible to common shares otherwise. Conversion is at the discretion of the preferred shareholder, and no additional consideration is paid.\nThe Company Preferred Stock has no dividend rights but does have liquidation rights as follows: The Series A Preferred is senior in liquidation preference to all other series or classes of capital stock, preferred or common; the Series B Preferred is senior in liquidation preference to all series or classes of capital stock other than the Series A Preferred; the Series C Preferred is senior in liquidation preference to all classes of Common Stock.\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\nFor the year ended November 30, 2015:\nThe Company has 400,000 shares of preferred stock authorized of which 300,000 shares were designated in three series as follows:\nSeries A Senior Convertible Voting Non-Redeemable Preferred Stock (the Series A Preferred) - 100,000 shares authorized, 3,000 shares issued and outstanding;\nSeries B Senior Subordinated Convertible Voting Redeemable Preferred Stock (the Series B Preferred) - 100,000 shares authorized, 71,344 shares issued and outstanding; and\nSeries C Senior Subordinated Convertible Voting Redeemable Preferred Stock (the Series C Preferred) - 100,000 shares authorized, issued and outstanding.\nEach share of Series A Preferred is convertible into 1,000 restricted shares of common stock. Each share of Series B Preferred is convertible into 5,000 restricted shares of common stock. Series C Preferred Stock is convertible into 10,000 votable shares, but not convertible to common shares otherwise. Conversion is at the discretion of the preferred shareholder, and no additional consideration is paid.\nThe Company Preferred Stock has no dividend rights but liquidation rights as follows: The Series A Preferred is senior in liquidation preference to all other series or classes of capital stock, preferred or common; the Series B Preferred is senior in liquidation preference to all series or classes of capital stock other than the Series A Preferred; the Series C Preferred is senior in liquidation preference to all classes of Common Stock.\nIssuance of Preferred Stock\nDuring the month of December 2015, 3,000 Series A shares were cancelled and returned to the company. No consideration was paid for the return of these shares. There were no further issuances or redemptions of Preferred Stock Series A during the fiscal year ending November 30, 2016.\nThere were no issuances or redemptions of Preferred Stock Series A during the fiscal year ending November 30, 2015.\nDuring the month of March 2016 15,000 Preferred Stock Series B shares were sold to 5 accredited investors. There were 3,800 Preferred Stock Series B shares redeemed into 19,000,000 common stock shares. There were no further issuances or redemptions of Preferred Stock Series B during the fiscal year ending November 30, 2016.\nThere were no new issuances of Preferred Stock Series B during the fiscal year ending November 30, 2015. There were 12,136 Preferred Stock Series B shares redeemed into 60,680,000 common stock shares. There were no further redemptions of Preferred Stock Series B during the fiscal year ending November 30, 2015.\n100,000 shares of Preferred Stock Series C were issued during November 2016. These shares are included in the financial statements as Stock Based Compensation and are valued at $394,618. There were no further issuances of Preferred Stock Series C during the fiscal year ending November 30, 2016.\n100,000 shares of Preferred Stock Series C were newly issued during September 2015. 100,000 Preferred Stock Series C shares represent the entire authorized of this class of non-converting class of preferred shares for year ended November 30, 2015.\nd) Warrants and Options\nFor the year ended November 30, 2016, and 2015 there are no outstanding stock options and warrants.\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\n4. Concentration Risk\nThe Companys financial instruments consist of cash, accounts payable and accrued liabilities. It is managements opinion that the Company is not exposed to significant interest or credit risks arising from these financial instruments. Because of the short maturity and capacity of prompt liquidation of such assets and liabilities, the fair values of these financial instruments approximate their carrying values.\nFinancial instruments which potentially subject the Company to concentrations of credit risk consist principally of cash. The Company places its cash with high credit quality financial institutions in the United States. Bank deposits in the United States did not exceed federally insured limits as of November 30, 2015, and 2016.\nThe Company may operate outside the United States of America and thus may have significant exposure to foreign currency risk in the future due to the fluctuations between the currency in which the Company operates and the U.S. dollar.\n5. Income Taxes\nA reconciliation of income taxes at statutory rate with the reported income taxes is as follows:\nSchedule of Income Taxes\nPeriod ended November 30,\nIncome tax expense (benefit) at Federal statutory rate of 35% $ 225,500 $ (409,800 )\n(Utilization) increase in tax loss carryforward (225,500 ) 409,800\nNet income tax $ - $ -\nAt November 30, 2016 the Company has available net operating losses of approximately $7.1 million which may be carried forward to apply against future taxable income. These losses will expire in 2034. Deferred tax assets related to these losses have not been recorded due to uncertainty regarding their utilization.\n6. Convertible Debentures\nAs of November 30, 2016, and 2015, the Company has issued and outstanding, convertible debt totaling $572,843 and $395,479, of which all but one note for $15,000 in 2016 and $1,973 in 2015 were held by unrelated third parties. As of November 30, 2016, these debts were all due on demand, bear interest at the rates between 8% and 12% per annum and are convertible at a discount to the stocks market price of between 15% and 55%, based on a look back period of between 10 and 30 days prior to conversion. Combined, these convertible instruments can be converted into 499,204,917 and 388,924,397 shares of common stock as of November 30, 2016, and 2015, respectively.\nThe following table provides a summary of the changes in the Companys convertible notes, as of November 30, 2016, and 2015:\nSchedule of Convertible Debentures\nNovember 30,\nNovember 30,\nPrior year balance forward $ 395,479 $ 375,925\nIssuance of new convertible notes 216,642 305,343\nDiscount upon issuance of new notes - (180,343 )\nAmortization of discount 119,366 60,977\nPrincipal payments (68,250 ) (149,150 )\nConversion of notes (26,394 ) (17,273 )\nBalance as of yearend $ 636,843 $ 395,479\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\nFor the years ended November 30, 2016, and 2015, interest expense attributable to convertible debentures was $41,111, and $27,662, while accrued interest was $64,372, and $69,071, respectively.\nDuring the year ended November 30, 2015, the Company issued four notes total of $140,000 in new convertible debentures. Due to the variable conversion price associated with the above convertible debentures, the Company has determined that the conversion feature is considered a derivative liability. The accounting treatment of derivative financial instruments requires that the Company record the fair value of the derivatives as of the inception date of the Convertible Promissory Note and to adjust the fair value as of each subsequent balance sheet date. The initial fair value of the embedded debt derivative at the date of issuance was $180,343 allocated as a debt discount and derivatives liability. The debt discount is being amortized over the term of the convertible promissory notes.\nIn addition, the Company recorded $336,810 in convertible debentures previously issued by Telco Cuba prior to the merger with Amgentech. These debts bear interest at the rates between 8% and 12% per annum, and are convertible at a discount to the stocks market price of between 15% and 55%, based on a look back period of between 10 and 30 days prior to conversion. Combined, these convertible instruments can be converted into 499,204,197 and 388,394,927 shares of common stock as of November 30, 2016 and November 30, 2015, respectively.\n7. Derivative Liabilities\nIn June 2008, the FASB finalized ASC 815, Determining Whether an Instrument (or Embedded Feature) is indexed to an Entitys Own Stock. Under ASC 815, instruments which do not have fixed settlement provisions are deemed to be derivative instruments. The Company has determined that it needs to account for convertible debentures issued for its shares of common stock, as derivative liabilities, and apply the provisions of ASC 815. The instruments have a ratchet provision that adjust either the exercise price and/or quantity of the shares as the conversion price equals to variable % of the market price at the time of conversion, as a result, the instruments need to be accounted for as derivative liabilities. In accordance with ASC 815, these convertible debentures have been re-characterized as derivative liabilities. ASC 815, Accounting for Derivative Instruments and Hedging Activities (ASC 815) requires that the fair value of these liabilities be re-measured at the end of every reporting period with the change in fair value reported in the statement of operations.\nThe fair value of the derivative liabilities was measured using the Black-Scholes option pricing model.\nAt November 30, the fair value of the embedded derivatives was determined using Binomial Option Pricing Model based on the following assumptions:\nSchedule of assumptions\nNovember 30,\nNovember 30,\n(1) dividend yield 0 % 0 %\n(2) expected volatility 352.94 % 352.94 %\n(3) weighted average risk-free interest rate, 4 % 4 %\n(4) expected life, and 0.25 Year 0.25 Year\n(5) estimated fair value of the Companys common stock per share. $.004 $.004\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\n8. Notes Payable\nThe following table provides a summary of the changes in the Companys notes payables, as of November 30, 2016, and 2015:\nSchedule of Notes Payable\nNovember 30,\nNovember 30,\nPrior year balance forward:\nDue to non-affiliated third parties $ 2,233,361 $ 2,337,938\nDue to related parties 132,577 104,577\nIssuance of notes to related party - 28,000\nNote repayments to related party (12,000 ) -\nBalance on November 30 $ 2,353,938 $ 2,365,938\nFor the years ended November 30, 2016, and 2015, interest expense attributable to notes payable was $145,669, and $168,851, respectively\n9. Related party transactions\nOfficers have from time-to-time lent money to the Company. At November 30, 2016, and 2015, they had a balance owed to them (included in the balances above in footnotes 6 and 8) of $135,577, and $134,550, respectively. The balances do not bear interest and are due on demand. The notes are discounted using an imputed interest rate of 12%.\n10. Commitments and Contingencies\nFrom time to time, we may be involved in litigation relating to claims arising out of our operations in the normal course of business. As of the date of filing of this report, there were no pending or threatened lawsuits.\n11. Subsequent Events\nDuring the month of July 2017, the company procured settlements with three note holders. The settlements were a result of the companys renegotiating of the terms of the original notes. The new terms included the waiving of all additional interest, waiving of default fees, conversion standstill and restrictions on the number of conversions per month, and fixed balances. The notes affected by these settlements were with EMA Financial, Essex Global Investment Corp, and LG Capital.\nOn October 25, 2017, the Company entered into a definitive purchase agreement with Net Bee Wireless, Inc. The purchase was contingent on the Company making the purchase price payment. The deal was rescinded on February, 2018 as a result of the company not opting to follow through on the purchase.\nDuring the month of December 2017, the company issued a promissory note in the amount of $60,000 in exchange for the assets of Naked Papers, Inc.\nDuring the month of December 2017, the Company converted a total of $26,031 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 276,163,333 shares of restricted common stock.\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\nDuring the month of December 2017, the Company issued 500,000 Preferred C Stock to the Companys CEO in exchange for services rendered to the Company.\nDuring the first quarter 2018, the company acquired the assets of Naked Papers and is currently selling the product under its brand name, Naked Papers under the subsidiary, Naked Papers Brand, Inc., incorporated in the state of Florida.\nDuring the month of January 2018, the Company converted a total of $63,734 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 1,262,266,666 shares of restricted common stock.\nDuring the month of February 2018, the Company converted a total of $38,925 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 768,225,915 shares of restricted common stock.\nDuring the month of March 2018, the Company converted a total of $14,550 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 306,000,000 shares of restricted common stock.\nAnthony J Rivera brought a lawsuit against the company on May 29, 2018. Case number: CACE18012914 in the 17th circuit court of Broward County, Florida. The note holder sued for enforcement of a note issued by the company on December 1, 2015. The case was settled, and the note was amended with a more favorable 50% discount, 5 day look back term on the note. The settlement occurred in September, 2018. The company is working with the note holder to convert the settled amount into stock of the company.\nOn September 28, 2018, the company filed a lawsuit against Cuentas, Inc. (OTCQB: CUEN), f/k/a Next Group Holdings, Inc/Meimoun & Mammon, LLC/Next Mobile, LLC in the 11th circuit court of Miami-Dade County, Florida. Case number: 2018-032974-CA-01 is still ongoing. The case was filed due to CUEN failing to perform on a contract signed in July, 2015. The company is suing for damages and the return of the funds paid for the undelivered Mobile Virtual Network Operator (MVNO) platform.\nDuring the month of February 2019, the Company issued 250,000,000 shares to Mr. Roland H Malo as part of the compensation he received for staying on with Advanced Satellite Systems, Inc.\nDuring the month of February 2019, the Company converted a total of $16,900 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 338,000,000 shares of restricted common stock.\nDuring the month of March 2019, the Company converted a total of $18,500 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 370,000,000 shares of restricted common stock.\nDuring the month of April 2019, the Company converted a total of $15,000 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 300,000,000 shares of restricted common stock.\nDuring the month of December 2020, the Company converted a total of $3,900 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 93,000,000 shares of common stock.\nDuring the month of January 2021, the Company converted a total of $51,388 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors into 599,867,533 shares of common stock.\nTelco Cuba, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended November 30, 2016 and 2015\nDuring the month of January 2021, the Company converted the partial monetary value of a consultants contract into 441,977,932 restricted common shares.\nDuring the month of February 2021, the Company converted the partial monetary value of a consultants contract into 34,000,000 restricted common shares.\nDuring the month of February 2021, a shareholder converted 55,555 Series A shares into 55,555,000 restricted common shares. These common shares have an effective date of February 11, 2021.\nDuring the month of February 2021, the Company converted a total of $49,259 in convertible debt and accrued interest owed to unaffiliated third-party accredited investors in 164,198,867 shares of common stock.\nDuring the month of March 2021, 23,574,570 restricted common shares were issued to appointed members of the board of directors.\nDuring the month of March 2021, preferred B shareholders converted 6,000 preferred shares into 30,000,000 restricted common shares.\nDuring the month of March 2021, the Company converted a total of $7,000 in convertible debt to an unaffiliated third-party accredited investor into 46,666,667 shares of common stock.\nDuring the month of April 2021, the company converted a total of $62,966 in convertible debt and accrued interest owed to an unaffiliated third-party accredited investor into 155,471,605 shares of common stock.\nDuring the month of May 2021, the company restated a promissory note as convertible in the amount of $100,000. The holder, an unaffiliated third-party unaccredited investor converted the note principle and accrued interest owed into 400,000,000 restricted common shares. These common shares have an effective date of May 6, 2021.\nDuring the month of May 2021, the company converted a total of $54,934 in convertible debt and accrued interest owed to an unaffiliated third-party accredited investor into 73,246,253 shares of common stock. These common shares have an effective date of May 6, 2021.\nDuring the month of May 2021, a third-party accredited investor/noteholder cancelled and returned 155,471,605 common shares to the company due to a reversal of a third party note purchase.\nDuring the month of May 2021, 25,000,000 restricted common shares were issued to appointed members of the board of directors.\nDuring the month of May 2021, the company converted a total of $52,021.00 in convertible debt and accrued interest owed to an unaffiliated third-party accredited investor into 115,602,222 shares of common stock.\nDuring the month of May 2021, the company sold 40,000,000 shares of restricted common stock to an unaffiliated third-party accredited investor for $10,000. These common shares have an effective date of May 26, 2021.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned; thereunto duly authorized.\nTelco Cuba, Inc.\nDate: November 1, By: /s/ William Sanchez\nWilliam Sanchez, Chief Executive Officer\nDate: November 1, By: /s/ William Sanchez\nWilliam Sanchez, Chief Financial Officer, Secretary, and Treasurer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of Registrant and in the capacities indicated on the dates indicated.\nDate\nSignature\nTitle\nDate: November 1, 2022\n/s/ William J Sanchez\nDirector, President, Chief Financial Officer, Secretary, and Treasurer\nWilliam J Sanchez\nDate: November 1,\n/s/ Camille Whiddon\nDirector\nCamille Whiddon\nDate: November 1,\n/s/ Sayis Tequia\nDirector\nSayis Tequia\nDate: November 1,\n/s/ Santiago Munoz\nDirector\nSantiago Munoz\nDate: November 1,\n/s/Francis Flinn\nDirector\nFrancis Flinn\nDate: November 1,\n/s/Patrick Wall\nDirector\nPatrick Wall"
}