{
    "cik": "1429393",
    "company": "Trutankless, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-11-15",
    "period_of_report": "2022-12-31",
    "sic": "3630",
    "state_of_inc": "NV",
    "state_location": "AZ",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1429393/0001477932-23-008489-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1429393/000147793223008489/tkls_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1429393/0001477932-23-008489.txt",
    "filename": "1429393_10K_2022_0001477932-23-008489.htm",
    "content": "ITEM 1. BUSINESS\nTrutankless, Inc. was incorporated in the state of Nevada on March 7, 2008. The Company is headquartered in Scottsdale, Arizona and currently operates through its wholly owned subsidiary, Bollente, Inc., a Nevada corporation incorporated on December 3, 2009.\nTrutankless is involved in research and development, sales, marketing, of a high quality, whole-house, smart electric tankless water heater that is more energy efficient than conventional products. Management anticipates the Companys second generation of Trutankless water heaters, with Wi-Fi, Bluetooth, and Zigbee capability. Trutankless proprietary app is expected to launch into the iOS and Android store and will augment other products in the home automation space, including companys leak detection and prevention devices which were in development in the companys wholly owned subsidiary, Notation Labs, Inc. which was founded in 2020 and subsequently spun-off as of January 24, 2022 to shareholders of record December 10, 2021.\nOverview of Potential Markets and Summary of Marketing Plan\nManagement intends to focus on the United States residential market initially. For decades Americans have used only tank type water heaters, however the market is increasingly towards alternatives like tankless water heaters. Many brands are powered by natural gas, while several others use electricity. Almost half of American homes do not have natural gas available and there has been a trend in many markets towards renewable and cleaner energy alternatives to provide the energy to operate water heaters for the residential and commercial markets in North America.\nThe companys focus markets favor electric water heaters, of which electric tankless have additional benefits over gas powered models because they can be installed almost anywhere in a home (closets, attics, utility rooms, etc.) where hot water is needed. The lack of exhaust, noise, and a need for combustible fuel improves flexibility of floor plan design for builders, architects, and remodelers. In addition, gas tankless water heaters may not be suitable for many applications due to challenges with adequate fuel supply, the need for exhaust vents with specific safety and regulatory requirements. Despite these issues, gas tankless water heaters have historically enjoyed significant growth in North America because of the efficiency and performance they provide.\nThe company will continue to focus its efforts on developing products that satisfy growing demand in the electric tankless market. Additionally, the company hopes to launch additional products well suited to its key customers in the repair and replacement wholesale market, as well as home builders and companies associated with new construction in the multifamily and commercial markets.\nHome Automation Overview\nKey trends in the home automation space, which is estimated to reach $46.22 Billion worldwide by 2025, have been driven by consumers desire for efficiency and lifestyle improvements. Companies like Nest have helped to introduce the Internet of Things to appliances with a direct impact on how users interact with traditional household appliances and have the ability to reduce energy usage. The trend towards integration with voice assistants is also on the rise with key industry leaders like Alexa and Google Assistant playing larger roles in the home automation industry. Insurance and utility companies have joined this trend by partnering with home automation manufacturers by leveraging different devices to build insurance products including discounts and rebates. While home security and safety monitoring are expected to continue to dominate the overall market, management anticipates energy management and HVAC controls and monitors will be one of the fastest growing markets in the U.S. which accounts for 36% of global demand.\nTrutankless was designed to replace inefficient tank water heating technology, which is second to HVAC in energy consumption for most homes. Combined with Wi-Fi capabilities, the system could not only save energy it has the ability to inform users and property owners of energy use, water use, and potential issues like leaks or other failures in the plumbing system. Management plans to roll out additional technologies in the future that can integrate with the Companys trutankless smart apps. Currently, the product has the ability to notify homeowners in the event of water flow while the system is set in away mode. Leak detection, leak damage mitigation, and hot water recirculation for instant hot water at the point of use are becoming major trends in the home automation space. Management believes new products can be introduced into its growing wholesale network to augment trutankless momentum and harness growing trends to a fresh audience of plumbing and other home service professionals.\nHomebuilders and plumbing companies have begun selling homes with more technology integrations. The company expects to gain market share based on its ability to offer tech forward products in the wholesale market which supplies plumbing, HVAC, and electrical service companies in the future.\nTankless Industry Overview\nThe U.S. gas tankless water heater market is dominated by several brands; U.S. electric tankless water heater market is dominated by a few smaller companies, and tank manufacturers maintain the largest market share. Several Japanese and European manufacturers have begun marketing products in the United States, and since 2003, gas tankless products have experienced dramatic growth. Electric tankless systems have not experienced comparable growth due to several factors, primarily product performance, capacity, product quality and electrical power supply and installation issues.\nManufacturers of tank heaters have a competitive advantage due largely to their product categories long established use, name recognition, established distribution, and brand position in the marketplace. Many plumbers and other building industry professionals were opposed to changing brands or to tankless systems because many tankless water heaters have been poorly designed in the past. As a result, there is a perception among some contractors that these water heaters are more complicated and generally less dependable than traditional tank heaters. This perception is often passed along to consumers when making buying decisions or inquiring about switching to a tankless water heater.\nWhile we believe that our products will have superior performance, such as endless hot water, superior longevity, greater efficiency and lower life cycle costs than traditional tank water heaters, the Companys success will depend to a large degree on the successful conversion of traditional water heater buyers to tankless water heater buyers. The acquisition price of tankless water heaters (both gas and electric) is greater than traditional tank water heaters, but the overall cost of ownership will be less than that of traditional tank technologies under typical circumstances. Although the publics awareness of tankless systems has grown in recent years, and continued growth in the sector is suggestive of increasing awareness of tankless as a viable solution for American homeowners.\nOur marketing and promotion plans have been developed to increase the awareness of the Companys brand as the preferred option to traditional tank systems. Trutankless intends to position itself and its brand to capitalize on the shift to more sustainable construction materials and more efficient systems and appliances.\nTrutankless® Products\nWe manufacture and distribute trutankless® water heaters, a line of new, high-quality, highly efficient electric tankless water heaters are in development. Our trutankless® water heaters have been engineered to outperform and outlast both its tank and tankless predecessors in energy efficiency, output, and durability. It provides endless hot water on demand for a whole household, and it also integrates with home automation systems.\nWe have several features and design innovations which are new to the electric tankless water heater market that we believe will give our products a sustainable competitive advantage over our rivals in the market.\nOur trutankless® water heaters are intended to be available solely through wholesale plumbing distributors, including Ferguson, Hajoca, WinSupply, Morrison Supply locations, and several regional distributors. A partial listing of wholesalers may be found on our website (www.trutankless.com).\nOur trutankless® water heaters were designed to provide an endless hot water supply because they are designed to heat water as it flows through the system. We believe that our products are capable of higher temperature rise than competitive units at given flow rates because of its improved design and greater efficiency. Our trutankless® water heaters can save energy and reduce operating costs compared to tank systems because unlike tanks, if there is no hot water demand, no energy is being used. In addition, we intend to improve life-cycle costs with an improved design conceived not only to increase efficiency, but also the longevity of our products versus competitive units. Generally, a typical tank water heater lasts about 9 years, whereas gas tankless systems may last longer, but requires more routine maintenance. Our product line is designed to last longer than tank water heaters without any routine maintenance required under most conditions.\nWe created a custom heat exchanger for our trutankless® product line that utilizes our patented technology to heat water as it flows through the system, which means customers need not worry about running out of hot water. We believe weve selected the best materials available and a collection of exclusive design elements and features to maximize capacity, minimize energy use, and provide a truly maintenance free experience.\nOur trutankless® water heaters were officially launched in the first quarter of 2014 and is sold throughout the wholesale plumbing distribution channel. We began generating revenue in the first quarter of 2014. As of the fiscal year ended December 31, 2014, we generated $238,912 in revenue. As of the fiscal year ended December 31, 2015, we generated $265,504 in revenue. As of the fiscal year ended December 31, 2016, we generated $429,582 in revenue. As of the fiscal year ended December 31, 2017, we generated $695,857 in revenue. As of the fiscal year ended December 31, 2018, we generated $1,537,958 in revenue. As of the fiscal year ended December 31, 2019, we generated $1,908,708. As of December 31, 2020, we generated $1,661,278. As of December 31, 2020, we generated $1,661,278. As of December 31, 2021, we generated $246,032. As of December 31, 2022, we generated $73,009 in revenue.\nIn July of 2014, we launched a customizable online control panel for our trutankless® line of smart electric water heaters. From the dashboard, residential and commercial users can obtain real-time status reports, adjust unit temperature settings, view up to three years of water usage data, and change notification settings from anywhere in the world, using a computer or web-enabled smart device at home.trutankless.com.\nOur primary markets, Florida, Texas, Arizona, and the rest of the Sunbelt region are centers of growth in the U.S. construction industry with green building at an all-time high, and an unprecedented appliance replacement cycle. We intend to take advantage of these powerful macro-economic trends.\nIndustry Recognition and Awards\nTrutankless® received the Best of IBS 2014 Award for Best Home Technology Product from the National Association of Home Builders (NAHB) at that years International Builders Show (IBS) in Las Vegas. The IBS is produced by NAHB and is the largest annual light construction show in the world - featuring more than 1,100 exhibitors and attracting 75,000 attendees including high level decision makers from some of the largest homebuilders in the world as well as plumbing and HVAC professionals from top companies in major markets.\nTrutankless® received the Governors Award of Merit for Energy and Technology Innovation for the trutankless line of electric tankless heaters at Arizona Forwards 2014 Environmental Excellence Awards.\nTrutankless® received Kitchen and Bath Business Magazines 2014 K*BB Product Innovators Award Judges Choice Product.\nIn 2015, Trutankless was named in Buildings Magazines 2015 listing of Money Savings Products in the Energy Saving Measures category and received a Special Mention in the Architizer A+ Awards.\nThat same year, Appliance Design Magazine named Trutankless among the winners of their annual Excellence in Design Award, and the editors of Green Builder Magazine named Trutankless as one of their picks as Hot Product.\nConsumer Reports Magazine featured Trutankless in its Top 5 Remodeling Trends for 2016, and leading home improvement website, houzz.com, honored the company with 4 consecutive Best of Houzz honors from 2014 through 2018.\nCustomers and Markets\nWe sell our products to plumbing wholesale distributors and dealers. Approximately, 95% of our sales have been to wholesale plumbing equipment distributors for commercial and residential repair and replace applications. We rely on commissioned manufacturers representatives to market our product lines. Additionally, our products are sold to independent dealers throughout the United States.\nManufacturing and Logistics\nWe have engineering agreements with outside development and production engineers, which is ongoing and currently being executed. In December 2020, we executed a second Manufacturing Services Agreement establishing our pricing and payment terms, warranty, shipping, and delivery terms with a North American manufacturer. Finished products are generally shipped Free on Board (FOB) and are typically shipped using common carriers or freight companies which are selected at the time of shipment based on order volume and the best available rates.\nIntellectual Property & Proprietary Rights\nWe regard substantial elements of our brands and underlying intellectual property as proprietary and attempt to protect them by relying on trademark, service mark and trade secret laws, restrictions on disclosure and transferring title and other methods.\nOur plans are to actively pursue patent and trademark protection for all newly developed products, both domestically and abroad. We have novel and proprietary technologies related to our product line and the central focus of our patent counsel has been successfully building a defensible set of patent claims which have been granted.\nTo date, we have filed and received a United States federal trademark registration for trutankless® and our logo design with the help of our outside marketing and branding experts and have acquired several unique domain registrations reflective of our online marketing strategy (www.Trutankless.com).\nDuring the year ended December 31, 2013, our patent agent filed a provisional patent with the US Patent and Trademark Office with the US Patent and Trademark Office with 37 claims based on our prototype design. Upon completion of our engineered prototype, we filed additional patents with additional claims. We have been able to obtain a formal patent for our tankless water heater with a total of 34 individual and dependent claims.\nDuring the year ended December 31, 2021, our patent counsel filed a provisional patent application with the US Patent and Trademark Office and the patent was granted with 14 claims based on our proprietary flowmeter design. We will continue to protect our intellectual property through confidentiality agreements with vendors and consultants and trade secret protocols employed by employees, consultants, and contractors.\nDuring the year ended December 31, 2022, our patent counsel collaborated with our engineering team to augment our research and development efforts related to future products which yielded positive results. By affirming our development path and product road map, we expect to file several new patents for novel technologies which we expect to launch in the future, including next generation electric tankless technologies along which will be designed to work with technologies that are able to employ artificial intelligence to help reduce water and energy consumption. We expect to receive additional benefits from our technology and data collection with cloud-based software as a service and apps which may be adapted for use by insurance companies, utilities, and municipalities.\nGrowth Strategy\nTrutankless product launched in the first quarter of 2014 and was sold through the wholesale plumbing distribution channel. Gas tankless manufacturers support of this sales channel was critical in their ability to quickly capture appreciable market share in the replacement market estimated to be larger than $4 Billion nationwide. To our knowledge, no electric tankless has been available solely through wholesale distributors which welcomed the arrival of Trutankless. Trutankless sales and service training programs geared towards plumbers and contractors are the primary focal point of the Companys sales strategy to quickly scale sales and educate distributors, plumbers, builders, and contractors.\nThe Company has also leveraged online marketing strategies and social media. By presenting an immersive and educational web experience at www.trutankless.com Trutankless intends to continue building brand awareness among consumers efficiently online. Launch efforts are expected to be focused in Arizona, Texas, and the Southeast at first, which account for over 1,000,000 electric water heater shipments annually. Licensing and co-branding opportunities may be assessed, since strategic partnerships would eliminate the channel conflicts that have historically obstructed previous electric tankless entries in the marketplace.\nIn addition, we have determined that as part of our growth strategy, we will seek to partner with or acquire entities operating in various fields, with a bias towards green and clean-tech sectors. Our management has experience in marketing, product launches, business development strategies, and certain other areas specific to the success of growth companies. We will operate with a view towards identifying acquisition candidates as we seek the rights to provide the market with products and services geared toward environmental responsibility, innovative technology in the plumbing industry, and home automation technology.\nMargin Expansion\nCost reduction measures, including outsourcing of key components and certain quality control testing protocols, will be undertaken on an expedited basis to rapidly reduce costs and improve manufacturing scalability. Such reductions are expected to take place in stages over the next several quarters, and we believe may result in gross sales margins approaching 50% or more.\nMarket Outlook\nTrutankless entered the market in front of the largest water heater replacement cycle ever at a time when homeowners were seeking ways to reduce their carbon footprint without sacrificing comfort. Many of the heaters which were replaced at that time will need to be replaced, echoing the prior cycle. Statistics have shown a trend towards electric water heating in many markets as part of a trend known as electrification. This trend is part of a shift, which some municipalities are making mandatory, away from natural gas and other fossil fuels to sustainable energy sources, namely solar generated electricity among others which we expect to continue their proliferation throughout North America.\nFlorida, Texas, and Arizona, and areas where electric water heaters dominate the market, have been epicenters of the residential new construction strength in the US. In the new construction market, builders are increasingly marketing green features and trutankless fit well along with other energy saving innovations. In commercial markets, we feel that our commercial line of trutankless products is well suited to thousands of customers in the retail, quick serve and fast casual restaurants, hair salons, and other businesses with moderate hot water use required. In addition to residential new construction and replacement markets, we feel the commercial applications for which our products are appropriate represent a large portion of the commercial water heater market.\nIn April 2015, the Federal Government mandated that standard electric water heaters over 55 gallons may not be sold (started effectively forcing the market to use alternative technologies like tankless water heaters. The electrification of the overall appliance market has also begun due to the rapid progression of energy generation technologies with more efficient and renewable energy sources seen as a growing and sustainable trend.\nRecent Developments\nOn March 4, 2021, we announced that the Company completed the buildout of a new production laboratory and R&D facility in Scottsdale, Arizona with state of the art research and testing systems for the development of new products.\nOn September 24, 2021, the Company announced a 1-for-8 reverse stock split of the issued and outstanding common stock (the Common Stock) which became effective September 27, 2021.\nOn November 4, 2021, we announced the plan to spinoff Notation Labs, Inc., a wholly owned subsidiary of Trutankless, Inc. with each holder of common stock as of the distributions date, receiving shares on a 4-to1 ratio, such that every four shares of the Companys common stock would receive one share of the common stock of Notation Labs, Inc.\nOn November 24, 2021, the Board of Directors se the record and distribution dates for the spinoff of Notation Labs, Inc. to shareholders of record December 10, 2021.\nOn January 21, 2021, the Company received notification from FINRA that it had received the documentation required to complete the spinoff and on January 24, 2022, the Companys transfer agent distributed common shares of Notation Lab, Inc. to Company shareholders of record as an equity dividend distribution.\nOn June 15, 2022, we announced that the Company had been granted its first patent related to our next generation of products, specifically related to a High-Accuracy Response-Curved Flowmeter (U.S. Serial No. 17/592,993) filed on February 5th, 2022, from the U.S. Patent and Trademark Office (USPTO).\nOn August 11, 2022, we relayed information about recent events related to trading the Companys common shares and announced that the Company had recently secured financing to help sustain its product and technology development and ongoing business operations.\nOn April 14, 2023, we announced a key product development milestone had been reached with entry into the engineering verification testing phase in the development of its second generation product.\nOn May 11, 2023, the Company release further information relating to its next generation electric tankless, indicating improved performance over prior models with a completely reinvented mobile app. Further, the Company had engaged sales and marketing consultants with experience building integrated sales systems using the latest technology to incorporate lead generation, sales processes, tracking and forecasting with a proprietary app.\nOn July 15, 2023, we announced the Companys intention to spin-off its wholly-owned subsidiary, Tankless365, Inc. whereby each shareholder having common stock as of the distribution date will be entitled to receive shares of the common stock of Tankless365, Inc. pro rata based on a 4:1 ratio. The press release was attached as an exhibit to the Companys 8-K filed with the SEC on July 19, 2023.\nOn August 28, 2023 the Company filed a PRE 14C Preliminary Information Statement with the SEC, as amended in a PRER14C filed on August 30, 2023, to disclose the terms of the spinoff transaction announced in the July 15, 2023 press release and subsequent 8-K report.\nOn September 12, 2023, the Company filed its DEF 14C Definitive Information Statement which was mailed to the Companys shareholders of record with further disclosures giving notice to shareholder futher describing the corporate actions including the terms of the spinoff and a name change authorized by the Companys Board of Directors.\nTarget Markets\nThe United States market for residential tank water heaters in 2022 was approximately 8.7 million units according to data released by the Air-Conditioning, Heating, and Refrigeration Institute (AHRI). 52.5% of those shipments were electric storage water heater heaters, representing a 2.9% gain in market share versus gas storage water heaters in the prior year. We feel this is a good indicator that there is growing demand for electric solutions in the water heater market, which we expect will impact future sales for the Companys electric tankless water heaters.\nTrutankless is initially marketing its products to contractors, home builders, remodelers, and distributors in the southern and western U.S. These areas of the country have been selected because of generally higher ground water temperatures, which improves the effects of the performance and capacity of all brands of tankless water heaters. This area of the country also traditionally has the largest share of population growth and new housing starts, accounting for almost two-thirds of all housing starts in 2019, according to recent data. Additionally, the southern U.S., and specifically the southeastern U.S., has the highest usage of electric water heaters.\nDistribution Plan\nInitially, we will be distributing our primary product lines throughout the southern and western U.S. using an existing network of plumbing and electrical wholesalers (distributors), manufacturers representatives and dealers. We believe that we will continue to build on existing relationships with major companies in the building and plumbing industries to rapidly expand awareness of Trutankless and our products in the water heater market in the U.S and Canada.\nSales will continue to be pursued through the following channels:\n1.\nRegional and national plumbing, HVAC, and electrical wholesalers (also called distributors);\n2.\nPlumbers and electricians on a direct basis, in those areas where wholesalers have not yet been set up; and,\n3.\nBuilders on a direct basis, in those areas where wholesalers & mechanical contractors have not yet been set up.\nWe intend to market to industry professionals and end-users through more traditional marketing efforts as well, including print advertising, attendance of select national trade shows, and attendance of select regional consumer shows. We also expect Trutankless will be successful in providing education, training, and support to our sales and installer networks as part of our distribution and marketing efforts.\nWe believe our products will be a differentiating factor for industry professionals and builders as they market to their customers. Additionally, our electric tankless products are expected to provide these professionals and their companies with a mechanism to increase revenue and improve gross margin as compared to more traditional water heating products.\nEmployees\nWe currently have four employees, including our CEO and part-time employees. We expect to increase the number of employees to expand our sales and technical staff. We will continue to rely on independent consultants and contractors to perform various professional services. We believe that this use of third-party service providers may enhance our ability to contain operating, general expenses and capital costs.\nAvailable Information\nOur periodic reports filed with the SEC, which include Form 10-K, Form 10-Q, Form 8-K and amendments thereto, may be accessed by the public free of charge from the SEC. Electronic copies of these reports can be accessed at the SECs website (http://www.sec.gov). Copies of these reports may also be obtained, free of charge, upon written request to: Trutankless Inc., 15900 North 78th Street, Suite 200, Scottsdale, Arizona 85260, Attn: Corporate Secretary. The public may read or obtain copies of these reports from the SEC at the SECs Public Reference Room at 450 Fifth N.W., Washington, D.C. 20549 (1-800-SEC-0330). ITEM 1A. RISK FACTORS\nIf we are unable to attract and retain key personnel, our business could be harmed.\nIf any of our key employees were to leave, we could face substantial difficulty in hiring qualified successors and could experience a loss in productivity while any successor obtains the necessary training and experience. Our employment relationships are generally at-will. We cannot assure that one or more key employees will not leave in the future. We intend to continue to hire additional highly qualified personnel, but may not be able to attract, assimilate or retain qualified personnel in the future. Any failure to attract, integrate, motivate and retain these employees could harm our business.\nWe are subject to significant competition from large, well-funded companies.\nThe industry we compete in is characterized by intense competition and rapid and significant technological advancements. Many companies are working in a number of areas similar to our primary field of interest to develop new products; some of which may be similar and/or competitive to our products.\nMost of the companies with which we compete have substantially greater financial, technical, manufacturing, marketing, sales and distribution and other resources than us. If a competitor enters the tankless water heater industry and establishes a greater market share in the direct-selling channel, our business and operating results will be adversely affected.\nThere is substantial doubt about our ability to continue as a going concern. If we do not continue as a going concern, investors will lose their entire investment.\nOur financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. The ability of the Company to continue as a going concern is dependent upon our ability to raise additional capital from the sale of common stock and, ultimately, the achievement of significant operating revenues within one year of the date the financial statements are issued. If we are unable to continue as a going concern, stockholders will lose their investment. We will be required to seek additional capital to fund future growth and expansion. No assurance can be given that such financing will be available or, if available, that it will be on commercially favorable terms. Moreover, favorable financing may be dilutive to investors.\nThe outbreak of the recent coronavirus, COVID-19, or an outbreak of another highly infectious or contagious disease, could adversely affect our business, financial condition, results of operations and cash flow, and limit our ability to obtain additional financing.\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and financial markets of many countries, including the geographical area in which the Company plans to operate.\nWe will require additional financing in order to implement our business plan. In the event we are unable to acquire additional financing, we may not be able to implement our business plan resulting in a loss of revenues and ultimately the loss of your investment.\nDue to our very recent start-up nature, we will have to incur the costs of product development, import expenses, advertising, in addition to hiring new employees and commencing additional marketing activities for product sales and distribution. To fully implement our business plan we will require substantial additional funding.\nWe will need to raise additional funds to expand our operations. We plan to raise additional funds through private placements, registered offerings, debt financing or other sources to maintain and expand our operations. Adequate funds for this purpose on terms favorable to us may not be available, and if available, on terms significantly more adverse to us than are manageable. Without new funding, we may be only partially successful or completely unsuccessful in implementing our business plan, and our stockholders may lose part or all of their investment.\nOur internal controls may be inadequate, which could cause our financial reporting to be unreliable and lead to misinformation being disseminated to the public.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. As defined in Exchange Act Rule 13a-15(f), internal control over financial reporting is a process designed by, or under the supervision of, the principal executive and principal financial officer and effected by the board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that: (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n(ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company, and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nWe have two individuals performing the functions of all officers and directors. Mr. Stebbins, our president and CEO, and Mr. Orr, our secretary and treasurer, have developed our internal control procedures and are responsible for monitoring and ensuring compliance with those procedures. As a result, our internal controls may be inadequate or ineffective, which could cause our financial reporting to be unreliable and lead to misinformation being disseminated to the public. Investors relying upon this misinformation may make an uninformed investment decision.\nWe depend on certain key employees, and believe the loss of any of them would have a material adverse effect on our business.\nWe will be dependent on the continued services of our management team, as well as our outside consultants. While we have no assurance that our current management will produce successful operations, the loss of such personnel could have an adverse effect on meeting our production and financial performance objectives. We have no assurance that we will not lose the services of these or other key personnel and may not be able to timely replace any personnel if we do lose their services.\nOur ability to attract qualified sales and marketing personnel is critical to our future success, and any inability to attract such personnel could harm our business.\nOur future success may also depend on our ability to attract and retain additional qualified design and sales and marketing personnel. We face competition for these individuals and may not be able to attract or retain these employees, which could have a material adverse effect on our results of operations and financial condition.\nRISKS RELATED TO OUR INTELLECTUAL PROPERTY AND TECHNOLOGY\nIf we fail to secure or protect our intellectual property rights, our products and competitors may be able to use our designs, each of which could harm our reputation, reduce our revenues and increase our costs.\nWe will rely on intellectual property laws to protect our proprietary rights with respect to our trademarks and pending patent. We are susceptible to injury from patent infringement, which may harm our reputation for producing high-quality products or force us to incur additional expense in enforcing our rights. It is difficult and expensive to detect and prevent patent infringement. Despite our efforts to protect our intellectual property, some may attempt to violate our intellectual property rights by using our trademarks and imitating our products, which could potentially harm our brand, reputation and financial condition.\nWe may face significant expenses and liability in connection with the protection of our intellectual property rights. Infringement claims and lawsuits likely would be expensive to resolve and would require substantial management time and resources. Any adverse determination in litigation could subject us to the loss of our rights to a particular trademark, which could prevent us from manufacturing, selling or using certain aspects of our products or could subject us to substantial liability, any of which would harm our results of operations. Aside from infringement claims against us, if we fail to secure or protect our intellectual property rights, our competitors may be able to use our designs. If we are unable to successfully protect our intellectual property rights or resolve any conflicts, our results of operations may be harmed.\nOur reliance on intellectual property and other proprietary information subjects us to the risk that these key ingredients of our business could be copied by competitors.\nOur success depends, in significant part, on the proprietary nature of our technology. If a competitor is able to reproduce or otherwise capitalize on our technology, despite the safeguards we have in place, it may be difficult, expensive or impossible for us to obtain necessary legal protection. In addition to patent protection of intellectual property rights, we consider elements of our product designs and processes to be proprietary and confidential. We rely upon employee, consultant and vendor non-disclosure agreements and contractual provisions and a system of internal safeguards to protect our proprietary information. However, any of our registered or unregistered intellectual property rights may be challenged or exploited by others in the industry, which might harm our operating results.\nRISKS RELATING TO OUR COMMON STOCK\nBecause our common stock could remain under $4.00 per share, it could continue to be deemed a low-priced Penny stock, an investment in our common stock should be considered high risk and subject to marketability restrictions.\nSince our common stock is currently under $4.00 per share, it is considered a penny stock, as defined in Rule 3a51-1 under the Securities Exchange Act, it will be more difficult for investors to liquidate their investment even if and when a market develops for the common stock. If the trading price of the common stock stays below $5.00 per share, trading in the common stock is subject to the penny stock rules of the Securities Exchange Act specified in rules 15g-1 through 15g-10. Those rules require broker-dealers, before effecting transactions in any penny stock, to:\n·\nDeliver to the customer, and obtain a written receipt for, a disclosure document;\n·\nDisclose certain price information about the stock;\n·\nDisclose the amount of compensation received by the broker-dealer or any associated person of the broker-dealer;\n·\nSend monthly statements to customers with market and price information about the penny stock; and\n·\nIn some circumstances, approve the purchasers account under certain standards and deliver written statements to the customer with information specified in the rules.\nConsequently, the penny stock rules may restrict the ability or willingness of broker-dealers to accept the common stock for deposit into an account or, if accepted for deposit, to sell the common stock and these restrictions may affect the ability of holders to sell their common stock in the secondary market and the price at which such holders can sell any such securities. These additional procedures could also limit our ability to raise additional capital in the future.\nFINRA sales practice requirements may also limit a stockholders ability to buy and sell our stock.\nIn addition to the penny stock rules described above, the Financial Industry Regulatory Authority (FINRA) has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nRule 15c2-11 as amended, effective on September 28, 2021, may also limit a stockholders ability to buy and sell our stock.\nOur common stock currently trades on the Expert Market Tier of OTC Markets Group, Inc. under the symbol TKLS and is labeled as Delinquent SEC Reporting. The OTC Market is a network of security dealers who buy and sell stock. The dealers are connected by a computer network that provides information on current bids and asks, as well as volume information. Stock on the Expert Market is not eligible for proprietary broker-dealer quotations. All quotes in stock on the Expert Market reflect unsolicited customer orders. Unsolicited-Only stocks, such as ours, have a higher risk of wider spreads between bid and asked quotations, increased volatility, and price dislocations. Investors may have difficulty selling our stock. An initial review by a broker-dealer under SEC Rule15c2-11 is required for brokers to publish competing quotes and provide continuous market making in our stock. The Expert Market serves broker-dealer pricing and investor best execution needs. Quotations in Expert Market securities are restricted from public viewing. OTC Markets Group designates securities for quoting on the Expert Market when the issuer has not disclosed its financial information for a period of slightly in excess of six months or is otherwise not making current information publicly available under SEC Rule 15c2-11, or when the security is otherwise restricted from public quoting. The common stock previously traded on the Pink Tier of OTC Markets Group, Inc. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nDuring the period ended December 31, 2022 we maintained an executive office 14646 N. Kierland Blvd, Suite 270, Scottsdale, Arizona 85254, which consists of approximately 2,488 square feet. We currently maintain a research, development, and test lab with office space 15953 N. Greenway Hayden Loop, Suite J, Scottsdale Arizona 85260, which consists of approximately 1,680 square feet. ITEM 3. LEGAL PROCEEDINGS\nItem 1. Legal Proceedings.\nFrom time to time, we may become involved in various lawsuits and legal proceedings which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business.\nOn July 6, 2020, we received a letter from the staff of the Division of Enforcement of the Securities and Exchange Commission (the Staff) that indicated the Company may have violated certain rules and regulations regarding a late filing notification filed by the Company and that the Staff would conduct an informal inquiry into the matter. On April 29, 2021, the Company agreed to pay civil penalties of $25,000 to the Securities and Exchange Commission in settlement of the matter.\nOn September 14th, 2021, a Company subsidiary received a demand for arbitration through the American Arbitration Association pursuant to a manufacturing services agreement with Cypress Holdings Ltd d/b/a Cypress Industries alleging Breach of Contract for non-payment of invoices. The Company believes the claim is without merit and has filed a defense and counter claim. After Cypress Industries failed to cure many Breaches of its manufacturing services agreement, including failure to deliver a single Trutankless unit, the Company cancelled its purchase order with Cypress Industries. The Company is seeking substantial relief, including lost profit, due to the Breach of Contract, Fraudulent Inducement, Misrepresentation, Unjust Enrichment, and Negligence of Cypress Industries. The Company subsequently settled this matter on February 28, 2022.\nOn April 6, 2023, the Company was served a Summons for an Amended Complaint filed in the state of Florida with claims for Strict Liability, Negligence and Breach of Implied Warranty. The complaint, filed by an insurance company, stems from its payments for claims filed by a policy holder on two separate occasions. The first insurance claim payment was due to a leak caused by improper installation in which the contractor failed to meet local codes. The second insurance claim payment followed the contractors failure to properly repair the improper installation. The complaint states that the contractor failed to follow basic installation guidelines supplied with the product in either incident, resulting in damages. The Company believes the alleged claims in the suit related to the Company and its products are without merit.\nPART II  ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS AND SMALL BUSINESS ISSUER PURCHASE OF EQUITY SECURITIES\nMarket Information\nFrom February 13, 2009, through approximately August 8, 2022, shares of our common stock traded on the OTC pink tier of the over-the counter market operated by OTC Markets Group, Inc. under the symbol TKLS. On or about August 9, 2022, trading in shares of our common stock was downgraded to the OTC Pink tier of the over-the counter market operated by OTC Markets Group continuing under the symbol TKLS.\nOn September 28, 2021, upon the effective date of amendments to Rule 15c2-11 under the Exchange Act, trading in shares of our common stock became eligible only for unsolicited quotes on the Expert Market of the OTC Markets Group. Quotations in Expert Market securities are restricted from public viewing. This designation by the OTC Markets Group severely limits the number of investors that might purchase shares of our common stock and effectively prevents the development of an active trading market in shares of our common stock. As a result, there currently is no established public trading market for the shares of our common stock.\nOver-the-counter market quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission, and may not necessarily reflect actual transactions.\nEven if upon or subsequent to filing this Form 10-K we are deemed current in filing financial and other information, there can be no assurance as to whether OTC Markets Group will enable shares of our common stock to be quoted on a retail tier or that the shares of our common stock can successfully be traded on other trading platforms.\nHolders of Common Stock\nAs of December 31, 2022 there were approximately 403 stockholders of record of our common stock. This number does not include shares held by brokerage clearing houses, depositories or others in unregistered form.\nDividends\nThe payment of dividends is subject to the discretion of our Board of Directors and will depend, among other things, upon our earnings, our capital requirements, our financial condition, and other relevant factors. We have not paid or declared any dividends upon our common stock since our inception and, by reason of our present financial status and our contemplated financial requirements, do not anticipate paying any dividends upon our common stock in the foreseeable future.\nWe have never declared or paid any cash dividends. We currently do not intend to pay cash dividends in the foreseeable future on the shares of common stock. We intend to reinvest any earnings in the development and expansion of our business. Any cash dividends in the future to common stockholders will be payable when, as and if declared by our Board of Directors, based upon the Boards assessment of:\n·\nour financial condition;\n·\nearnings;\n·\nneed for funds;\n·\ncapital requirements;\n·\nprior claims of preferred stock to the extent issued and outstanding; and\n·\nother factors, including any applicable laws.\nTherefore, there can be no assurance that any dividends on the common stock will ever be paid.\nRecent Sales of Unregistered Securities\nDuring the year ended December 31, 2022 the Company issued 23,750 shares of common stock valued at $5,004 for services. Additionally, the Company agreed to issue 8,840,000 shares of common stock valued at $2,389,010 for services. As of December 31, 2022 the shares had not been issued.\nOn May 1, 2022, the Company issued 75,000 shares of common stock (post-split) valued at $87,000 to extend a certain note payable dated May 1, 2020.\nOn May 2, 2022, the Company issued 12,500 shares of common stock (post-split) valued at $14,500 to extend a certain note payable dated May 2, 2017.\nOn June 1, 2022, the Company agreed to issue 100,000 shares (post-split) valued at $116,000 to extend a certain note payable dated February 2, 2018. As of December 31, 2022 the shares had not yet been issued.\nOn November 30, 2022 the Company agreed to issue 115,973 shares of common stock valued at $27 to extend a certain note payable dated November 12, 2021. As of December 31, 2022 the shares had not been issued.\nOn February 22, 2022 the Company entered into a $385,000, 12% note payable due on February 22, 2023. The note is convertible upon default at the higher of the closing price of the common stock on the closing date, or par value. As an inducement to enter into the agreement the Company also granted the noteholder 165,216 shares of common stock valued at $123,147 (post-split).\nOn December 15, 2022 the Company agreed to issue 90,000 shares of common stock valued at $23 to settle $18,000 of accrued interest owed to a note holder. As of December 31, 2022 the shares had not been issued.\nOn January 24, 2022 the Company completed the spin-off of its subsidiary Notation Labs Inc into a stand-alone publicly traded company. On August 20, 2020 each holder of the common stock received one share of Notation labs, Inc common stock for every four shares of the Companys common stock held at the close of business on December 10, 2021, the record date of the distribution. As a result of the spin-off the Notation Labs financials were deconsolidated from those of the Company and an increase of $391,441 in accumulated deficit was recorded.\nOn August 1, 2022 the Company received and cancelled 126,440 shares of common stock valued at $158,050 that had previously been issued as commitment shares for a note payable.\nWe believe that the issuance and sale of the securities was exempt from the registration and prospectus delivery requirements of the Securities Act of 1933 by virtue of Section 4(2) and Regulation D Rule. The securities were sold directly by us and did not involve a public offering or general solicitation. The recipients of the securities were afforded an opportunity for effective access to files and records of the Registrant that contained the relevant information needed to make their investment decision, including the financial statements and 34 Act reports. We reasonably believed that the recipients, immediately prior to the sale of the securities, were accredited investors and had such knowledge and experience in our financial and business matters that they were capable of evaluating the merits and risks of their investment. The management of the recipients had the opportunity to speak with our management on several occasions prior to their investment decision. There were no commissions paid on the issuance and sale of the securities.\nSubsequent Sales & Issuances of Unregistered Securities\nOn May 3, 2023 the Company issued 84,400 shares of the Companys common stock as an incentive for a certain convertible note dated July 18, 2022.\nOn May 3, 2023 the Company issued 2,200,000 of the Companys common stock for services.\nWe believe that the issuance and sale of the securities was exempt from the registration and prospectus delivery requirements of the Securities Act of 1933 by virtue of Section 4(2) and Regulation D Rule. The securities were sold directly by us and did not involve a public offering or general solicitation. The recipients of the securities were afforded an opportunity for effective access to files and records of the Registrant that contained the relevant information needed to make their investment decision, including the financial statements and 34 Act reports. We reasonably believed that the recipients, immediately prior to the sale of the securities, were accredited investors and had such knowledge and experience in our financial and business matters that they were capable of evaluating the merits and risks of their investment. The management of the recipients had the opportunity to speak with our management on several occasions prior to their investment decision. There were no commissions paid on the issuance and sale of the securities.\nIssuer Purchases of Equity Securities\nThe Company did not repurchase any of its equity securities during the fourth quarter ended December 31, 2020.\nRule 15c2-11 as amended\nAs noted in our risk factors above, effective on September 28, 2021, may limit a stockholders ability to buy and sell our stock. ITEM 6. SELECTED FINANCIAL DATA\nThis item is not applicable, as we are considered a smaller reporting company. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nBackground\nTrutankless Inc. was incorporated in the state of Nevada on March 7, 2008. The Company is headquartered in Scottsdale, Arizona and currently operates through its wholly-owned subsidiary, Bollente, Inc., a Nevada corporation incorporated on December 3, 2009.\nTrutankless is involved in sales, marketing, research and development of a high quality, whole-house, smart electric tankless water heater that is more energy efficient than conventional products. See Item 1. Business.\nRESULTS OF OPERATIONS\nRevenues\nIn the year ended December 31, 2022 we generated $73,009 in revenues, as compared to $246,032 in revenues in the prior year. The decrease in sales was attributable to less sales of our trutankless® residential and light commercial products. Cost of goods sold was $22,522, as compared to $127,669 in the prior year.\nTo the knowledge of management, the Company is unaware of any trends or uncertainties in the sales or costs of our products and services for the periods discussed.\nExpenses\nOperating expenses totaled $4,147,014 during the year ended December 31, 2022 as compared to $11,153,689 in the prior year. In the year ended December 31, 2022, our expenses primarily consisted of General and Administrative of $3,711,863, Research and Development of $246,186 and Professional fees of $188,965.\nGeneral and administrative fees decreased $6,887,306 from the year ended December 31, 2022 to the year ended December 31, 2021. General and administrative fees increased due to a decrease in consulting fees associated with business development.\nResearch and Development increased $35,161 from the year ended December 31, 2022 to the year ended December 31, 2021. Research and Development fees increased due to increased consulting fees associated with the Companys research and development efforts.\nProfessional fees decreased $154,530 from the year ended December 31, 2022 to the year ended December 31, 2021. Professional fees decreased due to an decrease in legal and accounting fees associated with the normal operations of the business.\nOther Expenses\nOther expense decreased $5,452,213 to $523,009 in the year ended December 31, 2022 from $5,975,222 for the year ended December 31, 2021. The decrease was the result of a decrease in interest expense during the year.\nNet Loss\nIn the year ended December 31, 2022, we generated a net loss of $4,646,055, a decrease of $12,733,715 from $17,379,770 for the year ended December 31, 2021. This decrease was attributable to a decrease in stock based consulting payments.\nGoing Concern\nThe financial statements included in this filing have been prepared in conformity with generally accepted accounting principles that contemplate the continuance of the Company as a going concern.\nManagement evaluated all relevant conditions and events that are reasonably known or reasonably knowable, in the aggregate, as of the date the consolidated financial statements are issued and determined that substantial doubt exists about the Companys ability to continue as a going concern. The Companys ability to continue as a going concern is dependent on the Companys ability to generate revenues and raise capital. The Company has not generated sufficient revenues from product sales to provide sufficient cash flows to enable the Company to finance its operations internally. As of December 31, 2022, the Company had $84,034 cash on hand. At December 31, 2022 the Company has an accumulated deficit of $64,627,455. For the year ended December 31, 2022, the Company had a net loss of $4,646,055, and cash used in operations of $1,815,297. These factors raise substantial doubt about the Companys ability to continue as a going concern within one year from the date of filing.\nOver the next twelve months management plans to raise additional capital and to invest its working capital resources in sales and marketing in order to increase distribution and demand for its products. However, there is no guarantee the Company will generate sufficient revenues or raise capital to continue operations. If the Company fails to generate sufficient revenue and obtain additional capital to continue at its expected level of operations, the Company may be forced to scale back or discontinue its sales and marketing efforts. The consolidated financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nLiquidity and Capital Resources\nAt December 31, 2022, we had an accumulated deficit of $64,627,455. and a working capital deficiency of $3,796,695. As of December 31, 2022, we had $84,034 in cash, $7,219 in accounts receivable, and $117,980 in inventory.\nCash Flows from Operating, Investing and Financing Activities\nThe following table provides detailed information about our net cash flow for all financial statement periods presented in this Annual Report. To date, we have financed our operations through the issuance of stock and borrowings.\nThe following table sets forth a summary of our cash flows for the years ended December 31, 2022 and 2021:\nYear ended\nDecember 31,\nNet cash used in operating activities\n$ (1,815,297 )\n$ (2,431,848 )\nNet cash used in investing activities\n-\n(25,298 )\nNet cash provided by financing activities\n1,839,605\n2,365,244\nNet increase/(decrease) in Cash\n24,308\n(91,902 )\nCash, beginning\n59,726\n151,628\nCash, ending\n$ 84,034\n$ 59,726\nOperating activities\nNet cash used in operating activities was $1,815,297 for the year ended December 31, 2022, as compared to $2,431,848 used in operating activities for the same period in 2021. The decrease in net cash used in operating activities was primarily due to the decrease in net loss during the year ended December 31, 2022.\nInvesting activities\nNet cash provided by investing activities for the year ended December 31, 2022 was $0, as compared to $25,298 for the same period of 2021. The decrease of net cash used in investing activities was mainly due to a decrease in fixed asset purchases during the year ended December 31, 2022.\nFinancing activities\nNet cash provided by financing activities for the year ended December 31, 2022 was $1,839,605, as compared to $2,365,244 for the same period of 2021. The increase of net cash provided by financing activities was mainly to increase debt financing during the year ended December 31, 2022.\nOngoing Funding Requirements\nAs of December 31, 2022, we continue to use traditional and/or debt financing to provide the capital we need to run the business. It is possible that we may need additional funding to enable us to fund our operating expenses and capital expenditures requirement s.\nUntil such time, if ever, as we can generate substantial product revenues, we intend to finance our cash needs through a combination of equity offerings, debt financings, collaborations, strategic alliances and licensing arrangements. There can be no assurance that any of those sources of funding will be available when needed on acceptable terms or at all. To the extent that we raise additional capital through the sale of equity or convertible debt securities, the ownership interests of existing stockholders will be diluted, and the terms of these securities may include liquidation or other preferences that adversely affect the rights of existing stockholders. Debt financing, if available, may involve agreements that include covenants limiting or restricting our ability to take specific actions, such as incurring additional debt, making capital expenditures or declaring dividends. If we raise funds through collaborations, strategic alliances or licensing arrangements with third parties, we may have to relinquish valuable rights to our technologies, future revenue streams, research programs or product candidates or to grant licenses on terms that may not be favorable to us.\nIf we are unable to raise additional funds through equity or debt financings or relationships with third parties when needed or on acceptable terms, we may be required to delay, limit, reduce or terminate our product development or future commercialization efforts; abandon our business strategy of growth through acquisitions; or grant rights to develop and market product candidates that we would otherwise prefer to develop and market ourselves.\nCritical Accounting Polices\nIn December 2001, the SEC requested that all registrants list their most critical accounting polices in the Management Discussion and Analysis. The SEC indicated that a critical accounting policy is one which is both important to the portrayal of a companys financial condition and results, and requires managements most difficult, subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain. Our critical accounting policies are disclosed in Note 1 of our audited consolidated financial statements included in the Form 10-K filed with the SEC.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThis item in not applicable as we are currently considered a smaller reporting company. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nSee Index to Financial Statements and Financial Statement Schedules appearing on page 37 of this Form 10-K. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nWe have had no disagreements with our independent auditors on accounting or financial disclosures. ITEM 9A (T) CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur Principal Executive Officer and Principal Financial Officer, Michael Stebbins, has evaluated the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) under the Securities Exchange Act of 1934, as amended) as of the end of the period covered by this Report. Based on his evaluation, Mr. Stebbins concluded that our disclosure controls and procedures are designed at a reasonable assurance level and are effective to provide reasonable assurance that information we are required to disclose in the reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SECs rules and forms, and that such information is accumulated and communicated to our management, including our chief executive officer and principal financial officer, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nManagements Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control, as is defined in the Securities Exchange Act of 1934. These internal controls are designed to provide reasonable assurance that the reported financial information is presented fairly, that disclosures are adequate and that the judgments inherent in the preparation of financial statements are reasonable. There are inherent limitations in the effectiveness of any system of internal controls, including the possibility of human error and overriding of controls. Consequently, an effective internal control system can only provide reasonable, not absolute, assurance with respect to reporting financial information.\nOur internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that in reasonable detail accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements in accordance with generally accepted accounting principles and the receipts and expenditures of company assets are made and in accordance with our management and directors authorization; and (iii) provide reasonable assurance regarding the prevention or timely detection of unauthorized acquisition, use or disposition of assets that could have a material effect on our financial statements.\nManagement has undertaken an assessment of the effectiveness of our internal control over financial reporting based on the framework and criteria established in the Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based upon this evaluation, management concluded that our internal control over financial reporting was not effective as of December 31, 2022.\nOur management identified the following material weaknesses in our internal control over financial reporting, which are indicative of many small companies with limited personnel:\n·\ninadequate controls over maintenance of records\n·\ndeficiencies in the period-end reporting process and accounting policies;\n·\ninadequate internal controls relating to the authorization, recognition, capture, and review of transactions, facts, circumstances, and events that could have a material impact on the Companys financial reporting process\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during our most recent fiscal quarter that have materially affected, or reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nOn May 25, 2021, with an effective date of May 25, 2021, Trutankless filed with the Secretary of State of the State of Nevada, a Certificate of Amendment to the Articles of Incorporation to increase the Companys authorized shares of common stock from 100,000,000 to 150,000,000 shares.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe members of our board of directors serve for one year terms and are elected at the next annual meeting of stockholders, or until their successors have been elected. The officers serve at the pleasure of the board of directors.\nInformation as to our current directors and executive officers is as follows:\nName\nAge\nTitle\nSince\nRobertson James Orr\nSecretary, Treasurer & Director\nMay 12, 2010\nMichael Stebbins\nChief Executive Officer, President and Director\nJune 23, 2016\nDuties, Responsibilities and Experience\nRobertson James Orr, has been our Treasurer, Secretary and a Director since May 12, 2010. Mr. Orr attended Arizona State University. In 1998, Mr. Orr assisted in the founding of bluemedia, Inc., a successful large format digital printing company based in Tempe, Arizona. Mr. Orr has been instrumental in growing bluemedia to be one of the premier companies in its vertical with some of the largest companies, projects and events in their portfolio. Most notably, Mr. Orr has lead bluemedias relationship with the NFL and has successfully overseen the graphics production, installation and removal for the last seven Super Bowls. Other notable clients include the NBA, NHL, MLB, Kansas City Chiefs, Verizon, InBev, GMR Marketing, Petsmart, and Pepsi. In 2005, Mr. Orr and his Partners in bluemedia started a non-traditional ad agency called Blind Society, which is responsible for the direct to consumer marketing efforts of companies like AT&T, K-Swiss, and Activision. In addition to his entrepreneurial successes, Mr. Orr has been involved with supporting numerous local charitable causes through his work with the Boys & Girls Clubs of Phoenix, St. Joseph the Worker, the MDA and the ADA. He has sat on the Board of Directors for the Tempe Chamber of Commerce as well as other entrepreneurial organizations. He is currently on the Board of Directors for Project Sebastian, a rare disease research nonprofit, as well as he sits on the Sports Advisory Board for the Colangelo College of Business at Grand Canyon University.\nMichael Stebbins, has been our Chief Executive Officer since July 29, 2019, President since February 2, 2017 and a Director since June 23, 2016. Mr. Stebbins is also the president and a director of Bollente, Inc., a Nevada corporation and wholly owned subsidiary of the Company. In 2009, Mr. Stebbins assisted in the founding of Bollente, Inc. Mr. Stebbins helped lead the design team that created our trutankless water heater. He oversaw virtually every aspect of launching our trutankless line of water heaters. Working directly with engineering and development teams, he developed several innovations and was instrumental in working on Bollente Inc.s intellectual property and patents consisting of 29 proprietary claims related to our products. Since substantially completing R/D efforts in 2013, Mr. Stebbins has worked with the rest of management to lead branding, marketing, and sales initiatives, which has resulted in substantial sales growth and business development opportunities. Mr. Stebbins experience in the water heater industry dates back to 2003. Prior to co-founding Bollente, Inc., Mr. Stebbins spent time consulting on several product development projects. Mr. Stebbins was named Top 35 Entrepreneurs under 35 by the Arizona Republic.\nIndemnification of Directors and Officers\nOur Articles of Incorporation and Bylaws both provide for the indemnification of our officers and directors to the fullest extent permitted by Nevada law.\nLimitation of Liability of Directors\nPursuant to the Nevada General Corporation Law, our Articles of Incorporation exclude personal liability for our Directors for monetary damages based upon any violation of their fiduciary duties as Directors, except as to liability for any breach of the duty of loyalty, acts or omissions not in good faith or which involve intentional misconduct or a knowing violation of law, or any transaction from which a Director receives an improper personal benefit. This exclusion of liability does not limit any right which a Director may have to be indemnified and does not affect any Directors liability under federal or applicable state securities laws. We have agreed to indemnify our directors against expenses, judgments, and amounts paid in settlement in connection with any claim against a Director if he acted in good faith and in a manner he believed to be in our best interests.\nElection of Directors and Officers\nDirectors are elected to serve until the next annual meeting of stockholders and until their successors have been elected and qualified. Officers are appointed to serve until the meeting of the Board of Directors following the next annual meeting of stockholders and until their successors have been elected and qualified.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934, as amended (the Exchange Act), requires our executive officers and directors, and persons who beneficially own more than ten percent of our common stock, to file initial reports of ownership and reports of changes in ownership with the SEC. Executive officers, directors and greater-than-ten-percent beneficial owners are required by SEC regulations to furnish us with copies of all Section 16(a) forms they file. Based upon a review of the copies of such forms furnished to us and written representations from our executive officers and directors, we believe that as of the date of this filing they were current in their filings.\nCode of Ethics\nA code of ethics relates to written standards that are reasonably designed to deter wrongdoing and to promote:\n1.\nHonest and ethical conduct, including the ethical handling of actual or apparent conflicts of interest between personal and professional relationships;\n2.\nFull, fair, accurate, timely and understandable disclosure in reports and documents that are filed with, or submitted to, the Commission and in other public communications made by an issuer;\n3.\nCompliance with applicable governmental laws, rules and regulations;\n4.\nThe prompt internal reporting of violations of the code to an appropriate person or persons identified in the code; and\n5.\nAccountability for adherence to the code.\nWe have not adopted a corporate code of ethics that applies to our principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions.\nOur decision not to adopt such a code of ethics results from our having a small management for the Company. We believe that the limited interaction which occurs having such a small management structure for the Company eliminates the current need for such a code, in that violations of such a code would be reported to the party generating the violation.\nCorporate Governance\nWe currently do not have standing audit, nominating and compensation committees of the board of directors, or committees performing similar functions. Until formal committees are established, our entire board of directors, perform the same functions as an audit, nominating and compensation committee.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers has, during the past five years:\n·\nbeen convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offences);\n·\nhad any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\n·\nbeen subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n·\nbeen found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n·\nbeen the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n·\nbeen the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member. ITEM 11. EXECUTIVE COMPENSATION\nOverview of Compensation Program\nWe currently have not appointed members to serve on the Compensation Committee of the Board of Directors. Until a formal committee is established, our entire Board of Directors has responsibility for establishing, implementing and continually monitoring adherence with the Companys compensation philosophy. The Board of Directors ensures that the total compensation paid to the executives is fair, reasonable and competitive.\nCompensation Philosophy and Objectives\nThe Board of Directors believes that the most effective executive compensation program is one that is designed to reward the achievement of specific annual, long-term and strategic goals by the Company and that aligns executives interests with those of the stockholders by rewarding performance above established goals, with the ultimate objective of improving stockholder value. As a result of the size of the Company and only having two officers, the Board evaluates both performance and compensation on an informal basis. Upon hiring additional executives, the Board intends to establish a Compensation Committee to evaluate both performance and compensation to ensure that the Company maintains its ability to attract and retain superior employees in key positions and that compensation provided to key employees remains competitive relative to the compensation paid to similarly-situated executives of peer companies. To that end, the Board believes executive compensation packages provided by the Company to its executives, including the named executive officers, should include both cash and stock-based compensation that reward performance as measured against established goals.\nRole of Executive Officers in Compensation Decisions\nThe Board of Directors makes all compensation decisions for, and approves recommendations regarding equity awards to, the executive officers and Directors of the Company. Decisions regarding the non-equity compensation of other employees of the Company are made by management.\nSummary Compensation Table\nThe table below summarizes the total compensation paid to or earned by our current Executive Officers for the fiscal years ended December 31, 2022, 2021 and 2020.\nSUMMARY COMPENSATION TABLE\nName and Principal\nPositions\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-\nEquity\nIncentive\nPlan\nCompen-\nsation\n($)\nNon-qualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompen-\nsation\n($)\nTotal\n($)\nRobertson James Orr(1),\n75,000\n582,000\n657,000\nFormer President, Former CEO,\n75,000\n400,00\n475,000\nSecretary, Treasurer & Director\n11,000\n1,735,198\n1,746,198\nMichael Stebbins(4),\n210,000\n447,010 (5)\n657,010\nPresident & Director\n165,000\n2,352,980\n165,000\n1,951,798\n2,116,798\nTermination of Employment\nThere are no compensatory plans or arrangements, including payments to be received from the Company, with respect to any person which would in any way result in payments to any such person because of his resignation, retirement, or other termination of such persons employment with the Company or its subsidiaries, or any change in control of the Company, or a change in the persons responsibilities following a change in control of the Company, except with respect to a breach of contract on the part of the Company.\nOption Grants in Last Fiscal Year\nDuring the years ended December 31, 2022 and 2021, we did not grant any options to our officers and directors.\nEmployment Agreements\nThe Company has an employment agreement with the President/CEO to perform duties and responsibilities as may be assigned. The base salary is in the amount of $210,000 per annum plus a bonus of 750,000 shares of common stock upon execution of the agreement and an additional 750,000 shares every 90 days thereafter commencing on October 1, 2020 and ending September 30, 2021 with an option renewal on September 15, 2021. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth information, to the best of our knowledge, about the beneficial ownership of our common stock on October 6, 2023 relating to the beneficial ownership of our common stock by those persons known to beneficially own more than 5% of our capital stock and by our directors and executive officers. The percentage of beneficial ownership for the following table is based on 83,324,151 shares of common stock outstanding.\nBeneficial ownership is determined in accordance with the rules of the Securities and Exchange Commission and does not necessarily indicate beneficial ownership for any other purpose. Under these rules, beneficial ownership includes those shares of common stock over which the stockholder has sole or shared voting or investment power. It also includes shares of common stock that the stockholder has a right to acquire within 60 days after October 6, 2023, pursuant to options, warrants, conversion privileges or other rights. The percentage ownership of the outstanding common stock, however, is based on the assumption, expressly required by the rules of the Securities and Exchange Commission, that only the person or entity whose ownership is being reported has converted options or warrants into shares of our common stock.\nSecurity Ownership of Management, Directors and Certain Beneficial Owners\nTitle of\nClass\nName of Beneficial Owner\nNumber\nOf Shares\nPercent\nBeneficially\nOwned\nCommon\nRobertson James Orr - Director\n1,765,541\n4.55 %\nCommon\nMichael Stebbins - CEO and President and Director\n3,289,289 (3)\n8.42 %\nCommon\nBuilt Right Holdings, LLC\n8,825,833\n22.76 %\nAll Directors, Officers and Principal Stockholders as a Group\n13,880,663\n35.73 %\n1.\nAs used in this table, beneficial ownership means the sole or shared power to vote, or to direct the voting of, a security, or the sole or shared investment power with respect to Common Stock (i.e., the power to dispose of, or to direct the disposition of, a security).\n2.\nThe address of each Officer and Director is c/o Trutankless, Inc., 15900 North 78th Street, Suite 200, Scottsdale, AZ 85260.\n3.\nOf the total shares of Common Stock owned or controlled by Mr. Stebbins, 43,750 shares are held by White Isle Holdings, Inc., 625 shares are held by Core Financial Companies LLC and 1,000,000 shares are held by Level Point Corp.\n4.\nThese shares are owned directly by Built Right Holdings, LLC, an Arizona limited liability company, and Rodney Cullum may be deemed to have an indirect interest in these securities as the manager of Built Right Holdings, LLC.\nChanges in Control\nThere are no arrangements known to the Company, including any pledge by any person of securities of the Company, the operation of which may at a subsequent date result in a change in control of the Company. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nTransactions with Related Persons\nAccounts payable and accrued liabilities - related party\nDuring the years ended December 31, 2022 and 2021 the Company received $0 and $0 in advances from a related party, respectively. As of December 31, 2022 and 2021 the Company had received advances from a related party of $23,500 and $23,500, respectively.\nNotes payable - related party consist of the following at:\nDecember 31,\nDecember 31,\nNote payable, secured, 5% interest, due May 2022\n$ 19,450\n$ 4,350\nNote payable, secured, 12% interest, due May 2030\n125,500\n110,500\nNote payable, secured, 12% interest, due April 2022\n102,000\n102,000\nTotal Notes Payable - related party\n$ 246,950\n$ 216,850\nLess unamortized debt discounts\n-\n-\nTotal Notes Payable\n246,950\n216,850\nLess current portion\n(121,450 )\n(106,350 )\nTotal Notes Payable - long term\n$ 125,500\n$ 110,500\nDuring the year ending December 31, 2022 the Company received $15,100 under a note payable from a director of the Company. As of December 31, 2022 and 2021, the Company had one note payable due to a director of the Company in the amount of $19,450 and $4,350, respectively. The note has an interest rate of 5% and is due on demand.\nAs of December 31, 2022 and 2021, the Company had one note payable due to an officer of the Company in the amount of $125,500 and $110,500, respectively. The note has an interest rate of 12%and is due on demand.\nOn April 30, 2021, the Company entered into a $150,000, 12% grid note payable with a Company controlled by the CEO that is due upon demand but no later than April 30, 2022. As of December 31, 2022 and 2021, the Company has received advances under the note of $102,000 and $102,000, respectively.\nInterest expense associated with the related party notes for the years ended December 31, 2022 and 2021 was $30,456 and $46,482 respectively.\nPromoters and Certain Control Persons\nWe did not have any promoters at any time since our inception in March 2008.\nDirector Independence\nWe currently do not have any independent directors, as the term independent is defined in Section 803A of the NYSE Amex LLC Company Guide. Since the OTCQB does not have rules regarding director independence, the Board makes its determination as to director independence based on the definition of independence as defined under the rules of the New York Stock Exchange (NYSE) and American Stock Exchange (Amex). ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\n(1) AUDIT FEES\nAudit and Non-Audit Fees\nThe following table sets forth fees billed to us by our independent auditors, for the years ended 2022 and 2021 for (i) services rendered for the audit of our annual financial statements and the review of our quarterly financial statements, (ii) services rendered that are reasonably related to the performance of the audit or review of our financial statements that are not reported as Audit Fees, and (iii) services rendered in connection with tax preparation, compliance, advice and assistance.\nFee Category\nFiscal 2022 Fees\nFiscal 2021 Fees\nAudit Fees\n$ 49,750\n$ 41,000\nAudit Related Fes\n-\n-\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTotal Fees\n$ 49,750\n$ 41,000\nAudit fees and audit related fees represent amounts billed for professional services rendered for the audit of our annual financial statements and the review of our interim financial statements. Before our independent accountants were engaged to render these services, their engagement was approved by our Directors.\n(2) AUDIT-RELATED FEES\nNone.\n(3) TAX FEES\nSee table above.\n(4) ALL OTHER FEES\nNone.\n(5) AUDIT COMMITTEE POLICIES AND PROCEDURES\nWe do not have an audit committee.\n(6) If greater than 50 percent, disclose the percentage of hours expended on the principal accountants engagement to audit the registrants financial statements for the most recent fiscal year that were attributed to work performed by persons other than the principal accountants full-time, permanent employees.\nNot applicable. ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\nWe have filed the following documents as part of this Annual Report on Form 10-K:\n1.\nThe financial statements listed in the Index to Consolidated Financial Statements on page 35 are filed as part of this report.\n2.\nFinancial statement schedules are omitted because they are not applicable or the required information is shown in the financial statements or notes thereto.\n3.\nExhibits included or incorporated herein: See index to Exhibits.\nExhibit Index\nExhibit\nNumber\nExhibit Description\n2.1\nAcquisition Agreement and Plan of Merger - dated March 3, 2011(3)\n2.2\nAddendum No. 1 to Acquisition Agreement and Plan of Merger - Dated April 27, 2011(4)\n2.3\nAgreement and Plan of Merger between Bollente Companies, Inc. and Bollente Name Change Subsidiary, Inc. - Dated June 4, 2018(5)\n3(i)(a)\nArticles of Incorporation of Bollente Companies, Inc. (Formerly Alcantara Brands Corporation)(1)\n3(i)(b)\nCertificate of Amendment - Name Change - Dated March 2, 2011(2)\n3(i)(c)\nCertificate of Change - 50:1 Reverse Split - Dated September 23, 2010(2)\n3(i)(d)\nArticles of Incorporation of Bollente Name Change Subsidiary, Inc. - Dated June 4, 2018(5)\n3(i)(e)\nArticles of Merger between Bollente Companies, Inc. and Bollente Name Change Subsidiary, Inc. - Dated June 4, 2018(5)\n3(i)(f)\nCertificate of Designation of Series B Preferred Stock - Dated April 2, 2020\n3(i)(g)\nCertificate of Change - Increase Authorized - Dated May 25, 2021*\n3(ii)(a)\nBylaws of Trutankless, Inc. (1)\n31.1\nCertification pursuant to Section 302 of the Sarbanes-Oxley Act*\n32.1\nCertification pursuant to 18 U.S.C. Section 350*\n1.\nIncorporated by reference from the Companys Registration Statement on Form SB-2 filed on March 19, 2008.\n2.\nIncorporated by reference from the Companys Quarterly Report on Form 10-Q filed on November 24, 2010.\n3.\nIncorporated by reference from the Companys Current Report on Form 8-K filed on March 10, 2011.\n4.\nIncorporated by reference from the Companys Current Report on Form 8-K filed on May 6, 2011.\n5.\nIncorporated by reference from the Companys Current Report on Form 8-K filed on June 6, 2018\n*\nFiled herewith.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTRUTANKLESS INC.\nBy:\n/s/ Michael Stebbins\nMichael Stebbins, Chief Executive Officer\nDate: November 14, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Michael Stebbins\nMichael Stebbins\nChief Executive Officer (Principal Executive Officer), Director and Principal Financial Officer\nNovember 14, 2023\n/s/ Robertson J. Orr\nRobertson James Orr\nDirector\nNovember 14, 2023\nGries & Associates, LLC\nCertified Public Accountants\n501 S. Cherry Street Suite 1100\nDenver, Colorado 80246\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Shareholders\nTrutankless, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Trutankless, Inc. (the Company) as of December 31, 2022 and the related consolidated statement of operations, statement of stockholders deficit, and cash flows for the year then ended, and the related notes and schedules (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2022, and the results of its operations and its cash flows for each of the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in note 3 to the financial statements, the Company has incurred losses since inception of $64,627,455, had a net loss of $4,646,055 and cash used in operations of $1,794,466. These factors create uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nEmphasis of Matters-Risks and Uncertainties\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and financial markets of many countries, including the geographical area in which the Company plans to operate.\n/s/ Gries & Associates, LLC\nWe have served as the Companys auditor since 2023.\nDenver, CO\nPCAOB# 6778\nNovember 13, 2023\nblaze@griesandassociates.com\n501 S. Cherry Street, Suite 1100, Denver, Colorado 80246\n(O)720-464-2875 (M)773-255-5631 (F)720-222-5846\nTRUTANKLESS, INC\nCONSOLIDATED BALANCE SHEETS\nDecember 31, 2022\nDecember 31, 2021\nASSETS\nCurrent assets\nCash\n$ 84,034\n$ 38,895\nAccounts receivable\n7,219\n5,424\nInventory\n117,980\n119,418\nAssets of discontinued operations\n-\n20,831\nTotal current assets\n209,233\n184,568\nOther Assets\nRight to use asset\n100,125\n17,744\nOther assets\n13,824\n26,439\nTotal other assets\n113,949\n44,183\nTotal assets\n$ 323,182\n$ 228,751\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent liabilities\nAccounts payable and accrued liabilities\n1,062,385\n888,531\nAccounts payable and accrued liabilities - related party\n164,300\n129,700\nLease liability\n51,223\n19,960\nAccrued interest payable - related party\n93,069\n77,419\nNotes payable - related party\n121,450\n106,350\nNotes payable, net of debt discount\n684,380\n799,377\nConvertible notes payable, net of debt discount\n1,329,121\n1,031,432\nConvertible notes payable - related party\n500,000\n-\nLiabilities of discontinued operations\n-\n758,279\nTotal current liabilities\n4,005,928\n3,811,048\nLease liability - long-term\n44,520\n-\nNotes payable - long term, net of debt discount\n70,460\n201,000\nNotes payable - related party, non current\n125,500\n110,500\nConvertible notes payable - related party, non current\n1,628,930\n-\nTotal long-term liabilities\n1,869,410\n311,500\nTotal liabilities\n5,875,338\n4,122,548\nStockholders deficit\nPreferred stock, $0.001 par value, 9,990,000 shares authorized, 76,000 and 76,000 shares issued and outstanding as of December 31, 2022 and 2021, respectively\n-\n-\nSeries B Preferred stock, $0.001 par value, 10,000 shares authorized, 10,000 and 0 shares issued and outstanding as of December 31, 2022 and 2021, respectively\nCommon stock, $0.001 par value, 1,000,000,000 shares authorized, 20,367,477 and 20,217,577 shares issued and outstanding as of December 31, 2022 and 2021, respectively\n20,367\n20,217\nAdditional paid in capital\n54,261,311\n54,170,266\nSubscriptions payable\n4,793,611\n2,288,551\nAccumulated deficit\n(64,627,455 )\n(60,372,841 )\nTotal stockholders deficit\n(5,552,156 )\n(3,893,797 )\nTotal liabilities and stockholders deficit\n$ 323,182\n$ 228,751\nSee accompanying notes to the consolidated financial statements.\nTRUTANKLESS, INC\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the years ended\nDecember 31, 2022\nDecember 31, 2021\nRevenue\n$ 73,009\n$ 246,032\nCost of goods sold\n(22,552 )\n(127,669 )\nGross profit\n50,457\n118,363\nOperating expenses\nGeneral and administrative\n3,711,863\n10,599,169\nResearch and development\n246,186\n211,025\nProfessional fees\n188,965\n343,495\nTotal operating expenses\n4,147,014\n11,153,689\nLoss from operations\n(4,096,557 )\n(11,035,326 )\nOther income (expenses)\nInterest expense\n(556,827 )\n(5,014,194 )\nGain/Loss on change of derivative liability\n15,845\n149,798\nLoss on extinguishment of notes payable\n17,973\n(1,212,153 )\nGain on debt forgiveness of PPP loan\n-\n101,327\nTotal income (expenses)\n(523,009 )\n(5,975,222 )\nNet loss before tax provision\n(4,619,566 )\n(17,010,548 )\nTax provision\n-\n-\nNet loss from continuing operations\n$ (4,619,566 )\n$ (17,010,548 )\nNet loss from discontinued operations before tax provision\n(26,489 )\n(369,222 )\nTax provision for discontinued operations\n-\n-\nNet loss from discontinued operations\n$ (26,489 )\n$ (369,222 )\nNet loss\n$ (4,646,055 )\n$ (17,379,770 )\nNet loss per common share from continuing operations - basic and diluted\n$ (0.23\n$ (1.35 )\nNet loss per common share from discontinued operations- basic and diluted\n$ -\n$ (0.03 )\nNet loss per common share - basic and diluted\n$ (0.23\n$ (1.38 )\nWeighted average number of common shares outstanding - basic and diluted\n20,339,391\n12,578,271\nSee accompanying notes to the consolidated financial statements.\nTRUTANKLESS, INC\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' DEFICIT\nAdditional\nTotal\nPreferred Stock\nCommon Stock\nPaid-in\nSubscriptions\nAccumulated\nStockholders\nShares\nAmount\nShares\nAmount\nCapital\nPayable\nDeficit\nDeficit\nBalance, December 31, 2020\n10,000\n9,225,909\n9,226\n39,961,979\n658,374\n(42,993,071 )\n(2,363,482 )\nStock issued for cash\n-\n-\n2,062,850\n2,068\n1,649,697\n(157,500 )\n-\n1,494,265\nStock issued for services\n-\n-\n5,782,477\n5,785\n8,112,386\n1,826,990\n-\n9,945,161\nShares issued for beneficial conversion feature\n-\n-\n199,566\n458,826\n(3,774 )\n-\n455,252\nShares issued for debt restructuring\n-\n-\n98,495\n257,633\n(56,154 )\n-\n201,577\nShares issued for extinguishment of notes\n-\n-\n2,064,780\n2,056\n2,610,099\n20,615\n-\n2,632,770\nShares issued for the settlement of accrued expenses\n-\n-\n783,500\n962,921\n-\n-\n963,705\nDerivative liability written off to APIC\n-\n-\n-\n-\n152,451\n-\n-\n152,451\nImputed interest\n-\n-\n-\n-\n4,274\n-\n-\n4,274\nNet loss\n-\n-\n-\n-\n-\n-\n(17,379,770 )\n(17,379,770 )\nBalance, December 31, 2021\n10,000\n20,217,577\n20,217\n54,170,266\n2,288,551\n(60,372,841 )\n(3,893,797 )\nStock issued for services\n-\n-\n23,750\n4,980\n2,389,010\n-\n2,394,014\nShares issued to extend notes\n-\n-\n87,500\n101,412\n116,027\n-\n217,527\nShares issued for debt discount\n-\n-\n165,216\n122,982\n-\n-\n123,147\nShares issued for the settlement of accrued expenses\n-\n-\n-\n-\n-\n-\nSpin-off of Notation labs\n-\n-\n-\n-\n-\n-\n391,441\n391,441\nCancellation of commitment shares\n-\n-\n(126,440 )\n(126 )\n(157,924 )\n-\n-\n(158,050 )\nRounding shares cancellation\n-\n-\n(126 )\n-\n-\n-\n-\n-\nImputed interest\n-\n-\n-\n-\n19,595\n-\n-\n19,595\nNet loss\n-\n-\n-\n-\n-\n-\n(4,646,055 )\n(4,646,055 )\nBalance, December 31, 2022\n10,000\n20,367,477\n20,367\n54,261,311\n4,793,611\n(64,627,455 )\n(5,552,156 )\nSee accompanying notes to the consolidated financial statements.\nTRUTANKLESS, INC\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the years ended\nDecember 31, 2022\nDecember 31, 2021\nCash Flows from Operating Activities\nNet loss from continuing operations\n$ (4,619,566 )\n$ (17,010,548 )\nNet loss from discontinued operations\n(26,489 )\n(369,222 )\nAdjustments to reconcile net loss to net cash provided by operating activities:\nImputed interest\n19,595\n-\nShares issued for services\n2,394,014\n9,945,161\nCancellation of commitment shares\n(158,050 )\n-\nGain/Loss on change in derivative liability\n-\n(149,798 )\nShares issued to extend notes\n217,527\n-\nShares issued for beneficial conversion feature\n-\n201,577\nLoss on extinguishment of notes payable and accrued expenses\n-\n416,539\nLoss on extinguishment of notes payable and accrued expenses - related party\n-\n816,452\nLoss on extinguishment of accrued expenses\n-\n571,995\nGain on forgiveness of PPP loan payable\n-\n(101,327 )\nDepreciation\n12,615\n12,581\nNon cash operating lease expense\n(6,598 )\n(983 )\nAmortization of debt discount\n159,383\n1,300,830\nChanges in assets and liabilities\nAccounts receivable\n(1,795 )\n104,542\nInventory\n1,438\n(94,764 )\nPrepaid expenses\n-\n1,462,975\nAccounts payable and accrued liabilities\n167,351\n144,895\nAccounts payable and accrued liabilities - related party\n50,250\n199,700\nInterest payable - related party\n6,526\n36,534\nOperating cash flow from continued operations\n(1,783,799 )\n(2,512,861 )\nOperating cash flow from discontinued operations\n(31,498 )\n81,013\nNet cash used in operating activities\n(1,815,297 )\n(2,431,848 )\nCash Flows from Investing Activities:\nPurchase of fixed assets\n-\n(25,298 )\nNet cash used in investing activities\n-\n(25,298 )\nCash Flows from Financing Activities:\nProceeds from convertible notes payable\n388,200\n439,590\nRepayments of convertible notes payable\n(70,381 )\n(1,032,563 )\nProceeds from convertible notes payable - related party\n1,801,180\n-\nProceeds from notes payable\n-\n860,358\nRepayments from notes payable\n(301,904 )\n(203,906 )\nProceeds from notes payable - related party\n30,100\n125,960\nRepayments from notes payable - related party\n(44,750 )\n-\nProceeds from sale of common stock, net of offering costs\n-\n1,494,265\nFinancing cash flows from continued operations\n1,802,445\n1,683,704\nFinancing cash flows from discontinued operations\n37,160\n681,540\nNet cash provided by financing activities\n1,839,605\n2,365,244\nNet decrease in cash\n24,308\n(91,902 )\nCash of continuing operations, beginning of period\n59,726\n151,628\nCash, end of period\n$ 84,034\n$ 59,726\nSupplemental disclosure of cash flow information\nCash paid for interest\n$ 213,681\n$ 93,491\nCash paid for taxes\n$ -\n$ -\nSUPPLEMENTARY DISCLOSURE OF NON-CASH INVESTING AND FINANCING ACTIVITIES:\nDerivative liability written off to additional paid in capital\n$ -\n$ 152,451\nNotes and accrued interest settled with stock\n$ -\n$ 733,691\nNotes and accrued interest - related party settled with stock\n$ -\n$ 666,048\nRecognition of debt discount\n$ -\n$ 455,252\nAccrued expenses settled with stock\n$ 18,000\n$ 391,750\nSee accompanying notes to the consolidated financial statements.\nTRUTANKLESS INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDECEMBER 31, 2022 AND 2021\n(UNAUDITED)\nNOTE 1 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nOrganization\nThe Company was incorporated on March 7, 2008 under the laws of the State of Nevada, as Alcantara Brands Corporation. On October 5, 2010, the Company amended its articles of incorporation and changed its name to Bollente Companies, Inc. On June 4, 2018, the Company amended its articles of incorporation and changed its name to Trutankless, Inc.\nThe Company is involved in sales, marketing, research and development of a high quality, whole-house, smart electric tankless water heater that is more energy efficient than conventional products. Management anticipates the Companys trutankless water heater, with Wi-Fi capability and Trutankless proprietary apps offered in the iOS and Android store, will augment existing products in the home automation space.\nPrinciples of consolidation\nThe consolidated financial statements include the accounts of Trutankless, Inc. and its wholly owned subsidiaries. On May 16, 2010, the Company acquired 100% of the outstanding stock of Bollente, Inc. On August 20th, 2020 the Company formed a wholly owned subsidiary, Notation Labs, Inc. All significant inter-company transactions and balances have been eliminated.\nSpinoff - On January 24, 2022, the Company completed the previously announced spin-off of its subsidiary Notation Labs Inc into a stand-alone company. The historical results of Notation Labs Inc that were contributed to Trutankless Inc in the spinoff have been reflected as discontinued operations in our condensed consolidated financial statements through the date of the spinoff and in the prior year periods as the spinoff represents a strategic shift in our business that has a major effect on operations and financial results. As of December 31, 2022, the assets and liabilities associated with these Notation Labs Inc. are classified as assets and liabilities of discontinued operations in the condensed consolidated balance sheet. The disclosures presented in our notes to the interim condensed consolidated financial statements are presented on a continuing operations basis.\nCertain prior year amounts have been reclassified for consistency with the current period presentation. These reclassifications had no effect on the reported results of operations.\nUse of estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ significantly from those estimates.\nCash and cash equivalents\nFor the purpose of the statements of cash flows, all highly liquid investments with an original maturity of three months or less are considered to be cash equivalents. The carrying value of these investments approximates fair value.\nStock-based compensation\nThe Company follows ASC 718-10, Stock Compensation, which addresses the accounting for transactions in which an entity exchanges its equity instruments for goods or services, with a primary focus on transactions in which an entity obtains employee services in share-based payment transactions. ASC 718-10 is a revision to SFAS No. 123, Accounting for Stock-Based Compensation, and supersedes Accounting Principles Board (APB) Opinion No. 25, Accounting for Stock Issued to Employees, and its related implementation guidance. ASC 718-10 requires measurement of the cost of employee services received in exchange for an award of equity instruments based on the grant-date fair value of the award (with limited exceptions). Incremental compensation costs arising from subsequent modifications of awards after the grant date must be recognized.\nIncome Taxes\nThe Companys calculation of its tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in various taxing jurisdictions. The Company recognizes tax liabilities for uncertain tax positions based on managements estimate of whether it is more likely than not that additional taxes will be required. The Company had no uncertain tax positions as of December 31, 2022 and 2021.\nDeferred income taxes are recognized in the consolidated financial statements for the tax consequences in future years of differences between the tax basis of assets and liabilities and their financial reporting amounts based on enacted tax laws and statutory tax rates. Temporary differences arise from net operating losses, differences in depreciation methods of archived images, and property and equipment, stock-based and other compensation, and other accrued expenses. A valuation allowance is established when it is determined that it is more likely than not that some or all of the deferred tax assets will not be realized.\nThe application of tax laws and regulations is subject to legal and factual interpretation, judgment and uncertainty. Tax laws and regulations themselves are subject to change as a result of changes in fiscal policy, changes in legislation, the evolution of regulations and court rulings. Therefore, the actual liability for U.S., or the various state jurisdictions, may be materially different from managements estimates, which could result in the need to record additional tax liabilities or potentially reverse previously recorded tax liabilities. Interest and penalties are included in tax expense.\nThe Company includes interest and penalties arising from the underpayment of income taxes in the statements of operation in the provision for income taxes. As of December 31, 2022 and 2021, the Company had no accrued interest or penalties related to uncertain tax positions.\nEarnings per share\nThe Company follows ASC Topic 260 to account for the earnings per share. Basic earnings per common share (EPS) calculations are determined by dividing net income by the weighted average number of shares of common stock outstanding during the year. Diluted earnings per common share calculations are determined by dividing net income by the weighted average number of common shares and dilutive common share equivalents outstanding. During periods when common stock equivalents, if any, are anti-dilutive they are not considered in the computation. There are 10,129,084 additional shares issuable in connection with outstanding warrants, stock payable, and convertible debts as of December 31, 2022.\nAccounts receivable\nAccounts receivable is comprised of uncollateralized customer obligations due under normal trade terms. The Company performs ongoing credit evaluation of its customers and management closely monitors outstanding receivables based on factors surrounding the credit risk of specific customers, historical trends, and other information. The carrying amount of accounts receivable is reviewed periodically for collectability. If management determines that collection is unlikely, an allowance that reflects managements best estimate of the amounts that will not be collected is recorded. Accounts receivable are presented net of an allowance for doubtful accounts of $179,381 and $179,381 at December 31, 2022 and 2021, respectively.\nAdvertising Costs\nThe Companys policy regarding advertising is to expense advertising when incurred. The Company incurred advertising expenses of $4,721 and $7,381 during the years ended December 31, 2022 and 2021, respectively.\nResearch and development costs\nThe Company charges research and development costs to expense when incurred in accordance with FASB ASC 730, Research and Development. Research and development costs were $246,186 and $211,025 for the years ended December 31, 2022 and 2021, respectively.\nInventory\nInventory, including manufacturing cost and shipping are stated at the lower of cost (average cost) or market (net realizable value).\nRevenue recognition\nWe recognize revenue in accordance with generally accepted accounting principles as outlined in the Financial Accounting Standard Boards (FASB) Accounting Standards Codification (ASC) 606, Revenue From Contracts with Customers, which requires that five basic criteria be met before revenue can be recognized: (i) identify the contract with the customer; (ii) identity the performance obligations in the contract; (iii) determine the transaction price; (iv) allocate the transaction price; and (v) recognize revenue when or as the entity satisfied a performance obligation.\nRevenue recognition occurs at the time product is shipped to customers, when control transfers to customers, provided there are no material remaining performance obligations required of the Company or any matters of customer acceptance. We only record revenue when collectability is probable.\nFair value of financial instruments\nThe Company measures fair value in accordance with ASC 820 - Fair Value Measurements. ASC 820 defines fair value and establishes a three-level valuation hierarchy for disclosures of fair value measurements. ASC 820 establishes a framework for measuring fair value in generally accepted accounting principles and expands disclosures about fair value measurements. To increase consistency and comparability in fair value measurements and related disclosures, ASC 820 establishes a fair value hierarchy which prioritizes the inputs to valuation techniques used to measure fair value into three (3) broad levels. The fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The three (3) levels of fair value hierarchy defined by ASC 820 are:\nLevel 1 - Inputs are unadjusted, quoted prices in active markets for identical assets or liabilities at the measurement date.\nLevel 2 - Inputs (other than quoted market prices included in Level 1) are either directly or indirectly observable for the asset or liability through correlation with market data at the measurement date and for the duration of the instruments anticipated life.\nLevel 3 - Inputs reflect managements best estimate of what market participants would use in pricing the asset or liability at the measurement date. Consideration is given to the risk inherent in the valuation technique and the risk inherent in the inputs to the model. Valuation of instruments includes unobservable inputs to the valuation methodology that are significant to the measurement of fair value of assets or liabilities.\nAs defined by ASC 820, the fair value of a financial instrument is the amount at which the instrument could be exchanged in a current transaction between willing parties, other than in a forced or liquidation sale, which was further clarified as the price that would be received to sell an asset or paid to transfer a liability (an exit price) in an orderly transaction between market participants at the measurement date.\nThe reported fair values for financial instruments that use Level 2 and Level 3 inputs to determine fair value are based on a variety of factors and assumptions. Accordingly, certain fair values may not represent actual values of the Companys financial instruments that could have been realized as December 31, 2022 or that will be recognized in the future, and do not include expenses that could be incurred in an actual settlement. The carrying amounts of the Companys financial assets and liabilities, such as cash, accounts receivable, receivables from related parties, prepaid expenses and other, accounts payable, accrued liabilities, and related party and third-party notes payables approximate fair value due to their relatively short maturities. The Companys notes payable to related parties approximates the fair value of such instrument based upon managements best estimate of terms that would be available to the Company for similar financial arrangements at December 31, 2022 and 2021.\nRecent Accounting Pronouncements\nIn October 2021, the FASB issued ASU 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers, which requires contract assets and contract liabilities acquired in a business combination to be recognized and measured by the acquirer on the acquisition date in accordance with ASC 606, Revenue from Contracts with Customers, as if it had originated the contracts. Under the current business combinations guidance, such assets and liabilities are recognized by the acquirer at fair value on the acquisition date. This new guidance is effective for the Company for its fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. Early adoption is permitted, including adoption in an interim period. The Company is evaluating its potential impact but does not expect the new standard to have a material impact on the Companys results of operations or cash flows.\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (subtopic 470-20) and Derivatives and Hedging - Contracts in Entitys Own Equity (subtopic 815-40), which reduces the number of accounting models in ASC 470-20 that require separate accounting for embedded conversion features. As a result, a convertible debt instrument will be accounted for as a single liability measured at its amortized cost as long as no other features require bifurcation and recognition as derivatives. By removing those separation models, the effective interest rate of convertible debt instruments will be closer to the coupon interest rate. Further, the diluted net income per share calculation for convertible instruments will require the Company to use the if-converted method. The treasury stock method should no longer be used to calculate diluted net income per share for convertible instruments. The amendment will be effective for the Company for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years.\nNOTE 2 - SPIN-OFF OF NOTATION LABS INC.\nOn January 24, 2022, the Company completed the spin-off of its subsidiary Notation Labs Inc into a stand-alone company. Each holder of the common stock received one share of Notation labs, Inc common stock for every four shares of the Companys common stock held at the close of business on December 10, 2021, the record date of the distribution. In contemplation of the Spin-off, the Notation Labs business, the historical results of operations, assets and liabilities, and the cash flows of Notation Labs are reflected as discontinued operations. Prior to the Separation, net assets attributable to Notation Labs were as follows:\nAssets\nCash and cash equivalents\n79,517\nDue to related party\n486,500\nTotal Assets of Discontinued Operations\n566,017\nLiabilities\nTrade accounts payable and accrued liabilities\n75,918\nDue to related party\nNotes payable - related party\n400,000\nNotes payable\n21,340\nRoyalty liability\n460,000\nTotal current liabilities of discontinued operations\n957,458\nNet liabilities spun off to shareholders\n(391,441 )\nDiscontinued Operations\nThe components of assets and liabilities of discontinued operations that are stated separately as of December 31, 2021 in the Consolidated Balance Sheets are comprised of the following items:\nDecember 31,\nAssets\nCash and cash equivalents\n20,831\nTotal Assets of Discontinued Operations\nLiabilities\nTrade accounts payable and accrued liabilities\n76,739\nDue to related party\nNotes payable - related party\n200,000\nNotes payable\n21,340\nRoyalty liability\n460,000\nTotal current liabilities of discontinued operations\n758,279\nThe components of loss from discontinued operations, net of tax for the Notation Labs business are as follows:\nDecember 31,\nSelling, general and administrative\nResearch and development\n25,804\nOther (income) expense, net\nloss from discontinued operations before taxes\n26,489\nTaxes on income\n-\nLoss from discontinued operations, net of taxes\n26,489\nThe components of cashflows from discontinued operations for the Notation Labs business are as follows:\nDecember 31,\nCash Flows from Operating Activities:\nRetained earnings transferred to Notation labs\n391,441\nNet assets transferred to Notation labs\n114,000\nNet liabilities transferred to Notation labs\n(536,114 )\nAccounts payable and accrued liabilities\n(825 )\nNet transfers to Notation Labs included in Net Cash used in operating activities included in Discontinued Operations\n(31,498 )\nCash Flows from Financing Activities:\nProceeds from notes payable related party\n(114,000 )\nNet transfer to Notation labs from financing activities\n151,160\nNet transfers to Notation Labs included in Net Cash Provided by Financing activities Discontinued Operations\n37,160\nNOTE 3 - GOING CONCERN\nThe accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities and commitments in the normal course of business.\nManagement evaluated all relevant conditions and events that are reasonably known or reasonably knowable, in the aggregate, as of the date the consolidated financial statements are issued and determined that substantial doubt exists about the Companys ability to continue as a going concern. The Companys ability to continue as a going concern is dependent on the Companys ability to generate revenues and raise capital. The Company has not generated sufficient revenues from product sales to provide sufficient cash flows to enable the Company to finance its operations internally. As of December 31, 2022, the Company had $84,034 cash on hand. At December 31, 2022 the Company has an accumulated deficit of $64,627,455. For the year ended December 31, 2022, the Company had a net loss of $4,646,055, and cash used in operations of $1,783,799. These factors raise substantial doubt about the Companys ability to continue as a going concern within one year from the date of filing.\nOver the next twelve months management plans to raise additional capital and to invest its working capital resources in sales and marketing in order to increase the distribution and demand for its products. However, there is no guarantee the Company will generate sufficient revenues or raise capital to continue operations. If the Company fails to generate sufficient revenue and obtain additional capital to continue at its expected level of operations, the Company may be forced to scale back or discontinue its sales and marketing efforts. The consolidated financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nNOTE 4 - INVENTORY\nInventories consist of the following at:\nDecember 31, 2022\nDecember 31, 2021\nFinished goods\n117,980\n119,418\nTotal\n$ 117,980\n$ 119,418\nNOTE 5 - ACCOUNTS RECEIVABLE, NET\nAccounts receivable consist of the following at:\nDecember 31, 2022\nDecember 31, 2021\nAccounts receivable\n186,600\n184,805\nAllowance for doubtful accounts\n(179,381 )\n(179,381 )\nTotal\n$ 7,219\n$ 5,424\nNOTE 6 - RELATED PARTY\nAccounts payable and accrued liabilities - related party\nIn January 2019, the Company executed a lease agreement with Templar Asset Group, LLC, a related party. The lease term is one year at a rate of $4,200 per month for a period of one year with an option to continue a month-to-month basis thereafter. Under ASC 842, this lease is not recorded on the balance sheet as its term is 12 months or less.\nRent expense associated with the lease agreement for the year ended December 31, 2022 and 2021 was $50,400 and $50,400, respectively. As of December 31, 2022 and 2021 the Company had amounts due associated with the lease of $106,300 and $59,100, respectively.\nIn January 2014, the Company executed a lease agreement with Perigon Companies, LLC, a related party. The lease term is one month at a rate of $4,000 per month for a period of one month with an option to continue a month-to-month basis thereafter. Under ASC 842, this lease is not recorded on the balance sheet as its term is 12 months or less. The lease was terminated as of January 1, 2019.\nRent expense associated with the lease agreement for the six months ended December 31, 2022 and 2021 was $0 and $0, respectively. As of December 31, 2022 and 2021 the Company had amounts due associated with the lease of $34,500 and $34,500, respectively.\nDuring the years ended December 31, 2022 and 2021 the Company received $0 and $0 in advances from a related party, respectively. As of December 31, 2022 and 2021 the Company had received advances from a related party of $23,500 and $23,500, respectively.\nNotes payable - related party consist of the following at:\nDecember 31,\nDecember 31,\nNote payable, secured, 5% interest, due May 2022\n$ 19,450\n$ 4,350\nNote payable, secured, 12% interest, due May 2030\n125,500\n110,500\nNote payable, secured, 12% interest, due April 2022\n102,000\n102,000\nTotal Notes Payable - related party\n$ 246,950\n$ 216,850\nLess unamortized debt discounts\n-\n-\nTotal Notes Payable\n246,950\n216,850\nLess current portion\n(121,450 )\n(106,350 )\nTotal Notes Payable - long term\n$ 125,500\n$ 110,500\nDuring the year ending December 31, 2022 the Company received $15,100 under a note payable from a director of the Company. As of December 31, 2022 and 2021, the Company had one note payable due to a director of the Company in the amount of $19,450 and $4,350, respectively. The note has an interest rate of 5% and is due on demand.\nAs of December 31, 2022 and 2021, the Company had one note payable due to an officer of the Company in the amount of $125,500 and $110,500, respectively. The note has an interest rate of 12%and is due on demand.\nOn April 30, 2021, the Company entered into a $150,000, 12% grid note payable with a Company controlled by the CEO that is due upon demand but no later than April 30, 2022. As of December 31, 2022 and 2021, the Company has received advances under the note of $102,000 and $102,000, respectively.\nInterest expense associated with the related party notes for the years ended December 31, 2022 and 2021 was $30,456 and $46,482 respectively.\nConvertible notes payable - related party consist of the following at:\nDecember 31,\nDecember 31,\nConvertible note payable, 8% interest, due December 2024\n$ 1,628,930\n$ -\nConvertible note payable, 12% interest, due December 2023\n400,000\n-\nConvertible note payable, 12% interest, due July 2023\n100,000\n-\nTotal Notes Payable - related party\n$ 2,128,930\n$ -\nLess unamortized debt discounts\n-\n-\nTotal Notes Payable\n2,128,930\n-\nLess current portion\n(500,000 )\n-\nTotal Notes Payable - long term\n$ 1,628,930\n$ -\nOn September 1, 2022, the Company entered into a $2,500,000 8% convertible grid note with Notation Labs, Inc, a company commonly controlled by a director of the Company. The note is due on December 31, 2024 and is convertible at a rate of $0.80 per share (post-split). During the year ending December 31, 2022 the Company received $1,628,930 in advances from the note. As of December 31, 2022 the balance of the note was $1,628,930.\nOn July 26, 2022, the Company issued a $400,000 12% convertible promissory note to a company commonly controlled by a director of the Company. The note is due on December 15, 2023 and is convertible into shares of the Companys common stock at a rate of $0.08 per share. As of December 31, 2022 and 2021 the balance of the note was $400,000 and $0, respectively.\nOn July 26, 2022, the Company issued a $100,000 12% convertible promissory note to a company commonly controlled by a director of the Company. The note is due on July 1, 2023 and is convertible into shares of the Companys common stock at a rate of $0.02 per share. As of December 31, 2022 and 2021 the balance of the note was $100,000 and $0, respectively.\nInterest expense on all of the above convertible notes for the years ended December 31, 2022 and 2021 was $7,956 and $0, respectively.\nNOTE 7 - NOTES PAYABLE\nNotes payable consist of the following at:\nDecember 31\nNote payable, secured, 12% interest, due June 2024\n$ 70,920\n$ 93,411\nNote payable, secured, 12% interest, due June 2024\n300,000\n300,000\nNotes payable, secured, 30% interest, due June 2021\n125,000\n125,000\nNotes payable, secured, 12% interest, due April 2022\n95,000\n95,000\nNotes payable, secured, 10% interest, due June 2022\n-\n219,333\nNotes payable, secured, 12% interest, due December 2023\n10,000\n10,000\nNotes payable, unsecured, 0% interest, due on demand\n13,000\n13,000\nNotes payable, secured, 12% interest, due June 2024\n140,920\n201,000\nTotal notes Payable\n$ 754,840\n$ 1,056,744\nLess unamortized debt discounts\n-\n(56,367 )\nTotal Notes Payable\n754,840\n1,000,377\nLess current portion\n(684,380 )\n(799,377 )\nTotal Notes Payable - long term\n$ 70,460\n$ 201,000\nOn June 11, 2020, the Company issued $160,000 of principal amount of 12% secured convertible promissory notes and warrants to purchase common stock. The notes were due between May and August 2018 and bear interest of percent (12%). The notes are secured by all of the Companys assets. The outstanding principal amounts and accrued but unpaid interest of the notes is convertible at any time at the option of the holder into common stock at a conversion price of $1.00 per share. The notes were issued with warrants to purchase up to 160,000 shares of the Companys common stock which were valued at $119,616. On May 16, 2019, the maturity date of the note was extended to January 11, 2020 for the issuance of 11,250 shares of common stock (post-Split) valued at $45,900. As of December 31, 2021, $165,516 of the debt discount was amortized and the note was shown net of unamortized discount of $0.\nOn January 30, 2019, the Company issued a $100,000 12% promissory note. The note was due on December 31, 2019. As an incentive to enter into the agreement the noteholder was also granted 100,000 shares valued at $45,000 which was recognized as a debt discount. On May 16, 2019, the maturity date of the note was extended to December 31, 2020 (see below) for the issuance of 6,875 shares of common stock(post-split) valued at $23,100 The Company recorded the fair market value of all the shares issued for extensions to financing cost.\nOn January 1, 2020, the Company entered into an agreement to consolidate the above two notes payable dated June 11, 2018 and January 30, 2019 into one $260,000, 12% note due June 1, 2022. As consideration the Company issued the note holder 175,000 shares of common stock valued at $61,250, which was recognized as a financing cost. The Company evaluated the modification under ASC 470-50 and determined that the modifications were considered substantial and qualified for extinguishment accounting under such guidance. As such, the Company recorded a loss on extinguishment of debt of $61,250 associated with the excess reacquisition cost of the new debt over the carrying value of the original debt. On May 1, 2022, for the issuance of 25,000 shares valued at $29,000 on the date of commitment, the loan was further extended to June 1, 2024. During the year ending December 31, 2022 the Company made principal payments totaling $22,491. As of December 31, 2022 and 2021 the balance of the note was $70,920 and $93,411, respectively.\nOn September 2, 2016, the Company issued a $100,000 12% promissory note. The note was due on September 1, 2017. As an incentive to enter into the agreement the noteholder was also granted 25,000 shares valued at $25,000 which was recognized as a debt discount. On May 16, 2019, the maturity date of the note was extended to July 1, 2020 (see below) for the issuance of 50,000 shares of common stock valued at $21,000, which was recognized as a debt discount over the extended maturity date. As of December 31, 2022, the full amounts of the debt discount have been amortized.\nOn February 2, 2018, the Company entered into an agreement with the note holder to split a certain note payable dated July 1, 2015 into two notes in the amount of $150,000 and $50,000, respectively. In addition to splitting the notes the noteholder also agreed to extend the due date of the new $50,000 note to July 1, 2018 and on June 4, 2018, for consideration of 15,000 shares the noteholder further agreed to extend the due date of the new $50,000 note to April 1, 2019. On November 15, 2018, both notes were further extended to January 1, 2020 (see below) for the issuance of 80,000 shares valued $40,800. On May 16, 2019, the maturity dates of both notes were extended to July 1, 2020 for the issuance of 50,000 shares of common stock valued at $21,000. The Company recorded the fair market value of all the shares issued for extensions to financing cost.\nOn January 1, 2020, the Company entered into an agreement to consolidate three notes payable above dated September 2, 2016 and February 2, 2018 into one $300,000, 12% note due June 1, 2021. As consideration the Company issued the note holder 175,000 shares of common stock valued at $61,250 which was recorded as financing expense. On May 1, 2022, for the issuance of 25,000 shares valued at $29,000 on the date of commitment, the loan was further extended to June 1, 2024. The Company evaluated the modification under ASC 470-50 and determined that the modifications were considered substantial and qualified for extinguishment accounting under such guidance. As such the Company recorded a loss on extinguishment of debt of $61,250 associated with the excess reacquisition cost of the new debt over the carrying value of the original debt. As of December 31, 2022 and 2021 the balance of the note was $300,000 and $300,000, respectively.\nOn January 8, 2021, the Company entered into a $125,000, 30% note payable due on June 8, 2021. Under the note the Company must make interest only payments of $3,125 starting on February 10, 2021 and continuing through maturity. On December 31, 2022, the noteholder extended the due date to June 8, 2022 for $1,250. As of December 31, 2022 and 2021 the balance of the note was $125,000 and $125,000, respectively. As of December 31, 2022 the note is in default.\nOn April 26, 2021, the Company entered into a $95,000, 12% note payable due on April 26, 2022. As of December 31, 2022 and 2021 the balance of the note was $95,000 and $95,000, respectively.\nOn June 28, 2021, the Company entered in to a $350,000 note payable, including an original issue discount of $56,892. Interest under the promissory note is 12% per annum, and the principal and all accrued but unpaid interest is due twelve (12) months from funding with monthly payment of $39,200 beginning on August 6, 2021. As an incentive to enter into the agreement, the noteholder was also granted 157,834 shares valued at $169,198, based on market value of the shares on the date of issuance which was recognized as a debt discount. During the year ended December 31, 2022, $56,367 of the discount was amortized and the note was shown net of unamortized discount of $0. During the year ending December 31, 2022 the Company made principal payments totaling $219,333. As of December 31, 2022 and December 31, 2021 the balance of the note was $0 and $219,333, respectively.\nOn August 18, 2021, the Company entered into a $10,000, 12% note payable due on August 18, 2022. On April 10, 2022 the note was amended to have a due date of December 7, 2023. As of December 31, 2022 and 2021 the balance of the note was $10,000 and $10,000, respectively.\nOn November 4, 2021, the Company entered into a $25,000, 0% note payable due on demand. As of December 31, 2022 and 2021 the balance of the note was $13,000 and $13,000, respectively.\nOn May 12, 2021, the Company entered into a $103,000, 24% note payable due on September 12, 2021.\nOn July 12, 2021, the Company entered into a $98,000, 12% note payable due on November 12, 2021.\nOn November 12, 2021, the Company entered into an agreement to consolidate the two notes payable above dated May 12, 2021 and July 12, 2021 into one $201,000, 12% note due December 15, 2023. As consideration the Company issued the note holder 100,000 shares of common stock valued at $125,000 which was recorded as financing expense. The Company evaluated the modification under ASC 470-50 and determined that the modifications were considered substantial and qualified for extinguishment accounting under such guidance. As such the Company recorded a gain on extinguishment of debt of $15,643 associated with the deficit reacquisition cost of the new debt over the carrying value of the original debt. On May 1, 2022, for the issuance of 100,000 shares valued at $87,000 on the date of commitment, the loan was further extended to June 1, 2024. During the year ending December 31, 2022 the Company made principal payments totaling $60,080. As of December 31, 2022 and 2021 the balance of the note was $140,920 and $201,000, respectively.\nInterest expense including amortization of the associated debt discount for the years ended December 31, 2022 and 2021 was $129,952 and $577,374, respectively.\nConvertible notes payable, net of debt discount consist of the following:\nDecember 31,\nConvertible note payable, secured, 12% interest, due August 31, 2019, in default\n50,000\n50,000\nConvertible note payable, secured, 12% interest, due May 2, 2023\n100,000\n100,000\nConvertible note payable, secured, 10% interest, due April 2023\n45,000\n50,000\nConvertible note payable, secured, 10% interest, due May 22, 2020, in default\n5,000\n5,000\nConvertible note payable, secured, 12% interest, due Feb 15, 2024, in default\n75,000\n75,000\nConvertible notes payable, secured, 4% interest, due October 14, 2020, in default\n75,000\n75,000\nConvertible note payable ,12% interest, due May 2020, in default\n162,750\n162,750\nConvertible note payable, secured, 10% interest, due May 1, 2024\n350,000\n350,000\nConvertible note payable, secured, 12% interest, due January 6, 2022\n-\n30,382\nConvertible note payable, secured, 12% interest, due February 8, 2022\n95,000\n100,000\nConvertible notes payable, secured, 4% interest, due March 3, 2021, in default\n25,000\n25,000\nConvertible notes payable, secured, 10% interest, due December 2021, in default\n10,000\n10,000\nConvertible notes payable, 8% interest, due February 2023\n355,000\n-\nConvertible notes payable, 8% interest, due July 2023\n38,200\nTotal notes payable\n1,385,950\n1,033,132\nLess unamortized discounts\n(56,829 )\n(1,700 )\nTotal convertible notes payable, net\n$ 1,329,121\n$ 1,031,432\nLess current portion\n(1,329,121 )\n(1,031,432 )\nConvertible notes payable, net - Long-term\n$ -\n$ -\nOn June 2, 2016, the Company issued $50,000 of principal amount of 12% secured convertible promissory notes and 6,250 warrants to purchase common stock (post-split). The note was due on August 31, 2018, was later extended to August 31, 2019, bears interest of twelve percent (12%) and is currently in default. The outstanding principal amounts and accrued but unpaid interest of the notes is convertible at any time at the option of the holder into common stock at a conversion price of $8.00 per share (post-split). The notes were issued with warrants to purchase up to 6,250 shares of the Companys common stock at an exercise price of $12 per share (post-split). As of December 31, 2022 and 2021 the balance of the note was $50,000 and $50,000, respectively. As of the date of filing the loan is in default.\nOn May 2, 2017, the Company issued $100,000 of principal amount of 10% secured convertible promissory notes and 20,000 warrants to purchase common stock. The note was due on May 2, 2020 and is secured by the Companys accounts receivable and inventory and on August 1, 2020, for the issuance of $6,250 shares (post-split) valued at $10,000 based on market value of the shares of $1.6 (post-split) on the date of issuance, was further extended to February 1, 2021, and was again extended on April 20, 2021 to May 2, 2022 for the 12,500 shares (post-split) valued at $17,000, which is included in stock payable. On May 1, 2022, for the issuance of 12,500 shares valued at $14,500 on the date of commitment, the loan was further extended to May 1, 2023. The outstanding principal amounts and accrued but unpaid interest of the notes is convertible at any time at the option of the holder into common stock at a conversion price of $4 per share (post-split). The notes were issued with warrants to purchase up to 10,000 shares of the Companys common stock at an exercise price of $8.00 per share (post-split). As of December 31, 2022 and 2021 the balance of the note was $100,000 and $100,000, respectively. As of the date of filing the loan is in default.\nOn May 2, 2017, the Company issued $50,000 of principal amount of 10% secured convertible promissory notes and 10,000 warrants to purchase common stock. The note was due on May 2, 2020 and is secured by the Companys accounts receivable and inventory. On April 22, 2020, the note was extended to May 2, 2021. The outstanding principal amounts and accrued but unpaid interest of the notes is convertible at any time at the option of the holder into common stock at a conversion price of $4 per share (post-split). The notes were issued with warrants to purchase up to 1,250 shares (post-split) of the Companys common stock at an exercise price of $8.00 per share (post-split). One December 31, 2021 the note was amended to cease accruing interest as of May 1,2022 and the due date of the note was amended to April 1, 2023. As of December 31, 2022 and 2021 the balance of the note was $45,000 and $50,000, respectively. As of the date of filing the loan was in default.\nOn May 22, 2017, the Company issued $5,000 of principal amount of 10% secured convertible promissory notes and 125 warrants (post-split) to purchase common stock at an exercise price of $8 (post-split). The note was due on May 22, 2020 and is currently in default secured by the Companys accounts receivable and inventory. The outstanding principal amounts and accrued but unpaid interest of the notes is convertible at any time at the option of the holder into common stock at a conversion price of $0.50 per share. The notes were issued with warrants to purchase up to 125 shares of the Companys common stock at an exercise price of $8.00 per share (post-split). As of December 31, 2022 and 2021 the balance of the note was $5,000 and $5,000, respectively.\nOn February 15, 2018, the Company issued a $75,000 12% secured convertible promissory note. The note was due on February 24, 2020 and is secured by the Companys accounts receivable and inventory. On April 22, 2020, the due date of the note was extended to February 15, 2021 for the issuance of 6,250 shares of common stock (post-split) valued at $8,995 and is currently in default. On February 22, 2022 the due date of the note was further extended to February 15, 2024. As of December 31, 2022 and 2021 the balance of the note was $75,000 and $75,000, respectively.\nOn February 8, 2019, the Company issued a $50,000 10% convertible note. The note was due on February 8, 2020 and is currently in default. As an incentive to enter into the agreement, the noteholder was also granted 7,500 shares valued at $30,000, which was recognized as a debt discount. As of December 31, 2022 and 2021 the balance of the note was $50,000 and $50,000, respectively.\nOn February 19, 2019, the Company issued a $25,000 4% convertible note. The note was due on August 19, 2019 and is convertible at a rate of $4 per share (post-split). On February 14, 2019, the noteholder agreed to extend the note through October 14, 2020. As an incentive to enter into the agreement, the noteholder was also granted 625 shares (post-split) valued at $2,500, which was recognized as a debt discount. As of December 31, 2021, the shares have not been issued and were included in stock payable. As of December 31, 2021, the note was shown net of unamortized discount of $0. As of December 31, 2022 and 2021 the balance of the note was $25,000 and $25,000, respectively. As of the December 31, 2022 the note was in default.\nOn November 19, 2019, the Company entered in to a $281,000 convertible note payable, including an original issue discount of $28,100 convertible promissory note pursuant to which $150,000 was borrowed, including a $18,500 discount during the year ended December 31, 2019. Interest under the convertible promissory note is 12% per annum, and the principal and all accrued but unpaid interest is due 180 days from funding, which has July 19, 2020 for the first tranche. On May 20, 2020, the noteholder agreed to extend the due date of the first tranche of funding until July 19, 2020 and is currently past due. On the date of default, the Company incurred a default penalty of 50% of the balance of the note amounting to $54,250. The note is convertible at the lesser of (i) 70% multiplied by the lowest Trading Price during the previous twenty-five (25) trading day period ending on the latest complete Trading Day prior to the date of the note and 70% of the market price with a floor of $0.01. As an incentive to enter into the agreement, the noteholder was also granted 53,375 shares (post-split) valued at $175,070. The Company analyzed the conversion feature and determined it was required to be bifurcated and recognized as a derivative liability. The derivative at inception was valued at $192,226, based on the Black Scholes Merton pricing model. As the fair value of the derivative and the shares issued at inception were in excess of the face amount of the note, the Company recorded a debt discount in the amount of $168,500 to be amortized utilizing the effective interest method of accretion over the term of the note. Further, the excess of $104,041 was recognized as a financing cost on the Statement of Operations. As of December 31, 2021, the Company paid the $60,000 toward the principal balance under the first tranche of $60,000. As of December 31, 2021, the fair value of the derivative liability associated with the note of $152,451 was reclassified to additional paid in capital. As of December 31, 2022, the debt discount has been amortized in full and the note was shown net of unamortized discount of $0. As of December 31, 2022 and 2021 the balance of the note was $162,750 and $162,750, respectively.\nOn May 5, 2020, the Company issued a $350,000 10% convertible note. The note is due on May 1, 2021 and is convertible at a rate of $1 per share (post-split). As an incentive to enter into the agreement the noteholder was also granted 187,500 shares (post-split) valued at $207,000, which was recognized as a debt discount. On April 21, 2021, the noteholder agreed to extend the note through May 1, 2022. As an incentive to enter into the agreement, the noteholder was also granted 12,500 shares (post-split) valued at $20,000, which was recognized as financing expense. On May 1, 2022, for the issuance of 75,000 shares valued at $87,000 on the date of commitment, the loan was further extended to May 1, 2024. As of December 31, 2022, the note was shown net of unamortized discount of $0. As of December 31, 2022 and 2021 the balance of the note was $350,000 and $350,000, respectively.\nOn January 6, 2021, the Company entered into a $275,000, 10% convertible note payable due January 6, 2022, including an original issue discount of $35,000. The note is convertible into shares of common stock equal to the closing bid price of common stock on the trading day immediately preceding the date of conversion. On February 7, 2021 and granted the noteholder an additional 122,857 shares of common stock (post-split) valued $167,086 and 19,000 five-year warrants exercisable at $1 (post-split) valued at $30,400. During the year ended December 31, 2022 the Company made payments totaling $30,382 in principal, and the balance of the loan as of December 31, 2022 and 2021 was $0 and $30,382, respectively.\nOn February 8, 2021, the Company entered into an agreement to consolidate two notes payable above dated September 17, 2018 and February 8, 2019 into one $100,000, 12% note due February 8, 2022. The note is convertible into shares of common stock at a conversion price of $0.80 per share (post-split). As consideration the Company issued the note holder 12,500 shares of common stock (post-split) valued at $20,000 which was recorded as financing expense. As of the December 31, 2021, the shares were not issued and included in stock payable. The Company evaluated the modification under ASC 470-50 and determined that the modifications were considered substantial and qualified for extinguishment accounting under such guidance. As such the Company recorded a loss on extinguishment of debt of $20,000 associated with the excess reacquisition cost of the new debt over the carrying value of the original debt. During the year ending December 31, 2022 the Company made principal payments totaling $5,000. As of December 31, 2022 and 2021 the balance of the note was $95,000 and $100,000, respectively.\nOn March 3, 2021, the Company issued a $25,000 4% convertible note. The note is due on March 3, 2022 and is convertible at a rate of $0.80 per share (post-split). For the year ended December 31, 2022, the Company recorded amortization of the debt discount of $1,700. As of December 31, 2022, the note was shown net of unamortized discount of $0. As of December 31, 2022 and 2021 the balance of the note was $25,000 and $25,000, respectively.\nOn June 15, 2021, the Company entered into a $10,000, 10% note payable due on December 15, 2021. The note is convertible at $0.80 per share (post-split). As an inducement to enter into the agreement the Company also granted the noteholder 6,875 shares of common stock (post-split). The issuance of the note and shares resulted in a discount from the beneficial conversion feature totaling $5,699, including $2,151 attributable to the conversion feature and $3,548 was attributable to the shares. As of December 31, 2022 and 2021, the note balance was $10,000 and $10,000 and was shown net of unamortized discount of $0 and $0, respectively.\nOn February 22, 2022 the Company entered into a $385,000, 12% note payable due on February 22, 2023. The note is convertible upon default at the higher of the closing price of the common stock on the closing date, or par value. As an inducement to enter into the agreement the Company also granted the noteholder 165,216 shares of common stock (post-split). The issuance of the note and shares resulted in a total debt discount of $158,147, with $123,147 attributable to the shares. During the year ending December 31, 2022 the Company made principal payments totaling $30,000. During the year ending December 31, 2022 $60,090 of the debt discount was amortized and the note is shown net of debt discount of $98,057. As of December 31, 2022 the balance of the note was $355,000.\nOn July 18, 2022, the Company entered into a $150,000 8% convertible grid note. The note is due on July 18, 2023 and is convertible at a rate of $0.80 per share (post-split). During the year ending December 31 2022 the Company received $38,200 in advances from the note. As of December 31, 2022 the balance of the note was $38,200.\nInterest expense including financing cost and amortization of the associated debt discount on all of the above convertible notes for the years ended December 31, 2022 and 2021 was $235,347 and $1,037,108, respectively.\nNOTE 8 - COMMITMENTS AND CONTINGENCIES\nOperating Lease Agreements\nThe Company determines whether or not a contract contains a lease based on whether or not it provides the Company with the use of a specifically identified asset for a period of time, as well as both the right to direct the use of that asset and receive the significant economic benefits of the asset. The Company elected the transition relief package of practical expedients, and as a result, we did not assess 1) whether existing or expired contracts contain embedded leases, 2) lease classification for any existing or expired leases, and 3) whether lease origination costs qualified as initial direct costs. We elected the short-term lease practical expedient by establishing an accounting policy to exclude leases with a term of 12 months or less.\nThe Company has entered into lease agreements as a lessee for the use of office space. These lease agreements are classified as operating leases and the liability and right-of-use asset are recognized on the balance sheet at lease commencement. Leases with an initial term of 12 months or less are not recorded on the balance sheet and are recognized as lease expense on a straight-line basis over the lease term. As a result of the adoption of ASC 842, the Company recognized an operating lease liability and right-of-use asset of $64,978.\nThe discount rate utilized for classification and measurement purposes as of the inception date of the lease is based on the Companys collateralized incremental interest rate to borrow of 12%, as the rate implicit in the lease is not determinable.\nDuring 2018, the Company executed a lease agreement. The lease term is 39 months at a rate of $1,680 per month with 3% increases beginning January 1, 2021 and rent commencing on January 1, 2019. The Company was required to pay a $1,781 security deposit. During the year ending December 31, 2022 the Company agreed to renew the lease through December 31, 2025.\nIn January 2019, the Company executed a lease agreement with Templar Asset Group, LLC, a related party. The lease term is one year at a rate of $4,200 per month for a period of one year with an option to continue a month-to-month basis thereafter. Under ASC 842, this lease is not recorded on the balance sheet as its term is 12 months or less.\nIn January 2020, the Company executed a lease agreement. The lease term is 17 months at a rate of $5,805 per month and rent commencing on March 1, 2022. The Company was required to pay a $5,805.33 security deposit.\nUndiscounted Cash Flows\nAs of December 31, 2022, the right of use asset and lease liability were shown on the consolidated balance sheet at $100,125 and $95,743, respectively. The table below reconciles the fixed component of the undiscounted cash flows and the total remaining years to the operating lease liability recorded on the consolidated balance sheet as of December, 2022:\nAmounts due as of December 31, 2022\nOperating Leases\n-\n63,693\n22,634\n21,886\nTotal minimum lease payments\n$ 108,213\nLess: effect of discounting\n(12,470 )\nPresent value of future minimum lease payments\n$ 95,743\nLess: current obligations under leases\n(44,520 )\nLong-term lease obligations\n$ 51,223\nLegal Matter\nOn July 6, 2020, we received a letter from the staff of the Division of Enforcement of the Securities and Exchange Commission (the Staff) that indicated the Company may have violated certain rules and regulations regarding a late filing notification filed by the Company and that the Staff is conducting an informal inquiry into the matter. On April 29, 2021, the Company agreed to pay civil penalties of $25,000 to the Securities and Exchange Commission in settlement of the matter. Payment shall be made in the following four installments: (1) $5,000 within 14 days of entry of the order; (2) $7,500 within 180 days of entry of the order; (3) $6,250 within 270 days of entry of the order; and (4) $6,250 within 360 days of entry of the order. As of December 31, 2022, $5,000 was paid and $20,000 remained due.\nNOTE 9 - STOCK WARRANTS\nThe following is a summary of stock warrants activity during the period ended December 31, 2022\nNumber of\nShares\nWeighted Average\nExercise Price\nBalance, December 31, 2021\n2,510,485\n$ 1.85\nWarrants granted and assumed\n-\n-\nWarrants expired\n-\n-\nWarrants canceled\n-\n-\nWarrants exercised\n-\n-\nBalance outstanding and exercisable, December 31, 2022\n2,510,485\n$ 1.85\nThe following is a summary of stock warrants activity during the period ended December 31, 2021.\nNumber of\nShares\nWeighted Average\nExercise Price\nBalance, December 31, 2020\n1,848,985\n$ 2.16\nWarrants granted and assumed\n1,144,000\n$ 1.00\nWarrants expired\n-\n-\nWarrants canceled\n-\n-\nWarrants exercised\n(482,500 )\n$ 1.00\nBalance outstanding and exercisable, December 31, 2021\n2,510,485\n$ 1.85\nNOTE 10 - INCOME TAXES\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. The Company recorded the valuation allowance due to the uncertainty of future realization of federal and state net operating loss carryforwards. The deferred income tax assets are comprised of the following at December 31, 2022 and 2021:\nDeferred income tax assets:\n$ 13,342,160\n$ 12,899,777\nValuation allowance\n(13,342,160 )\n(12,899,777 )\nNet deferred tax asset\n$ -\n$ -\nReconciliation between the statutory rate and the effective tax rate is as follows at December 31, 2022 and 2021:\nEffective Tax Rate Reconciliation:\nFederal statutory tax rate\n21.0 %\n21.0 %\nState taxes, net of federal benefit\n0.0 %\n0.0 %\nChange in valuation allowance\n(21.0 )%\n(21.0 )%\nEffective tax rate\n0.0 %\n0.0 %\nAs of December 31, 2022, the Company had net operating loss carryforwards of approximately $64,627,455 and net operating loss carryforwards expire in 2022 through 2030. The current years net operating loss will carryforward indefinitely, limited to 80% of the current year taxable income.\nThe current income tax benefit of $442,383 generated for the year ended December 31, 2022 was offset by an equal increase in the valuation allowance. The valuation allowance was increased due to uncertainties as to the Companys ability to generate sufficient taxable income to utilize the net operating loss carryforwards which is the only significant component of deferred taxes.\nThe Company recognizes interest and penalties related to uncertain tax positions in general and administrative expense. As of December 31, 2022 and 2021 the Company has no unrecognized uncertain tax positions, including interest and penalties.\nNOTE 11 - STOCKHOLDERS EQUITY\nThe Company is authorized to issue 10,000,000 shares of it $0.001 par value preferred stock and 150,000,000 shares of its $0.001 par value common stock. On October 26, 2020, the Board of Directors (the Board), authorized the Company to amend the Articles of Incorporation of the Corporation to increase the authorized capital stock of the Corporation to 160,000,000 shares, of which 150,000,000 shall be authorized as common shares and 10,000,000 shall be authorized as preferred shares. Additionally, the Board authorized the execution of a reverse split of the issued and outstanding shares of the Corporations common stock at a ratio of up to one post-split share per twenty-five pre-split shares (1:25) at a time and exact ratio amount the Board of Directors deems appropriate. On September 27, 2021, FINRA approved a 1-for-8 reverse stock split of the Companys common stock that was approved by the Companys Board of Directors. The Companys equity transactions have been retroactively restated to reflect the effect of the stock split.\nThe Company has also designated 76,000 shares of Series A Preferred Stock. Each share of Series A Preferred Stock is convertible, at any time, at the option of the holder, into five shares of our common stock and one warrant to purchase one share of our common stock at $1.00 per share. All Preferred Stock automatically converts into shares of the Companys common stock and warrants after three years from the original issue date of the Preferred Stock.\nDuring the year ended December 31, 2022 the Company issued 23,750 shares of common stock valued at $5,004 for services. Additionally, the Company agreed to issue 8,840,000 shares of common stock valued at $2,389,010 for services. As of December 31, 2022 the shares had not been issued.\nOn May 1, 2022, the Company issued 75,000 shares of common stock (post-split) valued at $87,000 to extend a certain note payable dated May 1, 2020.\nOn May 2, 2022, the Company issued 12,500 shares of common stock (post-split) valued at $14,500 to extend a certain note payable dated May 2, 2017.\nOn June 1, 2022, the Company agreed to issue 100,000 shares (post-split) valued at $116,000 to extend a certain note payable dated February 2, 2018. As of December 31, 2022 the shares had not yet been issued.\nOn November 30, 2022 the Company agreed to issue 115,973 shares of common stock valued at $27 to extend a certain note payable dated November 12, 2021. As of December 31, 2022 the shares had not been issued.\nOn February 22, 2022 the Company entered into a $385,000, 12% note payable due on February 22, 2023. The note is convertible upon default at the higher of the closing price of the common stock on the closing date, or par value. As an inducement to enter into the agreement the Company also granted the noteholder 165,216 shares of common stock valued at $123,147 (post-split).\nOn December 15, 2022 the Company agreed to issue 90,000 shares of common stock valued at $23 to settle $18,000 of accrued interest owed to a note holder. As of December 31, 2022 the shares had not been issued.\nOn January 24, 2022 the Company completed the spin-off of its subsidiary Notation Labs Inc into a stand-alone publicly traded company. On August 20, 2020 each holder of the common stock received one share of Notation labs, Inc common stock for every four shares of the Companys common stock held at the close of business on December 10, 2021, the record date of the distribution. As a result of the spin-off the Notation Labs financials were deconsolidated from those of the Company and an increase of $391,441 in accumulated deficit was recorded.\nOn August 1, 2022 the Company received and cancelled 126,440 shares of common stock valued at $158,050 that had previously been issued as commitment shares for a note payable.\nDuring the year ending December 31, 2022 126 shares of the Companys common stock was cancelled as rounding shares.\nDuring the year ending December 31, 2022 imputed interest of $19,595 was recorded as additional paid in capital.\nNOTE 12 - SUBSEQUENT EVENTS\nOn April 6, 2023, the Company was served a Summons for an Amended Complaint filed in the state of Florida with claims for Strict Liability, Negligence and Breach of Implied Warranty. The complaint, filed by an insurance company, stems from its payments for claims filed by a policy holder on two separate occasions. The first claim was due to a leak caused by improper installation in which the contractor failed to meet local codes. The second followed the contractors failure to properly repair the improper installation. The complaint states that the contractor failed to follow basic installation guidelines supplied with the product in either incident, resulting in damages. The Company believes the claims related to the Company and its products are without merit.\nOn March 29, 2023 the Company issued 205,973 shares of the Companys common stock as an incentive for a certain notes dated November 12, 2021.\nOn May 3, 2023 the Company issued 84,400 shares of the Companys common stock as an incentive for a certain convertible note dated July 18, 2022.\nOn February 8, 2023 the noteholder of a certain note issued on February 8, 2021 agreed to extend the maturity date of the note to February 8, 2024.\nOn February 13, 2023 the noteholder of a certain note issued on February 22, 2022 agreed to extend the maturity date of the note to December 31, 2023. As consideration the Company agreed to make seventeen payments of $30,000\nOn May 3, 2023 the Company issued 2,200,000 of the Companys common stock for services.\nOn June 5, 2023, the Company entered into a $150,000 12% convertible promissory note. The note is due on December 31, 2024 and is convertible at a rate of $0.02 per share. On June 15, 2023, the Company issued 5,538,333 shares of the Companys common stock to convert $110,767 of the balance.\nOn May 2, 2023 the noteholder of a certain note issued on May 2, 2017 agreed to extend the maturity date of the note to May 2, 2024. As consideration for the extension, the Company agreed to increase the interest rate to 12% and to issue the noteholder 12,500 shares of common stock.\nOn July 13, 2023, the Company issued 2,354,986 shares of the Companys common stock to convert $42,200 of the balance of a certain convertible note dated July 18, 2022.\nOn July 15, 2023, we announced the Companys intention to spin-off its wholly-owned subsidiary, Tankless365, Inc. whereby each shareholder having common stock as of the distribution date will be entitled to receive shares of the common stock of Tankless365, Inc. pro rata based on a 4:1 ratio. The press release was attached as an exhibit to the Companys 8-K filed with the SEC on July 19, 2023.\nOn July 25, 2023, the Company entered into a $85,000 12% convertible promissory note. The note is due on December 31, 2024 and is convertible at a rate of $0.02 per share.\nOn July 31, 2023, the Company issued 1,200,954 shares of the Companys common stock to convert $80,143 of the balance of accrued interest on a certain convertible note dated May 2, 2017.\nOn August 7, 2023, the Company issued 2,285,031 shares of the Companys common stock to convert of the balance certain convertible note dated July 18, 2022.\nOn August 7, 2023 the Company issued 800,000 of the Companys common stock for services.\nOn August 16, 2023 the Company issued 2,742,176 of the Companys common stock for services.\nOn August 17, 2023 the Company issued 300,000 of the Companys common stock for services.\nOn August 25, 2023 the Company issued 62,500 of the Companys common stock for services.\nOn August 29, 2023 the Company issued 431,400 of the Companys common stock for services.\nOn August 30, 2023 the Company issued 100,000 of the Companys common stock for services."
}