{
    "cik": "1434740",
    "company": "Ranger Gold Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-11-21",
    "period_of_report": "2023-03-31",
    "sic": "1040",
    "state_of_inc": null,
    "state_location": "NY",
    "fiscal_year_end": "0331",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1434740/0001477932-23-008723-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1434740/000147793223008723/rngr_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1434740/0001477932-23-008723.txt",
    "filename": "1434740_10K_2023_0001477932-23-008723.htm",
    "content": "ITEM 1. BUSINESS\nGeneral\nHistory\nRanger Gold Corp. (we, us, or the Company) was incorporated on May 11, 2007 under the laws of the State of Nevada under the name Fenario, Inc. The Company was formed to develop and license proprietary software solutions for healthcare providers, health care professionals and health insurance companies. The Company did not conduct substantive operations but filed a registration statement with the SEC by which it registered all then outstanding shares of common stock and became subject to the reporting requirements of the Securities Exchange Act of 1934, as amended (the Exchange Act).\nIn 2009, the founder of the healthcare software business transferred his interest in the Company to a third party who shifted the Companys focus to mining activities. From 2009 to 2018, the Company acquired rights to mining properties in the western United States but never engaged in mining operations.\nThe Company discontinued filing reports under the Exchange Act, after the filing of its quarterly report on Form 10-Q for the period ended December 31, 2013.\nOn December 26, 2018, the Company filed a Certificate of Reinstatement with the State of Nevada to reestablish the Companys existence.\nOn January 8, 2019, the Eight Judicial District Court of Nevada entered an order appointing Bryan Glass as custodian of the Company, authorizing him to, among other things, convene a meeting of stockholders.\nOn January 14, 2019, the Company appointed Bryan Glass to serve as an interim director and as our President, Secretary and Treasurer and authorized the issuance of 200,000,000 shares of stock to Mr. Glass in consideration for services rendered valued at $20,000.\nOn February 7, 2019, the Company held a stockholders meeting at which Mr. Glass was elected as the sole director of the Company.\nOn October 12, 2019, the Company filed a Form 15 with the SEC terminating the registration of its class of common stock under Section 12(g) of the Exchange Act and its duty to file periodic and other reports with the SEC.\nIn August 2022, the Companys registration statement on Form 10 became effective under the Exchange Act.\nAs of the date of this Annual Report, Mr. Glass serves as our only director and officer.\nBusiness Strategy\nGeneral\nWe are a natural resource company with an objective of acquiring, exploring and developing natural resource properties in the United States. For purposes of this Annual Report, the term acquire means the outright purchase of property or the lease, license, claim (whether patented or unpatented) or other use agreement which provides us the real property rights, other interests in land, including mining and surface rights, easements, and rights of way and options to conduct mining operations on real property. We may acquire, develop and operate mining properties either alone or with partners. We are continuing the mining business strategy adopted by prior management of the Company. Our primary focus in the natural resource sector is gold, though we may acquire rights to properties that may have reserves of other types of minerals. The Company currently does not hold rights in any mining properties and does not engage in any substantive business operations or generate revenue from any sources. The search for valuable natural resources as a business is extremely risky and capital-intensive. Our ability to achieve our objective is predicated on our receipt of financing to fund our operations. We can provide investors with no assurance that we will obtain financing to commence operations and acquire a property or that we will produce commercially exploitable reserves from any property we may acquire.\nUnder rules adopted by the SEC in 2018 with respect to technical disclosure requirements applicable to companies engaged in mining operations, we are deemed to be an exploration stage mining company because we do not own any material property with mineral reserves. Typically, an exploration stage mining company is focused on exploration to identify new, commercially viable mineral deposits. As required under SEC guidelines and U.S. generally accepted accounting principles, or GAAP, expenses incurred in operations of companies in the exploration stage, including investments in mining properties, exploration expenditures, construction and other costs, are required to be expensed as incurred and will not appear as assets on our balance sheet. We will not exit the exploration stage until such time that we demonstrate the existence of proven or probable reserves that meet SEC guidelines. Further, unless mineralized material is classified as proven or probable reserves, substantially all expenditures for mine exploration and construction will continue to be expensed as incurred.\nAs described elsewhere throughout this Annual Report, our business and strategy are speculative and subject to many risks, including our lack of capital; the absence of employees or consultants that have any experience in the mining industry; the substantial risks associated with mining operations; environmental factors; competitive risks; and regulatory risks, among others. We expect significant regulatory changes to the mining industry and the laws regulating the industry, especially environmental laws. We urge investors to review the risks pertaining to our business carefully before investing in our Company.\nIndustry Background\nThe process of finding or exploring for a mineral deposit, extracting or mining the resource, recovering the resource, also known as beneficiation, and reclaiming the land mined can be described as the life cycle of a mineral deposit. The complete process is time consuming and expensive, requiring the use of modern technology and equipment, and may take many years to complete. Occasionally, one entity or company completes the entire process from discovery to reclamation, but often it requires multiple groups with specialized experience working together.\nThe U.S. government values the mining industry for its production of domestic raw materials and strategic minerals, and high-wage jobs. Federal, state and local governments receive billions of dollars annually in taxes, royalties and fees from the mining industry. According to the Mineral Commodity Summaries 2021 published by the U.S. Geological Survey, or USGS, in 2020, U.S. mines produced approximately $82.3 billion in nonfuel mineral commodity production, including industrial minerals and natural aggregates as well as ferrous and nonferrous metals. U.S. metal mine production in 2020 was estimated to be $27.7 billion, 3% higher than in 2019. The principal contributors to the total value of metal mine production in 2020 were gold (38%), copper (27%), iron ore (15%) and zinc (6%).\nThe exploration for and development of mineral deposits is capital intensive and may extend over a long identification, development and production horizon. Few properties are ultimately developed into producing mines. To the extent that we identify a property with proven reserves, we may enter into joint ventures with mid-tier and large senior mining companies to develop the property or sell or lease the property to a major mining company, which could provide a nearer term return on investment for our Company and stockholders and provide us with capital to fund future operations.\nSources of Available Land for Mining and Exploration\nThere are several primary sources of land available for exploration, development and mining in the U.S. These include public lands, which may give rise to unpatented mining claims and patented mining claims; private fee lands, and tribal lands. The primary sources for acquisition of public lands are the United States government, through the Bureau of Land Management, or BLM, and the United States Forest Service, or USFS, tribal governments, and individuals or entities that currently hold title to or lease government and private lands.\nIn the United States, the federal government owns public lands that are administered by the BLM or the USFS. Under the General Mining Law of 1872, as amended (the General Mining Law), a person could acquire ownership of the subsurface mineral estate by staking a mining claim. Such claims could become patented claims or remain unpatented claims.\nPatented mining claims are claims that were staked on federal (public) lands under the General Mining Law, and through application and approval, the owners were granted full private ownership of the surface and subsurface estate by the passage of title from the federal government to the claimant, making it private land. A mineral patent gives the owner exclusive title to the locatable minerals. It also gives the owner title to the surface and other resources. Companies like ours can acquire these lands for exploration and mining by leasing or purchasing it from the owners. Purchasing or leasing a patented mining claim provides the same benefits as any other privately-held real property owner. Generally, there are no restrictions on the use of the land unless other than as imposed on the property by other laws. In 1994, Congress imposed a moratorium on any new mineral patent applications, leaving unpatented mining claims as the primary method by which new mining rights may be acquired on federal lands.\nAn unpatented mining claim is a particular parcel of federal land for which an individual has asserted a right of possession, that is, has staked a claim under the General Mining Law, and that is valuable for a specific mineral deposit or deposits. The federal government continues to own the surface estate, while the subsurface is controlled by the claimant giving him or her a right to extract and develop mineral deposits. The rights granted by an unpatented mining claim are valid against a challenge by the United States and other claimants only after the discovery of a valuable mineral deposit. Subject to federal and state statutory and regulatory requirements, the owner of a valid unpatented mining claim or mill site (a location of nonmineral land that is not contiguous to a mineral deposit that can be used for activities reasonably related to mineral development on, or production from, the claim with which it is associated) has the exclusive right to use and possess the property for mining purposes and to develop and sell the mining products from such claim free of any royalty to the federal government. An unpatented claim owner can hold the claim as long as he or she likes for an annual assessment fee or, in some circumstances, by performing annual assessment work on the claim.\nPrivate fee lands are lands that are controlled by fee-simple title (in which the land is owned without any limitations or conditions) by private individuals or corporations. These lands can be controlled for mining and exploration activities by either leasing or purchasing the surface and subsurface rights from the private owner.\nTribal lands are those lands that are under the control of sovereign Native American tribes. Areas that show promise for exploration and mining can be leased from or joint ventured with the tribe controlling the land.\nTypes of Mine Claims and Mining Activities\nThere are two types of mining claims, lode and placer. Lode claims include classic veins or lodes having well-defined boundaries. They also include other rock in-place bearing valuable minerals and may be broad zones of mineralized rock. Examples include quartz or other veins bearing gold or other metallic minerals and large volume but low-grade disseminated metallic deposits. Placer claims comprise all mineral deposits not subject to lode claims. Originally, these included only deposits of unconsolidated materials, such as sand and gravel, containing free gold or other minerals, such as river beds.\nThe primary methods used to extract minerals from the ground include:\n·\nUnderground mining - which is employed when minerals are deep below the surface and involves digging a main shaft, with parallel shafts allowing the maximum extraction of minerals.\n·\nOpencut or opencast mining - which involves the removal of surface topsoil, vegetation, and rock to allow excavation of shallow underground mineral seams and generally allows a greater proportion of the mineral deposit to be extracted compared to underground mining.\n·\nAlluvial or placer mining - which involves excavation of stream beds, often down to the bedrock, to sift out gold washed into streams from surrounding mountains.\nThe location and shape of the deposit, strength of the rock, ore grade, mining costs, and current market price of the commodity are some of the determining factors for selecting which mining method to use.\nHigher-grade metallic ores found in veins deep under the Earths surface can be profitably mined using underground methods, which tend to be more expensive. Large tabular-shaped ore bodies or ore bodies lying more than 1,000 feet below the surface are generally mined underground as well. The rock is drilled and blasted, then moved to the surface by truck, conveyor belt or elevator. Once at the surface, the material is sent to a mill to separate the ore from the waste rock.\nLower grade metal ores found closer to the surface can be profitably mined using surface mining methods, which generally cost less than underground methods. Many industrial minerals are also mined this way, as these ores are usually low in value and were deposited at or near the Earths surface. In a surface mine, hard rock must be drilled and blasted, although some minerals are soft enough to mine without blasting.\nPlacer mining is used to recover minerals from sediments in present-day river channels, beach sands, or ancient stream deposits. More than half of the worlds titanium comes from placer mining of beach dunes and sands. In placer operations, the mined material is washed and sluiced to concentrate the heavier minerals.\nSourcing Deals\nThere are many resources from which to source and evaluate potential mining properties, including online directories of mining properties and claims for sale. We may place claims wanted ads in appropriate industry journals and publications. We also expect to consult with industry professionals and geologists for leads for properties.\nProperties listed for sale on the various internet sites provide varying degrees of information about the property. Some listings provide detailed geological reports and mining histories, including the location, size and scope of the property; the type of the minerals historically extracted; the types of permits that have been issued, if any; the amounts extracted over a given time period; the amount of minerals extracted per ton mined; the extent of development of mining operations, such as the existence of mill sites and other buildings erected at the site; ownership provenance of the property; and other geological, environmental and legal features pertinent to the site. This information allows an interested party to prescreen prospective properties that fall within its acquisition criteria.\nIn all events, prior to acquiring a property, we will engage qualified consultants to conduct the due diligence required to evaluate and appraise a site, as more fully described below under the heading -Due Diligence.\nOur Interest in Mineral Producing Properties\nOur interest in mining properties may take many forms. The nature and percent of the interest we acquire will depend on several variables, including the amount of capital we possess when an opportunity is presented to us, the amount of risk we are prepared to tolerate with respect to a specific property and our investment objective, such as, if we are seeking to diversify our asset base and reduce enterprise risks. We will conduct technical due diligence with respect to any property prior to acquiring it outright or acquiring an interest in it, as described below.\nWe may elect to acquire or lease a property either alone or in a joint venture with a partner. The acquisition or lease may pertain to private lands (patented mining claims) or unpatented mining claims. Frequently, the parties enter into leases with an option to purchase it. Some leases have a stated primary term and are extended by mining operations or production, while others have a fixed term and are renewable. There is no standard form of mining lease for privately held property and the terms and conditions of mining leases vary greatly.\nProvisions of particular importance in negotiation of a lease of a mining property lease include:\n·\nmineral(s) covered by the lease, those reserved by the lessor, and provisions relating to conflicting development;\n·\nterm of the lease;\n·\nproduction royalties payable to the lessor;\n·\nminimum royalties, if any, payable to the lessor, and crediting of minimum royalties against production royalties;\n·\nrestrictions on mining methods allowed; and\n·\nprovision that requires the lessors consent in connection with assignment or sublease.\nDue Diligence\nThe purpose of due diligence in the mining industry is to assess the economic feasibility of developing a potential property or project. Ultimately, the determination to develop a property compares the net present value of the estimated reserves against all of the costs incurred to extract the resource across the life cycle of project, commencing with the calculation of reserve estimates and concluding with costs associated with mine closure and land reclamation. Ascertaining both the value of the resource and the costs to extract the resource require significant technical due diligence conducted by seasoned professionals.\nDue diligence aims to identify project risks and the means to mitigate or eliminate the risks, and maximize economic opportunities. Risks associated with mining projects include ownership and control of land rights and the ability of the mining company to control its property related assets; the level and extent of the geological understanding on the property; the ability to economically extract the mineral from the ore body; the ability to economically recover and process the mineral from the ore; public and private infrastructure requirements of the project; the ability to supply product consistently according to the market requirements and specifications; risks related to demand and price; market volatility; risks associated with the performance of the management team; risk associated with capital and operational cost; and risks associated with temporary and permanent environmental impacts that will be caused by the operation, including environmental restrictions, regulations and community relations.\nOur due diligence efforts will seek to identify, examine and resolve the conditions underlying the associated risks in ways that allow us to develop a property. However, even a thorough due diligence investigation of a property may not identify all of the risks associated with a project or allow a developer to mitigate or eliminate all risks. Geology is an inexact science and many properties upon which exhaustive due diligence has been undertaken encounter unusual or unexpected geological formations and other problems and conditions that result in unsuccessful development efforts. To the extent that we expend capital resources on properties that do not yield commercially exploitable reserves, including expenses we incur in connection with conducting due diligence, our ability to achieve our objectives and earn a return for our stockholders will be compromised.\nTypically, due diligence begins with a desktop analysis of available resources and information, followed by fieldwork where an assessment is made of resources and reserves, mineability, equipment selection, productivity, capital expenditures, operating expenditures, the operational organization (team and organization); environmental, safety and security; audit of process systems, and equipment. We will engage geologists and other mining consultants and teams to conduct these activities and to undertake an on-site analysis of the property and assess the likelihood of mineral reserves on a property.\nWe expect to acquire a property for which permits, a mining plan and historical information exists and about which at least some geological, geochemical and geophysical information is available. Such a property may be sold in tact with a full camp, including living quarters, mill sites, water pumps and tanks, and mining equipment, such as excavators, bulldozers, sluice boxes, conveyors and generators. We will review historical data compiled by groups that previously have mined the property, as well as any geological reports, plans, cross sections and other data. In addition, we expect to review topographic, geologic and hydrographic maps and data produced by the USGS and other research and assessments it generates that focus on the location, quantity, and quality of mineral resources, including the economic and environmental effects of resource extraction and use. These resources are generally available to the public without charge.\nNotwithstanding the quality and quantity of information about a property available to us, we expect to conduct fieldwork to substantiate and complete our analysis. Foremost among a fieldwork due diligence investigation is the evaluation of project geology and resource reserve estimation. Project geology will include, among other things, an examination of mineral exposures and drill or core samples. The review is intended to confirm the validity of the interpretation of the origination and extent of the extractable mineral resources on the property.\nThe SEC defines a mineral resource as a concentration or occurrence of material of economic interest in or on the Earth's crust in such form, grade or quality, and quantity, that there are reasonable prospects for economic extraction. Resource and reserve analysis are estimated across three categories of increasing accuracy: inferred to indicated to measured. Mineral/ore reserves are the part of the mineral resource which could be mined and from which valuable minerals could be recovered and may be evaluated across two categories of increasing accuracy: probable to proved. A probable mineral reserve is defined under SEC rules as the economically mineable part of an indicated and, in some cases, a measured mineral resource; whereas a proven mineral reserve is defined under SEC rules as the economically mineable part of a measured mineral resource and can only result from conversion of a measured mineral resource. Reserves are derived from the resources by application of factors for economics, mining, metallurgy, marketing, legal, social issues, environmental controls and government acts. Mineral reserves are the key guideline for determining whether a mining project is financeable. Accordingly, determining probable mineral reserves will be the initial and most important exercise we undertake. We expect to engage one or more qualified persons (as defined by the SEC) to undertake these analyses and prepare the technical reports which we may include in our periodic and other filings with the SEC.\nWe also will undertake due diligence relating to the target property to ensure that we will acquire all of the rights required to engage in mining operations. Such due diligence may include:\n·\na review of ownership matters, including title issues and document recordation, whether there are any mineral reservations or royalty obligations;\n·\nidentification of existing easements and rights of way across private and public lands, including, for roads, electrical transmission lines and water pipelines;\n·\na review of financial matters, including conducting a lien, tax and judgment search to determine if there any obligations or liens encumbering the property or whether there are there any existing or pending legal actions or judgments of record against the landowner filed in county or federal courts;\n·\nverification of water rights and the identity of any prior, superior rights;\n·\nwith respect to unpatented mining claims, a determination of whether the public domain land was open for location when the claims were located, the identity of the locator(s) of the claim(s), whether all filings were correctly made and whether all fees timely paid, whether any conflicts exist with third party claims, and whether there are any multiple uses or limitations of activities on U.S. lands, such as grazing permits or wildlife considerations, that will interfere with activities on the subject properties; and\n·\na review of state, local and federal permits, including those for mine plans, rights of way, easements, and environmental concerns and whether there are any restrictions or zoning requirements that may impede operations.\nAs we receive information from our due diligence examination, we expect that we will undertake an economic review of the viability of the project on the target property, which will include an assessment of whether the net present value of reserves exceeds the costs of mining, including regulatory and environmental compliance and mine closure and land reclamation costs.\nPlan of Operation\nNatural resource exploration and development requires significant capital and our current assets and resources are insufficient to acquire any properties or fund any mining operations. Accordingly, our principal initial objective will be to raise sufficient capital to acquire an attractive mining property. We can offer no assurance that we will be successful raising any capital to fund our operations. Mr. Glass, our sole officer and director and our principal stockholder, has funded our operations since January 2019 and we currently are dependent on him entirely to fund our operations until we raise the capital to identify and acquire a mining property, if ever. Though Mr. Glass has advised us of his present intention to fund our operations through loans or further investment in the Company, there is no written agreement binding him to do so. In the even that Mr. Glass does not fund our capital requirements, we may not be able to continue operations and stockholders could lose the entire amount of their investment in our Company.\nIt is our intention to engage in mining operations as opposed to acquiring a passive interest in an existing enterprise. Mining operations includes identifying an appropriate property, conducting technical due diligence with respect to such property and undertaking extraction operations, if warranted. We do not expect to engage in exploration for properties but rather we expect to acquire a property for which permits, a mining plan and historical information exists and about which at least some geological, geochemical and geophysical information is available. If we identify a property that our due diligence reveals may possess reserve potential that we are unable to acquire or develop on our own by reason of our limited resources, we may enter into a joint venture with one or more partners to develop a property. We may buy and sell properties in any phase of development to maximize earnings, including before we commence producing on a property. We expect to retain geologists, consultants, mining and operations specialists and other personnel as necessary and warranted to assess resource and reserve analysis, mineability and to conduct mining operations.\nCompetition\nThe precious metal mining industry is intensely competitive and is dominated by a few very large companies with global operations and a fragmented range of other mining companies of varying sizes and in varying stages of development, exploration and production, all of which are constantly pursuing discoveries of large mineral deposits. Frequently, smaller companies partner with larger, better capitalized companies to develop and bring properties into production.\nThere is aggressive competition within the mining industry at all levels to:\n·\ndiscover and acquire mineral properties considered to have commercial potential;\n·\nsecure financing for exploration and development efforts; and\n·\nrecruit and retain qualified personnel, including technical experts, operations specialists and other mining employees.\nWe are an exploration stage mineral resource exploration company that currently has no assets. Virtually all of the companies against which we will compete have greater financial, personnel and technical resources than we do. In addition, our competitors may have more extensive relationships than we have, including with potential strategic partners with which to joint venture in the development of properties. Accordingly, these competitors may be able to acquire, explore and develop more valuable properties than we can, retain more highly qualified employees than we can, and have access to greater capital on better terms than is available to us.\nGiven the significant competition for properties, capital and personnel, we may be unable to compete effectively.\nGovernment Regulation\nGeneral\nThe mining industry is subject to extensive federal, state and local laws governing the protection of the environment, prospecting, development, production, mine closure, taxes, labor standards, occupational health, mine safety, toxic substances, protection of endangered species and other matters. The costs to comply with such regulatory requirements are substantial and possible future legislation and regulations could cause additional expenses, capital expenditures, restrictions and delays in the development and continued operation of any properties that we acquire, the extent of which cannot be predicted. Many of the regulations require us to obtain permits or licenses and to file notices of intent and plans of operations, the absence of which or inability to obtain would adversely affect our ability to conduct exploration and development activities and otherwise operate. The failure to comply with the regulations and terms of permits and licenses may result in fines or other penalties or in revocation of a permit or license or loss of a prospect. If we were to acquire a property outside the United States, similar laws and regulations enacted in the jurisdiction where the property is located would govern our business and operations.\nEnvironmental Regulation\nOur mining projects will be subject to various federal, state and local laws and regulations governing protection of the environment. These include the United States Environmental Protection Agency (EPA) and the BLM as well as the various state environmental protection agencies. These laws are continually changing and, in general, are becoming more restrictive. The development, operation, closure, and reclamation of mining projects in the United States requires numerous notifications, permits, authorizations, and public agency decisions. Compliance with environmental and related laws and regulations will require us to obtain permits issued by regulatory agencies, and to file various reports and keep records of our operations. Certain of these permits require periodic renewal or review of their conditions and may be subject to a public review process during which opposition to our proposed operations may be encountered.\nThe Comprehensive Environmental, Response, Compensation, and Liability Act (CERCLA) and comparable state statutes, impose strict, joint and several liability on current and former owners and operators of mining sites and on persons who disposed of or arranged for the disposal of hazardous substances found at such sites. It is not uncommon for the government to file claims requiring cleanup actions, demands for reimbursement for government-incurred cleanup costs, or natural resource damages, or for neighboring landowners and other third parties to file claims for personal injury and property damage allegedly caused by hazardous substances released into the environment. The Federal Resource Conservation and Recovery Act (RCRA) and comparable state statutes govern the disposal of solid waste and hazardous waste and authorize the imposition of substantial fines and penalties for noncompliance as well as requirements for corrective actions. CERCLA, RCRA and comparable state statutes can impose liability for clean-up of sites and disposal of substances found on exploration, mining and processing sites long after activities on such sites have been completed.\nThe Clean Air Act, as amended (CAA), restricts the emission of air pollutants from many sources, including mining and processing activities. Any mining operations by the Company may produce air emissions, including fugitive dust and other air pollutants from stationary equipment, storage facilities and the use of mobile sources, such as trucks and heavy construction equipment, which are subject to review, monitoring and/or control requirements under the CAA and state air quality laws. New facilities may be required to obtain permits before work can begin, and existing facilities may be required to incur capital costs in order to remain in compliance. In addition, permitting rules may impose limitations on our production levels or result in additional capital expenditures in order to comply with the rules.\nThe National Environmental Policy Act (NEPA) requires federal agencies to integrate environmental considerations into their decision-making processes by evaluating the environmental impacts of its proposed actions, including issuing permits to mining facilities and assessing alternatives to those actions. If a proposed action could significantly affect the environment, the agency must prepare a detailed statement known as an Environmental Impact Statement (EIS). The EPA, other federal agencies, and any interested third parties will review and comment on the scoping of the EIS and the adequacy of and findings set forth in the draft and final EIS. This process can cause delays in issuance of required permits or result in changes to a project to mitigate its potential environmental impacts, which can in turn impact the economic feasibility of a proposed project.\nThe Clean Water Act (CWA), and comparable state statutes, impose restrictions and controls on the discharge of pollutants into waters of the United States. The discharge of pollutants into regulated waters is prohibited, except in accordance with the terms of a permit issued by the EPA or an analogous state agency. The CWA regulates storm water discharge permit for certain activities. Such a permit requires the regulated facility to monitor and sample storm water run-off from its operations. The CWA and regulations implemented thereunder also prohibit discharges of dredged and fill material in wetlands and other waters of the United States unless authorized by an appropriately issued permit. The CWA and comparable state statutes provide for civil, criminal and administrative penalties for unauthorized discharges of pollutants and impose liability on parties responsible for those discharges for the costs of cleaning up any environmental and natural resource damages resulting from the release.\nThe Safe Drinking Water Act (SDWA) and the Underground Injection Control (UIC) program promulgated thereunder, regulate the drilling and operation of subsurface injection wells. The EPA directly administers the UIC program in some states and in others the responsibility for the program has been delegated to the state. The program requires that a permit be obtained before drilling a disposal or injection well. Violation of these regulations and/or contamination of groundwater by mining related activities may result in fines, penalties, and remediation costs, among other sanctions and liabilities under the SWDA and state laws. In addition, third party claims may be filed by landowners and other parties claiming damages for alternative water supplies, property damages, and bodily injury.\nChanges to current local, state or federal laws and regulations in the jurisdictions where we operate could increase capital expenditures and increased operating and/or reclamation costs. Although we are unable to predict what additional legislation, if any, might be proposed or enacted, additional regulatory requirements could impact our ability to acquire and develop projects.\nEmployees\nWe have one executive officer who has other business interests and who is not obligated to devote any specific number of hours to our matters. He intends to devote only as much time as he deems necessary to our affairs. The amount of time our officer will devote to our affairs in any time period will vary based on our activity level during such period. For example, as we seek to raise the capital to acquire a property, our officer will expend more time on our business. Likewise, if we raise capital, our officer will spend more time selecting a property and retaining consultants. Accordingly, if and when management identifies a suitable property to acquire, we expect that our management will spend more time investigating such property and will devote additional time and effort negotiating and processing the acquisition of a target property as developments warrant.\nOur management may engage in other business activities similar and dissimilar to those we are engaged in without any limitations or restrictions. To the extent that our management engages in such other activities, there will be possible conflicts of interest in diverting opportunities which would be appropriate for our Company to other entities or persons with which our management is associated or has an interest, rather than offering such opportunities to us. Since we have not established any policy for the resolution of such a conflict, we could be adversely affected should our officer/director choose to place his other business interests before ours. We cannot assure you that such potential conflicts of interest will not result in the loss of potential opportunities or that any conflict will be resolved in our favor.\nWe do not intend to have any full-time employees until we acquire a mining property.\nSmaller Reporting Company Status\nWe qualify as a smaller reporting company under Rule 12b-2 of the Exchange Act, which is defined as a company with a public equity float of less than $250 million or it has less than $100 million in annual revenues and no public float or public float of less than $700 million. To the extent that we remain a smaller reporting company, we will have reduced disclosure requirements for our public filings, including: (1) less extensive narrative disclosure than required of other reporting companies, particularly in the description of executive compensation and (2) the requirement to provide only two years of audited financial statements, instead of three years. In addition, until such time as the public float of our common stock exceeds $75 million, we will be a non-accelerated filer and will not be required to comply with the auditor attestation requirements of Section 404(b) of the Sarbanes Oxley Act.\nRamifications of Our Status as a Shell Company\nWe are a shell company as defined in Rule 405 promulgated by the SEC under the Securities Act. A shell company is one that has no or nominal operations and either: (i) no or nominal assets; or (ii) assets consisting primarily of cash or cash equivalents. As a shell company, we are subject to various laws, regulations and restrictions, including that we will be subject to restrictions on our use of Form S-8 to register stock that we may issue to our employees and consultants and our stockholders will be subject to restrictions from relying on Rule 144 for the resale of your common stock, as described below.\nShell companies are prohibited from using Form S-8 to register securities under the Securities Act. If a company ceases to be a shell company, it may use Form S-8 sixty calendar days after the date on which it makes required filings with the SEC disclosing the cessation of its status as shell company, provided it has filed all reports and other materials required to be filed under the Exchange Act during the preceding 12 months (or for such shorter period that it has been required to file such reports and materials after the company files Form 10 information, which is information that a company would be required to file in a registration statement on Form 10 if it were registering a class of securities under Section 12 of the Exchange Act. This information would normally be reported on a current report on Form 8-K reporting the completion of a transaction that caused the company to cease being a Shell Company.\nRule 144 under the Act provides an exemption from the registration requirements of the Securities Act and allows the holders of restricted securities to sell their securities utilizing one of the provisions of this Rule. However, Rule 144 specifically precludes reliance by holders of securities of shell companies such as ours or any issuer that has been at any time previously a shell company, except if the following conditions are met:\n·\nThe issuer of the securities that was formerly a shell company has ceased to be a shell company;\n·\nThe issuer of the securities is subject to the reporting requirements of Section 13 or 15(d) of the Exchange Act;\n·\nThe issuer of the securities has filed all Exchange Act reports and material required to be filed, as applicable, during the preceding 12 months (or such shorter period that the issuer was required to file such reports and materials), other than current reports on Form 8-K; and\n·\nAt least one year has elapsed from the time that the issuer filed current comprehensive disclosure with the SEC reflecting its status as an entity that is not a shell company.\nAs a result of our classification as a shell company, our investors are not permitted to rely on the safe harbor provisions of Rule 144, promulgated pursuant to the Securities Act, so as not to be considered underwriters in connection with the sale of our securities until one year from the date that we cease to be a shell company. This will likely make it more difficult for us to attract additional capital through subsequent unregistered offerings because purchasers of securities in such unregistered offerings will not be able to resell their securities in reliance on Rule 144, a safe harbor on which holders of restricted securities usually rely to resell securities. ITEM 1A. RISK FACTORS\nAs a smaller reporting company, as defined by Rule 12b-2 of the Exchange Act and Item 10(f)(1) of Regulation S-K, the Company has elected to comply with certain scaled disclosure reporting obligations, and, therefore, are not required to provide the information required by this item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe maintain our principal executive offices at 20 West Park Avenue, Suite 207, Long Beach, New York, where our President maintains a business office. We use this office space free of charge. We believe that this space is sufficient for our current requirements. The Company does not own or lease any properties at this time and does not anticipate owning or leasing any properties prior to acquiring a mining property. ITEM 3. LEGAL PROCEEDINGS\nWe are not presently a party to any material litigation, nor to the knowledge of management is any litigation threatened against us that may materially affect us. ITEM 4. MINE SAFETY DISCLOSURES\nThe enacted Dodd-Frank Wall Street Reform and Consumer Protection Act (the Act) requires the operators of mines to include in each periodic report filed with the SEC certain specified disclosures regarding the Companys history of mine safety. The Company currently does not operate any mines and, as such, is not subject to disclosure requirements regarding mine safety that were imposed by the Act. ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASE OF EQUITY SECURITIES\nMarket Information\nOur common stock is not listed or quoted on any exchange or over the counter medium.\nHolders\nAs of November 21, 2023, we had 39 record holders and 248,020,000 shares of common stock outstanding.\nDividends\nWe have never declared or paid cash dividends on our capital stock. We currently intend to retain all available funds and any future earnings for use in the operation of our business and do not anticipate paying any cash dividends in the foreseeable future.\nRecent Sales of Unregistered Securities\nWe did not issue any securities during the fiscal year ended March 31, 2023.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company does not have any equity compensation plans or any individual compensation arrangements with respect to its capital stock. The issuance of any of our capital stock is within the discretion of our Board, which has the power to issue any or all of our authorized but unissued shares without stockholder approval. ITEM 6. SELECTED FINANCIAL DATA\nAs a smaller reporting company, as defined by Rule 12b-2 of the Exchange Act and Item 10(f)(1) of Regulation S-K, the Company has elected to comply with certain scaled disclosure reporting obligations, and, therefore, are not required to provide the information required by this item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nWe are a natural resource company with an objective of acquiring, exploring and developing natural resource properties in the United States. Our primary focus in the natural resource sector is gold, though we may acquire rights to properties that may have reserves of other types of minerals. Our acquisition of a property may take the form of the outright purchase of property or the lease, license, claim (whether patented or unpatented) or other use agreement which provides us it the real property rights, other interests in land, including mining and surface rights, easements, and rights of way and options to conduct mining operations on real property. We currently do not hold rights in any mining properties and do not engage in any substantive business operations or generate revenue from any sources. The nature and percent of the interest we acquire in a property will depend on several variables, including the amount of capital we possess.\nWe intend to engage in mining operations as opposed to acquiring a passive interest in an existing enterprise. Mining operations include identifying an appropriate property, conducting technical due diligence with respect to such property and undertaking extraction operations, if warranted. We do not expect to engage in exploration for properties but rather expect to acquire a property for which permits, a mining plan and historical information exists and about which at least some geological, geochemical and geophysical information is available. If we identify a property that due diligence reveals may possess reserve potential that we are unable to acquire or develop on our own, we may enter into a joint venture with one or more partners to develop a property. We may buy and sell properties in any phase of development to maximize earnings, including before we commence producing on a property.\nThe search for valuable natural resources as a business is extremely risky and capital-intensive. Our ability to achieve our objective is predicated on, among other things, our receipt of financing to fund the acquisition of one or more mining properties, the completion of adequate due diligence and commencement of mining operations. We can provide investors with no assurance that we will obtain financing to acquire a property and commence operations or that we will exploit commercial quantities of minerals from any property we may acquire.\nResults of Operations\nDuring the fiscal years ended March 31, 2022 and 2023, the Company did not engage in any substantive business operations, did not generate any revenue, incurred operating expenses of $16,571, including $14,250 in professional fees, and suffered a net loss of $16,571, as compared to the year ended March 31, 2022 in which the Company did not generate any revenue and incurred operating expenses of $1,150 in professional fees and suffered a net loss of $1,150.\nLiquidity and Capital Resources\nAs of March 31, 2023, the Company had no assets, total liabilities of $3,243 and had a deficit accumulated of $1,125,129.\nAt present, the Company has no business operations and no cash resources. Bryan Glass, our principal stockholder, who is our sole officer and director, has advised us of his present intention to fund our operations through loans or further investment in the Company, though there is no written agreement binding him to do so. In the event that Mr. Glass does not fund our capital requirements, we would be unable to continue as a going concern and stockholders could lose the entire amount of their investment in our Company.\nWe will require significant third-party financing to conduct due diligence with respect to any property we may consider acquiring, to acquire a property and to fund mining operations. Financing transactions may include the issuance of equity or debt securities, obtaining credit facilities or through other financing mechanisms. We cannot predict whether equity or debt financing will be available at terms acceptable to us, if at all.\nOver the next twelve months, we expect to incur costs and expenses related to:\n·\nidentifying and conducting due diligence on mining properties in the U.S.;\n·\nmaintaining our corporate existence, such as annual fees due to the State of Nevada; and\n·\nfiling periodic reports under the Exchange Act including filing accounting and legal fees.\nWe cannot estimate the costs we will incur in connection with identifying and conducting due diligence on mining properties. These costs are difficult to quantify given the multitude of variables associated with such activities. We expect to incur costs associated with filing reports under the Exchange Act over the next twelve months of approximately $15,000 to $25,000. Our ongoing expenses will result in continued net operating losses that will increase until we can consummate a business transaction with a profitable target business, if ever.\nGoing Concern\nOur continuing operating losses, failure to generate revenues and lack of operating capital create substantial doubt about the Companys ability to continue as a going concern. Our ability to continue as a going concern is dependent on our ability to obtain capital from our affiliate to fund operations, to generate cash from the sale of securities and, ultimately, to enter into revenue generating operations. Managements plans include selling its equity securities and obtaining debt financing to fund its capital requirement and ongoing operations; however, there can be no assurance the Company will be successful in these efforts.\nOff-Balance Sheet Arrangements\nThe Company does not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on the Companys financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors.\nContractual Obligations\nAs a smaller reporting company, as defined by Item 10 of Regulation S-K, the Company is not required to provide the information required by this Item.\nCritical Accounting Policies and Use of Estimates\nThe discussion and analysis of financial condition and results of operations are based upon the Companys financial statements, which have been prepared in accordance with generally accepted accounting principles in the United States. The preparation of these condensed financial statements requires estimates and assumptions that affect the reported amounts of assets, liabilities, sales and expenses, and related disclosure of contingent assets and liabilities. On an ongoing basis, our management evaluates its estimates based upon historical experience and various other assumptions that it believes to be reasonable in the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates.\nThe Company believes that its significant accounting policies affect its more significant estimates and judgments used in the preparation of its financial statements. Our significant accounting policies are described in Note C to our audited financial statements included elsewhere in this annual report on Form 10-K. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide the information required by this Item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nFINANCIAL STATEMENT INDEX\nReport of Independent Registered Public Accounting Firm\nBalance Sheets as of March 31, 2022 and 2023\nStatement of Operations for the years ended March 31, 2022 and 2023\nStatement of Cash Flows for the years ended March 31, 2022 and March 2023\nStatement of Stockholders Equity for the year ended March 31, 2023\nStatement of Stockholders Equity for the year ended March 31, 2022\nNotes to audited financial statements\nMICHAEL GILLESPIE & ASSOCIATES, PLLC\nCERTIFIED PUBLIC ACCOUNTANTS\nVancouver, WA 98666\n206.353.5736\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders & Board of Directors\nRanger Gold Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Ranger Gold Corp. as of March 31, 2023 and 2022 (restated) and the related statements of operations, changes in stockholders deficit, cash flows, and the related notes (collectively referred to as financial statements) for the years then ended. In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of March 31, 2023 and 2022 (restated) and the results of its operations and its cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nRestatement to Correct 2022 Misstatement\nAs discussed in Note G to the financial statements, the 2022 financial statements have been restated to correct a misstatement.\nGoing Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern. As discussed in Note #B to the financial statements, although the Company has limited operations it has yet to attain profitability. This raises substantial doubt about its ability to continue as a going concern. Managements plan in regard to these matters is also described in Note #B. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/S/ MICHAEL GILLESPIE & ASSOCIATES, PLLC\nWe have served as the Companys auditor since 2023.\nPCAOB ID 6104\nVancouver, Washington\nAugust 23, 2023\nRanger Gold Corp.\nBalance Sheets\nAs of\nAs of\nMarch 31, 2023\nMarch 31, 2022 (Restated)\nCURRENT ASSETS\n$ -\n$ -\nTOTAL CURRENT ASSETS\n-\n-\nTOTAL ASSETS\n$ -\n$ -\nLIABILITIES\nCURRENT LIABILITIES\nAccounts Payable\n3,243\n-\nTOTAL CURRENT LIABILITIES\n3,243\n-\nTOTAL LIABILITIES\n3,243\n-\nCOMMITMENTS AND CONTINGENCIES\n$ -\n$ -\nSTOCKHOLDER'S EQUITY\nCommon stock ($0.0001 par value; 500,000,000 shares authorized; 248,020,000 and 248,020,000 shares issued and outstanding at March 31, 2023 and March 31, 2022, respectively)\n24,802\n24,802\nPreferred stock ($0.0001 par value; 5,000,000 shares authorized; no shares issued and outstanding at March 31, 2023 and March 31, 2022, respectively)\n-\n-\nAdditional Paid in Capital\n1,097,084\n1,078,823\nAccumulated Deficit\n(1,125,129 )\n(1,103,625 )\nTOTAL STOCKHOLDER'S EQUITY (DEFICIT)\n(3,243 )\n-\nTOTAL LIABILITIES AND STOCKHOLDER'S EQUITY/(DEFICIT)\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements.\nRanger Gold Corp.\nStatements of Operations\nFor the Years Ended March 31,\n(Restated)\nSales\n$ -\n$ -\nTotal Revenue\n$ -\n$ -\nEXPENSES:\nSelling, General and Administrative\n-\n-\nFiling Fees\n2,404\n-\nProfessional Fees\n19,100\n19,675\nTotal Expense\n21,504\n19,675\nLoss from operations\n$ (21,504 )\n$ (19,675 )\nProvision for Income Taxes\n$ -\n$ -\nNET LOSS\n$ (21,504 )\n$ (19,675 )\nWeighted average common shares outstanding, basic and fully diluted\n248,020,000\n248,020,000\nBasic and fully diluted net loss per common share:\n$ (0.00 )\n$ (0.00 )\nThe accompanying notes are an integral part of these financial statements.\nRanger Gold Corp.\nStatements of Cash Flows\nFor the years ended March 31,\n(Restated)\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss\n$ (21,504 )\n$ (19,675 )\nAdjustments to reconcile net (loss) to net cash provided by (used in) operations:\nChanges in Assets and Liabilities:\nIncrease (decrease) in Accounts Payable and Other Accruals\n3,243\n-\nIncrease (decrease) in Accrued Interest Expense\n-\n-\nNET CASH PROVIDED BY (USED IN) OPERATING ACTIVITIES\n(18,261 )\n(19,675 )\nCASH FLOWS TO/(FROM) FINANCING ACTIVITIES:\nContributions of Capital by Major Shareholder\n18,261\n19,675\nNET CASH PROVIDED BY (USED IN) FINANCING ACTIVITIES\n18,261\n19,675\nNET INCREASE(DECREASE) IN CASH AND CASH EQUIVALENTS\n-\n-\nCASH AND CASH EQUIVALENTS,\nBEGINNING OF THE PERIOD\n-\n-\nEND OF THE PERIOD\n$ -\n$ -\nSUPPLEMENTAL DISCLOSURES OF CASH FLOW INFORMATION:\nCASH PAID DURING THE PERIOD FOR:\nInterest\n$ -\n$ -\nTaxes\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements.\nRanger Gold Corp.\nStatement of Stockholders' Equity\nFor the year ended\nMarch 31, 2023\nAdditional\nCommon Stock\nPaid-in\nAccumulated\nTotal\nShares\nAmount\nCapital\nDeficit\nEquity\nBalances, April 1, 2022\n248,020,000\n24,802\n1,078,823\n(1,103,625 )\n-\nCapital Contribution\n-\n-\n18,261\n-\n18,261\nNet Loss\n-\n-\n-\n(21,504 )\n(21,504 )\nBalances, March 31, 2023\n248,020,000\n$ 24,802\n$ 1,097,084\n$ (1,125,129 )\n$ (3,243 )\nThe accompanying notes are an integral part of these financial statements.\nRanger Gold Corp.\nStatement of Stockholders' Equity\nFor the year ended\nMarch 31, 2022\n(Restated)\nAdditional\nCommon Stock\nPaid-in\nAccumulated\nTotal\nShares\nAmount\nCapital\nDeficit\nEquity\nBalances, April 1, 2021\n248,020,000\n$ 24,802\n$ 1,059,148\n$ (1,083,950 )\n$ -\nCapital Contributions\n-\n-\n19,675\n-\n$ 19,675\nNet Loss\n-\n-\n-\n(19,675 )\n$ (19,675 )\nBalances, March 31, 2022\n248,020,000\n$ 24,802\n$ 1,078,823\n$ (1,103,625 )\n$ -\nThe accompanying notes are an integral part of these financial statements.\nRANGER GOLD CORP\nNOTES TO THE FINANCIAL STATEMENTS\nAS OF MARCH 31, 2023\nNOTE A-BUSINESS ACTIVITY\nRanger Gold Corp. (the Company) was incorporated on May 11, 2007 under the laws of the State of Nevada under the name Fenario, Inc. On October 28, 2009, the Company amended its Articles of Incorporation for the purpose of changing the name of the Company from Fenario, Inc. to Ranger Gold Corp. The Companys last filings were for the period ended December 31, 2013 and then the Company became dormant until late 2018 when Bryan Glass petitioned to become the custodian of the Company and reinstated the Company. In January of 2019, the courts approved the custodianship, and the Company was reinstated as a corporation in the State of Nevada. The Companys year-end is March 31st.\nThe accounting policies conform to generally accepted accounting principles in the United States and have been consistently applied in the preparation of the financial statements.\nNOTE B-GOING CONCERN\nThe accompanying financial statements have been prepared on a going concern basis, which assumes the Company will realize its assets and discharge its liabilities in the normal course of business. As reflected in the accompanying financial statements, the Company has a deficit accumulated of $1,125,129 and cash used in operations of $18,261 at the period ended March 31, 2023.\nThe Companys ability to continue as a going concern is dependent upon its ability to generate future profitable operations and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. These circumstances raise substantial doubt about the Companys ability to continue as a going concern for the 12 months from the date when these financial statements were issued. The accompanying financial statements do not include any adjustments that might arise because of this uncertainty.\nTo address these aforementioned, management has undertaken the following initiatives: 1) enter into discussions to secure additional equity funding from current or new shareholders; 2) undertake a program to continue to monitor the Companys ongoing working capital requirements and minimum expenditure commitments; 3) continue their focus on maintaining an appropriate level of corporate overhead in line with the Companys available cash resources.\nRANGER GOLD CORP\nNOTES TO THE FINANCIAL STATEMENTS\nAS OF MARCH 31, 2023\nNOTE C-SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation- The financial statements included herein were prepared under Generally Accepted Accounting Principles (GAAP).\nAll adjustments have been made which in the opinion of management are necessary, normal, and recurring in nature for presentation.\nCash and Cash Equivalents- For purposes of the Statement of Cash Flows, the Company considers liquid investments with an original maturity of three months or less to be cash equivalents.\nManagements Use of Estimates- The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates. The financial statements above reflect all of the costs of doing business.\nRevenue Recognition- On May 28, 2014, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No.2014-09, Revenue from Contracts with Customers, Topic 606 (ASC 606), requiring an entity to recognize the amount of revenue to which it expects to be entitled for the transfer of promised goods or services to customers. The new revenue standard replaces most existing revenue recognition guidance in GAAP and permits the use of either the full retrospective or modified retrospective transition method. The Company adopted this standard using the modified basis effective January 1, 2019 and given the Company's limited revenue, the modified retrospective basis has no material impact on prior years given the limited revenue.\nRANGER GOLD CORP\nNOTES TO THE FINANCIAL STATEMENTS\nAS OF MARCH 31, 2023\nNOTE C-SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES-CONTD\nComprehensive Income (Loss) - The Company reports Comprehensive income and its components following guidance set forth by section 220-10 of the FASB Accounting Standards Codification which establishes standards for the reporting and display of comprehensive income and its components in the financial statements. There were no items of comprehensive income (loss) applicable to the Company during the period covered in the financial statements.\nNet Income per Common Share- Net loss per common share is computed pursuant to section 260-10-45 of the FASB Accounting Standards Codification. Basic net loss per share is computed by dividing net loss by the weighted average number of shares of common stock outstanding during the period. Diluted net loss per share is computed by dividing net loss by the weighted average number of shares of common stock and potentially outstanding shares of common stock during each period.\nDeferred Taxes- The Company accounts for income taxes under Section 740-10-30 of the FASB Accounting Standards Codification. Deferred income tax assets and liabilities are determined based upon differences between the financial reporting and tax bases of assets and liabilities and are measured using the enacted tax rates and laws that will be in effect when the differences are expected to reverse. Deferred tax assets are reduced by a valuation allowance to the extent management concludes it is more likely than not that the assets will not be realized. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the statements of operations in the period that includes the enactment date.\nFair Value of Financial Instruments- The carrying amounts reported in the balance sheet for cash, accounts receivable and accounts payable approximate fair value based on the short-term maturity of these instruments.\nAccounts Receivable- Accounts deemed uncollectible are written off in the year they become uncollectible. As of March 31, 2023, and March 31, 2022, the balance in Accounts Receivable was $0 and $0.\nImpairment of Long-Lived Assets- The Company evaluates the recoverability of its fixed assets and other assets in accordance with section 360-10-15 of the FASB Accounting Standards Codification for disclosures about Impairment or Disposal of Long-Lived Assets. Disclosure requires recognition of impairment of long-lived assets in the event the net book value of such assets exceeds its expected cash flows. If so, it is impaired and is written down to fair value, which is determined based on either discounted future cash flows or appraised values. The Company adopted the statement on inception. No impairments of these types of assets were recognized during the periods ended March 31, 2023, and March 31, 2022.\nStock-Based Compensation- The Company accounts for stock-based compensation using the fair value method following the guidance set forth in section 718-10 of the FASB Accounting Standards Codification for disclosure about Stock-Based Compensation. This section requires a public entity to measure the cost of employee services received in exchange for an award of equity instruments based on the grant-date fair value of the award (with limited exceptions). That cost will be recognized over the period during which an employee is required to provide service in exchange for the award- the requisite service period (usually the vesting period). No compensation cost is recognized for equity instruments for which employees do not render the requisite service.\nFair Value for Financial Assets and Financial Liabilities- The Company follows paragraph 825-10-50-10 of the FASB Accounting Standards Codification for disclosures about fair value of its financial instruments and paragraph 820-10-35-37 of the FASB Accounting Standards Codification (Paragraph 820-10-35-37) to measure the fair value of its financial instruments. Paragraph 820-10-35-37 establishes a framework for measuring fair value in accounting principles generally accepted in the United States of America (U.S. GAAP) and expands disclosures about fair value measurements. To increase consistency and comparability in fair value measurements and related disclosures, Paragraph 820-10-35-37 establishes a fair value hierarchy which prioritizes the inputs to valuation techniques used to measure fair value into three broad levels. The fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The three levels of fair value hierarchy defined by Paragraph 820-10-35-37 are described below:\nRANGER GOLD CORP\nNOTES TO THE FINANCIAL STATEMENTS\nAS OF MARCH 31, 2023\nNOTE C-SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES-CONTD\nLevel 1\nQuoted market prices available in active markets for identical assets or liabilities as of the reporting date.\nLevel 2\nPricing inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the reporting date.\nLevel 3\nPricing inputs that are generally unobservable inputs and not corroborated by market data.\nThe carrying amounts of the Companys financial assets and liabilities, such as cash and accrued expenses, approximate their fair values because of the short maturity of these instruments. The Companys note payable would approximate the fair value of such instrument based upon managements best estimate of interest rates that would be available to the Company for similar financial arrangement at the periods ended March 31, 2023 and March 31, 2022.\nThe Company does not have any assets or liabilities measured at fair value on a recurring or a non-recurring basis, consequently, the Company did not have any fair value adjustments for assets and liabilities measured at fair value at March 31, 2023, nor gains or losses are reported in the statement of operations that are attributable to the change in unrealized gains or losses relating to those assets and liabilities still held at the reporting date for the periods ended March 31, 2023 and March 31, 2022.\nRecently Issued Accounting Pronouncements\nThe FASB recently issued Accounting Standard Update (ASU) 2021-012 to clarify that all derivative instruments affected by changes to the interest rates used for discounting, margining, or contract price alignment (commonly referred to as the discounting transition) are in the scope of ASC 848. The amendments also clarify other aspects of the guidance in ASC 848 and addresses the effects of the cash compensation adjustment provided in the discounting transition on certain aspects of hedge accounting. The guidance in ASC 848 also allows entities to make a one-time election to sell and/or transfer to available for sale or trading any held-to-maturity (HTM) debt securities that refer to an interest rate affected by reference rate reform and were classified as held to maturity before 1 January 2020. The adoption of this standard did not have a material impact on the Companys financial position and results of operations.\nOther pronouncements issued by the FASB or other authoritative accounting standards groups with future effective dates are either not applicable or are not expected to be significant to the Companys financial position, results of operations or cash flows.\nNOTE D - SEGMENT REPORTING\nThe Company follows the guidance set forth by section 280-10 of the FASB Accounting Standards Codification for reporting and disclosure on operating segments of the Company. It also requires segment disclosures about products and services, geographic areas, and major customers. The Company determined that it did not have any separately reportable operating segments as of March 31, 2023, and March 31, 2022.\nNOTE E - CAPITAL STOCK\nThe Company is authorized to issue 500,000,000 Common Shares at $0.0001 par value per share.\nThe Company is authorized to issue 5,000,000 Preferred Shares at $0.0001 par value per share.\nTotal issued and outstanding shares of common stock is 248,020,000 and 248,020,000 as of March 31, 2023, and March 31, 2022, respectively.\nDuring the year ended March 31, 2022, no shares were issued.\nDuring the year ended March 31, 2023, no shares were issued.\nRANGER GOLD CORP\nNOTES TO THE FINANCIAL STATEMENTS\nAS OF MARCH 31, 2023\nNOTE E - CAPITAL STOCK-CONTD\nCapital Contributions\nDuring the year ended March 31, 2023, $18,261 in capital contributions were made and during the year ended March 31, 2022, $19,675 in capital contributions were made.\nNOTE F-CORRECTION OF AN ERROR/PRIOR PERIOD RESTATEMENT\nDuring our year-end reconciliation/close-out and subsequent audit, Management discovered that Accounts Payable amounts owed to Vendors and the related expenses incurred were incorrect for the year 2022. Some vendors had been paid outside of the bank account and directly by the owner which should have been recorded as an addition to the Additional Paid in Capital. Per ASC 250-10, since the error correction is material and also material to financial statements previously issued, Management is promptly correcting the errors and restating previously issued financial statements.\nBelow are tables of the March 31, 2022 accounts impacted by the correction of the error:\nBalance Sheet\nAs of March 31, 2022\nAmounts Originally Reported\nAmounts Restated\nAmount of Change\nCURRENT ASSETS\n$ -\n$ -\n$ -\nTOTAL CURRENT ASSETS\n-\n-\n-\nTOTAL ASSETS\n$ -\n$ -\n$ -\nLIABILITIES\nCURRENT LIABILITIES\n-\n-\n-\nTOTAL CURRENT LIABILITIES\n-\n-\n-\nTOTAL LIABILITIES\n-\n-\n-\nCOMMITMENTS AND CONTINGENCIES\n$ -\n$ -\n$ -\nSTOCKHOLDER'S EQUITY\nCommon stock\n24,802\n24,802\n-\nPreferred stock\n-\n-\n-\nAdditional Paid in Capital\n1,060,898\n1,078,823\n(17,925 )\nAccumulated Deficit\n(1,085,700 )\n(1,103,625 )\n17,925\nTOTAL STOCKHOLDER'S EQUITY (DEFICIT)\n-\n-\n-\nTOTAL LIABILITIES AND STOCKHOLDER'S EQUITY/(DEFICIT)\n$ -\n$ -\n$ -\nNOTE F-CORRECTION OF AN ERROR/PRIOR PERIOD RESTATEMENT-CONTD\nStatements of Operations\nFor the Year Ended March 31, 2022\nAmounts Originally Reported\nAmounts Restated\nAmount of Change\nSales\n$ -\n$ -\n$ -\nTotal Revenue\n$ -\n$ -\n$ -\nEXPENSES:\nSelling, General and Administrative\n-\n-\n-\nFiling Fees\n-\n-\n-\nProfessional Fees\n1,150\n19,675\n(18,525 )\nTotal Expense\n1,150\n19,675\n(18,525 )\nLoss from operations\n$ (1,150 )\n$ (19,675 )\n$ 18,525\nProvision for Income Taxes\n$ -\n$ -\n$ -\nNET LOSS\n$ (1,150 )\n$ (19,675 )\n$ 18,525\nNOTE G - INCOME TAX\nThe Company provides for income taxes under (now included under Accounting Standards Codification (ASC), 740), Accounting for Income Taxes. ASC 740 requires the use of an asset and liability approach in accounting for income taxes. Deferred tax assets and liabilities are recorded based on the differences between the financial statement and tax bases of assets and liabilities and the tax rates in effect when these differences are expected to reverse.\nASC 740 requires the reduction of deferred tax assets by a valuation allowance if, based on the weight of available evidence, it is more likely than not that some or all the deferred tax assets will not be realized. For Federal income tax purposes, the Company has net operating loss carry forwards that expire through 2030. The net operating loss carry forward as of March 31, 2023, is approximately $1,125,000 and as of March 31, 2022, is $1,104,000 approximately. The total deferred tax assets are approximately $236,000 and $232,000 for the years ended March 31, 2023, and March 31, 2022, respectively.\nNo tax benefit has been reported in the financial statements because after evaluating our own potential tax uncertainties, the Company has determined that there are no material uncertain tax positions that have a greater than 50% likelihood of reversal if the Company were to be audited. The provision for income taxes differs from the amounts which would be provided by applying the statutory federal income tax rate of 21% to the net loss before provision for income taxes for the following reasons:\nThe Company is not obligated to pay State Income Taxes because it is a Nevada corporation. The Company does not currently have any tax returns open for examination.\nNOTE H-MATERIAL EVENTS/SUBSEQUENT EVENTS\nSince the close of the period covered by the financial statements of which these notes form a part, the following material transactions have occurred: No material or subsequent transactions have occurred from the year end March 31, 2023 through August 23, 2023. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management conducted an evaluation, with the participation of our Chief Executive Officer, who is our principal executive officer and our principal financial and accounting officer, of the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) as of the end of the period covered by this Annual Report on Form 10-K.\nManagements Annual Report on Internal Control over Financial Reporting\nManagement is responsible for the preparation of our financial statements and related information. Management uses its best judgment to ensure that the financial statements present fairly, in all material respects, our financial position and results of operations in conformity with generally accepted accounting principles.\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as defined under the Exchange Act. These internal controls are designed to provide reasonable assurance that the reported financial information is presented fairly, that disclosures are adequate and that the judgments inherent in the preparation of financial statements are reasonable. There are inherent limitations in the effectiveness of any system of internal controls including the possibility of human error and overriding of controls. Consequently, an ineffective internal control system can only provide reasonable, not absolute, assurance with respect to reporting financial information.\nOur internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that, in reasonable detail, accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements in accordance with generally accepted accounting principles and that the receipts and expenditures of company assets are made in accordance with our management and directors authorization; and (iii) provide reasonable assurance regarding the prevention of or timely detection of unauthorized acquisition, use or disposition of assets that could have a material effect on our financial statements.\nUnder the supervision of our Chief Executive Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework Internal Control-Integrated Framework (2013) as outlined by the Committee of Sponsoring Organizations of the Treadway Commission and guidance prepared by the Commission specifically for smaller public companies. Based on that evaluation, our management concluded that the Company maintained effective internal control over financial reporting as of March 31, 2023.\nOur management does not expect that our disclosure controls and procedures or our internal controls will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our Company have been detected.\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to rules of the SEC that permit us to provide only managements report in this Annual Report.\nChanges in Internal Controls over Financial Reporting\nThere have been no changes in our internal control over financial reporting during the quarter ended March 31, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table lists our officers and directors as of the date of this Annual Report:\nName\nAge\nTitle\nBryan Glass\nPresident, Chief Financial Officer, Secretary and Director\nBryan Glass was appointed custodian of the Company in January 2019 and was elected as the sole director of the Company shortly thereafter. Mr. Glass has been involved in the securities industry since 1996. Since early 2012, Mr. Glass has been the President and CEO of Empire State Financial, Inc. a full service FINRA member broker dealer established in 1971. From 2010 to 2012, he worked with Delta Equity Services through which he operated Bryan Glass Securities. From 2006 to 2010, he was a Vice President of Investments at Morgan Stanley. He currently holds the Series 7, 24, 53, 63 and 65 securities licenses. Mr. Glass also has other business interests and activities We believe that Mr. Glass is qualified to serve as a director of the Company because of his extensive involvement with public companies during the course of his career.\nThe term of office of our director expires at the Companys annual meeting of stockholders or until his successor is duly elected and qualified. Directors are not compensated for serving as such. Officers serve at the discretion of the board of directors.\nThe Company has no employees other than Mr. Glass.\nInvolvement in Certain Legal Proceedings\nOur sole director and executive officer has not been involved in any legal proceeding listed in Item 401(f) of Regulation S-K in the past 10 years.\nTerm of Office\nAll our directors will hold office until their successors have been elected and qualified or appointed or the earlier of their death, resignation or removal. Executive officers are appointed and serve at the discretion of the board of director.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Exchange Act requires our directors, executive officers and ten percent stockholders to file initial reports of ownership and announcements of changes in ownership of our common stock with the Commission. Directors, executive officers and ten percent of stockholders are also required to furnish us with copies of all Section 16(a) forms that they file. Based upon a review of these filings, we believe all required Section 16(a) reports were made during 2022.\nBoard Composition\nOur bylaws provide that the size of our Board will be determined from time to time by the resolution of our Board. Currently, our Board comprises one member.\nElection of Directors\nOur bylaws provide that a majority vote of our stockholders elect the members of our Board.\nCorporate Governance\nOur Board has not established any committees, including an audit committee, a compensation committee or a nominating committee, or any committee performing similar functions. The functions of those committees are being undertaken by our Board. Because we do not have any independent directors, our Board believes that the establishment of committees of our Board would not provide any benefits to our Company and could be considered more form than substance.\nWe do not have a policy regarding the consideration of any director candidates that may be recommended by our stockholders, including the minimum qualifications for director candidates, nor have our officers and directors established a process for identifying and evaluating director nominees. We have not adopted a policy regarding the handling of any potential recommendation of director candidates by our stockholders, including the procedures to be followed. Our officers and directors have not considered or adopted any of these policies as we have never received a recommendation from any stockholder for any candidate to serve on our Board.\nGiven our relative size and lack of directors and officers insurance coverage, we do not anticipate that any of our stockholders will make such a recommendation in the near future. While there have been no nominations of additional directors proposed, in the event such a proposal is made, all current members of our Board will participate in the consideration of director nominees.\nAs with most small, early-stage companies until such time as our Company further develops our business, achieves a stronger revenue base and has sufficient working capital to purchase directors and officers insurance, we do not have any immediate prospects to attract independent directors. When we are able to expand our Board to include one or more independent directors, we intend to establish an audit committee of our Board. It is our intention that one or more of these independent directors will also qualify as an audit committee financial expert. Our securities are not quoted on an exchange that has requirements that a majority of our Board members be independent and we are not currently otherwise subject to any law, rule or regulation requiring that all or any portion of our Board include independent directors, nor are we required to establish or maintain an audit committee or other committees of our Board.\nMeetings of the Board\nDuring fiscal 2023, our Board did not hold any in-person or telephonic meetings nor did it act by written consent.\nCode of Ethics\nWe have adopted a code of business conduct and ethics that applies to all of our employees, officers and directors, including those officers responsible for financial reporting. The code of business conduct and ethics is available on our website at www.appsofttechnologies.com. We intend to post any amendments to the code, or any waivers of its requirements, on our website. The contents of our website are not incorporated by reference into this Annual Report.\nCommittees of our Board of Directors\nOur securities are not quoted on an exchange that has requirements that a majority of our Board members be independent and we are not currently otherwise subject to any law, rule or regulation requiring that all or any portion of our Board include independent directors, nor are we required to establish or maintain an Audit Committee or other committees of our Board.\nOur Board does not have standing audit, compensation or nominating committees. Our Board does not have a member that qualifies as an audit committee financial expert as defined in Item 407(d)(5)(ii) of Regulation S-K. Our Board does not believe committees are necessary based on the size of our Company, the current levels of compensation to corporate officers and voting control lies with our current Board. Our Board will consider establishing audit, compensation and nominating committees at the appropriate time.\nThe entire Board participates in the consideration of compensation issues and of director nominees. Candidates for director nominees will be reviewed in the context of the current composition of the Board and our operating requirements and the long-term interests of our stockholders. In conducting this assessment, the Board will consider professional and business skills, experience, expertise, diversity, judgment and such other factors as it deems appropriate given the current needs of the Board and our company, to maintain a balance of knowledge, experience and capability.\nNomination Process\nDuring the 2023 fiscal year, we did not effect any material changes to the procedures by which our stockholders may recommend nominees to our Board. Our Board does not have a policy with regards to the consideration of any director candidates recommended by our stockholders. Our Board has determined that it is in the best position to evaluate our Companys requirements as well as the qualifications of each candidate when the Board considers a nominee for a position on our Board. If stockholders wish to recommend candidates directly to our Board, they may do so by sending communications to the President of our Company at the address on the cover of this Annual Report.\nDirector Compensation\nOur current director does not receive separate compensation for his service on our Board. Our Board has the authority to fix the compensation of directors. We do not intend to pay employee directors a separate fee for their Board services.\nNo compensation was paid to our director for his service as a director during the year ended March 31, 2023.\nCompliance with Section 16(a) of the Securities Exchange Act of 1934\nSection 16(a) of the Exchange Act requires directors, executive officers and holders of more than 10% of an equity security registered pursuant to Section 12 of the Exchange Act to file various reports with the SEC. Our equity securities are not registered pursuant to Section 12 of the Exchange Act, so our directors, executive officers and 10% holders are not subject to Section 16(a).\nProcedures for Nominating Directors\nThere have been no material changes to the procedures by which security holders may recommend nominees to the Board during the quarter ended March 31, 2023. ITEM 11. EXECUTIVE COMPENSATION\nThe following table summarizes compensation recorded by us for the years ended March 31, 2022 and 2023 for our principal executive officer who also serves as our principal financial officer.\nSummary Compensation Table\nName and principal position\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nBryan Glass,\nPresident and\nChief Executive Officer\n___________\nNarrative Disclosure to Summary Compensation Table\nThe Company has not established a base salary for the President and Chief Executive Officer. However, from time to time, the President, Chief Executive Officer and sole director approves, in his sole discretion, payments to be made to himself by the Company in the form of a management fee. The management fee is intended to compensate Mr. Kupchik for services rendered to the Company in his capacity as an executive officer. There is no written agreement regarding the management fee and no terms in place regarding the amount and timing of management fees. In addition, from time to time, the President, Chief Executive Officer and sole director approves, in his sole discretion, the payment by the Company of certain of his personal expenses and/or financial obligations.\nThere are no compensatory plans or arrangements, including payments to be received from the Company with respect to any executive officer, that would result in payments to such person because of his or her resignation, retirement or other termination of employment with the Company, or our subsidiaries, any change in control, or a change in the persons responsibilities following a change in control of the Company.\nEmployment Agreements\nThere are no current employment agreements between the Company and our executive officer or understandings regarding future compensation.\nOutstanding Equity Awards at Fiscal Year-End\nNo executive officer received any equity awards, or holds exercisable or unexercisable options, as of March 31, 2023.\nLong-Term Incentive Plans\nThere are no arrangements or plans in which the Company would provide pension, retirement or similar benefits for directors or executive officers.\nCompensation of Directors\nWe have not paid our directors any fees or other remuneration during the last two fiscal years and we do not have no arrangements to pay our directors any fees or other remuneration. We do not intend to pay our directors any fees until such time as we acquire a mining property, if ever. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth, as of the date of this Annual Report, certain information regarding beneficial ownership of our common stock by (i) each person who is known by us to beneficially own more than 5% of the outstanding shares of common stock; (ii) each of our directors and officers; and (iii) all officers and directors as a group.\nThe applicable percentage of ownership is based on 248,020,000 shares of common stock outstanding as of the date of this Annual Report. The business address of each the person named in the table below is in care of the Company.\nName of Beneficial Owner\nAmount of\nBeneficial Ownership\nPercent of Outstanding\nShares of Class Owned (1)\nBryan Glass\n200,000,000\n80.64\nAll officers and directors as a group (1 person)\n200,000,000\n80.64 ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nRelated Party Transactions\nSince January 2019, the Company has utilized office space provided free of charge by its officer.\nDirector Independence\nThe Company has not established its own definition for determining whether its directors and nominees for directors are independent nor has it adopted any other standard of independence employed by any national securities exchange or inter-dealer quotation system. The Companys sole director would not qualify as independent under any recognized definition of that term. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table shows the fees that were billed for the audit and other services provided by Michael Gillespie & Associates, PLLC for the fiscal years ended March 31, 2022 and 2023.\nAudit Fees\n$ 8,800\n$ 8,200\nAudit-Related Fees\n3,240\n9,850\nTax Fees\nAll Other Fees\nTotal\n$ 12,040\n$ 18,050\nAudit Fees - This category includes the audit of our annual financial statements, review of financial statements included in our Quarterly Reports on Form 10-Q and services that are normally provided by the independent registered public accounting firm in connection with engagements for those fiscal years. This category also includes advice on audit and accounting matters that arose during, or as a result of, the audit or the review of interim financial statements.\nAudit-Related Fees - This category consists of assurance and related services by the independent registered public accounting firm that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees. The services for the fees disclosed under this category include consultation regarding our correspondence with the SEC, other accounting consulting and other audit services.\nTax Fees - This category consists of professional services rendered by our independent registered public accounting firm for tax compliance and tax advice. The services for the fees disclosed under this category include tax return preparation and technical tax advice.\nAll Other Fees - This category consists of fees for other miscellaneous items.\nOur Board of Directors has adopted a procedure for pre-approval of all fees charged by our independent registered public accounting firm. Under the procedure, the Board approves the engagement letter with respect to audit, tax and review services. Other fees are subject to pre-approval by the Board, or, in the period between meetings, by a designated member of Board. Any such approval by the designated member is disclosed to the entire Board at the next meeting.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) The following financial statements of the registrant are filed as a part of this Annual Report:\nReport of Independent Registered Public Accounting Firm\nBalance Sheets as of March 31, 2022 and 2023\nStatement of Operations for the years ended March 31, 2022 and 2023\nStatement of Cash Flows for the year ended March 31, 2023\nStatement of Stockholders Deficit at March 31, 2022\nNotes to audited financial statements\n(b) The following exhibits are filed with this Annual Report:\nExhibit Number\nDescription\nLocation Reference\n3.1\nArticles of Incorporation\n3.1.1\nAmendment to Articles of Incorporation\n3.1.2\nCertificate of Amendment filed by Custodian\n3.2\nBy-laws\nCode of Ethics\n99.1\nCustodial Order\n99.2\nCertificate of Reinstatement\n31.1*\nCertification of the Companys Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of the Companys Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1**\nCertification of the Companys Principal Executive Officer and Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes Oxley Act of 2002.\n__________\n1.\nIncorporated by reference from registration statement on Form SB-2 filed with the SEC on June 4, 2008.\n2.\nIncorporated by reference from information statement on Schedule 14C filed with the SEC on November 11, 2009.\n3.\nIncorporated by reference from registration statement on Form 10 filed with the SEC on December 13, 2021.\n4.\nFiled herewith.\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Labels Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101).\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nRANGER GOLD CORP\nNovember 21, 2023\nBy:\n/s/ Bryan Glass\nBryan Glass\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities and Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Bryan Glass\nPresident, Chief Executive Officer, principal executive officer and\nNovember 21, 2023\nBryan Glass\nprincipal financial and accounting officer"
}