{
    "cik": "1435064",
    "company": "CEMTREX INC",
    "filing_type": "10-K",
    "filing_date": "2023-12-28",
    "period_of_report": "2023-09-30",
    "sic": "3670",
    "state_of_inc": "DE",
    "state_location": "NY",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1435064/0001493152-23-046365-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1435064/000149315223046365/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1435064/0001493152-23-046365.txt",
    "filename": "1435064_10K_2023_0001493152-23-046365.htm",
    "content": "ITEM 1. BUSINESS\nOverview\nCemtrex, Inc. was incorporated in 1998 in the state of Delaware and has evolved through strategic acquisitions and internal growth into a leading multi-industry company. Unless the context requires otherwise, all references to we, our, us, Company, registrant, Cemtrex or management refer to Cemtrex, Inc. and its subsidiaries.\nDuring the first quarter of fiscal year 2023, the Company reorganized its reporting segments to be in line with its current structure consisting of (i) Security, (ii) Industrial Services, and (iii) Cemtrex Corporate.\nSecurity\nCemtrexs Security segment operates under the brand of its majority owned subsidiary, Vicon Industries, Inc. (Vicon), which provides end-to-end security solutions to meet the toughest corporate, industrial and governmental security challenges. Vicons products include browser-based video monitoring systems and analytics-based recognition systems, cameras, servers, and access control systems for every aspect of security and surveillance in industrial and commercial facilities, federal prisons, hospitals, universities, schools, and federal and state government offices. Vicon provides innovative, mission critical security and video surveillance solutions utilizing Artificial Intelligence (AI) based data algorithms.\nIndustrial Services\nCemtrexs Industrial Services segment operates under the brand, Advanced Industrial Services (AIS), which offers single-source expertise and services for rigging, millwrighting, in plant maintenance, equipment erection, relocation, and disassembly to diversified customers. AIS installs high precision equipment in a wide variety of industrial markets like automotive, printing and graphics, industrial automation, packaging, and chemicals, among others. AIS is a leading provider of reliability-driven maintenance and contracting solutions for machinery, packaging, printing, chemical, and other manufacturing markets. The focus is on customers seeking to achieve greater asset utilization and reliability to cut costs and increase production from existing assets, including small projects, sustaining capital, turnarounds, maintenance, specialty welding services, and high-quality scaffolding.\nCemtrex Corporate\nCemtrexs Corporate segment is the holding company of our other two segments.\nRecent Developments\nSale of former Cemtrex Brands\nOn November 22, 2022, the Company entered into two Asset Purchase Agreements and one Simple Agreement for Future Equity (SAFE) with the Companys CEO, Saagar Govil, to secure the sale of the subsidiaries Cemtrex Advanced Technologies, Inc, which include the brand SmartDesk, and Cemtrex XR, Inc., which include the brands Cemtrex XR, Virtual Driver Interactive, Bravo Strong, and good tech (formerly Cemtrex Labs), to Mr. Govil.\nOn November 22, 2022, the Company completed the above disposition for the following consideration.\n● Cemtrex XR, Inc.\n○ $895,000 comprised of:\n■ $75,000 in cash payable at Closing; and\n■ 5% royalty of all revenues on the Business to be paid 90 days after the end of each calendar year for the next three years; and should the total sum of royalties due be less than $820,000 at the end of the three-year period, Purchaser shall be obligated to pay the difference between $820,000 and the royalties paid.\n● Cemtrex Advanced Technologies, Inc.\n○ $10,000 in cash payable at Closing; and\n○ 5% royalty of all revenues on the Business to be paid 90 days after the end of each calendar year for the next 5 years; and\n○ $1,600,000 in SAFE (common equity) at any subsequent fundraising or exit above $5,000,000 with a $10,000,000 cap.\nThe Companys Board of Directors, excluding Saagar Govil who abstained from all voting on these agreements, approved these actions and agreements.\nAcquisition of Heisey Mechanical\nOn July 1, 2023, the Company under AIS, completed the acquisition of a leading service contractor and steel fabricator that specializes in industrial and water treatment markets, Heisey Mechanical, Ltd. (Heisey) based in Columbia, Pennsylvania for $2,400,000 plus adjustments for the outstanding contract assets and liabilities of $393,291. The real estate of the business was purchased at fair market value on August 30, 2023, for $1,500,000 in a separate transaction.\nHeisey provides the water treatment industry with a variety of fabricated vessels and equipment including ASME pressure vessels, heat exchangers, mix tanks, reactors, and other specialized fabricated equipment. Additionally, the contracting team assists with installation and service of fabricated items. The company has over 33,000 square feet of manufacturing floor space in its facility and an experienced staff of fabricators, welders, and field mechanics.\nThe purchase price allocation presented below is still preliminary but has been developed based on an estimate of fair values of Heiseys identifiable tangible and intangible assets acquired and liabilities assumed as of July 1, 2023. The final allocation of the purchase price will be determined within one year from the closing date of the Heisey acquisition.\nThe consideration transferred and preliminary allocation of Heiseys tangible and intangible assets and liabilities, are as follows:\nConsideration Transferred:\nCash $ 393,291\nSellers note 240,000\nFinanced amount 2,160,000\nTotal consideration transferred $ 2,793,291\nPurchase Price Allocation:\nInventory 300,000\nContract assets 667,259\nMachinery and equipment 1,625,000\nContract liabilities (216,469 )\nAccrued expenses (57,499 )\nGoodwill 475,000\nTotal consideration transferred $ 2,793,291\nThe pro forma summary below presents the results of operations as if the Heisey acquisition occurred on October 1, 2021. Proforma adjustments for the twelve months ended September 30, 2023, includes $127,800 of depreciation expense from acquired fixed assets, $127,883 of interest expense on the debt used in the acquisition. Proforma adjustments for the twelve months ended September 30, 2022, includes $255,600 of depreciation expense from acquired fixed assets, $81,140 of interest expense on the debt used in the acquisition. The pro forma summary uses estimates and assumptions based on information available at the time. Management believes the estimates and assumptions to be reasonable; however, actual results may have differed significantly from this pro forma financial information. The pro forma information does not reflect any cost savings, operating synergies or revenue enhancements that might have been achieved from combining the operations. The unaudited pro forma summary is provided for illustrative purposes only and does not purport to represent the Companys actual consolidated results of operations had the acquisition been completed as of the date presented, nor should it be considered indicative of Cemtrexs future consolidated results of operations.\nUnaudited\nFor the year ended\nSeptember 30, 2023 September 30, 2022\nRevenues $ 66,274,838 $ 53,970,595\nNet loss (9,173,748 ) (13,038,817 )\nOn August 30, 2023, the Company acquired a mortgage in the amount of $1,200,000 from Fulton Bank to finance the purchase of the properties formerly owned by Heisey Mechanical Ltd. The mortgage carries interest at the Secured Overnight Financing Rate (SOFR) plus 2.8% and matures on September 30, 2043.\nCommon Stock Reverse Stock Split\nOn January 25, 2023, the Company completed a 35:1 reverse stock split on its common stock. All share and per share data have been retroactively adjusted for this reverse split.\nNotice of Delisting, Extension of cure period, and Subsequent Compliance\nSeries 1 Preferred Stock\nOn July 29, 2022, the Company received a notification letter from the Listing Qualifications Department of The Nasdaq Stock Market LLC (Nasdaq) notifying the Company that, because the closing bid price for the Companys Series 1 preferred stock listed on Nasdaq was below $1.00 for 30 consecutive trading days, the Company no longer met the minimum bid price requirement for continued listing on The Nasdaq Capital Market under Nasdaq Marketplace Rule 5550(a)(2), requiring a minimum bid price of $1.00 per share (the Minimum Bid Price Requirement). On January 26, 2023, the Company received a notification letter from the Listing Qualifications Department of Nasdaq notifying the Company that, it had been granted an additional 180 days or until July 24, 2023, to regain compliance with the Minimum Bid Price Requirement based on the Company meeting the continued listing requirement for market value of publicly held shares and all other applicable requirements for initial listing on the Capital Market with the exception of the bid price requirement, and the Companys written notice of its intention to cure the deficiency during the second compliance period by effecting a reverse stock split, if necessary. On September 8, 2023, Cemtrex Inc. (the Company) received a letter from the Nasdaq Hearings Panel (Panel) informing the Company that the Panel has granted the Company a temporary exception to regain compliance with The Nasdaq Stock Market LLCs (Nasdaq or the Exchange) Listing Rule 5555(a)(1) (the Bid Price Rule) by no later than January 19, 2024. The Company has announced a special meeting of Series 1 Preferred stock shareholders scheduled for December 26, 2023, to approve the reverse stock split. On December 26, 2023, the Company held the meeting but failed to establish a quorum and has adjourned the meeting to December 29, 2023.\nCommon Stock\nOn January 24, 2022, the Company received a notification letter from the Listing Qualifications Department of Nasdaq notifying the Company that, because the closing bid price for the Companys common stock listed on Nasdaq was below $1.00 for 30 consecutive trading days, the Company no longer met the minimum bid price requirement for continued listing on The Nasdaq Capital Market under Nasdaq Marketplace Rule 5550(a)(2), requiring a minimum bid price of $1.00 per share (the Minimum Bid Price Requirement).\nOn July 26, 2022, the Company received a notification letter from the Listing Qualifications Department of The Nasdaq Stock Market LLC Nasdaq notifying the Company that, it had been granted an additional 180 days or until January 23, 2023, to regain compliance with the Minimum Bid Price Requirement based on the Company meeting the continued listing requirement for market value of publicly held shares and all other applicable requirements for initial listing on the Capital Market with the exception of the bid price requirement, and the Companys written notice of its intention to cure the deficiency during the second compliance period by effecting a reverse stock split, if necessary.\nOn January 26, 2023, the Company received a notification letter from the Listing Qualifications Department of Nasdaq notifying the Company that it has not regained compliance with Listing Rule 5550(a)(2) and accordingly would be delisted from the Capital Market. The Company then requested and had been granted a hearing to occur on March 16, 2023, appealing this determination to a Hearings Panel (the Panel), pursuant to the procedures set forth in the Nasdaq Listing Rule 5800 Series.\nOn February 8, 2023, the Company received a notification letter from the Listing Qualifications Department of Nasdaq notifying the Company that it has regained compliance with Listing Rule 5550(a)(2) and is in compliance with all applicable listing standards. The Companys common stock will continue to be listed and traded on The Nasdaq Stock Market.\nSettlement with the Securities and Exchange Commission\nOn September 30, 2022, acting pursuant to an offer of settlement submitted by the Company, the U.S. Securities and Exchange Commission (SEC) issued an order pursuant to Section 8A of the Securities Act, directing the Company to cease and desist from committing or causing any violations and any future violations of Section 17(a) of the Securities Act and Section 10(b) of the Exchange Act and Rule 10b-5 thereunder (the SEC Order).\nThe SEC Order also directed Mr. Saagar Govil to cease and desist from committing or causing any violations and any future violations of Section 17(a)(3) of the Securities Act.\nThe SEC found that, as a result of its conduct, which was neither admitted nor denied, the Company violated Section 17(a) of the Securities Act and Section 10(b) of the Exchange Act and Rule 10b-5 thereunder, which prohibit fraudulent conduct in the offer or sale of securities and in connection with the purchase or sale of securities.\nThe SEC also found that, as a result of his conduct, which was neither admitted nor denied, Mr. Govil violated Section 17(a)(3) of the Securities Act, which makes it illegal to engage in any transaction, practice, or course of business which operates or would operate as a fraud or deceit upon the purchaser.\nIn addition to the above cease and desists, the Company undertook to not publicly announce that it has partnered with another company or that another company has become a customer of the Company without providing prior written notice, including a copy of the announcement text, to the businessperson at the other company responsible for that companys relationship with the Company.\nAlso, the Company received a civil monetary penalty of two million two hundred thousand dollars ($2,200,000) in the aggregate that must be paid to the SEC. Mr. Govil also received a civil monetary penalty of three hundred and fifty thousand dollars ($350,000) in the aggregate that must be paid to the SEC. The Company and Mr. Govil have remitted the payments as of September 30, 2022. The SEC Order can be accessed at www.sec.gov.\nBusiness Strategy\nOur focus is to utilize our resources and capabilities to build brands and businesses in areas where we see unique opportunities to create exceptional value for our customers, shareholders, and employees over the long term. We aim to grow in markets where we see significant long-term opportunity to create an attractive return on shareholder equity. Generally, these markets are high growth markets that are changing due to innovation, new technologies, or other industry shifts taking place. In these markets we seek to build or acquire businesses that have attractive gross margins, strong opportunities for customer retention, and are asset light. We take a long-term approach with our strategies and seek returns over five years or longer time horizons.\nWe believe our ability to attract and retain new customers comes from our ongoing commitment to understanding our customers business performance requirements and our expertise in meeting or exceeding these requirements and enhancing their competitive advantage through cutting edge technology. We work closely with our customers from an operational and senior executive level to achieve a deep understanding of our customers goals, challenges, strategies, operations, and products to ultimately provide the best solutions for them.\nWe continue to seek and execute additional strategic acquisitions and focus on expanding our products and services as well as entering new markets. We believe that the diversity of our products and services and our ability to deliver full solutions to a variety of end markets provides us with multiple sources of income and growth and a competitive advantage relative to other players in the industry. We constantly look for opportunities to gain new customers and penetrate geographic locations and end markets or acquire new product or service opportunities through acquisitions that are operationally and financially beneficial for the Company.\nSuppliers\nThe Company is not solely dependent on, nor expects to become overtly dependent on, any one or a limited number of suppliers. The Company also utilizes sub-suppliers and third-party vendors to procure from or fabricate its components based on its design, engineering, and specifications. The Company also enters into subcontracts for field installation, which the Company supervises; and the Company manages all technical, physical and commercial aspects of the performance of the Company contracts.\nCompetition\nThe Company competes on the basis of price, engineering and technological expertise, know-how and the quality of its products, systems and services. Additionally, the Companys management believes that the successful delivery, installation and performance of the Companys products and systems is a key factor in gaining business as customers typically prefer to make significant purchases from a company with a solid performance history.\nThe Company obtains virtually all its contracts through competitive bidding. Although price is an important factor and may in some cases be the governing factor, it is not always determinative, and contracts are often awarded on the basis of the efficiency or reliability of products, past performance records, and the engineering and technical expertise of the bidder. Several companies market products that compete directly with Companys products. Other companies offer products that potential customers may consider to be acceptable alternatives to Companys products and services.\nIntellectual Property\nOver the years, the Company has developed proprietary technologies that give it an edge in competing with its competitors. Thus, the Company relies on a combination of trade secrets and know-how to protect its intellectual property. The Company currently has multiple patents and patent claims that it owns. Cemtrex continues to invest in research and development with the intention of developing proprietary technology and intellectual property as allowed by its financial resources.\nSales and Marketing\nThe Company sells its products globally and depending on the brand, relies on direct sales force, manufacturing representatives, distributors, integrators and installers, commission sales agents, magazine advertisements, internet advertising, trade shows, trade directories and catalogue listings, e-commerce, to market its products and services. The Companys arrangements with sales representatives accord each a defined territory or market within which to sell some or all of its products and systems, provide for the payment of agreed-upon sales commissions or wholesale pricing and are terminable at will. The Companys sales representatives do not have authority to execute contracts on the Companys behalf.\nThe Companys sales representatives also serve as an ongoing liaison function between the Company and its customers during the installation phase of the products and systems and address customers questions or concerns arising thereafter. The Company selects representatives based upon industry reputation, prior sales performance including number of prospective leads generated and sales closure rates, and the breadth of territorial coverage, among other criteria.\nTechnical inquiries received from potential customers are referred to the engineering personnel. Thereafter, the Companys sales and engineering personnel jointly prepare a budget proposal, or a final bid. The period between initial customer contact and issuance of an order is generally between two and twelve months.\nCustomers\nThe Companys principal customers in its Security segment are generally system integrators or channel partners who then sell our products and solutions to our end customers including, government agencies or commercial businesses. Historically, most of the customers have purchased individual products or systems which, in many instances, operate in conjunction with products and systems supplied by others. The Companys principal customers in its Industrial Services segment include businesses engaged in manufacturing, chemical, packaging, printing, electronics, automotive, construction, and metallurgical processing. No one single customer accounts for more than 10% of its annual sales.\nFor the Security segment, the Company is responsible for the design, production, supply, and delivery of products to its customers. In order to satisfy customer orders, in both segments, the Company must consistently meet production deadlines and maintain a high standard of quality.\nInsurance\nThe Company currently maintains different types of insurance, including general property coverage, and directors and officers insurance. The Company also maintains product liability insurance with respect to its products and equipment. Management believes that the insurance coverage that it has is adequate for its current business needs.\nEmployees\nThe Company employs approximately 328 full-time employees and approximately 5 part-time employees as of the date of this Annual Report, including 118 engaged in engineering, 129 in manufacturing and field service and 86 in administrative, sales and marketing functions.\nGovernment Regulation\nThe Companys operations are subject to certain foreign, federal, state and local regulatory requirements relating to, among others, environmental, waste management, labor and health and safety matters. Management believes that the Companys business is operated in material compliance with all such regulations. ITEM 1A. RISK FACTORS\nInvesting in our common stock involves a high degree of risk. Our business, reputation, results of operations, financial condition and stock price can be affected by a number of factors, whether currently known or unknown, including those described below. When any one or more of these risks materialize from time to time, our business, reputation, results of operations, financial condition and stock price can be materially and adversely affected.\nBecause of the following factors, as well as other factors affecting the Companys results of operations and financial condition, past financial performance should not be considered to be a reliable indicator of future performance, and investors should not use historical trends to anticipate results or trends in future periods. This discussion of risk factors contains forward-looking statements.\nYou should carefully consider the risks and uncertainties described below, together with all of the other information in this report, including the consolidated audited financial statements and the related notes appearing at the end of this annual report on Form 10-K, with respect to any investment in shares of our common stock. If any of the following risks actually occurs, our business, financial condition, results of operations and future prospects would likely be materially and adversely affected. In that event, the market price of our common stock could decline, and you could lose part or all of your investment. These statements, like all statements in this report, speak only as of the date of this report (unless another date is indicated) and we undertake no obligation to update or revise the statements in light of future development.\nRisks Related to Macroeconomics Conditions and International Operations\nOur operations and performance depend significantly on global and regional economic conditions and adverse economic conditions can materially adversely affect our business, results of operations and financial condition.\nAdverse macroeconomic conditions, including slow growth or recession, high unemployment, inflation, tighter credit, higher interest rates, and currency fluctuations, can adversely impact consumer confidence and spending and materially adversely affect demand for our products and services. In addition, consumer confidence and spending can be materially adversely affected in response to changes in fiscal and monetary policy, financial market volatility, declines in income or asset values, and other economic factors.\nIn addition to an adverse impact on demand for our products and services, uncertainty about, or a decline in, global or regional economic conditions can have a significant impact on our suppliers, contract manufacturers, logistics providers, distributors, and other channel partners, and developers. Potential outcomes include financial instability; inability to obtain credit to finance business operations; and insolvency.\nAdverse economic conditions can also lead to increased credit and collectability risk on our trade receivables; the failure of derivative counterparties and other financial institutions; limitations on our ability to issue new debt; reduced liquidity; and declines in the fair values of our financial instruments. These and other impacts can materially adversely affect our business, results of operations, financial condition and stock price.\nOur business can be impacted by political events, trade and other international disputes, war, terrorism, natural disasters, public health issues, industrial accidents and other business interruptions.\nPolitical events, trade and other international disputes, war, terrorism, natural disasters, public health issues (such as COVID-19), industrial accidents and other business interruptions can harm or disrupt international commerce and the global economy and could have a material adverse effect on us and our customers, suppliers, contract manufacturers, logistics providers, distributors, and other channel partners.\nRestrictions on international trade, such as tariffs and other controls on imports or exports of goods, technology or data, can materially adversely affect our operations and supply chain and limit our ability to offer and distribute products and services to customers. The impact can be particularly significant if these restrictive measures apply to countries and regions where we derive a significant portion of our revenues and/or have significant supply chain operations. Restrictive measures can require us to take various actions, including changing suppliers and restructuring business relationships. Changing our operations in accordance with new or changed restrictions on international trade can be expensive, time-consuming and disruptive to our operations. Such restrictions can be announced with little or no advance notice and we may not be able to effectively mitigate all adverse impacts from such measures. For example, tensions between governments, including the U.S. and China, have in the past led to tariffs and other restrictions being imposed on our business. If disputes and conflicts further escalate in the future, actions by governments in response could be significantly more severe and restrictive and could materially adversely affect our business. Political uncertainty surrounding trade and other international disputes could also have a negative effect on consumer confidence and spending, which could adversely affect our business.\nMany of our operations and facilities, as well as critical business operations of our suppliers and contract manufacturers, are in locations that are prone to earthquakes and other natural disasters. In addition, such operations and facilities are subject to the risk of interruption by fire, power shortages, nuclear power plant accidents and other industrial accidents, terrorist attacks and other hostile acts, ransomware and other cybersecurity attacks, labor disputes, public health issues, including pandemics such as the COVID-19 pandemic, and other events beyond our control. Global climate change is resulting in certain types of natural disasters, such as droughts, floods, hurricanes and wildfires, occurring more frequently or with more intense effects. Such events can make it difficult or impossible for us to manufacture and deliver products to our customers, create delays and inefficiencies in our supply and manufacturing chain, and result in slowdowns and outages to our product and service offerings, and negatively impact consumer spending and demand in affected areas. Following an interruption to our business, we can require substantial recovery time, experience significant expenditures to resume operations, and lose significant sales.\nOur operations are also subject to the risks of industrial accidents at our suppliers and contract manufacturers. While our suppliers are required to maintain safe working environments and operations, an industrial accident could occur and could result in serious injuries or loss of life, disruption to our business, and harm to our reputation. Major public health issues, including pandemics such as the COVID-19 pandemic, have adversely affected, and could in the future materially adversely affect, us due to their impact on the global economy and demand for consumer products; the imposition of protective public safety measures, such as stringent employee travel restrictions and limitations on freight services and the movement of products between regions; and disruptions in our operations, supply chain and sales and distribution channels, resulting in interruptions to the supply of current products and offering of existing services, and delays in production ramps of new products and development of new services.\nVolatility in currency exchange rates may adversely affect our financial condition, results of operations and cash flows.\nOur international operations accounted for approximately 9.2% of our net sales in 2023. We are exposed to the effects (both positive and negative) that fluctuating exchange rates have on translating the financial statements of our international operations, most of which are denominated in local currencies, into the U.S. dollar. Fluctuations in exchange rates may affect product demand and reported profits in our international operations. In addition, currency fluctuations may affect the prices we pay suppliers for materials used in our products, along with other local costs incurred in foreign countries for foreign entities with U.S. dollar functional currency. As a result, fluctuating exchange rates may adversely impact our results of operations and cash flows.\nOur business and results of operations may be materially adversely affected by compliance with import and export laws.\nWe must comply with various laws and regulations relating to the import and export of products, services and technology from the U.S. and other countries having jurisdiction over our operations, which may affect our transactions with certain customers, business partners and other persons. In certain circumstances, export control and economic sanctions regulations may prohibit the export of certain products, services, and technologies and in other circumstances, we may be required to obtain an export license before exporting a controlled item. The length of time required by the licensing processes can vary, potentially delaying the shipment of products or performance of services and the recognition of the corresponding revenue. In addition, failure to comply with any of these regulations could result in civil and criminal, monetary and non-monetary penalties, disruptions to our business, limitations on our ability to import and export products and services and damage to our reputation. Moreover, any changes in export control or sanctions regulations may further restrict the export of our products or services, and the possibility of such changes requires constant monitoring to ensure we remain compliant. Any restrictions on the export of our products or product lines could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\nRisks Related to Covid-19\nThe global pandemic may disrupt our business or the business of our customers.\nIn December 2019, a novel strain of corona virus, which causes the infectious disease known as COVID-19 was reported. The World Health Organization declared COVID-19 a Public Health Emergency and Global Pandemic. COVID-19 has severely impacted economies around the world.\nThe current COVID-19 pandemic has impacted our business operations and the results of our operations in this fiscal year, primarily with delays in expected orders by many customers and new product development, including newer versions of surveillance software since our technical facility in Pune, India has been under lock down on multiple occasions. Bookings and revenue have largely recovered in this calendar year compared to last year. In addition, due to delays in certain supply chain areas, the expected launch times of our new products and new versions has resulted in delays of several months.\nThe broader implications of COVID-19 on our results from operations going forward remains uncertain. The COVID-19 pandemic has the potential to cause adverse effects to our customers, suppliers or business partners in locations that have or will experience more pronounced disruptions, which could result in a reduction to future revenue and manufacturing output as well as delays in our new product development activities. However, on the other hand, opportunities in the video surveillance field have been growing for Vicon products.\nThe extent of the pandemics effect on our operational and financial performance will depend in large part on future developments, which cannot be reasonably estimated at this time. Future developments include the duration, scope and severity of the pandemic, the emergence of new virus variants that are more contagious or harmful than prior variants, the actions taken to contain or mitigate its impact both within and outside the jurisdictions where we operate, the impact on governmental programs and budgets, the development of treatments or vaccines, and the resumption of widespread economic activity. Due to the inherent uncertainty of the unprecedented and rapidly evolving situation, we are unable to predict with any confidence the likely impact of the COVID-19 pandemic on our future operations. This could materially impact our results of operations, cash flows, and financial condition.\nRisks Related to our Financial Condition\nThere is no guarantee that cash flow from operations and/or debt and equity financings will provide sufficient capital to meet our expansion goals working capital needs or fund our operations.\nOur current strategic plan includes the expansion of our company both organically and through acquisitions if market conditions and competitive conditions allow. Due to the long-term nature of investments in acquisitions and other financial needs to support organic growth, including working capital, we expect our long-term and working capital needs to periodically exceed the short-term fluctuations in cash flow from operations. We anticipate that we may need to raise additional external capital from the sale of common stock, preferred stock and debt instruments as market conditions may allow, in addition to cash flow from operations (which may not always be sufficient), to fund our growth and working capital needs.\nIn the event that we need to raise significant amounts of external capital at any time or over an extended period, we face a risk that we may need to do so under adverse capital market conditions with the result that our existing shareholders, as well as persons who acquire our common stock, may incur significant and immediate dilution should we raise capital from the sale of our common or preferred stock. Similarly, we may need to meet our external capital needs from the sale of secured or unsecured debt instruments at interest rates and with such other debt covenants and conditions as the market then requires. However, there can be no guarantee that we will be able to raise external capital on terms that are reasonable in light of current market conditions. In the event that we are not able to do so, those who acquire our common stock may face significant and immediate dilution and other adverse consequences. Further, debt covenants contained in debt instruments that we issue may limit our financial and operating flexibility with consequent adverse impact on our common stock market price.\nWe have a history of losses and may experience losses in the future, which could result in the market price of our common stock declining.\nWe have incurred net losses, including net losses attributable to Cemtrex, Inc. shareholders of $9.2 million in 2023, $13.0 million in 2022, and $7.8 million in 2021. We have an accumulated deficit of $64.2 million as of September 30, 2023. We expect to continue to incur significant product development, sales and marketing and administrative expenses. As a result, we will need to generate significant revenues to achieve profitability. We cannot be certain that we will achieve profitability in the future or, if we achieve profitability, to sustain it. If we do not achieve and maintain profitability, the market price for our common stock may decline, perhaps substantially.\nThe Company is exposed to credit risk, market risk, and fluctuations in the value of its investment portfolio.\nThe Company may, from time to time invest excess cash that the Company has on hand in large cap securities listed on major exchanges, including stocks and options. The Companys investments can be negatively affected by liquidity, credit deterioration, financial results, market and economic conditions, political risk, sovereign risk, interest rate fluctuations or other factors.\nAlthough we have not recognized any material losses related to our cash equivalents, short-term investments, or long-term investments, future declines in the market values of such investments could have an adverse effect on our financial condition and operating results. As a result, the value and liquidity of the Companys cash, cash equivalents, and marketable securities may fluctuate substantially. Therefore, although the Company has not realized any significant losses on its cash, cash equivalents, and marketable securities, future fluctuations in their value could result in significant losses and could have an adverse impact on the Companys financial condition and operating results.\nWe have substantial debt which could adversely affect our ability to raise additional capital to fund operations and prevent us from meeting our obligations under outstanding indebtedness.\nAs of September 30, 2023, our total indebtedness was approximately $24.4 million, including notes payable of $18.1 million, mortgage payable of $3.4 million, vendor financed purchase of $0.7 million, and bank loans of $2.2 million, including $0.9 million of PPP loans that the Company expects to be forgiven. By comparison, as of September 30, 2022, our total indebtedness was approximately $20.6 million, including notes payable of $17.7 million, mortgage payable of $2.3 million, and bank loans of $0.6 million, including $0.1 million of PPP loans. For 2023 and 2022 approximately $14.5 million and $16.9 million, respectively, of such debt is classified as current. This substantial debt could have important consequences, including the following: (i) a substantial portion of our cash flow from operations may be dedicated to the payment of principal and interest on indebtedness, thereby reducing the funds available for operations, future business opportunities and capital expenditures; (ii) our ability to obtain additional financing for working capital, debt service requirements and general corporate purposes in the future may be limited; (iii) we may face a competitive disadvantage to lesser leveraged competitors; (iv) our debt service requirements could make it more difficult to satisfy other financial obligations; and (v) we may be vulnerable in a downturn in general economic conditions or in our business and we may be unable to carry out activities that are important to our growth.\nOur ability to make scheduled payments of the principal of, or to pay interest on, or to refinance our indebtedness depends on and is subject to our financial and operating performance, which in turn is affected by general and regional economic, financial, competitive, business and other factors beyond managements control. If we are unable to generate sufficient cash flow to service our debt or to fund our other liquidity needs, we will need to restructure or refinance all or a portion of our debt, which could impair our liquidity. Any refinancing of indebtedness, if available at all, could be at higher interest rates and may require us to comply with more onerous covenants that could further restrict our business operations. Despite our significant amount of indebtedness, we may need to incur significant additional amounts of debt, which could further exacerbate the risks associated with our substantial debt.\nOur ability to secure and maintain sufficient credit arrangements is key to our continued operations and there is no assurance we will be able to obtain sufficient additional equity or debt financing in the future.\nThere is no assurance that we will be able to retain or renew our credit agreements and other finance agreements in the future. In the event our company grows rapidly, the uncertain economic climate continues, or we acquire one or more other companies, additional financing resources will likely be necessary in the current or future fiscal years. As a smaller public company with a limited ability to attract and obtain financing, there is no assurance that we will be able to obtain sufficient additional equity or debt financing in the future on terms that are reasonable in light of current market conditions.\nRisks Related to our Business\nWe are substantially dependent upon the success and continued market acceptance of our technology, the absence of which may significantly reduce our sales, profits and cash flow and adversely impact our financial condition.\nCompeting technologies may be offered by both existing competitors or by those that enter the market, and these competing technologies may offer a better cost-benefit ratio than our products and/or at lower prices with the result that our sales, profits, and cash flow may suffer significantly over an extended period with serious adverse impact on our financial condition.\nWe have taken a multi-operational approach, and some of our business segments have historically failed to benefit our company to date, and there remains a risk that our remaining segments may not prove to be successful. We may divest or expand into new areas that are outside of our current business activities and those activities may not prove to be successful.\nWe continuously assess the composition of our portfolio businesses to ensure it is aligned with our strategic objectives and positioned to maximize growth and return in the coming years. Since our business concerns new and developing technologies, and many of these endeavors fail, some of the businesses in our portfolio may not be successful in generating sufficient revenue to be a viable option for our company.\nCurrently, the Company has the following business segments, consisting of (i) Security, (ii) Industrial Services, and (iii) Cemtrex Corporate. Within these segments there are a number of technologies that we are pursuing, as discussed in this annual report under Item 1. Business. There is a risk that one or more of our technologies will not be successful in generating revenue to sustain the expenditures associated with its existence. Moreover, having multiple business segments may present challenges, such as fluctuations in our operating results, using the companys limited resources on less worthy business pursuits, and distracting management from obtaining its goals with respect to our overall operations. If we are unable to establish our technologies in the market, and overcome the challenges of doing so, we could go out of business.\nAs we continuously review our portfolio of businesses we may exit or enter into new business activities which may ultimately prove to be unsuccessful.\nOur future operating results depend in part on continued successful research, development and marketing of new and improved products and services through our Security segment, and there can be no assurance that we will successfully introduce new products and services into the market.\nThe success of new and improved products and services through our Security segment depends on our research and development efforts and the initial acceptance of our products and solutions by consumers. Our business is affected by varying degrees of technological change and corresponding shifts in customer demand, which result in unpredictable product transitions, shortened life cycles and increased importance of being first to market with new products and services. We may experience difficulties or delays in the research and development, production and/or marketing of new products and services due to lack of capital, which may negatively impact our operating results and prevent us from recouping or realizing a return on the investments required to continue to bring new products and services to market.\nOur future operating results depends in part on the continued successful operation of our Industrial Services segment, and there can be no assurance that we will be successful in this business.\nThe success of selling services through our Industrial Services segment depends on our ability to hire and retain talent, our ability to market these services successfully to clients, the overall demand for these services, and the quality of our workmanship by our customers, among other factors. Our business is affected by varying degrees of technological change and corresponding shifts in customer demand, which result in unpredictable product transitions, shortened life cycles and increased importance of being first to market with new products and services. We may experience difficulties or delays in the delivery of services due to lack of capital or lack of adequate talent, which may negatively impact our operating results and prevent us from recouping or realizing a return on the investments required to continue to compete in our markets.\nOur operating results may fluctuate, which could have a negative impact on our ability to grow our client base, establish sustainable revenues and succeed overall.\nOur results of operations may fluctuate as a result of a number of factors, some of which are beyond our control including but not limited to:\n■ general economic conditions in the geographies and industries where we sell our services and conduct operations; legislative policies where we sell our services and conduct operations;\n■ the budgetary constraints of our customers; seasonality;\n■ success of our strategic growth initiatives;\n■ costs associated with the launching or integration of new or acquired businesses;\n■ timing of new product introductions by us, our suppliers and our competitors; product and service mix, availability, utilization and pricing;\n■ the mix, by state and country, of our revenues, personnel and assets;\n■ movements in interest rates or tax rates;\n■ changes in, and application of, accounting rules;\n■ changes in the regulations applicable to us;\n■ litigation matters.\nAs a result of these factors, we may not succeed in our business, and we could go out of business.\nWe operate in a cyclical business, which could result in significant fluctuations in demand for our products.\nCyclical changes in our customers businesses have, in the past, resulted in, and may in the future result in, significant fluctuations in demand for our products, selling prices, and our profitability. Most of our customers operate in cyclical industries. Their requirements for our technologies fluctuate significantly as a result of changes in general economic conditions, technological changes, customer demand, and other factors. During periods of increasing demand, our customers typically seek to increase their inventory of our products to avoid production bottlenecks. When demand for their products peaks and begins to decline, as has happened in the past, they tend to reduce or cancel orders for our products while they use up accumulated inventory. Business cycles vary somewhat in different geographical regions and customer industries. Significant fluctuations in sales of our products affect our unit manufacturing costs and affect our profitability by making it more difficult for us to predict our production, raw materials, and shipping needs. Changes in demand mix, needed technologies, and end-use markets may adversely affect our ability to match our products, inventory, and capacity to meet customer demand and could adversely affect our operating results and financial condition. We are also vulnerable to general economic events or trends beyond our control, and our sales and profits may suffer in periods of weak demand.\nOur sales and gross margins depend significantly on market demand for our products, as to which there can be no assurance.\nThe uncertainty in the United States and in the international economic and political environment could result in a decline in demand for our products in any industry. Our gross margins are dependent upon our ability to maintain sales volumes at levels that allow us to cover our fixed costs and variable costs per unit. To the extent that one or more product lines experience a significant and protracted decline in sales volume, we may experience significant declines in our gross margins that may result in losses. Further, any adverse changes in tax rates and laws affecting our customers could result in decreases in demand of our products and thus decrease our gross margins. Any of these factors could negatively impact our business, results of operations and financial condition.\nIn these circumstances, we anticipate that we could be required to increase or decrease staffing and more closely manage other expenses in order to meet the anticipated demand of our existing and future customers. Orders from our customers are subject to cancellation, and delivery schedules from our customers fluctuate as a result of changes in our customers demand, thereby adversely affecting our results of operations, and may result in higher inventory levels. Higher inventory levels may cause us to need greater external financing, which adversely affects our financial performance.\nOur products face intense competitive challenges, including rapid technological changes, and pricing pressure from competitors, which could adversely affect our business.\nAll of our product lines are subject to significant competition from existing and future competitors, market conditions and technological change, or a combination of them, and our sales revenues and gross margins may suffer protracted and serious declines with the result that we would likely incur protracted losses. Further, the barriers to entry in several of our lines of business are not so significant that we may be facing competition from others who see significant opportunities to enter the market and undercut our prices with products that possess superior technological attributes at prices that offer our customers a better value. In this instance, we could incur protracted and significant losses and persons who acquire our common stock would suffer losses thereby.\nFrom time to time, we may need to reduce our prices in response to competitive and customer pressures and to maintain our market share. Competition and customer pressures may also restrict our ability to increase prices in response to commodity and other input cost increases. Our results of operations will suffer if profit margins decrease, as a result of a reduction in prices, increased input costs or other factors, and if we are unable to increase sales volumes to offset those profit margin decreases. We may also need to increase spending on marketing, advertising and new product innovation to protect existing market share or increase market share. The success of our investments is subject to risks, including uncertainties about trade and consumer acceptance. As a result, our increased expenditures may not maintain or enhance market share and could result in lower profitability.\nFactors affecting the industries that utilize our products could negatively impact our customers and us.\nWe have no real control over factors affecting the industries that utilize our products and to the extent that any one or more of these industries change dramatically, we may be facing significant financial challenges that are in excess of our existing capabilities. These factors include:\n● increased competition among our customers and their competitors;\n● the inability of our customers to develop and market their products;\n● recessionary periods in our customers markets;\n● the potential that our customers products become obsolete;\n● our customers inability to react to rapidly changing technology; and\n● our customers inability to pay for our products, which could, in turn, affect the companys results of operations.\nIf we are unable to develop new products, our competitors may develop and market products with better features that may reduce demand for our existing and potential products or otherwise result in our products becoming obsolete and could materially and adversely affect our ability to sustain profitability.\nThere are many larger competitors who compete directly with us and who have significantly greater financial, technological and research resources. This may serve to severely damage our ability to market and sell our products at price levels that would allow us to achieve and maintain profit margins and positive cash flow.\nWe are a smaller public company, and we face rapid technological change in many of our product markets and we may not be able to introduce any successful new products or any enhancements to our existing products on a timely basis, or at all. This could result in prolonged and significant losses. In addition, our introduction of new products could adversely affect sales of certain of our existing products if these new products directly compete with our existing products. If our competitors develop innovative technologies that are superior to our products or if we fail to accurately anticipate market trends and respond on a timely basis with our own innovations, we may not achieve sufficient growth in its revenues to attain profitability or if we do, we may not be able sustain profitability.\nThe success of new product introductions is dependent on a number of factors, including, but not limited to, timely and successful development of new products, including software development, market acceptance of these products and our ability to manage the risks associated with these introductions. These risks include development and production capabilities, management of inventory levels to support anticipated demand, the risk that new products may have quality defects in the early stages of introduction, and obsolescence risk of existing products.\nDeveloping and maintaining a patent portfolio is an expensive and time-consuming process and there is no assurance the Company will successfully develop patents to protect the intellectual property it is working on.\nWe are increasingly dependent on information technology, and if we are unable to protect against service interruptions, data corruption, cyber-based attacks, or network security breaches our operations could be disrupted and we could incur significant costs and reputational harm as a result\nWe rely on information technology networks and systems, including the Internet, to process, transmit, and store electronic and financial information; to manage a variety of business processes and activities; and to comply with regulatory, legal, and tax requirements. We also depend on our information technology infrastructure for digital marketing and sales activities and for electronic communications among our locations, personnel, customers, and suppliers around the world. Many of the information technology systems used by us globally have been in place for many years and not all hardware and software is currently supported by vendors. These information technology systems are susceptible to damage, disruptions, or shutdowns due to failures during the process of upgrading or replacing software, databases or components thereof, power outages, hardware failures, computer viruses, cyber-attacks, telecommunication failures, user errors, or catastrophic events. If our information technology systems suffer severe damage, disruption, or shutdown and our business continuity plans do not effectively resolve the issues in a timely manner, our product sales, financial condition, and results of operations may be materially affected, and we could experience delays in reporting our financial results.\nWe have been, and likely will continue to be, subject to various cyber-attacks. To date, we have seen no material impact on our business or operations from these attacks or events. Any future significant compromise, breach, or misuse of our data security could result in significant costs and damage to our reputation. The ever-evolving threats mean us and our third-party service providers must continually evaluate and adapt our respective systems and processes and overall security environment, as well as those of any companies we acquire. There is no guarantee that these measures will be adequate to safeguard against all data security compromises, breaches, or misuses. In addition, as the regulatory environment related to information security, data collection and use, and privacy becomes increasingly rigorous, compliance with those requirements could also result in additional costs.\nThird-party service providers, such as distributors, subcontractors, vendors, and data processors have access to certain portions of our sensitive data. In the event that these service providers do not appropriately protect our data, the result could be a security breach or loss of our data. Any such loss of data by our third-party service providers could have a material adverse impact on our business and results of operations.\nIn addition, if we are unable to prevent security breaches, we may suffer financial and reputational damage or penalties because of the unauthorized disclosure of confidential information belonging to us or to our customers or suppliers. Furthermore, the disclosure of non-public sensitive information through external media channels could lead to the loss of intellectual property or damage our reputation and brand image.\nWe are also in the process of converting certain information technology networks and systems and consolidating certain global systems. If such projects fail, or if unexpected technical difficulties arise, our operations and financial systems could be adversely affected. Further, we could incur additional costs or require additional technical support to resolve such difficulties.\nOur operating results are sensitive to raw material and resale product availability, quality, and cost\nWe seek to have many sources of supply for each of our major requirements in order to avoid significant dependence on any one or a few suppliers. However, the supply of materials or other items could be disrupted by natural disasters, international trade tariffs, wars, pandemics, disputes and or other events. Despite market price volatility for certain requirements and materials pricing pressures at some of our businesses, the raw materials and various purchased components needed for our products have generally been available in sufficient quantities. In some instances, lead times have extended beyond normal due to logistic delays and labor shortages occurring globally. Some of our products, however, require the use of raw materials that are available from only a limited number of regions around the world, are available from only a limited number of suppliers, or may be subject to significant fluctuations in market prices. Our results of operations may be adversely affected if we have difficulty obtaining these raw materials, our key suppliers experience financial difficulties, the quality of available raw materials deteriorates, or there are significant price increases for these raw materials. Our inability to recover increased costs through increased sales prices could have an adverse impact on our results of operations. For periods in which the prices for these raw materials rise, we may be unable to pass on the increased cost to our customers, which would result in decreased sales margins for the products in which they are used. For periods in which prices for these raw materials decline, we may be required, as has occurred in the past, to write down our inventory carrying cost of these raw materials and products. Depending on the extent of the difference between market price and our carrying cost, the write-down could have a significant adverse effect on our results of operations.\nWe resell products manufactured by other component and interconnect product manufacturers. Should these manufacturers experience difficulties supplying the products that we resell, or such suppliers use other channels to market their products, we could experience lower sales, which could have an adverse effect on our results of operations.\nRisks Related to Legal Uncertainty\nWe could be subject to additional civil penalties or face criminal penalties and sanctions if we violate the terms of settlement with the SEC.\nOn September 30, 2022, acting pursuant to an offer of settlement submitted by the Company, the SEC issued an order pursuant to Section 8A of the Securities Act, directing the Company to cease and desist from committing or causing any violations and any future violations of Section 17(a) of the Securities Act and Section 10(b) of the Exchange Act and Rule 10b-5 thereunder (the SEC Order).\nWhile we have already paid the penalties imposed by the order into which we entered pursuant to the SEC Order, it contains ongoing and continuing requirements that we refrain from violating the Securities Act. Any future violation of applicable securities laws by us or management could result in harsher sanctions and fines, which would have a material adverse effect on our ability to implement our business plans. SEC staff can make reasonable requests from us for further evidence of compliance. Such requests for further information, record-keeping requirements and others generally could divert managements attention from implementing its business plans and could require additional material expenditures by us to legal counsel or other advisors and service providers. Further issues could reduce investor and shareholder confidence in our company and could result in a failure to execute on our business plan, which would negatively impact our business. A copy of the SEC Order can be found at www.sec.gov.\nOur global operations subject us to many different and complex laws and rules, and we may face difficulty in compliance.\nDue to our global operations, we are subject to many laws governing international relations (including but not limited to the Foreign Corrupt Practices Act, the U.S. Export Administration Act the EU General Data Protection Regulation, and the U.K. Modern Anti-Slavery Act); which prohibit improper payments to government officials and restrict where and how we can do business, what information or products we can supply to certain countries, what personal information we can transfer, and what information we can provide to a non-U.S. government. Although we have procedures and policies in place that should mitigate the risk of violations of these laws, there is no guarantee that they will be sufficiently effective. If, and when we acquire new businesses, we may not be able to ensure that the pre-existing controls and procedures meant to prevent violations of the rules and laws were effective, and we may not be able to implement effective controls and procedures to prevent violations quickly enough when integrating newly acquired businesses. Acquisitions of new businesses in new non-U.S. jurisdictions may also subject us to new regulations and laws, and we may face difficulties ensuring compliance with these new requirements.\nProvisions in the Delaware law and our Bylaws could make it very difficult for an investor to bring any legal actions against our directors or officers for violations of their fiduciary duties or could require us to pay any amounts incurred by our directors or officers in any such actions.\nMembers of our board of directors and our officers will have no liability for breaches of their fiduciary duty of care as a director or officer, except in limited circumstances, pursuant to provisions in the Delaware law and our Bylaws. Accordingly, you may be unable to prevail in a legal action against our directors or officers even if they have breached their fiduciary duty of care. In addition, our Bylaws allow us to indemnify our directors and officers from and against any and all costs, charges and expenses resulting from their acting in such capacities with us. This means that if you were able to enforce an action against our directors or officers, in all likelihood, we would be required to pay any expenses they incurred in defending the lawsuit and any judgment or settlement they otherwise would be required to pay. Accordingly, our indemnification obligations could divert needed financial resources and may adversely affect our business, financial condition, results of operations and cash flows, and adversely affect prevailing market prices for our common stock.\nIf we fail to establish, maintain, and enforce intellectual property rights with respect to our technology, our financial condition, results of operations and business could be negatively impacted.\nOur ability to establish, maintain and enforce intellectual property rights with respect to our proprietary technologies, patents, patent applications, software and other rights will be a significant factor in determining our future financial and operating performance. We seek to protect our intellectual property rights by relying on a combination of patent, trade secret and copyright laws. We also use confidentiality and other provisions in our agreements that restrict access to and disclosure of our confidential know-how and trade secrets.\nWe have filed patent applications with respect to many aspects of our technologies. However, we cannot provide any assurances that any of these applications will ultimately result in issued patents or, if patents are issued, that they will provide sufficient protections for our technology against competitors. Although we have filed various patent applications for some of our core technologies, we currently hold only six issued patents, with two in the United States and four in Canada, and we may face delays and difficulties in obtaining our other filed patents, or we may not be able to obtain such patents at all.\nOutside of these patent applications, we seek to protect our technology as trade secrets and technical know-how. However, trade secrets and technical know-how are difficult to maintain and do not provide the same legal protections provided by patents. In particular, only patents will allow us to prohibit others from using independently developed technology that are similar. If competitors develop knowledge substantially equivalent or superior to our trade secrets and technical know-how or gain access to our knowledge through other means such as observation of our technology that embodies trade secrets at customer sites which we do not control, the value of our trade secrets and technical know-how would be diminished.\nWhile we strive to maintain systems and procedures to protect the confidentiality and security of our trade secrets and technical know-how, these systems and procedures may fail to provide an adequate degree of protection. For example, although we generally enter into agreements with our employees, consultants, advisors, and strategic partners restricting the disclosure and use of trade secrets, technical know-how and confidential information, we cannot provide any assurance that these agreements will be sufficient to prevent unauthorized use or disclosure. In addition, some of the technology deployed at customer sites in the future, which we do not control, may be readily observable by third parties who are not under contractual obligations of non-disclosure, which may limit or compromise our ability to continue to protect such technology as a trade secret.\nMonitoring and policing unauthorized use and disclosure of intellectual property is difficult. If we learned that a third party was in fact infringing or otherwise violating our intellectual property, we may need to enforce our intellectual property rights through litigation. Litigation relating to our intellectual property may not prove successful and might result in substantial costs and diversion of resources and management attention.\nFrom our customers standpoint, the strength of the intellectual property under which we control can be a critical determinant of the value of our products and services. If we are unable to secure, protect and enforce our intellectual property, it may become more difficult for us to attract new customers. Any such development could have a material adverse effect on our business, prospects, financial condition and results of operations.\nWe may not have sufficient financial resources to defend our intellectual property rights or otherwise successfully defend against claims that we have infringed on a third partys intellectual property and, as a result, it may adversely affect our business, financial condition and results of operations.\nEven if such claims are not valid, they could subject us to significant costs. In addition, it may be necessary in the future to enforce our intellectual property rights to determine the validity and scope of the proprietary rights of others. Litigation may also be necessary to defend against claims of infringement or invalidity by others. We may not have sufficient financial resources to defend our intellectual property rights or otherwise to successfully defend the company against valid or spurious claims that we have infringed upon the intellectual property rights of others. An adverse outcome in litigation or any similar proceedings could force us to take actions that could harm its business. These include: (i) ceasing to sell products that contain allegedly infringing property; (ii) obtaining licenses to the relevant intellectual property which we may not be able to obtain on terms that are acceptable, or at all; (iii) indemnifying certain customers or strategic partners if it is determined that we have infringed upon or misappropriated another partys intellectual property; and (iv) redesigning products that embody allegedly infringing intellectual property. Any of these results could adversely and significantly affect our business, financial condition and results of operations. In addition, the cost of defending or asserting any intellectual property claim, both in legal fees and expenses, and the diversion of management resources, regardless of whether the claim is valid, could be significant and lead to significant and protracted losses.\nProduct liability lawsuits against us could cause us to incur substantial liabilities and to limit commercialization of our product or any future products that we may develop.\nWe face an inherent risk of product liability exposure related to the sale of our products and the future sale of planned products. We may be sued if any of our products allegedly causes injury. Any such product liability claims may include allegations of defects in manufacturing, defects in design, a failure to warn of dangers inherent in the product, negligence, strict liability, and a breach of warranties. We may also be subject to liability for a misunderstanding of, or inappropriate reliance upon, the information we provide. If we cannot successfully defend ourselves against claims that our product or planned products caused injuries, we may incur substantial liabilities. Regardless of merit or eventual outcome, liability claims may result in:\n■ decreased demand for our product or any planned products that we may develop;\n■ injury to our reputation and significant negative media attention;\n■ significant costs to defend the related litigation and distraction to our management team;\n■ substantial monetary awards to plaintiffs;\n■ loss of revenue; and\n■ the inability to commercialize any future products that we may develop.\nSuch events could subject us to costly litigation, require us to pay substantial amounts of money to injured parties, delay, negatively impact, or end our opportunity to market those products, or require us to suspend or abandon our commercialization efforts. Even in a circumstance in which we do not believe that an adverse event is related to our product, the investigation into the circumstance may be time-consuming or inconclusive. These investigations may interrupt our sales efforts. As a result of these factors, a product liability claim, even if successfully defended, could harm our business.\nWe currently maintain product liability insurance coverage, which may not be adequate to cover all liabilities that we may incur. Insurance coverage is increasingly expensive. We may not be able to maintain insurance coverage at a reasonable cost or in an amount adequate to satisfy any liability that may arise.\nIf we experience material weaknesses in the future or otherwise fail to maintain an effective system of internal control over financial reporting in the future, we may not be able to accurately or timely report our financial condition or results of operations, which may adversely affect investor confidence in us and, as a result, the value of our common stock.\nAs a public company, we are required to maintain internal control over financial reporting and to report any material weaknesses in such internal controls. Section 404 of the Sarbanes-Oxley Act requires that we evaluate and determine the effectiveness of our internal control over financial reporting and provide a management report on internal control over financial reporting. A material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of our financial statements will not be prevented or detected on a timely basis. Ensuring that we have adequate internal financial and accounting controls and procedures in place so that we can produce accurate financial statements on a timely basis is a costly and time-consuming effort. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with Generally Accepted Accounting Principles. We may not be able to complete our evaluation, testing and any required remediation in a timely fashion. During the evaluation and testing process, if we identify one or more material weaknesses in our internal control over financial reporting, we will be unable to assert that our internal controls are effective. The identification of one or more material weaknesses would preclude a conclusion that we maintain effective internal control over financial reporting. Accordingly, there could continue to be a reasonable possibility that a material misstatement of our financial statements would not be prevented or detected on a timely basis.\nOur management, including our principal executive officer and principal accounting officer, conducted an evaluation of the effectiveness of our internal control over financial reporting using the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013). Based on its evaluation, our management concluded that as of September 30, 2023, that our internal control over financial reporting were effective.\nWe are required to disclose changes made in our internal control and procedures on a quarterly basis. However, our independent registered public accounting firm will not be required to report on the effectiveness of our internal control over financial reporting pursuant to Section 404 of the Sarbanes-Oxley Act until we are no longer an smaller reporting company. At such time, our independent registered public accounting firm may issue a report that is adverse in the event it is not satisfied with the level at which our controls are documented, designed or operating. Our remediation efforts may not enable us to avoid a material weakness in the future. If we are unable to assert that our internal control over financial reporting is effective, or when required in the future, if our independent registered public accounting firm is unable to express an unqualified opinion as to the effectiveness of our internal control over financial reporting, investors may lose confidence in the accuracy and completeness of our financial reports and the market price of our common stock could be adversely affected, and we could become subject to investigations by the stock exchange on which our securities are listed, the SEC, or other regulatory authorities, which could require additional financial and management resources.\nRisks Related to Acquisitions\nWe have grown through acquisitions and are continuously looking to fund other acquisitions; our failure to raise funds for acquisitions may have the effect of slowing down our growth and our use of funds for acquisitions subjects us to acquisition-related risks.\nWe intend to make acquisitions of complementary (including competitive) businesses, products and technologies. However, any future acquisitions may result in material transaction costs, increased interest and amortization expenses related to goodwill and other intangible assets, increased depreciation expense and increased operating expenses, any of which could have an adverse effect on our operating results and financial position. Acquisitions will require integration of acquired assets and management into our operations to realize economies of scale and control costs. Acquisitions may involve other risks, including diversion of management attention that would otherwise be available for ongoing internal development of our business and risks inherent in entering markets in which we have no or limited prior experience. In connection with future acquisitions, we may make potentially dilutive issuances of equity securities. In addition, consummation of acquisitions may subject us to unanticipated business uncertainties, contingent liabilities or legal matters relating to those acquired businesses for which the sellers of the acquired businesses may not fully indemnify us. There can be no assurance that our business will grow through acquisitions, as anticipated.\nWe may fail to successfully integrate our acquisitions or otherwise be unable to benefit from pursuing acquisitions.\nWe believe there are meaningful opportunities to grow through acquisitions and joint ventures across all product categories and we expect to continue a strategy of selectively identifying and acquiring businesses with complementary products. We may be unable to identify, negotiate, and complete suitable acquisition opportunities on reasonable terms. There can be no assurance that any business acquired by us will be successfully integrated with our operations or prove to be profitable to us. We may incur future liabilities related to acquisitions. Should any of the following problems, or others, occur as a result of our acquisition strategy, the impact could be material:\n■ difficulties integrating personnel from acquired entities and other corporate cultures into our business;\n■ difficulties integrating information systems;\n■ the potential loss of key employees of acquired companies;\n■ the assumption of liabilities and exposure to undisclosed or unknown liabilities of acquired companies; or\n■ the diversion of management attention from existing operations.\nRisks Related to Our Management and Control Persons\nThe loss of the services of Saagar Govil for any reason would materially and adversely affect our business operations and prospects.\nOur financial success is dependent to a significant degree upon the efforts of Saagar Govil, our Chairman, President and Chief Executive Officer. Saagar Govil possesses management, financial expertise, engineering, sales and marketing experience concerning our company that our other officers do not have. We have not entered into an employment arrangement with Mr. Govil, and we have not obtained key man insurance over him. There can be no assurance that Saagar Govil will continue to provide services to us. A voluntary or involuntary departure by Saagar Govil could have a materially adverse effect on our business operations if we were not able to attract a qualified replacement for them in a timely manner.\nIf we are unable to attract and retain qualified personnel, especially our design and technical personnel, we may not be able to execute our business strategy effectively.\nOur future success depends on our ability to retain, attract and motivate qualified personnel, including our management, sales and marketing, finance, and especially our design and technical personnel. As the source of our technological and product innovations, our design and technical personnel represent a significant asset. Any inability to retain, attract or motivate such personnel could have a material adverse effect on our business and results of operations.\nOur management stockholders have significant stockholdings in and influence over our company which could make it impossible for public stockholders to influence the affairs of our company.\nWe are a controlled company under Nasdaq Listing Rules. Approximately 90% of our outstanding voting shares, which includes our common stock, Series C preferred stock and Series 1 preferred stock, are beneficially held by Saagar Govil, our Chairman, President and Chief Executive Officer. Pursuant to certificate of designation for our Series C preferred, each outstanding share of Series C Preferred Stock is entitled to the number of votes equal to the result of (i) the total number of shares of Common Stock outstanding at the time of such vote multiplied by 10.01, and divided by (ii) the total number of shares of Series C Preferred Stock outstanding at the time of such vote, at each meeting of our shareholders with respect to any and all matters presented to our shareholders for their action or consideration, including the election of directors. As a result of Saagar Govils ownership of our common stock, Series C preferred stock, and Series 1 preferred stock, he controls, and will control in the future, substantially all matters requiring approval by the stockholders of our company, including the election of all directors and approval of significant corporate transactions. This could make it impossible for public stockholders to influence the affairs of our company.\nRisks Related to Our Securities\nSales of substantial amounts of our common stock in the public market could depress the market price of our common stock.\nOur common stock and Series 1 Preferred Stock are listed for trading on the Nasdaq Capital Market. If our stockholders sell substantial amounts of our securities in the public market, including the shares of common stock issuable upon the exercise of our Series 1 warrants and stock options, and shares issued as consideration in future acquisitions, or the market perceives that such sales may occur, the market price of our securities could fall and we may be unable to sell our securities in the future.\nOur securities may experience extreme price and volume fluctuations, which could lead to costly litigation for us and make an investment in us less appealing.\nThe market price of our securities may fluctuate substantially due to a variety of factors, including:\n● our business strategy and plans;\n● changing factors related to doing business in various jurisdictions within the United States;\n● new regulatory pronouncements and changes in regulatory guidelines and timing of regulatory approvals;\n● general and industry-specific economic conditions;\n● additions to or departures of our key personnel;\n● variations in our quarterly financial and operating results;\n● changes in market valuations of other companies that operate in our business segments or in our industry;\n● lack of trading liquidity;\n● announcements about our business partners;\n● Intellectual property disputes;\n● Operating results below or exceeding expectations or period-to-period fluctuations in our financial results;\n● Whether we achieve profits or not;\n● changes in accounting principles; and\n● general market conditions, economic and other external factors.\nThe market prices of the securities of early-stage companies, particularly companies like ours without consistent product revenues and earnings, have been highly volatile and are likely to remain highly volatile in the future. This volatility has often been unrelated to the operating performance of particular companies. In the past, companies that experience volatility in the market price of their securities have often faced securities class action litigation. Whether or not meritorious, litigation brought against us could result in substantial costs, divert our managements attention and resources and harm our financial condition and results of operations.\nOur Series 1 preferred stock and all of our existing and future indebtedness rank senior to our common stock in the event of a liquidation, winding up or dissolution of our business.\nIn the event of our liquidation, winding up or dissolution, our assets would be available to make payments to holders of all existing and future indebtedness and Series 1 preferred stock before payments to holders of our common stock. In the event of our bankruptcy, liquidation or winding up, there may not be sufficient assets remaining, after paying amounts to the holders of our indebtedness and Series 1 preferred stock, to pay anything to common stockholders. As of September 30, 2023, we had total consolidated debt of approximately $37.8 million and 2,293,116 shares issued and 2,229,016 shares of Series 1 preferred stock outstanding. Any liquidation, winding up or dissolution of our company or of any of our wholly or partially owned subsidiaries would have a material adverse effect on holders of our common stock.\nOur common stockholders may be adversely affected by the issuance of any subsequent series of preferred stock.\nOur certificate of incorporation does not restrict our ability to offer one or more additional new series of preferred stock, any or all of which may rank equally with or have preferences over our common stock as to dividend payments, voting rights, rights upon liquidation or other types of rights. We would have no obligation to consider the specific interests of the holders of common stock in creating any such new series of preferred stock or engaging in any such offering or transaction. Our creation of any new series of preferred stock or our engaging in any such offering or transaction could have a material adverse effect on holders of our common stock.\nThe public trading market for the common stock may be limited in the future.\nOur common stock is listed for trading on the Nasdaq Capital Market under the symbol CETX. The trading volume fluctuates and there have been time periods during which the common stock trading volume has been limited. Management can make no assurances that trading volume will not be similarly limited in the future. Without an active trading market, there can be no assurance of any liquidity or resale value of the common stock, and stockholders may be required to hold their shares of common stock for an indefinite period of time.\nWe may not pay cash dividends on our common stock.\nOur board of directors declared a one-time cash dividend on our common stock in April 2017. The terms of our series 1 preferred stock provide for the payment of semiannual dividends on the last day of March and September in each year, which began in March 2017. No other cash dividends have been declared or paid by us on our stock during either of the two most recent fiscal years or the period through the date of this Annual Report. Other than with respect to our series 1 preferred stock, our board of directors declares dividends when, in its discretion, it determines that a dividend payment, as opposed to another use of cash, is in the best interests of the stockholders. Such decisions are based on the facts and circumstances then existing including, without limitation, our results of operations, financial condition, contractual restrictions, restrictions imposed by applicable law and other factors our board of directors deems relevant. As a result, we cannot predict when, or whether, another dividend on our common stock will be declared in the future.\nIf our shares become subject to the penny stock rules, it would become more difficult to trade our shares.\nThe SEC has adopted rules that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a price of less than $5.00, other than securities registered on certain national securities exchanges or authorized for quotation on certain automated quotation systems, provided that current price and volume information with respect to transactions in such securities is provided by the exchange or system. If the price of our Common Stock is less than $5.00, our Common Stock will be deemed a penny stock. The penny stock rules require a broker-dealer, before a transaction in a penny stock not otherwise exempt from those rules, to deliver a standardized risk disclosure document containing specified information. In addition, the penny stock rules require that before effecting any transaction in a penny stock not otherwise exempt from those rules, a broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive (i) the purchasers written acknowledgment of the receipt of a risk disclosure statement; (ii) a written agreement to transactions involving penny stocks; and (iii) a signed and dated copy of a written suitability statement. These disclosure requirements may have the effect of reducing the trading activity in the secondary market for our Common Stock, and therefore shareholders may have difficulty selling their shares.\nAlthough our Common Stock and Series 1 Preferred Stock are listed on the Nasdaq Capital Market, the exchange may subsequently delist our Common Stock or Series 1 Preferred Stock if we fail to comply with ongoing listing standards.\nAlthough our Common Stock and Series 1 Preferred Stock are listed on the Nasdaq Capital Market, the exchange will require us to meet certain financial, public float, bid price and liquidity standards on an ongoing basis in order to continue the listing of our Common Stock and Series 1 Preferred Stock. If we fail to meet these continued listing requirements, our Common Stock and/or our Series 1 Preferred stock may be subject to delisting. If our Common Stock and/or our Series 1 Preferred Stock are delisted and we are not able to list such Common Stock or Series 1 Preferred Stock on another national securities exchange, we expect our securities would be quoted on an over-the-counter market; However, if this were to occur, our stockholders could face significant material adverse consequences, including limited availability of market quotations for our Common Stock and Series 1 Preferred Stock and reduced liquidity for the trading of our securities. In addition, in the event of such delisting, we could experience a decreased ability to issue additional securities and obtain additional financing in the future. Even though our securities are listed on the Nasdaq Capital Market, there can be no assurance that an active trading market for our securities will develop or be sustained after our initial listing. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.\nItem 1C. Cybersecurity\nNot Applicable. ITEM 2. PROPERTIES\nThe Company has the following properties:\nThe Company has its corporate headquarters in Hauppauge, New York as part of the office and warehouse space discussed below.\nThe Companys Industrial Services segment owns approximately (i) 25,000 square feet of warehouse space in Manchester, PA (ii) approximately 43,000 square feet of office and warehouse space in York, PA (iii) approximately 33,500 square feet of office and warehouse space and 0.71 acres of land in a non-contiguous lot utilized for outdoor storage space in Columbia, PA. The Industrial Services segment also leases approximately 15,500 square feet of warehouse space in Emigsville, PA from a third party in a three-year lease at a monthly rent of $5,099 expiring on August 31, 2025.\nThe Companys Security segment leases (i) approximately 6,700 square feet of office and warehouse space in Pune, India from a third party in an five year lease at a monthly rent of $5,810 (INR473,415) expiring on February 28, 2024, (ii) approximately 30,000 square feet of office and warehouse space in Hauppauge, NY from a third party in a seven-year lease at a monthly rent of $28,719 expiring on March 31, 2027, (iii) approximately 911 square feet of office space in Clovis, CA on a month-to-month lease at a monthly rent of $4,930, and (iv) approximately 9,400 square feet of office and warehouse space in Hampshire, England in a fifteen-year lease with at a monthly rent of $9,821 (£7,669) which expires on March 24, 2031 and contains provisions to terminate in 2026. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in various lawsuits and legal proceedings, which arise, in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. We are currently not aware of any such legal proceedings or claims that we believe will have a material adverse effect on our business, financial condition, or operating results. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED SHAREHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nThe Companys Common Stock currently trades on the NASDAQ Capital Markets under the symbol CETX.\nAs of December 26, 2023, the Company had 70 shareholders of record. This amount does not take into account shareholders whose shares are held in street name by brokerage houses or other intermediaries.\nThe Company is authorized to issue 10,000,000 shares of preferred stock, par value $0.001 and 50,000,000 shares of common stock, $0.001 par value per share. On December 26, 2023, there were 1,055,636 shares of common stock issued and outstanding, 2,408,053 shares of Series 1 preferred stock issued and 2,343,953 shares outstanding, and 50,000 shares of Series C preferred stock issued and outstanding.\nAs reported by NASDAQ Capital Markets, on December 26, 2023, the closing sales price of the Companys Common Stock was $5.40 per share.\nDividend Policy\nOur board of directors declared a one-time cash dividend on our common stock in April 2017. The terms of our series 1 preferred stock provide for the payment of semiannual dividends on the last day of March and September in each year, which began in March 2017. No other cash dividends have been declared or paid by us on our stock during either of the two most recent fiscal years or the period through the date of this Annual Report. Other than with respect to our series 1 preferred stock, our board of directors declares dividends when, in its discretion, it determines that a dividend payment, as opposed to another use of cash, is in the best interests of the stockholders. Such decisions are based on the facts and circumstances then existing including, without limitation, our results of operations, financial condition, contractual restrictions, restrictions imposed by applicable law and other factors our board of directors deems relevant. As a result, we cannot predict when, or whether, another dividend on our common stock will be declared in the future.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe following table presents certain information as of September 30, 2023, regarding our equity compensation plans:\nPlan category Number of Common Stock Shares to be Issued upon Exercise of Outstanding Options Weighted Average Exercise Price of Outstanding Options Number of Securities Remaining Available for Future Issuance under Plans (1)\n(a) (b) (c)\nApproved by security holders\n2020 Equity Compensation Plan 8,793 $ 13.65 1,991,207\nNot approved by security holders\nOptions 20,003 $ 66.95\nTotal 28,796 $ 50.67 1,991,207\n(1) See more detailed information regarding our equity compensation plans in the Notes to Consolidated Financial Statements in this Annual Report on Form 10-K for the year ended September 30,2023.\nRecent Sales of Unregistered Securities\nThe information set forth below relates to our issuances of securities without registration under the Securities Act of 1933 during the reporting period which were not previously included in an Annual Report on Form 10-K, Quarterly Report on Form 10-Q or Current Report on Form 8-K.\nFor the fiscal year ended September 30, 2023, 213,894 shares of Series 1 Preferred Stock were issued to pay dividends to holders of Series 1 Preferred Stock.\nFor the fiscal year ended September 30, 2023, we issued 241,655 shares of common stock to satisfy $1,917,873 of notes payable and accumulated interest.\nFor the fiscal year ended September 30, 2023, we issued 30,103 shares of common stock in exchange for $215,800 of services to the Company.\nOn October 6, 2022, 115,037 shares of Series 1 Preferred Stock were issued to pay dividends to holders of Series 1 Preferred Stock.\nThese securities were issued pursuant to Section 4(2) of the Securities Act and/or Rule 506 promulgated thereunder. The holders represented their intention to acquire the securities for investment only and not with a view towards distribution. The investors were given adequate information about us to make an informed investment decision. We did not engage in any general solicitation or advertising. We directed our transfer agent to issue the stock certificates with the appropriate restrictive legend affixed to the restricted stock. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nExcept for historical information contained in this report, the matters discussed are forward-looking statements that involve risks and uncertainties. When used in this report, words such as anticipates, believes, could, estimates, expects, may, plans, potential and intends and similar expressions, as they relate to the Company or its management, identify forward-looking statements. Such forward-looking statements are based on the beliefs of the Companys management, as well as assumptions made by and information currently available to the Companys management. Among the factors that could cause actual results to differ materially are the following: the effect of business and economic conditions; the impact of competitive products and their pricing; unexpected manufacturing or supplier problems; the Companys ability to maintain sufficient credit arrangements; changes in governmental standards by which our environmental control products are evaluated and the risk factors reported from time to time in the Companys SEC reports, including this report on Form 10-K. The Company undertakes no obligation to update forward-looking statements as a result of future events or developments.\nSignificant Accounting Policies and Estimates\nThe Companys accounting policies are more fully described in Note 2 of the Consolidated Financial Statements. As disclosed in Note 2, the preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions about future events that affect the amounts reported in the financial statements and accompanying notes. Actual results could differ significantly from those estimates. The Company believes that the following discussion addresses the Companys most critical accounting policies, which are those that are most important to the portrayal of the Companys financial condition and results of operations and require managements most difficult, subjective and complex judgments.\nValuation of Goodwill\nAt September 30, 2023, the Company had approximately $4,400,000 of goodwill. As discussed in Note 2 to the consolidated financial statements, goodwill is tested annually for impairment at the reporting unit level, or more frequently if impairment indicators arise. In accordance with the FASB revised guidance on Testing of Goodwill for Impairment, a company first has the option to assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. If the company decides, as a result of its qualitative assessment, that it is more-likely-than- not that the fair value of a reporting unit is less than its carrying amount, the quantitative impairment test is mandatory. Otherwise, no further testing is required. The quantitative impairment test consists of a two-step goodwill impairment test. The first step compares the fair value of each reporting unit to its carrying amount. If the fair value of each reporting unit exceeds its carrying amount, goodwill is not considered to be impaired and the second step will not be required. If the carrying amount of a reporting unit exceeds its fair value, the second step compares the implied fair value of goodwill to the carrying value of a reporting units goodwill. The implied fair value of goodwill is determined in a manner similar to accounting for a business combination with the allocation of the assessed fair value determined in the first step to the assets and liabilities of the reporting unit. The excess of the fair value of the reporting unit over the amounts assigned to the assets and liabilities is the implied fair value of goodwill. This allocation process is only performed for purposes of evaluating goodwill impairment and does not result in an entry to adjust the value of any assets or liabilities. An impairment loss is recognized for any excess in the carrying value of goodwill over the implied fair value of goodwill.\nAssessing the Companys goodwill for impairment analyses is complex and highly judgmental due to the nature of qualitive assessment and, where necessary, the significant estimation required to determine the fair value of the reporting units. In particular, the fair value estimate is sensitive to significant assumptions, such as future operating results, cash flows and the weighted average cost of capital. These significant assumptions are forward looking and could be materially affected by future market or economic conditions.\nRelated Parties\nDuring fiscal year 2023, the Company sold two of its operating entities to Saagar Govil, Chairman of the Board, CEO, President and Secretary, additionally, there are transactions related to Ducon Industries, Inc. owned by Aron Govil, Founder, and former CFO and Executive director all of which are discussed in Note 17 of the consolidated financial statements. The financial statements shall include disclosures of material related party transactions, other than compensation arrangements, expense allowances, and other similar items in the ordinary course of business. However, disclosure of transactions that are eliminated in the preparation of consolidated or combined financial statements is not required in those statements. The disclosures shall include: a. the nature of the relationship(s) involved b. description of the transactions, including transactions to which no amounts or nominal amounts were ascribed, for each of the periods for which income statements are presented, and such other information deemed necessary to an understanding of the effects of the transactions on the financial statements; c. the dollar amounts of transactions for each of the periods for which income statements are presented and the effects of any change in the method of establishing the terms from that used in the preceding period; and d. amounts due from or to related parties as of the date of each balance sheet presented and, if not otherwise apparent, the terms and manner of settlement.\nBusiness Combinations\nDuring fiscal year 2023, The Company acquired Heisey Mechanical, Ltd. As discussed in Note 1 of the consolidated financial statements. The Company accounts for business combinations under Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 805 Business Combinations using the acquisition method of accounting, and accordingly, the assets and liabilities of the acquired business are recorded at their fair values at the date of acquisition. The excess of the purchase price over the estimated fair value is recorded as goodwill. All acquisition costs are expensed as incurred. Upon acquisition, the accounts and results of operations are consolidated as of and subsequent to the acquisition date.\nPlease see Note 2 for detailed information regarding our significant accounting policies and estimates in the Notes to Consolidated Financial Statements in this Annual Report on Form 10-K for the year ended September 30, 2023.\nResults of Operations - For the fiscal years ending September 30, 2023 and 2022\nTotal revenue for the year ended September 30, 2023, increased by $14,341,782 or 32% to $59,368,562 from $45,026,780 for the year ended September 30, 2022. Net loss for the year ended September 30, 2023, decreased by $3,981,654 to $9,310,588 from $13,292,242 for the year ended September 30, 2022. Total revenue for the period increased, as compared to total revenue in the same period last year, due to increased demand for the Companys products and services and $2,316,000 of additional revenue from the business related to the acquisition of Heisey Mechanical. Net loss decreased due to the increase in revenue, an impairment of goodwill and the write-off of related party receivables in the prior year.\nRevenues\nOur Security segment revenues for the years ended September 30, 2023, increased by $10,538,706 or 44%, to $34,359,470 from $23,820,764 for the year ended September 30, 2022. This increase is due to an increased demand for security technology products under our Vicon brand.\nOur Industrial Services segment revenues for the year ended September 30, 2023, increased by $3,803,076 or 18%, to $25,009,092 from $21,206,016 for the year ended September 30, 2022. This increase is mainly due to an increased demand for the segments products and services and $2,316,000 of additional revenue from the business related to the acquisition of Heisey Mechanical.\nGross Profit\nGross Profit for the year ended September 30, 2023, was $25,685,826 or 43% of revenues as compared to gross profit of $16,565,928 or 37% of revenues for the year ended September 30, 2022.\nGross profit in our Security segment was $17,106,300 or 50% of the segments revenues for the year ended September 30, 2023, as compared to gross profit of $10,223,704 or 43% of the segments revenues for the year ended September 30, 2022. Gross profit as a percentage of revenues increased in the year ended September 30, 2023, compared to the year ended September 30, 2022, due to price increases implemented throughout the segment in January 2023 in response to rising costs of our goods and a reduction in transportation costs in 2023, compared to 2022.\nGross profit in our Industrial Services segment was $8,579,526 or 34% of the segments revenues for the year ended September 30, 2023, as compared to gross profit of $6,342,224 or 30% of the segments revenues for the year ended September 30, 2022. Gross profit as a percentage of revenues increased in the year ended September 30, 2023, compared to the year ended September 30, 2022, was primarily due to an increase in prices for our services and lower subcontractor costs.\nGeneral and Administrative Expenses\nGeneral and Administrative Expenses for the year ended September 30, 2023, increased by $994,785 or 4% to $24,006,490 from $22,934,555 for the year ended September 30, 2022. The increase in general and administrative expenses is mainly due to increases in salaries and wages, travel, and utilities.\nResearch and Development Expenses\nResearch and Development expenses for the year ended September 30, 2023, and 2022 were $3,267,994 and $4,444,488, respectively. The decrease in Research and Development expenses are primarily related to the Security Segments development of proprietary technology and next generation solutions associated with security and surveillance systems software which are nearing the production phase.\nOther Income/(Expense)\nOther income/(expense) for the year ended September 30, 2023, was $(4,489,605) as compared to $3,302,035 for the year ended 2022. Other income/(expense) for the year ended September 30, 2023, was mainly driven by interest expense on the Companys debt and included an employee retention credit of $416,502. Other income/(expense) for the year ended September 30, 2022, included the following one-time items (i) the settlement with Securities and Exchange Commission, generated other expense of $2,200,000, (ii) other income resulting from the forgiveness of our PPP loans of $971,500. Additionally, the company had realized gains on marketable securities of $8,402,125.\nIncome Tax Benefit/(Expense)\nDuring the fiscal year of 2023 we recorded an income tax expense of $394,272 compared to a benefit of $208,545 for the fiscal year of 2022. The increase in the expense for income tax is mainly due to an increase in the net income of the industrial services segment compared to the prior year.\nEffects of Inflation\nThe Companys business and operations have not been materially affected by inflation during the periods for which financial information is presented.\nLiquidity and Capital Resources\nWorking capital was $1,948,923 at September 30, 2023, compared to $6,252,972 at September 30, 2022. This includes cash and cash equivalents and restricted cash of $6,349,562 at September 30, 2023, and $11,473,676 at September 30, 2022, respectively. The decrease in working capital was primarily due to the decrease in the Companys current assets of $2,474,726 and an increase in the Companys current liabilities of $1,906,473. The primary reason for the decrease in current assets was the cash used for operations during the fiscal year and the decrease in assets of discontinued operations, while the primary reason for the increase in current liabilities was the increase in the Companys accounts payable.\nOperating activities for continuing operations used $4,724,305 for the year ended September 30, 2023, compared to using $16,262,531 of cash for the year ended September 30, 2022. Cash provided by operating activities for discontinued operations for the year ended September 30, 2023, was $2,491,581, compared to providing cash of $169,027 for the year ended September 30, 2022.\nTrade receivables increased by $3,810,479 or 71% to $9,209,695 at September 30, 2023, from $5,399,216 at September 30, 2022. The increase in trade receivables is mainly due to increased revenues and receivables related to the business generated by the acquisition of Heisey.\nInvesting activities for continuing operations used $5,628,400 of cash during the year ended September 30, 2023, compared to $6,681,035 provided in the year ended September 30, 2022. Cash used by investing activities for discontinued operations for the year ended September 30, 2023, was $0, compared to using $70,908 for the year ended September 30, 2022. Investing activities for fiscal year 2023 were mainly driven by the purchase of property and equipment and the acquisition of Heisey Mechanical. Investing activities for fiscal year 2022 were mainly driven by the sale and purchase of marketable securities.\nFinancing activities provided $2,036,655 of cash for the year ended September 30, 2023, as compared to $5,022,537 provided in the year ended September 30, 2022. In fiscal 2023 our financing activities were mainly comprised of financing of the acquisition of Heisey and the building purchase. In fiscal 2022 our financing activities were mainly comprised of the proceeds on new debt.\nThe Company has incurred substantial losses of $9,196,875 and $13,020,958 for fiscal years 2023 and 2022, respectively, and has debt obligations over the next fiscal year of $14,507,711 and working capital of $1,948,923, that raise substantial doubt with respect to the Companys ability to continue as a going concern.\nWhile the Companys working capital and current debt indicate a substantial doubt regarding the Companys ability to continue as a going concern, the Company has historically, from time to time, satisfied and may continue to satisfy certain short-term liabilities through the issuance of common stock, thus reducing our cash requirement to meet our operating needs. Additionally, the Company has recently sold unprofitable brands, reducing the cash required to maintain those brands, implemented a new pricing model on our Vicon brand which has improved margins on those products, has refinanced some debt to provide the Company with additional capital when needed, has effected a reverse stock split on our common stock to remain trading on the Nasdaq Capital Markets, and improve our ability to raise capital through equity offerings and reduce the number of shares the Company may use to satisfy debt. In the event additional capital is raised through equity offerings and/or debt is satisfied with equity, it may have a dilutive effect on our existing stockholders. While the Company believes these plans are sufficient to meet the capital demands of our current operations for at least the next twelve months, the is no guarantee that we will succeed. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot required under Regulation S-K for smaller reporting companies. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements required to be included in this report appear as indexed in the appendix to this report beginning on page. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nThere have been no disagreements with Grassi & CO., CPAs, P.C., our independent registered public accountants, on accounting and financial disclosure matters. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nWe maintain disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act), that are designed to ensure that information required to be disclosed by us in reports we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Commissions rules and forms, and that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating our disclosure controls and procedures, management recognized that disclosure controls and procedures, no matter how well conceived and operated, can provide only reasonable assurance of achieving the desired control objectives, and we necessarily are required to apply our judgment in evaluating the cost-benefit relationship of possible disclosure controls and procedures.\nBased on an evaluation under the supervision and with the participation of our management, our principal executive officer and principal financial officer have concluded that our disclosure controls and procedures were effective as of September 30, 2023.\nManagements Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act. Our internal control system was designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes, in accordance with GAAP. Because of inherent limitations, a system of internal control over financial reporting may not prevent or detect misstatements. Additionally, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate due to change in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management, including our principal executive officer and principal accounting officer, conducted an evaluation of the effectiveness of our internal control over financial reporting using the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013). Based on its evaluation, our management concluded that as of September 30, 2023, that our internal control over financial reporting were effective and there are no material weaknesses in our internal control over financial reporting.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to Commission rules that permit the Company to provide only managements report in this annual report.\nThis report shall not be deemed to be filed for purposes of Section 18 of the Exchange Act, or otherwise subject to the liabilities of that section, and is not incorporated by reference into any filing of the Company, whether made before or after the date hereof, regardless of any general incorporation language in such filing.\nChanges in Internal Control Over Financial Reporting\nDuring the years ended September 30, 2023, and 2022, the Company engaged a third-party accounting firm to assist with entity level controls around the review of period-end reporting processes, accounting policies and public disclosures that is reasonably likely to materially affect our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers of the Registrant\nAs of the date of this Annual Report, the members of our Board of Directors and Executive Officers are:\nName and Address\nAge\nPositions and Offices\nSaagar Govil\nChairman of the Board of Directors,President,\n276 Greenpoint Avenue, Suite 208\nChief Executive Officer, & Director\nBrooklyn, NY 11222\nPaul J. Wyckoff\nInterim Chief Financial Officer\n276 Greenpoint Avenue, Suite 208\nBrooklyn, NY 11222\nBrian Kwon\nDirector\n276 Greenpoint Avenue, Suite 208\nBrooklyn, NY 11222\nManpreet Singh\nDirector\n276 Greenpoint Avenue, Suite 208\nBrooklyn, NY 11222\nMetodi Filipov\nDirector\n276 Greenpoint Avenue, Suite 208\nBrooklyn, NY 11222\nPrincipal Occupations and Business Experience of Directors and Executive Officers\nThe following is a brief account of the business experience of the Companys directors:\nSaagar Govil is the Companys Chairman since June 2014, and the Chief Executive Officer and President since December 2011. He has been working at Cemtrex since 2008, initially as a field engineer, subsequently moving into sales, and management roles as Vice President of Operations. Saagar was recently recognized as a Forbes 30 Under 30 in 2016, Business Insiders #17 on Top 100 of Silicon Alley in 2015, and Top 40 Under 40 by Stony Brook University in 2014. Saagar Govil has a B.E. in Materials Engineering from Stony Brook University and completed the PLD program at Harvard Business School.\nPaul J. Wyckoff was appointed Cemtrexs Interim Chief Financial Officer on January 28, 2021, where he is responsible for the Companys financial planning, accounting, tax, and business process functions. Mr. Wyckoff has been with Cemtrex since March of 2014 when he joined as the Manager of Financial Reporting and since January of 2019 has served as the Companys Corporate Controller. Prior to joining Cemtrex, Mr. Wyckoff was the Controller at Vaso Corporation (formerly Vasomedical, Inc.) a medical device distribution company based in Plainview, NY. Mr. Wyckoff has over 20 years of private accounting experience and holds a B.S. in Accounting from SUNY College at Old Westbury.\nBrian Kwon was appointed to the as a director on September 28, 2021 and is presently the President and Chief Procurement Officer of H Mart. Brian has extensive operations experience in purchasing, distribution, logistics, IT, HR, and e-commerce from his time at H-Mart. Brian has completed the Harvard Business School General Management Program.\nManpreet Singh was appointed as a director on November 1, 2021 and is currently the founder and Chief Investment Officer of Singh Capital Partners (SCP), a multifamily office that directs investments into venture capital, real estate, and growth equity. SCP invests capital on behalf of Fortune 500 CXOs, Unicorn founders and operators and has executed investments in North America, Europe and Asia. He serves on the numerous non-profit and private company boards including AcquCo, US Inspect, Embrace Software, Snowball Industries, Shukr Investments, Suburban Hospital (John Hopkins Medicine) and Dingman Center at the Smith School of Business. He is a CFA charterholder and Manpreet received his MBA from the Wharton School of Business in Entrepreneurship, Finance, and Real Estate. He also holds a B.S. in Finance with a citation in Entrepreneurship from the University of Maryland, College Park. Mr. Singhs extensive knowledge of finance allow him to make valuable contributions to the Board.\nMetodi Filipov was appointed to the Board on February 9, 2018 and is an entrepreneur and technology executive with over 25 years of experience creating, operating and driving growth for technology companies. He has a proven track record of identifying business opportunities and building compelling products. Metodi was formerly VP of Operations at Cemtrex from 2008 to 2010. After Cemtrex, Mr. Filipov served as Managing Director of Bianor, a mobile consulting company providing solutions for enterprise clients. There, he led the development and implementation of innovative mobile products in industries including aviation, pharmaceutical and entertainment. Metodi co-founded Flipps Media, an OTT video distribution platform positioned to be an alternative to traditional cable pay-per-view systems. Before Bianor, he served as product lead for Raritan, a data center technology organization, where he was an integral part of the transition team that led the company to becoming a global IT service management solutions provider. Prior to joining Raritan, Mr. Filipov served as VP of Operations at ISS, a security products company. There, he successfully managed product development and contract manufacturing across continents. Mr. Filipov has extensive experience delivering superior solutions with a focus on optimized efficiency and productivity.\nEach director of the Company serves for a term of one year or until the successor is elected at the Companys annual shareholders meeting and is qualified, subject to removal by the Companys shareholders. Each officer serves, at the pleasure of the board of directors, for a term of one year and until the successor is elected at the annual meeting of the board of directors and is qualified.\nMeetings of the Board of Directors\nDuring the fiscal year ended September 30, 2023, the Board of Directors held four meetings.\nInvolvement in Certain Legal Proceedings\nDuring the past 10 years, other than as set forth below, none of our current directors, nominees for directors or current executive officers has been involved in any legal proceeding identified in Item 401(f) of Regulation S-K, including:\n1. Any petition under the Federal bankruptcy laws or any state insolvency law filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he or she was a general partner at or within two years before the time of such filing, or any corporation or business association of which he or she was an executive officer at or within two years before the time of such filing;\n2. Any conviction in a criminal proceeding or being named a subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. Being subject to any order, judgment, or decree, not subsequently reversed, suspended, or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him or her from, or otherwise limiting, the following activities:\ni. Acting as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\nii. Engaging in any type of business practice; or\niii. Engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n4. Being subject to any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any type of business regulated by the Commodity Futures Trading Commission, securities, investment, insurance or banking activities, or to be associated with persons engaged in any such activity;\n5. Being found by a court of competent jurisdiction in a civil action or by the SEC to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6. Being found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7. Being subject to, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\ni. Any Federal or State securities or commodities law or regulation; or\nii. Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\niii. Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8. Being subject to, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nSee subsection titled Settlement with the Securities and Exchange Commission under Item 1. Business of this Annual Report on Form 10-K, which is incorporated herein by reference.\nCommittees of the Board\nOur Board of Directors currently has one standing committee: The Audit Committee.\nCompensation Committee\nAs a Controlled Company as such term is defined under NASDAQ Listing Rule 5615, the Company is not required to have a Compensation Committee.\nAudit Committee\nThe Audit Committee, which has been established in accordance with requirements of Section 3(a)(58)(A) of the Exchange Act, is comprised of the following independent directors: Metodi Filipov (Chair), Brian Kwon, and Manpreet Singh. The Board of Directors has determined that each member of the Audit Committee: (i) is independent, (ii) meets the financial literacy requirements of the Nasdaq Rules, and (iii) meets the enhanced independence standards established by the SEC. In addition, the Board has determined that Mr. Filipov qualifies as an audit committee financial expert as that term is defined in Item 407(d)(5)(ii) of Regulation S-K promulgated under the Exchange Act by the SEC.\nThe Audit Committee is primarily concerned with the integrity of our financial statements, the independence, qualifications and performance of our independent registered public accounting firm, and our compliance with legal requirements. The Audit Committee operates under a written charter approved by the Board of Directors and the Audit Committee that reflects standards and requirements adopted by the SEC and NASDAQ.\nAs indicated in its charter, the Audit Committees duties include selecting and engaging our independent registered public accounting firm; reviewing the scope of the audit to be conducted by our independent registered public accounting firm; overseeing our independent registered public accounting firm and reviewing the results of its audit; reviewing our financial reporting processes, including the accounting principles and practices followed and the financial information provided to shareholders and others; overseeing our internal control over financial reporting and disclosure controls and procedures; and serving as our legal compliance committee.\nNomination of Directors\nThe Company does not currently have a standing nominating committee or a formal nominating committee charter. As a Controlled Company as such term is defined by NASDAQ Listing Rule 5615 the Company is not required to have a Nominating Committee. Currently, the independent members of the Board (Messrs. Kwon, Singh, Wagner, and Filipov), rather than a nominating committee, approve or recommend to the full Board those persons to be nominated. The Board believes that the current method of nominating directors is appropriate because it allows each independent board member input into the nomination process and does not unnecessarily restrict the input that might be provided from an independent director who could be excluded from a committee. Currently, three of the five Directors are independent. Furthermore, the Board has adopted by resolution a director nomination policy. The purpose of the policy is to describe the process by which candidates for inclusion in the Companys recommended slate of director nominees are selected. The director nomination policy is administered by the Board. Many of the benefits that would otherwise come from a written committee charter are provided by this policy.\nIn the ordinary course, absent special circumstances or a change in the criteria for Board membership, the incumbent directors who continue to be qualified for Board service and are willing to continue as directors are re-nominated. If the Board thinks it is in the best interest of the Company to nominate a new individual for director in connection with an annual meeting of shareholders, or if a vacancy occurs between annual shareholder meetings, the Board will seek potential candidates for Board appointments who meet the criteria for selection as a nominee and have the specific qualities or skills being sought. Director candidates will be selected based on input from members of the Board, senior management of the Company and, if deemed appropriate, a third-party search firm.\nCandidates for Board membership must possess the background, skills and expertise to make significant contributions to the Board, to the Company and its shareholders. Desired qualities to be considered include substantial experience in business or administrative activities; breadth of knowledge about issues affecting the Company; and ability and willingness to contribute special competencies to Board activities.\nThe Board of Directors intends to review the director nomination policy from time to time to consider whether modifications to the policy may be advisable as the Companys needs and circumstances evolve, and as applicable legal or listing standards change. The Board may amend the director nomination policy at any time.\nThe Board will consider director candidates recommended by shareholders and will evaluate such director candidates in the same manner in which it evaluates candidates recommended by other sources, as described above. Recommendations must be in writing and mailed to Cemtrex, Inc., 135 Fell Ct. Hauppauge, NY 11788, Attention: Corporate Secretary, and include all information regarding the candidate as would be required to be included in a proxy statement filed pursuant to the proxy rules promulgated by the SEC if the candidate were nominated by the Board of Directors (including such candidates written consent to being named in the proxy statement as a nominee and to serving as a director if elected). The shareholder giving notice must provide (i) his or her name and address, as they appear on the Companys books, and (ii) the number of shares of the Company which are beneficially owned by such shareholder. The Company may require any proposed nominee to furnish such other information it may require to be set forth in a shareholders notice of nomination which pertains to the nominee.\nDirector Compensation\nThe members of the Board receive quarterly compensation of $5,000 and stock options. Additionally, we reimburse our directors for expenses incurred in connection with attending board meetings.\nInsider Trading Policy\nWe recognize that the Companys executive officers and directors may sell shares from time to time in the open market to realize value to meet financial needs and diversify their holdings, particularly in connection with exercises of stock options. All such transactions are required to comply with the Companys insider trading policy.\nSection 16 (a) Beneficial Ownership Reporting Compliance of the Securities Exchange Act\nSection 16(a) of the Exchange Act requires directors, executive officers and persons who beneficially own more than 10% of our common stock (collectively, Reporting Persons) to file initial reports of ownership and reports of changes in ownership of our common stock with the SEC. Reporting Persons are required by SEC regulations to furnish us with copies of all Section 16(a) reports they file. To our knowledge, based solely on our review of the copies of such reports received or written representations from certain Reporting Persons that no other reports were required, we believe that during the year ended September 30, 2023, all Reporting Persons timely complied with all applicable filing requirements, except for one Form 4 report by Mr. Govil that was filed late.\nCommunications with Directors\nShareholders, associates of the Company and other interested parties may communicate directly with the Board of Directors, with the non-management Directors or with a specific Board member, by writing to the Board (or the non-management Directors or a specific Board member) and delivering the communication in person or mailing it to: Board of Directors, Privileged and Confidential, c/o Saagar Govil, CEO, Cemtrex, Inc., 135 Fell Ct. Hauppauge, NY 11788. Correspondence will be discussed at the next scheduled meeting of the Board of Directors, or as indicated by the urgency of the matter. From time to time, the Board of Directors may change the process by which shareholders may communicate with the Board of Directors or its members. Any changes in this process will be posted on the Companys website or otherwise publicly disclosed.\nCorporate Governance\nThe Company has an ongoing commitment to good governance and business practices. In furtherance of this commitment, we regularly monitor, and are briefed by outside counsel on, developments in the area of corporate governance and securities law and review our policies and procedures in light of such developments. We comply with the rules and regulations promulgated by the SEC and implement other corporate governance practices we believe are in the best interests of the Company and the shareholders.\nCode of Ethics\nWe have adopted a code of ethics as of June 28, 2016, that applies to our principal executive officer, principal financial officer, as well as our employees. Our standards are in writing and are posted on our website. The following is a summation of the key points of the Code of Ethics we adopted:\nHonest and ethical conduct, including ethical handling of actual or apparent conflicts of interest between personal and professional relationships;\nFull, fair, accurate, timely, and understandable disclosure reports and documents that a small business issuer files with, or submits to, the Commission and in other public communications made by our Company;\nFull compliance with applicable government laws, rules and regulations;\nThe prompt internal reporting of violations of the code to an appropriate person or persons identified in the code; and\nAccountability for adherence to the code.\nBoard Leadership and Structure\nSaagar Govil, our Chief Executive Officer, also serves as Chairman of the Board of Directors. The Board believes that the Company and its shareholders are best served by having the Chief Executive Officer also serve as Chairman of the Board. The Board also believes that this structure is appropriate in light of the size of our Company and corresponding size of our Board and the complexity of our business. We believe that Mr. Govil is best positioned to develop agendas that ensure that our Boards time and attention are focused on the matters that are most critical to us. ITEM 11. EXECUTIVE COMPENSATION\nThe compensation discussion addresses all compensation awarded to, earned by, or paid to the Companys named executive officers (NEO), which currently consists of Saagar Govil, the Chairman, Chief Executive Officer, President and Secretary, and Paul J. Wyckoff, Interim CFO. As of the date of this Annual Report, Saagar Govil and Paul J. Wyckoff are currently earning compensation from the Company. Paul J. Wyckoff was named Interim CFO on January 28, 2022. Set forth below is the aggregate compensation for services rendered in all capacities to us during our fiscal years ended September 30, 2023, and 2022 by our executive officers.\nOPTION\nPRINCIPAL AND POSITION YEAR SALARY BONUS AWARDS OTHER TOTAL\n($) ($) ($) ($) ($)\nSaagar Govil 600,000 - - 45,803 645,803\nChairman od the Board 600,000 - - 37,534 637,534\nChief Executive Officer, and President\nPaul J. Wyckoff 150,000 - - 12,291 162,291\nInterim Chief Financial Officer 97,615 - - 4,557 102,172\nChristopher C. Moore 86,250 - - 4,848 91,098\nFormer Chief Financial Officer\n(1) The Option Awards Column in the table above reflects the aggregate grant date fair value of the award granted in the year noted. Please see Options/SAR Grants in the Last Fiscal Year below for more information relating to this option grant.\n(2) Other compensation are amounts paid by the company for medical, dental, vision, and life insurance benefits.\nNARRATIVE TO SUMMARY COMPENSATION TABLE\nAt this time, we do not have an employment agreement with Saagar Govil or Paul J. Wyckoff, though the Company may enter into such an agreement with them on terms and conditions usual and customary for the industry. All amounts paid to our officers in fiscal year end 2023 were approved by the Companys board of directors. The Company does not currently have key man life insurance on Mr. Govil or Mr. Wyckoff.\nPAY VERSUS PERFORMANCE\nYear Summary Compensation Table Total for PEO Compensation Actually Paid to PEO Average Summary Compensation Table Total for Non-PEO NEOs Average Compensation Actually Paid to Non-PEO NEOs Value of Initial Fixed $100 Investment Based On Total Shareholder Return Net Loss\n(a) (b) (1) (c) (2) (d) (e) (4) (f) (5) (g) (6)\n$ 645,803 $ 641,648 $ 162,291 $ 162,291 $ 65.03 $ (9,233,438 )\n$ 637,534 $ 554,406 $ 96,635 $ 96,635 $ 18.10 $ (13,292,242 )\n1. The dollar amounts reported in column (b) are the amounts reported for Saagar Govil, Chairman of the Board, CEO, President and Secretary, for each of the corresponding years in the Total column of the in our Summary Compensation Table. Refer to the Summary Compensation Table above.\n2. The dollar amounts reported in column (c) represent the amount of compensation actually paid to Mr. Govil, as computed in accordance with Item 402(v) of Regulation S-K and do not reflect the total compensation actually realized or received by Mr. Govil. In accordance with these rules, these amounts reflect Total Compensation as set forth in the Summary Compensation Table for each year, adjusted as shown below. Equity values are calculated in accordance with FASB ASC Topic 718, and the valuation assumptions used to calculate fair values did not materially differ from those disclosed at the time of grant.\n3. The dollar amounts reported in column (d) represent the average of the amounts reported for our NEOs as a group (excluding Mr. Govil) in the Total column of the Summary Compensation Table in each applicable year. The names of each of the NEOs included for these purposes in each applicable year are as follows: Paul J. Wyckoff, Interim Chief Financial Officer; Christopher Moore, Chief Financial Officer.\n4. The dollar amounts reported in column (e) represent the average amount of compensation actually paid to the NEOs as a group (excluding Mr. Govil), as computed in accordance with Item 402(v) of Regulation S-K. In accordance with these rules, these amounts reflect Total Compensation as set forth in the Summary Compensation Table for each year, adjusted as shown below.\n5. Total Shareholder Return (TSR) is calculated by dividing (a) the difference between our share price at the end of each fiscal year shown and the beginning of the measurement period, and the beginning of the measurement period by (b) our share price at the beginning of the measurement period. The beginning of the measurement period for each year in the table is September 30, 2021.\n6. The dollar amounts reported represent the amount of net income reflected in our audited financial statements for the applicable year.\nAdjustments to Determine Compensation Actually Paid for [PEO][Non-PEO NEOs]\nDeduction for Change in the Actuarial Present values reported under the Change in Pension Value and Nonaualified Deferred Comoensation Earnimrn‘ Column of the SCT $ - $ -\nIncrease for Service Cost for Pension Plans $ - $ -\nIncrease for Prior Service Cost for Pension Plans $ - $ -\nDeduction for Amounts Reported under the Stock Awards,, Column in the SCT $ - $ -\nDeduction for Amounts Reported under the Option Awards,, Column in the SCT $ - $ -\nIncrease for Fair Value of Awards Granted during year that Remain Unvested as of Year end $ - $ -\nIncrease for Fair Value of Awards Granted during year that vest during vear $ - $ -\nIncrease/deduction for Change in Fair value from prior Year-end to current Year-end of Awards Granted Prior to year that were Outstanding and Unvested as of Year-end $ (1,948.00 ) $ (53,747.00 )\nIncrease/deduction for Change in Fair Value from Prior Year-end to Vesting Date of Awards Granted Prior to year that Vested during year $ (2,207.00 ) $ (29,381.00 )\nDeduction of Fair value of Awards Granted Prior to year that were Forfeited during year $ - $ -\nIncrease based upon Incremental Fair Value of Awards Modified during year $ - $ -\nIncrease based on Dividends or Other Earnings Paid durilling year prior to Vesting Date of Award $ - $ -\nTotal Adjustments $ (4,155.00 ) $ (83,128.00 )\nOPTIONS/SAR GRANTS IN THE LAST FISCAL YEAR\nNone.\nAGGREGATED OPTION/SAR EXERCISES IN LAST FISCAL YEAR AND FISCAL YEAR END OPTION/SAR VALUES\nNone.\nOUTSTANDING EQUITY AWARDS AT FISCAL YEAR-END\nThe following table presents information regarding our NEOs unexercised options to purchase Common Stock as of September 30, 2023:\nOption Awards\nName Number of Securities Underlying Unexercised Options Exercisable Option Exercise Price Option Expiration Date\nSaagar Govil 11,429 $ 56.00 2/25/2026\nSaagar Govil 2,858 $ 67.20 2/25/2026\nSaagar Govil 2,858 $ 80.64 2/25/2026\nSaagar Govil 2,858 $ 96.77 2/25/2026 ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information known to us with respect to the beneficial ownership of our common stock as of December 26, 2023, by:\nall persons who are beneficial owners of five percent (5%) or more of our common stock;\neach of our directors;\neach of our executive officers; and\nall current directors and executive officers as a group.\nExcept as otherwise indicated, and subject to applicable community property laws, the persons named in the table below have sole voting and investment power with respect to all shares of common stock held by them.\nAs of December 26, 2023, 1,055,636 shares of Common Stock were issued and outstanding. In addition, there were 50,000 shares of Series C Preferred Stock outstanding which are entitled to vote 10,566,916 shares in the aggregate, all of which is held by Saagar Govil and 2,343,953 shares of Series 1 Preferred Stock outstanding which are entitled to vote 4,687,906 shares in the aggregate. Accordingly, there are a total of 16,310,458 shares outstanding.\nBeneficial ownership is determined in accordance with the rules of the SEC. In computing the number of shares beneficially owned by a person and the percentage ownership of that person, shares of common stock subject to options held by that person that are currently exercisable or exercisable within 60 days of December 26, 2023, are deemed outstanding. Such shares, however, are not deemed as of December 26, 2023, outstanding for the purpose of computing the percentage ownership of any other person.\nPercentage of\nName and Address\nIssued Common Percentage of\nof Beneficial Owner Title Amount Owned\nStock (1) voting stock (2)\nSaagar Govil Chairman of the Board, 59,012\n6 % *\nGreenpoint Avenue, Suite 208 Chief Executive Officer,\nBrooklyn, NY 11222 and President\nSaagar Govil Chairman of the Board, 132,298\n- 1.6 %\nGreenpoint Avenue, Suite 208 Chief Executive Officer,\nBrooklyn, NY 11222 and President\nSaagar Govil Chairman of the Board, 50,000 (3)\n- 89.7 %\nGreenpoint Avenue, Suite 208 Chief Executive Officer,\nBrooklyn, NY 11222 and President\nPaul J. Wyckoff Interim Chief Financial -\n- *\nGreenpoint Avenue, Suite 208 Officer\nBrooklyn, NY 11222\nBrian Kwon Director -\n- *\nGreenpoint Avenue, Suite 208\nBrooklyn, NY 11222\nManpreet Singh Director -\n- *\nGreenpoint Avenue, Suite 208\nBrooklyn, NY 11222\nMetodi Filipov Director -\n- *\nGreenpoint Avenue, Suite 208\nBrooklyn, NY 11222\nAll directors and executive officers as a group (3 persons) 241,310 (4)\n6 % 66.5 %\n* Less than one percent of outstanding shares.\n(1) Except as otherwise noted herein, the percentage is determined on the basis of 1,055,636 shares of our Common Stock outstanding plus securities deemed outstanding pursuant to Rule 13d-3 promulgated under the Securities Exchange Act of 1934, as amended (the Exchange Act). Under Rule 13d-3, a person is deemed to be a beneficial owner of any security owned by certain family members and any security of which that person has the right to acquire beneficial ownership within 60 days, including, without limitation, shares of our common stock subject to currently exercisable options.\n(2) This percentage is based on the 1,055,636 shares of our Common Stock outstanding, the 10,566,916 votes that the Series C Preferred Stock is entitled to vote, and the 4,687,906 votes that the Series 1 Preferred Stock is entitled to vote based on 2 votes per share.\n(3) Pursuant to the Certificate of Designation of the Series C Preferred Stock, each issued and outstanding share of Series C Preferred Stock are entitled to the number of votes per share equal to the result of (i) the total number of shares of Common Stock outstanding at the time of such vote multiplied by 10.01, and divided by (ii) the total number of shares of Series C Preferred Stock outstanding at the time of such vote, at each meeting of our shareholders with respect to any and all matters presented to our shareholders for their action or consideration, including the election of directors.\n(4) Consists of actual amount of Common Stock, Series C, and Series 1 Preferred Stock owned. As described above each share of Series C is entitled to 211.33832 votes. Series 1 Preferred Stock is entitled to 2 votes per share. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nAside from the following, there have been no transactions since October 1, 2021 to which we have been a party, including transactions in which the amount involved in the transaction exceeds the lesser of $120,000 or 1% of the average of our total assets at year-end for the last two completed fiscal years, and in which any of our directors, executive officers or, to our knowledge, beneficial owners of more than 5% of our capital stock or any member of the immediate family of any of the foregoing persons had or will have a direct or indirect material interest, other than equity and other compensation, termination, change in control and other arrangements, which are described elsewhere in this Annual Report on Form 10-K.\nAs of September 30, 2023, and September 30, 2022, there was $3,806 and $19,133, respectively, payable due to Ducon Technologies, Inc., which is controlled by Aron Govil, the Companys Founder and Former Director and CFO. As of September 30, 2023, there were $638,410 of receivables due from Ducon Technologies, Inc. The Company has negotiated a payment agreement regarding past receivables and other liabilities due to Cemtrex, Inc. totaling $761,585. This agreement is in the form of a secured promissory note earning interest at a rate of 5% per annum and matures on July 31, 2024. Receivables due of $708,512, which represents the amount due from Ducon to Cemtrex Technologies Pvt. Ltd. the Companys subsidiary based in India had been written off to bad debt during fiscal year 2022 and appears on the Companys consolidated statements of operations and comprehensive income/(loss) under general and administrative expenses.\nOn February 26, 2021, the Company entered into a Settlement Agreement and Release with Aron Govil regarding a dispute over an alleged misappropriation of funds.\nAs part of the Settlement Agreement, Mr. Govil was required to pay the Company consideration with a total value of $7,100,000 (the Settlement Amount) by entering into the Agreement. The Settlement Amount was satisfied in a combination of Mr. Govil forfeiting certain Preferred Stock and outstanding options and executing a secured note in the amount of $1,533,280. The Independent Board of Directors in coordination with Management concluded the settlement represented fair value.\nAs discussed above, Mr. Govil also executed a secured promissory note (the Note) in the amount of $1,533,280. The Note matures and is due in full in two years and bears interest at 9% per annum and is secured by all of Mr. Govils assets. Mr. Govil also agreed to sign an affidavit confessing judgment in the event of a default on the Note. While the Company believes the note is fully collectible, in accordance with ASC 450-30, Gain Contingencies, the Company determined the gain will not be recognized until the note is paid. Accordingly, the note and associated gain is not presented on the Companys Consolidated Balance Sheets and Consolidated Statements of Operations and Comprehensive Income/(Loss).\nOn November 22, 2022, the Company entered into two Asset Purchase Agreements and one Simple Agreement for Future Equity (SAFE) with the Companys CEO, Saagar Govil, to secure the sale of the subsidiaries Cemtrex Advanced Technologies, Inc, which include the brand SmartDesk, and Cemtrex XR, Inc., which include the brands Cemtrex XR, Virtual Driver Interactive, Bravo Strong, and good tech (formerly Cemtrex Labs), to Mr. Govil\nDue to the on-going losses and risk associated with the SmartDesk business the Company has valued the royalty and SAFE agreement associated with the SmartDesk sale at $0 and considers such consideration to be a gain contingency.\nBased on sales projections for Cemtrex XR, Inc., the Company does not believe that it will exceed the sales levels required to exceed the $820,000 royalties due and has not accounted for any additional royalties at this time. In accordance with ASC 310 - Receivables, the Company has discounted the royalties due and during the year ended September 30, 2023, has recognized $704,893 of royalties due and will amortize the remaining amount over the period the royalties are due.\nAs of September 30, 2023, there was $528,717 in trade receivables due from these companies and $64,703 in accounts payables. Of these receivables $132,102 are related to costs paid by Cemtrex related to payroll during the transition of employees to the new company and some subscription services that are set up on auto pay with a credit card. The remaining $396,615 is related to services provided by Cemtrex Technologies Pvt. Ltd. in the normal course of business. During Fiscal year 2023, the Company recognized $1,522,102 of revenue from these companies. During fiscal year 2023, $38,027 of trade receivables were reserved for by the Companys subsidiary Cemtrex Technologies Pvt. Ltd. Due to regulations by the Indian tax authority. The Company will keep this allowance in place but considers the debt to be collectable. These balances are presented on the Consolidated Balance Sheets under the captions Trade receivables - related party and Accounts payable - related party. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe following table sets forth the aggregate fees billed to the Company for the years ended September 30, 2023, and 2022 by Grassi & Co. Certified Public Accountants the Companys independent auditor:\nAudit Fees $ 342,283 $ 276,848\nAudit-Related Fees 84,255 10,429\nTax Fees 61,715 -\nTotals $ 488,252 $ 287,277\nAudit fees principally include fees for the audit of our consolidated financial statements included in our annual report on Form 10-K and the review of financial statements included in our quarterly reports on Form 10-Q.\nAudit-related fees consist of fees for other attestation and related services that are reasonably related to the performance of the audit or review of our financial statements. For fiscal year 2023, these fees primarily related to the audit of the historical financials of Heisey Mechanical, Ltd.. For fiscal year 2022, these fees primarily related to providing consent to various company filings with the Securities and Exchange Commission.\nTax fees consist of tax compliance services.\nPART IV\nITEM EXHIBITS AND FINANCIAL STATEMENTS\n(a) Financial Statements and Notes to the Consolidated Financial Statements\nSee Index to Consolidated Financial Statements on page at beginning of attached financial statements.\n(b) Exhibits\nExhibit No.\nDescription\n2.2\nStock Purchase Agreement regarding the stock of Advanced Industrial Services, Inc., AIS Leasing Company, AIS Graphic Services, Inc., and AIS Energy Services, LLC, Dated December 15, 2015. (8)\n3.1\nCertificate of Incorporation of the Company.(1)\n3.2\nBy Laws of the Company.(1)\n3.3\nCertificate of Amendment of Certificate of Incorporation, dated September 29, 2006.(1)\n3.4\nCertificate of Amendment of Certificate of Incorporation, dated March 30, 2007.(1)\n3.5\nCertificate of Amendment of Certificate of Incorporation, dated May 16, 2007.(1)\n3.6\nCertificate of Amendment of Certificate of Incorporation, dated August 21, 2007.(1)\n3.7\nCertificate of Amendment of Certificate of Incorporation, dated April 3, 2015.(3)\n3.8\nCertificate of Designation of the Series A Preferred Shares, dated September 8, 2009.(2)\n3.9\nCertificate of Designation of the Series 1 Preferred Stock.(11)\n3.10\nCertificate of Amendment of Certificate of Incorporation, dated September 7, 2017 (12)\n3.11\nCertificate of Correction to the Certificate of Amendment to the Amended and Restated Certificate of Incorporation, as amended, of Cemtrex, Inc (6)\n3.12\nAmended Certificate of Designation of the Series 1 Preferred Shares, dated March 30, 2020.(16)\n3.13\nCertificate of Amendment of Certificate of Incorporation, dated July 29, 2020 (20)\n3.14\nCertificate of Correction of Certificate of Incorporation, dated July 29, 2021, filed October 7, 2020 (9)\n3.15\nCertificate of Amendment of Certificate of Incorporation, dated January 12, 2023 (7)\n4.1\nForm of Subscription Rights Certificate. (10)\n4.2\nForm of Series 1 Preferred Stock Certificate. (10)\n4.3\nForm of Series 1 Warrant. (10)\n4.4\nForm of Common Stock Purchase Warrant, dated March 22, 2019. (14)\n4.5*\nDescription of Registrants Securities\n10.1\nAmendment of the Term Loan Agreement between Vicon and NIL Funding, dated March 3, 2023. (5)\n10.2\nAmendment to Loan Documents Between Advanced Industrial Services, Inc. and Fulton Bank, N.A. dated February 24, 2023 (5)\n10.3\nAmendment to Promissory Note Between Cemtrex, Inc. and Streeterville Capital, LLC dated May 3, 2023 (5)\n10.4\nSecurities Purchase Agreement dated June 1, 2020 (18)\n10.5\nSecurities Purchase Agreement dated June 9, 2020 (19)\n10.6\nSettlement Agreement and Release between Cemtrex, Inc. and Aron Govil dated February 26, 2021 (13)\n10.7\nSecurities Purchase Agreement dated February 22, 2022 (15)\n10.8\nAmendment of the Term Loan Agreement between Vicon and NIL Funding, dated March 30, 2022. (15)\n10.9\nAsset Purchase agreement between Cemtrex, Inc. and Saagar Govil, dated November 22, 2022 (22)\n10.10\nAsset Purchase agreement between Cemtrex, Inc. and Saagar Govil, dated November 22, 2022 (22)\n10.11\nSimple Agreement for Future Equity (SAFE) between Cemtrex, Inc. and Saagar Govil, dated November 18, 2022 (22)\n10.12\nAmendment of the Term Loan Agreement between Vicon and NIL Funding, dated March 3, 2023 (23)\n10.13\nAmendment to Loan Documents Between Advanced Industrial Services, Inc. and Fulton Bank, N.A. (23)\n10.14\nAmendment to Promissory Note Between Cemtrex, Inc. and Streeterville Capital, LLC (23)\n10.15\nAsset Purchase agreement between Cemtrex, Inc. and Saagar Govil, dated November 22, 2022 (22)\n10.16\nAsset Purchase agreement between Cemtrex, Inc. and Saagar Govil, dated November 22, 2022 (22)\n10.17\nSimple Agreement for Future Equity (SAFE) between Cemtrex, Inc. and Saagar Govil (22)\n10.18\nAsset Purchase Agreement, dated as of June 7, 2023, by and among Heisey Mechanical, Ltd., a Pennsylvania corporation (Seller), and Andreas Heisey, an individual residing in the Commonwealth of Pennsylvania (the Shareholder and collectively with the Seller, the Seller Parties) and Advanced Industrial Services, Inc., a Pennsylvania corporation (Buyer). (24)\n14.1\nCorporate Code of Business Ethics.(4)\n21.1*\nSubsidiaries of the Registrant\n23.1*\nConsent of Grassi & Co, CPAs, P.C., Independent Registered Public Accounting Firm\n31.1*\nCertification of Chief Executive Officer as required by Rule 13a-14 or 15d-14 of the Exchange Act, as adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of Interim Chief Financial Officer and Principal Financial Officer as required by Rule 13a-14 or 15d-14 of the Exchange Act, as adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1*\nCertification of Chief Executive Officer Pursuant to 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act 0f of 2002.\n32.2*\nCertification of Interim Chief Financial Officer and Principal Financial Officer Pursuant to 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act 0f of 2002.\n99.1\nOrder pursuant to Section 8A of the Securities Act - dated September 30, 2022. (21)\n101.INS*\nInline XBRL Instance Document\n101.SCH*\nInline XBRL Taxonomy Extension Schema\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed herewith\nIncorporated by reference from Form 10-12G filed on May 22, 2008.\nIncorporated by reference from Form 8-K filed on September 10, 2009.\nIncorporated by reference from Form 8-K filed on August 22, 2016.\nIncorporated by reference from Form 8-K filed on July 1, 2016.\nIncorporated by reference from Form 10-Q filed on May 11, 2023.\nIncorporated by reference from Form 8-K filed on June 12, 2019.\nIncorporated by reference from Form 8-K filed on January 20, 2023.\nIncorporated by reference from Form 8-K/A filed on September 26, 2016.\nIncorporated by reference from Form 10-Q filed on May 28, 2021.\nIncorporated by reference from Form S-1 filed on August 29, 2016 and as amended on November 4, 2016, November 23, 2016, and December 7, 2016.\nIncorporated by reference from Form 8-K filed on January 24, 2017.\nIncorporated by reference from Form 8-K filed on September 8, 2017.\nIncorporated by reference from Form 8-K filed on February 26, 2021.\nIncorporated by reference from Form 8-K filed on March 22, 2019.\nIncorporated by reference from Form 10-Q filed on May 16, 2022.\nIncorporated by reference from Form 8-K filed on April 1, 2020.\nIncorporated by reference from Form 8-K filed on March 9, 2020.\nIncorporated by reference from Form 8-K filed on June 4, 2020.\nIncorporated by reference from Form 8-K filed on June 12, 2020.\nIncorporated by reference from Form 10-K filed on January 5, 2021.\nIncorporated by reference from Form 8-K filed on October 4, 2022.\nIncorporated by reference from Form 8-K filed on November 29, 2022.\nIncorporated by reference from Form 10-Q filed on May 11, 2023.\nIncorporated by reference from Form 8-K filed on December 6, 2023.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCEMTREX, INC.\nDecember 28, 2023 By: /s/ Saagar Govil\nSaagar Govil,\nChairman of the Board, CEO,\nPresident and Secretary (Principal Executive Officer)\nDecember 28, 2023 By: /s/ Paul J. Wyckoff\nPaul J. Wyckoff,\nInterim CFO (Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities and Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDecember 28, 2023 By: /s/ Saagar Govil\nSaagar Govil,\nChairman of the Board, CEO,\nPresident and Secretary (Principal Executive Officer)\nDecember 28, 2023 By: /s/ Paul J. Wyckoff\nPaul J. Wyckoff,\nInterim CFO (Principal Financial and Accounting Officer)\nDecember 28, 2023 By: /s/ Brian Kwon\nBrian Kwon,\nDirector\nDecember 28, 2023 By: /s/ Manpreet Singh\nManpreet Singh,\nDirector\nDecember 28, 2023 By: /s/ Metodi Filipov\nMetodi Filipov,\nDirector\nIndex to the Consolidated Financial Statements\nContents\nPage(s)\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets at September 30, 2023 and 2022\nConsolidated Statements of Operations for the Fiscal Years Ended September 30, 2023 and 2022\nConsolidated Statement of Comprehensive Loss for the Fiscal Years Ended September 30, 2023 and 2022\nF- 5\nConsolidated Statements of Shareholders Equity for the Fiscal Years Ended September 30, 2023 and 2022\nConsolidated Statement of Cash Flows for Fiscal Years Ended September 30, 2023 and 2022\nNotes to the Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Cemtrex, Inc. and Subsidiaries\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Cemtrex, Inc. and Subsidiaries (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of operations, comprehensive loss, stockholders equity, and cash flows for each of the years in the two-year period ended September 30, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the years in the two-year period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt Regarding the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As described in Note 1 to the financial statements, the Company has sustained net losses and has significant short-term debt obligations, which raise substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty. Our opinion is not modified with respect to this matter.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of Goodwill\nDescription of the matter\nAt September 30, 2023, the Company had approximately $4.4 million of goodwill. As discussed in Note 1 to the consolidated financial statements, goodwill is tested annually for impairment at the reporting unit level, or more frequently if impairment indicators arise.\nAuditing the Companys goodwill impairment analyses was complex and highly judgmental due to the nature of qualitive assessment and, where necessary, the significant estimation required to determine the fair value of the reporting units. In particular, the fair value estimate was sensitive to significant assumptions, such as future operating results, cash flows and the weighted average cost of capital. These significant assumptions are forward looking and could be materially affected by future market or economic conditions.\nHow we addressed the matter\nWe obtained an understanding of controls over the Companys goodwill impairment evaluation process, including controls over managements review of the significant assumptions described above.\nOur audit procedures to test the Companys goodwill impairment analyses included evaluating the reasonableness of the Companys qualitative assessments and its estimated fair value of the reporting units. In evaluating estimated fair value of reporting units we, among other items, evaluated managements significant assumptions described above and used within the fair value method, and tested the completeness and accuracy of the underlying data. We involved our valuation specialists to assist in assessing fair valuation methodologies utilized in the Companys goodwill impairment analyses and to assist in evaluating certain assumptions utilized in the analyses, including discount rates.. We assessed the historical accuracy of managements projected cash flows, where applicable, and performed sensitivity analyses of the significant assumptions to evaluate the changes in the fair value of the reporting units that would result from changes in the assumptions. Finally, we assessed the adequacy of the disclosures in the consolidated financial statements.\nRelated Party Receivables\nDescription of the matter\nAt September 30, 2023, the Company had approximately $2.6 million of related party receivables. These receivables are made up of $1.1 million of trade receivables, $0.8 million of a note receivable, and $0.7 million of royalty receivable. The related party nature of these receivables and associated disclosures are material to the financial statements and of a highly sensitive nature.\nHow we addressed the matter\nWe obtained an understanding of controls over the Companys accounting and disclosures for related party transactions.\nOur audit procedures primarily included the following:\n● Obtaining an understanding of certain related party transaction by reading relevant agreements, as applicable;\n● In certain instance, obtaining confirmations from the related parties to affirm the existence of the open receivable and personal guarantees, as applicable;\n● Performing other audit procedures on certain open balances including, among other things, vouching to invoices from the related parties and source documentation representing subsequent cash collections of such receivables;\n● Scanning subledgers and documentation obtained in other audit areas for known related parties; and,\n● Finally, we evaluated the Companys disclosures related to the matters described above.\n/s/ Grassi & Co, CPAs, P.C.\nWe have served as the Companys auditor since 2021.\nJericho, New York\nDecember 28, 2023,\nAuditor PCAOB ID Number 606\nCemtrex Inc. and Subsidiaries\nCONSOLIDATED BALANCE SHEETS\nSeptember 30, September 30,\nAssets\nCurrent assets\nCash and equivalents $ 5,329,910 $ 9,895,761\nRestricted cash 1,019,652 1,577,915\nShort-term investments 13,663 13,721\nTrade receivables, net 9,209,695 5,399,216\nTrade receivables - related party 1,143,342 -\nTrade receivables, net 1,143,342 -\nInventory -net of allowance for inventory obsolescence 8,739,219 8,487,817\nContract assets 1,739,201 781,819\nPrepaid expenses and other assets 2,098,359 1,639,825\nAssets of discontinued operations - 3,971,693\nTotal current assets 29,293,041 31,767,767\nProperty and equipment, net 9,218,701 5,280,442\nRight-of-use assets 2,287,623 2,641,198\nRoyalties receivable - related party 674,893 -\nNote receivable - related party 761,585 761,585\nGoodwill 4,381,891 3,906,891\nOther 1,836,009 1,399,745\nTotal Assets $ 48,453,743 $ 45,757,628\nLiabilities & Stockholders Equity\nCurrent liabilities\nAccounts payable $ 6,196,406 $ 3,050,937\nAccounts payable - related party 68,509 19,133\nAccounts payable 68,509 19,133\nSales tax payable 35,829 20,095\nShort-term liabilities, net of unamortized original issue discounts 14,507,711 16,894,743\nLease liabilities - short-term 741,487 754,495\nDeposits from customers 57,434 73,144\nAccrued expenses 2,784,390 2,251,093\nContract liabilities 980,319 369,890\nDeferred revenue 1,583,406 1,181,198\nAccrued income taxes 388,627 94,848\nLiabilities of discontinued operations - 805,219\nTotal current liabilities 27,344,118 25,514,795\nLong-term liabilities\nLoans payable to bank 1,909,739 110,331\nLong-term lease liabilities 1,607,202 1,822,468\nNotes payable 4,679,743 -\nMortgage payable 3,289,303 2,160,169\nOther long-term liabilities 501,354 807,898\nPaycheck Protection Program Loans 50,563 97,120\nDeferred Revenue - long-term 727,928 607,309\nTotal long-term liabilities 12,765,832 5,605,295\nTotal liabilities 40,109,950 31,120,090\nCommitments and contingencies - -\nStockholders equity\nPreferred stock , $0.001 par value, 10,000,000 shares authorized, Series 1, 3,000,000 shares authorized, 2,293,016 shares issued and 2,228,916 shares outstanding as of September 30, 2023 and 2,079,122 shares issued and 2,015,022 shares outstanding as of September 30, 2022 (liquidation value of $10 per share) 2,293 2,079\nSeries C, 100,000 shares authorized, 50,000 shares issued and outstanding at September 30, 2023 and September 30, 2022\nPreferred stock, value\nCommon stock, $0.001 par value, 50,000,000 shares authorized, 1,045,789 shares issued and outstanding at September 30, 2023 and 754,711 shares issued and outstanding at September 30, 2022 1,046\nAdditional paid-in capital 68,881,705 66,641,698\nAccumulated deficit (64,125,895 ) (54,929,020 )\nTreasury stock, 64,100 shares of Series 1 Preferred Stock at September 30, 2023 and September 30, (148,291 ) (148,291 )\nAccumulated other comprehensive income 3,076,706 2,377,525\nTotal Cemtrex stockholders equity 7,687,614 13,944,796\nNon-controlling interest 656,179 692,742\nTotal liabilities and stockholders equity $ 48,453,743 $ 45,757,628\nThe accompanying notes are an integral part of these consolidated financial statements.\nCemtrex Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the year ended\nSeptember 30, 2023 September 30, 2022\nRevenues $ 59,368,562 $ 45,026,780\nCost of revenues 33,682,736 28,460,852\nGross profit 25,685,826 16,565,928\nOperating expenses\nGeneral and administrative 23,929,340 22,934,555\nResearch and development 3,267,994 4,444,488\nGoodwill impairment - 3,316,000\nTotal operating expenses 27,197,334 30,695,043\nOperating loss (1,511,508 ) (14,129,115 )\nOther (expense)/income\nOther income, net 476,693 7,180,738\nInterest expense (4,966,298 ) (3,878,703 )\nTotal other (expense)/income, net (4,489,605 ) 3,302,035\nNet loss before income taxes (6,001,113 ) (10,827,080 )\nIncome tax (expense)/benefit (394,272 ) 209,345\nLoss from Continuing operations (6,395,385 ) (10,617,735 )\nLoss from discontinued operations, net of tax (2,838,053 ) (2,674,507 )\nNet loss (9,233,438 ) (13,292,242 )\nLess loss in noncontrolling interest (36,563 ) (271,284 )\nNet loss attributable to Cemtrex, Inc. stockholders $ (9,196,875 ) $ (13,020,958 )\nLoss per share - Basic & Diluted\nContinuing Operations $ (7.68 ) $ (14.83 )\nDiscontinued Operations $ (3.26 ) $ (3.77 )\nWeighted Average Number of Shares-Basic & Diluted 870,121 709,488\nCemtrex Inc. and Subsidiaries\nCONSOLIDATED STATEMENT OF COMPREHENSIVE LOSS\nFor the year ended\nSeptember 30, 2023 September 30, 2022\nOther comprehensive loss\nNet loss $ (9,233,438 ) $ (13,292,242 )\nForeign currency translation gain/(loss) 699,181 (518,927 )\nComprehensive loss (8,534,257 ) (13,811,169 )\nLess comprehensive income attributable to noncontrolling interest (36,563 ) (271,284 )\nComprehensive loss attributable to Cemtrex, Inc. stockholders $ (8,497,694 ) $ (13,539,885 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nCemtrex Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nPreferred Stock Series 1 Preferred Stock Series C Common Stock Par\nPar Value $0.001 Par Value $0.001 Value $0.001\nAdditional\nTreasury Stock, 64,100 shares of Series 1 Accumulated other Cemtrex Non-\nNumber of\nNumber of\nNumber of\nPaid-in Accumulated Preferred Comprehensive Stockholders controlling\nShares Amount Shares Amount Shares Amount Capital Deficit Stock Income(loss) Equity interest\nBalance at September 30, 2022 2,079,122 $ 2,079 50,000 $ 50 754,711 $ 755 $ 66,641,698 $ (54,929,020 ) $ (148,291 ) $ 2,377,525 $ 13,944,796 $ 692,742\nForeign currency translation gain/(loss)\n699,181 699,181\nShare-based compensation\n-\n106,839\n106,839\nShares issued to pay notes payable\n241,655 1,917,631\n1,917,873\nDividends paid in Series 1 preferred shares 213,894\n-\n(214 ) -\n-\nIncome/(loss) attributable to noncontrolling interest\n-\n- (36,563 )\nShares issued to pay for services\n- 30,103 215,770\n-\n215,800\nAdditional rounding shares issued for reverse stock split\n19,314 (19 )\n-\nNet loss\n(9,196,875 )\n(9,196,875 )\nBalance at September 30, 2023 2,293,016 $ 2,293 50,000 $ 50 1,045,783 $ 1,046 $ 68,881,705 $ (64,125,895 ) $ (148,291 ) $ 3,076,706 $ 7,687,614 $ 656,179\nThe accompanying notes are an integral part of these consolidated financial statements.\nCemtrex Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nPreferred Stock Series 1 Preferred Stock Series C Common Stock Par\nPar Value $0.001 Par Value $0.001 Value $0.001\nAdditional\nTreasury Stock, 64,100 shares of Series 1 Accumulated other Cemtrex Non-\nNumber of\nNumber of\nNumber of\nPaid-in Accumulated Preferred Comprehensive Stockholders controlling\nShares Amount Shares Amount Shares Amount Capital Deficit Stock Income(loss) Equity interest\nBalance at September 30, 2021 1,885,151 $ 1,885 50,000 $ 50 593,777 $ 594 $ 61,748,022 $ (41,908,062 ) $ (148,291 ) $ 2,896,452 $ 22,590,650 $ 964,026\nForeign currency translation gain/(loss)\n(518,927 ) (518,927 )\nShare-based compensation\n-\n155,507\n155,507\nShares issued to pay notes payable\n128,076 3,992,996\n3,993,124\nShares issued with note payable\n- - 28,572 695,371 - -\n695,400\nDividends paid in Series 1 preferred shares 193,971\n(194 )\n-\nIncome/(loss) attributable to noncontrolling interest\n-\n- (271,284 )\nShares issued to pay for services\n4,286 49,996\n50,000\nNet loss\n(13,020,958 )\n(13,020,958 )\nBalance at September 30, 2022 2,079,122 $ 2,079 50,000 $ 50 754,711 $ 755 $ 66,641,698 $ (54,929,020 ) $ (148,291 ) $ 2,377,525 $ 13,944,796 $ 692,742\nThe accompanying notes are an integral part of these consolidated financial statements.\nCemtrex Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the year ended\nSeptember 30,\nCash Flows from Operating Activities\nNet loss $ (9,233,438 ) $ (13,292,242 )\nAdjustments to reconcile net loss to net cash used by operating activities\nDepreciation and amortization 1,026,075 1,752,098\nLoss on disposal of property and equipment 69,601 78,707\nNoncash lease expense 702,747 590,656\nGoodwill Impairment - 3,316,000\nBad debt expense (recovery) (14,515 ) 73,696\nLoss on write off of related party receivables - 708,512\nShare-based compensation 106,839 155,505\nIncome tax expense/ (benefit) - (208,545 )\nInterest expense paid in equity shares 409,541 926,646\nAccounts payable paid in equity shares - 50,000\nAccrued interest on notes payable 2,707,262 1,043,346\nAmortization of original issue discounts on notes payable 1,264,111 1,544,622\nGain/(loss) on marketable securities (8,399,152 )\nDischarge of Paycheck Protection Program Loans - (971,500 )\nChanges in operating assets and liabilities net of effects from acquisition of subsidiaries:\nTrade receivables (3,795,964 ) 1,813,511\nTrade receivables - related party (1,143,342 ) -\nInventory 48,598 (3,731,742 )\nContract assets (290,123 )\nPrepaid expenses and other current assets (458,534 ) 2,578\nOther assets (336,264 ) (277,308 )\nAccounts payable 3,361,269 (811,678 )\nAccounts payable - related party 49,376 41,205\nSales tax payable 15,734 (4,021 )\nOperating lease liabilities (577,446 ) (498,728 )\nDeposits from customers (15,710 ) (400,104 )\nAccrued expenses 475,798 654,184\nContract liabilities 393,960\nDeferred revenue 522,827 (207,119 )\nIncome taxes payable 293,779 (180,385 )\nOther liabilities (306,544 ) (31,273 )\nNet cash used by operating activities - continuing operations (4,724,305 ) (16,262,531 )\nNet cash provided by operating activities - discontinued operations 2,491,581 169,027\nNet cash used by operating activities (2,232,724 ) (16,093,504 )\nCash Flows from Investing Activities\nPurchase of property and equipment (2,761,314 ) (1,773,712 )\nProceeds from sale of property and equipment 26,205 554,335\nInvestment in MasterpieceVR (100,000 ) (500,000 )\nAcquisitions, Net of Cash Acquired (2,793,291 ) -\nProceeds from sale of marketable securities - 28,302,309\nPurchase of marketable securities - (19,901,897 )\nNet cash (used in)/provided by investing activities - continuing operations (5,628,400 ) 6,681,035\nNet cash used by investing activities - discontinued operations - (70,908 )\nNet cash (used in)/provided by investing activities (5,628,400 ) 6,610,127\nCash Flows from Financing Activities\nProceeds from notes payable 240,000 8,000,000\nProceeds on bank loans 3,360,000 -\nPayments on debt (1,044,370 ) (1,751,763 )\nPayments on Paycheck Protection Program Loans (30,286 ) -\nPayments on bank loans (488,689 ) (1,225,700 )\nNet cash provided by financing activities 2,036,655 5,022,537\nEffect of currency translation 700,355 (537,387 )\nNet decrease in cash, cash equivalents, and restricted cash (5,824,469 ) (4,460,840 )\nLess cash attributed to discontinued operations - (714,420 )\nCash, cash equivalents, and restricted cash at beginning of period 11,473,676 17,186,323\nCash, cash equivalents, and restricted cash at end of period $ 6,349,562 $ 11,473,676\nThe accompanying notes are an integral part of these consolidated financial statements.\nCemtrex Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nBalance Sheet Accounts Included in Cash, Cash Equivalents, and Restricted Cash\nCash and equivalents $ 5,329,910 $ 10,610,181\nLess cash attributed to discontinued operations - (714,420 )\nRestricted cash 1,019,652 1,577,915\nTotal cash, cash equivalents, and restricted cash $ 6,349,562 $ 11,473,676\nSupplemental Disclosure of Cash Flow Information:\nCash paid during the period for interest $ 585,384 $ 383,105\nCash paid during the period for income taxes, net of refunds $ (293,779 ) $ 353,346\nSupplemental Schedule of Non-Cash Investing and Financing Activities\nShares issued to pay for services $ 215,800 $ 50,000\nShares issued to pay notes payable $ 1,917,873 $ 3,993,124\nFinancing of building purchase $ 1,200,000 $ -\nFinancing of acquisition $ 2,400,000 $ -\nPurchase of property and equipment through vendor financing $ 675,000 $ -\nShares issued in connection with note payable $ - $ 700,400\nInvestment in right of use asset $ 349,172 $ 317,187\nThe accompanying notes are an integral part of these consolidated financial statements.\nCemtrex Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION\nCemtrex was incorporated in 1998, in the state of Delaware and has evolved through strategic acquisitions and internal growth into a leading multi-industry technology company. The Company has expanded in a wide range of sectors, including smart technologies, virtual and augmented realities, industrial solutions, and intelligent security systems. Unless the context requires otherwise, all references to we, our, us, Company, registrant, Cemtrex or management refer to Cemtrex, Inc. and its subsidiaries.\nSale of former Cemtrex Brands\nOn November 22, 2022, the Company entered into two Asset Purchase Agreements and one Simple Agreement for Future Equity (SAFE) with the Companys CEO, Saagar Govil, to secure the sale of the subsidiaries Cemtrex Advanced Technologies, Inc, which include the brand SmartDesk, and Cemtrex XR, Inc., which include the brands Cemtrex XR, Virtual Driver Interactive, Bravo Strong, and good tech (formerly Cemtrex Labs), to Mr. Govil.\nOn November 22, 2022, the Company completed the above disposition for the following consideration.\n● Cemtrex XR, Inc.\n○ $895,000 comprised of:\n■ $75,000 in cash payable at Closing; and\n■ 5% royalty of all revenues on the Business to be paid 90 days after the end of each calendar year for the next three years; and should the total sum of royalties due be less than $820,000 at the end of the three-year period, Purchaser shall be obligated to pay the difference between $820,000 and the royalties paid.\n● Cemtrex Advanced Technologies, Inc.\n○ $10,000 in cash payable at Closing; and\n○ 5% royalty of all revenues on the Business to be paid 90 days after the end of each calendar year for the next 5 years; and\n○ $1,600,000 in SAFE (common equity) at any subsequent fundraising or exit above $5,000,000 with a $10,000,000 cap.\nThe Companys Board of Directors, excluding Saagar Govil who abstained from all voting on these agreements, approved these actions and agreements.\nAcquisition of Heisey Mechanical\nOn July 1, 2023, the Company under AIS, completed the acquisition of a leading service contractor and steel fabricator that specializes in industrial and water treatment markets, Heisey Mechanical, Ltd. (Heisey) based in Columbia, Pennsylvania. The real estate of the business was purchased at fair market value on August 30, 2023, for $1,500,000 in a separate transaction.\nHeisey provides the water treatment industry with a variety of fabricated vessels and equipment including ASME pressure vessels, heat exchangers, mix tanks, reactors, and other specialized fabricated equipment. Additionally, the contracting team assists with installation and service of fabricated items. The company has over 33,000 square feet of manufacturing floor space in its facility and an experienced staff of fabricators, welders, and field mechanics.\nThe purchase price allocation presented below is still preliminary but has been developed based on an estimate of fair values of Heiseys identifiable tangible and intangible assets acquired and liabilities assumed as of July 1, 2023. The final allocation of the purchase price will be determined within one year from the closing date of the Heisey acquisition.\nThe consideration transferred and preliminary allocation of Heiseys tangible and intangible assets and liabilities, are as follows:\nSCHEDULE OF BUSINESS ACQUISITION OF TANGIBLE AND INTANGIBLE ASSETS AND LIABILITIES\nConsideration Transferred:\nCash $ 393,291\nSellers note 240,000\nFinanced amount 2,160,000\nTotal consideration transferred $ 2,793,291\nPurchase Price Allocation:\nInventory 300,000\nContract assets 667,259\nMachinery and equipment 1,625,000\nContract liabilities (216,469 )\nAccrued expenses (57,499 )\nGoodwill 475,000\nTotal consideration transferred $ 2,793,291\nThe unaudited pro forma summary below presents the results of operations as if the Heisey acquisition occurred on October 1, 2021. Unaudited proforma adjustments for the twelve months ended September 30, 2023, includes $127,800 of depreciation expense from acquired fixed assets, $127,883 of interest expense on the debt used in the acquisition. Unaudited proforma adjustments for the twelve months ended September 30, 2022, includes $255,600 of depreciation expense from acquired fixed assets, $81,140 of interest expense on the debt used in the acquisition. The pro forma summary uses estimates and assumptions based on information available at the time. Management believes the estimates and assumptions to be reasonable; however, actual results may have differed significantly from this unaudited pro forma financial information. The unaudited pro forma information does not reflect any cost savings, operating synergies or revenue enhancements that might have been achieved from combining the operations.\nSCHEDULE OF PRO FORMA FINANCIAL INFORMATION\nSeptember 30, 2023 September 30, 2022\nUnaudited\nFor the year ended\nSeptember 30, 2023 September 30, 2022\nRevenues $ 66,274,838 $ 53,970,595\nNet loss (9,173,748 ) (13,038,817 )\nOn August 30, 2023, the Company acquired a mortgage in the amount of $1,200,000 from Fulton Bank to finance the purchase of the properties formerly owned by Heisey Mechanical Ltd. The mortgage carries interest at the Secured Overnight Financing Rate (SOFR) plus 2.8% and matures on September 30, 2043.\nCommon Stock Reverse Stock Split\nOn January 25, 2023, the company completed a 35:1 reverse stock split on its common stock. All share and per share data have been retroactively adjusted for this reverse split.\nNotice of Delisting, Extension of cure period, and Subsequent Compliance\nSeries 1 Preferred Stock\nOn July 29, 2022, the Company received a notification letter from the Listing Qualifications Department of The Nasdaq Stock Market LLC (Nasdaq) notifying the Company that, because the closing bid price for the Companys Series 1 preferred stock listed on Nasdaq was below $1.00 for 30 consecutive trading days, the Company no longer met the minimum bid price requirement for continued listing on The Nasdaq Capital Market under Nasdaq Marketplace Rule 5550(a)(2), requiring a minimum bid price of $1.00 per share (the Minimum Bid Price Requirement). On January 26, 2023, the Company received a notification letter from the Listing Qualifications Department of Nasdaq notifying the Company that, it had been granted an additional 180 days or until July 24, 2023, to regain compliance with the Minimum Bid Price Requirement based on the Company meeting the continued listing requirement for market value of publicly held shares and all other applicable requirements for initial listing on the Capital Market with the exception of the bid price requirement, and the Companys written notice of its intention to cure the deficiency during the second compliance period by effecting a reverse stock split, if necessary. On September 8, 2023, Cemtrex Inc. (the Company) received a letter from the Nasdaq Hearings Panel (Panel) informing the Company that the Panel has granted the Company a temporary exception to regain compliance with The Nasdaq Stock Market LLCs (Nasdaq or the Exchange) Listing Rule 5555(a)(1) (the Bid Price Rule) by no later than January 19, 2024. The Company has announced a special meeting of Series 1 Preferred stock shareholders scheduled for December 26, 2023, to approve the reverse stock split.\nCommon Stock\nOn January 24, 2022, the Company received a notification letter from the Listing Qualifications Department of Nasdaq notifying the Company that, because the closing bid price for the Companys common stock listed on Nasdaq was below $1.00 for 30 consecutive trading days, the Company no longer met the minimum bid price requirement for continued listing on The Nasdaq Capital Market under Nasdaq Marketplace Rule 5550(a)(2), requiring a minimum bid price of $1.00 per share (the Minimum Bid Price Requirement).\nOn July 26, 2022, the Company received a notification letter from the Listing Qualifications Department of The Nasdaq Stock Market LLC Nasdaq notifying the Company that, it had been granted an additional 180 days or until January 23, 2023, to regain compliance with the Minimum Bid Price Requirement based on the Company meeting the continued listing requirement for market value of publicly held shares and all other applicable requirements for initial listing on the Capital Market with the exception of the bid price requirement, and the Companys written notice of its intention to cure the deficiency during the second compliance period by effecting a reverse stock split, if necessary.\nOn January 26, 2023, the Company received a notification letter from the Listing Qualifications Department of Nasdaq notifying the Company that it has not regained compliance with Listing Rule 5550(a)(2) and accordingly would be delisted from the Capital Market. The Company then requested and had been granted a hearing to occur on March 16, 2023, appealing this determination to a Hearings Panel (the Panel), pursuant to the procedures set forth in the Nasdaq Listing Rule 5800 Series.\nOn February 8, 2023, the Company received a notification letter from the Listing Qualifications Department of Nasdaq notifying the Company that it has regained compliance with Listing Rule 5550(a)(2) and is in compliance with all applicable listing standards. The Companys common stock will continue to be listed and traded on The Nasdaq Stock Market.\nGoing Concern Considerations\nThe accompanying consolidated financial statements of the Company have been prepared assuming the Company will continue as a going concern and in accordance with generally accepted accounting principles in the United States of America. The going concern basis of presentation assumes that the Company will continue in operation one year after the date these financial statements are issued and will be able to realize its assets and discharge its liabilities and commitments in the normal course of business. Pursuant to the requirements of the ASC 205, management must evaluate whether there are conditions or events, considered in the aggregate, that raise substantial doubt about the Companys ability to continue as a going concern for one year from the date these financial statements are issued.\nThis evaluation does not take into consideration the potential mitigating effect of managements plans that have not been fully implemented or are not within control of the Company as of the date the financial statements are issued. When substantial doubt exists under this methodology, management evaluates whether the mitigating effect of its plans sufficiently alleviates substantial doubt about the Companys ability to continue as a going concern. The mitigating effect of managements plans, however, is only considered if both (1) it is probable that the plans will be effectively implemented within one year after the date that the financial statements are issued, and (2) it is probable that the plans, when implemented, will mitigate the relevant conditions or events that raise substantial doubt about the entitys ability to continue as a going concern within one year after the date that the financial statements are issued.\nThe Company has incurred substantial losses of $9,196,875 and $13,020,958 for fiscal years 2023 and 2022, respectively, and has debt obligations over the next fiscal year of $14,507,711 and working capital of $1,948,923, that raise substantial doubt with respect to the Companys ability to continue as a going concern.\nWhile the Companys working capital and current debt indicate a substantial doubt regarding the Companys ability to continue as a going concern, the Company has historically, from time to time, satisfied and may continue to satisfy certain short-term liabilities through the issuance of common stock, thus reducing our cash requirement to meet our operating needs. Additionally, the Company has recently sold unprofitable brands, reducing the cash required to maintain those brands, implemented a new pricing model on our Vicon brand which has improved margins on those products, has refinanced some debt to provide the Company with additional capital when needed, has effected a reverse stock split on our common stock to remain trading on the Nasdaq Capital Markets, and improve our ability to raise capital through equity offerings and reduce the number of shares the Company may use to satisfy debt. In the event additional capital is raised through equity offerings and/or debt is satisfied with equity, it may have a dilutive effect on our existing stockholders. While the Company believes these plans are sufficient to meet the capital demands of our current operations for at least the next twelve months, the is no guarantee that we will succeed.\nOverall, there is no guarantee that cash flow from our existing or future operations and any external capital that we may be able to raise will be sufficient to meet our working capital needs. The Company currently do not have adequate cash to meet our short or long-term needs. The consolidated financial statements do not include any adjustments relating to this uncertainty.\nSettlement with the Securities and Exchange Commission\nOn September 30, 2022, acting pursuant to an offer of settlement submitted by the Company, the U.S. Securities and Exchange Commission (SEC) issued an order pursuant to Section 8A of the Securities Act, directing the Company to cease and desist from committing or causing any violations and any future violations of Section 17(a) of the Securities Act and Section 10(b) of the Exchange Act and Rule 10b-5 thereunder (the SEC Order).\nThe SEC Order also directed Mr. Saagar Govil to cease and desist from committing or causing any violations and any future violations of Section 17(a)(3) of the Securities Act.\nThe SEC found that, as a result of its conduct, which was neither admitted nor denied, the Company violated Section 17(a) of the Securities Act and Section 10(b) of the Exchange Act and Rule 10b-5 thereunder, which prohibit fraudulent conduct in the offer or sale of securities and in connection with the purchase or sale of securities.\nThe SEC also found that, as a result of his conduct, which was neither admitted nor denied, Mr. Govil violated Section 17(a)(3) of the Securities Act, which makes it illegal to engage in any transaction, practice, or course of business which operates or would operate as a fraud or deceit upon the purchaser.\nIn addition to the above cease and desists, the Company undertook to not publicly announce that it has partnered with another company or that another company has become a customer of the Company without providing prior written notice, including a copy of the announcement text, to the businessperson at the other company responsible for that companys relationship with the Company.\nAlso, the Company received a civil monetary penalty of two million two hundred thousand dollars ($2,200,000) in the aggregate that was paid to the SEC. Mr. Govil also received a civil monetary penalty of three hundred and fifty thousand dollars ($350,000) in the aggregate that was paid to the SEC. The Company and Mr. Govil have remitted the payments as of September 30, 2022. The Companys penalty is presented on the Consolidated Statement of Operations under the heading Other Income, net. The SEC Order can be accessed at www.sec.gov.\nNOTE 2 - BASIS OF PRESENTATION AND SIGNIFICANT ACCOUNTING POLICIES\nThe management of the Company is responsible for the selection and use of appropriate accounting policies and the appropriateness of accounting policies and their application. Critical accounting policies and practices are those that are both most important to the portrayal of the Companys financial condition and results and require managements most difficult, subjective, or complex judgments, often as a result of the need to make estimates about the effects of matters that are inherently uncertain. The Companys significant and critical accounting policies and practices are disclosed below as required by generally accepted accounting principles.\nBasis of Presentation\nThe accompanying consolidated financial statements and related notes have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nFiscal Year-End\nThe Company elected September 30 as its fiscal year-end date.\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, and disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. Such estimates include, but are not limited to, provisions for doubtful trade receivables, net realizable value of inventory, warranty obligations, income tax accruals, deferred tax valuation and assessments of the recoverability of the Companys long-lived assets. Actual results could differ from those estimates.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company, its wholly owned subsidiaries, Cemtrex Technologies Pvt. Ltd., and Advanced Industrial Services, Inc. and the Companys majority owned subsidiary Vicon Industries, Inc. and its subsidiary, Vicon Systems, Ltd. All inter-company balances and transactions have been eliminated in consolidation.\nCarrying Value, Recoverability and Impairment of Long-Lived Assets\nThe Companys long-lived assets, which include property and equipment and intangible assets, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable.\nThe Company assesses the recoverability of its long-lived assets by comparing the projected undiscounted net cash flows associated with the related long-lived asset or group of long-lived assets over their remaining estimated useful lives against their respective carrying amounts. Impairment, if any, is based on the excess of the carrying amount over the fair value of those assets. Fair value is generally determined using the assets expected future discounted cash flows or market value, if readily determinable. When long-lived assets are determined to be recoverable, but the newly determined remaining estimated useful lives are shorter than originally estimated, the net book values of the long-lived assets are depreciated over the newly determined remaining estimated useful lives.\nThe impairment charges, if any, is included in operating expenses in the accompanying consolidated statements of operations.\nCash Equivalents\nThe Company considers all highly liquid investments with maturities of three months or less at the time of purchase to be cash equivalents.\nTrade Receivables and Allowance for doubtful accounts\nTrade receivables are recorded at the invoiced amount, net of an allowance for doubtful accounts. The Company performs on-going credit evaluations of its customers and adjusts credit limits based upon payment history and the customers current credit worthiness, as determined by the review of their current credit information; and determines the allowance for doubtful accounts based on historical write-off experience, customer specific facts and general economic conditions that may affect a clients ability to pay.\nAccount balances are charged against the allowance after all means of collection have been exhausted and the potential for recovery is considered remote. The Company determines when receivables are past due or delinquent based on how recently payments have been received.\nThe Company reserved $234,924 and $249,439 within its allowance for doubtful accounts at September 30, 2023, and 2022, respectively.\nThe Company does not have any off-balance-sheet credit exposure to its customers at September 30, 2023, or 2022.\nInventory and Cost of Goods Sold\nThe Company values inventory, consisting of finished goods, at the lower of cost or net realizable value. Cost is determined on the average cost method. The Company reduces inventory for the diminution of value, resulting from product obsolescence, damage or other issues affecting marketability, equal to the difference between the cost of the inventory and its estimated market value. Factors utilized in the determination of estimated market value include (i) current sales data and historical return rates, (ii) estimates of future demand, and (iii) competitive pricing pressures.\nThe Company classifies inventory markdowns in the income statement as a component of cost of goods sold. These markdowns are estimates, which could vary significantly from actual requirements if future economic conditions, customer demand or competition differ from expectations.\nThere was $618,021 and $1,088,377 in inventory obsolescence reserve at September 30, 2023, and 2022, respectively.\nProperty and Equipment\nProperty and equipment are recorded at cost. Expenditures for major additions and betterments are capitalized. Maintenance and repairs are charged to operations as incurred. Depreciation of property and equipment is computed by the straight-line method over the estimated useful lives of the respective assets, shown in the table below;\nSCHEDULE OF PROPERTY PLANT AND EQUIPMENT\nEstimated Useful Life\n(Years)\nBuilding\nFurniture and office equipment 3-5\nComputer software\nMachinery and equipment\nUpon sale or retirement of property and equipment, the related cost and accumulated depreciation are removed from the accounts and any gain or loss is reflected in statements of operations.\nGoodwill\nGoodwill is tested for impairment annually as of September 30. If circumstances change during interim periods between annual tests that would more likely than not reduce the fair value of a reporting unit below its carrying value, the Company will test goodwill for impairment. Factors that would necessitate an interim goodwill impairment assessment include prolonged negative industry or economic trends, or significant under-performance relative to expected, historical or projected future operating results. Management uses judgment to determine whether to use a qualitative analysis or a quantitative fair value measurement for its goodwill impairment testing. The Companys fair value measurement approach combines the income and market valuation techniques for each of the Companys reporting units that carry goodwill. These valuation techniques use estimates and assumptions including, but not limited to, the determination of appropriate market comparable, projected future cash flows (including timing and profitability), discount rate reflecting the risk inherent in future cash flows, perpetual growth rate, and projected future economic and market conditions. As permitted, if the reporting unit fails the impairment test, the Financial Accounting Standards Board (FASB) issued an Accounting Standard Update (ASU) removing step two from the goodwill impairment test. If a reporting unit fails the quantitative impairment test, impairment expense is immediately recorded as the difference between the reporting units fair value and carrying value. The Company adopted this standard effective October 1, 2020.\nFor the year ended September 30, 2023, no impairment of the Companys goodwill was recorded and for the year ended September 30,2022, an impairment of the Companys goodwill of $3,316,000 was recorded.\nStrategic Investment\nOn November 13, 2020, and January 19, 2022, Cemtrex made $500,000 investments and on July 18, 2023, and October 5, 2023, made additional $100,000 investments via a simple agreement for future equity (SAFE) in MasterpieceVR. The SAFE provides that the Company will automatically receive shares of the entity based on the conversion rate of future equity rounds up to a valuation cap, as defined. MasterpieceVR is a software company that is developing software for content creation using virtual reality. The investment is included in other assets in the accompanying consolidated balance sheet and the Company accounts for this investment and recorded at cost. No impairment has been recorded for the period ended September 30, 2023.\nLeases\nOn October 1, 2019, the Company adopted ASU 2016-02 (Topic 842), Leases. ASU 2016-02 requires that a lessee recognize the assets and liabilities that arise from operating leases. A lessee should recognize in the statement of financial position a liability to make lease payments (the lease liability) and a right-of-use asset representing its right to use the underlying asset for the lease term. For leases with a term of 12 months or less, a lessee is permitted to make an accounting policy election by class of underlying asset not to recognize lease assets and lease liabilities. In transition, lessees and lessors may use the effective date method and elected certain practical expedients allowing the Company not to reassess:\n● whether expired or existing contracts contain leases under the new definition of a lease;\n● lease classification for expired or existing leases; and\n● whether previously capitalized initial direct costs would qualify for capitalization under Topic 842.\nThe Company also made the accounting policy decision not to recognize lease assets and liabilities for leases with a term of 12 months or less.\nRelated Parties\nThe financial statements shall include disclosures of material related party transactions, other than compensation arrangements, expense allowances, and other similar items in the ordinary course of business. However, disclosure of transactions that are eliminated in the preparation of consolidated or combined financial statements is not required in those statements. The disclosures shall include: a. the nature of the relationship(s) involved b. description of the transactions, including transactions to which no amounts or nominal amounts were ascribed, for each of the periods for which income statements are presented, and such other information deemed necessary to an understanding of the effects of the transactions on the financial statements; c. the dollar amounts of transactions for each of the periods for which income statements are presented and the effects of any change in the method of establishing the terms from that used in the preceding period; and d. amounts due from or to related parties as of the date of each balance sheet presented and, if not otherwise apparent, the terms and manner of settlement.\nCommitment and Contingencies\nThe Company follows topic Accounting Standards Codification (ASC) Topic 450-20, Contingencies, to report accounting for contingencies. Certain conditions may exist as of the date the consolidated financial statements are issued, which may result in a loss to the Company, but which will only be resolved when one or more future events occur or fail to occur. The Company assesses such contingent liabilities, and such assessment inherently involves an exercise of judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or unasserted claims that may result in such proceedings, the Company evaluates the perceived merits of any legal proceedings or unasserted claims as well as the perceived merits of the amount of relief sought or expected to be sought therein.\nIf the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Companys consolidated financial statements. If the assessment indicates that a potential material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed.\nLoss contingencies considered remote are generally not disclosed unless they involve guarantees, in which case the guarantees would be disclosed. Management does not believe, based upon information available at this time, that these matters will have a material adverse effect on the Companys consolidated financial position, results of operations or cash flows. However, there is no assurance that such matters will not materially and adversely affect the Companys business, financial position, and results of operations or cash flows.\nRevenue Recognition\nOn October 1, 2018, the Company adopted ASU 2014-09, Revenue from Contracts with Customers (Topic 606), using the modified retrospective transition method. Under the guidance of the standard, revenue represents the amount received or receivable for goods and services supplied by the Company to its customers. Company recognizes revenue at the time a good or service is transferred to a customer and the customer obtains control of that good or receives the service performed. Most of the Companys sales arrangements with customers in the Security segment are short-term in nature involving single performance obligations related to the delivery of goods or repair of equipment and generally provide for transfer of control at the time of shipment to the customer. The Company generally permits returns of product or repaired equipment due to defects; however, returns are historically insignificant. Billing terms vary by customer and product but generally do not exceed 90 days.\nIn accordance with the authoritative guidance issued by the FASB on revenue recognition, the Company recognizes revenue from cost reimbursable contracts based on the services provided, typically represented by man-hours worked, and is measured by reference to agreed charge-out rates or to the estimated total contract revenue. Revenue from long-term fixed price contracts is recognized using the percentage-of-completion method, measured by reference to physical completion or the ratio of costs incurred to total estimated contract costs. If the outcome of a contract cannot be estimated reliably, as may be the case in the initial stages of completion of the contract, revenue is recognized only to the extent of the costs incurred that are expected to be recoverable. If a contract is expected to be loss-making, the expected amount of the loss is recognized immediately in the income statement. Revenue from short-term contracts is recognized when delivery has occurred, and collection of the resulting receivable is deemed probable. Timing of revenue recognition may differ from the timing of invoicing to customers.\nThe Company records a liability when receiving cash in advance of delivering goods or services to the customer. This liability is reversed against the receivable recognized when those goods or services are delivered. The amounts were $2,311,334, and $1,788,507, as of September 30, 2023, 2022 respectively, recorded at Deferred revenue. Additionally, the company recorded Deposits from customers of $57,434, and $73,144, as of September 30, 2023, and 2022 respectively.\nContracts\nThe Companys industrial services segments revenue is derived from contracts with customers. These contracts fall into two categories, Fixed Price and Time and Material Price contracts. The Company determines the appropriate accounting treatment for each contract at its inception. Generally, contracts have a period from six months to two years.\nThe Company accounts for a contract when: (i) it has approval and commitment from both parties, (ii) the rights of the parties are identified, (iii) payment terms are identified, (iv) the contract has commercial substance, and (v) collectability of consideration is probable. The Company considers the start of a project to be when the above criteria have been met and it has written authorization from the customer to proceed.\nFixed price contracts\nThe Companys revenue from fixed price contracts is recognized on the percentage-of-completion method, measured by the percentage of costs incurred to estimated total costs for each contract. When the job is started and in process, all actual costs incurred (labor and materials) are processed and reconciled at month end. The percentage of completion and revenue earned is calculated at month end. Billings are created based on contract criteria agreed upon and reconciled to determine if any costs in excess of billing or billings in excess of costs exist. Changes in job performance, job conditions, estimated contract costs and profitability, and final contract settlements may result in revisions to costs and income. The effects of these revisions are recognized in the period in which the revisions are determined. Provisions for estimated losses on uncompleted contracts are made in the period in which such losses are determined. This measurement and comparison process requires updates to the estimate of total costs to complete the contract, and these updates may include subjective assessments and judgments.\nTime and material price contracts\nRevenue from time and material price contracts is recognized based on costs incurred and projected markup on costs. Revenue from these contracts will vary based on actual labor, materials and overhead costs charged to the job and the negotiated billing rates. Contracts are initiated by customers or through bids if with a municipality. Any materials used and time spent within the shop on the job is assigned to the appropriate job and reconciliated monthly. Management bills the customer and records the revenue earned from contract. Depending on the contract terms, billings could be based on certain milestones stipulated in the contract. If this is the case, unbilled revenue is recorded at month end based on time and materials incurred and markup.\nPerformance Obligations\nGenerally, the Companys contracts contain one performance obligation. A performance obligation is a promise in a contract to transfer a distinct good or service to the customer and is the unit of account. The Companys performance of the contracts with customers typically provides a significant service of integrating a complex set of tasks and components into a single project or capability (even if that single project results in the delivery of multiple units), and as such, the entire contract and/or purchase order is accounted for as one performance obligation. The transaction price is allocated to the performance obligation and recognized as revenue when, or as, the performance obligation is satisfied with the continuous transfer of control to the customer.\nLess commonly, a contract may be considered to have multiple performance obligations even when they are part of a single contract. For contracts with multiple performance obligations, the Company allocates the transaction price to each performance obligation using the best estimate of the standalone selling price of each distinct good or service in the contract.\nThe Company recognizes revenue over time for the majority of the services it performs as (i) control continuously transfers to the customer as work progresses at a project location controlled by the customer and (ii) the Company has the right to bill the customer as costs are incurred.\nWarranties\nThe Company provides for the estimated cost of product warranties at the time revenue is recognized. While the Company engages in product quality programs and processes, including monitoring and evaluating the quality of its component suppliers, its warranty obligation is affected by product failure rates, material usage and service delivery costs incurred in correcting a product failure. Should actual product failure rates, material usage or service delivery costs differ from its estimates, revisions to the estimated warranty liability may be required.\nIncome Tax Provision\nThe Company accounts for income taxes under ASC 740-10, which requires recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns. Under this method, deferred tax assets and liabilities are based on the differences between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. Deferred tax assets are reduced by a valuation allowance to the extent management concludes it is more likely than not that the assets will not be realized. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the Consolidated Statements of Operations and Comprehensive Income in the period that includes the enactment date.\nThe estimated future tax effects of temporary differences between the tax basis of assets and liabilities are reported in the accompanying consolidated balance sheets, as well as tax credit carrybacks and carryforwards. The Company periodically reviews the recoverability of deferred tax assets recorded on its consolidated balance sheets and provides valuation allowances as management deems necessary.\nManagement makes judgments as to the interpretation of the tax laws that might be challenged upon an audit and cause changes to previous estimates of tax liability. In addition, the Company operates within multiple taxing jurisdictions including the United States, India, and The United Kingdom, and is subject to audit in these jurisdictions. In managements opinion, adequate provisions for income taxes have been made for all years. If actual taxable income by tax jurisdiction varies from estimates, additional allowances or reversals of reserves may be necessary.\nUncertain Tax Positions\nFor the years ended September 30, 2023, and 2022, the Company did not take any uncertain tax positions and had no adjustments to its income tax liabilities or benefits. The Company will record any interest and/or penalties arising from uncertain tax provisions when they are likely to occur and reasonably estimable.\nThe Company may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than fifty (50) percent likelihood of being realized upon ultimate settlement. The Company will accrue interest and penalties on income taxes when there is a likelihood that they will occur and can be reasonably estimated.\nAccounting for Share-Based Compensation\nThe Company follows ASC 718 (Share-Based Payment), which requires that all share-based payments to employees, including stock options, stock appreciation rights (SARs) and common stock share awards, be recognized as compensation expense in the consolidated financial statements based on their fair values and over the requisite service period.\nThe fair value for options granted was determined at the date of grant using a Black-Scholes valuation model and the straight-line attribution approach using the following weighted average assumptions: The risk-free interest rate used in the Black-Scholes valuation method is based on the implied yield currently available in U.S. Treasury securities at maturity with an equivalent term. Other than a one-time dividend paid in fiscal year 2017, the Company never declared or paid any cash dividends and does not currently expect to do so in the future. Expected volatility is based on the annualized daily historical volatility of the Companys stock over a representative period. The weighted-average expected life represents the period over which stock-based awards are expected to be outstanding and was determined based on a number of factors, including historical weighted average and projected holding periods for the remaining unexercised shares, the contractual terms of the Companys stock-based awards, vesting schedules and expectations of future employee behavior.\nNet Income (Loss) per Common Share\nBasic net income (loss) per common share is computed by dividing net income (loss) less the fair market value of dividends declared by the weighted average number of shares of common stock outstanding during the period. Diluted net income per common share is computed by dividing net income less the fair market value of dividends declared by the weighted average number of shares of common stock and potentially dilutive outstanding shares of common stock during the period to reflect the potential dilution that could occur from common shares issuable through contingent share arrangements, stock options and warrants. As of September 30, 2023, and 2022, the following items were excluded from the computation of diluted net loss per common share as their effect is anti-dilutive:\nSCHEDULE OF COMPUTATION OF DILUTED NET LOSS PER COMMON SHARE AS ANTI-DILUTIVE EFFECT\nFor the years ended\nSeptember 30,\nOptions 28,796 34,579\nFor the years ended September 30, 2023, and 2022 loss per share basic and diluted for continuing operations are calculated as follows;\nSCHEDULE OF LOSS PER SHARE BASIC AND DILUTED FOR CONTINUING OPERATIONS\nFor the years ended\nSeptember 30,\nLoss from Continuing operations $ (6,395,385 ) $ (10,617,735 )\nLess loss in noncontrolling interest (36,563 ) (271,284 )\nPreferred stock dividends 322,916 175,755\nNet loss applicable to common shareholders (6,681,738 ) (10,522,206 )\nWeighted Average Number of Shares-Basic & Diluted 870,121 709,488\nLoss per share - Basic & Diluted - Continuing Operations $ (7.68 ) $ (14.83 )\nForeign Currency Translation Gain and Comprehensive Income (Loss)\nIn countries in which the Company operates, and the functional currency is other than the U.S. dollar, assets and liabilities are translated using published exchange rates in effect at the consolidated balance sheet date. Revenues and expenses and cash flows are translated using an approximate weighted average exchange rate for the period. Resulting translation adjustments are recorded as a component of accumulated other comprehensive income on the accompanying consolidated balance sheet. For the years ending September 30, 2023, and September 30, 2022, comprehensive loss includes a gain of $699,181 and a loss of $518,927, respectively, which were entirely from foreign currency translation.\nAs of and for the year ended September 30, 2023, and 2022, the Company used the following exchange rates.\nSCHEDULE OF FOREIGN CURRENCY EXCHANGE RATE\nCurrency Exchange rate at September 30, 2022 Approximate weighted average exchange rate For the year ended September 30, 2022 Exchange rate at September 30, 2023 Approximate weighted average exchange rate For the year ended September 30, 2023\nIndian Rupee 0.012 0.013 0.012 0.012\nGreat Britain Pound 1.113 1.281 1.220 1.226\nReclassifications\nCertain reclassifications have been made to prior period amounts to conform to the current period presentation. This had no effect on the Companys statement of operations or retained earnings. The reclassifications center around the reclassification of the assets and liabilities of the Companys discontinued operations now under the headings Assets of discontinued operations and Liabilities of discontinued operations on the Companys Consolidated Balance Sheet and the operational results of the discontinued operations under the heading of Loss from discontinued operations, net of tax on the Companys Consolidated Statement of Operations.\nCorrection of an Immaterial Error in Previously Issued Financial Statements\nSubsequent to the issuance of our financial statements for the year ended September 30, 2022, an immaterial error was identified and has been corrected in our historical information related to the calculation of earnings per share. The original calculation did not take into account the fair value of the Series 1 Preferred Stock dividends declared during the period. Additionally, as discussed above the amount of earnings per share for discontinued operations was not presented.\nThe effects of the correction to the individual effected line items in our Consolidated Statement of Operations are as follows:\nSCHEDULE OF ERROR CORRECTIONS AND PRIOR PERIOD ADJUSTMENTS\nSeptember 30, 2022\nAs previously reported Corrections As corrected\nLoss per share - Basic & Diluted\nContinuing Operations $ (18.35 ) $ 3.52 $ (14.83 )\nDiscontinued Operations $ - $ (3.77 ) $ (3.77 )\nBusiness Combinations\nThe Company accounts for business combinations under Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 805 Business Combinations using the acquisition method of accounting, and accordingly, the assets and liabilities of the acquired business are recorded at their fair values at the date of acquisition. The excess of the purchase price over the estimated fair value is recorded as goodwill. All acquisition costs are expensed as incurred. Upon acquisition, the accounts and results of operations are consolidated as of and subsequent to the acquisition date.\nRecently Issued Accounting Pronouncements Not Yet Effective\nIn October 2021, the FASB issued ASU 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers (ASU No. 2021-08). ASU No. 2021-08 will require companies to apply the definition of a performance obligation under ASC Topic 606 to recognize and measure contract assets and contract liabilities (i.e., deferred revenue) relating to contracts with customers that are acquired in a business combination. Under current U.S. GAAP, an acquirer generally recognizes assets acquired and liabilities assumed in a business combination, including contract assets and contract liabilities arising from revenue contracts with customers, at fair value on the acquisition date. ASU No. 2021-08 will result in the acquirer recording acquired contract assets and liabilities on the same basis that would have been recorded by the acquiree before the acquisition under ASC Topic 606. ASU No. 2021-08 is effective for fiscal years beginning after December 15, 2022, with early adoption permitted. The Company has adopted this ASU as of October 1, 2022, and applied it to the Heisey Mechanical Ltd. acquisition.\nOn June 30, 2022, the FASB issued ASU 2022-03 Fair Value Measurement (Topic 820): Fair Value Measurement of Equity Securities Subject to Contractual Sale Restrictions (ASU 2022-03), which (1) clarifies the guidance in ASC 8202 on the fair value measurement of an equity security that is subject to a contractual sale restriction and (2) requires specific disclosures related to such an equity security. Under current guidance, stakeholders have observed diversity in practice related to whether contractual sale restrictions should be considered in the measurement of the fair value of equity securities that are subject to such restrictions. On the basis of interpretations of existing guidance and the current illustrative example in ASC 820-10-55-52 of a restriction on the sale of an equity instrument, some entities use a discount for contractual sale restrictions when measuring fair value, while others view the application of such a discount to be inconsistent with the principles of ASC 820. To reduce the diversity in practice and increase the comparability of reported financial information, ASU 2022-03 clarifies this guidance and amends the illustrative example. ASU No. 2022-03 is effective for fiscal years beginning after December 15, 2023, with early adoption permitted. The Company is currently evaluating the impact of this ASU on our financial statements.\nIn June 2016 the FASB issued ASU No. 2016-13. Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, which makes significant changes to the accounting for credit losses on financial assets and disclosures about them. The guidance applies to a wide variety of financial assets including trade receivables and contract assets and is effective for the Company for annual reporting periods beginning after December 15, 2022, and interim periods therein. The new guidance on the current expected credit loss (‘CECL) impairment model requires an estimate of expected credit losses, measured over the contractual life of an asset, that considers forecasts of future economic conditions in addition to information about past events and current conditions. It requires entities to consider the risk of loss even if it is remote, which may result in the recognition of credit losses on assets that do not have evidence of credit deterioration. The Company is currently evaluating the impact of this ASU on our financial statements.\nIn November 2023, the FASB issued ASU 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures (ASU 2023-07), which enhances the disclosures required for operating segments in the Companys annual and interim consolidated financial statements. ASU 2023-07 is effective for the Company for annual reporting for fiscal 2025 and for interim period reporting beginning in fiscal 2026 on a retrospective basis. Early adoption is permitted. The Company is currently evaluating the impact of our pending adoption of ASU 2023-07 on our consolidated financial statements.\nThe Company does not believe that any other recently issued but not yet effective accounting pronouncements, if adopted, would have a material effect on the accompanying consolidated financial statements.\nNOTE 3 - SEGMENT AND GEOGRAPHIC INFORMATION\nDuring the first quarter of fiscal year 2023, the Company reorganized its reporting segments to be in line with its current structure. The Company reports and evaluates financial information for three current segments: the Security segment, Industrial Services segment and the Corporate segment. The historical segment information has been recast to conform to the current segment structure. All intersegment transactions have been eliminated, values are presented net of eliminations.\nOperating segments\nThe Company determines its reporting units in accordance with the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 280, Segment Reporting. The Company evaluates a reporting unit by first identifying its operating segments under ASC 280. The Company operates as four operating segments which is reported in a manner consistent with the internal reporting provided to the chief operating decision-maker. The chief operating decision-maker is responsible for the allocation of resources and assessing the performance of the operating segment and has been identified as Saagar Govil, the CEO of the Company.\nSecurity\nCemtrexs Security segment operates under the Vicon brand that deliver cutting-edge software and hardware technologies:\nVicon Industries, a majority owned subsidiary, provides end-to-end security solutions to meet the toughest corporate, industrial and governmental security challenges. Vicons products include browser-based video monitoring systems and analytics-based recognition systems, cameras, servers, and access control systems for every aspect of security and surveillance in industrial and commercial facilities, federal prisons, hospitals, universities, schools, and federal and state government offices. Vicon provides cutting edge, mission critical security and video surveillance solutions utilizing Artificial Intelligence (AI) based data algorithms.\nIndustrial Services\nCemtrexs Industrial Services segment operates through the brand, Advanced Industrial Services (AIS), that offers single-source expertise and services for rigging, millwrighting, in plant maintenance, equipment erection, relocation, and disassembly to diversified customers. We install high precision equipment in a wide variety of industrial markets like automotive, printing and graphics, industrial automation, packaging, and chemicals among others. We are a leading provider of reliability-driven maintenance and contracting solutions for the machinery, packaging, printing, chemical, and other manufacturing markets. The focus is on customers seeking to achieve greater asset utilization and reliability to cut costs and increase production from existing assets, including small projects, sustaining capital, turnarounds, maintenance, specialty welding services, and high-quality scaffolding.\nThe following tables summarize the Companys segment information:\nSCHEDULE OF SEGMENT INFORMATION\nSecurity Industrial Services Corporate Consolidated Security Industrial Services Corporate Consolidated\nYear ended September 30, 2023 Year ended September 30, 2022\nSecurity Industrial Services Corporate Consolidated Security Industrial Services Corporate Consolidated\nRevenues $ 34,359,470 $ 25,009,092 $ - $ 59,368,562 $ 23,820,764 $ 21,206,016 $ - $ 45,026,780\nCost of revenues 17,253,170 16,429,566 - 33,682,736 13,597,060 14,863,792 - 28,460,852\nGross profit $ 17,106,300 $ 8,579,526 $ - $ 25,685,826 $ 10,223,704 $ 6,342,224 $ - $ 16,565,928\nOperating expenses\nSales, general, and administrative 14,422,950 4,755,998 3,724,317 22,903,265 12,150,249 5,008,695 4,023,513 21,182,457\nDepreciation and amortization 254,392 719,404 52,279 1,026,075 906,272 704,246 141,580 1,752,098\nGoodwill impairment - - - - 3,316,000 - - 3,316,000\nResearch and development 3,267,994 - - 3,267,994 4,444,488 - - 4,444,488\nOperating (loss)/income $ (839,036 ) $ 3,104,124 $ (3,776,596 ) $ (1,511,508 ) $ (10,593,305 ) $ 629,283 $ (4,165,093 ) $ (14,129,115 )\nOther income/(expense) $ 113,846 $ (166,369 ) $ (4,437,082 ) $ (4,489,605 ) $ 686,413 $ (181,160 ) $ 2,796,782 $ 3,302,035\nSeptember 30, September 30,\nIdentifiable Assets\nSecurity $ 21,829,183 $ 15,257,235\nIndustrial Services 23,781,349 16,658,984\nCorporate 2,843,211 9,869,716\nDiscontinued operations - 3,971,693\nTotal Assets $ 48,453,743 $ 45,757,628\nThe Company generates revenue from product sales and services from its subsidiaries located in the United States, The United Kingdom, and India. Revenue and long-lived asset information for the Company is as follows:\nSCHEDULE OF REVENUE FROM PRODUCT SALES AND SERVICES FROM ITS SUBSIDIARIES\nFor the year ended\nSeptember 30, September 30,\nRevenues\nUnited States $ 53,905,149 $ 40,977,549\nUnited Kingdom 3,301,682 3,989,223\nIndia 2,161,731 60,008\n$ 59,368,562 $ 45,026,780\nSeptember 30, September 30,\nLong-lived Assets\nUnited States $ 15,420,489 $ 11,118,962\nUnited Kingdom 328,819 397,968\nIndia 138,907 311,601\n$ 15,888,215 $ 11,828,531\nNOTE 4 - FAIR VALUE MEASUREMENTS\nFair value is defined as the price that would be received upon sale of an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. A three-level hierarchy is applied to prioritize the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to unobservable inputs (Level 3 measurements).\nThe three levels of the fair value hierarchy under the guidance for fair value measurements are described below:\nLevel 1 - Level 1 inputs are quoted prices (unadjusted) in active markets for identical assets or liabilities that the reporting entity has the ability to access at the measurement date. Our Level 1 assets include cash equivalents, bankers acceptances, trading securities investments and investment funds. The Company measures trading securities investments and investment funds at quoted market prices as they are traded in an active market with sufficient volume and frequency of transactions.\nLevel 2 - Level 2 inputs are inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly. If the asset or liability has a specified contractual term, a Level 2 input must be observable for substantially the full term of the asset or liability.\nLevel 3 - Level 3 inputs are unobservable inputs for the asset or liability in which there is little, if any, market activity for the asset or liability at the measurement date. Level 3 assets and liabilities include cost method investments, goodwill, intangible assets, and property, plant and equipment, which are measured at fair value using a discounted cash flow approach when they are impaired. Quantitative information for Level 3 assets and liabilities reviewed at each reporting period includes indicators of significant deterioration in the earnings performance, credit rating, asset quality, business prospects of the investee, and financial indicators of the investees ability to continue as a going concern.\nThe Companys fair value assets for the years ended September 30, 2023, and 2022, are as follows;\nSCHEDULE OF FAIR VALUE OF ASSETS\nQuoted Prices in Active Markets for Identical Assets Significant Other Observable Inputs Significant Unobservable Inputs Balance as of\nSeptember 30,\n(Level 1) (Level 2) (Level 3)\nAssets\nInvestment in marketable securities (included in short-term investments) $ 13,663 $ - $ - $ 13,663\n$ 13,663 $ - $ - $ 13,663\nQuoted Prices in Active Markets for Identical Assets Significant Other Observable Inputs Significant Unobservable Inputs Balance as of\nSeptember 30,\n(Level 1) (Level 2) (Level 3)\nAssets\nInvestment in marketable securities (included in short-term investments) $ 13,721 $ - $ - $ 13,721\n$ 13,721 $ - $ - $ 13,721\nNOTE 5 - RESTRICTED CASH\nA subsidiary of the Company participates in a consortium in order to self-insure group care coverage for its employees. The plan is administrated by Benecon Group and the Company makes monthly deposits in a trust account to cover medical claims and any administrative costs associated with the plan. These funds, as required by the plan are restricted in nature and amounted to $919,652 and $1,577,915 as of September 30, 2023, and 2022, respectively. Additionally, there was $100,000 of restricted cash in escrow per the purchase agreement with Heisey Mechanical, Ltd..\nNOTE 6 - TRADE RECEIVABLES, NET\nTrade receivables, net consists of the following:\nSCHEDULE OF TRADE RECEIVABLES, NET\nSeptember 30, September 30,\nSeptember 30,\nTrade receivables $ 9,444,619 $ 5,648,655\n$ 7,462,165\nAllowance for doubtful accounts (234,924 ) (249,439 )\n(182,242 )\nAccounts receivables, net, total $ 9,209,695 $ 5,399,216\n$ 6,458,984\nTrade receivables include amounts due for shipped products and services rendered.\nAllowance for doubtful accounts includes estimated losses resulting from the inability of our customers to make the required payments.\nNOTE 7 - PREPAID AND OTHER CURRENT ASSETS\nPrepaid and other current assets consist of the following;\nSUMMARY OF PREPAID AND OTHER CURRENT ASSETS\nSeptember 30,\nSeptember 30,\nPrepaid expenses $ 521,310 $ 536,820\nPrepaid inventory 1,084,051 220,553\nDeferred costs 25,941 40,626\nPrepaid income taxes 168,555 604,840\nVAT and GST tax receivable 298,502 236,986\nPrepaid expenses and other assets total $ 2,098,359 $ 1,639,825\nNOTE 8 - INVENTORY, NET\nInventory, net of reserves, consist of the following:\nSCHEDULE OF INVENTORY, NET\nSeptember 30, September 30,\nRaw materials $ 1,089,773 $ 1,375,933\nWork in progress 109,019 120,026\nFinished goods 8,158,448 8,080,235\nInventory, gross 9,357,240 9,576,194\nLess: Allowance for inventory obsolescence (618,021 ) (1,088,377 )\nInventory -net of allowance for inventory obsolescence $ 8,739,219 $ 8,487,817\nNOTE 9 - PROPERTY AND EQUIPMENT\nProperty and equipment are summarized as follows:\nSUMMARY OF PROPERTY AND EQUIPMENT\nSeptember 30, September 30,\nLand $ 945,279 $ 790,373\nBuilding and leasehold improvements 4,362,062 2,906,953\nFurniture and office equipment 579,700 546,548\nComputers and software 1,333,135 365,892\nMachinery and equipment 12,488,639 11,242,709\nProperty and equipment, gross 19,708,815 15,852,475\nLess: Accumulated depreciation (10,490,114 ) (10,572,033 )\nProperty and equipment, net $ 9,218,701 $ 5,280,442\nDepreciation and amortization of property and equipment totaled approximately $1,026,075 and $1,752,098 for fiscal years ended September 30, 2023, and 2022, respectively recorded as general and administrative expenses on the Companys consolidated statement of operations and comprehensive income/(loss).\nNOTE 10 - GOODWILL\nChanges in the carrying amount of goodwill, by segment, are as follows\nSCHEDULE OF GOODWILL BY SEGMENT\nSecurity Industrial Services Corporate Consolidated\nBalance at September 30, 2021 $ 3,846,475 $ 3,376,416 $ 598,391 $ 7,821,282\nImpairment losses (3,316,000 ) - - (3,316,000 )\nReclassified to assets held for sale - - (598,391 ) (598,391 )\nBalance at September 30, 2022 530,475 3,376,416 - 3,906,891\nAcquisitions\n475,000\n475,000\nBalance at September 30, 2023 530,475 3,851,416 - $ 4,381,891\nFor the year ended September 30, 2023, no impairment of the Companys goodwill was recorded and for the year ended September 30,2022, an impairment of the Companys goodwill of $3,316,000 was recorded.\nNOTE 11 - OTHER ASSETS\nOther assts consists of the following;\nSCHEDULE OF OTHER ASSETS\nSeptember 30, 2023 September 30, 2022\nRental deposits $ 198,641 $ 204,388\nInvestment in Masterpiece VR 1,100,000 1,000,000\nOther deposits 167,808 24,467\nDemonstration equipment supplied to resellers 369,560 170,890\nOther assets total $ 1,836,009 $ 1,399,745\nNOTE 12 - ACCRUED EXPENSES\nAccrued expenses consist of the following;\nSCHEDULE OF ACCRUED EXPENSES\nSeptember 30, 2023 September 30, 2022\nAccrued expenses $ 1,473,465 $ 1,308,171\nAccrued payroll 1,088,223 720,220\nAccrued warranty 222,702 222,702\nAccrued expenses total total $ 2,784,390 $ 2,251,093\nNOTE 13 - DEFERRED REVENUE\nThe Companys deferred revenue as of and for the years ended September 30, 2023, and 2022, are as follows;\nSCHEDULE OF DEFERRED REVENUE\nFor the year ended\nSeptember 30, 2023 September 30, 2022\nDeferred revenue at beginning of period $ 1,788,507 $ 1,336,817\nNet additions:\nDeferred software revenues 2,679,379 3,325,662\nRecognized as revenue:\nDeferred software revenues 2,156,552 2,873,972\nDeferred revenue at end of period 2,311,334 1,788,507\nLess: current portion 1,583,406 1,181,198\nLong-term deferred revenue at end of period $ 727,928 $ 607,309\nNOTE 14 - CONTRACT ASSETS AND LIABILITES\nProject contracts typically provide for a schedule of billings on percentage of completion of specific tasks inherent in the fulfillment of the Companys performance obligation(s). The schedules for such billings usually do not precisely match the schedule on which costs are incurred. As a result, contract revenue recognized in the statements of operations can and usually does differ from amounts that can be billed to the customer at any point during the contract. Amounts by which cumulative contract revenue recognized on a contract as of a given date exceeds cumulative billings and unbilled receivables to the customer under the contract are reflected as a current asset in the balance sheets under the caption Contract assets. Amounts by which cumulative billings to the customer under a contract as of a given date exceed cumulative contract revenue recognized are reflected as a current liability in the balance sheets under the caption Contract liabilities. Conditional retainage represents the portion of the contract price withheld until the work is substantially complete for assurance of the Companys obligations to complete the job.\nThe following is a summary of the Companys uncompleted contracts:\nSCHEDULE OF CONTRACT ASSETS AND LIABILITIES\nFor the year ended\nSeptember 30, 2023 September 30, 2022\nCosts incurred on uncompleted contracts $ 12,523,552 $ 2,152,087\nEstimated gross profit 3,085,350 851,469\nTotal 15,608,902 3,003,556\nApplicable billings to date (14,850,020 ) (2,591,627 )\nTotal $ 758,882 $ 411,929\nSeptember 30, 2023 September 30, 2022\nSeptember 30, 2021\nIncluded in the accompanying balance sheet under the following captions\nContract assets $ 1,739,201 $ 781,819\n$ 1,148,243\nContract liabilites (980,319 ) (369,890 )\n(986,399 )\nTotal $ 758,882 $ 411,929\n$ 161,844\nNOTE 15 - LEASES\nThe Company is party to contracts where we lease property from others under contracts classified as operating leases. The Company primarily leases office and operating facilities, vehicles, and office equipment. The weighted average remaining term of our operating leases was approximately 3 years at September 30, 2023, and 3 years at September 30, 2022. Lease liabilities were $2,348,689 with $741,487 classified as short-term at September 30, 2023, and $2,576,963 with $754,495, classified as short-term at September 30, 2022. The weighted average discount rate used to measure lease liabilities was approximately 5.66% at September 30, 2023, and 2022. The Company used the rate implicit in the lease, where known, or its incremental borrowing rate as the rate used to discount the future lease payments.\nThe Company also made the accounting policy decision not to recognize lease assets and liabilities for leases with a term of 12 months or less.\nThe Companys corporate segment leases approximately 100 square feet of office space in Brooklyn, NY on a month-to-month lease at a rent of $600 per month with $4,200 of expense for the year ended September 30, 2023 and approximately 911 square feet of office space in Clovis, CA on a month-to-month lease at a monthly rent of $4,930 with $5,550 of expense for the year ended September 30, 2023. The expense is under the caption General and administrative on the Companys Consolidated Statement of Operations.\nA reconciliation of undiscounted cash flows to operating lease liabilities recognized in the Consolidated Balance Sheet at September 30, 2023, is set forth below:\nSCHEDULE OF RECONCILIATION OF UNDISCOUNTED CASH FLOWS TO OPERATING LEASE LIABILITIES\nYears ending September 30, Operating Leases\n839,613\n818,948\n619,459\n270,742\n2028 & Thereafter 51,415\nUndiscounted lease payments 2,600,177\nAmount representing interest (251,488 )\nDiscounted lease payments $ 2,348,689\nLease costs for the years ended September 30, 2023, and 2022 are set forth below:\nSCHEDULE OF LEASE COSTS\nFor the year ended\nSeptember 30,\nOperating lease costs 828,048 682,584\nTotal lease cost $ 828,048 $ 682,584\nNOTE 16 - LINES OF CREDIT AND LONG-TERM LIABILITIES\nLines of credit\nOn January 12, 2023, the Company entered into a standstill agreement with Streeterville Capital, LLC. The lender has agreed to refrain and forbear temporarily from making redemptions under the notes for a period ending on April 12, 2023. In addition, the company has agreed to an increase of the outstanding balance of the note issued on September 30, 2021, for the original amount of $5,755,000 by $148,000, and the outstanding balance of the note issued on February 22, 2022, for the original amount of $9,205,000 by $303,422. The aggregate amount of $451,422 has been recorded as interest expense on the Companys Consolidated Statement of Operations and Consolidated Statements of Cash Flow.\nOn February 15, 2023, the Company and Fulton Bank agreed to an amendment to the Master Agreement Regarding Financial Covenants and Financial Deliverables dated September 22, 2020.\nOn March 3, 2023, the Company and NIL Funding agreed at an amendment to the term loan agreement dated September 18, 2018. This agreement amends the maturity date to December 31, 2024, and amends the interest rate to 11.5%. Additionally, the Company paid $10,000 in fees and made an additional principal payment of $100,000 on March 29, 2023, and is required to make another additional principal payment of $100,000 on or before March 29, 2024. The Company has accounted for this amendment as a debt modification.\nOn May 3, 2023, the Company and Streeterville Capital, LLC. agreed to an amendment to the note issued on September 30, 2021, for the original amount of $5,755,000. The agreement extends the maturity date to June 30, 2024, in exchange for a fee of 5% of the outstanding balance or approximately $252,912 added to the outstanding balance of the note. The Company has accounted for this amendment as a debt modification.\nOn April 3, 2023, the Company and SeKureID Solutions Corp., entered into a software license agreement, where the company obtained the right to use source code for its security products in exchange for $1,125,000 payable in (15) fifteen equal monthly installments of $75,000. The current balance of $675,000 is presented on the Consolidated Balance Sheets as of September 30, 2023, under Short-term liabilities, net of unamortized original issue discounts.\nOn July 1, 2023, as part of the Heisey acquisition, the Company issued a note payable to Heisey Mechanical, Ltd. In the amount of $240,000. This note carries interest of 6% and is payable one year from the date of the note. The current balance of $240,000 is presented on the Consolidated Balance Sheets as of September 30, 2023, under the caption Short-term liabilities, net of unamortized original issue discounts.\nOn July 1, 2023, as part of the Heisey acquisition, the Company acquired a loan from Fulton Bank in the amount of $2,160,000. The loan carries interest at the Secured Overnight Financing Rate (SOFR) plus 2.8% and matures on July 1, 2030.\nOn August 30, 2023, the Company acquired a mortgage in the amount of $1,200,000 from Fulton Bank to finance the purchase of the properties formerly owned by Heisey Mechanical Ltd. The mortgage carries interest at the Secured Overnight Financing Rate (SOFR) plus 2.8% and matures on September 30, 2043.\nSCHEDULE OF LINES OF CREDIT AND LIABILITIES\nInterest Rate Maturity September 30, 2023 September 30, 2022\nFulton Bank loan $5,250,000 for the purchase of AIS $5,000,000 of the proceeds went to the direct purchase of AIS. SOFR plus 2.37%(5.35% as of September 30, 2022) 12/15/2022 - 247,284\nFulton Bank loan $400,000 fund equipment for AIS. SOFR plus 2.37% ( 5.35% as of September 30, 2022) 5/1/2023 - 63,280\nFulton Bank - $360,000 fund equipment for AIS. The Company was in compliance with loan covenants as of June 30, 2023. This loan is secured by certain assets of the Company. SOFR plus 2.37% (7.68% as of September 30, 2023 and 5.35% as of September 30, 2022). 1/31/2025 108,700 183,839\nFulton Bank mortgage $2,476,000. The Company was in compliance with loan covenants as of September 30, 2023. This loan is secured by the underlying asset. SOFR plus 2.62% (7.93% on September 30, 2023 and 5.6% as of September 30, 2022). 1/28/2040 2,180,115 2,245,664\nFulton Bank (HEISEY) - mortgage loan; requires monthly principal and interest payments through August 1, 2043 with a final payment of remaining principal on September 1, 2043; The loan is collateralized by 615 Florence Street and 740 Barber Street. SOFR plus 2.80% per annum (8.11% as of September 30, 2023). 9/30/2043 1,200,000 -\nFulton Bank (HEISEY) - promissory note related to purchase of Heisey; requires 84 monthly principal and interest payments; The note is collateralized by all assets and guaranteed by the Parent; matures in 2030. SOFR plus 2.8% per annum (8.11% as of September 30, 2023) 7/1/2030 2,122,565 -\nNote payable - $439,774. For the purchase of VDI. Payable in two installments on October 26, 2021, and October 26, 2022. 5% 10/26/2022 - 219,370\nNote payable - $5,755,000 - Less original issue discount $750,000 and legal fees $5,000, net cash received $5,000,000 Unamortized original issue discount balance of $0 and $250,000, as of September 30, 2023 and September 30, 2022 respectively. 8% 6/30/2024 4,596,589 4,943,929\nNote payable - $9,205,000. Less original issue discount $1,200,000 and legal fees $5,000,net cash received $8,000,000. 28,572 shares of common stock valued at $700,400 recognized as additional original issue discount. Unamortized original issue discount balance of $0 and $1,064,778 as of September 30, 2023 and September 30, 2022 respectivly. 8% 8/23/2023 11,243,233 9,738,632\nNote Payable - $240,000 For the purchase of Heisey Mechanical, Ltd. 6% 7/1/2024 240,000 -\nTerm Loan Agreement with NIL Funding Corporation (NIL) - $5,600,000 The Company was in compliance with loan covenants as of September 30, 2023. 11.50% 12/31/2024 1,979,743 2,804,743\nPaycheck Protection Program loan - $121,400 - The issuing bank determined that this loan qualifies for loan forgiveness; however the Company is awaiting final approval from the Small Business Administration. 1% 5/5/2025 91,114 121,400\nSoftware License Agreement - $1,125,000, for the purchase of software source code for use in our Security segment products N/A 6/3/2024 675,000 -\nTotal lines of credit and secured liabilities\n$ 24,437,059 $ 20,568,141\nLess: Current maturities\n(14,507,711 ) (16,894,743 )\nLess: Unamortized original issue discount\n- (1,305,778 )\nLines of credit and secured liabilities, Long Term\n$ 9,929,348 $ 2,367,620\nEstimated maturities of the Companys long-term debt over the next 5 years are as follows:\nSCHEDULE OF ESTIMATED MATURITIES OF LONG TERM DEBT\n2027 Thereafter Total\nFulton Bank - $360,000 80,472 28,228 - - - - $ 108,700\nFulton Bank - $2.16 Mil 241,053 262,135 284,544 308,869 335,063 690,901 $ 2,122,565\nFulton Bank - Mortgage #1 66,931 73,009 85,701 92,430 100,563 1,761,481 $ 2,180,115\nFulton Bank - Mortgage #2 23,882 26,792 29,087 31,578 34,030 1,054,631 $ 1,200,000\nNIL Funding 1,300,000 679,743 - - - - $ 1,979,743\nPPP Loans 40,551 40,551 10,012 - - - $ 91,114\nNotes Payable 12,079,822 4,000,000 - - - - $ 16,079,822\nSoftware License Agreement 675,000 - - - - - $ 675,000\nTOTAL $ 14,507,711 $ 5,110,458 $ 409,344 $ 432,877 $ 469,656 $ 3,507,013 $ 24,437,059\nNOTE 17 - RELATED PARTY TRANSACTIONS\nAs of September 30, 2023, and September 30, 2022, there was $3,806 payable due to Ducon Technologies, Inc. and $19,133, respectively, payable due to Ducon Technologies, Inc., which is controlled by Aron Govil, the Companys Founder and Former Director and CFO. As of September 30, 2023, there were $637,208 of receivables due from Ducon Technologies, Inc. The Company has negotiated a payment agreement regarding past receivables and other liabilities due to Cemtrex, Inc. totaling $761,585. This agreement is in the form of a secured promissory note earning interest at a rate of 5% per annum and matures on July 31, 2024. Receivables of $708,512 representing the amount due from Ducon to Cemtrex Technologies Pvt. Ltd. the Companys subsidiary based in India has been written off in fiscal 2022 to bad debt and appears on the Companys consolidated statements of operations under general and administrative expenses.\nOn February 26, 2021, the Company entered into a Settlement Agreement and Release with Aron Govil regarding a dispute over an alleged misappropriation of funds.\nAs part of the Settlement Agreement, Mr. Govil was required to pay the Company consideration with a total value of $7,100,000 (the Settlement Amount) by entering into the Agreement. The Settlement Amount was satisfied in a combination of Mr. Govil forfeiting certain Preferred Stock and outstanding options and executing a secured note in the amount of $1,533,280. The Independent Board of Directors in coordination with Management concluded the settlement represented fair value.\nAs discussed above, Mr. Govil also executed a secured promissory note (the Note) in the amount of $1,533,280. The Note matures and is due in full in two years and bears interest at 9% per annum and is secured by all of Mr. Govils assets. Mr. Govil also agreed to sign an affidavit confessing judgment in the event of a default on the Note. While the Company believes the note is fully collectible, in accordance with ASC 450-30, Gain Contingencies, the Company determined the gain will not be recognized until the note is paid. Accordingly, the note and associated gain is not presented on the Companys Consolidated Balance Sheets and Consolidated Statements of Operations and Comprehensive Income/(Loss).\nOn November 22, 2022, the Company entered into two Asset Purchase Agreements and one Simple Agreement for Future Equity (SAFE) with the Companys CEO, Saagar Govil, to secure the sale of the subsidiaries Cemtrex Advanced Technologies, Inc, and Cemtrex XR, Inc., which include the brands SmartDesk, Cemtrex XR, Virtual Driver Interactive, Bravo Strong, and good tech (formerly Cemtrex Labs), to Mr. Govil (see NOTE 1).\nAs of September 30, 2023, there was $476,134 in trade receivables due from these companies and $64,703 in accounts payables. Of these receivables $132,102 are related to costs paid by Cemtrex related to payroll during the transition of employees to the new company and some subscription services that are set up on auto pay with a credit card. The remaining $344,032 is related to services provided by Cemtrex Technologies Pvt. Ltd. in the normal course of business. During Fiscal year 2023, the Company recognized $1,522,102 of revenue from these companies. During fiscal year 2023, $38,027 of trade receivables were reserved for by the Companys subsidiary Cemtrex Technologies Pvt. Ltd. Due to regulations by the Indian tax authority. The Company will keep this allowance in place but considers the debt to be collectable. These balances are presented on the Consolidated Balance Sheets under the captions Trade receivables - related party and Accounts payable - related party.\nAs of September 30, 2023, there were royalties receivable from the sale of Cemtrex, XR, Inc. of $704,893, $30,000 is considered short-term and reported under the caption Trade receivables - related party.\nNOTE 18 - STOCKHOLDERS EQUITY\nPreferred Stock\nThe Company is authorized to issue 10,000,000 shares of Preferred Stock, $0.001 par value. As of September 30, 2023, and September 30, 2022, there were 2,343,016 and 2,129,122 shares issued and 2,278,916 and 2,065,022 shares outstanding, respectively.\nSeries A Preferred stock\nEach issued and outstanding Series A Preferred Share shall be entitled to the number of votes per share equal to the result of: (i) the number of shares of common stock of the Company issued and outstanding at the time of such vote multiplied by 1.01; divided by (ii) the total number of Series A Preferred Shares issued and outstanding at the time of such vote, at each meeting of shareholders of the Company with respect to any and all matters presented to the shareholders of the Company for their action or consideration, including the election of directors. Holders of Series A Preferred Shares shall vote together with the holders of Common Shares as a single class.\nThe Series A Preferred Stock has no liquidation value or preference.\nThe Series A Preferred Stock has no redemption rights.\nAs of September 30, 2023, and September 30, 2022, there were no shares of Series A Preferred Stock issued and outstanding.\nSeries C Preferred Stock\nOn October 3, 2019, pursuant to Article IV of our Articles of Incorporation, our Board of Directors voted to designate a class of preferred stock entitled Series C Preferred Stock, consisting of up to one hundred thousand (100,000) shares, par value $0.001. Under the Certificate of Designation, holders of Series C Preferred Stock are entitled to the number of votes per share equal to the result of (i) the total number of shares of Common Stock outstanding at the time of such vote multiplied by 10.01, and divided by (ii) the total number of shares of Series C Preferred Stock outstanding at the time of such vote, at each meeting of our shareholders with respect to any and all matters presented to our shareholders for their action or consideration, including the election of directors.\nThe Series C Preferred Stock has no liquidation value or preference.\nThe Series C Preferred Stock has no redemption rights.\nAs of September 30, 2023, and September 30, 2022, there were 50,000 shares of Series C Preferred Stock issued and outstanding.\nSeries 1 Preferred Stock\nDividends\nHolders of the Series 1 Preferred will be entitled to receive cumulative cash dividends at the rate of 10% of the purchase price per year, payable semiannually on the last day of March and September in each year. Dividends may also be paid, at our option, in additional shares of Series 1 Preferred, valued at their liquidation preference. The Series 1 Preferred rank senior to the common stock with respect to dividends. Dividends will be entitled to be paid prior to any dividend to the holders of our common stock.\nLiquidation Preference\nThe Series 1 Preferred has a liquidation preference of $10 per share, equal to its purchase price. In the event of any liquidation, dissolution or winding up of our company, any amounts remaining available for distribution to stockholders after payment of all liabilities of our company will be distributed first to the holders of Series 1 Preferred, and then pari passu to the holders of the Series A preferred stock and our common stock. The holders of Series 1 Preferred have preference over the holders of our common stock on any liquidation, dissolution or winding up of our company. The holders of Series 1 Preferred also have preference over the holders of our Series A preferred stock.\nVoting Rights\nExcept as otherwise provided in the certificate of designation, preferences and rights or as required by law, the Series 1 Preferred will vote together with the shares of our common stock (and not as a separate class) at any annual or special meeting of stockholders. Except as required by law, each holder of shares of Series 1 Preferred will be entitled to two votes for each share of Series 1 Preferred held on the record date as though each share of Series 1 Preferred were 2 shares of our common stock. Holders of the Series 1 Preferred will vote as a class on any amendment altering or changing the powers, preferences or special rights of the Series 1 Preferred so as to affect them adversely.\nNo Conversion\nThe Series 1 Preferred will not be convertible into or exchangeable for shares of our common stock or any other security.\nRank\nThe Series 1 Preferred will rank with respect to distribution rights upon our liquidation, winding-up or dissolution and dividend rights, as applicable:\n● senior to our Series A preferred stock, common stock and any other class of capital stock we issue in the future unless the terms of that stock provide that it ranks senior to any or all of the Series 1 Preferred;\n● on a parity with any class of capital stock we issue in the future the terms of which provide that it will rank on a parity with any or all of the Series 1 Preferred;\n● junior to each class of capital stock issued in the future the terms of which expressly provide that such capital stock will rank senior to the Series 1 Preferred and the common stock; and\n● junior to all of our existing and future indebtedness.\nRedemption\nShares of Series 1 Preferred may be redeemed, in whole or in part, at the option of the Corporation, by the Corporation by giving notice of such redemption at any time. Notice of redemption may be given either by mailing notice to the holders of record or by public announcement, by press release or otherwise. If notice is given by public announcement, by press release or otherwise, such notice shall be effective as of the date of such announcement, regardless of whether notice is also mailed or otherwise given to holders of record. The redemption price for any shares of Series 1 Preferred to be redeemed (the Redemption Price) shall be payable in cash, out of funds legally available therefor, and shall be equal to the Preference Amount, plus any accrued but unpaid dividends. If fewer than all of the outstanding shares of Series 1 Preferred are to be redeemed at any time, the Corporation may choose to redeem shares proportionally from all holders or may choose the shares to be redeemed by lot or by any other equitable method.\nOn March 30, 2020, the Company amended the Certificate of Designation (the Amended Certificate of Designation) for our Series 1 Preferred Stock (the Series 1 Stock). The Amended Certificate of Designation increased the number of authorized preferred shares under the designation for our Series 1 Preferred Stock from 3,000,000 shares to 4,000,000 shares.\nDuring the year ended September 30, 2023, and 2022, 213,894 and 193,971 shares of Series 1 Preferred Stock were issued to pay dividends to holders of Series 1 Preferred Stock. respectively.\nAs of September 30, 2023, and September 30, 2022, there were 2,293,016 and 2,079,122 shares of Series 1 Preferred Stock issued and 2,228,916 and 2,015,022 shares outstanding, respectively. The Company currently holds 64,100 shares of Series 1 Stock in Treasury stock.\nOn July 29, 2022, the Company received a notification letter from the Listing Qualifications Department of The Nasdaq Stock Market LLC (Nasdaq) notifying the Company that, because the closing bid price for the Companys Series 1 preferred stock listed on Nasdaq was below $1.00 for 30 consecutive trading days, the Company no longer met the minimum bid price requirement for continued listing on The Nasdaq Capital Market under Nasdaq Marketplace Rule 5550(a)(2), requiring a minimum bid price of $1.00 per share (the Minimum Bid Price Requirement). On January 26, 2023, the Company received a notification letter from the Listing Qualifications Department of Nasdaq notifying the Company that, it had been granted an additional 180 days or until July 24, 2023, to regain compliance with the Minimum Bid Price Requirement based on the Company meeting the continued listing requirement for market value of publicly held shares and all other applicable requirements for initial listing on the Capital Market with the exception of the bid price requirement, and the Companys written notice of its intention to cure the deficiency during the second compliance period by effecting a reverse stock split, if necessary. On September 8, 2023, the Company received a letter from the Nasdaq Hearings Panel (Panel) informing the Company that the Panel has granted the Company a temporary exception to regain compliance with The Nasdaq Stock Market LLCs (Nasdaq or the Exchange) Listing Rule 5555(a)(1) (the Bid Price Rule) by no later than January 19, 2024. The Company has announced a special meeting of Series 1 Preferred stock shareholders scheduled for December 26, 2023, to approve the reverse stock split.\nOn August 22, 2023, the Board of Directors (the Board) of Cemtrex, Inc. authorized and approved a share repurchase program for up to 2,200,000 shares of the currently outstanding shares of the Companys Series 1 Preferred Stock over a period of 3 years, starting on September 1, 2023, and ending on August 31, 2026. Under the stock repurchase program, the Company intends to repurchase shares through open market purchases, privately negotiated transactions, block purchases or otherwise in accordance with applicable federal securities laws, including Rule 10b-18 of the Exchange Act.\nThe Board also authorized the Company to enter into written trading plans under Rule 10b5-1 of the Exchange Act. Adopting a trading plan that satisfies the conditions of Rule 10b5-1 allows a company to repurchase its shares at times when it might otherwise be prevented from doing so due to self-imposed trading blackout periods or pursuant to insider trading laws. Under any Rule 10b5-1 trading plan, the Companys third-party broker, subject to Securities and Exchange Commission regulations regarding certain price, market, volume and timing constraints, would have authority to purchase the Companys Series 1 Preferred Stock in accordance with the terms of the plan. The Company may from time to time enter into Rule 10b5-1 trading plans to facilitate the repurchase of its Series 1 Preferred Stock pursuant to its share repurchase program.\nThe Company cannot predict when or if it will repurchase any shares of Series 1 Preferred Stock as such stock repurchase program will depend on a number of factors, including constraints specified in any Rule 10b5-1 trading plans, price, general business and market conditions, and alternative investment opportunities.\nCommon Stock\nThe Company is authorized to issue 50,000,000 shares of common stock, $0.001 par value. As of September 30, 2023, there were 1,045,789 shares issued and outstanding and at September 30, 2022, there were 754,711 shares issued and outstanding.\nOn January 25, 2023, the Company completed a 35:1 reverse stock split on its common stock. All share and per share data have been retroactively adjusted for this reverse split. On February 2, 2023, 19,314 shares were issued for rounding shares of the reverse stock split.\nDuring the year ended September 30, 2023, 241,655 shares of the Companys common stock have been issued to satisfy $780,140 of notes payable, $769,860 in accrued interest, and $367873 of excess value of shares issued recorded as interest expense.\nDuring the year ended September 30, 2023, 30,103 shares of the Companys common stock have been issued in exchange for services valued at $215,800.\nNOTE 19 - SHARE-BASED COMPENSATION\nOn September 25, 2019, the Company cancelled all outstanding options granted to Saagar Govil, the Companys Chairman and CEO and granted a stock option for 11,429 shares. These options have an exercise price of $56.00 per share, which vested upon grant and they expire after seven years. Additionally, Mr. Govil was granted additional future options;\n(i) 2,868 shares of the Corporations common stock, CETX at an exercise price of $67.20 per share vesting on September 25, 2021;\n(ii) 2,858 shares of the Corporations common stock, CETX at an exercise price of $80.64 per share vesting on September 25, 2023; and\n(iii) 2,858 shares of the Corporations common stock, CETX at an exercise price of $96.77 per share vesting on September 25, 2025.\nOn April 28, 2022, the Company granted Brian Kwon, Manpreet Singh, Chris Wagner, and Metodi Filipov, all Directors of the Company, stock options for 2,931 shares each, 11,724 in the aggregate. These options have an exercise price of $13.65 per share, which vest over one year, and expire after five years. The options granted to Mr. Wagner were cancelled upon his resignation from the Board on November 8, 2022.\nThe following weighted-average assumptions were used to estimate the fair value of the common stock option liability for the options granted to Brian Kwon, Manpreet Singh, Chris Wagner, and Metodi Filipov;\nSCHEDULE OF FAIR VALUE STOCK OPTION WEIGHTED AVERAGE ASSUMPTIONS\nApril 28, 2022\nExpected term 5 Years\nRisk-free interest rate 2.92%\nExpected volatility 110.56%\nExpected dividend yield 0%\nDuring the years ended September 30, 2023, and 2022 the Company recognized $106,839 and $155,507 of share-based compensation expense on its outstanding options, respectively. The share-based compensation is listed under the caption General and administrative expenses on the Companys consolidated statement of operations.\nAs of September 30, 2023, there was $63,306 of total unrecognized compensation cost related to non-vested stock options, which is expected to be recognized over a weighted-average period of 2.25 years.\nSCHEDULE OF STOCK OPTIONS ACTIVITY\nNumber of Options Weighted Average Exercise Price Weighted Average Remaining Contractual Term (in years) Aggregate Intrinsic Value\nOutstanding at September 30, 2022 34,585 $ 46.90 3.25 $ -\nOptions granted - - - $ -\nOptions exercised - - -\nOptions forfeited - - -\nOptions cancelled (5,789 ) $ 27.13\n$ -\nOutstanding at September 30, 2023 28,796 $ 50.76 2.25 $ -\nVested and exercisable at September 30, 2022 27,843 $ 49.09\n$ -\nNOTE 20 - COMMITMENTS AND CONTINGENCIES\nThe Companys Industrial Services segment owns approximately (i) 25,000 square feet of warehouse space in Manchester, PA (ii) approximately 43,000 square feet of office and warehouse space in York, PA (iii) approximately 33,500 square feet of office and warehouse space and 0.71 acres of land in a non-contiguous lot utilized for outdoor storage space in Columbia, PA. The IS segment also leases approximately 15,500 square feet of warehouse space in Emigsville, PA from a third party in a three-year lease at a monthly rent of $5,099 expiring on August 31, 2025.\nThe Companys Security segment leases (i) approximately 6,700 square feet of office and warehouse space in Pune, India from a third party in an five year lease at a monthly rent of $6,453 (INR456,972) expiring on February 28, 2024, (ii) approximately 30,000 square feet of office and warehouse space in Hauppauge, NY from a third party in a seven-year lease at a monthly rent of $28,719 expiring on March 31, 2027, (iii) approximately 9,400 square feet of office and warehouse space in Hampshire, England in a fifteen-year lease with at a monthly rent of $7,329 (£5,771) which expires on March 24, 2031 and contains provisions to terminate in 2026, and (iv) approximately 911 square feet of office space in Clovis, CA on a month-to-month lease at a monthly rent of $4,930.\nNOTE 21 - INCOME TAXES\nThe Tax Cuts and Jobs Act (the Tax Act) was enacted on December 22, 2017. The Tax Act reduces the maximum U.S. federal corporate tax rate from 35% to 21%, allows net operating losses incurred in 2018 and beyond to be carried forward indefinitely, allows alternative minimum tax carryforwards to be partially refunded, beginning in 2018, and fully refunded by 2021, and creates new taxes on certain foreign sourced earnings.\nAt September 30, 2023, the Company had approximately $74,648,921 of federal and $51,175,344 of state net operating losses. The net operating loss carryforwards, if not utilized, will begin to expire in 2037 for federal purposes and in 2037 for state purposes. The company is currently reviewing net operating losses for Section 382 limitation purposes and will make any required adjustments to the net operating losses at the completion of the study.\nThe following is a geographical breakdown of loss before the provision for income taxes:\nSCHEDULE OF (LOSS) INCOME BEFORE PROVISION FOR TAX\nYear ended September 30,\nDomestic $ (6,279,077 ) $ (9,429,686 )\nForeign 277,964 (1,397,394 )\nLoss before provision for income taxes $ (6,001,113 ) $ (10,827,080 )\nThe provision for income taxes consisted of the following:\nSCHEDULE OF PROVISION FOR INCOME TAXES\nSeptember 30, 2023 September 30, 2022\nCurrent (benefit)/provision\nFederal $ - $ -\nState 319,427 (209,345 )\nForeign 74,845 -\nTotal current (benefit)/provision 394,272 (209,345 )\nDeferred provision\nFederal - -\nState - -\nForeign - -\nTotal deferred provision $ - $ -\nTotal (benefit)/provision for income taxes $ 394,272 $ (209,345 )\nEffective Income tax rate -6.57 % 1.93 %\nThe following is a reconciliation of the effective income tax rate to the federal and state statutory rates:\nSCHEDULE OF EFFECTIVE INCOME TAX RATE RECONCILIATION\nFor the Fiscal Year For the Fiscal Year\nEnded Ended\nSeptember 30, 2023 September 30, 2022\nU.S. statutory rate 21.00 % 21.00 %\nState taxes, net of federal -4.21 % 1.22 %\nForeign tax rate differential -0.45 % -1.04 %\nChange in valuation allowance -22.51 % -13.73 %\nReturn to provision 0.98 % 1.72 %\nGoodwill impairment 0.00 % -5.16 %\nSEC settlement payment 0.00 % -3.42 %\nPPP loan forgiveness 0.00 % 1.51 %\nGlobal intangible income -0.97 % 0.00 %\nPermanent differences -0.42 % -0.17 %\nEffective rate -6.57 % 1.93 %\nThe components of our deferred tax assets and liabilities are summarized as follows:\nSCHEDULE OF DEFERRED TAX ASSETS AND LIABILITIES\nSeptember 30, 2023 September 30, 2022\nDeferred Tax Assets:\nNet operating loss carryforwards $ 20,375,296 $ 18,563,887\nInventory 1,221,903 1,330,547\nAllowance for bad debt 32,633 8,304\nWarrants (interest expense) 4,193,177 2,975,593\nAccruals 293,956 289,426\nWarranty Reserve 476,045 27,764\nCapitalized research and development 27,359 -\nOther 6,927 5,847\nTotal gross deferred taxes 26,627,296 23,201,368\nValuation allowance (24,744,527 ) (20,895,094 )\nNet deferred tax assets 1,882,769 2,306,274\nDeferred Tax Liabilities:\nInventory and other Reserves (363,423 ) (490,967 )\nPrepaid expenses (127,852 ) (124,399 )\nGoodwill amortization (512,702 ) (525,898 )\nDepreciation (878,792 ) (1,165,010 )\nTotal deferred tax liabilities (1,882,769 ) (2,306,274 )\nTotal deferred tax assets (liabilities) $ - $ -\nManagement has concluded that it is more likely than not that the deferred tax assets will not be realized and has reduced the asset by a valuation allowance.\nNOTE 22 - DISCONTINUED OPERATIONS\nOn November 22, 2022, the Company entered into two Asset Purchase Agreements and one Simple Agreement for Future Equity (SAFE) with the Companys CEO, Saagar Govil, to secure the sale of the subsidiaries Cemtrex Advanced Technologies, Inc, which include the brand SmartDesk, and Cemtrex XR, Inc., which include the brands Cemtrex XR, Virtual Driver Interactive, Bravo Strong, and good tech (formerly Cemtrex Labs), to Mr. Govil\nDue to the on-going losses and risk associated with the SmartDesk business the Company has valued the royalty and SAFE agreement associated with the SmartDesk sale at $0 and considers such consideration to be a gain contingency.\nBased on sales projections for Cemtrex XR, Inc., the Company does not believe that it will exceed the sales levels required to exceed the $820,000 royalties due and has not accounted for any additional royalties at this time. In accordance with ASC 310 - Receivables, the Company has discounted the royalties due and during the nine-month ended September 30, 2023, has recognized $704,893 of royalties due and will amortize the remaining amount over the period the royalties are due.\nThe following table summarizes the loss on the sale recorded during fiscal year 2023, included in Income/(loss) from discontinued operations, net of tax in the accompanying condensed consolidated statement of Operations:\nSUMMARY OF LOSS ON SALE\nPurchase Price $ 745,621\nLess cash and cash equivalents transferred (699,423 )\nLess liabilities assumed (10,924 )\nNet purchase price $ 35,274\nAssets Sold\nAccounts receivable, net $ 625,638\nInventory, net 980,730\nPrepaid expenses and other assets 502,577\nProperty and equipment, net 837,808\nGoodwill 598,392\nTotal assets sold 3,545,145\nLiabilities Transferred\nAccounts payable 370,774\nShort-term liabilities 364,775\nLong-term liabilities 318,981\nTotal liabilities transferred 1,054,530\nNet assets sold $ 2,490,615\nPretax loss on sale of Cemtrex Advanced Technologies, Inc, and Cemtrex XR, Inc.Companies $ (2,455,341 )\nAssets and liabilities included within discontinued operations on the Companys Condensed Consolidated Balance Sheets at September 30, 2023, and September 30, 2022, are as follows;\nSCHEDULE OF FINANCIAL STATEMENTS INCLUDED WITHIN DISCONTINUED OPERATIONS\nSeptember 30, September 30,\nAssets\nCurrent assets\nCash and equivalents $ - $ 714,420\nTrade receivables, net - 561,470\nInventory -net of allowance for inventory obsolescence - 1,043,865\nPrepaid expenses and other assets - 153,461\nTotal current assets - 2,473,216\nProperty and equipment, net - 825,850\nOther - 672,627\nTotal Assets $ - $ 3,971,693\nLiabilities\nCurrent liabilities\nAccounts payable $ - $ 205,622\nShort-term liabilities - 464,429\nDeposits from customers - 125,032\nAccrued expenses - 10,136\nTotal current liabilities - 805,219\nLong-term liabilities\nDeferred revenue\n6,273\nTotal long-term liabilities - 6,273\nTotal liabilities $ - $ 811,492\nDuring the first quarter of fiscal 2023, Vicon completed the closure of its discontinued operating entity Vicon Systems, Ltd. located in Israel. The Company received funds related to benefit obligations of $96,095, which at the time of operational closure were not guaranteed to be retrievable. The company paid $7,010 in consulting fees for assistance in retrieving these funds. The net amount of $89,085 is recognized on the Companys Condensed Consolidated Income Statement as part of the Loss on Discontinued Operations.\nGain/(loss) from discontinued operations, net of tax and the loss on sale of discontinued operations, net of tax, of Cemtrex Advanced Technologies, Inc. and Cemtrex XR, Inc., sold during the first quarter of fiscal year 2023, which are presented in total as discontinued operations, net of tax in the Companys Condensed Consolidated Statements of Operations for the years ended September 30, 2023 and 2022, are as follows:\nYear ended September 30,\nTotal net sales $ 649,061 $ 5,248,143\nCost of sales 57,429 2,758,553\nOperating, selling, general and administrative expenses 1,104,506 5,228,836\nOther (income)/expenses 3,195 65,539\nIncome (loss) from discontinued operations (516,069 ) (2,673,707 )\nAmortization of discounted royalties 44,272 -\nLoss on sale of discontinued operations (2,455,341 ) -\nAdjustment of benefit obligation 89,085 -\nIncome tax provision -\nDiscontinued operations, net of tax $ (2,838,053 ) $ (2,674,507 )\nNOTE 23 - SUBSEQUENT EVENTS\nCemtrex has evaluated subsequent events up to the date the consolidated financial statements were issued. Centrex concluded that the following subsequent events have occurred and require recognition or disclosure in the consolidated financial statements.\nPreferred shares issued for dividend\nOn October 6, 2023, the Company issued 115,037 shares of its Series 1 Preferred Stock to for dividends. The dividend was paid to shareholders of record as of September 29, 2023.\nCommon shares issued subsequent to financial statements date\nOn December 13, 2023, 9,853 shares of common stock were issued to satisfy $40,000 of accounts payable for services related to a consulting agreement.\nStrategic Investment\nOn October 5, 2023, the Company made an additional $100,000 investment via a simple agreement for future equity (SAFE) in MasterpieceVR. The SAFE provides that the Company will automatically receive shares of the entity based on the conversion rate of future equity rounds up to a valuation cap, as defined.\nRevolving line of credit and payment of NIL funding term loan\nOn October 5, 2023, the Company obtained a revolving line of credit in the amount of $5 Million from Pathward, N.A.. The interest rate will be a rate which is equal to three percentage points (3%) in excess of that rate shown in the Wall Street Journal as the prime rate (the Effective Rate). The funds will be used to pay the NIL Funding term loan and to fund operations of the Vicon entity."
}