{
    "cik": "1435387",
    "company": "Discovery Energy Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-12-06",
    "period_of_report": "2022-02-28",
    "sic": "1382",
    "state_of_inc": "NV",
    "state_location": "TX",
    "fiscal_year_end": "0228",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1435387/0001493152-22-034621-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1435387/000149315222034621/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1435387/0001493152-22-034621.txt",
    "filename": "1435387_10K_2022_0001493152-22-034621.htm",
    "content": "Item 1. Business.\nGeneral\nDiscovery Energy Corp. (the Company) was incorporated under the laws of the state of Nevada on May 24, 2006 under the name Santos Resource Corp. The current business of the Company is the exploration and development of the 584,651 gross acres (914 sq. miles) area in South Australia (Prospect) held under Petroleum Exploration License PEL 512 (License). The Prospect is located in the Western Flank area, which is the southwest Permian edge of the Cooper and Eromanga Basins, the most prolific producing onshore region in Australia. There are three separate acreage blocks in the Prospect: West (~400,000 acres), South (~181,000 acres) and Lycium (~4,000 acres). In May 2012, the Company incorporated a wholly owned Australian subsidiary, Discovery Energy SA Ltd. (Subsidiary), for the purpose of acquiring a 100% working interest in the License. In May 2016, the Subsidiarys legal entity status changed from public to private and its name changed to Discovery Energy SA Pty Ltd. The Company is in the initial exploration phase of determining whether or not the Prospect contains economically recoverable volumes of crude oil, natural gas and/or natural gas liquids (collectively Hydrocarbons). Although the Companys current focus is primarily on the Prospect, management from time-to-time exchanges information with other industry participants regarding additional investment opportunities in Australia. The Companys internet address is https://discoveryenergy.com.\nOur Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to reports filed pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended, are available free of charge on our website as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission (the SEC). The SEC maintains an internet site that contains our public filings with the SEC and other information regarding the Company, at http://www.sec.gov.\nRecent Developments and Events\nThis section discusses developments and events during fiscal 2022 that are believed to be significant to the Company.\nSuspension and Modification of Work Commitment. On April 21, 2022, the Company received from the Government of South Australia, Department of Energy and Mining, confirmation that such agency had approved the Companys application for an additional six-month suspension of the work commitment relating to the License. The Company subsequently requested another suspension of the work commitment for a period of three months. On October 14, 2022, this suspension was approved. The Company requested a shorter extension as it believed that the requested amount of time was sufficient for the completion of work required for the third year of the work commitment. Neither the Company nor anyone else has any assurance that the length of this suspension will be sufficient. If it proves insufficient, the Company intends to request an additional suspension. While the Company has to date been successful in obtaining suspensions, it has no assurance that any further suspensions will be obtained. The deadlines for the Companys remaining work commitments are detailed in the section captioned Item 1. Business - Plan of Operation - Current Primary Activity below. In addition, the scope of the work commitments was modified. The modified requirements are also detailed in the aforementioned section.\nRussian-Ukrainian War. On February 24, 2022, Russian forces launched significant military actions against Ukraine. These actions have devastated large portions of Ukraine, have resulted in the imposition of significant sanctions on Russia, companies based in Russia, and certain members of its government and citizens, and have dramatically altered relationships between Russia (and, to some extent, its allies) and other countries. The on-going effects of this development are uncertain. One of the effects is that the price of oil immediately spiked after the Russian invasion. After this initial spike, the price trended downward toward the level before the invasion, but once testing the pre-invasion price level, the price became more volatile and has generally been significantly above pre-invasion levels. Nevertheless, other effects of an on-going war could be negative to the Company. The Company has no way to predict the progress or outcome of the situation in Ukraine, as the conflict and governmental reactions are rapidly changing and beyond our control. Prolonged unrest, intensified military activities or more extensive sanctions impacting the region could have a material adverse effect on the Companys financial condition, liquidity and business outlook.\nContinuing Increases in Hydrocarbons Prices. The price of Brent crude continued to increase over the course of fiscal 2022. At the start of fiscal 2022, the price of Brent crude was $66.74 per barrel. Such price was approximately $99 per barrel prior to the start of the Russian invasion of Ukraine, after which it temporarily spiked as discussed above. The price of Brent crude was approximately $85 per barrel near the time of the filing of this Report. Hydrocarbons are volatile and entail certain risks. See the risk factor captioned HYDROCARBONS ARE COMMODITIES SUBJECT TO PRICE VOLATILITY BASED ON MULTIPLE FACTORS OUTSIDE THE CONTROL OF PRODUCERS, AND LOW PRICES MAY MAKE PROPERTIES UNECONOMIC. The Company has no assurance that the price of Hydrocarbons will remain at adequate levels or that the Company will not be harmed by future prolonged low Hydrocarbon prices.\nOn-going Effects of Coronavirus Pandemic. The effects of the COVID-19 pandemic have largely abated. However, the continuing effects of this on-going event are uncertain. However, in the future, they could start worsening again in the U.S. and elsewhere, creating renewed uncertainty. The current COVID-19 pandemic could continue to, and future similar epidemics or pandemics could also, materially and adversely impact our ability to finance and conduct our business once it becomes operational, and could materially and adversely impact our operations, financial condition and results. See the risk factor captioned PANDEMICS OR DISEASE OUTBREAKS (SUCH AS THE NOVEL CORONAVIRUS, ALSO KNOWN AS THE COVID-19 VIRUS) COULD MATERIALLY AND ADVERSELY AFFECT US IN A VAREITY OF WAYS.\nHistorical Milestones\nTo date, the Company has achieved the following milestones:\n* On October 26, 2012, the License was granted to the Subsidiary. After the License grant, the Companys primary focus was on completing a financing to raise sufficient funds so that the Company could undertake a required proprietary seismic acquisition program. After exploring a number of possible financings, the precipitous decline in crude oil prices starting in the summer of 2014 delayed the Companys ability to successfully complete a financing of the type being sought.\n* The Company completed the Debentures and Warrant financing described in Item 1. Business - Recent Developments and Events - Extension of Debentures above. Among other uses, the proceeds from the Debentures enabled the Company to undertake required seismic work. For more information about the Debentures and the Warrants, see Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Capital Resources - Financing History and Immediate, Short-Term Capital Needs - Debentures Financing below.\n* On October 30, 2016, fieldwork was completed on the Companys proprietary Nike 3D seismic survey (the Nike Survey) covering an approximately 69 sq. mile (179 sq. km.) section of the western portion of the South Block of the Prospect and directly on trend and in close proximity to mature producing oilfields and recent discoveries on the blocks to the north. The Nike Survey was completed at a turnkey price of approximately $2.4 million.\n* The raw data from the Nike Survey was converted to analytical quality information, processed and interpreted by the Companys geophysical advisor. Interpretation of the processed data included advanced technical analysis by specialized consultants. This technical work identified an inventory of more than 30 leads judged to be potential areas of crude oil accumulations. The Company has prioritized these initial prospective locations for presentation to potential sources of significant capital. Technical analysis is on-going.\n* In June 2017, the Company completed the archeological and environmental field surveys of seven prospective drilling locations as required by applicable laws and regulations. It subsequently filed reports on these surveys with the South Australian government; no material issues were identified at any of the prospective drilling sites.\n* In addition to the amounts raised pursuant to the Debentures arrangements, since the Company adopted its current business plan, the Company has raised funds totaling approximately $4.6 million through private placements of the Companys common shares.\n* In several transactions to date, the Company (through the Subsidiary) purchased portions of an original 7.0% royalty interest relating to the Prospect retained by the party that, in effect, transferred and sold the License to the Company. As a result, the Company (through the Subsidiary) now owns an aggregate 5.0% royalty interest, while the previous holder of the original 7.0% royalty interest continues to hold a 2.0% royalty interest. The aggregate purchase price for the aggregate 5.0% royalty interest was $540,500 USD.\nProspect\nThere are producing wells on trend and directly north and east of the Companys South block. A typical Namur well, a primary producing reservoir in the Western Flank, is drilled to a depth of approximately 5,500 feet. The wellbore is vertical or near vertical and there is no lateral drilling or hydraulic stimulation required. This high-permeability reservoir combined with a strong aquifer system produces high flow and recovery rates. Initial production rates typically range from 450 to 950 barrels of oil per day (BOPD). Production is anticipated to be sweet, high gravity (45 degree) crude which is expected to result in premium pricing. As described in the section captioned Markets and Marketing below, markets for the Companys future production are readily accessible via existing infrastructure.\nBeginning in 2018, Beach Energy began implementing horizontal drilling techniques targeting the lower permeability McKinlay and Birkhead reservoirs in the Western Flank. Several wells, with lateral sections of approximately 2,000 feet, were successfully drilled and completed. Initial production rates ranged from 800 to 2,000 BOPD resulting in an average well productivity improvement of 8.2 times over vertical wells for 1.5 times the cost. Typically, the time and cost to drill a well decreases and production rates and economics improve as additional wells are drilled and the increase in knowledge and experience is incorporated into best practices.\nExploration Activity\nSince 2012, the Company has assembled a database that now includes a substantial inventory of data, analyses and technical information on the Cooper and Eromanga Basins, fields in the Western Flank, operators and operations, all in close proximity to the Prospect. In 2012, an engineering consultant was engaged to prepare an NI 51-101 compliant report which resulted in the identification of more than 110 seismic generated leads over approximately 30% of the Prospect. This was complimented by the reinterpretation of approximately 3,200 miles (5,153 km.) of 2D seismic data and the reprocessing and reinterpretation of approximately 55 sq. miles (141 sq. km.) of 3D seismic data from a survey conducted over the Lake Hope area in the eastern portion of the South block. The data described above was acquired in connection with the issuance of the License. In late 2016, the Company conducted the approximately $2.4 million Nike Survey covering an area of approximately 69 sq. miles (179 sq. km.) located in the western section of the South block and directly on trend and in close proximity to mature producing oil fields and recent discoveries on blocks to the north. The Company has also undertaken some work area clearance (WAC) surveys.\nTerms of the License\nIn 2012, the Subsidiary received a formal grant of the License from the South Australian Minister for Mineral Resources and Energy. The License is a Petroleum Exploration License (a PEL) granting the right to explore for all regulated resources (including petroleum and any other substance that naturally occurs in association with petroleum) relating to the Prospect, provided, however, that the License does not permit use of the Prospect as a source of geothermal energy or a natural reservoir for the purpose of gas storage.\nThe Company now holds a 100% working interest in the License, subject to a 10% overriding royalty interest in favor of the State of South Australia and an aggregate 3% overriding royalty interests in favor of others. In view of these overriding royalty interests, the Companys net revenue interest in the License is 87%\nThe License is subject to a five-year work commitment as described below. Failure to comply with the work program requirements could lead to the cancellation of the License. The License also requires that insurance of the types and amounts of coverage that management believes are reasonable, customary and the industry standard be maintained, and contains provisions regarding environmental matters and liabilities that management also believes are reasonable, customary and the industry standard.\nThe initial term of the License is five years, with two five-year renewal terms, subject to the provisions of the South Australian Petroleum and Geothermal Energy Act 2000. As discussed herein, the initial five-year term has been suspended a number of times; as a result, this initial term currently remains in effect. At the end of the initial five-year term of the License and assuming that the Company has met its obligations, the License can be renewed for a first five-year renewal term, provided, however, that the Company must relinquish one-third of its acreage or convert all or portions of it to a Petroleum Retention License (a PRL). At the end of the first five-year renewal term, assuming that the Company has met its commitment obligations, the License can be renewed for a second five-year renewal term, provided, however, that the Company must relinquish one-third of its original acreage or convert all or portions of the remaining acreage to a PRL. Relevant law requires the South Australian government to grant a PEL with respect to any acreage to be relinquished if the related licensee submits a reasonable application for renewal of the related license. Management believes that (as a matter of practice) the South Australian government almost invariably grants renewals, although the Company has no assurance that this will occur in its case. Any renewal could entail additional requirements, such as additional work commitments. Control over acreage can remain in effect indefinitely, so long as the licensee converts its license to a Petroleum Production License (a PPL) and is producing Hydrocarbons from the related acreage. A PPL has requirements somewhat different from a PEL, and the scope of the acreage in effect held by production is limited by applicable law.\nPlan of Operation\nCurrent Status\nThe Company is in the initial phase of its Plan of Operation. To date, field operations have been limited to the successful completion of seismic and related WAC surveys. Without drilling results, the Company does not have the necessary technical data to prepare estimates of Hydrocarbon reserves needed to prepare various reports for submission to regulators. The Company cannot provide assurance that it will find commercially producible volumes of Hydrocarbons.\nCurrent Primary Activities\nThe Companys current primary activity is to complete either a major financing or a major joint venture relationship, or both, so that it can execute the remaining work commitment described below, and develop the Prospect.\nThe License is subject to a five-year work commitment, which imposes certain financial obligations on the Company. In managements view, the geotechnical work completed in Years 1 and 2 of the commitment was sufficient to satisfy the License requirements for those two years. Required reports in connection with these activities were timely filed. To date, no comments from the government have been received, and management understands that the relevant government agency is required by law to furnish comments within 30 days after the reports are filed. Moreover, such agency has extended and modified the work commitment a number of times since the filing of the reports, and has been very accommodating with Company requests.\nOver the term of the License thus far, a number of extensions and modifications of the work commitment have been granted. The current remaining work commitment is as follows:\n* Year 3 ending January 28, 2023 - Shoot 3D seismic data totaling at a minimum approximately 135 sq. miles (350 sq. km.).\n* Year 4 ending January 29, 2024 - Drill three wells.\n* Year 5 ending January 28, 2025 - Drill four wells.\nAt the time of the Companys last extension of the work commitment, management believed that the work required for the third year of the work commitment could be completed by near the end of January 2023. However, for this to occur, the Company would need to raise a significant amount of funds in time so that the work could be timely completed. The Company is in advance negotiations to procure these funds. Moreover, the Company believes that it has an agreement as to the form of a services contract by which a service provider would complete the required work. Nevertheless, the Company will not be in a position to sign this contract until it has raised sufficient funds to make a required payment due on the signing of this contract. Neither the Company nor anyone else has any assurance that the Company will be able to raise sufficient funds timely so that a service provider can timely complete required work, or that (even if funds are timely raise) a service provider can timely complete required work. As a result, neither the Company nor anyone else has any assurance that the required work can be completed by the current end of the third year of the work commitment. If such work cannot be timely completed, the Company will seek another extension. While the Company has to date been successful in obtaining suspensions, it has no assurance that any further suspensions will be obtained. The failure to obtain the required extension will materially and adversely impact the Company. See the section captioned Liquidity and Capital Resources - Consequences of a Financing Failure below.\nThe Company needs a significant amount of additional capital to fulfill its obligations under the work commitment. Moreover, the Debentures will mature in December 2023, and the Company will need to raise additional funds or generate sufficient revenues through Hydrocarbon production to timely repay the Debentures, if they are not converted. The Companys capital requirements and financing activities are described in the section captioned Liquidity and Capital Requirements below. The success of the initial phase of the Plan of Operation depends upon the Companys ability to obtain additional capital or enter into a suitable joint venture arrangement in order to acquire additional seismic data and successfully drill commitment wells. Failure to obtain required additional capital or enter into a suitable joint venture arrangement will materially and adversely affect the Company and its stockholders in ways that are discussed in Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Capital Resources - Consequences of a Financing Failure below. The Company cannot provide assurance that it will obtain the necessary capital and/or enter into a suitable joint venture agreement.\nOnce the Company is in a position to commence drilling, it intends to engage the services of a third-party contractor. No significant impediments to procuring the services of one or more qualified contract operators and drillers in connection with the initial phase of the Companys Plan of Operation are anticipated. However, a considerable increase in drilling activity in the West Flank area could result in longer wait times and higher costs to obtain materials and services. The contract operator will be responsible for all regulatory compliance matters; hiring the drilling contractor, geologist and petroleum engineer to make final decisions relative to the zones to be targeted; well design; drilling and logging. Should wells comprising the Companys drilling operations be successful, the operator will then be responsible for completion operations, production facilities procurement, installation, operations and maintenance, interconnecting with gathering or transmission pipelines and attending to various administrative matters.\nThe Company initially plans to focus on oil-bearing formations, and thus crude oil is most likely to be the Companys principal product for the foreseeable future, if the Company is successful in its exploration and production activities. Natural gas is not expected to be a significant opportunity for the foreseeable future. The Company expects that most of its oil production will be transported through trucking operations owned by others.\nAny natural gas produced may (depending on the amount produced) be flared or transported through gathering systems and gas pipelines that are owned by others. Transportation capacity on gas gathering systems and pipelines is occasionally limited and at times unavailable due to repairs or improvements being made to the facilities or due to use by other gas shippers with priority transportation agreements or who own or control the relevant pipeline. The Company cannot accurately predict the costs of transporting its natural gas production until it drills, completes and tests its initial successful wells. The cost of installing infrastructure to deliver the Companys natural gas production to Moomba, which, as described below, is the principal transportation center for the area, or elsewhere will vary depending upon distance traversed, negotiated handling/treating fees, pipeline tariffs and other associated costs. Although issues pertaining to the Companys natural gas transportation could adversely affect the Company, the Company does not believe that this will be the case due to the minor role that any natural gas production is expected to play in the Companys business.\nMarkets and Marketing\nThe petroleum industry has been characterized historically by Hydrocarbon prices that fluctuate (sometimes dramatically), and supplier costs can rise significantly during industry booms. The most recent sustained price decline cycle started in early 2020 when the price of Brent crude had been traded in a range of approximately $65 to $70 per barrel. Such price declined to below $20 in late April 2020, at which time such price began a sustained increase that reached approximately $99 per barrel prior to the start of the Russian invasion of Ukraine on February 24, 2022, after which it temporarily spiked. After this initial spike, the price trended downward toward the level before the invasion, but once testing the pre-invasion price level, the price became more volatile and has generally been significantly above pre-invasion levels. The price of Brent crude was approximately $85 per barrel at the time of the filing of this Report. The Company has no assurance that the price of Hydrocarbons will recover to adequate levels or that the Company will not be harmed by prolonged low levels of Hydrocarbon prices. Hydrocarbon prices and markets are likely to remain volatile. Sales prices for these commodities are subject to wide fluctuations in response to relatively minor changes in supply and demand, market uncertainty, and a variety of additional factors beyond the Companys control. These factors include:\n* international political conditions (including embargoes, wars and civil unrest, such as the recent unrest in Ukraine and the Middle East);\n* the domestic and foreign supply of Hydrocarbons;\n* consumer demand;\n* weather conditions;\n* domestic and foreign governmental regulations and other actions;\n* actions taken by the Organization of the Petroleum Exporting Countries (OPEC) and the other 10 non-OPEC oil-exporting nations the so-called OPEC+;\n* technological advances affecting energy consumption;\n* technology and knowledge advances impact seismic, drilling, development and production;\n* the price and availability of alternative fuels;\n* epidemics, pandemics and government action that impedes the ability of companies to undertake their businesses; and\n* general economic conditions.\nDecreases in Hydrocarbon prices might not only decrease the Companys future revenues on a per unit basis, but could also reduce the volumes that the Company could produce economically. A sustained decline in sales prices could materially and adversely affect the Companys future business, financial condition, results of operations, liquidity and borrowing capacity, and may require a reduction in the carrying value of the Companys assets. While the Companys future revenues may increase if prevailing prices increase significantly, exploration and production costs and acquisition costs for additional properties and reserves could also increase. The Company might enter into hedging arrangements or use derivative financial instruments to hedge in whole or in part the risk associated with fluctuations in Hydrocarbon prices.\nThe Company does not expect to refine any of its production, although it may need to treat or process some of its production to meet the quality standards of purchasing or transportation companies. Therefore, the Company expects that all or nearly all of its production will be sold to a relatively small number of customers. Production from the Companys properties will be marketed in a manner consistent with industry practices. The Company does not currently have any long-term sales contracts for its future production, but it expects that it will generally sell any production that it develops pursuant to these types of contracts. The Company does not believe that it will have any difficulty in entering into long-term sales contracts for its production, although there can be no assurance in this regard.\nThe principal Hydrocarbon transportation hub for the Western Flank is located in the vicinity of Moomba. This processing and transportation center is approximately 37 miles due east of the Prospects easternmost boundary and about 40 miles from the Companys expected initial drill sites. These sites are located about 20 miles from a privately-owned terminal for trucking oil in Lycium. The Lycium Hub is also the terminal point for a main Trunk Line with a capacity of 20,000 barrels per day, which delivers oil to the Moomba Processing Facility. Management believes that the Company has access to infrastructure sufficient to transport its Hydrocarbon production to processing facilities or customer markets.\nThe availability of a ready market for the Companys production will depend on a number of factors beyond the Companys control, including the availability of other production in the Prospects vicinity, the proximity and capacity of Hydrocarbon pipelines, and fluctuations in supply and demand. Although the effect of these factors cannot be accurately predicted or anticipated, the Company does not anticipate any unusual difficulty in contracting to sell its production of Hydrocarbons to purchasers at prevailing market prices and under arrangements that are usual and customary in the industry. However, there can be no assurance that market, economic and regulatory factors will not in the future materially and adversely affect the Companys ability to sell its production.\nSales prices for Hydrocarbon production are negotiated based on factors normally considered in the industry, such as the reported trading prices for Hydrocarbons on local or international commodity exchanges, distance from wells to pipelines, well pressure, estimated reserves, commodity quality and prevailing supply conditions. Historically, Hydrocarbon sales prices have experienced high volatility resulting from changing perceptions throughout the industry centered on supply and demand. The Company cannot predict the occurrence of events that may affect sales prices or the degree to which such prices will be affected. However, sales prices realized by the Company should be equivalent to the then current market prices in the geographic region of the Prospect. Typically, crude oil prices in Australia reflect or are benchmarked against European commodity market trading settlement prices, mainly Brent Crude.\nThe Company will strive to obtain the best sales prices in the area of its production. The Companys revenues, profitability and future growth will depend substantially on prevailing prices. Decreases in the sales prices would likely adversely affect the carrying value of any proved reserves the Company is successful in establishing and its prospects, revenues, profitability and cash flow.\nCompetition\nThe Company expects to operate in the highly competitive industry of Hydrocarbon exploration, development and production. The Company believes that the level of competition in these areas will continue and may even intensify. In the areas of Hydrocarbon exploration, development and production, competitive advantage is gained through superior capital investment decisions, technological innovation and cost management. The Companys competitors include major firms and a large number of independent companies. Because the Company expects to have control over acreage sufficient for its exploration and production efforts for the foreseeable future, the Company does not expect to compete for the acquisitions of properties for the exploration for Hydrocarbons. However, the Company will compete for the equipment, services and labor required to explore for, develop and produce its properties and to transport its production. Many of the Companys competitors have substantially larger operating staffs and greater financial and other resources. In addition, larger competitors may be able to absorb the burden of any changes in laws and regulations more easily than the Company can, which would adversely affect its competitive position. Moreover, most of the Companys competitors have been operating in the Western Flank for longer periods than the Company has and they have demonstrated the ability to operate through a number of industry cycles. The impact of this intense competition cannot currently be determined.\nRegulation\nThe Companys operations in South Australia and within the Western Flank are subject to the laws and regulations of the State of South Australia and the Commonwealth of Australia. The License was granted under the Petroleum and Geothermal Energy Act 2000 (SA) and the Companys operations within and with respect to the License are governed by this Act and by the Petroleum and Geothermal Energy Regulations 2013 (SA). This legislation covers all phases of the Companys operations including exploration, appraisal, development and production of Hydrocarbons from the License area. Other legislation which the Company will be required to comply with at various stages of its operations include: Environment Protection Act 1993 (SA); Aboriginal Heritage Act 1988 (SA); Native Title Act 1994 (SA) and Native Title Act 1993 (Cth). As its Hydrocarbon exploration and production operations in South Australia proceed, the Company will provide more detailed information regarding the material features and effects of these laws and regulations and such other legislation with which the Company will be required to comply.\nEmployees\nAs of the date of this Report, the Company had three full-time employees. The Company continues to use a number of consultants and part-time service providers in the past, including members of the Companys current management team. The Companys needs for additional personnel in the future are uncertain. Item 1A. Risk Factors.\nAn investment in our common shares is highly speculative and involves a high degree of risk. You should carefully consider all of the risks discussed below, as well as the other information contained in this Annual Report. If any of the following risks develop into actual events, our business, financial condition or results of operations could be materially and adversely affected and the trading price of our common shares could decline.\nRISKS RELATING TO OUR COMPANY\nWE ARE AN EARLY-STAGE COMPANY WITH NO PROVED RESERVES, AND WE HAVE A NUMBER OF IMPORTANT MILESTONES THAT WE MUST ACHIEVE.\nOur business plan is to explore, develop and produce crude oil, natural gas and/or natural gas liquid (collectively Hydrocarbons) from a tract of land (the Prospect) covered by Petroleum Exploration License (PEL) 512 (the License) in the State of South Australia. The Prospect is considered undeveloped acreage, which the U.S. Securities and Exchange Commission (the Commission) defines as lease acreage on which wells have not been drilled or completed to a point that would permit the production of commercial quantities of Hydrocarbons regardless of whether such acreage contains proved reserves. We have no proved reserves. In view of our extremely limited history in the Hydrocarbon exploration business, an investor may have difficulty in evaluating us and our business, both current and future activities. An investor must consider our business and prospects in light of the risks, expenses and difficulties frequently encountered by companies in their early stage of development. For our business plan to succeed, we must successfully undertake most of the following activities:\n* Complete a material financing or similar transaction that will provide us with sufficient funds;\n* Drill successful exploratory test wells on the Prospect to determine the presence of Hydrocarbons in commercially viable quantities;\n* Develop the Prospect to a stage at which Hydrocarbons are being produced in commercially viable quantities;\n* Contract with purchasers of our commercial production of Hydrocarbons upon such commencement; and\n* Identify and enter into binding agreements with suitable third parties (such as joint venture partners and contractors) for the Prospect.\nThere can be no assurance that we will be successful in undertaking such activities. Our failure to undertake successfully most of the activities described above could materially and adversely affect our business, financial condition and results of operations.\nWE HAVE A HISTORY OF LOSSES, AND WE MAY NOT BECOME PROFITABLE.\nWe have incurred losses since our inception. For our fiscal year ended February 28, 2022, we incurred net losses of $2,335,117. As of February 28, 2022, we had an accumulated deficit of $33,996,855. We expect our losses to continue as we incur significant capital expenditures and operating expenses to explore for Hydrocarbons on the Prospect. These continuing losses will most likely be greater than current levels. If our revenues do not increase substantially or if our expenses exceed our expectations, we may never become profitable. There can be no assurance that our exploration and production activities will produce Hydrocarbons in commercially viable quantities, if any at all. Moreover, even if we succeed in producing Hydrocarbons, we expect to incur operating losses until such time (if ever) as we produce and sell a sufficient volume of our commercial production to cover direct production costs as well as corporate overhead. There can be no assurance that sales of our Hydrocarbon production will ever generate significant revenues, that we will ever generate positive cash flow from our operations or that (if ever attained) we will be able to sustain profitability in any future period.\nWE ARE SIGNIFICANTLY LEVERAGED.\nDuring a two-year period beginning in May 2016, we took on a significant amount of debt through the sale of Senior Secured Convertible Debentures due (each [including an additional such debenture issued in November 2021] a Debenture and collectively the Debentures). After such two-year period, we placed a small number of additional Debentures. The amount of the indebtedness represented by outstanding Debentures (including principal and accrued interest) was approximately $11 million compounded through September 30, 2022. Our Debentures are secured by all of our assets owned directly or indirectly but for the License. The use of secured indebtedness to finance our business is referred to as leveraging. Leveraging increases the risk of loss to us if and to the extent we have insufficient revenue to pay our debt obligations. In such event, cash from other sources will be required. Our Debentures must be repaid or converted by the holders thereof on or before December 31, 2023. Unless we generate such cash, we may not have sufficient funds to pay our Debentures and other indebtedness when due. In such event, we might be required to sell our assets and properties to meet our obligations, or to seek an extension to our Debentures, or alternative debt or equity financing. If sale, extension or refinancing is not obtained or consummated, we could default in our obligations.\nTHE EXERCISE OF SECURED CREDITOR RIGHTS COULD RESULT IN A SIGNIFICANT OR COMPLETE LOSS.\nIf we default on our Debentures, the remedy of our Debentures holders would be (among other things) to institute proceedings against our assets and properties to sell them to satisfy the amounts owed pursuant to our Debentures. This could result in the partial or total loss of our assets and properties. We have no assurance that, upon the exercise of our Debentures holders secured creditor rights, we would receive a return of anything on our assets and properties. The loss of our assets and properties by the exercise of our Debentures holders secured creditor rights would most likely materially and adversely affect our business, financial condition or assets, and could result in a total loss to our stockholders.\nOUR DEBENTURES FEATURE CERTAIN OPERATING COVENANTS THAT COULD ADVERSELY AFFECT THE COMPANY.\nOur Debentures contain operating covenants that prohibit us from certain actions (negative operating covenants) and that require us to continually undertake other actions (affirmative operating covenants). The negative operating covenants could preclude us from taking actions that we believe to be in the best interests of our stockholders. The affirmative operating covenants will require us to incur continuing costs and expense and could require us to take actions that we believe are not in our best interests. Moreover, our failure to comply with either negative operating covenants or affirmative operating covenants would most likely be a default under our Debentures, giving to our Debentures holders the rights described above.\nPandemics or disease outbreaks (such as the novel coronavirus, also known as the COVID-19 virus) could materially AND adversely affect us in a vareity of ways.\nPandemics or disease outbreaks such as COVID-19 could materially and adversely affect us in a number of ways. First, the current pandemic resulted, and future pandemics and epidemics could result, in economic downturns that could affect the market for our proposed products. Transport restrictions related to quarantines or travel bans, or simply declines in customers desire and willingness to travel, due to pandemics and epidemics have caused, and can be expected to cause when they occur in the future, significant declines in demand for products derived from crude oil, such as gasoline and jet fuel. Such declines greatly reduce not only the amount of products that can be sold on an aggregate basis, but also the price received for such products. Such results can be expected to have the following effects:\n* harm our financial results (especially revenues and profits) if and when we enter into commercial production.\n* harm our ability to raise funds (if needed) due to a diminished interest in investing in Hydrocarbon exploration and production companies in general.\n* depress our stock price, further harming our ability to raise funds.\nWorkforce limitations and travel restrictions resulting from pandemics or disease outbreaks and related government actions may impact many aspects of our business. We could experience interruptions or delays in receiving supplies of products and services from third parties due to staffing shortages, production slowdowns or stoppages, disruptions in delivery systems, travel limitations, mass transit disruptions, and the like. If a significant percentage of persons provided employment and other contractual services to us were unable to work, including because of illness or travel or government restrictions in connection with pandemics or disease outbreaks, our operations could be materially and adversely impacted.\nMoreover, the spread of pandemics or disease outbreaks such as the COVID-19 virus may also disrupt logistics necessary to import, export, and deliver products to us or our customers. Ports and other channels of entry may be closed or operate at only a portion of capacity, as workers may be prohibited or otherwise unable to report to work, and means of transporting products within regions or countries may be limited for the same reason.\nCurrently, uncertainty continues to exist relating to the potential effect of COVID-19 on our business. Infections may become more widespread again, exacerbating an already challenging environment. The extent to which any pandemic or epidemic impacts our business will depend on future developments, which are highly uncertain and cannot be predicted with confidence, such as the ultimate geographic spread of the disease, the duration of the outbreak, travel restrictions and actions to contain the outbreak or treat its impact, such as social distancing and quarantines or lock-downs in the United States and other countries, business closures or business disruptions and the effectiveness of actions taken in the United States and other countries to contain and treat the disease.\nAlso, the current pandemic, and future pandemics and epidemics could hamper our efforts to provide our investors with timely information and comply with our filing obligations with the Commission. Of major concern is loss of key staff and/or service providers due to life threatening health issues.\nOUR OUTSTANDING OBLIGATIONS AND ABILITY TO ISSUE ADDITIONAL COMMON SHARES COULD RESULT IN SIGNIFICANT DILUTION TO STOCKHOLDERS.\nOur Debentures outstanding as of September 30, 2022 are convertible into 67,640,717 common shares, and the number of shares into which these Debentures may be converted is expected to increase in the future. An aggregate of 27,877,058 common shares can be acquired upon the exercise of the outstanding Warrants. The conversion price of our Debentures and the exercise price of the Warrants may be less than the then current market price of the common shares at the time of conversion and exercise. Future issuance of additional shares pursuant to the Debentures, Warrants or otherwise could cause immediate and substantial dilution to the net tangible book value of common shares issued and outstanding immediately before such transactions. Any future decrease in the net tangible book value of such issued and outstanding shares could materially and adversely affect the market value of the common shares. Moreover, any common shares issued as described above would further dilute the percentage ownership of existing stockholders. The terms on which we could obtain additional capital while our Debentures or the Warrants are outstanding may be adversely affected because of the potential dilution described in this risk factor.\nWE NEED ADDITIONAL CAPITAL TO SATISFY OUR WORK COMMITMENT, TO PROVIDE WORKING CAPITAL AND TO DEVELOP THE PROSPECT, WHICH CAPITAL WE MAY NOT BE ABLE TO RAISE OR WHICH MAY BE AVAILABLE ONLY ON TERMS UNFAVORABLE TO US.\nWe have a work commitment with respect to the Prospect requiring us to expend significant stipulated amounts. We will need additional funds to satisfy the remainder of the work commitment, which includes the actual drilling of wells. Moreover, we will need working capital and further funds to explore and develop the Prospect in the manner that we prefer.\nWe are actively engaged in efforts to complete a capital raising transaction sufficient for us to complete the third year of the work commitment and provide additional funds to cover general and administrative costs. In the past, we have used the services of firms that specialize in capital procurement, but we are currently pursuing our own capital raising initiatives. If funds are not procured pursuant to this arrangement, we will be constrained to seek alternative financing. We have no assurance that we will be successful in completing a transaction that will provide us with required funds. Our failure to honor our work commitment could result in our loss of the Prospect. Moreover, our failure to procure funds needed to develop operations sufficient to generate enough cash to retire our Debentures as they become due could result in Debentures holders eventual exercise of the rights of a secured creditor and the possible loss of all or a large part of our assets. If either of the preceding events were to occur, we could be forced to cease our current business plan, which could result in a complete loss to our stockholders. Our future liquidity will depend upon numerous factors, including the success of our business efforts and our capital raising activities. If we obtain funds through the issuance of equity securities, the following results will or may occur:\n* the percentage ownership of our existing stockholders will be reduced.\n* the new equity securities could have rights, preferences or privileges senior to those of the holders of our common shares.\nWe have no assurance of our ability to raise funds for any purpose.\nTHERE IS SUBSTANTIAL DOUBT AS TO WHETHER WE WILL CONTINUE OPERATIONS WITHOUT ADDITIONAL FINANCING.\nBased on our assessment of the related risk factors (described further below), we believe there is substantial doubt about our ability to continue to operate as a going concern for the 12 months following the issuance of our February 28, 2022 financial statements. Our independent registered public accountant has added an emphasis paragraph to its report on our financial statements for the year ended February 28, 2022 regarding our ability to continue as a going concern. Key to this determination is our lack of any historical revenues and our accumulated deficit of $33,996,855 since inception through February 28, 2022. Since May 2016, we have placed Debentures having an aggregate original principal amount of $7,025,000. Proceeds from these placements largely financed our business for our fiscal years 2017 and 2018, and the first half of our fiscal year 2019. Since that time, we have financed our business primarily through private common shares financings, although we have also placed a small number of additional Debentures. Notwithstanding the preceding, we still need additional funds. There can be no assurance that we will be successful in securing funding, becoming profitable, or continuing our business without either a temporary interruption or a permanent cessation.\nIF WE GROW OUR BUSINESS AS PLANNED, WE MAY NOT BE ABLE TO MANAGE PROPERLY OUR GROWTH, AND WE EXPECT OPERATING EXPENSES TO INCREASE, WHICH MAY IMPEDE OUR ABILITY TO ACHIEVE PROFITABILITY.\nIf we are successful in growing our business as we plan, our operations may expand rapidly and significantly. Any rapid growth could place a significant strain on our management, operational and financial resources. In order to manage the growth of our operations, we will be required to improve and expand existing operations; to implement new operational, financial and inventory systems, procedures and controls, including improvement of our financial and other internal management systems; and to train, manage and expand our staffing. If we are unable to manage growth effectively, our business, results of operations and financial condition will be materially and adversely affected. In addition, if we are successful in growing our business as we plan, we expect operating expenses to increase, and as a result, we will need to generate increased revenue to achieve and maintain profitability. These additional costs and expenses could delay our ability to achieve continuing profitability.\nCONDUCTING BUSINESS INTERNATIONALLY MAY RESULT IN INCREASED COSTS AND OTHER RISKS.\nWe plan on operating our business in Australia. Operating internationally exposes us to a number of risks. Examples include a possible downturn in local economic conditions due to local policy decisions, increases in duties and taxes, and other adverse changes in laws, regulations and policies affecting our business, or governing the operations of foreign based companies. Additional risks include currency fluctuations, interest rate movements, imposition of trade barriers, and restrictions on repatriation of earnings. If we are unable to address these risks adequately, our financial position and results of operations could be adversely affected.\nRISKS RELATING TO OUR INDUSTRY\nOIL AND NATURAL GAS EXPLORATION AND PRODUCTION PRESENT MANY RISKS THAT ARE DIFFICULT TO MANAGE.\nOur Hydrocarbon exploration, development and production activities are subject to many risks that may be unpredictable and are difficult to manage. In addition, the cost and timing of drilling, completing and operating wells is often uncertain. In conducting exploration and development activities, the presence of unanticipated pressure or irregularities in formations, miscalculations or accidents may cause exploration, development and production activities to be delayed or unsuccessful. This could result in a total loss of our investment in a particular drilling program. If exploration efforts are unsuccessful in establishing proved reserves in a timely manner and exploration activities cease, the amounts accumulated as unproved costs will be charged against earnings as impairments.\nOUR FOCUS ON EXPLORATION ACTIVITIES EXPOSES US TO GREATER RISKS THAN ARE GENERALLY ENCOUNTERED IN LATER-STAGE HYDROCARBON PROPERTY DEVELOPMENT BUSINESSES.\nIf we are funded, most of our initial activity will involve drilling exploratory test wells on acreage with no proved Hydrocarbon reserves. While all drilling (whether developmental or exploratory) involves risks, exploratory drilling involves greater risks of dry holes or failure to find commercial quantities of Hydrocarbons. The economic success of any drilling program will depend on numerous factors, including the ability to estimate the volumes of recoverable reserves relating to the drilling program, rates of future production, future commodity prices, investment and operating costs and possible environmental liabilities. All of these factors may impact whether a drilling program will generate cash flows sufficient to provide a suitable return on investment. If we experience a series of failed drilling projects, our business, results of operations and financial condition could be materially and adversely affected.\nCERTAIN CURRENT TRENDS COULD MATERIALLY ADVERSELY AFFECT US AND OUR INDUSTRY.\nWorldwide concern over the risks of climate change is growing. This has led to the following developments and could lead to further movement in the following directions:\n* Laws are being adopted or considered to reduce greenhouse gas emissions, conserve fuel, use fewer Hydrocarbons, and utilize more alternative energy sources. These laws include cap and trade regimes, carbon taxes, trade tariffs, minimum renewable usage requirements, restrictive permitting, increased efficiency standards, and incentives or mandates for alternative or renewable energy. Government and other activist persons are also seeking to promote their climate change agendas indirectly, such as by seeking to reduce the availability of or increase the cost for, financing and investment in our industry and taking actions intended to promote changes in business strategy for companies in this industry.\n* Consumer sentiment appears to be shifting against fuel sources that leave a large carbon footprint (such as Hydrocarbons) and in favor of products that use alternative energy sources. As an example, sales of electric vehicles increased rapidly for most of the second decade of the 21st century, and this could continue into the future. Investors (including sovereign wealth, pension, and endowment funds) are increasingly sensitive to environmental, social, and governance (ESG) matters, opting to divest their holdings of (or not acquire investments in) companies in our industry. Organizations provide information to investors on corporate governance and related matters and have developed ratings processes for evaluating companies on their approach to ESG matters. Such ratings are used by some investors to inform their investment and voting decisions. All of this could have negative impacts on the stock prices and access to capital markets of companies in our industry.\n*\nIn response to the two points made above, research into new technologies to reduce the cost and increase the use of alternative energy sources is increasing. These technologies include advanced biofuels and hydrogen, carbon capture and storage, breakthrough energy efficiency processes, and advanced energy-saving materials.\nThe effect of the actions described above could have the potential to reduce demand for Hydrocarbons, to increase the costs of producing Hydrocarbons and products based on them (thereby increasing the prices, but reducing the quantity sold, of end-products), to affect adversely revenues, margins and investment returns or even render certain proposed projects economically unfeasible, and to increase regulatory compliance costs, as well as shift Hydrocarbon demand toward relatively lower-carbon sources such as natural gas. The full effects of the current trends (which are beyond our control) create a great deal of uncertainty as to their ultimate impact, and these effects may not be fully felt for many years to come. Nevertheless, these trends may materially adversely affect our business, financial condition, results of operations and cash flows.\nWE WILL RELY ON INDEPENDENT EXPERTS AND TECHNICAL OR OPERATIONAL SERVICE PROVIDERS OVER WHOM WE MAY HAVE LIMITED CONTROL.\nWe are, and will continue to be, engaging independent contractors to provide us with technical assistance and services. These include the services of geologists, geophysicists, chemists, landmen, engineers and scientists. We also are and will be relying upon them to analyze the Prospect and any other future prospects to determine methods in which the Prospect may be developed in a cost-effective manner and to select drill sites. In addition, we intend to rely on the owners and operators of oil rigs and drilling equipment, and on providers of oilfield services, to drill and develop our prospects to production. Moreover, if our properties hold commercial quantities of Hydrocarbons, we would need to rely on third-party gathering, trucking and/or pipeline facilities to transport and purchase our production. Our limited control over the activities and business practices of these providers, any inability on our part to maintain satisfactory commercial relationships with them or their failure to provide quality services could materially and adversely affect our business, results of operations and financial condition.\nSHORTAGES OF RIGS, EQUIPMENT, SUPPLIES AND PERSONNEL COULD DELAY OR OTHERWISE ADVERSELY AFFECT OUR COST OF OPERATIONS OR OUR ABILITY TO OPERATE ACCORDING TO OUR BUSINESS PLAN.\nIf drilling activity increases in the Western Flank, a general shortage of drilling and completion rigs, field equipment and qualified personnel could develop. As a result, the costs and delivery times of rigs, equipment and personnel could be substantially greater than in previous years. From time to time, these costs have sharply increased and could do so again. The demand for and wage rates of qualified drilling rig crews generally rise in response to the increasing number of active rigs in service and could increase sharply in the event of a shortage. Shortages of drilling and completion rigs, field equipment or qualified personnel could delay, restrict or curtail our exploration and development operations, which could in turn adversely affect our results of operations.\nOUR REVIEW OF PROPERTIES CANNOT ASSURE THAT ALL DEFICIENCIES OR ENVIRONMENTAL RISKS MAY BE IDENTIFIED OR AVOIDED.\nWe plan on undertaking reviews that we believe are consistent with industry practice for our drilling programs. However, these reviews will often be limited in scope, and may not reveal all existing or potential problems, or permit us to become sufficiently familiar with the related properties to assess all potential problems. Moreover, we may not perform an inspection on every platform or well, and our inspections may not reveal all structural or environmental problems. Our license rights with respect to the Prospect contain no indemnification for environmental liabilities. Accordingly, we will pursue our drilling programs on an as is basis, which could require us to make substantial expenditures to remediate environmental contamination. If a property deficiency or environmental problem cannot be satisfactorily remedied to warrant commencing drilling operations on a property, we could lose our entire investment in the asset.\nWE MAY NOT BE ABLE TO FULLY INSURE AGAINST ALL RISKS RELATED TO OUR PROPOSED OPERATIONS, WHICH COULD RESULT IN SUBSTANTIAL CLAIMS FOR WHICH WE ARE UNDERINSURED OR UNINSURED.\nWe currently do not have any insurance with regard to our proposed Hydrocarbon exploration and production activities. Prior to commencing these activities, we do intend to obtain insurance that we believe will be consistent with prevailing industry practices. We have no assurance that we will be able to obtain such insurance, or if obtained, we will be able to maintain it if costs become prohibitively expensive. Moreover, we have no assurance that such insurance will cover all risks. Losses and liabilities arising from uninsured and underinsured events, which could arise from even one catastrophic event, could materially and adversely affect our business, results of operations and financial condition. Our exploration, drilling and other activities are subject to risks such as:\n* fires and explosions;\n* environmental hazards, such as uncontrollable flows of natural gas, oil, brine, well fluids, toxic gas or other pollution into the environment, including groundwater contamination;\n* abnormally pressured formations;\n* mechanical failures of drilling equipment;\n* personal injuries and death, including insufficient worker compensation coverage for third-party contractors who provide drilling services; and\n* natural disasters, such as adverse weather conditions.\nOur business could be negatively affected by security threats, including cybersecurity threats, and other disruptions.\nWe will depend to a meaningful extent on digital technologies to conduct our business. These technologies will relate to seismic, financial, operating and other data. Cyber incidents have recently increased, and have involved malicious software and attempts to gain unauthorized access to data and systems. Our technologies, systems, networks, and those of our business partners, may become the target of cyberattacks or information security breaches that could result in the unauthorized release, misuse, loss or destruction of proprietary and other information, or other disruption of our business operations. Our implementation of various procedures and controls to monitor and mitigate security threats and to increase security for our information, facilities and infrastructure may result in increased capital and operating costs. Moreover, there can be no assurance that such procedures and controls will be sufficient to prevent security breaches from occurring. Any security breach could likely materially and adversely affect our business, financial condition or results of operation.\nOPERATIONAL IMPEDIMENTS MAY HINDER OUR ACCESS TO HYDROCARBON MARKETS OR DELAY OUR PRODUCTION.\nWe expect to deliver Hydrocarbons through trucking systems, gathering systems and pipelines that we do not own. Existing facilities may not be available to us now or in the future. The marketability of our future production depends in part upon the availability, proximity and capacity of truck terminals, pipelines, natural gas gathering systems and processing facilities owned by others. Our failure to establish suitable contractual relationships with respect to our production would materially and adversely affect our business, results of operations and financial condition. In addition, any significant change in our arrangements with trucking firms, gathering system or pipeline owners and operators or other market factors affecting the overall infrastructure facilities servicing our properties could adversely impact our ability to deliver the Hydrocarbons we produce to markets in a satisfactory manner. In some cases, we may be required to shut in wells, at least temporarily, for lack of a market because of the inadequacy or unavailability of transportation facilities. If that were to occur, we would be unable to timely realize revenue from those wells until arrangements were made to deliver our production to market. Moreover, our ability to produce and market Hydrocarbons could be negatively impacted by:\n* government regulations; and\n* government transportation, tax and energy policies.\nHYDROCARBON RESERVES DECLINE ONCE A PROPERTY BECOMES PRODUCTIVE, AND WE EXPECT TO NEED TO FIND ADDITIONAL RESERVES TO SUSTAIN REVENUE GROWTH.\nEven if we add Hydrocarbon reserves through our exploration activities, our reserves will decline as they are produced. We will be constantly challenged to add additional reserves through further exploration or further development of our existing properties. There can be no assurance that our exploration and development activities will be successful in adding new reserves. If we fail to replace reserves, our level of production and cash flows will be adversely impacted.\nWE EXPECT TO HAVE LIMITED CONTROL OVER ACTIVITIES ON PROPERTIES WE DO NOT OPERATE, WHICH COULD REDUCE OUR PRODUCTION AND REVENUES.\nWe expect that we will operate all of our initial wells. However, some of our business activities could be conducted through joint operating agreements under which we own partial interests in Hydrocarbon properties. In such situations, we may not operate the related properties and in some cases, we may not have the ability to remove the operator in the event of poor performance. As a result, we may have a limited ability to exercise influence over normal operating procedures, expenditures or future development of underlying properties and their associated costs. The failure of an operator of our wells to adequately perform operations, or an operators breach of the applicable agreements, could reduce our production and revenues. The success and timing of our drilling and development activities on properties operated by others therefore depend upon a number of factors outside of our and the operators control, including:\n* timing and amount of capital expenditures;\n* expertise and financial resources; and\n* inclusion of other participants.\nHYDROCARBONS ARE COMMODITIES SUBJECT TO PRICE VOLATILITY BASED ON MULTIPLE FACTORS OUTSIDE THE CONTROL OF PRODUCERS, AND LOW PRICES MAY MAKE PROPERTIES UNECONOMIC.\nHydrocarbons are commodities, and, therefore, their prices are subject to wide fluctuations in response to relatively minor changes in supply and demand. Historically, the markets for Hydrocarbons have been volatile. These markets will likely continue to be volatile in the future. The prices a producer may expect and its level of production depend on numerous factors beyond its control, such as those described in Item 1. Business - Markets and Marketing. Lower Hydrocarbons prices may not only decrease revenues on a per unit basis, but also may reduce the volume of Hydrocarbons that can be economically produced. Lower prices will also negatively impact the value of proved reserves.\nCOMMODITY PRICE RISK MANAGEMENT DECISIONS MAY CAUSE US TO FOREGO ADDITIONAL FUTURE PROFITS OR RESULT IN MAKING ADDITIONAL CASH PAYMENTS.\nTo reduce our exposure to changes in the prices of Hydrocarbons, we may enter into commodity price risk management agreements for a portion of our Hydrocarbon production. The agreements that we could enter into generally would have the effect of providing us with a fixed price for a portion of the expected future Hydrocarbon production over a fixed period of time. Commodity price risk management agreements expose us to the risk of financial loss, including the following:\n* production is less than expected;\n* the counter-party to the commodity price risk management agreement may default on its contractual obligations to us;\n* we could be required to post additional cash to cover margin requirements, which could materially and adversely affect liquidity;\n* we could be unable to meet additional margin requirements, which could result in the closing of positions thereby leading to a financial loss as well as the possible loss of the anticipated benefits of the related hedging transactions;\n* there may be a change in the expected differential between the underlying price in the commodity price risk management agreement and actual prices received; and\n* market prices may exceed the prices for which we are contracted to receive, resulting in the need to make significant cash payments.\nFurthermore, commodity price risk management arrangements may limit the benefit we would receive from increases in the prices for Hydrocarbons.\nOUR PROPERTIES MAY BE SUBJECT TO SUBSTANTIAL IMPAIRMENT OF THEIR RECORDED VALUE.\nThe accounting rules for our properties, for which we establish proved reserves, will require us to review periodically their carrying value for possible impairment. If Hydrocarbon prices decrease or if the recoverable reserves on a property are revised downward, we may be required to record impairment write-downs, which would result in a negative impact to our financial position. We also may be required to record impairment write-downs for properties lacking economic access to markets and must record impairment write-downs for our Prospect as the license for it expires or when we expect such license to expire without an extension, both of which could also negatively impact our financial position.\nOUR COMPETITORS INCLUDE LARGER, BETTER-FINANCED AND MORE EXPERIENCED COMPANIES.\nThe Hydrocarbon industry is intensely competitive. As an early-stage company, we must compete against larger companies that may have greater financial and technical resources than we have and substantially more experience in our industry. These competitive advantages may better enable our competitors to sustain the impact of higher exploration and production costs, Hydrocarbon price volatility, productivity variances among properties, overall industry cycles and other factors related to our industry. The advantages of our competitors may also negatively impact our ability to acquire prospective properties, develop reserves, attract and retain quality personnel and raise capital.\nCONDUCTING OPERATIONS IN THE HYDROCARBON INDUSTRY SUBJECTS US TO COMPLEX LAWS AND REGULATIONS, INCLUDING ENVIRONMENTAL REGULATIONS THAT CAN HAVE A MATERIAL ADVERSE EFFECT ON THE COST, MANNER OR FEASIBILITY OF DOING BUSINESS.\nCompanies that explore for and develop, produce and sell Hydrocarbons in Australia are subject to extensive government laws and regulations, including complex tax laws and environmental laws and regulations, and are required to obtain various permits and approvals from government agencies. If these permits are not issued or unfavorable restrictions or conditions are imposed on our drilling activities, we may not be able to conduct our operations as planned. Alternatively, failure to comply with these laws and regulations, including the requirements to obtain any permits, may result in the suspension or termination of our operations and subject us to administrative, civil and criminal penalties. Compliance costs can be significant. Further, these laws and regulations could change in ways that substantially increase our costs and associated liabilities. We cannot be certain that existing laws or regulations, as currently interpreted or reinterpreted in the future, or future laws or regulations will not harm our business, results of operations and financial condition. For example, matters subject to regulation and the types of permits required include:\n* water discharge and disposal permits for drilling operations;\n* drilling permits;\n* reclamation;\n* spacing of wells;\n* occupational safety and health;\n* air quality, noise levels and related permits;\n* rights-of-way and easements;\n* calculation and payment of royalties;\n* gathering, transportation and marketing of Hydrocarbons;\n* taxation;\n* waste disposal; and\n* flaring on-site of unsold natural gas.\nUnder these laws and regulations, we could be liable for:\n* personal injuries;\n* property damage;\n* oil spills;\n* discharge of hazardous materials;\n* remediation and clean-up costs;\n* fines and penalties; and\n* natural resource damages.\nRISKS RELATING TO OUR MANAGEMENT\nWE DEPEND ON CERTAIN KEY PERSONNEL.\nWe rely upon the efforts and skills of our current management. The loss of the services of any member of management, including the lack of sufficient time to devote to our operations, could materially and adversely affect our operations. The employment agreements and consulting agreements that we have entered into with members of management contain no non-competition agreement with us, and therefore allow the related member of management to terminate his agreement upon 60-days notice. As a result, any member of management may discontinue providing his services to us at any time and for any reason, and even thereafter commence competition with us. Moreover, we do not currently maintain key man life insurance on any member of management.\nOUR CURRENT MANAGEMENT RESOURCES MAY NOT BE SUFFICIENT FOR THE FUTURE, AND WE HAVE NO ASSURANCE THAT WE WILL BE ABLE TO ATTRACT ADDITIONAL QUALIFIED PERSONNEL.\nThere can be no assurance that the current level of management is sufficient to perform all responsibilities necessary or beneficial for management to perform. Our future success also depends on our continuing ability to attract, assimilate and retain highly qualified sales, technical and managerial personnel. Competition for these individuals is intense, and there can be no assurance that we can attract, assimilate or retain necessary personnel in the future.\nOUR MANAGEMENT OWNS A LARGE PERCENTAGE OF OUR OUTSTANDING SHARES, AND CUMULATIVE VOTING IS NOT AVAILABLE TO STOCKHOLDERS.\nOur current senior management owns approximately 62.59% of our outstanding common shares as of the date of the filing of this Report. Cumulative voting in the election of directors is not authorized in our First Amended and Restated Articles of Incorporation. Accordingly, it is not permitted as a matter of law. As a result, the holder or holders of a majority of our outstanding common shares may elect all of our directors. Managements large percentage ownership of our outstanding common shares will enable them to maintain their positions as such and thus their control of our business and affairs.\nOUR OBLIGATION TO INDEMNIFY MEMBERS OF MANAGEMENT COULD REQUIRE US TO PAY THEM FOR LOSSES CAUSED BY THEM, AND LIMITATIONS ON CLAIMS AGAINST STOCKHOLDERS COULD PREVENT OUR RECOVERY OF SUCH LOSSES FROM THEM.\nThe corporation law of Nevada allows a Nevada corporation to indemnify its directors and each of its officers, agents, contractors and/or employees to the extent that certain standards are met, and our First Amended and Restated Articles of Incorporation permit indemnification of our directors, and our Bylaws require indemnification of our directors and officers to the maximum extent permitted by law. If the required standards are met, we could be required to indemnify management for losses caused by them. Further, we may purchase and maintain insurance on behalf of any such persons whether or not we have the power to indemnify such person against the liability insured against. Moreover, the corporation law of Nevada allows a Nevada corporation to limit the liability of its directors to the corporation and its stockholders to a certain extent, and our First Amended and Restated Articles of Incorporation and Bylaws have eliminated the directors liability to the maximum extent permitted by law. Consequently, because of the actions or omissions of our management, we could incur substantial losses and be prevented from recovering such losses from such persons. Further, the U.S. Securities and Exchange Commission maintains that indemnification for liabilities arising under the Securities Act is against the public policy expressed in the Securities Act, and is therefore unenforceable.\nWe may not have adequate internal controls over financial reporting.\nWhile we are constantly striving to improve our internal controls over financial reporting, our management has determined that our disclosure controls, procedures and controls over financial reporting are not sufficiently effective to ensure that information required to be disclosed by us in the reports filed or submitted under the Securities Exchange Act of 1934, as amended (the Exchange Act), is recorded, processed, summarized, and reported within the time periods specified in the rules and forms of the Commission. Our Board of Directors has not designated an Audit Committee and we do not have any outside directors. We have implemented a number of disbursing, accounting and financial statement preparation and review processes, and as a result the financial controls of the Company have been improved. If we do not have adequate internal accounting controls, we may also be unable to prepare accurate accounts on a timely basis to meet our continuing financial reporting obligations and we may not be able to satisfy our obligations under applicable securities laws.\nThere may be limitations on the effectiveness of our internal controls, and a failure of our control systems to prevent error or fraud may materially harm us.\nWe do not expect that internal control over financing reporting, even if timely and well established, will prevent all errors and fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. Failure of our control systems to prevent error or fraud could materially and adversely affect our business.\nWE HAVE NOT VOLUNTARILY IMPLEMENTED VARIOUS CORPORATE GOVERNANCE MEASURES, IN THE ABSENCE OF WHICH, STOCKHOLDERS MAY HAVE MORE LIMITED PROTECTIONS AGAINST INTERESTED DIRECTOR TRANSACTIONS, CONFLICTS OF INTEREST AND SIMILAR MATTERS.\nCertain Federal legislation, including the Sarbanes Oxley Act of 2002, has resulted in the adoption of various corporate governance measures designed to promote the integrity of corporate management and securities markets. Some of these measures have been adopted in response to legal requirements. Others have been adopted by companies in response to the requirements of national securities exchanges, such as the NYSE or the NASDAQ Stock Market, on which their securities are listed. Among the corporate governance measures that are required under the rules of national securities exchanges are those that address board of directors independence, audit committee oversight, and the adoption of a code of ethics. Although we have adopted a Code of Ethics, we have not yet adopted any of these other corporate governance measures and, since our securities are not yet listed on a national securities exchange, we are not required to do so. We have not adopted certain corporate governance measures such as an audit or other independent committees of our Board of Directors because we do not have sufficient funds available to do so. Possibly if we were to adopt some or all of these corporate governance measures, stockholders would benefit from somewhat greater assurances that internal corporate decisions were being made by disinterested directors and that policies had been implemented to define responsible conduct. For example, in the absence of audit, nominating and compensation committees comprised of at least a majority of independent directors, decisions concerning matters such as compensation packages to our senior officers and recommendations for director nominees may be made by a majority of directors who have an interest in the outcome of the matters being decided. Although we intend to bolster our corporate governance capabilities as funds become available for this purpose, prospective investors should bear in mind our current lack of corporate governance measures in formulating their investment decisions.\nRISKS RELATING TO OUR COMMON SHARES\nOUR COMMON SHARES HAVE EXPERIENCED LIMITED TRADING.\nOur common shares are quoted on the over-the-counter markets under the name Discovery Energy Corp. and the symbol DENR. The volume of trading of our common shares has been extremely limited. There can be no assurance as to the prices at which our common shares will trade in the future. Until our common shares become more broadly held and orderly markets develop and even thereafter, the prices of our common shares may fluctuate significantly. Prices for our common shares will be determined in the marketplace and may be influenced by many factors, including the following:\n* The depth and liquidity of the markets for our common shares;\n* Investor perception of us and the industry in which we participate;\n* General economic and market conditions;\n* Responses to quarter-to-quarter variations in operating results;\n* Failure to meet securities analysts estimates;\n* Changes in financial estimates by securities analysts;\n* Changes in laws, regulations and policies;\n* Conditions, trends or announcements in the Hydrocarbon industry;\n* Announcements of significant acquisitions, strategic alliances, joint ventures or capital commitments by us or our competitors;\n* Additions or departures of key personnel;\n* Sales of our common shares;\n* Accounting pronouncements or changes in accounting rules that affect our financial statements; and\n* Other factors and events beyond our control.\nThe market price of our common shares could experience significant fluctuations unrelated to our operating performance. As a result, a stockholder (due to personal circumstances) may be required to sell such stockholders common shares at a time when our stock price is depressed due to random fluctuations, which are possibly based on factors beyond our control.\nINCREASES IN THE SALES VOLUME OF OUR SHARES COULD ADVERSELY AFFECT US.\nWe have a very thinly traded market for our shares. Future sales of a large number of our shares may have a depressive effect on the price of our common shares, and might also adversely affect our ability to raise additional capital.\nTHE TRADING PRICE OF OUR COMMON SHARES MAY ENTAIL ADDITIONAL REGULATORY REQUIREMENTS, WHICH COULD NEGATIVELY AFFECT SUCH TRADING PRICE.\nThe trading price of our common shares historically has been below $5.00 per share. As a result of this price level, trading in our common shares is subject to the requirements of certain rules promulgated under the Exchange Act. These rules require additional disclosure by broker dealers in connection with any trades generally involving any non-NASDAQ equity security that has a market price of less than $5.00 per share, subject to certain exceptions. Such rules require the delivery, before any penny stock transaction, of a disclosure schedule explaining the penny stock market and the risks associated therewith and impose various sales practice requirements on broker dealers who sell penny stocks to persons other than established customers and accredited investors (generally institutions). For these types of transactions, the broker dealer must determine the suitability of the penny stock for the purchaser and receive the purchasers written consent to the transaction before sale. The additional burdens imposed upon broker dealers by such requirements may discourage broker dealers from effecting transactions in our common shares. As a consequence, the market liquidity of our common shares could be severely affected or limited by these regulatory requirements.\nPROVISIONS OF OUR ARTICLES OF INCORPORATION AND BYLAWS MAY DELAY OR PREVENT A TAKEOVER, WHICH MAY NOT BE IN THE BEST INTERESTS OF OUR STOCKHOLDERS.\nProvisions of our First Amended and Restated Articles of Incorporation and Bylaws may be deemed to have anti-takeover effects, which include when and by whom special meetings of our stockholders may be called, and may delay, defer or prevent a takeover attempt. In addition, our First Amended and Restated Articles of Incorporation authorizes the issuance of up to 10,000,000 shares of preferred stock with such rights and preferences, as may be determined by our Board of Directors. Of this authorized preferred stock, no shares are currently issued and outstanding. Our Board of Directors may, without stockholder approval, issue up to 10,000,000 preferred stock with dividends, liquidation, conversion or voting rights that could adversely affect the voting power or other rights of our common stockholders.\nSTOCKHOLDERS HAVE NO GUARANTEE OF DIVIDENDS AND MAY BE CONSTRAINED TO SELL THEIR SHARES TO REALIZE A RETURN ON THEIR INVESTMENT.\nThe holders of our common shares are entitled to receive dividends when, as and if declared by the Board of Directors out of funds legally available therefore. To date, we have paid no cash dividends. Currently, our outstanding Debentures prohibit us from paying dividends without the consent of our Debentures holders. Even if such a prohibition did not exist, the Board of Directors will most likely not declare any dividends in the foreseeable future, but will instead retain all earnings, if any, for use in our business operations. As a result, an investor will probably need to sell some or all of their shares to realize a return on an investment in them, and investors may not be able to sell such shares at or above the price they paid for them. Item 1B. Unresolved Staff Comments.\nNot applicable. Item 2. Properties.\nWe maintain our principal executive offices at One Riverway Drive, Suite 1700, Houston, Texas 77056 through an office rental package on essentially a month-to-month basis. Management believes that any needed additional or alternative office space can be readily obtained.\nFor information about our Hydrocarbon property, see Item 1. Business above. Item 3. Legal Proceedings.\nWe are not presently a party to any pending legal proceeding. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Shareholder Matters and Issuer Purchases of Equity Securities.\nTrading Prices. Our common shares are quoted in the over-the-counter market under the name Discovery Energy Corp. and the symbol DENR.\nOutstanding Shares and Record Holders. As of November 30, 2022, we had 108 common stockholders of record and 154,365,396 common shares outstanding.\nDividends. We have not paid any cash dividends on our common shares, and we do not expect to pay any dividends for the foreseeable future. Currently, our outstanding Debentures prohibit us from paying dividends without the consent of the Debentures holders.\nEquity Compensation Plans. We have one equity compensation plan for our directors, officers, employees and consultants pursuant to which options, rights or shares may be granted or issued. This plan is named the Discovery Energy Corp. 2012 Equity Incentive Plan (the Plan). The following table provides information as of February 28, 2022 with respect to our compensation plans (including individual compensation arrangements), under which securities are authorized for issuance aggregated as to (i) compensation plans previously approved by stockholders, and (ii) compensation plans not previously approved by stockholders:\nEquity Compensation Plan Information\nNumber of\nsecurities to be\nissued upon\nexercise of\noutstanding\noptions,\nwarrants and\nrights\nWeighted-\naverage\nexercise price\nof outstanding\noptions,\nwarrants and\nrights\nNumber of\nsecurities\nremaining\navailable for\nfuture issuance\nunder equity\ncompensation\nplans\nPlan category (a) (b) (c)\nEquity compensation plans approved by security\nholders - - -\nEquity compensation plans not approved by security\nholders - - 1,747,300\nTotal - - 1,747,300\nThe following is a description of the material features of the Plan:\nGeneral. On July 30, 2012, our Board of Directors approved the Plan. The Plan provides for various equity awards to our directors, officers, employees and certain of our consultants, to attract them, to reward them for their service, and to encourage them to continue to provide services for us.\nAdministration. Our Board of Directors administers the Plan, but it has the right to delegate the administration of the Plan to any compensation or other committee that it hereafter creates for such purpose. For purposes of the remainder of this section, the person administering the Plan at any time is referred to as the Administrator.\nEligibility. The Administrator has substantial discretion pursuant to the Plan to determine the persons to whom awards under the Plan will be made, and the amounts and restrictions imposed in connection therewith; provided, however, that generally a recipient of an award must be one of our directors or officers (whether or not also an employee), employees, or eligible consultants.\nShares Subject to the Plan. Six million (6,000,000) common shares are authorized to be awarded pursuant to the Plan, all of which were or are registered with the Securities and Exchange Commission. Any shares awarded and later forfeited or reacquired by us are again available for award or sale under the Plan. Awards may be made pursuant to the Plan until no further shares are available for issuance or until July 30, 2022, whichever occurs first.\nTypes of Awards. The following types of awards may be granted under the Plan. All of the awards described below are subject to the conditions, limitations, restrictions, vesting and forfeiture provisions determined by the Administrator, in its sole discretion, subject to such limitations as are provided in the Plan. The Administrator, in its discretion, shall also determine the number of shares subject to any award. At the discretion of the Administrator, awards may be made subject to or may vest on an accelerated basis upon the achievement of performance related criteria, which may be established on a Company-wide basis or with respect to one or more business units or divisions or subsidiaries and may be based upon the attainment of criteria as may be determined by the Administrator and set forth in the participants award agreement. None of the awards available under the Plan may be granted to any participant who is not subject to U.S. Federal income tax, unless such grant would not constitute deferred compensation within the meaning of Section 409A of the Internal Revenue Code of 1986 (the Code).\n* Stock Grants. A stock grant is an award of common shares, which may be granted outright, or (in certain cases) may not vest until after a specified period of time, or upon the satisfaction of other vesting conditions as determined by the Administrator, and which may be forfeited if conditions to vesting are not met. Participants generally receive dividend payments on the shares subject to a restricted stock grant award during the vesting period, and are also generally entitled to vote the shares underlying their awards.\n* Non-Qualified Stock Options. An award of a non-qualified stock option under the Plan grants a participant the right to purchase a certain number of common shares during a specified term in the future, possibly after a vesting period, at an exercise price equal to at least 100% of the fair market value of the common shares on the grant date. The term of a non-qualified stock option may not exceed 10 years from the date of grant. Payment of the exercise price of a non-qualified stock option may be made in cash or, if permitted by the Administrator, by tendering common shares owned by the participant and acquired at least six (6) months prior to exercise, having a fair market value equal to the exercise price, by a combination of cash and common shares or by authorizing the sale of shares otherwise issuable upon exercise, with the sale proceeds applied towards the exercise price. Additionally, the Administrator may provide that stock options can be net exercised - that is exercised by issuing shares having a value approximately equal to the difference between the aggregate value of the shares as to which the option is being exercised and the aggregate exercise price for such number of shares. A non-qualified stock option is an option that does not qualify under Section 422 of the Code.\n* Stock-Based Awards. A stock-based award is a grant by us under the Plan of an equity award or an equity-based award that is not a non-qualified stock option, an incentive stock option, or a stock grant. The Administrator has the right to grant stock-based awards having such terms and conditions as the Administrator may determine, including, without limitation, the grants of shares based upon certain conditions, the grant of securities convertible into shares and the grant of stock appreciation rights, phantom stock awards or stock units. The principal terms of each stock-based award will be set forth in the participants award agreement, in a form approved by the Administrator and shall contain terms and conditions which the Administrator determines to be appropriate and in our best interests.\nPrevious Awards. We had awarded 4,252,700 common shares in outright grants pursuant to the Plan as of February 28, 2022.\nAnti-dilution. The Plan carries certain anti-dilution provisions concerning stock dividends, stock splits, consolidations, mergers, re-capitalizations and reorganizations.\nTerm. The Plan expired on July 30, 2022 unless sooner terminated except as to awards outstanding on that date.\nAmendment and Earlier Termination. Our Board of Directors or our stockholders may terminate the Plan prior to its scheduled termination. Our stockholders may amend the Plan in any respect at any time, except no amendment may, without the consent of a participant, alter or impair such participants rights under any award previously granted. The administrator of the Plan has the ability to amend the Plan in certain technical ways.\nFederal Income Tax Consequences. The following brief summary of the principal Federal income tax consequences of awards under the Plan is based on current Federal income tax laws. This summary is not intended to constitute tax advice and, among other things, does not address possible state or local tax consequences. Accordingly, a participant in the Plan should consult a tax advisor with respect to the tax aspects of transactions under the Plan.\n* Stock Grants. A participant who receives an outright stock grant generally will be taxed at the time a stock grant is awarded, and the amount of taxable income recognized will equal the fair market value of the shares subject to the award. A participant who receives a restricted stock grant generally will not be taxed at the time a stock grant is awarded but will recognize taxable income when the award vests or otherwise is no longer subject to a substantial risk of forfeiture. The amount of taxable income recognized will equal the fair market value of the shares subject to the award (or the portion of the award that is then vesting) at that time. Participants may elect to be taxed based on the fair market value of the shares at the time of grant by making an election under Section 83(b) of the Code within 30 days of the award date. If an award with respect to which a participant has made such an election under Section 83(b) is subsequently canceled, no deduction or tax refund will be allowed for the amount previously recognized as income. Unless a participant makes a Section 83(b) election, dividends paid to a participant on shares of an unvested restricted stock grant will be taxable to the participant as ordinary income. If the participant made a Section 83(b) election, the dividends will be taxable to the participant as dividend income, which generally is subject to the same rate as capital gains income. Except as provided under Certain Limitations on Deductibility of Executive Compensation below, we will ordinarily be entitled to a deduction at the same time and in the same amounts as the ordinary income recognized by the participant with respect to a stock grant award. Unless a participant has made a Section 83(b) election, we will also be entitled to a deduction, for federal income tax purposes, for dividends paid on awards of unvested restricted stock grants when the restrictions lapse.\n* Non-Qualified Stock Options. Generally, a participant will not recognize taxable income on the grant of a non-qualified stock option, provided the exercise price of the option is equal to the fair market value of the underlying stock at the time of grant. Upon the exercise of a non-qualified stock option, a participant will recognize ordinary income in an amount equal to the difference between the fair market value of the common shares received on the date of exercise and the option cost (number of shares purchased multiplied by the exercise price per share). The participant will recognize ordinary income upon the exercise of the option even though the shares acquired may be subject to further restrictions on sale or transferability. Except as provided under Certain Limitations on Deductibility of Executive Compensation below, we will ordinarily be entitled to a deduction on the exercise date equal to the ordinary income recognized by the participant upon exercise. Generally, upon a subsequent sale of shares acquired in an option exercise, the difference between the sale proceeds and the cost basis of the shares sold will be taxable as a capital gain or loss.\n* Other Stock-Based Awards. These awards could include stock appreciation rights, phantom stock awards or stock units, as examples. The tax rules that apply to these awards vary. However, if one of these awards is settled by the payment of cash, the full amount of the cash will generally be taxable to the participant as ordinary income. If one of these awards is settled by the issuance of shares, a participant will recognize taxable income in an amount equal to the fair market value of the shares on the grant date. Except as provided under Certain Limitations on Deductibility of Executive Compensation below, we will ordinarily be entitled to a deduction at the same time and in the same amounts as the ordinary income recognized by the participant with respect to such a stock award.\n* Withholding. We retain the right to deduct or withhold, or require the participant to remit to his or her employer, an amount sufficient to satisfy federal, state and local and foreign taxes, required by law or regulation to be withheld with respect to any taxable event as a result of the Plan.\n* Certain Limitations on Deductibility of Executive Compensation. With certain exceptions, Section 162(m) of the Code limits the deduction to us for compensation paid to certain executive officers to $1 million per executive per taxable year unless such compensation is considered qualified performance - based compensation within the meaning of Section 162(m) or is otherwise exempt from Section 162(m). The Plan is designed so that options and SARs qualify for this exemption, and it permits the Administrator to grant other awards designed to qualify for this exemption.\n* Treatment of Excess Parachute Payments. The accelerated vesting of awards under the Plan upon a change of control of our company could result in a participant being considered to receive excess parachute payments (as defined in Section 280G of the Code), which payments are subject to a 20% excise tax imposed on the participant. We would not be able to deduct the excess parachute payments made to a participant. Item 6. Selected Financial Data.\nNot applicable. Item 7 Managements Discussion and Analysis of Financial Condition and Results of Operations.\nGeneral\nDiscovery Energy Corp. (the Company) was incorporated under the laws of the state of Nevada on May 24, 2006 under the name Santos Resource Corp. Its current business plan is to explore for and produce Hydrocarbons from a tract of land (the Prospect) covered by Petroleum Exploration License (PEL) 512 (the License) in the State of South Australia. The business plan was adopted near the end of fiscal 2012. In May 2012, the Company incorporated a wholly owned Australian subsidiary, Discovery Energy SA Ltd. (Subsidiary), for the purpose of acquiring a 100% working interest in the License. In May 2016, the Subsidiarys legal entity status changed from public to private and its name changed to Discovery Energy SA Pty Ltd. The Company is in the initial exploration phase of determining whether or not the Prospect contains economically recoverable volumes of crude oil, natural gas and/or natural gas liquid (collectively Hydrocarbons). For information about the milestones that the Company has achieved to date, see Item 1. Business. Although the Companys current focus is primarily on the Prospect, management from time-to-time exchanges information with other industry participants regarding additional investment opportunities in Australia.\nThe Company has experienced losses and negative cash flows since inception, and it expects to incur such losses and negative cash flows for the foreseeable future. The Company has an accumulated deficit of $33,996,855 since inception through February 28, 2022. As of June 8, 2022, the Company had approximately $55,000 in cash available to meet its operating cash requirements. The Companys losses (coupled with a limited amount of cash) cause substantial doubt about the Companys ability to continue as a going concern for the 12 months following the issuance of our February 28, 2022 financial statements, and our independent registered public accountant has added an emphasis paragraph to its report on our financial statements for the year ended February 28, 2022 regarding our ability to continue as a going concern. The Company is maintaining an on-going effort to locate sources of additional funding, without which the Company will not be able to remain a viable entity. Information about the Companys liquidity situation and its on-going capital raising activities is given in the section captioned Liquidity and Capital Resources below.\nCritical Accounting Policies and Estimates\nThe Companys discussion and analysis of its financial condition and results of operations as of February 28, 2022 are based upon its independently audited financial statements, which have been prepared in accordance with generally accepted accounting principles in the United States. The preparation of these financial statements requires that management make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. The estimates are based on historical experience and on various other assumptions that are believed to be reasonable under the circumstances. These estimates and assumptions provide a basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions, and these differences may be material. The footnotes to the financial statements contain critical accounting policies that significantly impact the judgments and estimates used in the preparation of these financial statements. These policies should be reviewed to better understand the financial condition and results of operations of the Company.\nResults of Operations\nResults of operations for the fiscal years ended February 28, 2022 and February 28, 2021 are summarized in the table below:\nFiscal Year\nEnded\nFebruary 28, 2022\nFiscal Year\nEnded\nFebruary 28, 2021\nRevenue $ - $ -\nOperating expenses (1,189,974 ) (3,755,298 )\nOther expenses (1,145,143 ) (2,328,415 )\nNet loss $ (2,335,117 ) $ (6,083,713 )\nOperating expenses for the fiscal years ended February 28, 2022 and February 28, 2021 are summarized in the table below:\nFiscal Year\nEnded\nFebruary 28, 2022\nFiscal Year\nEnded\nFebruary 28, 2021\nGeneral and administrative 1,185,161 1,008,532\nWarrant modification expense - 2,710,166\nExploration costs 4,813 36,600\nTotal operating expenses $ 1,189,974 $ 3,755,298\nComparison of Fiscal Year Ended February 28, 2022 to Fiscal Year Ended February 28, 2021\nRevenues. The Company did not earn any revenues in either of the comparative fiscal years. Sales revenues are not anticipated until such time as the Prospect has commenced commercial production of Hydrocarbons. As the Company is presently in the exploration stage of its operations, no assurance can be provided that commercially exploitable levels of hydrocarbons on the Prospect will be discovered, or if such resources are discovered, that the Prospect will commence commercial production.\nOperating Expenses. Total operating expenses incurred during the fiscal year ended February 28, 2022 decreased by $2,565,324 (68%), compared to those incurred during the fiscal year ended February 28, 2021. A warrant modification expense for the extension of the maturity date of outstanding warrants to December 31, 2023 for the fiscal year ended February 28, 2021 resulted in a warrant modification expense of approximately $2,710,000, compared to none for the fiscal year ended February 28, 2022. This is partially offset by a non-cash increase in general and administrative of approximately $177,000 for the fiscal year ended February 28, 2022. This primarily reflects the impact of accrual adjustments for prior years activities. Additionally, exploration costs decreased by approximately $32,000 for the fiscal year ended February 28, 2022.\nOther Income (Expense). Total other expenses incurred during fiscal year ended February 28, 2022 decreased by $1,183,272 (51%), compared to those incurred during the fiscal year ended February 28, 2021. This is primarily due to a decrease in amortization expense of $1,144,455 due to the extension of the maturity date of outstanding warrants to December 31, 2023\nNet Income (Loss). The Company had a net loss of $2,335,117 for the fiscal year ended February 28, 2022, compared to a net loss of $6,083,713 for the fiscal year ended February 28, 2021. Loss per common share was $0.02 for the fiscal year ended February 28, 2022, and $0.04 for the fiscal year ended February 29, 2021.\nCash Flows for the Fiscal Years Ended February 28, 2022 and February 28, 2021\nCash Used in Operating Activities: Operating activities for the fiscal year ended February 28, 2022 used cash of $208,596, compared to $202,674 for the fiscal year ended February 28, 2021.\nCash Used in Investing Activities: No cash was used for investing activities during fiscal years ended February 28, 2022 and February 28, 2021.\nCash Provided by Financing Activities: Proceeds from a Paycheck Protection Program loan in the amount of $120,000 was received during the fiscal year ended February 28, 2022. Additionally, the Company received gross proceeds of $75,000 for the issuance of a senior secured convertible debenture with a Maturity Date of December 31, 2023. Financing activities totaled $218,750 during the fiscal year ended February 28, 2021, resulting from the private placement of 500,000 common shares at $0.20 per common share for gross proceeds of $100,000, and proceeds from a Paycheck Protection Program loan in the amount of $118,750.\nLiquidity and Capital Resources\nFinancing History and Immediate, Short-Term Capital Needs\nEarly Financings. From January 2012 through May 27, 2016, business activities were financed primarily through private placements of common shares. During that period, several rounds of equity financing were conducted which raised total seed capital in the amount of $2,723,750 resulting in the issuance of 19,657,501 common shares. Moreover, from time to time, officers and directors of the Company provided short-term bridge funding or paid expenses on behalf of the Company. The amounts of these advances and expense payments (outstanding at the time of the Debentures financings described below) were repaid out of the initial proceeds from these financings. After these amounts were repaid, the Company has received (from time to time) one or more comparatively small advances from, and had a comparatively small amount of expenses paid by, officers and directors of the Company.\nDebentures Financing. Beginning in May 2016 and continuing through August 2018, the Company relied on a series of placements of Debentures (debt instruments convertible into common shares). The Company undertook a subsequent isolated placement of Debentures, including one in November 2021 featuring an original principal amount of $75,000, and one Debenture in each of June and July 2022, both featuring an original principal amount of $50,000. The 17 Debentures comprising this series and placement were issued pursuant to a Securities Purchase Agreement executed on May 27, 2016. Debentures having an aggregate original principal amount of $7,025,000 have been placed. In conjunction with certain Debentures and the extension of the maturity date of the Debentures, Warrants were issued that give the holder the right to purchase up to a maximum of 27,877,058 common shares at an initial per-share exercise price of $0.20.\nEach of the Debentures includes the following features:\n* The Debentures bear interest at the rate of eight percent (8%) per annum, compounded quarterly. However, upon the occurrence and during the continuance of a stipulated event of default, the Debentures will bear interest at the rate of twelve percent (12%) per annum.\n* Interest need not be paid on the Debentures until the principal amount of the Debentures becomes due and payable. Instead, accrued interest is added to the outstanding principal amount of the Debentures quarterly. Nevertheless, the Company may elect to pay accrued interest in cash at the time that such interest would otherwise be added to the outstanding principal amount of the Debentures.\n* The principal amount of and accrued interest on the Debentures are due and payable in a single balloon payment on or before December 31, 2023.\n* We are not entitled to prepay the Debentures.\n* The Debentures are convertible, in whole or in part, into Common Shares at the option of holders, at any time and from time to time. The conversion price for Debentures having an aggregate original principal amount of $6,062,500 is $0.16, while the conversion price for a Debenture with an original principal amount of $962,500 is $0.20. All conversion prices are subject to certain adjustments that are believed to be customary in transactions of this nature, including so-called down round financing adjustments. The Company is subject to certain liabilities and liquidated damages for its failure to honor timely a conversion of the Debentures, and these liabilities and liquidated damages are believed to be customary in transactions of this nature.\n* The holders of the Debentures are entitled to have them redeemed completely or partially upon certain events (such as a change of control transaction involving the Company or the sale of a material portion of the Companys assets) at a redemption price equal to 120% of the then outstanding principal amount of the Debenture and 100% of accrued and unpaid interest on the outstanding principal amount of this Debenture, plus all liquidated damages and other amounts due thereunder in respect of the Debenture.\n* The Debentures feature negative operating covenants, events of defaults and remedies upon such events of defaults that are believed to be customary in transactions of this nature. One of the remedies upon an event of default is the Debentures holders ability to accelerate the maturity of the Debentures such that all amounts owing under the Debentures would become immediately due and payable. The Debentures holders would then be able to resort to the collateral securing the Debentures, if the Company did not pay the amount outstanding, which is likely to be the case.\n* The Debentures are secured by virtually all of the Companys assets owned directly or indirectly but for the License, which is held by the Companys Australian subsidiary, Discovery Energy SA Pty Limited (the Subsidiary). Moreover, the Company has separately guaranteed the Debentures and has pledged all of its stock in the Subsidiary to secure such guarantee. The essential effect of these security arrangements is that, if the Company defaults on or experiences an event of default with respect to the Debentures, the holders of the Debentures could exercise the rights of a secured creditor, which could result in the partial or total loss of nearly all of the Companys assets, in which case its business could cease and all or substantially all stockholders equity could be lost. For more information about this, see the Risk Factors captioned THE EXERCISE OF SECURED CREDITOR RIGHTS COULD RESULT IN A SIGNIFICANT OR COMPLETE LOSS herein.\nEach of the Warrants includes the following features:\n* The initial per-share exercise price of the Warrants is $0.20 and is subject to certain adjustments that are generally believed to be customary in transactions of this nature. Subject to certain exceptions, the exercise price of the Warrants involves possible adjustments downward to the price of any common shares or their equivalents sold by the Company during the term of the Warrants for less than the then applicable exercise price of the Warrants. Upon the adjustment of the exercise price, the number of shares issuable upon exercise of the Warrants is proportionately adjusted so the aggregate exercise price of the Warrants remains unchanged.\n* All of the Warrants are currently exercisable and will remain so until their expiration date of December 31, 2023.\n* The Company is subject to certain liabilities and liquidated damages for failure to honor timely an exercise of the Warrants, and these liabilities and liquidated damages are believed to be customary in transactions of this nature.\nThe largest holder of the Debentures has the right to have elected to the Companys Board of Directors one nominee. To date, the holder has not exercised this right.\nMoreover, the holders of the Debentures have the right to require the Company to register with the SEC the resale of the common shares into which Debentures can be converted, the common shares that can be acquired upon the exercise of the Warrants and possibly other Common Shares. This preceding right is generally referred to as demand registration rights. The Company has the obligation to file a registration statement to effect the registration within certain periods of time, and the obligation to cause such registration statement to become effective within certain other periods of time. It will be liable for stipulated monetary damages if it fails in these obligations. The size of these damages is significant, although they are believed to be customary. Once a registration statement is declared effective, the Company must maintain it as effective and current until such time as the registered common shares are sold or become eligible to be sold pursuant to an exemption under certain circumstances, which it believes will never occur. In addition to the Debentures holders demand registration rights, the Debentures holders have piggyback registration rights whereby they can participate (without a demand) in most registrations that the Company might proposes.\nThe proceeds from the Debentures placements were generally used to fund the acquisition, processing and interpretation of the Nike Survey data and payment of the Companys and the Debentures holders expenses associated with the placements. A portion of these proceeds were used to retire all of the then outstanding indebtedness (including the amounts owed to Liberty Petroleum for allowing us to be issued the License in its place, and loans made by management), and to acquire a 5.0% overriding royalty interest relating to the Prospect. Funds were also used for payment of general and administrative expenses. In addition to the preceding, a portion of the proceeds was used to pay Rincon Energy, LLC pursuant to a geophysical consulting agreement.\nCOVID-19. The Company initially experienced no material impacts from the COVID-19 pandemic with respect to liquidity and capital. However, the negative reaction in financial markets was significant. Initially, the pandemic resulted in a severe decrease in demand for Hydrocarbons, in particular transportation fuels. This decrease resulted in a major drop in the price of crude oil and its resulting impact on financial markets in general and in particular, the energy industry. Demand has now largely recovered from pandemic declines. Exploration and production operations are recovering and funding is becoming more widely available. However, continuing threats of an increase in infection rates is concerning, though there has, to date, been no negative Hydrocarbon sector activity impact. For further risk discussion, see the risk factor captioned PANDEMICS OR DISEASE OUTBREAKS (SUCH AS THE NOVEL CORONAVIRUS, ALSO KNOWN AS THE COVID-19 VIRUS) COULD MATERIALLY AND ADVERSELY AFFECT US IN A VAREITY OF WAYS.\nEquity Placements. Subsequent to the start of the Debentures placements, the Company continued certain private capital raising transactions involving its common shares. Beginning in November 2016 and continuing through the end of December 2020, the Company closed on a series of private placements in which an aggregate of 9,075,000 shares were issued for an aggregate purchase price of $1,886,250.\nPaycheck Protection Program Loan. In connection with the Paycheck Protection Program established by the Coronavirus Aid, Relief, and Economic Security Act, the Company borrowed an initial loan during fiscal year 2021 in the amount of $118,750 and a second loan during fiscal year 2022 in the amount of $120,000. Over $100,000 in principal and interest on the initial loan was forgiven, and the unforgiven portion of this loan has been paid in its entirety. The Company applied for forgiveness of the second loan, but slightly less than $20,000 of the outstanding balance of the second loan was forgiven. The unforgiven portion (slightly over $100,000) will need to be repaid over a four-year period.\nAvailable Cash. As of November 30, 2022, the Company had cash of approximately $19,000 and had negative working capital of approximately $6,780,000. Management believes that the cash on hand, as of the preceding date, will be sufficient to finance general and administrative expenses through January 31, 2023 although no assurance of this can be provided. However, this amount of cash will be insufficient to allow the Company to fulfill work commitment obligations in a timely manner. A plan for financing these obligations is discussed below. Management has been financing and intends to continue to try to finance all general and administrative expenses beyond available cash on hand by undertaking small raises of funds through private placements of common shares until such time as a larger raise is completed. No assurance can be provided of successfully raising any additional funds for this purpose.\nLong-Term Capital Needs\nThe five-year work commitment relating to the License imposes certain obligations on the Company. The work requirements of the first two years, which included geotechnical studies and the Nike Survey, have been completed and reports and certain work materials have been submitted as required by the South Australian government. Going forward, additional funds will be required to meet the seismic and drilling obligations of License Years 3, 4 and 5. Working capital will also be needed to satisfy general and administrative expenses. Between May 2022 and October 2024 (the month in which the Companys work commitments are currently required to be completed), the Company estimates that it will need to raise an additional $20 million to have sufficient capital to meet the remaining work commitments specified in the License and to fund operations. Net revenues produced from successful oil wells could provide some of the funds required to meet these capital needs. However, no assurance can be given that this or any other amount of financing will be obtained or that any oil revenue will be earned.\nIf successful with the early wells, work will continue with a full development plan, the scope of which is now uncertain but will be based on technical analysis of seismic data, field drilling and log reports, production history, costs estimates and sales prices. However, all of the preceding plans are subject to the availability of sufficient funding and the receipt of all governmental approvals. Without sufficient available funds to undertake these tasks, additional financings or a joint venture partner will be required.\nFailure to procure a joint venture partner or raise additional funds will preclude the Company from pursuing its business plan, as well as exposing the Company to the loss of the License, as discussed below. Moreover, if the business plan proceeds as just described, but the initial wells do not prove to hold producible reserves, the Company could be forced to cease its initial exploration efforts on the Prospect.\nMajor Financing Efforts and Other Sources of Capital\nThe Companys capital strategy has been, and continues to be, to attempt to engage in a single major capital raising transaction to provide sufficient funds to satisfy its capital needs for a number of years to come. While management has not completely abandoned this strategy, the Company did shift its emphasis in an effort to engage in one or more smaller capital raising transactions to provide sufficient funds to satisfy ongoing and future capital needs. During a two-year period beginning in May 2016, the Company completed a series of placements of its Debentures. The Company undertook subsequent isolated placements of Debentures, including one placement of a Debenture in November 2021 featuring an original principal amount of $75,000, and one Debenture in each of June and July 2022, both featuring an original principal amount of $50,000. All these Debentures have an aggregate original principal amount of $7,025,000. Regarding the future financing of the Companys work commitments, the interpretation and analysis of the Nike Survey resulted in an inventory of more than 30 leads judged to be potential areas of crude oil accumulations. These initial prospective locations were prioritized and the results are being presented to prospective investors with a view to securing the capital to commence the Companys initial drilling program. The Company needs to complete a major capital raise transaction to continue moving its business plan forward. In the interim, the Company is continuing efforts to raise comparably smaller amounts to cover general and administrative expenses. The Company has no assurance that it will be able to raise any required funds. The Company is also pursuing efforts to secure one or more joint venture partners.\nSales from production as a result of successful exploration and drilling efforts would provide the Company with incoming cash flow. The proved reserves associated with production would most likely increase the value of the Companys rights in the Prospect. This, in turn, should enable the Company to obtain bank financing (after the wells have produced for a period of time to satisfy the lenders requirements). Both of these results would enable the Company to continue with its development activities. Positive cash flow is a critical success factor for the Companys plan of operation in the long run. Management believes that, if the Companys plan of operation successfully progresses (and production is realized) as planned, sufficient cash flow and debt financing will be available for purposes of properly pursuing its plan of operation, although the Company can make no assurances in this regard.\nFinally, to reduce its cash requirements, the Company might attempt to satisfy some of its obligations by issuing shares of its common shares, which would result in dilution in the percentage ownership interests of the Companys existing stockholders and could result in dilution of the net asset value per share of the Companys existing stockholders.\nConsequences of a Financing Failure\nIf required financing is not available on acceptable terms, the Company could be prevented from satisfying its work commitment obligations or developing the Prospect to the point that the Company is able to repay the Debentures, which become due in December 2023. Failure to satisfy work commitment obligations could result in the eventual loss of the License and the total loss of the Companys assets and properties. Failure to timely pay the Debentures could result in the eventual exercise of the rights of a secured creditor and the possible partial or total loss of the Companys assets and properties. Failure to procure required financing on acceptable terms could prevent the Company from developing the Prospect. If any of the preceding events were to occur, the Company could be forced to cease its operations, which could result in a complete loss of stockholders equity. If additional financing is not obtained through an equity or debt offering, the Company could find it necessary to sell all or some portion of the Prospect under unfavorable circumstances and at an undesirable price. However, no assurance can be provided that the Company will be able to find interested buyers or that the funds received from any such partial sale would be adequate to fund additional activities. Future liquidity will depend upon numerous factors, including the success of the Companys exploration and development program, satisfactory achievement of License commitments and capital raising activities.\nKnown Trends\nManagement believes that it has discerned the following trends relevant to the Company:\n* Management is monitoring the on-going volatility in the prices of Hydrocarbons. The invasion of Ukraine is the primary cause of this volatility, and the overall tread of price increases. The Companys base case scenario forecasts a Brent crude price averaging US$108 a barrel in 2022.\n* The average Brent price for 2021 was $US70 a barrel - up 67% from the 2020 average. A tight market supported the rally into early 2022 - with prices in January rising 15% month over month, to average US$86 a barrel. Prices grew by 12% month over month to average $US96 a barrel in February. Following Russias invasion, the risk of sustained energy supply shocks, and the imposition of sanctions, saw prices spike well over $US110 a barrel in May- the highest levels since July 2008.\n* While global oil output rose by 1.6% from 2020 levels to average 95 million barrels a day in 2021, inventories remain tight. The supply approach of OPEC+, combined with underperformance from some member nations, and a lagged recovery by some non-OPEC producers, led to falling global inventories, with OECD inventories reaching their lowest levels for seven years.\n* Global oil consumption in 2021 averaged 98 million barrels a day - this is 6.1% higher than in 2020, but 2.9% lower than in 2019. Consumption has been significantly impacted by the COVID-19 pandemic, with lockdowns and mobility restrictions affecting global industrial activity, commuting and leisure travel for significant periods.\n* As vaccination programs rolled out in 2021 and global economic growth rebounded, oil consumption began to recover. This recovery is set to continue in 2022, with consumption forecast to rise by 2.2% to reach 100 million barrels a day.\n* Australian oil consumption is forecast to recover to 2018-19 levels in 2021-22. For the rest of the outlook period, Australian oil consumption is projected to increase marginally, reaching 1.1 million barrels a day by 2025-26.\n* Australian crude oil and feedstock exports in 2021-22 are forecasted to increase by 1.7% to 281,000 barrels a day. Exports are projected to lift later in the outlook period, as a number of new oil projects come online.\n* Soaring oil prices are expected to lift Australian oil export earnings by 86% to $13.8 billion in 2021-22, with earnings then holding steady in 2022-23.\n(Sources: BREE - Resources and Energy Quarterly - March, 2022)\nOff-Balance Sheet Arrangements\nDuring the year ended February 28, 2022, the Company had no off-balance sheet arrangements. Item 7A Quantitative and Qualitative Disclosures About Market Risks\nNot applicable. Item 8. Financial Statements and Supplementary Data.\nThe report of the Companys independent auditors appears at page hereof, and the Companys financial statements appear starting at page through hereof. Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nUnder the supervision and with the participation of management, including the principal executive officer and principal financial officer, the evaluation of the effectiveness of the design and operation of disclosure controls and procedures pursuant to Exchange Act Rule 13a-15(e) and Rule 15d-15(e) as of the end of the period covered by this Annual Report was completed. Based on this evaluation, the principal executive officer and principal financial officer have determined that the lack of segregation of accounting duties as a result of limited personnel resources is a material weakness and an ineffective element of the Companys financial procedures. Therefore, the principal executive officer and principal financial officer believe that disclosure controls and procedures are not effective to ensure that information required to be disclosed by the Company in the reports filed or submitted under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the rules and forms of the SEC and that disclosure and controls designed to ensure that information required to be disclosed in Company filings or submitted under the Exchange Act is accumulated and communicated to management, including the principal executive officer and principal financial officer, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. With the recent implementation of a number of revised accounting and financial statement preparation and review processes, the financial controls of the Company have been improved. However, additional improvements in internal controls will be necessary to fully address remaining deficiencies and material weaknesses.\nLimitations on Effectiveness of Controls and Procedures\nCompany management, including the Chief Executive Officer and Chief Financial Officer do not expect that disclosure control procedures and/or internal controls will prevent all potential errors and/or all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, but not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected. These inherent limitations include, but are not limited to, the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple errors or mistakes. Additionally, controls can be circumvented by the actions or inactions of one or more individuals and/or by management override of various controls. The design of any system of controls is based in part upon certain assumptions about the likelihood of future events and there can be no assurance that any design will succeed in achieving stated goals under all potential future conditions. Over time, controls could become inadequate due to changes in internal and/or external conditions, or a deterioration in the degree of staff and/or systems compliance with the standards, policies and procedures of the Company.\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) promulgated under the Exchange Act) is a process designed by, or under the supervision of, the Companys principal executive officer and principal financial officer and effected by the Companys Board of Directors, management and other personnel to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles (GAAP). Internal control over financial reporting includes those policies and procedures that:\n* pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the Companys assets;\n* provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that the Companys receipts and expenditures are being made only in accordance with authorizations of management and the Companys Board of Directors; and\n* provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the Companys financial statements.\nBecause of its inherent limitations, a system of internal controls over financial reporting can provide only reasonable, but not absolute, assurance that the objectives of the control system are met and may not prevent or detect misstatements. Internal control over financial reporting is a process that involves human diligence and compliance and is subject to lapses in judgment and breakdowns resulting from human failures. Internal control over financial reporting also can be circumvented by collusion or improper override. Because of such limitations, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. However, these inherent limitations are known features of the financial reporting process, and process designs can incorporate safeguards to reduce, though not eliminate, this risk. Furthermore, over time controls may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of February 28, 2022. In making its assessment, management used the criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In performing the assessment, management noted the following:\n* There are an insufficient number of independent directors.\n* Lack of an independent audit committee.\n* Limited staffing and supervision within the bookkeeping and reporting activities precludes completely segregating duties within the Companys internal control system.\nBased on its assessment, management has concluded that the Company had certain control deficiencies described below that constituted material weaknesses in its internal control over financial reporting. As a result, the Companys internal control over financial reporting was not effective as of February 28, 2022. A material weakness is defined under SEC rules as a deficiency, or a combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of a companys annual or interim financial statements will not be prevented or detected on a timely basis by the Companys internal controls.\nManagement does not believe that the material weaknesses described above caused any meaningful or significant misreporting of its financial condition and results of operations for the fiscal year ended February 28, 2022. However, management does believe that the lack of independent directors, an independent audit committee and complete segregation of accounting duties results in ineffective oversight in the establishment and monitoring of required internal controls and procedures, which could result in a material misstatement in the Companys financial statements in future periods.\nManagement Plan to Remediate Material Weaknesses\nManagement is continuing to pursue additional corrective measures to address the material weaknesses described above. In an effort to remediate the identified material weaknesses and other deficiencies and enhance its internal controls, the Company has initiated, or plans to initiate, the following series of measures:\n* The Company will create a position to further segregate duties consistent with control objectives within the accounting function when funds are available.\n* The Company plans to add independent directors and an independent audit committee when funding is available for remuneration to induce experienced professionals to serve as such, thereby creating oversight over executive management.\n* Each professional engaged to fill one of these additional positions will have the necessary knowledge and experience to properly prepare, review and/or approve the Companys Financial Statements.\nThe Company believes the measures described above will remediate the material weaknesses the Company has identified and strengthen its internal control over financial reporting. The Company is committed to continuing to improve its internal control processes and will continue to diligently and vigorously review its financial reporting controls and procedures.\nChanges in Internal Control over Financial Reporting\nThere have been no significant changes in the Companys internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) during the most recent fiscal year that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting.\nThe COVID-19 pandemic has had no impact on the Companys internal controls over financial reporting. The Company had and continues to have the same staff, same service providers and same processes as was the case prior to the pandemic.\nAttestation Report\nAs permitted by SEC rules applicable to the Company, this Annual Report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Item 9B. Other Information.\nNot applicable.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nGeneral\nThe authorized number of our directors is presently fixed at three. Each director serves for a term of one year that expires at the following annual stockholders meeting. Each officer serves at the pleasure of the Board of Directors and until a successor has been qualified and appointed.\nThere are no family relationships, or other arrangements or understandings between or among any of the directors, executive officers or other person pursuant to which such person was selected to serve as a director or officer.\nCurrent Management\nOur directors and executive officers are as follows:\nName\nAge\nPositions\nKeith D. Spickelmier\nChairman of the Board\nKeith J. McKenzie\nDirector & Chief Executive Officer\nWilliam E. Begley\nDirector, President, Chief Operating Officer & Chief Financial Officer\nThe following is the background of current directors and executive officers of ours:\nKeith D. Spickelmier - Mr. Spickelmier has been a Director and our Chairman of the Board since May 2012. He is the Executive Chairman of Sintana Energy Inc. (SEI: TSX-V), a public company with Hydrocarbon operations in Columbia and Namibia. He is a co-founder of Blockmetrix LLC, a Bitcoin mining company, the co-founder of Mallard Cablevision, and the founder and Chairmen of Westside Energy Corporation, which was sold in June 2008 for approx. $200 million in enterprise value. Mr. Spickelmier was also the co-founder of JK Acquisition, a special purpose acquisition company which traded on the American Stock exchange in 2006 with an $80 million offering. Mr. Spickelmier was a co-founder of Northbrook which is now Sintana Energy Inc. He holds a B.A. from the University of Nebraska at Kearney and a J.D. from the University of Houston. He previously practiced law from 1986 to 2000.\nKeith J. McKenzie - Mr. McKenzie has been a Director and our Chief Executive Officer since January 2012. He has over 30 years of experience working with public companies in the Industrial and Resource sectors. Over the past 23 years in the Oil & Gas sector, Mr. McKenzie has been engaged in various executive, finance, start up, and consulting capacities. He was the CEO of Star Oil Company, a private start up Hydrocarbon Exploration Company he founded, in September 2009 to acquire Hydrocarbon resources in the United States. In 2004, he was a founding principal and later served as the Chief Operating Officer of Paxton Energy, Inc., with responsibility for the companys development and operations at the Cooke Ranch project located in La Salle County, Texas. Mr. McKenzie has consulted to numerous public and private Oil & Gas, Mining and industrial companies with both domestic and international operations.\nWilliam E. Begley - Mr. Begley has been our Chief Financial Officer since January 2012. He assumed the office of President and Chief Operating Officer in August 2018, initially on an interim basis. He has been a Director since May 2012. Mr. Begley has more than 30 years of energy industry and finance experience, beginning his career with British Petroleum (BP). Hes held senior positions in energy banking including Solomon, Inc. and was President of Stone & Webster Management Consulting, specializing in the design and development of major energy projects. As a leading energy advisor in Australia, Mr. Begley was instrumental in the development of the liberalized natural gas markets in Australia and Victoria specifically, with Gas & Fuel Victoria, and in the development of VENCorp, the natural gas trading and scheduling exchange in Australia. Mr. Begley also has a strong background in leading major capital energy projects including LNG, Methanol, and related petro-chemical and gas monetization projects, which will complement ongoing Company initiatives. In addition, he has also been involved in over $100 billion in energy related mergers and acquisitions, initially with Solomon, Inc. and more recently on an independent basis through WEBGruppe GmbH. Mr. Begley served as Chief Financial Officer and Treasurer for Magellan Petroleum Corporation. His graduate JD/MBA studies are in international business and energy law. Mr. Begley graduated in 1976 with a B.A. from St. Michaels College in Vermont.\nQualifications of Directors\nA description of the specific experience, qualifications, attributes, or skills that led to the conclusion that each of the incumbent directors listed above should serve as one of our directors is presented below.\nKeith D. Spickelmier - Since 2004, Mr. Spickelmier has served as Chairman of two publicly traded Hydrocarbon exploration and production companies, one of which he continues to serve as such. Moreover, he has an extensive transactional, legal and regulatory compliance background, which augments his actual experience as a Chairman. As a result, we believe that Mr. Spickelmier is amply qualified to serve as one of our directors.\nKeith J. McKenzie - Mr. McKenzie has extensive experience with Hydrocarbon exploration and production companies, and with publicly traded companies in a variety of capacities, including as an executive officer and a consultant. He is extremely knowledgeable about transactional matters involving Hydrocarbon exploration and production companies, and the regulatory compliance relating to publicly traded companies. As a result, we believe that Mr. McKenzie is amply qualified to serve as one of our directors.\nWilliam E. Begley - Mr. Begley has extensive experience with Hydrocarbon exploration and production companies, and with a number of publicly traded companies. His extensive experience with Hydrocarbon matters in Australian and other international activities is particularly significant to us. Moreover, Mr. Begley has an extensive background in finance, including service as the Chief Financial Officer of a junior, publicly traded Hydrocarbon exploration and production company. Furthermore, he has extensive experience with merger and acquisition transactions. As a result, we believe that Mr. Begley is amply qualified to serve as one of our directors.\nBoard Leadership Structure and Role in Risk Oversight\nIn early May 2012, our Board of Directors elected Keith D. Spickelmier as the Chairman of the Board. Initially, Mr. Spickelmier did act in an executive capacity. During the remainder of fiscal 2013, Mr. Spickelmier emerged as a driving force behind our companys business, and he is now serving as our Executive Chairman. In such capacity, Mr. Spickelmier continues to have typical board chair duties, such as serving as a liaison between the other board members and management, reviewing and approving materials to be presented to the board, working with management and other directors to develop agendas for board meetings, helping build consensus on proposed board actions, and serving as the chair of board and stockholder meetings. However, as executive chairman, Mr. Spickelmiers duties are broader than for a non- executive chairman, and he will continue to have an active role in developing and implementing business strategy . Moreover, Mr. Spickelmier is expected to continue to provide hand on assistance in our high-level pursuits, especially pertaining to financing and other extraordinary corporate transactions.\nKeith J. McKenzie remains our Chief Executive Officer. While Messrs. Spickelmier and McKenzies duties may overlap on occasion, Mr. McKenzie will be more responsible for our operations. We believe a board leadership structure involving one person serving as executive chairman and another as chief executive officer is best for our company and our stockholders. We believe this structure achieves a greater degree of independence in the leadership of the Board without losing the benefit of Mr. Spickelmiers business skills and leadership capabilities. Further, we believe this separation improves the Boards oversight of management, provides greater accountability of management to stockholders, and allows the chief executive officer to focus on managing our business operations, while allowing the executive chairman to focus on more effectively leading the Board and overseeing our general strategic direction and extraordinary transactions.\nThe Board of Directors is legally responsible for managing our business and affairs, including the oversight of risks that could affect us. The full Board has not delegated the oversight of risks to any committees. Because of its current size and composition, the Board is not able to have executive sessions during which executive management is not present and managements performance can be discussed and evaluated openly by independent Directors. The Board believes that, as it adds independent directors in the future, it will adopt the practice of holding executive sessions. However, the timing of the expansion of the Board to include independent directors is currently uncertain.\nCommittees and Director Selection\nUntil the change in our business focus in January 2012, we had been a shell company as defined in the Rule 405 of the Securities Act of 1933, as amended, and Rule 12b-2 of the Securities Exchange Act of 1934, as amended (the Exchange Act). As a result, we did not need and did not implement extensive corporate governance procedures. Our current management intends to adopt such procedures in due course whenever funds are available therefor.\nOur Board of Directors has not established any standing committees, including an Audit Committee, Compensation Committee or a Nominating Committee. The Board of Directors as a whole undertakes the functions of those committees. Our Board of Directors believes that its decision not to establish any standing committees has been appropriate due to our prior status as a shell company and our limited operational activities to date. The Board of Directors expects to establish one or more of the preceding committees whenever it believes that doing so would benefit us.\nOur full Board of Directors now serves as the Audit Committee, which consists of our three directors. Our Board of Directors has determined that each of Keith D. Spickelmier and William E. Begley qualifies as an audit committee financial expert, as such term is defined by rules of the U.S. Securities and Exchange Commission. Neither of Messrs. Spickelmier or Begley is independent, as is discussed below.\nBecause we do not have a standing nominating committee, our full Board of Directors is responsible for identifying new candidates for nomination to the Board. We have not adopted a policy that permits stockholders to recommend candidates for election as directors or a process for stockholders to send communications to the Board of Directors. Our Board of Directors believes that its decision not to establish the preceding policy and process has been appropriate due to our prior status as a shell company and our limited operational activities to date. The Board of Directors expects to establish such a policy and such a process whenever it believes that doing so would benefit us.\nBecause we do not have a standing compensation committee, our full Board of Directors will undertake the functions of a compensation committee if any executive officer and director compensation is considered in the immediate future. We do not now have any processes and procedures for the consideration and determination of executive and director compensation.\nCode of Ethics\nWe have adopted a code of ethics that applies to our Chief Executive Officer, Chief Financial Officer, Principal Executive Officer, Principal Financial Officer, Principal Accounting Officer, Treasurer, Controller and persons performing similar functions within our company. A copy of the code of ethics is filed with the SEC as an exhibit to our Form S-1 filed on July 14, 2008. A copy of the code of ethics can be obtained from us by a written request sent to Discovery Energy Corp., One Riverway Drive, Suite 1700, Houston, Texas 77056, and Attention: Corporate Secretary. If we make any substantive amendments to the Code of Ethics or grant any waiver, including any implicit waiver, from a provision of the Code of Ethics to our directors, officers and employees, we will disclose the nature of such amendment or waiver in a report on Form 8-K.\nDelinquent Section 16(a) Reports\nSection 16(a) of the Exchange Act requires that our officers and directors, and persons who beneficially own more than ten percent of a registered class of our equity securities, file reports of ownership and changes in ownership with the U.S. Securities and Exchange Commission and furnish us with copies of all such Section 16(a) forms. To the best of our knowledge based solely on information available to us, no person required to file such reports failed to file any such reports or filed any such reports late. Item 11. Executive Compensation.\nThe following table sets forth the compensation during the fiscal years ended February 28, 2022 and February 28, 2021 for our chief executive officer and other officers whose total compensation exceeded $100,000. The executive officers listed in the table below are referred to as the Named Executive Officers.\nSummary Compensation Table (1)\nName and principal position Year Salary ($) Bonus ($) Stock Awards ($) All other Compensation ($) Total ($)\nKeith D. Spickelmier, $ -0- $ -0- $ -0- $ 165,000 (2) $ 165,000\nChairman of the Board $ 137,500 (3) $ -0- $ -0- $ 27,500 (4) $ 165,000\nKeith J. McKenzie, $ -0- $ -0- $ -0- $ 150,000 (5) $ 150,000\nChief Executive Officer $ -0- $ -0- $ -0- $ 150,000 (5) $ 150,000\nWilliam E. Begley $ 150,000 (6) $ -0- $ -0- $ $ 150,000\nPresident, Chief Financial,\nOfficer and Chief Operating Officer $ 150,000 (7) $ -0- $ -0- $ $ 150,000\n(1)\nThe Columns designated by the Securities and Exchange Commission for the reporting of certain option awards, non-equity incentive plan compensation, and nonqualified deferred compensation earnings have been eliminated as no such awards or compensation were made to, earned by, or paid to or with respect to any person named in the table during any fiscal year covered by the table.\n(2) Represents a director fee in the amount of $90,000 and additional set consulting fees in the amount of $75,000. Of this amount, $5,414 was actually paid, and the remaining $159,586 was accrued.\n(3) Of this amount, $35,734 was actually paid, and the remaining $101,766 was accrued\n(4) Represents consulting fees, all of which were accrued. For a portion of fiscal 2021, Mr. Spickelmier was an employee.\n(5) Represents consulting fees, all of which were accrued.\n(6) All of this amount was accrued.\n(7) Of this amount, $5,873 was actually paid, and the remaining $144,127 was accrued.\nCompensation Agreements with Key Personnel\nWe entered into two consulting agreements and one employment agreement (singly, a Remuneration Agreement, and collectively, the Remuneration Agreements) with several persons serving as our directors and officers. These persons include the individuals named in the following table, who will be receiving the annual remuneration set forth in this table:\nName Position Amount of Annual Remuneration Type of\nRemuneration\nKeith D. Spickelmier Chairman of the Board $ 165,000 (1)\nKeith J. McKenzie Director & Chief Executive Officer $ 150,000 Consulting Fees\nWilliam E. Begley Director, President, Chief Operating Officer & Chief Financial Officer $ 150,000 Salary\n(1) $90,000 as a base retainer for services as director and Chairman of the Board, and $75,000 as an annual additional services retainer for expected additional duties and responsibilities to be requested\nEach Remuneration Agreement contains the following terms, provisions and conditions, whether it be a consulting agreement or an employment agreement:\n* An indefinite term that lasts until the Remuneration Agreement is terminated as follows:\n** By us, for events customarily designated as good cause\n** By us, without good cause, provided that we pay to the related director or officer a lump sum payment comprised essentially of all earned or accrued (but unpaid) remuneration to the date of termination, plus an additional year of remuneration, including the annual remuneration amount and a bonus computed on the basis of the highest declared bonus in the past three fiscal years\n** By the related director or officer, for events customarily designated as good reason\n** By the related director or officer, without good reason upon a minimum of 60-days advance written notice\n** Upon the death of the related director or officer\nMoreover, if after a change of control of our company, the employment or engagement of the related director or officer is terminated within certain time periods thereafter either by such director or officer, or by us without good cause, then such director or officer will be entitled to a termination fee equal essentially to two additional years of remuneration, including the annual remuneration amount and a bonus computed on the basis of the highest declared bonus in the past three fiscal years.\n* Each Remuneration Agreement is effective retroactively to March 1, 2019, and we began to accrue as of such date the annual remuneration amount provided for in each Remuneration Agreement, provided, however, we did make actual cash payments of a portion of the consulting fees of Keith J. McKenzie, a Director and our Chief Executive Officer, under his Remuneration Agreement.\n* The related director or officer shall be (or may become) entitled to:\n** receive a cash or equity discretionary bonus\n** participate in all benefits plans provided to employees\n** participate in any equity incentive plan that we have established or in the future establish\n* Each director or officer who is a party to a Remuneration Agreement shall be prohibited, for a period of six months after the termination thereof, from soliciting or inducing any person employed by or under contract with us at the date of such termination to terminate his, her or its employment or contractual relationship with us\n* Each Remuneration Agreement for a U.S. citizen contains provisions requiring us to make whole any director or officer who is a party thereto with respect to any excise tax resulting from any payment upon a change of control of our company that is deemed to be a parachute payment within the meaning of Section 280G of the U.S. Internal Revenue Code of 1986, as amended (the Code). Moreover, each Remuneration Agreement for a U.S. citizen contains provisions relating to any payment of any compensation or benefit thereunder that would be subject to additional taxes and interest under Section 409A of the Code.\n* Other terms, provisions and conditions believed to be customary, such as those pertaining to expense reimbursement, return of company property, confidentiality and developed inventions\nOther Compensation Matters\nWe have not adopted any retirement, pension, profit sharing, or insurance programs or other similar programs for the benefit of our management or employees. We adopted an equity incentive plan in which our management or employees could have participated, but this plan expired in July 2022. In the first quarter of fiscal 2020, pursuant to this equity incentive plan, we made awards of an aggregate of 3.3 million unrestricted shares to a total of five Company or Subsidiary officers, having an aggregate determined value of $660,000.\nDirector Compensation\nSince we adopted our current business plan in 2012, we have not had any standard compensation arrangements for our directors as a group. However, we have paid fees and bonuses to certain of our directors for providing consulting services to us, and we have paid salaries and bonuses to certain of our directors who also serve as employees. Moreover, beginning with fiscal 2020, we have paid to Keith D. Spickelmier the annual sum of $90,000 as a base retainer for services as director and Chairman of the Board.\nExpense Reimbursement\nOur officers and directors out-of-pocket expenses were accrued and reimbursed in connection with activities on our behalf during the past two fiscal years. No limit was placed on the amount of these out-of-pocket expenses, and no review was conducted of the reasonableness of the expenses by anyone other than by our Board of Directors, which included persons entitled to reimbursement. We did not have the benefit of independent directors examining the propriety of expenses incurred on our behalf and subject to reimbursement. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related STOCKholder Matters.\nSecurity Ownership of Certain Beneficial Owners and Management\nThe table set forth below contains certain information as of November 30, 2022 concerning the beneficial ownership of common shares (i) by each person who is known by the Company to own beneficially more than 5% of the outstanding common shares; (ii) by each director and executive officer; and (iii) by all directors and executive officers as a group. Except as otherwise indicated, all persons listed below have (i) sole voting power and investment power with respect to their shares, except to the extent that authority is shared by spouses under applicable law, and (ii) record and beneficial ownership with respect to their shares. Shares not outstanding but deemed beneficially owned by virtue of the right of a person or member of a group to acquire them within 60 days of November 30, 2022 are treated as outstanding only for determination of the number and percent owned by such group or person. Unless otherwise indicated, the address for all persons listed in the table is One Riverway Drive, Suite 1700, Houston, Texas 77056.\nBeneficial Ownership (1)\nName of Beneficial Owner Number Percent\n5% non-management stockholders:\nDEC Funding LLC (2) 79,880,851 34.10 %\nSteven Webster (3) 85,221,434 36.38 %\nDirectors and executive officers:\nKeith D. Spickelmier 49,500,000 32.07 %\nKeith J. McKenzie 35,730,460 23.15 %\nWilliam E. Begley 11,389,274 7.36 %\nAll directors and executive officers as a group (three persons) 96,619,734 62.59 %\n(1) Includes shares beneficially owned pursuant to options, warrants and convertible securities exercisable or convertible within 60 days.\n(2) Includes 52,003,793 shares that may be acquired upon the conversion of currently outstanding Debentures and the Payment In Kind (PIK) interest earned thereupon, and 27,877,058 shares that may be acquired upon the exercise of currently exercisable warrants. The percentage ownership figure for this stockholder assumes all of the Debentures are converted and all of the warrants are exercised: the percentage ownership figures for management do not assume these matters, and such figures would be reduced to the extent that such Debentures are converted and such warrants are exercised. Steven Webster is a manager of DEC Funding LLC (DECF). In such capacity, Mr. Webster has shared voting and shared dispositive power of the shares included in the table, and as a result, he may be deemed to beneficially own these shares. Consequently, all of these shares are also included in the table for Mr. Webster. The address for DECF is 3200 Southwest Fwy, Suite 1490, Houston, Texas 77027. The information contained in this footnote is based on information known to us and other information contained in certain filings made by DECF with the U.S. Securities and Exchange Commission indicating that DECF owns no shares of which we are not aware.\n(3) Includes 5,340,583 shares owned outright with respect to which Mr. Webster has sole voting and sole dispositive power. Also includes the 79,880,851 included in the table for DECF because (as a manager of DECF) Mr. Webster may be deemed to beneficially own these shares. The percentage ownership figure for this stockholder assumes all of DECFs Debentures are converted and all of DECFs warrants are exercised: the percentage ownership figures for management do not assume these matters, and such figures would be reduced to the extent that such Debentures are converted and such warrants are exercised. The address for Mr. Webster is 3200 Southwest Fwy, Suite 1490, Houston, Texas 77027. The information contained in this footnote is based on information known to us and other information contained in certain filings made by Mr. Webster with the U.S. Securities and Exchange Commission indicating that Mr. Webster owns no shares of which we are not aware.\nPotential Change in Control Situation\nThe Company believes that its outstanding Debentures have created a situation, whereby, a change in control of the Company in favor of the largest holder of the Debentures (the Largest Debentures Holder) could (but would not necessarily) occur under the following circumstances:\n* the Largest Debentures Holder fully converts all of its Debentures, and the Largest Debentures Holder fully exercises all of the Warrants that have been issued in its favor; and\n* The Company does not issue a significant number of equity securities prior to the two preceding events.\nUnder the circumstance listed above and assuming that the Company does not elect to pay any interest on any Debentures in cash, but allows all such interest to be added to principal, an aggregate of 85,302,697 of its common shares would be issued to the Largest Debentures Holder, representing approximately 35.59% of the Companys outstanding common shares after the issuance based on the number of shares currently outstanding and assuming the Largest Debentures Holder acquires no additional common shares of the Company. Moreover, an affiliate of the Largest Debentures Holder also owns 5,340,583 of the Companys common shares. Combining these shares with those that the Largest Debentures Holder may acquire per the conversion of its Debentures and the exercise of its Warrants, the Largest Debentures Holder and such affiliate would own approximately 90,648,280 or 37.82% of the outstanding Common Shares after the Largest Debentures Holder fully converts of all of its Debentures and fully exercises all of its Warrants. In such event, the Largest Debentures Holder would become the Companys largest stockholder, assuming no significant purchases of its common shares by other persons. This development in itself will not give control of the Company to the Largest Debentures Holder, as the current members of management collectively own a greater number of shares than this. However, this number of common shares would allow the Largest Debentures Holder to have substantial sway with respect to the Companys affairs and would give to the Largest Debentures Holder shared control of the Company if the Largest Debentures Holder and one or more large stockholders were to agree to act as a group. Whether or not this would ever occur cannot be known at this time. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nRelated Party Transactions Policies\nWe have not adopted any policies and procedures for the review, approval, or ratification of any related party transactions. Our current management intends to adopt such procedures in due course whenever funds are available therefor.\nIndependence of Directors\nNasdaq Marketplace Rule 4200(a)(15) sets forth the standards regarding director independence for companies with securities included for trading in the NASDAQ Stock Market (the NASDAQ). Although our securities are not included for trading in the NASDAQ, we use the standards set forth in Rule 4200(a)(15) for determining whether or not each of our directors is independent. We have determined that, as of the date of this Annual Report, none of our directors is independent in accordance with the Rule 4200(a)(15) independence standards. Item 14. Principal Accountant Fees and Services\nThe following table presents fees for professional audit services performed by Marcum LLP for the audit of our annual financial statements for the fiscal years ended February 28, 2022 and February 28, 2021:\nYear Ended\nLast Day of February\nAudit Fees (1) $ 84,494 $ 70,420\nAudit-Related Fees N/A N/A\nTax Fees N/A N/A\nAll Other Fees N/A N/A\n(1) Fees for audit services include fees associated with the annual audit and the review of our quarterly reports on Form 10-Q.\nAudit Committee Pre-Approval of Audit and Permissible Non-Audit Services of Independent Registered Public Accounting Firm.\nThe Company does not have an audit committee, but our entire Board of Directors functions as such. Our Board of Directors pre-approves all audit and permissible non-audit services provided by our independent registered public accounting firm. These services may include audit services, audit-related services and tax services, as well as specifically designated non-audit services that, in the opinion of the Board of Directors, will not impair the independence of the independent registered public accounting firm. Our Board of Directors annually reviews the audit and permissible non-audit services performed by our independent registered public accounting firm, and reviews and approves the fees charged by it. Our Board of Directors has considered the role of our independent registered public accounting firm in providing tax and audit services and other permissible non-audit services to us and has concluded that the provision of such services was compatible with the maintenance of the independence of our independent registered public accounting firm in the conduct of its auditing functions.\nPART IV Item 15. Exhibits, Financial Statement Schedules.\n(a)(1)\nThe following Financial Statements are filed as part of this Report.\nReport of Independent Registered Public Accounting Firms (PCAOB ID Number 688)\nConsolidated Balance Sheets as of February 28, 2022 and February 28, 2021\nConsolidated Statements of Operations and Comprehensive Loss for the Years Ended February 28, 2022 and February 28, 2021\nConsolidated Statements of Shareholders Deficit for the Years Ended February 28, 2022 and February 28, 2021\nConsolidated Statements of Cash Flows for the Years Ended February 28, 2022 and February 28, 2021\nNotes to Consolidated Financial Statements\n(a)(3) The following Exhibits are filed as part of this Report.\nExhibit No.\nDescription\n3.1\nFirst Amended and Restated Articles of Incorporation are incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on May 11, 2012, Exhibit 3.1.\n3.2\nBy-laws are incorporated herein by reference to our Registration Statement on Form S-1 (SEC File No. 333-152324) filed with the SEC on July 14, 2008, Exhibit 3.2.\n4.1\nSpecimen stock certificate is incorporated herein by reference to our Annual Report on Form 10-K for fiscal 2020 (SEC File No. 000-53520) filed with the SEC on July 17, 2020, Exhibit 4.1.\n10.1\nNovation Deed dated May 15, 2012 by and between Liberty Petroleum Corporation and Registrant in respect of Option to Purchase and Sale and Purchase Agreement dated January 31, 2012 is incorporated herein by reference to our Annual Report on Form 10-K for fiscal 2012 (SEC File No. 000-53520) filed with the SEC on June 12, 2012 Exhibit 10.7\n10.2\nDeed (Pursuant to Section 31 of the Native Title Act 1993) among (a) Honorable Tom Koutstantonis, Minister for Mineral Resources and Energy, for and on behalf of the State of South Australia, (b) Discovery Energy SA Ltd, (c) Edward Lander, Rhonda Gepp-Kennedy, one signatory whose name was withheld for cultural reasons, Sylvia Stuart, Irene Kemp and David Mungerannie, for and on behalf of the Dieri Native Title Holders, and (d) the Dieri Aboriginal Corporation is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on September 7, 2012, Exhibit 10.1\n10.3\nSecurities Purchase Agreement dated May 27, 2016 between us and DEC Funding LLC (Original Investor) is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on June 2, 2016, Exhibit 10.01\n10.4\nForm of Debenture dated May 27, 2016 and executed by us in favor of Original is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on June 2, 2016, Exhibit 10.02\n10.5\nForm of Warrant Agreement dated May 27, 2016 and executed by us in favor of Original Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on June 2, 2016, Exhibit 10.03\n10.6\nSecurity Agreement dated May 27, 2016 and executed by us in favor of Original Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on June 2, 2016, Exhibit 10.04\n10.7\nAustralian Specific Security Agreement (Shares) dated May 27, 2016 and executed by us in favor of Original Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on June 2, 2016, Exhibit 10.05\n10.8\nAustralian General Security Agreement dated May 27, 2016 and executed by Discovery Energy SA Limited in favor of Original Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on June 2, 2016, Exhibit 10.06\n10.9\nAustralian Deed of Guarantee and Indemnity dated May 27, 2016 and executed by Discovery Energy SA Limited in favor of Original Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on June 2, 2016, Exhibit 10.07\n10.10\nRegistration Rights Agreement dated May 27, 2016 and executed by us in favor of Original Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on June 2, 2016, Exhibit 10.08\n10.11\nFirst Amendment to Securities Purchase Agreement among us, Original Investor and Texican Energy Corporation (New Investor) is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on August 22, 2016, Exhibit 10.01\n10.12\nForm of Debenture executed by us in favor of Original Investor and the New Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on August 22, 2016, Exhibit 10.02\n10.13\nForm of Warrant Agreement dated August 16, 2016 and executed by us in favor of Original Investor and the New Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on August 22, 2016, Exhibit 10.03\n10.14\nAustralian Specific Security Agreement (Shares) dated August 16, 2016 and executed by us in favor of Original Investor and the New Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on August 22, 2016, Exhibit 10.04\nExhibit No.\nDescription\n10.15\nAustralian Security Agreement dated August 16, 2016 and executed by us in favor of Original Investor and the New Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on August 22, 2016, Exhibit 10.05\n10.16\nAustralian Deed of Guarantee and Indemnity dated August 16, 2016 and executed by Discovery Energy SA Limited in favor of New Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on August 22, 2016, Exhibit 10.06\n10.17\nForm of Debenture executed by us in favor of New Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on January 5, 2017, Exhibit 10.01\n10.18\nSecond Amendment to Securities Purchase Agreement among us, Original Investor and New Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on February 17, 2017, Exhibit 10.01\n10.19\nThird Amendment to Securities Purchase Agreement, Amendment to Debentures and Affirmation of Security Documents among us, Discovery Energy SA Pty Ltd, Original Investor and New Investor is incorporated herein by reference to our Current Report on Form 8-K (SEC File No. 000-53520) filed with the SEC on September 25, 2017, Exhibit 10.01\n10.20\nFirst Amendment to Senior Secured Convertible Debenture is incorporated herein by reference to our Annual Report on Form 10-K for fiscal 2019 (SEC File No. 000-53520) filed with the SEC on May 15, 2019, Exhibit 10.21.\n10.21\nFourth Amendment to Securities Purchase Agreement and Amendment to Debentures among Discovery, Discovery Energy SA Ltd., DEC Funding LLC and Texican Energy Corporation is incorporated herein by reference to our Quarterly Report on Form 10-Q for quarter ended November 30, 2019 (SEC File No. 000-53520) filed with the SEC on January 21, 2020, Exhibit 10.3.\n10.22\nConsulting letter agreement dated January 10, 2020, but fully executed on February 23, 2020 and effective as of March 1, 2019 by and between Keith D. Spickelmier and the Company is incorporated herein by reference to our Annual Report on Form 10-K for fiscal 2020 (SEC File No. 000-53520) filed with the SEC on July 17, 2020, Exhibit 10.22.\n10.23\nConsulting letter agreement dated January 10, 2020, but fully executed on March 26, 2020 and effective as of March 1, 2019 by and between Keith J. McKenzie and the Company is incorporated herein by reference to our Annual Report on Form 10-K for fiscal 2020 (SEC File No. 000-53520) filed with the SEC on July 17, 2020, Exhibit 10.23.\n10.24\nEmployment letter agreement dated January 10, 2020, but fully executed on February 23, 2020 and effective as of March 1, 2019 by and between William E. Begley and the Company is incorporated herein by reference to our Annual Report on Form 10-K for fiscal 2020 (SEC File No. 000-53520) filed with the SEC on July 17, 2020, Exhibit 10.24.\n10.25\nSecond Amendment to Debentures and Amendment to Warrants among Discovery, Discovery Energy SA Ltd., DEC Funding LLC and Texican Energy Corporation - is incorporated herein by reference to our Annual Report on Form 10-K for fiscal 2021 (SEC File No. 000-53520) filed with the SEC on June 16, 2021, Exhibit 10.25.\n14.1\nCode of Ethics is incorporated herein by reference to our Registration Statement on Form S-1 (SEC File No. 333-152324) filed with the SEC on July 14, 2008, Exhibit 14.1.\n21.1\nSubsidiaries - filed herewith.\n31.01\nSarbanes Oxley Section 302 Certifications - filed herewith.\n31.02\nSarbanes Oxley Section 302 Certifications - filed herewith.\n32.01\nSarbanes Oxley Section 906 Certifications - filed herewith.\n101.INS\nInline XBRL Instance Document - filed herewith.\n101.SCH\nInline XBRL Taxonomy Extension Schema - filed herewith.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase - filed herewith.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase - filed herewith.\n101.LAB\nInline XBRL Taxonomy Extension Labels Linkbase - filed herewith.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase - filed herewith.\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nItem 16. Form 10-K Summary\nNone.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of\nDiscovery Energy Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Discovery Energy Corp. (the Company) as of February 28, 2022 and 2021, the related consolidated statements of operations and comprehensive loss, stockholders deficit and cash flows for each of the two years in the period ended February 28, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of February 28, 2022 and 2021 and the results of its operations and its cash flows for each of the two years in the period ended February 28, 2022, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph - Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As more fully described in Note 3, the Company has a significant working capital deficiency, has incurred significant losses and needs to raise additional funds to meet its obligations and sustain its operations. These conditions raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nEvaluation of unproved oil and gas properties\nAs of February 28, 2022, the net carrying value of the Companys unproved oil and gas properties was $2.9 million. As described in Notes 2 and 4 to the consolidated financial statements, the Company performs impairment tests with respect to its unproved oil and gas properties when events or circumstances indicate that the carrying value of the property may not be recoverable. The Company periodically reviews unproved properties for impairments by considering numerous factors, including but not limited to, current exploration and development plans, favorable or unfavorable exploration activity, geologists evaluation of the property, the current and projected political and regulatory climate, and the remaining lease term for the property.\nWe identified the evaluation of the fair value of certain unproved oil and gas properties as a critical audit matter. A high degree of subjectivity is involved in evaluating the results of the Companys analysis.\nWe performed procedures to address this critical audit matter. These procedures included obtaining an understanding of the Companys controls over its unproved oil and gas impairment process, including controls related to the key assumptions used in the Companys analysis. These procedures also included, among others, evaluating the reasonableness of the Companys assessment, including a review of the lease agreements, lease term, exploration and development plans, exploration activity, evaluations from geologists engaged by the Company, and the related political climate.\n/s/ Marcum llp\nMarcum LLP\nWe have served as the Companys auditor since 2016.\nHouston, Texas\nDecember 6, 2022\nDiscovery Energy Corp.\nConsolidated Balance Sheets\nFebruary 28, 2022 February 28, 2021\nAssets\nCurrent Assets\nCash $ 5,242 $ 9,752\nPrepaid expenses 17,847 7,909\nTax receivable\nTotal Current Assets 23,115 17,675\nOil and gas property - not subject to amortization (successful efforts method) 2,883,915 2,883,915\nOther assets 35,910 39,145\nTotal Assets $ 2,942,940 $ 2,940,735\nLiabilities and Shareholders Deficit\nCurrent Liabilities\nAccounts payable and accrued liabilities $ 4,398,839 $ 3,322,321\nAccounts payable - related parties, net 1,988,230 1,273,030\nNotes payable 4,131 -\nTotal Current Liabilities 6,391,200 4,595,351\nNotes payable, less current portion 120,000 118,750\nConvertible debentures payable, net of debt discount 5,917,745 5,394,596\nTotal Liabilities 12,428,945 10,108,697\nCommitments and Contingencies (Note 8) - -\nShareholders Deficit\nPreferred stock - 10,000,000 shares authorized, zero issued and outstanding - -\nCommon stock - 500,000,000 shares authorized, $0.001 par value - 154,365,396 shares issued and outstanding 154,365 154,365\nAdditional paid-in capital 24,199,651 24,199,651\nAccumulated other comprehensive income 156,834 139,760\nAccumulated deficit (33,996,855 ) (31,661,738 )\nTotal Shareholders Deficit (9,486,005 ) (7,167,962 )\nTotal Liabilities and Shareholders Deficit $ 2,942,940 $ 2,940,735\nThe accompanying notes are an integral part of these consolidated financial statements.\nDiscovery Energy Corp.\nConsolidated Statements of Operations and Comprehensive Loss\nFor the Years Ended February 28, 2022 and 2021\nYear Ended\nYear Ended\nFebruary 28, 2022 February 28, 2021\nOperating Expenses\nGeneral and administrative $ 1,185,161 $ 3,718,698\nExploration costs 4,813 36,600\nTotal operating expenses 1,189,974 3,755,298\nOperating loss (1,189,974 ) (3,755,298 )\nOther Income (Expense)\nInterest expense (1,246,866 ) (2,328,346 )\nGain on forgiveness of PPP loan 101,723\nMiscellaneous income -\nGain on foreign currency transactions - (77 )\nOther expenses (1,145,143 ) (2,328,415 )\nNet loss $ (2,335,117 ) $ (6,083,713 )\nLoss per common share - basic and diluted $ (0.02 ) $ (0.04 )\nWeighted average number of common shares outstanding - basic and diluted 154,365,396 154,239,780\nComprehensive Income (Loss)\nNet loss $ (2,335,117 ) $ (6,083,713 )\nOther comprehensive income (loss) - gain on foreign currency translation 17,074 (14,439 )\nTotal comprehensive loss $ (2,318,043 ) $ (6,098,152 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nDiscovery Energy Corp.\nConsolidated Statements of Shareholders Deficit\nFor the Years Ended February 28, 2022 and 2021\nCommon Stock Additional\nAccumulated\nOther\nTotal\nShareholders\nNumber Par Value Paid-In\nCapital\nAccumulated\nDeficit\nComprehensive\nIncome\nEquity\n(Deficit)\nBalance, February 29, 2020 153,840,396 $ 153,840 $ 20,447,198 $ (25,578,025 ) $ 154,199 $ (4,822,788 )\nDebt discount from warrants\n942,812 - - 942,812\nWarrant modification expense -\n2,710,166 - - 2,710,166\nSale of common stock 525,000 99,475 - - 100,000\nNet loss for the year - -\n(6,083,713 ) - (6,083,713 )\nLoss on foreign currency translation -\n- - (14,439 ) (14,439 )\nBalance, February 28, 2021 154,365,396 $ 154,365 $ 24,199,651 $ (31,661,738 ) $ 139,760 $ (7,167,962 )\nNet loss for the year\n(2,335,117 )\n(2,335,117 )\nGain on foreign currency translation - - - - 17,074 17,074\nBalance, February 28, 2022 154,365,396 $ 154,365 $ 24,199,651 $ (33,996,855 ) $ 156,834 $ (9,486,005 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nDiscovery Energy Corp.\nConsolidated Statements of Cash Flows\nFor the Years Ended February 28, 2022 and 2021\nYear Ended\nFebruary 28, 2022\nYear Ended\nFebruary 28, 2021\nCash flows from operating activities\nNet loss $ (2,335,117 ) $ (6,083,713 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nAmortization of debt discount 448,149 1,592,604\nGain on forgiveness of PPP loan (101,723 ) -\nWarrant modification expense - 2,710,166\nForeign currency transaction loss -\nChanges in operating assets and liabilities:\nPrepaid expenses (9,938 ) 26,571\nTax receivable (12 )\nAccounts payable and accrued liabilities 1,074,845 1,092,380\nAccounts payable - related party, net 715,200 458,631\nNet cash used in operating activities (208,596 ) (202,674 )\nCash flows from financing activities\nProceeds from borrowings on notes payable 120,000 118,750\nProceeds from sale of common stock - 100,000\nProceeds from borrowings on convertible debt 75,000 -\nPayments on borrowings of promissory notes (7,988 ) -\nNet cash flows provided by financing activities 187,012 218,750\nEffect of foreign currency translation on cash 17,074 (14,439 )\nChange in cash during the period (4,510 ) 1,637\nCash, beginning of the year 9,752 8,115\nCash, end of the year $ 5,242 $ 9,752\nSupplemental disclosures:\nInterest paid $ 1,692 $ -\nIncome taxes paid $ - $ -\nNoncash investing and financing activities:\nWarrants granted from debt modification $ - $ 942,812\nThe accompanying notes are an integral part of these consolidated financial statements.\nDiscovery Energy Corp.\nNotes to the Consolidated Financial Statements\n1. Nature of Operations\nThe principal business of Discovery Energy Corp. (Company) is the exploration and development of the 584,651 gross acres (914 sq. miles) in South Australia (Prospect) covered by Petroleum Exploration License PEL 512 (License). In May 2012, the Company incorporated a wholly-owned Australian subsidiary, Discovery Energy SA Ltd., for the purpose of acquiring a 100% working interest in the License. On May 25, 2016, its status changed from a public to a private legal entity and its name changed to Discovery Energy SA Pty Ltd. (Subsidiary). To date, the Company has not determined whether or not the Prospect, which overlies portions of the Cooper and Eromanga basins, contains any crude oil and/or natural gas reserves that are economically recoverable. While the Companys present focus is on the Prospect, it may consider pursuing other attractive crude oil and/or natural gas exploration opportunities.\n2. Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying audited interim consolidated financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America (GAAP) and the rules of the U.S. Securities and Exchange Commission (SEC).\nPrinciples of Consolidation\nThese consolidated financial statements include the accounts of the Company and the Subsidiary. Inter-company transactions and balances have been eliminated upon consolidation.\nUse of Estimates\nThe preparation of these financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities as of the date of these financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid instruments with a maturity of three months or less at the time of acquisition to be cash equivalents. The Company maintains its cash in bank accounts which, at times, may exceed federally insured limits as guaranteed by the Federal Deposit Insurance Corporation. As of February 28, 2022, approximately $5,200 of the Companys cash balances were uninsured, related to the Companys Australian subsidiary. The Company has not experienced any losses on such accounts.\nThere were no cash equivalents as of February 28, 2022\nLeases\nThe Companys lease consists primarily of office spaces on a month-to-month basis. The Company recognize office lease expense as incurred.\nOil and Gas Property and Exploration Costs\nThe Company is in the exploration stage of evaluating the Prospect and has not yet realized any revenues from its operations. It applies the successful efforts method of accounting for crude oil and natural gas properties. Under this method, exploration costs such as exploratory geological and geophysical costs, delay rentals and exploratory overhead are expensed as incurred. Costs to acquire mineral interests in crude oil and/or natural gas properties, drill and equip exploratory wells that find proved reserves and drill and equip development wells are capitalized. Acquisition costs of unproved leaseholds are assessed for impairment during the holding period and transferred to proven crude oil and/or natural gas properties to the extent associated with successful exploration activities. Significant undeveloped leases are assessed individually for impairment, based on the Companys current exploration plans, and a valuation allowance is provided if impairment is indicated. Capitalized costs from successful exploration and development activities associated with producing crude oil and/or natural gas leases, along with capitalized costs for support equipment and facilities, are amortized to expense using the unit-of-production method based on proved crude oil and/or natural gas reserves on a field-by-field basis, as estimated by qualified petroleum engineers.\nLong-lived Assets\nThe carrying values of long-lived assets are reviewed on a regular basis for the existence of facts or circumstances that may suggest impairment. The Company recognizes impairment when the sum of the expected undiscounted future cash flows is less than the carrying amount of the asset. Impairment losses, if any, are measured as the excess of the carrying amount of the asset over its estimated fair value. For the years ended February 28, 2022 and February 28, 2021, no impairment was incurred.\nIncome Taxes\nDeferred income taxes are reported for timing differences between items of income or expense reported in these financial statements and those reported for income tax purposes. The Company uses the asset/liability method of accounting for income taxes. Deferred income taxes and tax benefits are recognized for the future tax consequences attributable to differences between the financial statements carrying amounts of existing assets and liabilities and their respective tax bases, and for tax loss and credit carry-forwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The Company provides a valuation allowance for deferred taxes for the estimated future tax effects attributable to temporary differences and carry-forwards when realization is not more likely than not.\nThe Company accounts for uncertain income tax positions by recognizing in the financial statements, the impact of a tax position, if that position is more likely than not of being sustained on examination by taxation authorities, based on the technical merits of the position. The Company recognizes liabilities for uncertain tax positions based on a two-step process. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. Once it is determined that the position meets the recognition threshold, the second step requires us to estimate and measure the largest amount of tax benefit that is more likely than not to be realized upon ultimate settlement. The difference between the amount of recognizable tax benefit and the total amount of tax benefit from positions filed or to be filed with the tax authorities is recorded as a liability for uncertain tax benefits. It is inherently difficult and subjective to estimate such amounts, as the Company has to determine the probability of various possible outcomes. The Company reevaluates uncertain tax positions on a quarterly basis. This evaluation is based on factors including, but not limited to, changes in facts or circumstances, changes in tax law, effectively settled issues under audit and new audit activity. Such a change in recognition or measurement could result in the recognition of a tax benefit or an additional charge to the tax provision.\nForeign Currency Translation\nThe Companys functional and reporting currency is the United States dollar. Monetary assets and liabilities denominated in foreign currencies are translated using exchange rates prevailing at the balance sheet date. Non-monetary assets are translated at historical exchange rates, and revenue and expense items at average rates of exchange prevailing during the period. Differences resulting from translation are presented in equity as accumulated other comprehensive income (loss). Gains and losses arising on settlement of foreign currency denominated transactions or balances are included in the determination of income. Foreign currency transactions are primarily undertaken in Canadian and Australian dollars. The Company has not, to the date of these financial statements, entered into derivative instruments to offset the impact of foreign currency fluctuations.\nFair Value Considerations\nHistorically, the Company followed Accounting Standards Codification (ASC) 820, Fair Value Measurements and Disclosures, and related guidance. These provisions relate to the Companys financial assets and liabilities carried at fair value and the fair value disclosures related to financial assets and liabilities. ASC 820 defines fair value, expands related disclosure requirements, and specifies a hierarchy of valuation techniques based on the nature of the inputs used to develop the fair value measures. Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date, assuming the transaction occurs in the principal or most advantageous market for that asset or liability.\nThere are three levels of inputs to fair value measurements - Level 1, meaning the use of quoted prices for identical instruments in active markets; Level 2, meaning the use of quoted prices for similar instruments in active markets or quoted prices for identical or similar instruments in markets that are not active or are directly or indirectly observable; and Level 3, meaning the use of unobservable inputs. The Company uses Level 1 inputs for its fair value measurements whenever there is an active market, with actual quotes, market prices, and observable inputs on the measurement date. The Company uses Level 2 inputs for fair value measurements whenever there are quoted prices for similar securities in an active market or quoted prices for identical securities in an inactive market. The Company uses observable market data whenever available.\nIn accordance with ASC 480-10-25 Liabilities-Distinguishing Liabilities from Equity, the embedded derivative associated with the convertible note payable and warrant were accounted for as liabilities during the term of the related note payable and warrant as of February 28, 2018.\nLoss Per Share\nBasic Earnings Per Share (EPS) is computed by dividing net income (loss) available to common shareholders (numerator) by the weighted average number of shares outstanding (denominator) during the period. Diluted EPS gives effect to all dilutive potential common shares outstanding during the period using the treasury stock method and convertible preferred stock using the if-converted method. In computing diluted EPS, the average stock price for the period is used to determine the number of shares assumed to be purchased from the exercise of stock options and/or warrants. Diluted EPS excludes all dilutive potential shares if their effect is anti-dilutive.\nFor the years ended February 28, 2022 and February 28, 2021, the following share equivalents related to convertible debt and warrants to purchase shares of common stock were excluded from the computation of diluted net loss per share, as the inclusion of such shares would be anti-dilutive.\nSchedule of Antidilutive Securities Excluded from Computation of Earnings Per Share\nYear Ended Year Ended\nCommon Shares Issuable for: February 28,\nFebruary 28,\nConvertible debt 63,965,227 58,650,448\nStock warrants 27,877,058 27,877,058\nCommon shares excluded from computation of diluted net loss per share 91,842,285 86,527,506\nComprehensive Income (Loss)\nThe Company recognizes currency translation adjustments as a component of comprehensive income (loss).\nRecent Accounting Pronouncements\nIn January 2017, the FASB issued ASU No. 2017-04, Intangible Goodwill and Other (Topic 350). ASU 2017-04 is intended to simplify how all entities assess goodwill for impairment by eliminating Step 2 from the goodwill impairment test. As amended, the goodwill impairment test will consist of one step comparing the fair value of a reporting unit with its carrying amount. An entity should recognize a goodwill impairment charge for the amount by which the carrying amount exceeds the reporting units fair value. The Company adopted this guidance on March 1, 2022 and there was no significant impact to the Companys consolidated financial statements.\nIn December 2019, the FASB issued ASU No. 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. ASU 2019-12 is intended to simplify accounting for income taxes by removing certain exceptions to the general principles in Topic 740 and amends existing guidance to improve consistent application. ASU 2019-12 is effective for fiscal years beginning after December 15, 2020 and interim periods within those fiscal years. The Company adopted this guidance on March 1, 2021 and there was no significant impact to the Companys consolidated financial statements.\nIn August 2020, the FASB issued ASU No. 2020-06. ASU 2020-06 is intended to simplify accounting for certain financial instruments with characteristics of liabilities and equity, including convertible instruments and contracts on an entitys own equity. ASU 2020-06 is effective for fiscal years beginning after December 15, 2021 and interim periods within those fiscal years. The Company is currently evaluating and assessing the impact this guidance will have on its consolidated financial statements.\nIn May 2021, the FASB issued ASU No. 2021-04. ASU 2021-04 requires issuers to account for modifications or exchanges of freestanding equity-classified written call options that remain equity classified after the modification or exchange based on the economic substance of the modification or exchange. ASU 2021-04 is effective for fiscal years beginning after December 15, 2021 and interim periods within those fiscal years. The Company is currently evaluating and assessing the impact this guidance will have on its consolidated financial statements.\nThe Company does not anticipate that the adoption of other recently issued accounting pronouncements will have a significant impact on its financial statements.\n3. Going Concern\nThese financial statements were prepared on a going concern basis, which implies that the Company will continue to realize its assets and discharge its liabilities in the normal course of business. The Company has not generated revenues since inception, and is unlikely to generate earnings in the immediate or foreseeable future. The continuation of the Company as a going concern is dependent upon the ability of the Company to obtain necessary equity or debt financing to continue operations, successfully develop the Prospect and/or obtain producing properties, with a goal of attaining profitable operations. The Company is currently attempting to complete a significant financing, and in this connection might (a) place a significant amount of additional debentures similar to those described below, (b) secure an alternative financing arrangement, possibly involving the Companys equity securities, or (c) some combination of (a) and (b). The Company has no assurance that it will be able to raise significant additional funds to develop the Prospect or the additional funds needed for general corporate purposes.\nAs of February 28, 2022, the Company had not generated any revenues and had an accumulated loss of $33,996,855 since inception. The cash balance of the Company was approximately $5,200 as of February 28, 2022. These factors raise substantial doubt regarding the Companys ability to continue as a going concern for the 12 months following the issuance of these financial statements. These financial statements do not include any adjustments related to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nThe current COVID-19 pandemic could continue to, and future similar epidemics or pandemics could also, materially and adversely impact our ability to finance and conduct the Companys business once it becomes operational and could materially and adversely impact its operations, funding, and/or financial performance. The COVID-19 pandemic has had no material impact on the Companys current business activities which are primarily focused on compliance and fund-raising tasks. The Company has had and continues to have the same staff, same service providers and same processes as was the case prior to the pandemic.\n4. Oil and Gas Properties\nThe License covers 584,651 gross acres (914 sq. miles) in the State of South Australia. The License grants a 100% working interest in the Prospect, which overlies portions of the Cooper and Eromanga basins.\nOn October 26, 2012, a 100% interest in the License was officially issued to the Subsidiary.\nOn May 19, 2014, the Company received notice from the Government of South Australia that it had issued certain modifications to the License and had suspended the License for a period of six months. Such a suspension functions like an extension. Under the amended License, the Company is required to drill 7 exploratory wells rather than 12, as originally required. The 7 required wells must be drilled in years 3, 4, and 5 (2, 2, and 3 wells, respectively). The amount of required 2D seismic was also reduced to 62 miles (100 km.) in year 3 from 155 miles (250 km.) in year 2 but the total 3D seismic work guarantee increased to 193 sq. miles (500 sq. km.) from 154 sq. miles (400 sq. km.). However, the 3D seismic survey requirement is spread over three years with 39 sq. miles (100 sq. km.) in year 2, 77 sq. miles (200 sq. km.) in year 3 and 77 sq. miles (200 sq. km.) in year 4. Subsequent to this modification and suspension, the Company received two additional six-month suspensions, one in February 2015 and one in July 2015 (this additional suspension commenced upon the conclusion of the suspension received in February 2015). In February 2016, the Company received a third additional suspension, which was for one year and which commenced upon the conclusion of the suspension received in July 2015. Combined, these three additional suspensions amount to an accumulated total suspension of two years.\nOn June 22, 2016, the Company terminated the February 2016 License suspension in preparation for a 3D seismic survey (the Nike Survey) that was comprised of approximately 69 sq. miles (179 sq. km.) on the southwest portion of the Prospect. After archaeological and environmental reviews of the survey area, fieldwork by the seismic contractor began on July 26, 2016. The Nike Survey and field work were completed on October 30, 2016 and the License was suspended again on November 1, 2016.\nIn July 2017, the License suspension was lifted in order to conduct a Work Area Clearance Survey (WAC) of several potential drill sites located in the southern portion of the License. After completing the Nike Survey, the Company requested and received a number of extensions and modifications of the work commitment. As a result of the modifications and suspensions, the remaining work commitments are now as follows:\n* Year 3 ending January 28, 2023 - Shoot 3D seismic data totaling at a minimum approximately 135 sq. miles (350 sq. km.).\n* Year 4 ending January 29, 2024 - Drill three wells.\n* Year 5 ending January 28, 2025 - Drill four wells.\nWhile the Company has to date been successful in obtaining such extensions, it has no assurance that any further extensions will be obtained.\nIn four transactions, the Company acquired portions of the royalty interest associated with the PEL 512 License so that the Company now owns an aggregate 5.0% royalty interest, while the previous holders of the original 7.0% royalty interest continue to hold a 2.0% royalty interest.\n5. Related Party Transactions\nAs of February 28, 2022 and February 28, 2021, the Company owed $1,988,230 and $1,273,030, respectively, to certain Company directors and officers for accrued compensation and reimbursement of expenses paid on behalf of the Company.\n6. Notes Payable\nIn connection with the Paycheck Protection Program established by the Coronavirus Aid, Relief, and Economic Security Act, on April 27, 2020 and March 3, 2021 the Company borrowed $118,750 and $120,000, respectively, at an annual interest rate of 1 percent. The loans dated April 27, 2020 and March 3, 2021 mature on April 27, 2022 and March 3, 2026, respectively. Accrued interest for the year ended February 28, 2022 is $1,190. Accrued interest for the year ended February 28, 2021 was $1,002. On July 28, 2021, the principal amount of $100,448 and accrued interest of $1,275 were forgiven for the loan dated April 27, 2020. The Company recognized a gain on forgiveness of PPP loan of $101,723 on the statement of operations as a result. As of February 28, 2022, the remaining principle of that loan of $4,131, plus interest, will be paid in monthly installments of $2,068 per month until the balance reaches zero. The final payment will be on May 27, 2022. Interest paid for the year ended February 28, 2022 was approximately $1,700. No interest was paid on these loans for the year ended February 28, 2021.\n7. Convertible Debentures Payable\nFrom May 27, 2016 through May 16, 2018, the Company issued eleven rounds (I thru XI) of senior secured convertible debentures, the proceeds of which have funded the initial Nike Survey with respect to the Prospect, the interpretation of seismic data acquired, expenses associated with the Nike Survey, costs associated with the debenture issuances, and general and administrative expenses. The debentures are secured by virtually all of the Companys assets owned, directly or indirectly, but for the License. As discussed elsewhere, the Company may in the future sell additional senior secured convertible debentures having the same terms as those currently outstanding. The Maturity Date of the Debentures was extended to December 31, 2023. Due to the extension, a debt modification was determined and the amortization of discount was recorded accordingly to the new Maturity Date of December 31, 2023.\nDuring the year ended February 28, 2022, the Company received gross proceeds of $75,000 for an issuance of a senior secured convertible debenture. The senior secured convertible debenture was issued on November 10, 2021 with a maturity date of December 31, 2023. Table below provides a summary of the senior secured convertible debentures issued through February 28, 2022 and related debt discount and amortization details.\nSchedule of Convertible Debentures Payable\nRound Issue\nDate\nMaturity\nDate\nInterest\nRate\nConversion\nPrice\nPrincipal\nAmount\nDebt\nDiscount\nDebentures,\nnet of Debt\nDiscount\nOutstanding as of February 28, 2021:\nI May 27, 2016 December 31, 2023 8 % $ 0.16 $ 3,500,000 $ 3,500,000\nII Aug 16, 2016 December 31, 2023 8 % $ 0.16 200,000 199,999\nAug 16, 2016 December 31, 2023 8 % $ 0.16 250,000 250,000\nIII Dec 30, 2016 December 31, 2023 8 % $ 0.16 287,500 237,587\nIV Feb 15, 2017 December 31, 2023 8 % $ 0.16 1,000,000 1,000,000\nV Mar 31,2017 December 31, 2023 8 % $ 0.20 200,000 200,000\nVI Jul 5, 2017 December 31, 2023 8 % $ 0.20 137,500 137,500\nJul 5, 2017 December 31, 2023 8 % $ 0.16 150,000 150,000\nVII Sept 19, 2017 December 31, 2023 8 % $ 0.16 400,000 400,000\nSept 19, 2017 December 31, 2023 8 % $ 0.16 100,000 82,125\nVIII Oct 10, 2017 December 31, 2023 8 % $ 0.20 137,500 72,806\nIX Jan 3, 2018 December 31, 2023 8 % $ 0.20 137,500 137,500\nX April 2, 2018 December 31, 2023 8 % $ 0.20 137,500 137,500\nXI May 16, 2018 December 31, 2023 8 % $ 0.20 212,500 212,500\nDebt discount from warrant grant from debt modification\n942,812\nAmortized discount as of February 28, 2021\n(6,204,925 )\nBalance as of February 28, 2021 6,850,000 1,455,404 $ 5,394,596\nActivity for the year ended February 28, 2022:\nXII Nov 10, 2021 December 31, 2023 8 % $ 0.16 75,000\nAmortization of discount for the year ended February 28, 2022\n(448,149 )\nBalance as of February 28, 2022 $ 6,925,000 $ 1,007,255 $ 5,917,745\nThe preceding table does not reflect two additional Debentures issued after February 28, 2022. See the footnote captioned 11. Subsequent Events below.\nThe Company recognized $448,149 and $1,592,604 of debt discount amortization during the years ended February 28, 2022 and February 28, 2021, respectively. During the years ended February 28, 2022 and February 28, 2021, the Company incurred interest expense directly related to the Convertible Debentures of $795,991 and $733,681, respectively, at a rate of 8% per year, compounded quarterly.\n8. Commitments and Contingencies\nOffice Lease\nThe Company leases virtual office space in Houston, Texas, on a month-to-month basis for $193 per month. The Subsidiary leases virtual office space in Melbourne, Australia, on a month-to-month basis for AU$175. The Companys server is located in the personal office of Keith McKenzie, an officer and director of the Company. The office space is leased on a month-to-month basis for CA$500.\nDuring the year ended February 28, 2022 and February 28, 2021, the Company incurred office lease expense of $8,623 and $8,602, respectively.\n9. Income Taxes\nThe following table reconciles the U.S. federal statutory income tax rate in effect for the years ended February 28, 2022, February 28, 2021, and the Companys effective tax rate:\nSchedule of Reconciliation of Effective Income Tax Rate\nYear Ended\nFebruary 28, 2022\nYear Ended\nFebruary 28, 2021\nU.S. federal statutory income tax $ (490,375 ) $ (1,240,198 )\nPPP loan forgiveness (21,362 ) -\nMeals & Entertainment 3,947\nStock expense related to warrant modifications - 569,135\nTrue-up of prior year permanent items - 417,242\nChange in valuation allowance 511,691 249,874\nEffective income tax rate $ - $ -\nThe significant components of deferred income tax assets and (liabilities) at February 28, 2022 and February 28, 2021 are as follows:\nSchedule of Components of Deferred Income Tax Assets\nFebruary 28, 2022 February 28, 2021\nCapitalized geological/geophysical & other intangibles $ 2,848 $ 8,285\nDebt discount & related amortization 744,577 486,060\nFederal net operating loss 1,967,758 1,709,147\nLess: valuation allowance (2,715,183 ) (2,203,492 )\nNet deferred tax asset $ - $ -\nThe amount taken into income as deferred income tax assets must reflect that portion that is more likely-than-not to be realized from future operations. The Company has chosen to provide a full valuation allowance against net deferred tax assets. The Company has recognized a valuation allowance for the net deferred income tax asset since the Company cannot be assured that it is more likely than not that such benefit will be utilized in future years. The valuation allowance is reviewed annually. When circumstances change and which cause a change in managements judgment about the realize-ability of deferred income tax assets, the impact of the change on the valuation allowance is generally reflected in current income.\nThe Companys policy is to recognize interest and penalties accrued on any unrecognized tax benefits as a component of income tax expense. Management has considered the likelihood and significance of possible penalties associated with its current and intended filing positions and has determined, based on their assessment, that such penalties, if any, would not be expected to be material.\nNo provision for income taxes has been provided in these financial statements due to the net loss for the years ended February 28, 2022 and February 28, 2021. An NOL carryforward of $9,370,277 has accumulated as of February 28, 2022 with portions beginning to expire in 2032, of which under the CARES Act a portion can be carried back up to five years but also, can be carried forward indefinitely, limited to 80% of a given years taxable income. Since 2018, the accumulated total that can be carried forward indefinitely amount to $5,431,958. NOLs may be limited for future use to the extent there has been a Section 382 limitation resulting from a certain percentage ownership change in a year or years. At this time, Management has not determined whether the threshold ownership change has occurred for any year, or whether a Section 382 limitation applies.\n10. Shareholders Deficit\nThe Company received gross proceeds of $100,000 from the private placement of 500,000 shares of common stock during the twelve months ended February 28, 2021 at a price of $0.20 per common share. On February 2, 2020, the Company received proceeds of $6,250 in a private placement for 25,000 shares of common stock at $0.25 per share. On December 30, 2020, the 25,000 shares were issued.\nWarrants\nPursuant to debenture agreements dated May 27, 2016 and August 16, 2016, warrants to purchase 13,875,000 shares of the Companys common stock had an original expiration date of May 27, 2019. On May 27, 2019, the Company entered into agreements to extend the related expiration dates to July 27, 2019. As a result of the modification, the Company recorded additional expense of approximately $365,000 for the incremental fair value of the warrants, calculated using the Black-Scholes option-pricing model. Variables used in the Black-Scholes option-pricing model include: (1) risk free interest rate of 2.35% based on the applicable US Treasury bill rate, (2) expected life of 2 months, (3) expected volatility of 80% based on the trading history of the Company, and (4) zero expected dividends. On July 27, 2019, the Company entered into agreements to further extend the related expiration dates to December 31, 2019. As a result of this extension, the Company recorded additional expense of approximately $371,000 for the incremental fair value of the warrants, calculated using the Black-Scholes option-pricing model. Variables used in the Black-Scholes option-pricing model include: (1) risk free interest rate of 2.1% based on the applicable US Treasury bill rate, (2) expected life of 5 months, (3) expected volatility of 80% based on the trading history of the Company, and (4) zero expected dividends. On December 31, 2019, the Company entered into agreements to further extend the related expiration dates to February 29, 2020. As a result of the modification, the Company recorded additional expense of approximately $26,000 for the incremental fair value of the warrants, calculated using the Black-Scholes option-pricing model. Variables used in the Black-Scholes option-pricing model include: (1) risk free interest rate of 1.48% based on the applicable US Treasury bill rate, (2) expected life of 2 months, (3) expected volatility of 80% based on the trading history of the Company, and (4) zero expected dividends. On February 29, 2020, the Company entered into agreements to further extend the related expiration dates to August 31, 2020. As a result of this extension, the Company recorded additional expense of approximately $340,000 for the incremental fair value of the warrants, calculated using the Black-Scholes option-pricing model. Variables used in the Black-Scholes option-pricing model include: (1) risk free interest rate of 1.11% based on the applicable US Treasury bill rate, (2) expected life of 6 months, (3) expected volatility of 100% based on the trading history of the Company, and (4) zero expected dividends. The expense related to these modifications was included in general and administrative expense on the statement of operations. On August 31, 2020 the Company entered into agreements to further extend the related expiration dates to February 28, 2021. As a result of this extension, the Company recorded additional expense of approximately $559,000 for the incremental fair value of the warrants, calculated using the Black-Scholes option-pricing model. Variables used in the Black-Scholes option-pricing model include: (1) risk free interest rate of 0.105% based on the applicable US Treasury bill rate, (2) expected life of 6 months, (3) expected volatility of 76% based on the trading history of the Company, and (4) zero expected dividends. The expense related to these modifications was included in general and administrative expense on the statement of operations.\nPursuant to debenture agreements dated February 15, 2017, warrants to purchase 3,750,000 shares of the Companys common stock had an original expiration date of February 15, 2020. On February 15, 2020, the Company entered into agreements to extend the related expiration dates to August 31, 2020. As a result of this extension, the Company recorded additional expense of approximately $82,000 for the incremental fair value of the warrants, calculated using the Black-Scholes option-pricing model. Variables used in the Black-Scholes option-pricing model include: (1) risk free interest rate of 1.55% based on the applicable US Treasury bill rate, (2) expected life of 6.5 months, (3) expected volatility of 101% based on the trading history of the Company, and (4) zero expected dividends. The expense related to these modifications was included in general and administrative expense on the statement of operations. On August 31, 2020, the Company entered into agreements to further extend the related expiration dates to February 28, 2021. As a result of this extension, the Company recorded additional expense of approximately $151,000 for the incremental fair value of the warrants, calculated using the Black-Scholes option-pricing model. Variables used in the Black-Scholes option-pricing model include: (1) risk free interest rate of 0.105% based on the applicable US Treasury bill rate, (2) expected life of 6 months, (3) expected volatility of 76% based on the trading history of the Company, and (4) zero expected dividends. The expense related to these modifications was included in general and administrative expense on the statement of operations.\nPursuant to a debenture agreement dated September 19, 2017, warrants to purchase 1,500,000 shares of the Companys common stock had an original expiration date of September 19, 2020. On August 31, 2020, the Company entered into an agreement to extend the related expiration date to February 28, 2021. As a result of this extension, the Company recorded additional expense of approximately $60,000 for the incremental fair value of the warrants, calculated using the Black-Scholes option-pricing model. Variables used in the Black-Scholes option-pricing model include: (1) risk free interest rate of 0.105% based on the applicable US Treasury bill rate, (2) expected life of 6 months, (3) expected volatility of 76% based on the trading history of the Company, and (4) zero expected dividends. The expense related to this modification was included in general and administrative expense on the statement of operations.\nPursuant to debenture agreements dated May 27, 2016, August 16, 2016, February 10, 2017, and September 19, 2017, warrants to purchase 19,125,000 shares of the Companys common stock had an expiration date of May 27, 2021. On February 4, 2021, the Company entered into an agreement to extend the related expiration date to December 31, 2023. As a result of this extension, the Company recorded additional expense of approximately $1,940,278 for the incremental fair value of the warrants, calculated using the Black-Scholes option-pricing model. Variables used in the Black-Scholes option-pricing model include: (1) risk free interest rate of 0.17% based on the applicable US Treasury bill rate, (2) expected life of 35 months, (3) expected volatility of 152% based on the trading history of the Company, and (4) zero expected dividends. The expense related to this modification was included in general and administrative expense on the statement of operations.\nOn February 4, 2021, the Termination Date of the then outstanding Warrants was also extended to December 31, 2023. In connection with this extension, the Company agreed to issue to the Original Purchaser 8,752,058 additional common shares at an initial per-share exercise price of $0.20, subject to adjustment upon the occurrence of certain customary events. The additional warrants were issued on May 28, 2021, and have an expiration date of December 31, 2023. As a result of this agreement, the Company capitalized as debt discount $942,812 for the incremental fair value of the warrants, calculated using the Black-Scholes option-pricing model. Variables used in the Black-Scholes option-pricing model include: (1) risk free interest rate of 0.17% based on the applicable US Treasury bill rate, (2) expected life of 35 months, (3) expected volatility of 152% based on the trading history of the Company, and (4) zero expected dividends.\nNo expense was recorded by the Company for the incremental fair value of the warrants due to the early adoption of ASU 2017-11 as noted in Footnote 2.\nWarrant activity during the year ended February 28, 2021 and February 29, 2020 is as follows:\nSummary of Warrant Activity\nNumber of Warrants Weighted\nAverage\nExercise Price Weighted\nAverage\nRemaining\nTerm\n(Years)\nOutstanding at February 28, 2021 27,877,058 $ 0.20 2.84\nWarrants awarded -\nExpired/Cancelled -\nOutstanding and exercisable as of February 28, 2022 27,877,058 $ 0.20 1.80\nThe intrinsic value of warrants outstanding at February 28, 2022 and February 28, 2021 was $-0-.\n11. Subsequent Events\nThe Company has evaluated all transactions through the date the consolidated financial statements were issued for subsequent event disclosure consideration.\nOn June 8, 2022 the Company received gross proceeds of $50,000 for an issuance of a senior secured convertible debenture.\nOn July 21, 2022 the Company received gross proceeds of $50,000 for an issuance of a senior secured convertible debenture.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDISCOVERY ENERGY CORP.\nBy: /s/ William E. Begley\nWilliam E. Begley\nPresident\nDate: December 6, 2022\nIn accordance with the Exchange Act, this report had been signed below by the following persons on behalf of the registrant in the capacities and on the dates indicated.\n/s/ Keith J. McKenzie\nKeith J. McKenzie\nDirector, Chief Executive Officer\n(Principal executive officer)\nDate: December 6, 2022\n/s/ Keith D. Spickelmier\nKeith D. Spickelmier\nChairman\nDate: December 6, 2022\n/s/ William E. Begley\nWilliam E. Begley\nDirector, Chief Financial Officer (Principal financial and accounting officer)\nDate: December 6, 2022"
}