{
    "cik": "1435812",
    "company": "AREM PACIFIC Corp",
    "filing_type": "10-K",
    "filing_date": "2022-11-21",
    "period_of_report": "2022-06-30",
    "sic": "7200",
    "state_of_inc": "DE",
    "state_location": "C3",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1435812/0001010412-22-000042-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1435812/000101041222000042/arem10k063022.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1435812/0001010412-22-000042.txt",
    "filename": "1435812_10K_2022_0001010412-22-000042.htm",
    "content": "Item 1. Business\nItem 1.A. Risk Factors\nItem 1.B. Unresolved Staff Comments\nItem 2. Properties\nItem 3. Legal Proceedings\nItem 4. Mine Safety Disclosure\nPART II\nItem 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nItem 6. Selected Financial Data\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nItem 7.A. Quantitative and Qualitative Disclosures About Market Risk\nItem 8. Consolidated financial statements and Supplementary Data\nItem 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure\nItem 9.A. Controls and Procedures\nItem 9.B. Other Information\nItem 9.C. Disclosure Regarding Foreign Jurisdiction that Prevent Inspection\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nItem 11. Executive Compensation\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nItem 14. Principal Accounting Fees and Services\nPART IV\nItem 15. Exhibit and Financial Statement Schedules\nItem 16. Form 10-K Summary\nSignatures\nPART I\nITEM 1. BUSINESS\nCorporate History and Business Development\nWe were incorporated in the State of Delaware on November 8, 2007, under the name Aspen Global Corp. On June 10, 2008, we changed our name to Diversified Mortgage Workout Corp.\nOn June 30, 2012, pursuant to an Acquisition Agreement with Sanyi Group, we acquired 100%of the equity interest in Sanyi Group from its sole owner, Mr. Xin Jin, our current sole director, CEO and CFO, in consideration of 10,000,000 post-split (as defined below) shares of our $0.000001 par value common stock comprised of restricted securities as defined in Rule 144 of the SEC, which were issued to Mr. Jin on August 30, 2013. On the closing of this acquisition, we succeeded to the business operations of Sanyi Group, then consisting of the operation of two (2) wellness centres discussed below.\nOn June 19, 2013, Arem Pacific Arizona acquired voting control of the Company (then Diversified Workout Corporation). Subsequently, on August 8, 2013, we acquired all of the issued and outstanding shares of Arem Pacific Arizona from its then existing shareholders; and we retired and returned to our treasury all of the capital stock acquired in the Arem Pacific Arizona transaction, resulting in it becoming our wholly-owned subsidiary.\nWe changed our name in Delaware to Arem Pacific Corporation on July 23, 2013; and we effected a 388 to one (1) reverse stock split of our common stock on or about that date. Effective April 15, 2016, our Form S-1 Registration Statement registering shares of our common stock for public sale by certain selling shareholders of the Company was declared effective by the SEC. We became delinquent in our reports required to be filed under Section 15(d) of the Exchange Act on or about February 15, 2017, and this Annual Report is our first filing with the SEC since that date.\nOur current corporate structure is depicted below:\nArem Pacific Corporation\n(a Delaware corporation)\n100% owned\nArem Pacific Corporation\n(an Arizona corporation)\n100% owned\nSanyi Group Pty. Ltd.\nan Australian corporation\nFor additional information about our corporate structure, please see the caption References and the heading Corporate History and Business Development above. All of our current principal operations are conducted through Sanyi Group in Victoria, Australia.\nFiscal Year Ended June 30, 2017\nDuring fiscal 2017, we closed one (1) of our two (2) wellness centers, which was located in the Chirnside Park Shopping Centre in a suburb of Victoria. This wellness centre was closed because our premier leasing contract for that wellness centre was becoming due and the owner of those premises had proposed a rental increase of approximately 50%. Since then, we have operated only one (1) wellness centre, which is also located in the Point Cook Shopping Centre in Victoria, Australia.\nWe rebranded ourselves to provide a unique service and marketing plan focusing on an in-service orientation strategy to ensure complete customer satisfaction when using our massage and related wellness services. Our objectives are to (i) maintain a happy customer database, depending on regular shopping mall promotions where our current facilities are located to attract walk-in customers; (ii) offer referral program cards to our customers to encourage additional services; and (iii) retain current customers and access new customers in return.\nWe have merged our experience, expertise and considerate care in our genuine wellness services to offer the customer unforgettable relaxation experiences in massage therapy, providing a quiet and personal therapeutic ambient environment.\nA full-time employee is maintained throughout the year to lower our overhead expenses, with a team of part-time masseurs available to cater to any surge in customers whenever the demand rises. Our marketing expense is very minimal since our wellness centre is conveniently located within a major shopping centre, providing easy access to local residents and nearby office staffs and visiting tourists.\nFiscal Year Ended June 30, 2018\nThe rebranding and re-strategizing of our marketing plan in fiscal 2017 were enhanced further with a year-round special promotion discount to improve sales revenue in attracting more potential walk-in and regular customers. The plan was to compete primarily on the basis of product quality, brand recognition, brand loyalty and service-oriented marketing, with a competitive pricing, offering special promotions year round in our competitive environment.\nFull-time employees were maintained during fiscal 2018, along with a well-trained part-time masseur who was not on our payroll, to cater to sudden upsurges in demand for our wellness services. Part-time masseurs are paid when they are called upon to carry out the customer requested massage sessions or wellness packages we offer. With this customer focus approach, our attitude ensures every customer is truly satisfied with our proven and accepted wellness services. Our marketing promotional costs continued to be minimal.\nFiscal Year Ended June 30,\nWe further enhanced on our established 2017 and 2018 marketing plans by promoting an accumulative discount card and introduced a 100% satisfied or 100% refund service. This unique promotional method was implemented to attract more customers to increase our revenue and reduce our marketing related costs.\nWe realised natural therapy providers in Australia were undergoing a period of fierce competition, and we positioned our marketing strategy by constantly reviewing and processing improvements to all of our existing promotional activities in an attempt to stay ahead of our competitors. In this respect, we have focused on the following:\n- Convenience - Easy access to our wellness centre;\n- Comfort - Well equipped facilities designed to create a relaxing, cordial, friendly and comfortable environment;\n- Quality Service - All masseurs have formal training and extensive experience; and\n- Flexibility - Onsite therapeutic massage services adjustable to customers schedules and needs.\nFiscal Year Ended June 30,\nTo further expand our wellness services business internationally, during the second quarter of fiscal 2020, we planned expanding our traditional Chinese massage therapy and related services into China, and we spent almost three (3) months interviewing and engaging experienced massage therapists in China to join us as part of this strategy.\nWe focused on expanding our wellness services to China, which we believed to be the most promising massage therapy market. We identified future referral partners from major cities, including Guangzhou, Shenzhen, Fujian, Sichuan, Beijing and Shanghai, where we anticipated opening additional wellness centres; and we issued shares of our common stock comprised of restricted securities to these potential partners as incentives. The partners were to be compensated for their respective referrals pursuant to the terms of a Company Representative Agreement, which each was required to execute and deliver to us as a condition of receiving these shares of our common stock, and which provides for a sliding scale of a percentage of the price of the wellness services rendered to the referred party at our anticipated planned facilities based upon the experience and qualifications of our therapist who rendered the referred services See Part IV, Item 15, Exhibit 99.1, for a Form of this Company Representative Agreement.\nWe determined that a number of queries and concerns were required to be considered prior to any plans for any wellness service centers to be opened in China, in addition to its strict border restrictions and other Covid-19 related controls, including, but not limited to (i) local law requirements in the cities we had selected; (ii) location, pricing, accessibility and potential customer traffic for any planned wellness centre; (iii) contract terms and conditions of any potential location, including the size of any such location, renewal rights, rental fees, termination notices and related matters; (iv) requirements for the operations of the wellness centres, including the availability of qualified personnel and their number, compensation arrangements, required equipment and supplies, among other similar issues; and (v) the total estimated cost of opening any such wellness centre and the potential methods of funding its operations.\nFiscal Year Ended June 30,\nThe Covid-19 outbreak in China in mid-fiscal year 2020 led to significant impacts on businesses and industries and has caused us to delay and pause our planned expansion of our wellness services to China, though we maintained our contacts in China through early fiscal 2022 to monitor, plan and prepare for expanding our wellness services to China, all depending on how China is reacting to and mitigating the impact of Covid-19.\nFrom an economic perspective, recovery from a global pandemic like Covid-19 will take a long time. The future is going to focus on self-responsibility as people may realize the importance of taking care of their own health. We believe our customers will not only desire our massage and other wellness services; they will want to learn about the process and health benefits of our wellness services. Accordingly, our business model may have to change and may result in our offering of an at home initiative that will offer proactive and pragmatic ways for people to care for themselves and the people they love. This change of our business model may require more training, hiring better qualified employees and assessing customer reactions to our current and planned wellness services, all of which may impact our operating expenses and results of operations.\nCovid-19 has had a minor impact on our business in Australia due to the tight control of local governmental agencies in respect of testing, monitoring and treating Covid-19; and we have experienced periodic lockdowns of our Victoria wellness centre. During fiscal 2021, we have continued with the same marketing plan we had in fiscal 2020 (except the plans for expansion to China, which were put on hold), and our wellness centre continues to focus on providing excellent wellness services. Five (5) full-time resource personnel are still maintained from our fiscal 2019 employees, with a back-up pool of well-trained and part-time masseurs to cover demand and who are paid when the particular wellness service is rendered. Continuing promotions and the heavy traffic flow in the shopping centre where our wellness centre is located continues to keep our marketing expenses in check.\nWith the Covid-19 pandemic continuing, all activities on our initial marketing plans in China have stopped completely, though we are optimistic that we can revive our contacts and enter the Chinese market since our basic groundwork has already been established with selected potential locations and supporting resources. We are waiting for the right entry moment to reactivate all our marketing plan and established structure to capture Chinas potential for wellness services and spa related market opportunities, subject to available funding and resources.\nFiscal Year Ended June 30,\nThe fiscal year 2022 also fell within the Australian Government Authoritys MCO regarding the Covid-19 pandemic (from Feb 27, 2020, until July 6, 2022), with constant lockdowns, restricted people movement and border restrictions. On July 6, 2022, border restrictions for people travelling to and from Australia were lifted; however, this fiscal year saw improved revenue compared to fiscal 2021 as the Australian Government Authority started allowing occasional people movement and declared less frequent lockdowns, allowing our wellness centre to be open for business for a greater period of time. To minimize marketing costs and expenditures during this Covid-19 pandemic period, management decided to continue maintaining the same marketing strategy plan carried on in fiscal 2021, including the same headcount of personnel to support our wellness centres operations.\nBusiness\nOverview\nThrough Sanyi Group, we are engaged in providing wellness services that include acupressure/reflexology, massage therapy and cupping. We offer various types of massage therapy, such as Swedish, deep tissue and hot stone oil, among others, all as discussed below.\nPrincipal Products or Services and their Markets\nSince 2017, we have operated one (1) wellness centre in Victoria State, Australia. The wellness centre is located Point Cook Shopping Center, Shop 109, Stockland Point Cook, Corner Murong and 20 Main Street, Point Cook, Victoria, 3030.\nThe Point Cook wellness centre consists of approximately seventy-seven (77) square meters, and its layout is depicted below:\nThe Point Cook location has one (1) full-time supervisor and four (4) part-time masseurs. The size of any future planned locations, if any, are anticipated to range between fifty (50) to one hundred (100) square meters.\nServices Provided at our Wellness Centre.\nWe provide the following services at our wellness centre:\n· Acupressure/Reflexology;\n· Neck, shoulder, back, legs and full body massages;\n· Foot massages;\n· Cupping; and\n· Deep tissue and hot oil massages.\nAcupressure/Reflexology - is considered acupuncture without needles. Similar to acupuncture, strategic body meridians are targeted by the practitioner using pressure from their fingers, elbows or special devices. Acupressure also is a component of traditional Chinese medicine. Reflexology is similar to acupressure and targets specific points on the feet and hands, which correspond to organs in the body.\nMassage Therapy - involves the application of soft tissue manipulation techniques to the body designed to reduce muscle tension and increase circulation. There are many variations of massage therapy, including Swedish, deep tissue and hot stone oil, among others. It is believed that massage therapy was practiced in many ancient civilizations, including China, India and Greece.\nCupping - involves the warming of glass cups through a flammable substance, which eliminates oxygen, thus creating a vacuum. The cup is then placed over a specific area. The lack of oxygen anchors the cup, and the suction draws the skin, which simulates blood flow to the area. This process is considered the inverse of massage. Cupping is one of the oldest forms of Chinese medicine.\nThese wellness services are provided by skilled practitioners trained in massage therapy, acupressure and cupping. Sessions vary from fifteen (15) to ninety (90) minutes and prices vary according to the nature of the services and length of services session.\nOur Revenue Model.\nWe generate revenues from the following methods:\nFees for services are charged to our customers dependent upon the treatment administered and length of time of the treatment. Computed on an hourly basis, these fees generally range from $60 to $85 per hour.\nRevenue derived from an average customer is approximately $60 per visit. At our locations, each masseur averages five (5) customers/day (eight [8] hours of operation) or thirty (30) customers/week (six [6] working days) or 1,500 customers/year (fifty [50] weeks). An average of five (5) masseurs yields approximate sales revenue of $200,000-250,000 annualized. Although our average has been five (5) customers a day per each masseur, we believe that each masseur is capable of serving up to ten (10) customers per day.\nOur Masseurs.\nOur wellness centre location is staffed with between five (5) to six (6) masseurs and one (1) supervisor. The supervisor is our most experienced masseur at the wellness centre. The supervisor oversees the day-to-day operations of the wellness centre and may serve customers during personnel shortages. Our masseurs are employees and are paid a yearly salary of approximately $53,900, depending on experience. In addition, we are required by applicable law to pay our full and part-time employees Public Liability Insurance, which is approximately $446 yearly for each employee, including Professional Indemnity Insurance at a cost of (0.6%) of the employees salary. From time to time, we use independent contractors during personnel shortages, and they are paid a portion of the customer fee ranging between 45-55% of the fee.\nMarketing.\nThe marketing promotional activities for our current market and year are similar to previous years, including year-round special promotional discounts to improve sales revenue in attracting more potential walk-in and regular customers and to compete primarily on the basis of product quality, brand recognition, brand loyalty and service-oriented marketing, with a competitive pricing, offering various special promotions year-round in our competitive environment.\nOur Growth Strategy.\nOther than the potential of expanding to the overseas market in China, if and when possible, we have no current plans to open additional wellness centres. Also, according to the Australian Bureau of Statistics, the Consumer Price Index (the CPI) in Australia increased by approximately 6.1% during the twelve (12) month period ended June 30, 2022, with the most significant increases being in the cost of new dwellings (5.6%), automobile fuel (4.2%) and furniture (7%). The rise in the CPI can have an adverse effect on personal disposable income available for the types of services we provide and could certainly limit any expansion plans we may consider.\nGlobal massage services project that the market for wellness services like those we provide are on the rise, and medical spas have and are expected to register increased growth in the coming years. We believe that the Chinese market is the most promising area driven by a hectic lifestyle in urban areas. Rising demand from emerging markets is expected to propel the demand for spa treatments in the future with increased focus on personal health.\nAs outlined above, we have identified future partners from strategic cities in China to help us exploit the Chinese market in the major cities of China, including Guangzhou, Shenzhen, Fujian, Sichuan, Beijing, Shanghai for fiscal 2023, who would be compensated under the above referenced Company Representative Agreement that is Exhibit 99.1 of this Annual Report, in Part IV, Item 15, if and when we are able to expand our wellness services to China, as to which no assurance can be given. According to the National Bureau of Statistics of China, the consumer price index (CPI) in China rose approximately 2.5% during the twelve (12) month period ended June 30, 2022. The urban growth rate was approximately 2.5%, and the rural growth rate was approximately 2.6%. These overall increases were much lower than those experienced in Australia.\nSeasonality.\nThere is no discernible seasonality in our business, although we expect that the first calendar year quarter is typically our lowest as a percentage of total annual gross revenue. Revenue and operating income will vary by quarter and are hard to predict from quarter to quarter. In addition, the volatility in the local economy will impact our quarterly revenue and operating income, along with any effects related to the status of the Covid-19 pandemic.\nSources and Availability of Raw Materials\nOur equipment needs are minimal, consisting of massage benches and various office equipment and computers. We purchase our equipment from local suppliers on an as needed basis and presently do not believe the loss of any one supplier will have an adverse effect on our business, so long as our needs are not adversely affected by the current issues being experienced in world-wide supply chain. See Part I, ITEM 1A. RISK FACTORS\nThe enumeration of risk factors about us, our business operations, our management, consolidated financial statements and our common stock, among other issues that may disclose risks of investments in our common stock is not required of smaller reporting companies like us in our annual or quarterly reports filed with the SEC; however, we believe the following risk factors may be of value to our shareholders or potential investors in our Company. These risk factors should be considered in light of the caption Forward-Looking Statements at the forepart of this Annual Report. We reserve the right not to provide risk factors in our future filings, unless required to do so. We view the following as our primary risk factors, which should not be considered to be all inclusive:\nRisks Related to Our Business\nWe are a small company that owns and operates one (1) wellness centre in Victoria, Australia, that has had limited, if any, growth during the four (4) fiscal years presented in this Annual Report.\nWe acquired our wellness centre as part of our acquisition of Sanyi Group, our wholly-owned subsidiary, in 2012, and with our limited growth over these periods, it is difficult to evaluate our future prospects. During the fiscal years ended June 30, 2022, 2021, 2020, and 2019, we had gross revenues of $262,537, $201,854, $183,857 and $249,253, respectively, with respective net income/(loss) of $38,346, 48,642, ($58,099) and $5,264 during these fiscal years. The likelihood of our success must be considered in light of the problems, expenses, difficulties, complications and delays frequently encountered by a small operating company trying to expand its business enterprise and the highly competitive environment in which we operate; our business strategy may be unsuccessful; and we may be unable to address the risks we face in a cost-effective manner, if at all. If we are unable to successfully accomplish these tasks, our business will be harmed, and we may fail. Therefore, there can be no assurance that the business of the Company will continue or grow in the future.\nIn conducting our business, we face many risks that may interfere with our business objectives. Some of these risks could materially and adversely affect our business, financial condition and results of operations. In particular, we are subject to various risks resulting from changing economic, political, industry, business and financial conditions. The risks and uncertainties described below are not the only ones we face. Additional risks and uncertainties not currently known to us or that we currently deem to be immaterial may also materially adversely affect our business operations.\nYou should carefully consider the following factors and other information in this Annual Report before you decide to invest in our Company. If any of the risks referred to below occur, our business, financial condition and results of operations could suffer. In any such case, the trading price of our shares could decline, and you may lose all or part of your investment.\nOur Auditors Report on our consolidated financial statements for the fiscal years ended June 30, 2022, 2021, 2020, and 2019, which is contained in this Annual Report, has been prepared assuming that we will continue as a going concern by reason of our losses, current liabilities and our negative stockholders equity/(deficit), and there is no assurance that we will not continue to experience losses in our business. As a result, we may be unable to continue as a going concern.\nWe incurred net losses of US$58,099 during the year ended June 30 2020. We had net current liabilities at June 30, 2019, 2020, 2021, and 2022, of US$57,102, US$112,010, US$59,672 and US$17,497, respectively, and we had at June 30, 2019, 2020, and 2021, a negative net stockholders deficit of US$18,476, US$76,536, US$27,894, respectively. These events or conditions indicate that a material uncertainly exist that may cast significant doubt on our ability to continue as a going concern.\nThe consolidated financial statements have been prepared on a going concern basis in view of the Company being able to obtain continued financial support from its sole director, CEO and CFO or its ability to obtain external financing, as to which no assurance can be given.\nThe validity of the going concern basis on which the consolidated financial statements have been prepared depends on our ability to operate as a going concern and assumptions are premised on future events, the outcome of which are inherently uncertain. Managements plans in regard to these matters are described in Note 1.3 of our consolidated financial statements, though our consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nWe had material weaknesses in our internal controls in financial reporting as of June 30, 2022, and such material weaknesses could adversely affect our ability to report our results of operations and financial condition accurately and in a timely manner.\nOur management identified material weaknesses in our internal controls and concluded that our internal control over financial reporting were not effective as of June 30, 2022. A material weakness is a deficiency, or a combination of deficiencies, in internal controls over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis.\nThe specific material weaknesses we identified in our internal control over financial reporting for the fiscal years ended June 30, 2022, 2021, 2020, and 2019 related to:\n· lack of sufficient accounting personnel qualified in US GAAP and SEC reporting; and\n· insufficient accounting staff, which results in a failure to segregate duties sufficiently to ensure a timely and proper preparation and review of our financial statements.\nAlthough we have provided additional training to our accounting personnel relating to US GAAP and SEC reporting requirements to partially address the foregoing material weaknesses, we do not believe such weaknesses have been remediated, and we can provide no assurance that they will be remediated in a timely manner.\nAny failure to maintain effective internal controls could adversely impact our ability to report our financial results on a timely and accurate basis. If our financial statements are not accurate, investors may not have a complete understanding of our operations. Likewise, if our financial statements are not filed on a timely basis as required by the SEC, we could face severe consequences from those authorities.\nOur industry is highly competitive with limited barriers to entry, which could limit our ability to maintain or increase market share.\nOur industry is highly competitive with limited barriers to entry. We provide our services in local markets and compete with companies providing similar services. The barriers to entry in this industry are limited, which makes it easy for competitors to open new shops near our current location or any future locations. Many of our competitors have greater marketing, financial and other resources than us that, among other things, could enable them to attempt to maintain or increase their market share by reducing prices or utilizing other strategies. In order to be competitive, we may have to similarly reduce our prices or modify our plan of operations, which in turn may affect our results of operations.\nWe will need additional financing in order to grow our business, and there in no assurance that we will be successful in obtaining the required resources to expand our business or that any potential expansion will result in profitable operations.\nWe do not have significant assets with which to expand our business. To the extent we intend to expand our business in the future through the opening of additional locations, substantial additional capital will be required. These capital expenditures are intended to be funded from third party sources, including the incurring of debt and/or the sale of additional equity securities. In addition to requiring additional financing to fund expansion, we may require additional financing to fund working capital and operating losses in the future should the need arise. The incurrence of debt creates additional financial leverage, and therefore, an increase in the financial risk to our business operations. The sale of additional equity securities will be dilutive to the interests of current shareholders. In addition, there can be no assurance that such additional financing, whether debt or equity, will be available to us or that it will be available on commercially acceptable terms. Any inability to secure such additional financing on appropriate terms could have a materially adverse impact on any plans for expansion, and our business, financial condition and operating results. Factors affecting the availability and price of capital may include the following:\n· the availability and cost of capital generally;\n· our financial results;\n· the experience and reputation of our management team;\n· market interest, or lack of interest, in our business industry and our business plan;\n· the trading volume of, and volatility in, the market for our common stock, assuming there is a trading market for our common stock;\n· our ongoing success, or failure, in executing our business plan;\n· the amount of our capital needs; and\n· the amount of our debt, options, warrants and convertible securities that may be outstanding in our Company at any time and our authorized capital stock.\nOur business will be subject to compliance with current and future government regulation that may increase the anticipated cost of any potential expansion program.\nCurrently, there are no governmental regulations that materially restrict the wellness business in Australia. We are subject to the laws of Victoria, Australia, as administered by Victorias Business Licensing Authority (BLA) as we carry out our business. We may be required to obtain additional work permits in the event that we do not have enough local personnel for any operations in which we engage, and to negotiate with shopping malls or others prospective lessors on lease or rental terms, recruitment and training, shop fittings and refurbishment to comply with rules and regulations of any shopping mall or other lessors, including but not limited to operational hours, signage, promotions and cleanliness.\nThere is a risk that new regulations could increase our costs of doing business and prevent us from carrying out any expansion or franchising program we may undertake. We may also have to sustain the cost of renovation or improvement on any outlet once every five (5) years as is customarily required by shopping malls. If renovation costs exceed our cash reserves, we may be unable to complete any expansion program and have to abandon the related outlet(s).\nOur shareholders and prospective investors ownership in the Company may be diluted in the future.\nIn the future, we may issue additional authorized but previously unissued equity securities, resulting in the dilution of the ownership interests of our present shareholders or potential investors. We expect to need to issue a substantial number of shares of our common stock or other securities convertible into or exercisable for our common stock in connection with hiring or retaining employees, future acquisitions, raising additional capital in the future to fund our operations and other business purposes.\nOur fees are based on numerous factors outside of our control.\nNumerous factors beyond our control may affect the marketability of our services and our fee structure. These factors include the local and regional economies, the competition, shortage of human resources, government regulations, supply chain issues and the current inflation in many economies related to our supply chain. The exact effect of these factors cannot be accurately predicted, but the combination of any these factors may result in our failure to achieve an adequate return on invested capital and our business may fail, thereby resulting in the loss of any shareholders entire investment in our Company.\nCompliance with the reporting requirements of federal securities laws can be expensive.\nWe are a public reporting company in the United States, and accordingly, subject to the information and reporting requirements of the Exchange Act and other federal securities laws, rules and regulations, including compliance obligations under the Sarbanes-Oxley Act of 2002. The costs of preparing and filing annual and quarterly reports and other information with the SEC and furnishing audited and reviewed financial statements in reports filed with the SEC, along with required communications with our shareholders, are substantial. We have incurred and expect to continue to incur costs associated with continuing as a public company, including, but not limited to, legal, accounting, filing and other related costs and expenses. Failure to comply with applicable securities laws, rules and regulations could result in private or governmental legal action against us or our officers and directors, which could have a detrimental impact on our business and financial condition, the value of our common stock or other equity securities we may issue and the ability of our shareholders to resell these securities.\nThe Covid-19 pandemic presents ongoing risks to our business.\nIn response to the Covid-19 pandemic, governments and other authorities around the world have implemented significant measures intended to control the spread of the virus. While many of these restrictions have been lifted as the rates of Covid-19 infection have decreased or stabilized and as various vaccines have become more widely available, a resurgence of Covid-19 and the impact of variants of the virus that causes Covid-19 may result in the reinstatement of social distancing measures; business closures; lockdowns; restrictions on operations; and quarantines and travel bans. In addition, any governmental mandates that require Covid-19 vaccination or other employee behaviors may result in employee attrition at the Company or its suppliers or customers and may create difficulties in satisfying future employment and supply requirements.\nThe Russian invasion of Ukraine may disrupt global networks.\nWhile we do not have any direct exposure to Russia, Belarus or Ukraine through our operations, employee base, investments or sourcing of goods and services, third party companies with whom we do business may be affected by the global geopolitical disruptions caused by the Russian invasion of Ukraine in February, 2022; however, we do not believe these factors will have a material impact on our current business and results of operations, though they could certainly impair any future plans we may have to expand our wellness services to China.\nRising inflation may negatively affect our operating results.\nDuring 2021 and 2022, global economic conditions have deteriorated, with significantly increased inflation and the risks of further inflation and recession in 2023 and beyond. These unfavorable economic conditions may lead to decreased demand for our services, less disposable income of our customers and higher prices for our customers. To the extent that we are unable to increase the prices of our services in response to increased costs resulting from inflation, our operating margins will be compressed.\nSupply chain disruptions could adversely affect our business.\nSupply chain dislocations resulting from global geopolitical and public health issues such as the Russian invasion of Ukraine, the Covid-19 pandemic and other causes may have a material adverse impact on our business and results of operations. Such disruptions may increase our costs of doing business, including through significant increases in the price the products and equipment required for our business operations and the related costs of shipment. Supply chain disruptions may also adversely affect our access to suppliers, manufacturers, customers and vendors and may impair our ability to perform wellness services. Delays in our ability to meet our obligations as a result of supply chain issues may negatively affect our reputation, our relationships with customers and results of operations.\nRisks Related to Our Common Stock\nThere is no active trading market for our shares of common stock.\nEffective September 28, 2021, our common stock was listed on the Expert Market maintained by the OTC Markets because we had failed to comply with the provisions of SEC Rule 15c2-11 by the close of business on such date, regarding the public availability of current information about us as required by such Rule. Accordingly, our common stock is presently not eligible for proprietary broker-dealer quotations; and all quotations of our common stock, if any, will reflect unsolicited customer orders only. Securities traded on the Expert Market have a higher risk of wider spreads, with increased volatility and price fluctuations; and investors may experience substantial difficulty in selling these types of securities. Furthermore, quotations of securities on the Expert Market serve broker-dealer pricing and investor best execution needs and are restricted from public viewing. The filing of this Annual Report and any other related and required filings by us with the SEC, together with the filing of a Form 211 by a broker-dealer with FINRA and FINRAs review and approval of the filing, or a filing by us with the OTC Markets or another quotation medium as defined in SEC Rule 15c2-11(e)(1), along with a determination of either that we comply with the provisions of Rule 15c2-11, will be required to initiate or resume public quotations of our common stock. No assurance can be given that public quotations of our common stock will be forthcoming.\nFurthermore, small trading volumes are generally understood to depress market prices. As a result, you may not always be able to resell shares of our common stock publicly at the time and prices that you feel are fair or appropriate, even if we are successful in obtaining public quotations of our common stock on a qualified quotation medium.\nAdditionally, even if we are successful in obtaining quotations on a qualified quotation medium, if we do not timely file our reports required to be filed with the SEC under the Exchange Act, broker-dealers may not be able or willing to trade our common stock, and the OTC Markets will post adverse warnings on its website about such failures, which, unless such failures are corrected by us, could have an additional adverse impact on the viability of any market that may develop for our common stock. Other adverse warnings of the OTC Markets under their current and future policies could similarly have an adverse effect on any market for our common stock, and there is no assurance that we will be able to satisfy comments or concerns of the OTC Markets or the SEC, if any are expressed.\nIf an active market for our common stock develops, there is a significant risk that the Companys common stock price may fluctuate dramatically in the future in response to any of the following factors, some of which are beyond our control, including, but not limited to:\n· variations in our quarterly operating results;\n· announcements that our revenue or income are below analysts expectations;\n· general economic slowdowns; and\n· sales of large blocks of our common stock by insiders and others.\nWe do not intend to pay dividends on our common stock for the foreseeable future.\nAll future revenues are anticipated to be utilized in the furtherance of our business plan, and accordingly, it is highly unlikely that you will receive any dividends from us in the near future, if ever.\nOur common stock is subject to the penny stock rules of the SEC, which may make it more difficult for shareholders to sell our common stock.\nThe SEC has adopted Rule 15g-9, which established the definition of a penny stock, for the purposes relevant to us, as any equity security that has a market price of less than $5.00 per share, subject to certain exceptions. For any transaction involving a penny stock, unless exempt, the rules require that a broker or dealer approve a persons account for transactions in penny stocks, and the broker or dealer receive from the investor a written agreement to the transaction, setting forth the identity and quantity of the penny stock to be purchased.\nIn order to approve a persons account for transactions in penny stocks, the broker or dealer must obtain financial information and investment experience objectives of the person and make a reasonable determination that the transactions in penny stocks are suitable for that person and that the person has sufficient knowledge and experience in financial matters to be capable of evaluating the risks of transactions in penny stocks.\nThe broker or dealer must also deliver, prior to any transaction in a penny stock, a disclosure schedule prescribed by the SEC relating to the penny stock market, which, in highlight form sets forth the basis on which the broker or dealer made the suitability determination, and that the broker or dealer received a signed, written agreement from the investor prior to the transaction.\nGenerally, brokers may be less willing to execute transactions in securities subject to the penny stock rules. This may make it more difficult for investors to dispose of the Companys common stock if and when such shares are eligible for sale and may cause a decline in the market value of its stock.\nBecause of increased regulatory efforts of governmental and quasi-governmental agencies regarding the trading of securities that are deemed to be penny stocks, the cost and expense of depositing and inducing a broker-dealer to effect sales of these shares is very costly, which can be in excess of value of the shares sought to be sold, and often includes requirements of legal opinions of both the selling shareholders counsel and the broker-dealers counsel, both at the expense of the selling shareholder.\nCurrently, broker-dealers require legal opinions of shareholders of almost all over-the-counter stocks to deposit and sell these shares, and all of these legal opinions are required to be paid for by the shareholder; and often, two (2) legal opinions are required, one (1) from the shareholders legal counsel and one (1) from the broker-dealers legal counsel. This policy has been required of mostly all low-priced over-the-counter shares, regardless of whether the shares have been registered with the SEC, or whether there is no legend on the stock certificate representing the shares and always if the shares are designated as restricted securities. Larger, national broker-dealers will generally not even trade these securities. The high cost of these types of legal opinions is often more than the value of the shares sought to be sold, and the process can take two (2) to three (3) weeks or more. Accordingly, shareholders with limited shares of low-priced stocks will be unable to economically sell their shares, regardless of whether an established trading market for the shares exists, and if they could sell their shares, the required selling process will inhibit their ability to sell the shares when they desire to sell their shares.\nOur sole director and executive officer, Mr. Xin Jin, and our former President, Mr. Thomas Tang, and Mr. Yew Nic Kien Cheon, a business consultant to the Company, own a significant percentage of our capital stock, and they may be in a position to control decisions of the Company that our other shareholders do not consider to be in their best interests.\nAs of the date of this Annual Report, the foregoing persons beneficially own in the aggregate approximately 26.87% of our issued and outstanding shares of common voting stock. See the caption Security Ownership of Certain Beneficial Owners and Management in Part III, Item 12 hereof. As a result, they may have the ability to substantially control elections to our board of directors, the outcome of issues requiring approval by our shareholders and other corporate actions. This concentration of ownership may also have the effect of delaying or preventing a change in control of our Company that may be favored by other shareholders; and could prevent transactions in which shareholders might otherwise recover a premium for their shares over current market prices. This concentration of ownership and influence in management and board decision making could also harm the price of our capital stock by, among other things, discouraging a potential acquirer from seeking to acquire shares of our capital stock, whether by making a tender offer or attempting to obtain control of our Company.\nWe have established a Series of 10,000,000 shares of Series A Preferred Stock. The Series A Preferred Stock shares has superiority voting rights equal to 1,000 votes per share. In the event that such votes do not total 51% of all votes, than regardless of the provisions of this Series, in any such case, the votes cast by Series A Preferred stock shall be equal to 51% of all votes cast at any meeting of shareholders, or any issue put to the shareholders for voting, and the Company may state that any such action was had by majority vote of all shareholders. Furthermore, the holders of Series A Preferred Stock have the right to the majority of the directors to the Board of the Company and to further amend the Certificate of Incorporation to ensure the furtherance of the Company and its operations as such holders determine. Management could issue one (1) share of this Series to control the approval on these and other matters affecting the Company and its shareholders without any vote of the shareholders. See Exhibit 4 in Part IV, Item 15, for a description of the Companys securities and this Series.\nYou may experience difficulties in effecting service of legal process, enforcing foreign judgments or bringing original actions in Australia based on United States or other foreign laws against us, our management or any experts named in this Annual Report.\nWe conduct substantially all of our operations in Australia and substantially all of our assets are located in Australia. In addition, all of our senior executive officers reside within Australia. As a result, it may not be possible to affect service of process within the United States or elsewhere outside Australia upon our senior executive officers, including with respect to matters arising under U.S. federal securities laws or applicable state securities laws.\nAustralia does not have treaties with the United States providing for the reciprocal recognition and enforcement of court judgments, it is uncertain with regard to whether courts of Australia would recognize or enforce judgments of U.S. courts against us or our directors or officers pursuant to civil liability provisions of the securities laws of the United States or any state in the United States; or exercise jurisdiction over actions brought against us or our directors or officers pursuant to the securities laws of the United States or any state in the United States. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nOur corporate offices are located at 271 Blackburn Road, Mount Waverley, Victoria, Australia 3149; and our telephone number is (61) 393955324. These premises are owned by Mr. Xin Jin, our sole director CEO and CFO. We occupy the space on a month-to-month basis, rent free. The office space consists of approximately one hundred (100) square meters.\nAs of June 30, 2022, and currently, we have one (1) Company wholly-owned and operating wellness centre. Relevant information with respect to this location is as follows:\nLocation Size of Premises (Sq. Meters) Lease Term Commencement Date Annual Rent\nPoint Cook Outlet Seventy-seven (77) Seven (7) years Renewable for an additional five (5) years 8/21/2019 $55,996 ITEM 3. LEGAL PROCEEDINGS\nThere are presently no pending legal proceedings to which we or any of our property is subject, or any material proceedings to which any director, officer or affiliate of the Company, any owner of record beneficially of more than 5% of any class of our voting securities is a party or has a material interest adverse to us, and no such proceedings are known to us to be threatened or contemplated against us. ITEM 4. MINE SAFETY DISCLOSURES\nNone; not applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock was quoted on the OTC Pink Tier of the OTC Markets under the symbol ARPC until September 28, 2021, when it was reduced to the Expert Market maintained by the OTC Markets because we had failed to comply with the provisions of SEC Rule 15c2-11 by the close of business on such date, regarding the public availability of current information about us that is required by such Rule. Accordingly, our common stock is not eligible for proprietary broker-dealer quotations; and all quotations of our common stock, if any, reflect unsolicited customer orders only.\nNo assurance can be given that any established trading market for our common stock will ever develop or be maintained. We will be required to have a broker-dealer file a Form 211 (and its approval) with FINRA, the OTC Markets or another quotations medium as defined in SEC Rule 15c2-11(e)(1) to initiate or resume public quotations of our common stock, as to which no assurance can be given.\nEven assuming we are able to satisfy the requirements of Form 211, for any market that may develop for our common stock, the sale of shares of our common stock comprised of restricted securities pursuant to Rule 144 of the SEC, any other available exemption from registration under the Securities Act or by registration under the Securities Act by members of management or others, including any person to whom any such securities may be issued in the future, may have a substantial adverse impact on any such public market. For general information regarding the requirements of resales of restricted securities under Rule 144, see the heading Rule 144 of this Item below. Presently, and based upon advice of our legal counsel, we believe Rule 144 will become available for the resale of our shares of common stock by our shareholders so long as we become and remain current in our required reporting obligations under the Exchange Act, regardless of whether we were a former shell company. We have not been a shell company since the filing and subsequent effectiveness of our S-1 Registration Statement on April 15, 2016. The Prospectus of our S-1 Registration Statement contained the Form 10 Information required by subparagraph (i) of Rule 144 for the availability of Rule 144 for former shell companies, and such subparagraph indicates that the issuer may provide the Form 10 Information in any filing of the issuer with the Commission. The filing of this Annual Report and the planned quarterly reports of the Company outlined under the caption Explanatory Note at the forepart of this Annual Report, along with our quarterly report on Form 10-Q for the quarter ended September 30, 2022, should bring the Company current in its required Exchange Act filings for the purposes of Rule 144(c)(1)(i), and the availability of Rule 144 for the resale of our common stock by our shareholders will be contingent on our remaining current in the filing of these required Exchange Act reports. Resales of restricted securities by non-affiliates who have held their respective shares of the Company for in excess of two (2) years may also be publicly sold pursuant to Section 4(a)(1) of the Securities Act, without registration thereunder. The availability of Rule 144 and Section 4(a)(1) of the Securities Act for the resale of our shares of common stock by our shareholders will be reviewed the Company on a case by case basis at the time of the intended sale and before any sale thereof.\nITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nWith 373,950,544 outstanding shares of our common stock as of the date of the filing of this Annual Report, the sale of any number of these outstanding shares could have an adverse effect on any market that may develop in the future for our shares of common stock. 273,460,844 of our shares of common stock are held by non-affiliates who have held their respective shares for in excess of two (2) years, and all of these shares could be considered to be a part of the public float of our shares; approximately 2,75,340 of these shares are held in street name at broker-dealers or in the Depository Trust Company (DTC).\nRule 144\nThe following is a summary of the current requirements of Rule 144, excluding issues related to companies that are or have ever been a shell company:\nSecurities\nAffiliate or Person Selling on Behalf of an Affiliate\nNon-Affiliate (and has not been an Affiliate During the Prior Three Months)\nRestricted Securities of Reporting Issuers\nDuring six-month holding period - no resales under Rule 144 Permitted.\nAfter six-month holding period - may resell in accordance with all Rule 144 requirements including:\nCurrent public information,\nVolume limitations,\nManner of sale requirements for equity securities, and\nFiling of Form 144.\nDuring six-month holding period - no resales under Rule 144 permitted.\nAfter six-month holding period but before one year - unlimited public resales under Rule 144 except that the current public information requirement still applies.\nAfter one-year holding period - unlimited public resales under Rule 144; need not comply with any other Rule 144 requirements.\nRestricted Securities of Non-Reporting Issuers\nDuring one-year holding period - no resales under Rule 144 permitted.\nAfter one-year holding period - may resell in accordance with all Rule 144 requirements including:\nCurrent public information,\nVolume limitations,\nManner of sale requirements for equity securities, and\nFiling of Form 144.\nDuring one-year holding period - no resales under Rule 144 permitted.\nAfter one-year holding period - unlimited public resales under Rule 144; need not comply with any other Rule 144 requirements.\nThe following table sets forth, for the periods indicated over the last four (4) fiscal years, the high and low closing bid quotations, as reported by the OTC Markets, and represents prices between broker-dealers and does not include retail markups, markdowns or commissions, and may not represent actual transactions:\nFor the Years Ended June 30,\n2022\nHigh Low High Low High Low High Low\nFirst Quarter $ 0.31 $ 0.20 $ 0.19 $ 0.11 $ 0.15 $ 0.13 $ 0.0208 $ 0.0208\nSecond Quarter $ 0.22 $ 0.15 $ 0.29 $ 0.11 $ 0.15 $ 0.08 None* None*\nThird Quarter $ 0.50 $ 0.15 $ 0.19 $ 0.05 $ 0.13 $ 0.08 None* None*\nFourth Quarter $ 0.15 $ 0.15 $ 0.42 $ 0.05 $ 0.083 $ 0.011 None* None*\n*Denotes periods when our common stock was dropped to the Expert Market by the OTC Markets.\nWe currently have approximately 1,539 shareholders of record as of November 1, 2022, not including an indeterminate number of shareholders who may hold their shares in street name at broker-dealers or in the DTC. Approximately 364 of our record shareholders own less than 500 shares.\nDividends\nThe Company has not declared or paid any cash dividends on its common stock and does not intend to declare or pay any cash dividend in the foreseeable future. The payment of dividends, if any, is within the discretion of the Board of Directors and will depend on the Companys earnings, if any, its capital requirements and financial condition and such other factors as the Board of Directors may consider.\nRecent Sales of Unregistered Securities; Use of Proceeds from Registered Securities\nFiscal Year Ended June 30, 2022\nNone.\nFiscal Year Ended June 30, 2021\nNone.\nFiscal Year Ended June 30, 2020\n17,537,000 shares of our common stock were issued in one (1) tranche to thirty (30) persons for consulting services provided to us and valued at par value or $0.000001 per share on October 9, 2019; and an aggregate total of 21,861,309 shares of our common stock were issued in a separate tranche to approximately two-hundred and forty-one (241) persons located in various cities in China on January 20, 2020, pursuant to our Company Representative Agreement that is Exhibit 99.1 hereof in Part IV, Item 15, of this Annual Report. These shares were also valued at par value or $0.000001 per share.\nFiscal Year Ended June 30, 2019\n40,000,000 shares of our common stock were issued, 20,000,000 shares each, to Mr. Yew Nic Kien Cheong and Mr. Wang Ruirong, for cash at par value or $0.000001 per share, on April 26, 2019. Mr. Yew is currently a business consultant to the Company.\nAll of the foregoing shares were offered and sold in compliance with the Securities Act registration exemption provided for in Regulation S of the SEC to non-U.S. Persons, and we amended our Bylaws to comply with the provisions of Regulation S. See Exhibit 3(ii), Section 7 thereof, in Part IV, Item 15 hereof. In addition, we relied on Section 4(a)(2) of the Securities Act in the issuance of the common stock during the fiscal year ended June 30, 2019.\nUse of Proceeds of Registered Securities\nNone; not applicable.\nPurchases of Equity Securities by us and Affiliated Purchasers\nNone; not applicable. ITEM 6: SELECTED FINANCIAL DATA\nNot required for smaller reporting companies. ITEM 7: MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nWhen used in this Annual Report, the words may, will, expect, anticipate, continue, estimate, project, intend, and similar expressions are intended to identify forward-looking statements within the meaning of Section 27a of the Securities Act and Section 21e of the Exchange Act regarding events, conditions, and financial trends that may affect our future plans of operations, business strategy, operating results, and financial position. Persons reviewing this Annual Report are cautioned that any forward-looking statements are not guarantees of future performance and are subject to risks and uncertainties and actual results may differ materially from those included within the forward-looking statements as a result of various factors. Such factors are discussed further below under Trends and Uncertainties, and also include general economic factors and conditions that may directly or indirectly impact our financial condition or results of operations. See the caption Forward-Looking Statements at the forepart of this Annual Report.\nOverview of Current and Planned Business Operations\nThrough Sanyi Group, we are engaged in providing wellness services that include acupressure/reflexology, massage therapy and cupping. We offer various types of massage therapy, such as Swedish, deep tissue and hot stone oil, among others, all as discussed in Part I, Item 1. Business, above. We primarily rely on our promotional activities and our shopping centre location in attracting new customers and maintaining our current customers.\nWe have identified future partners from strategic cities in China to help us exploit and expand to the Chinese market for our wellness services in the major cities of China, including Guangzhou, Shenzhen, Fujian, Sichuan, Beijing, Shanghai for fiscal 2023, though these plans are subject to the uncertainties related to the Covid-19 pandemic and other factors, including but not limited to obtaining the required funding for.\nOn March 11, 2020, the World Health Organisation declared the coronavirus outbreak as a pandemic owing to its rapid spread across the globe. A series of precautionary and control measures have been and continue to be implemented across the world by reason of this declaration and the recent furtherance of the pandemic attributable to variants of the coronavirus outbreak.\nThe Australian Government Authority imposed a Movement Control Order related to the Covid-19 pandemic (the MCO) on February 27, 2020. It implemented various MCOs to include travel restrictions and lockdowns to curb the spread of the Covid-19 outbreak in Australia, which have resulted in material adverse effects on Australias economy since 2020 and currently, with variants that continue to pose increased public exposure around the world. On July 6, 2022, border restrictions for people travelling to and from Australia were lifted; and on October 13, 2022, the mandatory isolation of people with Covid-19 ended in Victoria, along with the state of emergency declared by the Victorian Government in 2020.\nJune, 30,\nJune,30,\nJune, 30,\nJune, 30,\nUS$ US$ US$ US$\nRevenue 262,537 201,854 183,857 249,253\nOperating expenses:\nPayroll and employee related expense 94,196 ) (110,502 ) (99,411 ) (130,852 )\nOccupancy expenses - - - (68,146 )\nDepreciation expense - - (67,950 ) (7,416 )\nDepreciation on right-of-use assets (64,884 ) (66,756 ) (55,013 ) -\nFinance cost (11,378 ) (13,703 ) (12,730 ) -\nMotor vehicle expenses - - (816 ) (3,550 )\nGeneral and administrative expenses (110,253 ) (48,264 ) (24,200 ) (34,026 )\nTotal Operating expenses (280,711 ) (239,225 ) (260,120 ) (243,990 )\nIncome/(loss) from operations (18,174 ) (37,371 ) (76,263 ) 5,263\nOther income 60,206 92,759 18,925 -\nInterest income 433\nIncome/(deficit) from continuing operations before income tax expenses 42,111 55,585 (57,223 ) 5,696\nIncome tax expense - - - (826 )\nNet income/(deficit) after income tax expense for the year 42,111 55,585 (57,223 ) 4,870\nExchange differences arising on translation of foreign operations (3,765 ) (6,943 ) (876 )\nTotal comprehensive income/(deficit) for the year 38,346 48,642 (58,099 ) 5,264\nWe have accounted for the impact of the pandemic and its consequential effects on our results of operations in our consolidated financial statements for the fiscal years ended June 30, 2022, 2021, and 2020. The Covid-19 pandemic has had a negative impact on our performance for these financial years due to travel and movement restrictions and other precautionary measures imposed by the relevant local authorities. Our revenue and the profit for the fiscal years ended June 30, 2021, and 2020, has dropped significantly.\nResults of Operations\nComparison of the Fiscal Year Ended June 30, 2022, to the Fiscal Year Ended June 30, 2021\nRevenue\nFor the fiscal year ended June 30, 2022, we had $262,537 in revenue compared to $201,854 for the fiscal year ended June 30, 2021, which is an increase of $60,683 from the previous year. The revenue increase is mainly due to the Australian Government Authority starting to allow occasional people movement and the removal of Covid-19 lockdowns allowing our wellness centre to be open for business. The opening of our business operation and the cessation of the lockdown supported a higher revenue.\nPayroll and employee related expense\nFor the fiscal year ended June 30, 2022, our payroll and employee related expense decreased by US$16,306 to US$94,196 as compared to the fiscal year ended June 30, 2021, of US$110,502. There was a period of approximately two (2) months whereby the wellness center was closed as requested by the Australia Government Authoritys MCO. As employees are employed on an hourly basis, no staff was reported working during that period. The MCO lead to reduced staff costs incurred for that period and thus reduced payroll cost in the fiscal year ended June 30, 2022.\nDepreciation on right-of-use assets\nDepreciation expense was US$64,884 for the fiscal year ended June 30, 2022, as compared to fiscal year ended June 30, 2021, of US$66,756, a decrease of US$1,872, arising from foreign exchange translation.\nGeneral and Administrative Expenses\nFor the fiscal year ended June 30, 2022, general and administrative expense increased by US$61,989 to US$110,253, compared to the fiscal year ended June 30, 2021, of US$37,611 The increase in expense resulted from high professional fees paid in the quarter ended March 31, 2022. Also, the impact of Covid-19 began to diminish in 2022; accordingly, general and administrative expense increased.\nNet Income/ (deficit) after tax\nEven though our revenue has slowly recovered from the pandemic, our net income still decreased by US$13,474, mainly due to the reduces in Covid-19s subsidized in the year.\nComparison of the Three Months Ended March 31, 2022, to the Three Months Ended March 31, 2021\nRevenue\nFor the three months ended March 31, 2022, we had revenue of US$77,768, as compared to the three months ended March 31, 2021, amounting to US$69,577, or an increase of US$8,191. The increase in revenue resulted from the recovery of Australian economy and resuming of business activities in Australia as the Covid-19 pandemic MCO ended.\nPayroll and employee related expense\nFor the three months ended March 31, 2022, our payroll and employee related expense was US$27,687, as compared to the three months ended March 31, 2021, amounting to US$36,444, a decrease of US$8,757. The payroll and employee related expense including superannuation contribution (employee benefits), employee membership fees, labour hiring costs and staff amenities were lower too. There were reduces in headcount for the period ended March 31, 2022, as compared to headcount for the period ended March 31, 2021, which accounted for this decrease.\nDepreciation on right-of-use assets\nFor the three months ended March 31, 2022, the depreciation on right-of-use assets decreased by US$1,088, compared to the three months ended March 31, 2021, of US$17,273, a decrease to US$16,185 for three months ended March 31, 2022. This decrease was due to fluctuating exchange rate of the U.S Dollar against Australian Dollar.\nGeneral and Administrative Expenses\nFor the three months ended March 31, 2022, general and administrative expense increased by US$11,747, from the three months ended March 31, 2022, of US$15,572, compared to the three months ended March 31, 2021, of US$3,825. The increased expense resulted from professional fee charges for preparing audit required documents.\nOperating Expenses\nFor the three months ended March 31, 2021, our operating expenses were US$57,542, compared to the three months ended March 31, 2022, of US$59,444. Operating expenses consisted of payroll and employee related expenses, depreciation on right-of-use assets, and general and administrative expenses.\nNet income after income tax\nFor the three months ended March 31, 2022, we had a net income after income tax of US$15,550, compared to the three months ended March 31, 2021, of US$27,142.\nComparison of the Nine Months Ended March 31, 2022, to the Nine Months Ended March 31, 2021\nRevenue\nFor the nine months ended March 31, 2022, we had revenue of US$178,608, compared to the nine months ended March 31, 2021 amounting to US$137,302, or an increase of US$41,306. Our business increased rapidly in late half year of 2021 when the Australian Government lifted its MCO lockdown, though some safety movement restriction remained. The revenue increase in 2022 is mainly the result of the Covid-19 pandemic easing and the related restrictions being primarily removed.\nPayroll and employee related expense\nFor the nine months ended March 31, 2022, our payroll and employee related expense was US$63,844, compared to the nine months ended March 31, 2021, of US$77,740, or a decrease of US$13,896. The payroll and employee related expense including superannuation contribution, employee membership fees, labour hiring costs and staff amenities were lower too. The number of headcounts reduced from five (5) staff members as at March 31, 2021, to three (3) as at March 31, 2022.\nDepreciation on right-of-use assets\nFor the nine months ended March 31, 2022, the depreciation on right-of-use assets decreased by US$683 to US$48,895, compared to the nine months ended March 31, 2021, of US$49,578. This decrease was due to fluctuating exchange rate of the U.S Dollar against Australian Dollar.\nGeneral and Administrative Expenses\nFor the nine months ended March 31, 2022, general and administrative expense increased by US$10,141 with US$25,597 for the period ended March 31, 2022, compared to the nine months ended March 31, 2021, of US$15,456. The increase in expense resulted from high professional fees paid in the quarter ended March 31, 2022. Also, the impact of Covid-19 began to diminish in 2022; accordingly, general and administrative expense increased.\nOperating Expenses\nFor the nine months ended March 31, 2021, our operating expenses were US$142,774, compared to the nine months ended March 31, 2022, of US$138,336. Operating expenses consisted of payroll and employee related expenses, depreciation on right-of-use assets, and general and administrative expenses.\nNet income after income tax\nFor the nine months ended March 31, 2022, we had a net income after income tax of US$59,700 compared to the nine months ended March 31, 2021, of US$57,443.\nComparison of the Three Months Ended December 31, 2021, to the Three Months Ended December 31, 2020\nRevenue\nFor the three months ended December 31, 2021, we had revenue of US$75,991, compared to the three months ended December 31, 2020, of US$54,194, with an increase of US$21,797. Our business increased rapidly in late half year of 2021 when the Australian Government lifted its MCO lockdown, though some safety movement restriction remained.\nPayroll and employee related expense\nFor the three months ended December 31, 2021, our payroll and employee related expense was US$23,439, compared to the three months ended December 31, 2020, of US$24,016, or a decrease of US$577. The payroll and employee related expense including superannuation contribution, employee membership fees, labour hiring costs and staff amenities. These costs were also lower for the three month ended December 31, 2021.\nDepreciation on right-of-use Assets\nFor the three months ended December 31, 2021, the depreciation on right-of-use assets decreased by US$38 to US$16,285, compared to the three months ended December 31, 2020, of US$16,323. This decrease was due to fluctuating exchange rate of the U.S Dollar against Australian Dollar.\nGeneral and Administrative Expenses\nFor the three months ended December 31, 2021, general and administrative expense increased by US$3,282, or US$5,608, compared to the three months ended December 31, 2020, of US$2,326. The increase resulted from increased accounting fees for the period ended December 31, 2021.\nOperating Expenses\nFor the three months ended December 31, 2021, our operating expenses were US$45,332, compared to the three months ended December 31, 2020, of US$42,665. Operating expenses consisted of payroll and employee related expenses, depreciation on right-of-use assets and general and administrative expenses.\nNet Income\nFor the three months ended December 31, 2021, we had a net income after income tax of US$40,058 compared to the three months ended December 31, 2020, of US$28,100. The revenue increase in 2022 was mainly the result of the Covid-19 pandemic easing and the related restrictions being primarily removed.\nComparison of the Six Months Ended December 31, 2021, to the Six Months Ended December 31, 2020\nRevenue\nFor the six months ended December 31, 2021, we had revenue of US$100,840, compared to the six months ended December 31, 2020, of US$67,725, or an increase of US$33,115. Our business increased rapidly in late half year of 2021 when the Australian Government lifted its MCO lockdown, though some safety movement restriction remained.\nPayroll and employee related expense\nFor the six months ended December 31, 2021, our payroll and employee related expense was US$36,157, compared to the six months ended December 31, 2020, of US$41,296, or a decrease of US$5,139. The payroll and employee related expense including superannuation contribution, employee membership fees, labour hiring costs and staff amenities. These costs were also lower for the six month ended December 31, 2021.\nDepreciation on right-of-use assets\nFor the six months ended December 31, 2021, the depreciation on right-of-use assets increased by US$405 to US$32,710, compared to the six months ended December 31, 2020, of US$32,305. This increase was due to fluctuating exchange rate of the U.S Dollar against Australian Dollar.\nGeneral and Administrative Expenses\nFor the six months ended December 31, 2021, the general and administrative expense amounting to US$10,025, decreased by US$1,606, compared to the six months ended December 31, 2020, of US$11,631. The decrease in general and administrative expenses resulted from management imposing tight controls on cost saving in order to increase liquidity and cashflow.\nOperating Expenses\nFor the six months ended December 31, 2021, our operating expenses were US$78,892, compared to the six months ended December 31, 2020, of US$85,232. Operating expenses consisted of payroll and employee related expenses, depreciation on right-of-use assets, and general and administrative expenses.\nNet Income after income tax\nFor the six months ended December 31, 2021, we had a net income after income tax of US$44,150, compared to the six months ended December 31, 2020, of US$30,301. The decrease was primarily due to the effects of the Covid-19 pandemic and the MCO in 2020.\nComparison of the Three Months Ended September 30, 2021, to the Three Months Ended September 30, 2020\nRevenue\nFor the three months ended September 30, 2021, we had revenue of US$24,849, compared to the three months ended September 30, 2020, of US$13,531, or an increase of US$11,318. Our business increased in late half year of 2021 when the Australian Government lifted up its MCO lockdown, while some safety movement restriction remained.\nPayroll and employee related expense\nFor the three months ended September 30, 2021, our payroll and employee related expense was US$12,718, compared to the three months ended September 30, 2020, of US$17,280, or a decrease of US$4,562. The payroll and employee related expense including superannuation contribution, employee membership fees, labour hiring costs and staff amenities. These differences resulted from reduced headcount and tighter cost controls.\nDepreciation right-of-use assets\nFor the three months ended September 30, 2021, the depreciation right-of-use assets amounting to US$16,425. The cost had increased by US$443, compared to the three months ended September 31, 2020, of US$15,982. This increase was due to the fluctuating exchange rate of the U.S Dollar against Australian Dollar.\nGeneral and Administrative Expenses\nFor the three months ended September 30, 2021, general and administrative expense amounting to US$4,417, had decreased by US$4,888, compared to the three months ended September 30, 2020, of US$9,305. The decrease in general and administrative expenses were not the direct cost of running the wellness center; and management had imposed tight control on cost savings in order to increase liquidity and cashflow.\nOperating Expenses\nFor the three months ended September 30, 2021, our operating expenses were US$33,560, compared to the three months ended September 30, 2020, of US$42,567. Operating expenses consisted of payroll and employee related expenses, depreciation on right-of-use assets, and general and administrative expenses.\nNet Income after tax\nFor the three months ended September 30, 2021, we had a net income after income tax of US$4,092 compared to the three months ended September 30, 2020, US$2,201. The decrease was primarily due to the effects of the Covid-19 pandemic and the MCO in 2020.\nComparison of the Fiscal Year Ended June 30, 2021, to the Fiscal Year Ended June 30, 2020\nRevenue\nFor the fiscal year ended June 30, 2021, we had US$201,854 in revenue compared to US$183,857 for the fiscal year ended June 30, 2020, which is an increase of US$17,997 from the previous year. The Covid-19 outbreak in the fiscal year ended June 30, 2020, had an adverse effect on our business performances and overall affect our business operations. There were increasing Covid-19 cases reported in the Victoria boundaries, and the Australia Government Authority imposed lockdowns and movement restrictions. However, in the fiscal year ended June 30, 2021, these cases had been tightly controlled and local authorities had lifted the MCO lockdown. The business operations resumed, and we were able to generate increase revenue in fiscal 2021.\nPayroll and employee related expense\nFor the fiscal year ended June 30, 2021, our payroll and employee related expense amounting to US$110,502, increased by US$11,091, compared to the fiscal year ended June 30, 2020, of US$99,411. As the Covid-19 pandemic lockdown was removed by the Australian Government Authority and as our wellness centre was re-opened for business, we incurred a higher running cost during this operation period. The payroll and employee related expense included superannuation contribution, employee membership fee, labour hiring costs and staff amenities.\nOccupancy Expense\nUpon adoption of ASU 842 on July 1, 2019, all occupancy expenses have been capitalized whereby lease assets and liabilities are recognized at the present value of the future lease payments at the lease commencement date.\nDepreciation Expense\nFor the fiscal year ended June 30, 2021, we had no depreciation expense compared to fiscal year ended June 30, 2020, in which we had US$67,950 in depreciation expense. All of our fixed assets were fully depreciated in the previous fiscal year, which is why there was no depreciation expense in 2021.\nDepreciation on right-of-use assets\nUpon adoption of right-of-use asset and leasing liabilities on July 1 2019, the depreciation of US$55,013 was recognized in the fiscal year ended June 30, 2020, of US$66,756 for the fiscal year ended June 30, 2021, or an increase of US$11,743 arising from foreign exchange translation.\nGeneral and Administrative Expenses\nFor the fiscal year ended June 30, 2021, general and administrative expense increased by US$24,064 to US$48,264, compared to the fiscal year ended June 30, 2020, of US$24,200. During the Covid-19 pandemic duration, the Australian Government Authority relaxed the MCO lockdown period allowing outlets to be opened for business, causing higher expenditures, such as utilities, shop supplies and higher professional expenses, along with inflation in Australia and the fluctuating exchange rate of the U.S. Dollar against Australian Dollar during this period.\nOperating Expenses\nFor the fiscal year ended June 30, 2021, we had total operating expenses of US$239,225, compared to the fiscal year ended June 30, 2020, of US$260,120. Operating expenses consisted of payroll and employee related expense, occupancy expense, depreciation on right-of-use assets, finance cost and general and administrative expenses.\nOther Comprehensive Income/Loss\nFor the fiscal year ended June 30, 2021, we had a total comprehensive income of US$48,642 after the loss from the currency exchange rate of US$6,943, compared to the fiscal year ended June 30, 2020, where we had a total comprehensive loss of (US$58,099), after the loss from the currency exchange rate of US$876.\nComparison of the Fiscal Year Ended June 30, 2020, to the Fiscal Year Ended June 30, 2019\nRevenue\nFor the fiscal year ended June 30, 2020, we had revenue of US$183,857, compared to fiscal ended June 30, 2019, of US$249,253, or a decrease of US$65,396. The lower revenue resulted from our wellness centre not being fully open for business for the year caused by the Covid-19 pandemic whereby the Australian Government Authority implemented very frequent lockdown periods and restrictions on peoples movement under its MCO.\nPayroll and employee related expense\nFor the fiscal year ended June 30, 2020, our payroll and employee related expense was US$99,411, compared to the fiscal year ended June 30, 2019, of US$130,852, or a decrease of US$31,441. The payroll and employee related expense, including superannuation contribution, employee membership fees, labour hiring costs and staff amenities were lower too.\nOccupancy Expense\nFor the fiscal year ended June 30, 2020, all occupancy expenses had been capitalized calculated based on the net present value. Thus no occupancy expenses was recognized for year 2020.\nDepreciation Expense\nFor the fiscal year ended June 30, 2020, the depreciation expense increased by US$60,534 to US$67,950, compared to the fiscal year ended June 30, 2019, of US$7,416. This increase was due to an instant asset written-off under accounting policy. Renovation to the centre was performed and fully depreciated during the fiscal year of June 30, 2020.\nGeneral and Administrative Expenses\nFor the fiscal year ended June 30, 2020, general and administrative expense decreased by US$9,826 to US$24,200, compared to the fiscal year ended June 30, 2019, of US$34,026. The lower expense resulted from our wellness centre being closed for a much longer period during the Covid-19 pandemic as Australian Government Authority imposed longer and frequent shutdown periods and restricted people movement.\nOperating Expenses\nFor the fiscal year ended June 30, 2020, our operating expenses were US$260,120, compared to the fiscal year ended June 30, 2019, of US$243,990. Operating expenses consisted of payroll and employee related expenses, occupancy expense, depreciation expense, depreciation on right-of-use assets, finance cost, motor vehicle expense and general and administrative expenses.\nOther Comprehensive Income/Loss\nFor the fiscal year ended June 30, 2020, we had a total comprehensive loss of (US$58,099) after the loss from currency exchange rate of US$876 compared to the fiscal year ended June 30, 2019, or a total comprehensive income of US$5,264, after the income from currency exchange rate of US$394.\nLiquidity and Capital Resources\nAt June 30, 2022, we had a net tangible asset of US$10,452 (June 30, 2021 net liability of US$27,894). We reported an after tax income of US$38,488 for the fiscal year ended June 30, 2022 (June 30, 2021 after tax income of US$48,642).\nSummary of Significant Accounting Policies\nThe consolidated financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America and are presented in U.S. dollars. The Companys fiscal year end is June 30.\nUse of Estimates and Assumptions\nThe preparation of consolidated financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the periods discussed. Actual results could differ from those estimates.\nForeign Currency Translation\nThe functional currency of our foreign subsidiary is its local currency. Assets and liabilities of the foreign subsidiary are translated into U.S. dollars at period-end exchange rates, stockholders equity is translated at the historical rates and the consolidated statement of operations and cash flows are translated at average exchange rates during the reporting periods. Resulting translation adjustments are recorded in accumulated other comprehensive income, a separate component of stockholders equity. A component of accumulated other comprehensive income will be released into income when the Company executes a partial or complete sale of an investment in a foreign subsidiary or a group of assets of a foreign subsidiary considered a business and/or when the Company no longer holds a controlling financial interest in a foreign subsidiary or group of assets of a foreign subsidiary considered a business.\nTransactions denominated in currencies other than the local currency are recorded based on exchange rates at the time such transactions arise. Subsequent changes in exchange rates result in foreign currency transaction gains and losses that are reflected in results of operations as unrealized (based on period end translation) and realized (upon settlement of the transactions) and reported under other general expenses in the consolidated statement of operations.\nFair Value of Financial Instrument\nThe Companys financial instruments exposed to concentrations of credit risk consist primarily of cash and cash equivalents. Cash and cash equivalents are held in several Australian bank accounts and time deposit accounts. We regularly assesses the level of credit risk we are exposed to and whether there are better ways of managing credit risk. We invests our cash and cash equivalents with reputable financial institutions. The Company has not incurred any losses related to these deposits.\nIncome Taxes\nPotential benefits of income tax losses are not recognized in the accounts until realization is more likely than not. The Company has adopted ASC 740-10-50 Accounting for Income Taxes as of its inception. Pursuant to the standard, the Company is required to compute tax asset benefits for initial years of operating losses carried forward.\nBasic and Diluted Net Income (Loss) Per Share\nThe Company computes net income (loss) per share in accordance with ASC 260-10-4-5, Earnings per Share. The standard requires presentation of both basic and diluted earnings per share (EPS) on the face of the income statement. Basic EPS is computed by dividing net income (loss) available to common shareholders (numerator) by the weighted average number of common shares outstanding (denominator) during the periods discussed. Diluted EPS gives effect to all dilutive potential common shares outstanding during the periods discussed, including stock options, using the treasury stock method, and convertible preferred stock, using the if-converted method. In computing diluted EPS, the average stock price for the period is used in determining the number of shares assumed to be purchased from the exercise of stock options or warrants. Diluted EPS excludes all dilutive potential common shares if their effect is anti-dilutive.\nRecent accounting Pronouncements\nASU 2016-02, Leases (Topic 842). ASC 842 requires companies to generally recognize operating and financing lease liabilities and corresponding ROU assets on their balance sheet. Leases will be classified as finance or operating leases, with classification affecting the pattern and classification of expense recognition in the consolidated statements of operation. Effective in year 2020, the Company adopted this new standard prospectively using a modified retrospective transition approach.\nThe Company elected the package of practical expedients permitted under the transition guidance of the new standard, which allowed the Company to carry forward its historical assessment on whether a contract is or contains a lease, lease classification, and initial direct costs. Upon adoption in year 2020, the Company recognized ROU assets and lease liability of $437.2 thousand. The adoption of ASC 842 did not have a material impact to Companys consolidated statements of operations and cash flows from operations.\nASU 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments. This standard update, along with subsequent ASUs, replaces the incurred loss impairment methodology with an expected credit loss model for which a company recognizes an allowance based on the estimate of expected credit loss. The Company adopted the standard in year 2020 on a modified retrospective basis. The adoption of the new standard did not have a material impact on the Companys consolidated financial statements.\nRecent accounting Pronouncements\nIn May 2014, the Financial Accounting Standards Board issued Accounting Standards Update No. 2014-09, Revenue from Contracts with Customers (ASU 2014-09) or (ASC Topic 606), which supersedes nearly all existing revenue recognition guidance under U.S. GAAP. The new guidance provides a five-step process for recognizing revenue that depicts the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. The new guidance also requires expanded qualitative and quantitative disclosures related to the nature, amount, timing and uncertainty of revenue and cash flows arising from contracts with customers. The new guidance is effective for public companies with annual reporting periods beginning after December 31, 2017, and is to be applied either retrospectively to each prior reporting period presented or retrospectively with the cumulative effect of initially applying it recognized at the date of initial adoption. Early adoption is permitted for all entities but not before the original effective date for public entities. The Company adopted ASC Topic 606 in year 2019.\nThe FASB issued ASU 2019-12, Simplifying the Accounting for Income Taxes (Topic 740), which is intended to simplify various aspects related to accounting for income taxes. The new standard is effective for the Company in year 2021. The Company is currently evaluating the impact of the new standard on its consolidated financial statements and related disclosures but does not expect it to have a material impact. ITEM 7A: QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nItem 305 of SEC Regulation S-K provides that certain registrants are required to categorize market risk sensitive instruments into instruments entered into for trading purposes and instruments entered into for purposes other than trading purposes. Within both the trading and other than trading portfolios, separate quantitative information shall be presented, to the extent material, for each market risk exposure category (i.e., interest rate risk, foreign currency exchange rate risk, commodity price risk, and other relevant market risks, such as equity price risk). These requirements are not applicable to smaller reporting companies under subsection (e) thereof. ITEM 8: FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nAudited financial statements of the Company for the fiscal years ended June 30, 2022, 2021, 2020, and 2019, begin on the following page of this Annual Report (followed by the unaudited and compared consolidated financial statements of the Company for the quarterly periods ended September 2021, and 2019; December 31, 2021, and 2020; and March 31, 2022, and 2021.\nReport of Independent Registered Public Accounting Firm [PCAOB ID 3487]\nTo the Shareholder and Board of Director\nArem Pacific Corporation\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Arem Pacific Corporation (the Company) and its subsidiaries (the Group) as of June 30 2019, 2020, 2021 and 2022, the related consolidated statements of comprehensive income and other comprehensive income, changes in stockholders equity/(deficit), and cash flows for the years ended June 30 2019, 2020, 2021 and 2022, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Group as of June 30 2019, 2020, 2021 and 2022 and the results of its operations and its cash flows for the years ended June 30 2019, 2020, 2021 and 2022, in conformity with U.S. generally accepted in the United States of America (U.S. GAAP).\nMaterial Uncertainty Related to Going Concern\nThe accompanying financial statements have been prepared assuming the Group will continue as a going concern. As discussed in Note 1.3 to the consolidated financial statements, the Group incurred net losses of US$58,099 during the year ended June 30 2020. The Group had net current liabilities as at 30 June, 2019, 2020, 2021 and 2022 of US$57,102, US$112,010, US$59,672 and US$17,497 respectively. Besides the Group as of 30 June, 2019, 2020 and 2021 its negative net stockholders deficit of US$18,476, US$76,536 and US$27,894 respectively. These event or conditions indicates that a material uncertainly exist that may cast significant doubt on the Groups ability to continue as a going concern.\nThe consolidated financial statements have been prepared on a going concern basis in view of the Group will be able to obtain continued financial support from its shareholder or its ability to obtain external financing.\nThe validity of the going concern basis on which the consolidated financial statements are prepared depends on the Groups ability to operate as a going concern as set forth above. The assumptions are premised on future events, the outcome of which are inherently uncertain. Managements plans in regard to these matters are also described in Note 1.3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Groups management. Our responsibility is to express an opinion on these consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (‘‘PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nAs part of our audit of the consolidated financial statements for the year ended June 30 2019, 2020, 2021 and 2022, we also audited those adjustments that were applied to restate the consolidated financial statements for the year ended June 30, 2021 and 2022. In our opinion, such adjustments are appropriate and have been properly applied. We were not engaged to audit, review, or apply any procedures to the financial statements for the year ended June 30, 2017 and 2018 of the Group and accordingly, we do not express an opinion or any other form of assurance on the financial statements for the year ended June 30, 2017 and 2018 as a whole.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Group is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Groups internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\nOther Matters\nThe financial statements of the Group for the year ended June 30, 2016 were audited by another auditor who expressed an unmodified opinion on those financial statements on September 27, 2016.\nThe financial statements of the Group for the fiscal years ended June 30 2017, and June 30 2018, have not been audited, and we do not express any opinion or any other form of assurance on the financial statements for the fiscal years ended June 30, 2017 and 2018, as a whole.\n/s/ Audit Alliance LLP\nWe have served as the Companys auditor since 2019.\nSingapore\nNovember 21, 2022\nAREM PACIFIC CORPORATION\nCONSOLIDATED BALANCE SHEETS\nNote 2019\nUS$ US$ US$ US$\nAssets\nCash and cash equivalents 116,963 140,136 31,595 41,438\nOther assets 20,395 22,257 20,318 15,264\nOther receivables 1,036 3,522\nTotal current assets\n137,565 162,619 52,949 60,224\nPlant and equipment, net of accumulated depreciation - - - 38,626\nRight-of-use assets 251,466 341,632 373,219 -\nTotal non-current assets\n251,466 341,632 373,219 38,626\nTotal assets\n389,031 504,251 426,168 98,850\nLiabilities and Stockholders Equity/(Deficit)\nLiabilities\nAccrued and other liabilities 85,025 38,891 2,500 2,333\nBorrowings 9,625 123,274 112,533 114,993\nLease liabilities 60,412 60,126 49,926 -\nTotal current liabilities\n155,062 222,291 164,959 117,326\nLease liabilities 223,517 309,854 337,745 -\nTotal non-current liability\n223,517 309,854 337,745 -\nTotal liabilities\n378,579 532,145 502,704 117,326\nStockholders Equity/(deficit)\nCommon stock, $0.000001 par value, 500,000,000 shares authorized and 373,950,544 (2019: 294,552,235) shares issued and outstanding, respectively 356\nAdditional paid in capital\n157,150 157,150 157,150 157,150\nOther comprehensive (loss)/income (7,434 ) (3,669 ) 3,274 4,150\nAccumulated losses\n(139,620 ) (181,731 ) (237,316 ) (180,093 )\nTotal stockholders equity/(deficit)\n10,452 (27,894 ) (76,536 ) (18,476 )\nTotal liabilities and stockholders equity/(deficit)\n389,031 504,251 426,168 98,850\nThe accompanying notes are an integral part of these condensed audited consolidated financial statements.\nAREM PACIFC CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME AND OTHER COMPREHENSIVE INCOME\nNote 2019\nUS$ US$ US$ US$\nRevenue\n262,537 201,854 183,857 249,253\nOperating expenses\nPayroll and employee related expense\n94,196 110,502 99,411 130,852\nOccupancy expenses\n- - - 68,146\nDepreciation expense\n- - 67,950 7,416\nDepreciation on right-of-use assets\n64,884 66,756 55,013 -\nMotor vehicle expenses\n- - 3,550\nGeneral and administrative expenses\n110,253 48,264 24,200 34,026\nTotal operating expenses\n269,333 225,522 247,390 243,990\nIncome/(loss) from operations\n71,204 (23,668 ) (63,533 ) 5,263\nInterest expenses\n(11,378 ) (13,703 ) (12,730 ) -\nOther income\n60,206 92,759 18,925 -\nInterest income\n433\nTotal other income\n48,907 79,253 6,310\nIncome/(loss) from continuing operations before income tax expenses\n42,111 55,585 (57,223 ) 5,696\nIncome tax expense - - - (826 )\nNet income/(loss) after income tax expense for the year\n42,111 55,585 (57,223 ) 4,870\nOther comprehensive income/(loss)\nExchange differences arising on translation of foreign operations\n(3,765 ) (6,943 ) (876 )\nOther comprehensive income/(loss)\n(3,765 ) (6,943 ) (876 )\nTotal comprehensive income/(loss) for the year\n38,346 48,642 (58,099 ) 5,264\nNet income/(loss) per share\nBasic and diluted\n0.0001025 0.000130 (0.0001554 ) 0.00001573\nWeighted average number of common stock outstanding\nBasic and diluted\n373,950,544 373,950,544 373,950,544 334,552,235\nThe accompanying notes are an integral part of these consolidated financial statements.\nAREM PACIFIC CORPORATION\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY/DEFICIT\nAdditional Other\nCommon Stock Paid in Comprehensive Accumulated Total\nShares Amount Capital Earnings Losses Deficit\nBalance as of\nJune 30, 2018\n294,552,235 157,150 3,756 (184,963 ) (23,780 )\nShare issued for Cash 40,000,000 - - -\nIncome after income tax expense for the year - - - - 4,870 4,870\nOther comprehensive income - - - -\nTotal comprehensive income for the year 40,000,000 - 4,870 5,264\nBalance as of\nJune 30, 2019\n334,552,235 157,150 4,150 (180,093 ) (18,476 )\nShare issued for Cash 39,398,309 - - -\nLoss after income tax expense for the year - - - - (57,223 ) (57,223 )\nOther comprehensive loss - - - (876 ) - (876 )\nTotal comprehensive loss for the year 39,398,309 - (876 ) (57,223 ) (58,099 )\nBalance as of\nJune 30, 2020\n373,950,544 157,150 3,274 (237,316 ) (76,536 )\nIncome after income tax expense for the year - - - - 55,585 55,585\nOther comprehensive loss - - - (6,943 ) - (6,943 )\nTotal comprehensive loss for the year - - - (6,943 ) 55,585 48,642\nBalance as of\nJune 30, 2021\n373,950,544 157,150 (3,669 ) (181,731 ) (27,894 )\nIncome after income tax expense for the year - - - - 42,111 42,111\nOther comprehensive loss - - - (3,765 ) - (3,765 )\nTotal comprehensive loss for the year - - - (3,765 ) 42,111 38,346\nBalance as of\nJune 30, 2022\n373,950,544 157,150 (7,434 ) (139,620 ) 10,452\nCommon Stock\nAdditional Paid-in Capital\nOther Comprehensive Earnings\nAccumulated Losses\nThe accompanying notes are an integral part of these condensed audited consolidated financial statement.\nAREM PACIFIC CORPORATION\nCONSOLIDATED STATEMENT OF CASH FLOWS\n2019\nUS$ US$ US$ US$\nCash flows from operating activities:\nNet income/(loss) before income tax expenses 42,111 55,585 (57,223 ) 5,696\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation of plant and equipment - - 67,950 7,416\nDepreciation on right-of-use assets 64,884 66,756 55,013 -\nInterest expenses 11,378 13,703 12,730 -\nInterest income (79 ) (197 ) (115 ) (433 )\nNet changes in operating assets and liabilities\nDecrease/(increase) in other receivables 1,881 (1,129 ) (4,926 ) 8,489\n(Decrease)/increase in accrued and other liabilities (67,515 ) 47,132 (2,293 ) (31,519 )\nCash used in operating activities 52,660 181,850 71,136 (10,351 )\nIncome tax refund/paid - - 2,358 (4,348 )\nInterest received 433\nNet cash generated from/(used in) operating activities 52,739 182,047 73,609 (14,266 )\nCash flows from investing activity\nPurchase of plant and equipment - - (30,974 ) -\nNet cash used in investing activity - - (30,974 ) -\nCash flows from financing activities\nProceed from issuance of shares - -\nRepayment of lease liabilities (55,097 ) (52,860 ) (40,561 ) -\nRepayment of interest on lease liability (11,378 ) (13,703 ) (12,730 )\nNet cash (used in)/generated from financing activities (66,475 ) (66,563 ) (53,252 )\nNet (decrease)/increase in cash and cash equivalents (13,736 ) 115,484 (10,617 ) (14,226 )\nCash and cash equivalents at the beginning of year 140,136 31,595 41,438 53,192\nExchange difference on translation of foreign operations (9,437 ) (6,943 ) 2,472\nCash and cash equivalents at the end of year 116,963 140,136 31,595 41,438\nThe accompanying notes are an integral part of these condensed unaudited consolidated financial statements.\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n1. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n1.1 Nature of Operations\nArem Pacific Corporation (Delaware), sometimes referred to as the Company below, has been focusing of its business to operation of Oriental holistic health wellness centre located in Australia (Victoria) through its wholly-owned subsidiary Sanyi Group Pty. Ltd. (Sanyi Group). Sanyi Group operates one wellness centre in Victoria, Australia.\nUnless the context indicates otherwise, the term Group as used herein includes the Company and Sanyi Group.\n1.2 Basis of Accounting\nThe accompanying consolidated financial statements include the accounts its wholly owned subsidiary Sanyi Group Pty Ltd which is a company domiciled in Australia. These consolidated financial statements have been prepared in accordance with the accounting principles generally accepted in the United States (GAAP) and Regulation S-X published by the U.S. Securities and Exchange Commission (the SEC). All intercompany accounts and transactions have been eliminated. The Group has evaluated events or transactions through the date of issuance of this report in conjunction with the preparation of these consolidated financial statements. All amounts presented are in US dollars, unless otherwise noted.\nThe consolidated financial statements, except for cash flow information, have been prepared on an accruals basis and are based on historical costs, modified, where applicable, by the measurement at fair value of selected non-current assets, financial assets and financial liabilities. The amounts presented in the consolidated financial statements have been rounded to the nearest dollar.\n1.3 Going Concern Basis\nThese consolidated financial statements have been prepared on a going concern basis, which assumes the Group will continue its operations in the foreseeable future and that the Group will be able to realize its assets and discharge its liabilities in the normal course of operations. The Group incurred net losses of US$58,099 during the year ended June 30 2020. The Group had net current liabilities as of June 30, 2019, 2020, 2021, and 2022, of US$57,102, US$112,010, US$59,672 and US$17,497, respectively. Besides the Group as of June 30, 2019, 2020, and 2021, had a negative net stockholders deficit of US$18,476, US$76,536, US$27,894, respectively.\nThe Group believes that there are reasonable grounds to support the fact that it will be able to pay its debts as and when they become due and payable. In forming this opinion, the Group has considered the following factors:\n(i) As at June 30, 2022, US$9,625 of the borrowings was owed to Xin Jin, a significant shareholder and an officer of the Company and the sole Director of the Company.\n(ii) The Company has received a Letter of Support from Xin Jin, in which he offers to provide continuing financial support to Sanyi Group to enable it to meet its liabilities as and when they become due and payable for a period of not less than twelve (12) months from the date of the financial statements. The loan of $9,625 as of June 30, 2022, to Sanyi Group, will not be called upon without giving at least thirteen (13) months notice.\nIf the Group is unable to continue as a going concern, it may be required to realise its assets and extinguish its liabilities other than in the ordinary course of business at amounts different from those stated in the consolidated financial statements. The consolidated financial statements do not include adjustments relating to the recoverability and classification of recorded asset amounts or to the amounts and classification of liabilities that might be necessary should the Group not continue as a going concern.\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n1.4 Use of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\n1.5 Foreign Currency Translation\nThe functional currency of our foreign subsidiary is its local currency. Assets and liabilities of the foreign subsidiary are translated into U.S. dollars at period-end exchange rates, stockholders equity is translated at the historical rates and the consolidated statement of operations and cash flows are translated at average exchange rates during the reporting periods. Resulting translation adjustments are recorded in accumulated other comprehensive income, a separate component of stockholders equity. A component of accumulated other comprehensive income will be released into income when the Group executes a partial or complete sale of an investment in a foreign subsidiary or a group of assets of a foreign subsidiary considered a business and/or when the Group no longer holds a controlling financial interest in a foreign subsidiary or group of assets of a foreign subsidiary considered a business.\nTransactions denominated in currencies other than the local currency are recorded based on exchange rates at the time such transactions arise. Subsequent changes in exchange rates result in foreign currency transaction gains and losses that are reflected in results of operations as unrealized (based on period end translation) and realized (upon settlement of the transactions) and reported under other general expenses in the consolidated statements of comprehensive income and other comprehensive income.\n1.6 Cash and Cash Equivalents and Concentration of Credit Risk\nThe Group considers all highly liquid short-term investments with original maturities of three months or less at the date of acquisition to be cash equivalents. The carrying value of cash and cash equivalents approximates fair value due to the short-term nature of these instruments.\nThe Group's financial instruments exposed to concentrations of credit risk consist primarily of cash and cash equivalents. Cash and cash equivalents are held in several Australian bank accounts and time deposit accounts. The Group regularly assesses the level of credit risk we are exposed to and whether there are better ways of managing credit risk. The Group invests its cash and cash equivalents with reputable financial institutions. The Group has not incurred any losses related to these deposits.\n1.7 Accounts Receivable\nThe collectability of accounts receivable is continuously monitored and analised based upon historical experience. The use of judgment is required to establish a provision for allowance for doubtful accounts for specific customer collection issues identified. The allowance for doubtful accounts was Nil as of June 30, 2022, 2021, 2020, and 2019, respectively.\n1.8 Plant and Equipment\nPlant and equipment are recorded at cost. Costs of renewal and improvements that substantially extend the useful lives of assets are capitalised. Maintenance and repair costs are expensed when incurred. Depreciation is calculated using the straight-line method over the estimated useful lives of the assets, which range from two (2) to ten (10) years.\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\nDerecognition\nAn item of plant and equipment is derecognised upon disposal or when no further economic benefits are expected from its use or disposal.\n1.9 Leases\nThese accounting policies are applied on and after the initial application date of ASC842, July 1, 2019:\nThe Company assesses at contract inception whether a contract is, or contains, a lease. That is, if the contract conveys the right to control the use of an identified asset for a period of time in exchange for consideration.\n(i) As lessee\nThe Company applies a single recognition and measurement approach for all leases, except for short-term leases and leases of low-value assets. The Company recognises lease liabilities representing the obligations to make lease payments and right-of-use assets representing the right to use the underlying leased assets.\nRight-of-use assets\nThe Company recognises right-of-use assets at the commencement date of the lease (i.e. the date the underlying asset is available for use). Right-of-use assets are measured at cost, less any accumulated depreciation and impairment losses, and adjusted for any remeasurement of lease liabilities. The cost of right-of-use assets includes the amount of lease liabilities recognised, initial direct costs incurred, and lease payments made at or before the commencement date less any lease incentives received. Right-of-use assets are depreciated on a straight-line basis over the shorter of the lease term and the estimated useful lives of the assets.\nIf ownership of the leased asset transfers to the Company at the end of the lease term or the cost reflects the exercise of a purchase option, depreciation is calculated using the estimated useful life of the asset. The right-of-use assets are also subject to impairment. The accounting policy for impairment is disclosed in key judgement.\nLease liabilities\nAt the commencement date of the lease, the Company recognises lease liabilities measured at the present value of lease payments to be made over the lease term. The lease payments include fixed payments (including in-substance fixed payments) less any lease incentives receivable, variable lease payments that depend on an index or a rate, and amounts expected to be paid under residual value guarantees. The lease payments also include the exercise price of a purchase option reasonably certain to be exercised by the Company and payments of penalties for terminating the lease, if the lease term reflects the Company exercising the option to terminate. Variable lease payments that do not depend on an index or a rate are recognised as expenses (unless they are incurred to produce inventories) in the period in which the event or condition that triggers the payment occurs.\nIn calculating the present value of lease payments, the Company uses its incremental borrowing rate at the lease commencement date because the interest rate implicit in the lease is not readily determinable. After the commencement date, the amount of lease liabilities is increased to reflect the accretion of interest and reduced for the lease payments made. In addition, the carrying amount of lease liabilities is remeasured if there is a modification, a change in the lease term, a change in the lease payments (e.g. changes to future payments resulting from a change in an index or rate used to determine such lease payments) or a change in the assessment of an option to purchase the underlying asset.\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n1.10 Leases (Continued)\nLease liabilities (continued)\nThese accounting policies are applied before the initial application date of ASC842, 1 July 2019:\nLeases of fixed assets, where substantially all the risks and benefits incidental to the ownership of the asset - but not the legal ownership - are transferred to entities in the consolidated group, are classified as finance leases.\nFinance leases are capitalised by recognising an asset and a liability at the lower of the amounts equal to the fair value of the leased property or the present value of the minimum lease payments, including any guaranteed residual values. Lease payments are allocated between the reduction of the lease liability and the lease interest expense for the period.\nLeased assets are depreciated on a straight-line basis over the shorter of their estimated useful lives or the lease term.\nLease payments for operating leases, where substantially all the risks and benefits remain with the lessor, are recognised as expenses on a straight-line basis over the lease term.\n1.11 Payables\nPayables are carried at amortised cost and, due to their short-term nature, they are not discounted. They represent liabilities for goods and services provided to the Group prior to the end of the financial period that are unpaid and arise when the Group becomes obliged to make future payments in respect of the purchase of these goods and services. The amounts are unsecured and are usually paid within thirty (30) days of recognition.\n1.12 Provisions\nProvisions are recognised when the Group has a legal or constructive obligation, as a result of past events, for which it is probable that an outflow of economic benefits will result and that outflow can be reliably measured. Provisions are measured using the best estimate of the amounts required to settle the obligation at the end of the reporting period.\n1.13 Loans and Borrowings\nAll loans and borrowings are initially recognised at cost, being the fair value of the consideration received net of issue costs associated with the borrowing.\nAfter initial recognition, interest-bearing loans and borrowings are subsequently measured at amortised cost using the effective interest method. Amortised cost is calculated by taking into account any issue costs, and any discount or premium on settlement.\nThe Groups current liabilities include a loan from a significant shareholder which is not interest bearing. The shareholder has provided a letter of support to Sanyi Group, which states that the loan to the Group will not be recalled without giving at least thirteen (13) months notice. This loan is not evidenced by a promissory note.\nLoans are classified as current liabilities unless the Group has an unconditional right to defer settlement of the liability for at least twelve (12) months after the reporting date.\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n1.14 Revenue Recognition\nRevenue is measured at the fair value of the consideration received or receivable after taking into account any discounts.\nThe Group derives revenue primarily through the provision of therapeutic health services from its Oriental holistic health centres. Revenue is recognized when persuasive evidence of an arrangement exists, the services have been rendered to customers, the pricing is fixed or determinable and collection is reasonably assured. This is generally based on the completion of services provided to the customers at the Oriental holistic health centers and settlement of the transactions either by cash or credit card payments.\nInterest revenue is recognised using the effective interest method, which for floating rate financial assets is the rate inherent in the instrument. Dividend revenue is recognised when the right to receive a dividend has been established.\nAll revenue is stated net of the amount of goods and services tax.\n1.15 Income Tax\nTaxes payable is based on taxable profit for the period which excludes items of income or expense that are taxable or deductible in other periods. Taxable profit also excludes items that are never taxable or deductible. The Groups liability for current tax is calculated using tax rates that have been enacted or substantively enacted as of the balance sheet date.\nDeferred income tax expense is calculated using the liability method in accordance with ASC 740 Income Taxes. Deferred tax assets and liabilities are classified as non-current in the balance sheet and are measured based on the difference between the carrying value of assets and liabilities for financial reporting and their tax basis when such differences are considered temporary in nature. Temporary differences related to intercompany profits are deferred using the buyers tax rate. Deferred tax assets are reviewed for recoverability every balance sheet date, and the amount probable of recovery is recognised.\nDeferred income tax expense represents the change in deferred tax asset and liability balances during the periods discussed except for the deferred tax related to items recognised in other comprehensive income or resulting from a business combination or disposal. Changes resulting from amendments and revisions in tax laws and tax rates are recognised when the new tax laws or rates become effective or are substantively enacted. Uncertain tax positions are recognised in the consolidated financial statements based on managements expectations.\nDeferred tax assets and liabilities are offset when there is a legally enforceable right to set off current tax assets against current tax liabilities, when they related to income taxes levied by the same taxation authority, and when the Group intends to settle its current tax assets and liabilities on a net basis.\nDeferred taxes are not provided on undistributed earnings of subsidiaries when the timing of the reversal of this temporary difference is controlled by Group and is not expected to happen in the foreseeable future. This is applicable for the majority of Groups subsidiaries.\n1.16 Goods and Services Tax (GST)\nRevenues, expenses and assets are recognised net of the amount of GST, except where the amount of GST incurred is not recoverable from the Australian Taxation Office (ATO).\nReceivables and payables are stated inclusive of the amount of GST receivable or payable. The net amount of GST recoverable from, or payable to, the ATO is included with other receivables or payables in the statement of financial position.\nCash flows are presented on a gross basis. The GST components of cash flows arising from investing or financing activities, which are recoverable from or payable to the ATO, are presented as operating cash flows included in receipts from customers or payments to suppliers.\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n1.17 Earnings (Loss) per Common Share\nBasic earnings (loss) per common share is computed by dividing income or losses available to common shareholders by the weighted average number of common shares outstanding for the period. Diluted earnings (loss) per common share is computed similar to basic net income or losses per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if all the potential common shares, warrants and stock options had been issued and of the additional common shares were dilutive. Diluted earnings (loss) per common share is based on the assumption that all dilutive convertible shares and stock options were converted or exercised. Dilution is computed by applying the treasury stock method for the outstanding options and the if-converted method for the outstanding convertible preferred shares. Under the treasury stock method, options and warrants are assumed to be exercised at the beginning of the period (or at the time of issuance, if later), and as if funds obtained thereby were used to purchase common stock at the average market price during the periods discussed. Under if-converted method, convertible outstanding instruments are assumed to be converted into common stock at the beginning of the period (or at the time of issuance, if later).\n1.18 Accumulated Other Comprehensive Income (Loss)\nComprehensive income (loss) is presented net of applicable income taxes in the accompanying consolidated statements of stockholders' equity and comprehensive income (loss). Other comprehensive income (loss) is comprised of revenues, expenses, gains, and losses that under GAAP are reported as separate components of stockholders' equity instead of net income (loss).\n2. Critical Accounting Estimates and Judgements\nThe sole Director evaluates estimates and judgements incorporated into the consolidated financial statements based on historical knowledge and best available current information. Estimates assume a reasonable expectation of future events and are based on current trends and economic data, obtained both externally and within the Group.\nKey Estimates\n(i) Useful lives\nThe Group determines the estimated useful lives and related depreciation and amortisation charges for its property, plant and equipment and finite life intangible assets. The useful lives could change significantly as a result of technical innovations or some other event. The depreciation and amortisation charge will increase where the useful lives are less than previously estimated lives, or technically obsolete or non-strategic assets that have been abandoned or sold will be written off or written down.\nKey Estimates\n(ii) Income tax\nThe Group is subject to income taxes in the jurisdictions in which it operates. Significant judgement is required in determining the provision for income tax. There are many transactions and calculations undertaken during the ordinary course of business for which the ultimate tax determination is uncertain. The Group recognises liabilities for anticipated tax audit issues based on the Group's current understanding of the tax law. Where the final tax outcome of these matters is different from the carrying amounts, such differences will impact the current and deferred tax provisions in the period in which such determination is made.\n(iii) Fair value measure of shares issued\nThe calculation of the fair value of shares issued requires significant estimate to be made in regards to several variables. The estimations made are subject to variability that may alter the overall fair value determined.\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nFOR THE YEAR ENDED JUNE 30, 2022, 2021, 2020, AND 2019\nKey Judgements\n(i) Provision for impairment of receivables\nThe provision for impairment of receivables assessment requires a degree of estimation and judgement. The level of provision is assessed by taking into account the recent sales experience, the ageing of receivables, historical collection rates and specific knowledge of the individual debtors financial position.\n(ii) Impairment\nThe Group assessed that no indicators of impairment existed at the reporting date and as such no impairment testing was performed.\n3. Segment Information\nThe consolidated entity operates predominantly in one industry and one geographical segment, those being Oriental holistic health services and Australia, respectively.\n4. Cash and Cash Equivalents\nCash at the end of the financial periods as shown in the statement of cash flows is reconciled to items in the consolidated balance sheets as follows:\nCash and Cash Equivalents - Schedule of Cash and Cash Equivalents\n2019\nUS$ US$ US$ US$\nCash at bank 106,942 137,547 11,848 35,089\nPetty Cash 10,021 2,589 19,747 6,349\nCash and cash equivalents 116,963 140,136 31,595 41,438\n5. Other Assets\n2019\nUS$ US$ US$ US$\nCurrent\nDeposits paid 20,395 22,257 20,318 15,264\n6. Other Receivables\n2019\nUS$ US$ US$ US$\nCurrent\nRefundable from the Australian Taxation Office 1,036 3,522\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n7. Plant and Equipment\nFurniture\nand\nfittings\nOffice\nequipment\nComputers Motor\nVehicles\nPlant\nand\nequipment\nLease\nImprovements\nTotal\nAt cost\nBalance as of June 30, 2019 $ 2,218 $ 617 $ 9,633 $ 33,640 $ 13,810 $ 76,279 $ 136,197\nAdditions 30,974 - - - - - 30,974\nDisposals - - - - - - -\nEffect of foreign currency exchange difference (13 ) (206 ) (720 ) (295 ) (1,632 ) (2,223 )\nBalance as of June 30, 2020 33,835 9,427 32,920 13,515 74,647 164,948\nEffect of foreign currency exchange difference 3,229 3,142 1,289 7,124 15,742\nBalance as of June 30, 2021 37,064 10,327 36,062 14,804 81,771 180,690\nEffect of foreign currency exchange difference (3,101 ) (55 ) (864 ) (3,017 ) (1,238 ) (6,842 ) (15,117 )\nBalance as of June 30, 2022 33,963 9,463 33,045 13,566 74,929 165,573\nAccumulated depreciation and amortization\nBalance as of June 30, 2019 (2,218 ) (617 ) (9,633 ) (8,765 ) (13,810 ) (62,528 ) (97,571 )\nDepreciation expense (30,974 ) - - (23,812 ) - (13,164 ) (67,950 )\nEffect of foreign currency exchange difference (643 ) (343 ) 1,045\nBalance as of June 30, 2020 (33,835 ) (604 ) (9,427 ) (32,920 ) (13,515 ) (74,647 ) (164,948 )\nEffect of foreign currency exchange difference (3,229 ) (58 ) (900 ) (3,142 ) (1,289 ) (7,124 ) (15,742 )\nBalance as of June 30, 2021 (37,064 ) (662 ) (10,327 ) (36,062 ) (14,804 ) (81,771 ) (180,690 )\nEffect of foreign currency exchange difference 3,101 (864 ) 3,017 1,238 6,842 15,117\nBalance as of June 30, 2022 33,963 9,463 33,045 13,566 74,929 165,573\nNet carrying amount\nAs of June 30, 2019 $ - $ - $ - $ 24,875 $ - $ 13,751 $ 38,626\nAs of June 30, 2020 - - - - - - -\nAs of June 30, 2021 - - - - - - -\nAs of June 30, 2022 - - - - - - -\nFurniture and Fittings\nOffice Equipment\nComputers\nMotor Vehicles\nPlant and Equipment\nLease Improvements\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n8. LEASES\nCompany as a lessee\nThe Company has lease contract for land and building. The Companys obligations under these leases are secured by the lessors title to the leased assets. The Company is restricted from assigning and subleasing the leased assets.\n(a) Right-of-use assets\nShop lot Total\nUS$ US$\nCost\nAt 1 July 2019 - -\nAddition $ 429,052 $ 429,052\nEffect of foreign currency exchange difference (820 ) (820 )\nAt 30 June 2020 428,232 428,232\nEffect of foreign currency exchange difference 35,169 35,169\nAt 30 June 2021 463,401 463,401\nEffect of foreign currency exchange difference (25,282 ) (25,282 )\nAt 30 June 2022 438,119 438,119\nAccumulated Depreciation\nAt 1 July 2019 - -\nDepreciation 55,013 55,013\nAt 30 June 2020 55,013 55,013\nDepreciation 66,756 66,756\nAt 30 June 2021 121,769 121,769\nDepreciation 64,884 64,884\nAt 30 June 2022 186,653 186,653\nNet carrying amount\nAs of 30 June 2020 373,219 373,219\nAs of 30 June 2021 341,632 341,632\nAs of 30 June 2022 251,466 251,466\nShop Lot\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n8. LEASES (Continued)\n(b) Lease liabilities\nThe carrying amounts of lease liabilities is as follows:\nLeases - Schedule of Lease Liabilities\nUS$ US$ US$\nCurrent\nLease liabilities 60,412 60,126 49,926\nNon Current\nLease liabilities 223,517 309,854 337,745\nOperating Lease Liability 283,929 369,980 387,671\n9. Accrued and Other Liabilities\n2019\nUS$ US$ US$ US$\nCurrent\nPayroll liabilities 3,054 5,105 2,500 2,333\nOther payables 81,971 33,786 - -\nAccrued and other liabilities 85,025 38,891 2,500 2,333\n10. Borrowings\n2019\nUS$ US$ US$ US$\nLoan from shareholder\nCurrent\nBalance as of 1 July 123,274 112,533 114,993 120,926\nRepayment (103,335 ) - - -\nForex exchange (10,314 ) 10,741 (2,460 ) (5,933 )\nBalance as of 30 June 9,625 123,274 112,533 114,993\nThe loan balance above is an unsecured loan from Xin Jin, a significant shareholder and an officer of the Company and its sole Director. The loan is non-trade in nature, non-interest bearing and repayable on demand.\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n11. Share capital\n2019\nUS$ US$ US$ US$\nIssued and fully paid ordinary shares:\nAt beginning of year 277\nShare issued - -\nAt end of year 317\n40,000,000 shares of common stock were issued at $0.000001 per share, on April 26, 2019. In year 2020. The company had issued 39,398,309 shares of common stock in tranches, valued at $0.000001 per share.\nThe holders of ordinary shares are entitled to receive dividends as and when declared by the Group. All ordinary shares carry one vote per share without restrictions. The ordinary shares have no par value.\n12. Other Comprehensive (Loss)/Earnings\n2019\nUS$ US$ US$ US$\nForeign currency translation reserve (7,434 ) (3,669 ) 3,274 4,150\n13. Income Tax Expense\n2019\nUS$ US$ US$ US$\n(a) The components of tax (expense)/income comprise:\nCurrent tax\n- Australia - - - (826 )\n- US - - - -\nTotal - - - (826 )\nDeferred tax\n- Australia - - - -\n- US - - - -\nTotal - - - -\nAustralia\nUS\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n13. Income Tax Expense (Contd)\n2019\nUS$ US$ US$ US$\n(b) The prima facie tax on profit from ordinary activities before income tax is reconciled to income tax as follows:\nProfit/(loss) from continuing operations before income tax expense:\n- Australia 42,111 55,585 (57,223 ) 5,696\n- U.S. - - - -\nTotal 42,111 55,585 (57,223 ) 5,696\nIncome tax expense/(credit) at statutory rate:\n- Australia 12,633 16,676 (17,167 ) 1,709\n- U.S. - - - -\nTotal 12,633 16,676 (17,167 ) 1,709\nRecoupment of prior year tax losses ay previously brought to account: (12,633 ) (16,676 ) 17,167 (883 )\nConsolidated income tax expense - - -\n14. Capital Commitments\nThere was no capital expenditure as of June 30, 2022 ,2021, 2020 and 2019.\n15. Contingencies\nFrom time to time, the Group is involved in routine litigation that arises in the ordinary course of business. There are no pending significant legal proceedings to which the Group is a party for which management believes the ultimate outcome would have a material adverse effect on the Groups financial position.\nAREM PACIFIC CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nFOR THE YEARS ENDED JUNE 30, 2022, 2021, 2020, AND 2019\n16. Related Party Transactions\n(a) Parent entity\nThe ultimate parent entity which exercises control over the Group is Arem Pacific Corporation.\n(b) Subsidiary\nSanyi Group is a wholly owned subsidiary of the Company and is incorporated in Australia.\n(c) Outstanding balances with related parties\nThe following balances are outstanding at reporting date in relation to transactions with related parties:\nRelated Party Transactions - Schedule of Related Party Transactions\n2019\nUS$ US$ US$ US$\nLoan from related party 9,625 123,274 112,533 114,993\nThe loan balance above is an unsecured loan from Xin Jin, a significant shareholder and an officer of the Company and the Director of its wholly owned subsidiary Sanyi Group.\n17. Subsequent Events\nNo subsequent event which had a material impact on the Group was identified through the date of issuance of the consolidated financial statements.\nQuarterly Financial Information\nAREM PACIFIC CORPORATION\nCONSOLIDATED BALANCE SHEETS\nFOR THE QUARTERS ENDED (UNAUDITED)\nSeptember 30, 2021 December 31, 2021 March 31, 2022\n(Unaudited) (Unaudited) (Unaudited)\nUS$ US$ US$\nAssets\nCash and cash equivalents 141,059 87,900 91,292\nOther assets 28,782 28,983 29,893\nOther receivables\nTotal current assets 170,067 117,109 121,411\nRight-of-use assets 311,350 297,294 289,833\nTotal non-current asset 311,350 297,294 289,833\nTotal assets 481,417 414,403 411,244\nLiabilities and Stockholders Equity/(Deficit)\nLiabilities\nAccrued and other liabilities 37,907 51,286 50,817\nBorrowings 125,752 17,784 3,374\nLease liabilities 58,992 60,799 64,146\nTotal current liabilities 222,651 129,869 118,337\nLease liabilities 281,621 267,665 259,452\nTotal non-current liability 281,621 267,665 259,452\nTotal liabilities 504,272 397,534 377,789\nStockholders (deficit)/equity\nCommon stock, $0.000001 par value, 500,000,000 shares authorized and 373,950,544 (2019: 294,552,235) shares issued and outstanding, respectively\nAdditional paid in capital 157,150 157,150 157,150\nOther comprehensive loss (2,595 ) (2,929 ) (1,893 )\nAccumulated losses (177,766 ) (137,708 ) (122,158 )\nTotal stockholders (deficit)/equity (22,855 ) 16,869 33,455\nTotal liabilities and stockholders (deficit)/equity 481,417 414,403 411,244\nAREM PACIFC CORPORATION\nCONSOLIDATED INCOME STATEMENTS (UNAUDITED)\nTHREE MONTHS ENDED\nSeptember 30, 2021 September 30, 2020\nUS$ US$\nRevenue 24,849 13,531\nOperating expenses\nPayroll and employee related expense 12,718 17,280\nDepreciation on right-of-use assets 16,425 15,982\nGeneral and administrative expenses 4,417 9,305\nTotal operating expenses 33,560 42,567\nLoss from operations (8,711 ) (29,036 )\nOther income (expenses)\nInterest expenses (3,074 ) (3,451 )\nOther income 15,876 34,687\nInterest income\nTotal other income 12,803 31,237\nIncome from continuing operations before income tax expenses 4,092 2,201\nIncome tax expense - -\nNet income after income tax expense for the year 4,092 2,201\nTHREE MONTHS ENDED SIX MONTHS ENDED\nDecember 31, 2021 December 31, 2020 December 31, 2021 December 31, 2020\nUS$ US$ US$ US$\nRevenue 75,991 54,194 100,840 67,725\nOperating expenses\nPayroll and employee related expense 23,439 24,016 36,157 41,296\nDepreciation on right-of-use assets 16,285 16,323 32,710 32,305\nGeneral and administrative expenses 5,608 2,326 10,025 11,631\nTotal operating expenses 45,332 42,665 78,892 85,232\nIncome/(loss) from operations 30,659 11,529 21,948 (17,507 )\nOther income (expenses)\nInterest expenses (2,920 ) (3,410 ) (5,994 ) (6,861 )\nOther income 12,242 19,796 28,118 54,483\nInterest income 186\nTotal other income 9,399 16,571 22,202 47,808\nIncome from continuing operations before income tax expenses 40,058 28,100 44,150 30,301\nIncome tax expense - - - -\nNet income after income tax expense for the year 40,058 28,100 44,150 30,301\nAREM PACIFC CORPORATION\nCONSOLIDATED INCOME STATEMENTS (UNAUDITED)\nTHREE MONTHS ENDED NINE MONTHS ENDED\nMarch 31, 2022 March 31, 2021 March 31, 2022 March 31, 2021\nUS$ US$ US$ US$\nRevenue 77,768 69,577 178,608 137,302\nOperating expenses\nPayroll and employee related expense 27,687 36,444 63,844 77,740\nDepreciation on right-of-use assets 16,185 17,273 48,895 49,578\nGeneral and administrative expenses 15,572 3,825 25,597 15,456\nTotal operating expenses 59,444 57,542 138,336 142,774\nIncome/(loss) from operations 18,324 12,035 40,272 (5,472 )\nOther income (expenses)\nInterest expenses (2,775 ) (3,485 ) (8,769 ) (10,346 )\nOther income - 18,585 28,118 73,068\nInterest income 193\nTotal other income/(expenses) (2,774 ) 15,107 19,428 62,915\nIncome from continuing operations before income tax expenses 15,550 27,142 59,700 57,443\nIncome tax expense - - - -\nNet income after income tax expense for the year 15,550 27,142 59,700 57,443\nAREM PACIFIC CORPORATION\nCONSOLIDATED STATEMENT OF CASH FLOWS (UNAUDITED)\nThree Months Ended Three Months Ended Six Months Ended Six Months Ended Nine Months Ended Nine Months Ended\nSeptember 30, 2021 September 30, 2020 December 31, 2021 December 31, 2020 March 31, 2022 March 31, 2021\nUS$ US$ US$ US$ US$ US$\nCash flows from operating activities:\nNet income 4,092 2,201 44,150 30,301 59,700 57,443\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation of right-of-use assets 16,425 15,982 32,710 32,305 48,895 49,578\nInterest expenses 3,074 3,451 5,994 6,861 8,769 10,346\nInterest income (1 ) (1 ) (78 ) (186 ) (79 ) (193 )\nNet changes in operating assets and liabilities\nDecrease in other receivable 1,256 (3,224 ) 1,055 (3,479 ) (4,944 )\nDecrease in other payable and accrued liabilities (984 ) 13,946 29,421 53,808 37,765 100,966\nDecrease in borrowings (5,445 ) 4,275 (113,413 ) 91,662 (127,823 ) 12,897\nCash used in operating activities 18,417 36,630 (161 ) 211,272 27,372 226,093\nIncome tax paid - - - -\nInterest received 186\nNet cash generated from/(used in) operating activities 18,418 36,631 (83 ) 211,458 27,451 226,286\nCash flows from financing activities\nRepayment of interest on lease liabilities (3,074 ) (3,451 ) (5,994 ) (6,861 ) (8,769 ) (10,346 )\nRepayment of lease liabilities (17,366 ) (16,093 ) (34,862 ) (32,794 ) (52,250 ) (50,468 )\nNet cash used in financing activities (20,440 ) (19,544 ) (40,856 ) (39,655 ) (61,019 ) (60,814 )\nNet (decrease)/increase in cash and cash equivalents (2,022 ) 17,087 (40,939 ) 171,803 (33,568 ) 165,472\nCash and cash equivalents at the beginning of year 140,136 31,595 140,136 31,595 140,136 31,595\nExchange difference on translation of foreign operations 2,945 1,192 (11,297 ) (14,634 ) (15,276 ) (44,434 )\nCash and cash equivalents at the end of year 141,059 49,874 87,900 188,764 91,292 152,633 ITEM 9: CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nSW Audit (formerly ShineWing Australia), of Australia, (SW), who audited our financial statements for the fiscal years ended June 30, 2016, and 2015, resigned on January 18 2017, stating to the Company that it did not believe it could cover the new areas of business operations that were planned by the Company.\nDuring the fiscal years ended June 30, 2016, and 2015, preceding such resignation of SW, there were no disagreements with SW on any matter of accounting principles or practices, financial statement disclosure or auditing scope or procedure. See Exhibit 16.1, in Part IV, Item 15, for SWs letter confirming the foregoing.\nEffective January 26, 2021, the Company engaged Audit Alliance LLP, of Singapore (Audit Alliance), by resolution of the Board of Directors, to audit its consolidated financial statements for the fiscal years ended June 30, 2022, 2021, 2020, and 2019. During the Companys two most recent fiscal years ended June 30, 2022, and 2021, and any subsequent interim period prior to engaging Audit Alliance, neither the Company nor anyone on its behalf consulted Audit Alliance regarding: (i) either the application of accounting principles to a specified transaction, either completed or proposed; (ii) or the type of audit opinion that might be rendered on the Companys consolidated financial statements, and either a written report was provided to the Company or oral advice was provided that Audit Alliance concluded was an important factor considered by the Company in reaching a decision as to any accounting, auditing or financial reporting issue; or (iii) any matter that was either the subject of a disagreement (as defined in Item 304(a)(1)(iv) and the related Instructions to Item 304 of Regulation S-K of the SEC) or a reportable event described in Item 304(a)(1)(v) thereof. ITEM 9A: CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nWe maintain disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act that are designed to ensure that material information relating to us is made known to the officers who certify our financial reports and to other members of senior management and the Board of Directors. These disclosure controls and procedures are designed to ensure that information required to be disclosed in our reports that are filed or submitted under the Exchange Act are recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to our management, including our principal executive and principal financial officers, or persons performing similar functions, as appropriate, to allow timely decisions regarding required disclosure. Management, with the participation of our Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness, as of June 30, 2022, of our disclosure controls and procedures. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were not effective as of June 30, 2022.\nManagements Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining effective internal control over financial reporting as defined in Rule 13a-15(f) under the Exchange Act. Internal control over financial reporting is a process designed by, or under the supervision of our Chief Executive Officer and our Chief Financial Officer, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Internal controls over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records, which in reasonable detail, accurately and fairly reflect the transactions and disposition of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made in accordance with authorizations of management and directors of the issuer; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on our consolidated financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nAs required by Section 404 of the Sarbanes-Oxley Act of 2002 and related rules as promulgated by the SEC, our management assessed the effectiveness of our internal control over the financial reporting as of June 30, 2022, 2021, 2020 and 2019, using criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, our management concluded that our internal control over financial reporting was not effective as of June 30, 2022, 2021, 2020, and 2019 due to the following material weaknesses:\n· lack of sufficient accounting personnel qualified in US GAAP and SEC reporting; and\n· insufficient accounting staff, which results in a failure to segregate duties sufficiently to ensure a timely and proper preparation and review of the financial statements.\nWe plan to take steps to remediate the material weaknesses in our internal control over financial reporting as soon as practicable by:\n· hiring additional internal staff familiar with US GAAP and SEC reporting. In the past couple of years, we have made offers to hire accounting personnel familiar with US GAAP and SEC reporting experience but has as of yet been unable to hire a suitable candidate. We now plan to hire a professional recruitment agency to assist us in the identification and selection of appropriate candidates.\n· Enhance staff awareness of laws and regulations by conducting more trainings.\n· hiring sufficient staff to adequately segregate responsibilities and insure timely preparation of financial statements; and providing training to our accounting personnel on US GAAP, SEC reporting and other regulatory requirements regarding the preparation of financial statements. Our financial personnel attended US GAAP and SEC reporting training sessions organized by an international accounting firm. We plan to hold similar US GAAP and SEC reporting training on a regular basis.\nAlthough we increased the training provided to accounting personnel relating to US GAAP and SEC reporting to partially address the foregoing material weaknesses, we do not believe such weaknesses have been remediated and we can provide no assurance that they will be remediated in a timely manner.\nWe believe that we are taking the steps necessary for remediation of the material weaknesses identified above, and we will continue to monitor the effectiveness of these steps and to make any changes that our management deems appropriate.\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report is not subject to attestation by our registered public accounting firm pursuant to rules of the SEC that permit us to satisfy these requirements by providing the managements report only.\nChanges in Internal Control Over Financial Reporting\nWith the exception of commencing the process of implementing the foregoing steps to resolve the weaknesses in our internal controls, there have been no changes in internal control over financial reporting during the last fiscal quarter of our fiscal year ended June 30, 2022.\nLimitations on the Effectiveness of Controls\nOur management does not expect that our disclosure controls and procedures or our internal control over financial reporting will prevent or detect all error and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. Further, the design of the control system must reflect that there are resource constraints and that the benefits must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. Controls can also be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of controls. The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Projections of any evaluation of controls effectiveness to future periods are subject to risks. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures. ITEM 9B: OTHER INFORMATION\nNone.\nITEM 9C: DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNone, not applicable.\nPART III ITEM 10: DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nIdentification of Directors and Executive Officers\nOur executive officers and directors and their respective ages, positions and biographical information are set forth below.\nName Age Position and Offices Held Dates in Position or Office\nXin Jin President and Director December 2020 - Present\nChief Financial Officer January 2022 - Present\nVice President June 2013 - February 2017\nPresident and Director - Arem Arizona July 2010 - Present\nZhiYu Qian Director April 2021 - February 2022\nDirector - Arem Arizona July 2010 - February 2022\nJianji Jin Sole Director - Sanyi Group September 2013 - Present\nGuo Yan Zhao Director April 2020 - February 2022\nDirector - Arem Arizona July 2010 - February 2022\nSusan Sha Chief Financial Officer April 2019 - January 2022\nThomas Tang President and Director July 2008 - December 2019\nChief Executive Officer August 2014 - December 2019\nNancy Yang Secretary / Chief Marketing Officer and Director December 2018 - April 2019\nRocco Scarpari Chairman of the Board of Directors July 2008 - April 2019\nAllan Qiu Chief Financial Officer and Director January 2014 - April 2019\nBackground and Business Experience\nXin Jin is 44 years of age and founded Sanyi Group in 2012, as a therapeutic health centre that uses traditional Chinese massage and alternative approaches to personal well being, including reflexology, acupuncture and cupping, all aimed at easing a clients muscular tension, to stimulate organ function and restore and promote a healthy body. Mr Xin serves as the President and Managing Director of Sanyi Group, which was acquired by us on June 30, 2012.\nMr Xin graduated from Shandong University, China, in 2001 with a Bachelor of Commerce, where he majored in Accounting. He then attended Deakin University, Australia, and graduated with a Masters Degree in Professional Accounting in 2004.\nOn April 20, 2021, we increased the size of our Board of Directors to three members and elected and designated ZhiYu Qian and GuoYan Zhao to serve on the Board of Directors until the next annual meeting of the stockholders or until their respective successors shall be elected and qualify. Each resigned as a member of the Board of Directors of the Company in February, 2022.\nZhiYu Qian is 55 years of age and has served as the Chairman of the Board of Zhengjiang Zhonglin Holding Group Co., Ltd, since its establishment in 2013. It was organized to conduct feasibility studies on construction projects, industrial investments, technology venture capital and financial consulting services. It has ten (10) operating subsidiaries comprising a group enterprise integrating engineering technology, the real economy and capital operations relating to engineering, real estate development, intelligence equipment, funding and financial services. Among them, Zhejiang Zhonglin Investigation and Research Co., Ltd., is the first company listed on the New Third Board in Shengzhou, and the first batch of private survey enterprises in Zhejiang Province of China. It has obtained more than sixty (60) invention patents and more than twenty (20) utility patents.\nMr. Qian graduated from the Geology Department of Changchun Institute of Technology in 1987 and is a China National Registered Supervision Engineer and Senior Engineer.\nMr. Qian is expected to guide and assist any future extension of our current business operations into China.\nJianji Jin is 39 years of age and has been the sole director of Sanyi Group since September of 2013, managing and supervising its entire business operations. In this capacity, he is responsible for overseeing all employees, the engagement of employees and independent personnel, compliance with applicable laws, advertising and promotions and customer relations and all other aspects of Sanyi Groups business. Mr. Jin graduated from Dalian Medical University in China with a Medicine Degree in 2005. He holds a Diploma in Remedial Massage in Melbourne College of Professional Therapists earned in Australia in 2014; and a Certificate IV of Property Sales from the Holmesglen Institute of TAFE (Technical and Further Education), also earned in Australia, in 2010. He speaks Chinese and English.\nSignificant Employees\nThere are no employees who are not executive officers who are expected to make a significant contribution to our Companys business.\nFamily Relationships\nJianji Jin is a cousin of Xin Jin, our President, CFO and sole director.\nInvolvement in Other Public Companies\nNone of our officers or directors are an affiliate of any other publicly held companies.\nInvolvement in Certain Legal Proceedings\nDuring the past ten (10) years, none of our present or former directors, executive officers or persons nominated to become directors or executive officers:\n(1) A petition under the Federal bankruptcy laws or any state insolvency law was filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he was a general partner at or within two (2) years before the time of such filing, or any corporation or business association of which he was an executive officer at or within two (2) years before the time of such filing;\n(2) Such person was convicted in a criminal proceeding or is a named subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n(3) Such person was the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from, or otherwise limiting, the following activities:\n(i) Acting as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\n(ii) Engaging in any type of business practice; or\n(iii) Engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n(4) Such person was the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than sixty (60) days the right of such person to engage in any activity described in paragraph (f)(3)(i) of this section, or to be associated with persons engaged in any such activity;\n(5) Such person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n(6) Such person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n(7) Such person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\n(i) Any Federal or State securities or commodities law or regulation; or\n(ii) Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\n(iii) Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n(8) Such person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCompliance with Section 16(a) of the Exchange Act\nThe common stock of the Company is not registered under Section 12(g) of the Exchange Act, and therefore, the officers, directors and holders of more than 10% of our outstanding shares are not subject to the provisions of Section 16(a) of the Exchange Act, which would require them to file with the SEC initial reports of ownership and reports of changes in ownership of common stock and our other equity securities.\nCode of Conduct\nWe have adopted a Code of Conduct for our principal executive and financial officers. See Exhibit 14 in Part IV, Item 15.\nCorporate Governance\nNominating Committee\nWe have not established a Nominating Committee because we believed that we were able to effectively manage the issues normally considered by a Nominating Committee and currently believe we can do so without a Nominating Committee.\nIf we do establish a Nominating Committee, we will disclose our procedures in recommending nominees by our Board of Directors.\nAudit Committee\nWe have not established an Audit Committee for the same reasons why we have not established a Nominating Committee, and a further review of this issue will no doubt be necessitated and undertaken by our management in the future. ITEM 11: EXECUTIVE COMPENSATION\nThe following table sets forth the aggregate compensation paid by us for services rendered during the periods indicated:\nSUMMARY COMPENSATION TABLE\nName and Principal Position Year\nSalary\n($)\nBonus\n($)\nStock Awards\n($)\nOption Awards\n($)\nNon-Equity Incentive Plan Com- pensation($) Nonqualified Deferred Compensation\n($)\nAll Other Compensation($) Total\n($)\n(a) (b) (c) (d) (e) (f) (g) (h) (i) (j)\nXin Jin $0 $0 $0 $0 $0 $0 $0 $0\nPresident $0 $0 $0 $0 $0 $0 $0 $0\nand $0 $0 $0 $0 $0 $0 $0 $0\nDirector $0 $0 $0 $0 $0 $0 $0 $0\nJianji Jin $0 $0 $0 $0 $0 $0 $0 $0\nDirector $0 $0 $0 $0 $0 $0 $0 $0\nSanyi $0 $0 $0 $0 $0 $0 $0 $0\nSusan $0 $0 $0 $0 $0 $0 $0 $0\nSha $0 $0 $0 $0 $0 $0 $0 $0\nCFO $0 $0 $0 $0 $0 $0 $0 $0\n$0 $0 $0 $0 $0 $0 $0 $0\nZhiYu $0 $0 $0 $0 $0 $0 $0 $0\nQian $0 $0 $0 $0 $0 $0 $0 $0\nDirector $0 $0 $0 $0 $0 $0 $0 $0\nGuo Yan $0 $0 $0 $0 $0 $0 $0 $0\nZhao $0 $0 $0 $0 $0 $0 $0 $0\nDirector $0 $0 $0 $0 $0 $0 $0 $0\nThomas Tang, $0 $0 $0 $0 $0 $0 $0 $0\nPresident, Chief Executive Officer and Director\nNancy\nYang,\n$0 $0 $0 $0 $0 $0 $0 $0\nSecretary\nCMO\nDirector\nRocco Scarpari, $0 $0 $0 $0 $0 $0 $0 $0\nChairman of the Board of Directors\nAllan Qui, $0 $0 $0 $0 $0 $0 $0 $0\nCFO and Director\nSecurities Authorized for Issuance under Equity Compensation Plans\nAt June 30, 2022, we have no outstanding equity awards.\nCompensation of Directors\nName Fees Earned or Paid in Cash ($) Stock Awards ($) Option Awards ($) Non-Equity Incentive Plan Compensation ($) Nonqualified Deferred Compensation Earnings ($) All Other Compensation ($) Total ($)\nNone None None None None None None None\nTransactions with Related Persons\nDuring the fiscal years ended June 30, 2022, 2021, 2020 and 2019, there were no related party transactions.\nPromoters and Certain Control Persons\nThere were no material transactions, or series of similar transactions, during our Companys last five (5) fiscal years, or any currently proposed transactions, or series of similar transactions, to which we or any of our subsidiaries was or is to be a party and in which any promoter or founder of ours or any member of the immediate family of any of the foregoing persons, had an interest.\nParents of the Smaller Reporting Company\nSee the caption References at the forepart of this Annual Report. The Company has no parents. ITEM 12: SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nSecurity Ownership of Certain Beneficial Owners\nThe following table sets forth, as of November 1, 2022, the names, addresses and number of shares of common stock beneficially owned by all persons known to the management of the Company to be beneficial owners of more than 5% of the outstanding shares of common stock, and the names and number of shares beneficially owned by all directors of the Company and all executive officers and directors of the Company as a group (except as indicated, each beneficial owner listed exercises sole voting power and sole dispositive power over the shares beneficially owned).\nFor purposes of this table, information as to the beneficial ownership of shares of common stock is determined in accordance with the rules of the SEC and includes general voting power and/or investment power with respect to securities. Except as otherwise indicated, all shares of our common stock are beneficially owned, and sole investment and voting power is held, by the person named. For purposes of this table, a person or group of persons is deemed to have beneficial ownership of any shares of common stock, which such person has the right to acquire within sixty (60) days after the date hereof. The inclusion herein of such shares listed beneficially owned does not constitute an admission of beneficial ownership.\nAll percentages are calculated based upon a total number of 373,950,544 shares of common stock outstanding as of October 19, 2022, plus, in the case of the individual or entity for which the calculation is made, that number of options or warrants owned by such individual or entity that are currently exercisable or exercisable within sixty (60) days.\nSecurity Ownership of Beneficial Owners\nName and Address* of Beneficial Owner\nTitle of Class\nAmount and Nature of Beneficial Ownership\nPercent of Class\nZhuo Fan Tang\nCommon\n60,579,700\n16.2 %\nYew Nic Kien Cheong\nCommon\n20,000,000\n5.4 %\nXin Jin\nCommon\n19,910,000\n5.3 %\nSecurity Ownership of Officers and Directors\nName and Address* of Officer or Director\nTitle of Class\nAmount and Nature of Beneficial Ownership\nPercent of Class\nXin Jin\nCommon\n19,910,000\n5.3 %\nAll Officers and Directors as a Group\nCommon\n19,910,000\n5.3 %\n*The Companys principal executive office address on the cover page.\nChanges in Control\nThere are no current or planned transactions that would or are expected to result in a change of control of our Company. ITEM 13: CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nTransactions with Related Persons\nDuring the fiscal years ended June 30, 2022, 2021, 2020, and 2019, there were no related party transactions other than disclosed in Note 15 to the consolidated financial statements.\nPromoters and Certain Control Persons\nThere were no material transactions, or series of similar transactions, during our Companys last five fiscal years, or any currently proposed transactions, or series of similar transactions, to which we or any of our subsidiaries was or is to be a party and in which any promoter or founder of ours or any member of the immediate family of any of the foregoing persons, had an interest.\nParents of the Smaller Reporting Company\nSee the caption References at the forepart of this Annual Report.\nDirector Independence\nOur Board of Directors is currently composed of one (1) member, who does not qualify as an independent director in accordance with the published listing requirements of the NASDAQ Global Market (the Company has no plans to list on the NASDAQ Global Market). The NASDAQ independence definition includes a series of objective tests, such as that the directors are not, and have not been for at least three (3) years, one (1) of our employees and that neither the director, nor any of their family members have engaged in various types of business dealings with us. In addition, our board of directors has not made a subjective determination as to our director that no relationship exists which, in the opinion of our board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director, though such subjective determination is required by the NASDAQ rules. Had our board of directors made these determinations, our board of directors would have reviewed and discussed information provided by our director and us with regard to our directors business and personal activities and relationships as they may relate to us and our management. ITEM 14: PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following is a summary of the fees billed to us by our principal accountants, Audit Alliance LLP during the fiscal year ended below:\nFee Category 2019\nAudit Fees US$ 78,000 $ - $ - $ -\nAudit-related Fees $ - $ - $ - $ -\nTax Fees $ - $ - $ - $ -\nAll other Fees $ - $ - $ - $ -\nTotal Fees US$ 78,000 $ - $ - $ -\nAudit Fees - Consists of fees for professional services rendered by our principal accountants for the audit of our annual consolidated financial statements for our 10-K Annual Reports and review of the consolidated financial statements included in our 10-Q Quarterly Reports or services that are normally provided by our principal accountants in connection with statutory and regulatory filings or engagements.\nAudit-related Fees - Consists of fees for assurance and related services by our principal accountants that are reasonably related to the performance of the audit or review of our consolidated financial statements and are not reported under Audit fees.\nTax Fees - Consists of fees for professional services rendered by our principal accountants for tax compliance, tax advice and tax planning.\nAll Other Fees - Consists of fees for products and services provided by our principal accountants, other than the services reported under Audit Fees, Audit-related Fees, and Tax Fees above.\nPolicy on Audit Committee Pre-Approval of Audit and Permissible Non-Audit Services of Independent Auditors\nWe have not adopted an Audit Committee; therefore, there is no Audit Committee policy in this regard. However, we do require approval in advance of the performance of professional services to be provided to us by our principal accountant. Additionally, all services rendered by our principal accountant are performed pursuant to a written engagement letter between us and the principal accountant.\nPART IV ITEM 15: EXHIBIT AND FINANCIAL STATEMENT SCHEDULES\n(a)(1)(2)\nFinancial Statements. See the audited consolidated financial statements of the Company contained in Part II, Item 8 above, of this Annual Report, followed by our unaudited and compared consolidated financial statements for the quarterly periods ended September 2021, and 2019; December 31, 2021, and 2020; and March 31, 2022, and 2021, which are incorporated herein by this reference.\n(a)(3)\nExhibits. The following exhibits are filed as part of this Annual Report:\n(a) Exhibits.\nExhibit\nNumber\nDescription of Exhibit\nFiling\n3(i)\nRestated Certificate of Incorporation\nFiled herewith\n3(ii)\nAmended and Restated Bylaws\nFiled herewith\nDescription of Securities\nFiled herewith\nCode of Conduct\nFiled herewith\n16.1\nSW Audit Letter regarding change in certifying accountant\nFiled herewith\nSubsidiaries\nFiled herewith\n31.1\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nFiled herewith.\n31.2\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nFiled herewith\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nFiled herewith\n99.1\nForm of Company Representative Agreement\nFiled herewith\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase\n101.LAB\nXBRL Taxonomy Extension Label Linkbase\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase\nExhibits incorporated by reference:\n10-KA Annual Report for the fiscal year ended June 30, 2016, filed with the SEC on January 25, 2017.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nArem Pacific Corporation\nDate: November 21,\nBy: /s/ Xin Jin\nXin Jin\nPresident, Chief Financial Officer and Sole Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nDate: November 21, 2022\nBy: /s/ Xin Jin\nXin Jin\nPresident, Chief Financial Officer and Sole Director"
}