{
    "cik": "1437750",
    "company": "T-REX Acquisition Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-10-17",
    "period_of_report": "2022-06-30",
    "sic": "7389",
    "state_of_inc": "NV",
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1437750/0001477932-22-007727-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1437750/000147793222007727/trex_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1437750/0001477932-22-007727.txt",
    "filename": "1437750_10K_2022_0001477932-22-007727.htm",
    "content": "ITEM 1. BUSINESS\nDescription of Business\nCryptocurrency Mining and Virtual Asset Acquisition\nFor the fiscal year ending June 30, 2022, the Company has become an emerging technology company focused on the various verticals with the cryptocurrency industry and related intangible assets that are connected to distributed ledger technologies. Through our operating subsidiary, Raptor Mining LLC (Raptor Mining), we are engaged in the cryptocurrency mining, which is the process of receiving cryptocurrency rewards for securing particular distributed ledger platforms. Our first cryptocurrency mining operation is located in Tampa, Florida, and the first distributed ledger platform that we are securing is Bitcoin. Bitcoin refers to the entire decentralized distributed ledger technology founded, upon information and belief, by a person using the pseudonym Satoshi Nakamoto and maintained by thousands of volunteers globally since January 2009. Bitcoin was the first decentralized digital currency that could be exchanged without a central controlling authority. Bitcoin could be exchanged on peer-to-peer network that supports direct transactions between users independent of any intermediary. Lowercase bitcoin refers to the virtual asset (cryptocurrency) that is used to incentivize miners to maintain the protocol network named Bitcoin. The Company regularly researches other opportunities to secure additional distributed ledger systems and protocols.\nOn February 17, 2022, the Company first began to receive bitcoin (or some fraction thereof) for securing the Bitcoin network. The Company generates revenue when the Company receives bitcoin rewards for Bitcoin mining. As noted above, the Companys first Bitcoin mining operation is located in Tampa, Florida. Subsequent to June 30, 2022, the Company has contracted with Simple Mining LLC, a Cedar-Falls, Iowa-based provider of co-location Bitcoin mining hosting services. As of the date of this filing, the Company has two mining data centers that collectively contribute 5,000 tera-hashes per second to Bitcoin mining and receives approximately 55 million Satoshi (0.55 bitcoin) per month at current protocol difficulty levels.\nAlthough bitcoin is presently the most prominent cryptocurrency, it is possible that another cryptocurrency could supplant it as the most prominent cryptocurrency, which could have a materially negative effect of the demand for bitcoin and, therefore, on its conversion spot price. Alternatively, the demand for bitcoin may fall for other reasons unknown to the Company. bitcoin represents the Companys largest cryptocurrency asset, so any substantial and sustained reduction in its conversion spot price would negatively impact its value as an asset.\nFurther, the Company has acquired and deployed miners that make use of application-specific integrated circuit (ASIC) chips, which are currently designed only to mine for bitcoin. If the demand for bitcoin experiences a sustained and substantial reduction and the conversion spot price of bitcoin falls correspondingly, we may not be able to continue to mine bitcoin and we may be forced to reconfigure our existing miners or acquire replacement miners capable of mining other, more profitable cryptocurrencies at that time. We expect to incur significant costs in connection with any such reconfiguration or to acquire replacement miners; further, we will likely be unable to continue to operate our miners during any such reconfiguration or replacement process. These added costs and such an interruption to our business operations could have a material negative effect on our business, and our stock price may suffer.\nInvesting in our securities involves a high degree of risk. Prior to making a decision about investing in our securities, you should carefully consider the specific risk factors discussed in the sections entitled Risk Factors contained in our September 8, 2022 Form S-1 registration statement, as amended, accessible through the Commissions website https://sec.gov\nSubsidiaries\nThe Company is a holding company with the following subsidiaries: Raptor Mining LLC, a Florida limited liability company (Raptor Mining); Megalodon Mining and Electric, LLC a Florida limited liability company (Megalodon); and TRXA Merger Sub, Inc., an inactive Delaware corporation (Merger Sub).\nRaptor Minings operations include the management of the Companys cryptocurrency mining operations, and virtual asset acquisitions. Megalodon was formed by the Company to investigate and potentially pursue a cryptocurrency co-location business model. The cryptocurrency co-location business model includes offering to host third-party owned cryptocurrency mining equipment in exchange for a fee, which may consist of a mix of cash and cryptocurrency consideration. Co-location service businesses typically have access to large data centers and inexpensive cryptocurrency mining inputs, such as low-cost electricity supply. As of the date of this Annual Report, the Company has commenced researching the acquisition of land to offering co-location services to other cryptocurrency miner owners.\nAdditional Information\nThe Company is subject to the information requirements of the Exchange Act, and, in accordance therewith, file annual, quarterly, and special reports, proxy statements and other information with the Commission. The Commission maintains an internet website at http://www.sec.gov that contains reports, proxy and information statements and other information regarding issuers that file electronically with the Commission. The periodic reports, proxy statements and other information that the Company files with the Commission are available for inspection on the Commissions website free of charge as soon as reasonably practicable after they are electronically filed with or furnished to the Commission. The Company maintains a website at https://trex-acq.com/ where you may also access these materials free of charge. We have included our website address as an inactive textual reference only and the information contained in, and that can be accessed through, our website is not incorporated into and is not part of this prospectus.\nEmployees & Employment Agreements\nAs of the date of this Annual Report filing, we have no employees. Our officer Frank Horkey is President/Chief Executive Officer/Chief Financial Officer. On January 1, 2015, the Company entered into a five-year contract with Mr. Horkey to, in addition to his roles as sole Officer and Director, to provide consulting services related to vetting potential acquisition targets. Mr. Horkey received 350,000 shares of the Companys restricted common shares as of January 1, 2015, for the performance of his multiple roles. The Company also entered into a Consulting Agreement with Tonia Pfannenstiel. Ms. Pfannenstiel will provide managerial oversight for a period not less than two years. Ms. Pfannenstiel received 100,000 shares of the Companys common shares as of January 1, 2015. Mr. Horkeys shares and Ms. Pfannenstiel shares were issued by the Company on September 9, 2020. The cost of these shares was treated as a prepaid expense and amortized over the life of the contracts. All costs related to these shares have been previously expensed.\nWe anticipate that we will continue to compensate our current and future directors and/or officers with stock and warrants and to retain independent contractors as consultants to support our expansion and business development. ITEM 1A. RISK FACTORS\nAs a smaller reporting company, the Company is not required to provide the information required by this item, but below are the risk factors the Company believes investors should consider before purchasing any of the Companys securities.\nGeneral Risks\nWe have a history of operating losses, and we may not be able to achieve or sustain profitability; we have recently shifted our focus to our blockchain and cryptocurrency mining business, and we may not be successful in this business.\nWe are not profitable and have incurred losses. We expect to continue to incur losses for the foreseeable future, and these losses could increase as we continue to work to develop our business. Prior to July 2021, we did not have any operations. In July 2021, we determined to pursue a blockchain and cryptocurrency related business. Currently, our primary operations are focused on our cryptocurrency mining business located in Tampa, Florida and Cedar Rapids, Iowa. Our current strategy is new and unproven, is in an industry that is itself new and evolving and is subject to the risks discussed below. This strategy, like our prior ones, may not be successful, and we may never become profitable. Even if we achieve profitability in the future, we may not be able to sustain profitability in subsequent periods.\nIf, pursuant to our co-location mining services agreements (collectively, the Co-location Agreements) with Ace Host (Ace Host) and Simple Mining LLC (Simple Mining), neither Ace Host nor Simple Mining cannot or will not supply sufficient electric power for us to operate our new miners, we may be required to relocate some or all of our miners to alternate co-location facilities, which may have a less advantageous cost structure and our business and results of operations may suffer as a result.\nWe have made a significant capital investment in new next generation miners because we believe we will be able to operate them to mine bitcoin and other cryptocurrencies at prices advantageous to us. We believe, based on information presently available to us, that the Co-location Agreements provide many advantages as opposed to other alternative arrangements. If we are required to deploy or move our miners from Ace Host or Simple Mining to another mining facility, we may be forced to accept less advantageous terms. Further, during relocation to a new mining facility, we will not be able to operate our miners and therefore we will not be able to generate revenue.\nFailure to effectively manage our growth could place strains on our managerial, operational, and financial resources and could adversely affect our business and operating results.\nOur growth has placed, and is expected to continue to place, a strain on our managerial, operational, and financial resources and systems, as well as on our management team. Any further growth or increase in the number of our strategic relationships may place additional strain on our managerial, operational, and financial resources and systems. Although we may not grow as we expect, if we fail to manage our growth effectively or to develop and expand our managerial, operational, and financial resources and systems, our business and financial results would be materially harmed.\nSignificant contributors to the Bitcoin network could propose amendments to its protocols and software which, if accepted and authorized, could negatively impact our business and operations.\nA small group of individuals contribute to the Bitcoin Core Project on GitHub.com, which is a leading source of quasi-governance that works to ensure that the Bitcoin blockchain remains decentralized and governed by consensus. According to its website, Bitcoin Core is an open-source project which maintains, and releases Bitcoin client software called ‘Bitcoin Core. It is a direct descendant of the original Bitcoin software client released by Satoshi Nakamoto after he published the famous Bitcoin whitepaper. Bitcoin Core is powered by an open-source development community, but it is maintained by a small group of maintainers and leading contributors.\nThis group of contributors can propose refinements or improvements to the Bitcoin networks source code through one or more software upgrades that alter the protocols and software that govern the Bitcoin network and the properties of Bitcoin, including the irreversibility of transactions and limitations on the mining of new Bitcoin. Proposals for upgrades and discussions relating thereto take place on online forums.\nThe open-source structure of the Bitcoin network protocol may result in inconsistent and perhaps even ineffective changes to the Bitcoin protocol. Failed upgrades or maintenance to the protocol could damage the Bitcoin network, which could adversely affect our business and the results of our operations.\nThe Bitcoin network operates based on an open-source protocol maintained by contributors, largely on the Bitcoin Core project on GitHub. As an open-source project, Bitcoin is not represented by an official organization or authority. As the Bitcoin network protocol is not sold and its use does not generate revenues for contributors, contributors are generally not compensated for maintaining and updating the Bitcoin network protocol. Although the MIT Media Labs Digital Currency Initiative funds the current maintainer of the Bitcoin Core project on GitHub, this type of financial incentive is not typical. The lack of guaranteed financial incentive for contributors to maintain or develop the Bitcoin network and the lack of guaranteed resources to adequately address emerging issues with the Bitcoin network may reduce incentives to address the issues adequately or in a timely manner. Changes to a digital asset network which we are mining on may adversely affect an investment in us.\nIf demand for bitcoin declines, or if another cryptocurrency replaces bitcoin as the most prominent cryptocurrency, our business and the results of our operations could suffer materially.\nAlthough bitcoin is presently the most prominent cryptocurrency, it is possible that another cryptocurrency could supplant it as the most prominent cryptocurrency, which could have a materially negative effect of the demand for bitcoin and, therefore, on its conversion spot price. Alternatively, the demand for bitcoin may fall for other reasons unknown to the Company. Bitcoin represents the Companys largest cryptocurrency asset, so any substantial and sustained reduction in its conversion spot price would negatively impact its value as an asset.\nFurther, the Company has acquired and deployed miners that make use of application-specific integrated circuit (ASIC) chips, which are currently designed only to mine for bitcoin. If the demand for bitcoin experiences a sustained and substantial reduction and the conversion spot price of bitcoin falls correspondingly, we may not be able to continue to mine bitcoin and we may be forced to reconfigure our existing miners or acquire replacement miners capable of mining other, more profitable cryptocurrencies at that time. We expect to incur significant costs in connection with any such reconfiguration or to acquire replacement miners; further, we will likely be unable to continue to operate our miners during any such reconfiguration or replacement process. These added costs and such an interruption to our business operations could have a material negative effect on our business, and our stock price may suffer.\nOur ability to adopt technology in response to changing security needs or trends poses a challenge to the safekeeping of our digital assets.\nThe history of digital asset exchanges has shown that exchanges and large holders of digital assets must adapt to technological change in order to secure and safeguard their digital assets. We may move our digital assets to various exchanges to exchange them for fiat currency, which will require us to rely on the security protocols of these exchanges to safeguard our digital assets. While these exchanges purport to be secure, and while we believe them to be so, no security system is perfect and malicious actors may be able to intercept our digital assets while we are in the process of selling them via such exchanges. Given the growth in their size and their relatively unregulated nature, we believe these exchanges will become a more appealing target for malicious actors. To the extent we are unable to identify and mitigate or stop new security threats, our digital assets may be subject to theft, loss, destruction, or other attack, which could adversely affect an investment in us.\nThe limited rights of legal recourse available to us and our lack of insurance protection for risk of loss of our digital assets exposes us and our shareholders to the risk of loss of our digital assets for which no person may ultimately be held liable and we may not be able to recover our losses.\nThe digital assets held by us are not insured. Further, banking institutions will not accept our digital assets and they are therefore not insured by the Federal Deposit Insurance Corporation (FDIC) or the Securities Investor Protection Corporation (SIPC). Therefore, a loss may be suffered with respect to our digital assets which is not covered by insurance, and we may not be able to recover any of our carried value in these digital assets if they are lost or stolen or suffer significant and sustained reduction in conversion spot price. If we are not otherwise able to recover damages from a malicious actor in connection with these losses, our business and results of operations may suffer, which may have a material negative impact on our stock price.\nIf regulatory changes or interpretations of our activities require our registration as a money services business (MSB) under the regulations promulgated by FinCEN under the authority of the U.S. Bank Secrecy Act, or otherwise under state laws, we may incur significant compliance costs, which could be substantial or cost prohibitive. If we become subject to these regulations, our costs in complying with them may have a material negative effect on our business and the results of our operations.\nTo the extent that the Companys activities cause it to be deemed an MSB under the regulations promulgated by FinCEN under the authority of the U.S. Bank Secrecy Act, we may be required to comply with FinCEN regulations, including those that would mandate us to implement anti-money laundering programs, make certain reports to FinCEN and maintain certain records.\nTo the extent that the Companys activities cause it to be deemed a money transmitter (MT) or equivalent designation, under state law in any state in which the Company operates, the Company may be required to seek a license or otherwise register with a state regulator and comply with state regulations that may include the implementation of anti-money laundering programs, maintenance of certain records and other operational requirements. The Company will continue to monitor for developments in such legislation, guidance, or regulations.\nSuch additional federal or state regulatory obligations may cause the Company to incur extraordinary expenses, possibly affecting an investment in the Shares in a material and adverse manner. Furthermore, the Company and its service providers may not be capable of complying with certain federal or state regulatory obligations applicable to MSBs and MTs. If the Company is deemed to be subject to and determines not to comply with such additional regulatory and registration requirements, we may act to dissolve and liquidate the Company or any subsidiary subject to such regulatory requirements. Any such action may adversely affect an investment in us.\nCurrent regulation of the exchange of bitcoin under the CEA by the CFTC is unclear; to the extent we become subject to regulation under the CFTC in connection with our exchange of bitcoin, we may incur additional compliance costs, which may be significant.\nCurrent legislation, including the Commodities Exchange Act of 1936, as amended (the CEA) is unclear with respect to the exchange of bitcoin. Changes in the CEA or the regulations promulgated thereunder, as well as interpretations thereof and official promulgations by the Commodities Futures Tradition Commission (CFTC), which oversees the CEA much like the SEC oversees the Securities Act and the Exchange Act, may impact the classification of bitcoin, and therefore may subject them to additional regulatory oversight by the CFTC.\nPresently, bitcoin derivatives are not excluded from the definition of a commodity future by the CFTC. We cannot be certain as to how future regulatory developments will impact the treatment of bitcoin under the law. Bitcoins have been deemed to fall within the definition of a commodity and, we may be required to register and comply with additional regulation under the CEA, including additional periodic report and disclosure standards and requirements. Moreover, we may be required to register as a commodity pool operator or as a commodity pool with the CFTC through the National Futures Association. Such additional registrations may result in extraordinary, non-recurring expenses, thereby materially and adversely impacting an investment in us. If we determine not to comply with such additional regulatory and registration requirements, we may seek to cease certain of our operations. Any such action may adversely affect an investment in us. As of the date of this prospectus, no CFTC orders or rulings are applicable to our business.\nUnfavorable global economic, business, or political conditions could adversely affect our business, financial condition, or results of operations.\nOur results of operations could be adversely affected by general conditions in the global economy and in the global financial markets, including conditions that are outside of our control, including the impact of health and safety concerns, such as those relating to the COVID-19 outbreak or other similar pandemics. The most recent global financial crisis caused extreme volatility and disruptions in the capital and credit markets. A severe or prolonged economic downturn could result in a variety of risks to our business, including weakened demand for bitcoin and our ability to raise additional capital when needed on acceptable terms, if at all. Any of the foregoing could harm our business and we cannot anticipate all the ways in which the current economic climate and financial market conditions could adversely impact our business.\nTo date, the COVID-19 outbreak has not had a material adverse impact on our operations. However, the future impact of the COVID-19 or any other pandemic outbreak is highly uncertain, cannot be predicted and there is no assurance that such outbreaks will not have a material adverse impact on the future results of the Company. The extent of the impact, if any, will depend on future developments, including actions taken by federal and state governments.\nOur future success will depend in large part upon the value of bitcoin and if we are not able to mine Bitcoin and sell it at prices favorable to us, the results of our operations will suffer.\nAs previously disclosed, our operating results will depend in large part upon the value of bitcoin because its the primary cryptocurrency we currently mine. Specifically, our revenues from our Bitcoin mining operations are based upon two factors: (1) the number of bitcoin rewards we successfully mine and (2) the value of bitcoin. In addition, our operating results are directly impacted by changes in the value of bitcoin, because under the value measurement model, both realized and unrealized changes will be reflected in our statement of operations (i.e., we will be marking bitcoin to fair value each quarter). This means that our operating results will be subject to swings based upon increases or decreases in the value of bitcoin.\nRisks Related to an Investment in Our Securities\nWe expect to experience volatility in the price of our common stock, which could negatively affect stockholders investments.\nThe trading price of our common stock may be highly volatile and could be subject to wide fluctuations in response to various factors, some of which are beyond our control. The stock market in general has experienced extreme price and volume fluctuations that have often been unrelated or disproportionate to the operating performance of companies with securities traded in those markets. Broad market and industry factors may seriously affect the market price of companies stock, including ours, regardless of actual operating performance. All of these factors could adversely affect your ability to sell your shares of common stock or, if you are able to sell your shares, to sell your shares at a price that you determine to be fair or favorable.\nOur common stock may be categorized as penny stock, which may make it more difficult for investors to sell their shares of common stock due to suitability requirements.\nOur common stock may be categorized as penny stock. The Commission has adopted Rule 15g-9 under the Exchange Act, which generally defines penny stock to be any equity security that has a market price (as defined) less than $5.00 per share or an exercise price of less than $5.00 per share, subject to certain exceptions. The price of our common stock is significantly less than $5.00 per share and, unless we qualify for an exception, may be considered penny stock. This designation imposes additional sales practice requirements on broker-dealers who sell to persons other than established customers and accredited investors. The penny stock rules, if applicable to us, would require a broker-dealer buying our securities to disclose certain information concerning the transaction, obtain a written agreement from the purchaser and determine that the purchaser is reasonably suitable to purchase the securities given the increased risks generally inherent in penny stocks. These rules may restrict the ability and/or willingness of brokers or dealers to buy or sell our common stock, either directly or on behalf of their clients, may discourage potential stockholders from purchasing our common stock, or may adversely affect the ability of stockholders to sell their shares.\nFinancial Industry Regulatory Authority (FINRA) sales practice requirements may also limit a stockholders ability to buy and sell our common stock, which could depress the price of our common stock.\nFINRA has adopted rules that require a broker-dealer to have reasonable grounds for believing that the investment is suitable for that customer before recommending an investment to a customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives, and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. Thus, the FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our shares of common stock, have an adverse effect on the market for our shares of common stock, and thereby depress our price per share of common stock.\nThe elimination of monetary liability against our directors, officers, and employees under Nevada law and the existence of indemnification rights for our obligations to our directors, officers, and employees may result in substantial expenditures by us and may discourage lawsuits against our directors, officers, and employees.\nOur Articles of Incorporation contain a provision permitting us to eliminate the personal liability of our directors to us and our stockholders for damages for the breach of a fiduciary duty as a director or officer to the extent provided by Nevada law. We may also have contractual indemnification obligations under any future employment agreements with our officers or indemnification agreements we have entered into with our directors. The foregoing indemnification obligations could result in us incurring substantial expenditures to cover the cost of settlement or damage awards against directors and officers, which we may be unable to recoup. These provisions and the resulting costs may also discourage us from bringing a lawsuit against directors and officers for breaches of their fiduciary duties; and may similarly discourage the filing of derivative litigation by our stockholders against our directors and officers even though such actions, if successful, might otherwise benefit us and our stockholders.\nWe may issue additional shares of common stock in the future, which could cause significant dilution to all stockholders.\nThe Board of Directors has resolved to amend the Companys Articles of Incorporation to authorize, among other things, the issuance of up to 350,000,000 shares of common stock, with a par value of $0.001 per share. As of June 30, 2022, we had 19,573,952 shares of common stock outstanding; however, we may issue additional shares of common stock in the future in connection with a financing or an acquisition. Any issuance of additional shares of our common stock, or securities convertible into our common stock, including but not limited to, warrants, options, and convertible promissory notes, will dilute the percentage ownership interest of all stockholders, may dilute the book value per share of our common stock, and may negatively impact the market price of our common stock.\nAnti-takeover effects of certain provisions of Nevada state law may hinder a potential takeover of us.\nNevada has a business combination law that prohibits certain business combinations between Nevada corporations and interested stockholders for two years after an interested stockholder first becomes an interested stockholder, unless the corporations board of directors approves the combination in advance. For purposes of Nevada law, an interested stockholder is any person who is (i) the beneficial owner, directly or indirectly, of ten percent or more of the voting power of the outstanding voting shares of the corporation or (ii) an affiliate or associate of the corporation and at any time within the two previous years was the beneficial owner, directly or indirectly, of ten percent or more of the voting power of the then outstanding shares of the corporation. The definition of the term business combination is sufficiently broad to cover virtually any kind of transaction that would allow a potential acquirer to use the corporations assets to finance the acquisition or otherwise to benefit its own interests rather than the interests of the corporation and its other stockholders.\nThe effect of Nevadas business combination law is potentially to discourage parties interested in taking control of us from doing so if they cannot obtain the approval of our Board. Both of these provisions could limit the price investors would be willing to pay in the future for shares of our common stock.\nBecause we do not intend to pay any cash dividends in the foreseeable future on our common stock, our stockholders will not be able to receive a return on their shares unless they sell them.\nWe intend to retain any future earnings to finance the development and expansion of our business. We do not anticipate paying any cash dividends on our common stock in the foreseeable future. Declaring and paying future dividends, if any, will be determined by our Board, based upon earnings, financial condition, capital resources, capital requirements, restrictions in our Articles of Incorporation, contractual restrictions, and such other factors as our Board deems relevant. Unless we pay dividends, our stockholders will not be able to receive a return on their shares unless they sell them. There is no assurance that stockholders will be able to sell shares when desired.\nFailure to execute our strategies could result in impairment of goodwill or other intangible assets, which may negatively impact profitability.\nWe evaluate goodwill for impairment on an annual basis or more frequently if impairment indicators are present based upon the fair value of each reporting unit. We assess the impairment of other intangible assets on an annual basis, or more frequently if impairment indicators are present, based upon the expected future cash flows of the respective assets. These valuations include managements estimates of sales, profitability, cash flow generation, capital structure, cost of debt, interest rates, capital expenditures, and other assumptions. Significant negative industry or economic trends, disruptions to our business, inability to achieve sales projections or cost savings, inability to effectively integrate acquired businesses, unexpected significant changes, or planned changes in use of the assets or in entity structure, and divestitures may adversely impact the assumptions used in the valuations. If the estimated fair value of our reporting units changes in future periods, we may be required to record an impairment charge related to goodwill or other intangible assets, which would reduce earnings in such period. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. DESCRIPTION OF PROPERTY\nReal Property and Offices\nOur executive, administrative and operating offices are provided at no cost on a month-to-month basis to the Company by our President, Frank Horkey, and are located at 7301 NW 4th Street, Suite 102, Plantation FL 33317. We are not currently under lease with regards to the offices. We believe that our facilities are adequate for our needs and that additional suitable space will be available on acceptable terms as required.\nASIC Cryptocurrency Mining Equipment and Other Material Property\nAs of June 30, 2022, the Company owned thirty (30) Bitmain S19 ASIC miners, and as of the date of this filing, the Company owns fifty (50) Bitmain S19 ASIC miners. The Company is actively seeking to purchase additional ASIC miners to scale the Companys cryptocurrency mining operations and virtual asset acquisitions. ITEM 3. LEGAL PROCEEDINGS\nAs of the date of this Annual Report, management is not aware of any legal proceedings contemplated by any governmental authority or any other party involving us or our properties. As of the date of this Annual Report, no director, officer, or affiliate is (i) a party adverse to us in any legal proceeding, or (ii) has an adverse interest to us in any legal proceedings. Management is not aware of any other legal proceedings pending or that have been threatened against us or our properties. ITEM 4. MINE SAFETY DISCLOSURE\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMARKET INFORMATION\nDuring the fiscal year ending June 30, 2022, our common stock is listed for quotation on the OTC Markets, Inc. Pink Tier (Pink Sheets Exchange) under the symbol TRXA.. Under this Pink Sheets Exchange listing, the Companys stock does not have any inter-dealer quotations and all orders, to the extent orders exist, are quotes from unsolicited customer orders. Unsolicited-Only stocks have a higher risk of wider spreads, increased volatility, and price dislocations. Investors may have difficulty selling this stock. An initial review by a broker-dealer under SEC Rule15c2-11 is required for brokers to publish competing quotes and provide continuous market making.\nHOLDERS\nAs of June 30, 2022, the number of stockholders of record is 102. The number of stockholders of record does not include beneficial owners of our common stock, whose shares are held in the names of various dealers, clearing agencies, banks, brokers, and other fiduciaries.\nDIVIDEND POLICY\nWe have never declared or paid a cash dividend on our capital stock. We do not expect to pay cash dividends on our common stock in the foreseeable future. We currently intend to retain our earnings, if any, for use in our business. Any dividends declared in the future will be at the discretion of our Board of Directors.\nRECENT ISSUANCES OF UNREGISTERED SECURITIES\nRelated Party Transactions\nOn August 6, 2021, the Company issued 450,000 shares of its common stock in exchange for the conversion of $45,000 of unpaid advisory compensation due to related Parties. In addition, as satisfaction of an external Settlement Agreement between Peter Simone/Corporate Capital Group International, LTD and the related Parties, the Company issued 1,050,000 Founder's shares.\nShares Issued for Services\nFrank Horkey received 350,000 shares for acting in the capacity of President and sole Director since his previous contract expired December 31, 2019 and 250,000 shares for his board position vesting as follows: eighty-three thousand three hundred thirty-three (83,333) shares upon signing as of July 1, 2022; eighty-three thousand three hundred thirty-three (83,333) shares at the end of the first year, June 30, 2023; and eighty-three thousand three hundred thirty-four (83,334) shares at June 30, 2024.\nMichael Christiansen received 250,000 shares of the Companys common stock vesting as follows: eighty-three thousand three hundred thirty-three (83,333) shares upon signing as of July 1, 2022; eighty-three thousand three hundred thirty-three (83,333) shares at the end of the first year, June 30, 2023; and eighty-three thousand three hundred thirty-four (83,334) shares on June 30, 2024.\nSquadron Marketing LLC received 250,000 shares of the Company common stock for acting on the Companys Advisory Board for fiscal 2023 vesting as follows: eighty-three thousand three hundred thirty-three (83,333) shares upon signing as of July 1, 2022; eighty-three thousand three hundred thirty-three (83,333) shares at the end of the first year, June 30, 2023; and eighty-three thousand three hundred thirty-four (83,334) shares on June 30, 2024.\nLazarus Asset Management LLC received 250,000 shares of the Company common stock for acting on the Companys Advisory Board for fiscal 2023 vesting as follows: eighty-three thousand three hundred thirty-three (83,333) shares upon signing as of July 1, 2022; eighty-three thousand three hundred thirty-three (83,333) shares at the end of the first year, June 30, 2023; and eighty-three thousand three hundred thirty-four (83,334) shares on June 30, 2024.\nJohn Bennet received 50,000 shares for extending his consulting contract through fiscal year end 2023.\nJames Marshall III received 75,000 shares of the Companys common stock for acting as the Companys technical consultant for fiscal 2023.\nFor the year ended June 30, 2022, the company issued 1,182,009 for the conversion of $118,050 in related party payables.\nPrivate Placement Transactions\nThe Securities Purchase Agreements\nOn November 10, 2021, we entered into a Securities Purchase Agreement with certain of the selling stockholders referenced in our most recent registration statement pursuant to which we sold to such selling stockholders $560,875 in aggregate principal amount of our common stock (747,837 shares) and warrants to purchase shares of our common stock (which we refer to as the PIPE Warrants), exercisable at any time before the close of business on December 31, 2024. The PIPE Warrants are comprised of 747,837 warrants with an exercise price of $1.50 per share.\nWe closed the transactions contemplated by the Securities Purchase Agreement. We issued the securities contemplated under the Securities Purchase Agreement in reliance upon the exemption from registration pursuant to Section 4(a)(2) of the Securities Act.\nThe Registration Rights Agreements\nOn November 10, 2021, in connection with the closing of the transactions contemplated by the Securities Purchase Agreement, we entered into Registration Rights Agreements with the selling stockholders who are parties to the Securities Purchase Agreement. With respect to the selling stockholders who are party to the Securities Purchase Agreement, we are obligated to file a registration statement registering the resale of (i) their Warrant Shares, (ii) any Shares issuable under the terms of the Securities Purchase Agreement, and (iii) any securities issued or then issuable upon any stock split, dividend or other distribution, recapitalization, or similar event with respect to the foregoing.\nPursuant to the Registration Rights Agreements, we agreed to file the registration statement(s) no later than the earlier of (a) 180-days after an initial public offering by the Company or (b) twelve (12) months after effective date of the Registration Rights Agreement. Furthermore, we agreed to grant the parties to the Securities Purchase Agreement a piggy-back registration right upon at least 10-day notice prior to the Companys filing of a registration statement (or confidential submission in draft form) with the SEC. As contemplated by the terms of the Registration Rights Agreements, the Company filed a registration statement on Form S-1, as amended, that became effective on September 8, 2022.\nWarrants Issued to Management and Consultants\nOn July 1, 2021, Squadron Marketing LLC and Lazarus Asset Management LLC were each issued a Class C warrant to purchase 250,000 shares of the Companys common stock for a period of three years at an exercise price of $1.50 commencing upon the effective date of the Companys registration statement for consulting services for fiscal year 2021.\nOn May 26, 2022, the Company issued to Frank Horkey Class C warrant to purchase 250,000 shares of the Companys common stock for a period of three years at an exercise price of $1.50 commencing upon the effective date of the Companys registration statement as part of his executive compensation during the 2021 fiscal year.\nOn May 26, 2022, Squadron Marketing LLC and Lazarus Asset Management LLC were each issued Class C warrant to purchase 500,000 shares of the Companys common stock for a period of three years at an exercise price of $1.50 commencing upon the effective date of the Companys registration statement related to consulting services during fiscal 2022.\nOn June 25, 2022, Frank Horkey and Michael Christiansen were each issued a class C warrants to purchase 250,000 shares of the Companys common stock for a period of three years at an exercise price of $1.50 commencing upon the effective date of the Companys registration statement for serving on the Companys Board of Directors for the upcoming 2023 fiscal year.\nPost-fiscal year 2022 Private Placement\nOn June 25, 2022, Squadron Marketing LLC and Lazarus Asset Management LLC were each issued a class C warrant to purchase 250,000 shares of the companys common stock for a period of three years at an exercise price of $1.50 commencing upon the effective date of the Companys registration statement for serving on the Companys Advisory Board for the upcoming 2023 fiscal year.\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS.\nAs of June 30, 2022, we had established no formal equity compensation plans which authorized an issuance of our equity securities.\nPENNY STOCK REGULATION\nShares of our common stock will probably be subject to rules adopted the SEC that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a price of less than $5.00 (other than securities registered on certain national securities exchanges or quoted on the NASDAQ system, provided that current price and volume information with respect to transactions in those securities is provided by the exchange or system). The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from those rules, deliver a standardized risk disclosure document prepared by the SEC, which contains the following:\n·\na description of the nature and level of risk in the market for penny stocks in both public offerings and secondary trading;\n·\na description of the brokers or dealers duties to the customer and of the rights and remedies available to the customer with respect to violation to such duties or other requirements of securities laws;\n·\na brief, clear, narrative description of a dealer market, including bid and ask prices for penny stocks and the significance of the spread between the bid and ask price;\n·\na toll-free telephone number for inquiries on disciplinary actions;\n·\ndefinitions of significant terms in the disclosure document or in the conduct of trading in penny stocks; and\n·\nsuch other information and is in such form (including language, type, size, and format), as the SEC shall require by rule or regulation.\nPrior to effecting any transaction in penny stock, the broker-dealer also must provide the customer the following:\n·\nthe bid and offer quotations for the penny stock;\n·\nthe compensation of the broker-dealer and its salesperson in the transaction;\n·\nthe number of shares to which such bid and ask prices apply, or other comparable information relating to the depth and liquidity of the market for such stock; and\n·\nmonthly account statements showing the market value of each penny stock held in the customers account.\nIn addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from those rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written acknowledgment of the receipt of a risk disclosure statement, a written agreement to transactions involving penny stocks, and a signed and dated copy of a written suitability statement. These disclosure requirements may have the effect of reducing the trading activity in the secondary market for a stock that becomes subject to the penny stock rules. Holders of shares of our common stock may have difficulty selling those shares because our common stock will probably be subject to the penny stock rules.\nTRANSFER AGENT\nThe stock transfer agent for our securities is Equiniti Trust Company 48 Wall Street, New York, New York 10005(EQ) and EQ can be reached at via phone at +1 (303) 282-4800 or via the URL https://equiniti.com/us/. ITEM 6. SELECTED FINANCIAL DATA\nAs a smaller reporting company, as defined by Rule 10(f)(1) of Regulation S-K, the Company is not required to provide this information. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATION\nThe following discussion of our financial condition and results of operations should be read in conjunction with our financial statements for the years ended June 30, 2021, and June 30, 2020, together with notes thereto as included in this Annual Report on Form 10-K. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to such differences include but are not limited to those discussed below and elsewhere in this Annual Report, particularly in the section entitled Risk Factors in both this Annual Report and in the Companys registration statement. Our audited financial statements are stated in United States Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles.\nThe Companys current operations are relatively new, and to some extent, experimental. We have not generated any significant revenue to date. We have incurred recurring losses to date. Our financial statements have been prepared assuming that we will continue as a going concern and, accordingly, do not include adjustments relating to the recoverability and realization of assets and classification of liabilities that might be necessary should we be unable to continue in operation.\nWe expect we will require additional capital to meet our long-term operating requirements. We expect to raise additional capital through, among other things, the sale of equity or debt securities.\nRESULTS OF OPERATION\nYear Ended June 30, 2022, Compared to Year Ended June 30, 2021\nOur net loss for the year ended June 30, 2022, was ($1,294,198) compared to a net loss of ($467,943) during the year ended June 30, 2021. The increase in the net loss was mainly due to a substantial increase in shares and warrants issued for services, including shares and warrants issued for services performed in previous years. During the years ended June 30, 2021, , we did not generate any revenue.\nDuring the year ended June 30, 2022, we incurred operating expenses of $1,296,364 compared to $467,943 incurred during the year ended June 30, 2021. The increase was mainly due to an increase in shares issued for services.\nDuring the year ended June 30, 2022, we incurred interest expenses of $0, compared to $0 incurred during the year ended June 30, 2021.\nLIQUIDITY AND CAPITAL RESOURCES\nYear Ended June 30, 2022\nAs of June 30, 2022, our current assets were $57,149 and our current liabilities were $138,954 which resulted in a working capital deficit of $81,805.\nAs of June 30, 2022, our total liabilities were $138,954 comprised entirely of current liabilities.\nCash Flows from Operating Activities\nFor the year ended June 30, 2022, net cash flows used in operating activities was ($233,321) compared to net cash flows received in operating activity of $0 for the same period in 2021.\nCash Flows used by Investing Activities\nFor the year ended June 30, 2022, net cash flows used by investing activities was $445,500 and June 30, 2021, net cash flows used by investing activities was $0.\nCash Flows from Financing Activities\nFor the year ended June 30, 2022, net cash flows from financing activities were $678,925. For the year ended June 30, 2021, net cash flows provided by financing activities was $0.\nPLAN OF OPERATION AND FUNDING\nWe expect that working capital requirements will continue to be funded through a combination of proceeds from (a) the generation of revenues through the sales of bitcoin and other cryptocurrency sales and (b) the sales of stock. Our working capital requirements are expected to increase in line with the growth of our business.\nOur principal demands for liquidity are to increase business operations and for general corporate purposes. We intend to meet our liquidity requirements, including capital expenditures related to future business operations, and the expansion of our business, through cash flow provided by funds raised through proceeds from the issuance of debt or equity.\nMATERIAL COMMITMENTS\nThe Company, through its wholly owned subsidiary Raptor Mining, has contracts with two co-location cryptocurrency mining facilities. The first one is with Ace Host, a Tampa, Florida based facility, and the second one, which commenced subsequent to June 30, 2022, is with Simple Mining LLC, a Cedar Falls, Iowa based facility. While both of these contracts are month to month, Raptor will continue to need co-location facilities to host it mining equipment.\nThe Company purchased approximately $90,000 of mining equipment from Simple Mining, LLC in September 2022.\nPURCHASE OF SIGNIFICANT EQUIPMENT\nDuring the next twelve months, the Company intends to acquire between fifty (50) and one hundred and fifty (150) ASIC miners per quarter. Although pricing for ASIC miners is generally directly related to the price of bitcoin, ASIC miners as of this Annual Report cost between $7,500 and $12,000 per ASIC miner.\nCRITICAL ACCOUNTING POLICIES\nOur financial statements and accompanying notes have been prepared in accordance with United States generally accepted accounting principles applied on a consistent basis. The preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods.\nWe regularly evaluate the accounting policies and estimates that we use to prepare our financial statements. A complete summary of these policies is included in the notes to our financial statements. In general, managements estimates are based on historical experience, on information from third party professionals, and on various other assumptions that are believed to be reasonable under the facts and circumstances. Actual results could differ from those estimates made by management.\nOFF-BALANCE SHEET ARRANGEMENTS\nAs of the date of this Annual Report, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nGOING CONCERN\nThe independent auditors report accompanying our June 30, 2022, and June 30, 2021, financial statements contain an explanatory paragraph expressing substantial doubt about our ability to continue as a going concern. The financial statements have been prepared assuming that we will continue as a going concern, which contemplates that we will realize our assets and satisfy our liabilities and commitments in the ordinary course of business. We have suffered recurring losses from operations and have a working capital deficit. These factors raise substantial doubt about our ability to continue as a going concern.\nRECENTLY ISSUED ACCOUNTING STANDARDS\nOur financial statements and accompanying notes have been prepared in accordance with United States generally accepted accounting principles applied on a consistent basis. The preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods.\nWe regularly evaluate the accounting policies and estimates that we use to prepare our financial statements. A complete summary of these policies is included in the notes to our financial statements. In general, managements estimates are based on historical experience, on information from third party professionals, and on various other assumptions that are believed to be reasonable under the facts and circumstances. Actual results could differ from those estimates made by management.\nManagement does not believe that any other recently issued, but not yet effective accounting pronouncements, if adopted, would have a material effect on the accompanying consolidated financial statements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements required by Item 8 are presented in the following order:\nReports of Independent Registered Public Accounting Firms (Firm ID #5525)\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Stockholders Equity\nConsolidated Statements of Cash Flows\nNotes to the Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders of Trex Acquisitions Corp\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Trex Acquisitions Corp (the Company) as of June 30, 2022, and 2021, and the related consolidated statements of operations, changes in shareholders equity, and cash flows for each of the years in the two-year period ended June 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021 and the results of its operations and its cash flows for each of the years in the two-year period ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has an accumulated deficit and negative working capital. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition\nDescription of Critical Audit Matter\nAs discussed in Note 2 to the consolidated financial statements, the Companys revenue is recognized through the mining of digital assets. Digital assets, including revenue recognition, is an accounting and auditing area in which there lacks authoritative guidance, and as such the auditing digital assets and related activity requires significant auditor judgment.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur principal audit procedures to evaluate managements revenue recognition consisted of the following, among others:\n1.\nObtained and reviewed the Company's policies for recognizing revenue and the related application under generally accepted accounting principles.\n2.\nVerified the reliability and accuracy of daily mining reports on which recognized revenue is derived.\n3.\nPerformed analysis of daily impairment of digital assets and recalculated the fair value and assessed the appropriateness of the valuation at period-end.\nWe have served as the Companys auditor since 2018.\nFruci & Associates II, PLLC\nSpokane, Washington\nOctober 13, 2022\nTREX ACQUISITION CORP.\nCONSOLIDATED BALANCE SHEETS\nASSETS\nJune 30, 2022\nJune 30, 2021\nCURRENT ASSETS:\nCash\n$ 104\n$ -\nCrypto Currency Held\n9,211\n-\nPrepaid consulting\n47,834\n-\nTOTAL CURRENT ASSETS\n57,149\n-\nPlant and Equipment\n421,633\n-\nPrepaid consulting\n408,804\n-\nFacility Deposit\n10,570\n-\nTOTAL ASSETS\n$ 898,156\n$ -\nLIABILITIES AND STOCKHOLDERS EQUITY (DEFICIT)\nCURRENT LIABILITIES:\nAccounts Payable and Accrued Expenses\n$ 18,954\n$ 1,124\nDue to Related Parties\n120,000\n45,000\nTOTAL CURRENT LIABILITIES\n138,954\n46,124\nTOTAL LIABILITIES\n138,954\n46,124\nCommitments and Contingencies\n-\n-\nSTOCKHOLDERS EQUITY (DEFICIT)\nCommon Stock, 0.001 par value, authorized 350,000,000 shares and 19,573,952 and 14,669,106 issued and outstanding as of June 30, 2022, and June 30, 2021 respectively\n19,574\n14,669\nAdditional Paid In Capital\n4,900,385\n2,805,766\nShares to be issued\n-\n-\nAccumulated deficit\n(4,160,757 )\n(2,866,559 )\nTOTAL STOCKHOLDERS EQUITY (DEFICIT)\n759,202\n(46,124 )\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY (DEFICIT)\n$ 898,156\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nTREX ACQUISITION CORP.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nfor the years ended June 30\nREVENUE\n$ 61,906\n$ -\nCost of goods sold\n41,949\n-\nGross Profit\n(19,957 )\n-\nEXPENSES\nTransfer Agent and Filing Fees\n6,533\n11,193\nProfessional Fees\n79,330\n94,000\nManagement and Consulting Fees\n1,113,662\n360,000\nAdministration Fees\n96,839\n2,750\nTOTAL EXPENSES\n1,296,364\n467,943\nLoss from Operations\n(1,276,407 )\n(467,943 )\nImpairment of digital assets\n(17,791\n)\n-\nInterest Expense\n-\n-\nLOSS BEFORE TAXES\n(1,294,198 )\n(467,943 )\nProvision for Income Taxes\n-\n-\nNET LOSS\n$ (1,294,198 )\n$ (467,943 )\nNET LOSS PER COMMON SHARE - BASIC & DILUTED\n$ (0.11 )\n$ (0.04 )\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING - BASIC & DILUTED\n16,276,438\n10,949,180\nThe accompanying notes are an integral part of these consolidated financial statements.\nTREX ACQUISITION CORP.\nCONSOLIDATED STATEMENT OF CHANGES IN SHAREHOLDERS EQUITY\nas of June 30, 2022 and 2021\nAdditional\nCommon Stock\nPaid in\nShares to\nAccumulated\nShares\nAmount\nCapital\nbe issued\nDeficit\nTOTAL\nBalance, June 30, 2020\n103,073\n$ 103\n$ 815,996\n$ 1,105,674\n$ (2,398,616 )\n$ (476,843 )\nShares issued from to be issued\n2,535,835\n2,536\n1,103,138\n(1,105,674 )\n-\n-\nShares issued from private sale\n350,000\n(350 )\n-\n-\n-\nShares issued for services\n300,000\n299,700\n-\n-\n300,000\nShares issued for related party debt conversion\n11,380,198\n11,380\n587,282\n-\n-\n598,662\nNet Loss\n-\n-\n-\n-\n(467,943 )\n(467,943 )\nBalance June 30, 2021\n187,500\n14,669\n2,805,766\n-\n(2,866,559 )\n(46,124 )\nShares issued for related party debt conversion\n1,500,000\n1,500\n43,500\n-\n45,000\nShare based expense for warrants issued\n770,850\n770,850\nShares issued for subscriptions\n747,837\n560,127\n-\n560,875\nShares issued for services\n1,475,000\n1,475\n603,274\n604,749\nShares issued for debt conversion\n1,182,009\n1,182\n116,868\n-\n118,050\n-\nNet Loss\n-\n-\n-\n-\n(1,294,198 )\n(1,294,198 )\nBalance June 30, 2022\n19,573,952\n$ 19,574\n$ 4,900,385\n$ -\n$ (4,160,757 )\n$ 759,202\nThe accompanying notes are an integral part of these consolidated financial statements.\nTREX ACQUISITION CORP.\nCONSOLIDATED STATEMENT OF CASH FLOWS\nfor the years ended June 30,\nOPERATING ACTIVITIES\nNet Income (Loss)\n$ (1,294,198 )\n$ (467,943 )\nDepreciation\n23,867\n-\nImpairment of digital assets\n17,791\n-\nShare issued for services and warrants issued\n993,662\n300,000\nChange in Crypto Currency Held\n18,297\nChange in other assets\n(10,570 )\nChange in Related Party Advances\n-\n170,046\nChange Accounts Payable and Accrued Expenses\n17,830\nNet Cash Used by Operating Activities\n(233,321 )\n(2,103 )\nINVESTING ACTIVITIES:\nPurchase of Equipment\n(445,500 )\n-\nPurchase of Land\n-\n-\nNet cash used by investing activities\n(445,500 )\n-\nFINANCING ACTIVITIES:\nAdvances related party\n118,050\n-\nProceeds from subscriptions received\n560,875\n-\nNet cash provided by financing activities\n678,925\n-\nNET INCREASE (DECREASE) IN CASH\n-\nCASH AT BEGINNING OF PERIOD\n-\n-\nCASH AT END OF PERIOD\n$ 104\n$ -\nSupplemental Cashflow Information\nInterest Paid\n$ -\n$ -\nTaxes Paid\n$ -\n$ -\nSupplemental Non-Cash Information\nShares issued for related party debt conversion\n$\n418,050\n$\n598,662\nShares issued and recorded as prepaid expense\n$\n600,138\n$\n-\nThe accompanying notes are an integral part of these consolidated financial statements.\nTREX ACQUISITION CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJune 30, 2022, and 2021\nNOTE 1 - ORGANIZATION AND DESCRIPTION OF BUSINESS\nT-REX Acquisition Corp. (The Company) was formed on January 16, 2008, in the state of Nevada under the name Plethora Resources, Inc. as a development stage enterprise. The Company was originally organized to engage in the business of consulting to oil and gas exploration companies interested in obtaining exploration and production licenses at auction for oil and gas properties in Russia. The Company later changed its name to Sync2 Networks Corp when the Company began to engage in software-related services. On March 20, 2014, the Company changed its name to TREX Acquisition Corp. after the Company business operations under the Sync2 Networks branding had ceased. On June 21, 2021, the Company decided to pivot from seeking an acquisition candidate to operating a cryptocurrency mining business. On February 17, 2022, the Company began mining bitcoin at Ace Hosting, a Tampa, Florida located data center. On June 30, 2022, the Company changed its name to T-REX Acquisition Corp.\nAs of June 30, 2022, the Company is a holding company with the following subsidiaries: Raptor Mining LLC, a Florida limited liability company (Raptor Mining); and TRXA Merger Sub, Inc., an inactive Delaware corporation (Merger Sub). On July 1, 2022, we incorporated Megalodon Mining and Electric, LLC, a Florida limited liability company (Megalodon);\n2020 TRXA Merger Sub Inc.\nOn March 13, 2020, the Company incorporated the Merger Sub in order to facilitate the acquisition of a pre-revenue Software-as-a-Service internet platform business. The Companys sole Officer and Director currently serves as the sole officer and director of the Merger Sub. As of the date of this filing, neither the Company nor the Merger Sub have entered into a definitive agreement or non-binding letter of intent to acquire a company.\n2021 Raptor Mining LLC and 2022 Megalodon Mining and Electric LLC\nOn July 9, 2021, the Company formed Raptor Mining in order to pursue the Companys new business operating strategy to engage in cryptocurrency mining, which is used to secure decentralized network protocols and decentralized distributed ledgers. On July 1, 2022, the Company formed Megalodon to investigate and potentially pursue a cryptocurrency co-location business model. The cryptocurrency co-location business model includes offering to host third-party owned cryptocurrency mining equipment in exchange for a fee, which may consist of a mix of cash and cryptocurrency consideration. Co-location service businesses typically have access to large data centers and inexpensive cryptocurrency mining inputs, such as low-cost electricity supply. As of the date of this Annual Report, the Company has commenced researching the acquisition of land to begin offering co-location services to other cryptocurrency miner owners\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe Companys financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP). The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nManagement further acknowledges that it is solely responsible for adopting sound accounting practices, establishing and maintaining a system of internal accounting control and preventing and detecting fraud. The Companys system of internal accounting control is designed to assure, among other items, that 1) recorded transactions are valid; 2) valid transactions are recorded; and 3) transactions are recorded in the proper period in a timely manner to produce financial statements which present fairly the financial condition, results of operations and cash flows of the Company for the respective periods being presented\nDetermination of Bad Debts\nThe Companys policy is to analyze the collectability of Accounts and Notes Receivable on a monthly basis to determine whether any allowance for doubtful accounts is necessary. Once the allowance has been determined the offset is booked to bad debt expense and subsequently if the account is deemed to be a bad debt, it is written off the e allowance for doubtful accounts.\nPrinciples of Consolidation\nAs of June 30, 2022, the accounts include those of the Company and its 100% owned subsidiaries, Merger Sub, Raptor Mining Megalodon Mining and Electric. All intercompany transactions have been eliminated.\nOn March 13, 2020, the Company incorporated Merger Sub in order to facilitate the acquisition of a pre-revenue Software-as-a-Service internet platform business. The Companys sole Officer and Director currently serves as the sole officer and director of the Merger Sub. As of the date of this filing, neither the Company nor the Merger Sub have entered into a definitive agreement or non-binding letter of intent to acquire a company. On July 9, 2021, the Company organized Raptor Mining, which currently generates revenues via its operating business.\nUse of estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Significant estimates include the estimated useful lives of property and equipment. Actual results could differ from those estimates.\nCash equivalents\nThe Company considers all highly liquid investments with a maturity of three months or less when purchased to be cash equivalents.\nFair value of financial instruments\nThe Company follows paragraph 825-10-50-10 of the FASB Accounting Standards Codification for disclosures about fair value of its financial instruments and paragraph 820-10-35-37 of the FASB Accounting Standards Codification (Paragraph 820-10-35-37) to measure the fair value of its financial instruments. Paragraph 820-10-35-37 establishes a framework for measuring fair value in accounting principles generally accepted in the United States of America (U.S.) GAAP and expands disclosures about fair value measurements. To increase consistency and comparability in fair value measurements and related disclosures, Paragraph 820-10-35-37 establishes a fair value hierarchy which prioritizes the inputs to valuation techniques used to measure fair value into three (3) broad levels. The fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The three (3) levels of fair value hierarchy defined by Paragraph 820-10-35-37 are described below:\nLevel 1\nQuoted market prices available in active markets for identical assets or liabilities as of the reporting date.\nLevel 2\nPricing inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the reporting date.\nLevel 3\nPricing inputs that are generally unobservable inputs and not corroborated by market data.\nLevel 1\nLevel 2\nLevel 3\nTotal\nFair value of crypto currency held - June 30, 2022\n$ 9,211\n$ -\n$ -\n$ 9,211\nLevel 1\nLevel 2\nLevel 3\nTotal\nFair value of crypto currency held - June 30, 2021\n$ -\n$ -\n$ -\n$ -\nThe carrying amount of the Companys financial assets and liabilities, such as cash, and accrued expenses approximate their fair value because of the short maturity of those instruments. The Companys notes payable approximate the fair value of such instruments based upon managements best estimate of interest rates that would be available to the Company for similar financial arrangements as of June 30, 2022.\nThe assets and liabilities recorded on the balance sheet approximate their fair value.\nEquipment\nEquipment is recorded at cost. Expenditures for major additions and betterments are capitalized. Maintenance and repairs are charged to operations as incurred. Depreciation of equipment is computed by the straight-line method (after taking into account their respective estimated residual values) over the assets estimated useful life of three (3) or seven (7) years. Upon sale or retirement of equipment, the related cost and accumulated depreciation are removed from the accounts and any gain or loss is reflected in statements of operations. Equipment consists solely of bitcoin miners used in the operation. The equipment value is based on the cost and the potential impairment is reviewed periodically and as of June 30, 2022 there was no impairment of any of the mining equipment.The depreciation expense for the year ended June 30, 2022, was $23,867.\nStock based compensation\nThe Company accounts for stock-based compensation in accordance with ASC Section 718 Compensation - Stock Compensation. Under the fair value recognition provisions of ASC 718 stock-based compensation is measured at the grant date based on the fair value of the award and is recognized as expensed ratably over the requisite service period/vesting period.\nThe Company accounts for its non-employee stock-based compensation in accordance with Update 2018-07-Compensation-Stock Compensation (Topic 718): Improvements to Nonemployee Share-Based Payment Accounting.\nCommitments and contingencies\nThe Company follows subtopic 450-20 of the FASB Accounting Standards Codification to report accounting for contingencies. Liabilities for loss contingencies arising from claims, assessments, litigation, fines and penalties and other sources are recorded when it is probable that a liability has been incurred and the amount of the assessment can be reasonably estimated. Through June 30, 2022, and through the date of filing, there have been no intervening lawsuits, claims or judgments filed.\nRevenue recognition\nThe Company recognizes revenue under ASU No. 2014-09, Revenue from Contracts with Customers (Topic 606), (ASC 606). The core principle of the revenue standard is that a company should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the company expects to be entitled in exchange for those goods or services. The Company only applies the five-step model to contracts when it is probable that the Company will collect the consideration it is entitled to in exchange for the goods and services transferred to the customer.\nWe recognize the revenue when the coins are mined. In order to value the bitcoin that we mined and maintain in our Slush Pool wallet, we mark to market using the last quote at 11:59 on the day the coin is mined. and is then evaluated for impairment on a daily basis with any adjustments recorded in the other income / expense section of the statement of operations. We then multiply the quote against the (in this case fractional) number of bitcoin we own. That gives the dollar value of our position.\nDuring the years ended June 30, 2022 and June 30, 2021, the company recognized $61,906 and $0 respectively, in revenue from its cryptocurrency mining operations.\nIncome taxes\nFederal Income taxes are not currently due since we have had losses since inception.\nIncome taxes are provided based upon the liability method of accounting pursuant to ASC 740-10-25 Income Taxes - Recognition. Under this approach, deferred income taxes are recorded to reflect the tax consequences in future years of differences between the tax basis of assets and liabilities and their financial reporting amounts at each year-end. A valuation allowance is recorded against deferred tax assets if management does not believe the Company has met the more likely than not standard required by ASC 740-10-25-5.\nDeferred income tax amounts reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax reporting purposes.\nAs of June 30, 2022, we had a net operating loss carry-forward of approximately $(4,160,757) and a deferred tax asset of $873,759 using the statutory rate of 21%. The deferred tax asset may be recognized in future periods, not to exceed 20 years. However, due to the uncertainty of future events we have booked valuation allowance of $(873,759). FASB ASC 740 prescribes recognition threshold and measurement attributes for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. FASB ASC 740 also provides guidance on de-recognition, classification, interest and penalties, accounting in interim periods, disclosure and transition. On June 30, 2022, the Company had not taken any tax positions that would require disclosure under FASB ASC 740.\nJune 30,\nJune 30,\nDeferred Tax Asset\n$ 873,759\n$ 601,977\nValuation Allowance\n(873,759 )\n(601,977 )\nDeferred Tax Asset (Net)\n$ -\n$ -\nDue to the changes the Tax Reform Act of 1986 and the Tax Cut and Jobs Act of 2017, net operating loss carryforwards for Federal Income tax reporting purposes are subject to additional limitations. Should certain changes in ownership occur, our net operating loss carryforwards may be limited to use in future years. In addition, tax rates on corporations were reduced and certain other deductions limited. These changes may affect the income tax benefit calculation and related allowance during subsequent fiscal years\nNet income (loss) per common share\nNet income (loss) per common share is computed pursuant to section 260-10-45 of the FASB Accounting Standards Codification. Basic net income (loss) per common share is computed by dividing net income (loss) by the weighted average number of shares of common stock outstanding during the period. Diluted net income (loss) per common share is computed by dividing net income (loss) by the weighted average number of shares of common stock and potentially outstanding shares of common stock during the period. The weighted average number of common shares outstanding and potentially outstanding common shares assumes that the Company incorporated as of the beginning of the first period presented.\nThere were outstanding warrants that could convert into 3,685,333 shares of common stock as of June 30, 2022. At the end of both periods the potentially dilutive shares were excluded because the effect would have been anti-dilutive.\nCash flows reporting\nThe Company adopted paragraph 230-10-45-24 of the FASB Accounting Standards Codification for cash flows reporting, classifies cash receipts and payments according to whether they stem from operating, investing, or financing activities and provides definitions of each category, and uses the indirect or reconciliation method (Indirect method) as defined by paragraph 230-10-45-25 of the FASB Accounting Standards Codification to report net cash flow from operating activities by adjusting net income to reconcile it to net cash flow from operating activities by removing the effects of (a) all deferrals of past operating cash receipts and payments and all accruals of expected future operating cash receipts and payments and (b) all items that are included in net income that do not affect operating cash receipts and payments. The Company reports the reporting currency equivalent of foreign currency cash flows, using the current exchange rate at the time of the cash flows and the effect of exchange rate changes on cash held in foreign currencies is reported as a separate item in the reconciliation of beginning and ending balances of cash and cash equivalents and separately provides information about investing and financing activities not resulting in cash receipts or payments in the period pursuant to paragraph 830-230-45-1 of the FASB Accounting Standards Codification.\nAdvertising Costs\nThe Company expenses the cost of advertising and promotional materials when incurred. Total Advertising costs were zero for all periods.\nSubsequent events\nThe Company follows the guidance in Section 855-10-50 of the FASB Accounting Standards Codification for the disclosure of subsequent events. The Company will evaluate subsequent events through the date when the financial statements were issued. Pursuant to ASU 2010-09 of the FASB Accounting Standards Codification, the Company as an SEC filer, considers its financial statements issued when they are widely distributed to users, such as through filing them on EDGAR.\nNOTE 3 - GOING CONCERN\nAs reflected in the accompanying financial statements, the Company had an accumulated deficit of $4,160,757 and a working capital deficit of $81,805 as of June 30, 2022.\nWhile the Company is attempting to commence operations and generate revenues, the Companys cash position may not be significant enough to support the Companys daily operations. Management intends to raise additional funds by way of a public or private offering. Management believes that the actions presently being taken to further implement its business plan and generate revenues provide the opportunity for the Company to continue as a going concern. While the Company believes in the viability of its strategy to generate revenues and in its ability to raise additional funds, there can be no assurances to that effect and there is substantial doubt about the Companys ability to continue as a going concern. The ability of the Company to continue as a going concern is dependent upon the Companys ability to further implement its business plan and generate revenues.\nThe consolidated financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nNOTE 4 - RELATED PARTY TRANSACTIONS\nFree office space\nThe Company has been provided office space by its Chief Executive Officer at no cost. Management determined that such cost is nominal and did not recognize the rent expense in its financial statements.\nDue to Related Parties\nOn August 6, 2021, the Company issued 450,000 shares of its common stock in exchange for the conversion of $45,000 of unpaid advisory compensation due to related Parties. In addition, as satisfaction of an external Settlement Agreement between Peter Simone/Corporate Capital Group International, LTD and the related Parties, the Company issued 1,050,000 Founder's shares.\nFor the year ended June 30, 2022, the company issued 1,182,009 for the conversion of $118,050 in related party payables.\nAs of June 30, 2022, the company owed $120,000 due to related parties for management fees for the year ended June 30, 2022.\nNOTE 5 - COMMON STOCK\nOn August 6, 2021, the Company issued 450,000 shares of its common stock in exchange for the conversion of $45,000 of unpaid advisory compensation due to related Parties. In addition, as satisfaction of an external Settlement Agreement between Peter Simone/Corporate Capital Group International, LTD and the related Parties, the Company issued 1,050,000 Founders shares.\nFrank Horkey received 350,000 shares for acting in the capacity of President and sole Director since his previous contract expired December 31, 2019 and 250,000 shares for his board position vesting as follows: eighty-three thousand three hundred thirty-three (83,333) shares upon signing as of July 1, 2022; eighty-three thousand three hundred thirty-three (83,333) shares at the end of the first year, June 30, 2023; and eighty-three thousand three hundred thirty-four (83,334) shares at June 30, 2024.\nMichael Christiansen received 250,000 shares of the Companys common stock vesting as follows: eighty-three thousand three hundred thirty-three (83,333) shares upon signing as of July 1, 2022; eighty-three thousand three hundred thirty-three (83,333) shares at the end of the first year, June 30, 2023; and eighty-three thousand three hundred thirty-four (83,334) shares on June 30, 2024.\nSquadron Marketing LLC received 250,000 shares of the Company common stock for acting on the Companys Advisory Board for fiscal 2023 vesting as follows: eighty-three thousand three hundred thirty-three (83,333) shares upon signing as of July 1, 2022; eighty-three thousand three hundred thirty-three (83,333) shares at the end of the first year, June 30, 2023; and eighty-three thousand three hundred thirty-four (83,334) shares on June 30, 2024.\nLazarus Asset Management LLC - received 250,000 shares of the Company common stock for acting on the Companys Advisory Board for fiscal 2023 vesting as follows: eighty-three thousand three hundred thirty-three (83,333) shares upon signing as of July 1, 2022; eighty-three thousand three hundred thirty-three (83,333) shares at the end of the first year, June 30, 2023; and eighty-three thousand three hundred thirty-four (83,334) shares on June 30, 2024.\nJohn Bennet received 50,000 shares for extending his consulting contract through fiscal year end 2023.\nJames Marshall III received 75,000 shares of the Companys common stock for acting as the Companys technical consultant for fiscal 2023.\nNOTE 6 - WARRANTS\nOn May 3, 2014, it was resolved that the Company shall offer 250,000 Units at a price of $0.80 per unit. Each Unit shall consist of (a) one (1) share of common stock and (b) a combination of series A warrants (which may be exercised within three (3) years) and series B warrants exercised within five (5) years of the consummation of a merger.\nOn May 14, 2014, the Company entered into a subscription agreement for 157,500 units at $0.80 per share for a total of $125,000. Each unit consists of one (1) share of common stock and one (1) series A warrant to purchase one share of common stock at $1.25 per share. Each A warrant expires three years from the date of issuance.\nOn May 14, 2014, the Company entered into a subscription agreement for 32,000 units at $0.80 per share for a total of $25,000. Each unit consists of one (1) share of common stock and one (1) series A warrant to purchase one share of common stock at $1.25 per share. Each A warrant expires three years from the date of issuance.\nOn July 14, 2014, the Company entered into a subscription agreement for 62,500 units at $0.80 per share for a total of $50,000. Each unit consists of one (1) share of common stock, and two (2) Series A warrants to purchase one (1) share of common stock at $.65 per share and one (1) series B warrant to purchase one (1) share of common stock at $.80. Each series A warrant expires three years from the consummation of a merger and each series B warrant expires 5 years from the consummation a merger.\nThe Company may call the B Warrants at such point the quoted market closing price is at least $2.50 for 20 consecutive trading days. In the event the Company calls the Warrants, it shall immediately notify holders of the Warrants of the call. Warrants holders will be granted a period of 45 calendar days to redeem the Warrants by returning the Warrant to the Company accompanied by payment of $.80 per share. The warrants were valued using a Black Scholes calculation.\nThe inputs for series A used a price $.59, a strike price range of .65 - 1.25, maturity 3 years, a risk-free interest rate of 3.9% and a beta of 50% estimated and were valued at $.202. The inputs for series B used a price $.59, a strike price of .80, maturity 5 years, a risk-free interest rate of 3.9% and a beta of 50% estimated and were valued at $.232.\nAs of the filing date of this annual report, 187,500 A warrants have expired leaving only 125,000 A Warrants and 62,500 B Warrants remaining effective since the Company has yet to consummate a merger.\nOn May 5, 2022 issued shares and warrants related to that certain Securities Purchase Agreement dated November 10, 2021with certain of the selling stockholders referenced in our most recent registration statement pursuant to which we sold to such selling stockholders $560,875 in aggregate principal amount of our common stock (747,837 shares) and warrants to purchase shares of our common stock (which we refer to as the PIPE Warrants), exercisable at any time before the close of business on December 31, 2024. The PIPE Warrants are comprised of 747,837 warrants with an exercise price of $1.50 per share.\nOn July 1, 2021, Squadron Marketing LLC and Lazarus Asset Management LLC were each issued a Class C warrant to purchase 250,000 shares of the Companys common stock for a period of three years at an exercise price of $1.50.\nOn May 26, 2022, the Company issued to Frank Horkey Class C warrant to purchase 250,000 shares of the Companys common stock for a period of three years at an exercise price of $1.50 commencing upon the effective date of the Companys registration statement as part of his executive compensation during the 2022 fiscal year.\nOn May 26, 2022, Squadron Marketing LLC and Lazarus Asset Management LLC were each issued Class C warrant to purchase 500,000 shares of the Companys common stock for a period of three years at an exercise price of $1.50 commencing upon the effective date of the Companys registration statement related to consulting services during fiscal 2022.\nOn June 25, 2022, Frank Horkey and Michael Christiansen were each issued 250,000 class C warrants to purchase 250,000 shares of the Companys common stock for a period of three years at an exercise price of $1.50 commencing upon the effective date of the Companys registration statement for serving on the Companys Board of Directors for the upcoming 2022 fiscal year.\nOn June 25, 2022, Squadron Marketing LLC and Lazarus Asset Management LLC were each issued a class C warrant to purchase 250,000 shares of the Companys common stock for a period of three years at an exercise price of $1.50 commencing upon the effective date of the Companys registration statement for serving on the Companys Advisory Board for the upcoming 2022 fiscal year.\nCertain of the shares and warrants noted above were issued to Board Members, Advisory Board Members and, Consultants for services to be rendered for periods subsequent to June 30, 2022. The amounts related to shares and warrants are treated as prepaid consulting, both current and non-current in these financial statements. These amounts will be recognized in subsequent periods as they are earned according to the Agreements.\nThe following is the outstanding warrant activity:\nWarrants - Common Share Equivalents\nWeighted Average Exercise price\nWarrants exercisable - Common Share Equivalents\nWeighted Average Exercise price\nOutstanding June 30, 2020\n187,500\n$ 0.75\n187,500\n$ 0.75\nAdditions\nGranted\n-\n-\n-\n-\nExpired\nExpired\n-\n$ -\n-\n-\nExercised\n-\n-\n-\n-\nOutstanding June 30, 2021\n187,500\n$ 0.75\n187,500\n$ 0.75\nAdditions\nGranted\n3,497,833\n1.50\n1,247,833\n1.50\nExpired\nExpired\n-\n$ -\n-\n-\nExercised\n-\n-\n-\n-\nOutstanding June 30, 2022\n3,685,333\n$ 1.47\n1,435,333\n$ 1.47\nThese warrants were valued using a Black Scholes calculation using a stock price of $1,00, and exercise price of $1.50 a voltility range of 30% to 40% and a risk-free interest rate of 1%.\nAs of June 30, 2022, none of the warrants were exercisable because the Company had yet to file a Registration Statement including these warrants. The Registration Statement was filed subsequent to year end and was declared on October 9, 2022.\nNOTE 7 - SUBSEQUENT EVENTS\nThe Company has evaluated all events that occurred after the balance sheet date through the date when the financial statements were issued to determine if they must be reported. The Management of the Company determined that the following subsequent events needed to be disclosed.\nName Change\nOn August 5, 2022, the Company changed its name to T-REX Acquisition Corp.\nPrivate Sales of Unregistered Securities\nOn July 22, 2022, we entered into a Securities Purchase Agreement with one private investor who is not a Selling Stockholder (defined above) to whom we sold $100,000 in aggregate principal amount for 133,333 shares of our common stock and warrants to purchase 133,333 shares of our common stock, with an exercise price of $1.50 per share and exercisable at any time before the close of business on December 31, 2025. On August 8, 2022, the same private investor has committed to purchasing another $100,000 in aggregate principal amount for an additional 133,333 shares of our common stock and warrants to purchase 133,333 shares of our common stock, with an exercise price of $1.50 per share and exercisable at any time before the close of business on December 31, 2025. We closed the transactions contemplated by the Securities Purchase Agreement. We issued the securities contemplated under the Securities Purchase Agreement in reliance upon the exemption from registration pursuant to Section 4(a)(2) of the Securities Act.\nCompanys Registration Statement on Form S-1, as amended\nAt 4pm eastern time on September 8, 2022, the Companys registration statement on Form S-1, as amended, concerning the registration of 6,505,267 shares of its common stock, had been declared effective by the Securities and Exchange Commission. The registration statement relates to the possible resale, from time to time, by the selling stockholders of up to an aggregate of 6,530,267 shares of the Companys common stock, par value $0.001 per share (the Shares), including (i) an aggregate of 747,837 shares acquired by those selling stockholders who purchased the Companys common stock and warrants pursuant to a Securities Purchase Agreement (the PIPE Investors), (ii) an aggregate of 747,837 shares issuable upon the exercise in full of warrants (the PIPE Warrant Shares), (iii) an aggregate of 2,437,500 shares of the Companys common stock issuable upon the exercise of warrants held by the remaining Selling Stockholders (the Non-PIPE Warrant Shares) (assuming the Warrants are exercised in full without regard to any exercise limitations therein), and (iii) 2,597,093 shares of common stock, including common stock owned by the Companys long term investors and beneficially owned by certain directors and current executive officers of the Company.\nThe Shares will be offered and sold by the selling stockholders at a fixed price of $1.50 per share until our common stock is quoted on OTC Market Group, Inc.s OTCQB or OTCQX tiers, and thereafter the Shares may be sold at prevailing market prices or privately negotiated prices or in transactions that are not in the public market. Although we intend to pursue an application for listing on the OTCQB tier, we cannot assure you that our common stock will, in fact, be quoted on the OTCQB tier. The Company will not receive any proceeds from the sale of the Shares by the selling stockholders, although the Company will receive the proceeds from any cash exercise of the Warrants.\nSignificant purchase of assets\nThe Company purchased approximately $90,000 of mining equipment from Simple Mining, LLC in September 2022. ITEM 9. CHANGES AND DISAGREEMENT WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nAs of the date of this filing, there are no disagreements between us and our accountants on any matter of accounting principles, practices, or financial statement disclosure. ITEM 9A. CONTROLS AND PROCEDURES\nEVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES\nWe maintain controls and procedures that are designed to ensure that information required to be disclosed in the reports that we file or submit under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms, and that such information is accumulated and communicated to our management including our principal executive and principal financial officers, as appropriate, to allow timely decisions regarding required disclosures. Based upon their evaluation of those controls and procedures performed as of the end of the periods covered by this report, our principal executive officer and our principal financial officer concluded that our disclosure controls and procedures were not effective.\nMANAGEMENTS ANNUAL REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur Chief Executive Officer/Chief Financial Officer is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) and 15d-15(f) promulgated under the Securities Exchange Act of 1934 as a process designed by, or under the supervision of, our principal executive and principal financial officers and effected by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\n·\nPertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets;\n·\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of management and our directors; and\n·\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, our internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur Chief Executive Officer/Chief Financial Officer assessed the effectiveness of our internal control over financial reporting as of June 30, 2022. In making this assessment, management used the criteria set forth by the 1992 Committee of Sponsoring Organizations of the Treadway Commission (2013 COSO) in Internal Control - Integrated Framework.\nBased on our assessment, our Chief Executive Officer/Chief Financial Officer believe that, as of June 30, 2022, our internal control over financial reporting is not effective based on those criteria, due to the following:\n·\nDeficiencies in Segregation of Duties. Lack of proper segregation of functions, duties, and responsibilities with respect to our cash and control over the disbursements related thereto due to our very limited staff, including our accounting personnel. Deficiencies in the staffing of our financial accounting department. The number of qualified accounting personnel with experience in public company SEC reporting and GAAP is limited. This weakness does not enable us to maintain adequate controls over our financial accounting and reporting processes regarding the accounting for non-routine and non-systematic transactions. There is a risk that a material misstatement of the financial statements could be caused, or at least not be detected in a timely manner, by this shortage of qualified resources.\nIn light of this conclusion and as part of the preparation of this report, we have applied compensating procedures and processes as necessary to ensure the reliability of our financial reporting. Accordingly, management believes, based on its knowledge, that (1) this report does not contain any untrue statement of a material fact or omit to state a material face necessary to make the statements made not misleading with respect to the periods covered by this report, and (2) the financial statements, and other financial information included in this report, fairly present in all material respects our financial condition, results of operations and cash flows for the years and periods then ended.\nThis report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to the rules of the SEC that permit us to provide only managements report in this report.\nCHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING\nThere were no significant changes in our internal control over financial reporting during the fourth quarter of the year ended June 30, 2022, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nEXECUTIVE OFFICERS AND DIRECTORS\nOur directors and principal executive officers are as specified on the following table:\nName\nAge\nPosition\nFrank Horkey\nPresident/Chief Executive Officer, Secretary and Chief Financial Officer Director\nFrank J. Horkey\nMr. Horkey has been our President/Secretary and Chief Financial Officer and a director since January 14, 2014. During the past forty years, Mr. Horkey has been engaged as an auditor and a certified public accountant. Mr. Horkey currently is the founder and manager of Horkey & Associates, which is a public accounting firm located in West Broward, Florida. In 1978, Mr. Horkey commenced his career with Touche Ross (which is now called Deloitte Touche), an international public accounting firm, in Miami, Florida. After three years, he started his own public accounting firm and through subsequent mergers was a partner through 1991 in one of the largest accounting firms in western Broward County. Mr. Horkey has taught courses on accounting, auditing and taxation issues, and has written a variety of articles on diverse tax topics, such as home office deductions, and accounting and auditing topics such as audits of small businesses. Mr. Horkeys clients have included large corporations, small businesses, professionals, not-for-profit organizations, municipalities, and other governmental entities. Mr. Horkey was the audit partner on one of the pilot single audits performed on a large governmental unit in 1981 and was involved in the development and application of the single audit process with the Office of Management and Budget and the General Accounting Office.\nMr. Horkey earned a Bachelor of Science in Accounting from Florida Atlantic University and has been certified by the State of Florida as a Certified Public Accountant since April 1979. He is a member of the American Institute of Certified Public Accountants as well as the Florida Institute of Certified Public Accountants. He also holds the designation as Certified in Florida Sales Tax, a specialty designation awarded jointly by the Florida Board of Accountancy and the Florida Institute of Certified Public Accountants.\nMr. Horkey is also a 1993 graduate of Leadership Broward and 1987 President of the Sunrise Chamber of Commerce. He has been a member of the Broward Workforce Development Board since 1993 and Chair of its Audit Committee and was Board Chair for 2015-2016 and again for 2021-2022. Mr. Horkey is the 1995 recipient of the Small Business Person of the Year award from the Sunrise Chamber of Commerce, and a two-time finalist for the South Florida Up and Comers Award in accounting. He was also Chair of the Sole Practitioners Committee of the Florida Institute of Certified Public Accountants for two years.\nMr. Horkeys community involvement also extends into the education environment. He was a member of the School Board of Broward County Audit Committee for ten years, Chair of the Sunrise Chamber of Commerce Education Committee for three years, and co-founder of the Sunrise Chamber One for the Kids Program (which matches businesspeople who have specific skills with schools and/or students with matching needs). He also worked on the Broward Education Planning Initiative, which was the first countywide effort to address school overcrowding. Mr. Horkey was Treasurer of Broward Education Foundation for four years including the period during which the Foundation administered the Marjory Stoneman Douglas Victims fund of over $10,700,000. He is currently Board Chair of Broward Education Foundation.\nAll directors hold office until the completion of their term of office, which is not longer than one year, or until their successors have been elected. All officers are appointed annually by the board of directors and, subject to employment agreements (which did not exist prior to June 30, 2022), serve at the discretion of the board. On July 1, 2022, the Company established a framework for Board Service Agreements with stock compensation subject to a vesting schedule. In connection with their respective appointments and using the above noted Board Service Agreement model. we entered into agreements with Frank Horkey and Michael Christiansen pursuant to which, among other things, the Company issued in a private placement 250,000 restricted shares of the Companys common stock to each director, subject to a vesting schedule.\nThere is no family relationship between any of our officers or directors. For the past ten years, there have been no orders, judgments, or decrees of any governmental agency or administrator, or of any court of competent jurisdiction, revoking or suspending for cause any license, permit or other authority to engage in the securities business or in the sale of a particular security or temporarily or permanently restraining any of our officers or directors from engaging in or continuing any conduct, practice or employment in connection with the purchase or sale of securities, or convicting such person of any felony or misdemeanor involving a security, or any aspect of the securities business or of theft or of any felony.\nCORPORATE GOVERNANCE\nCommittees\nOur Board of Directors does not currently have a compensation committee or nominating and corporate governance committee because, due to the limited size of our Board (two) and our relatively limited operations, the Board believes it is able to effectively manage the issues normally considered by such committees. Our Board may undertake a review of the need for these committees in the future.\nAudit Committee and Financial Expert\nOur Board of Directors has not established an audit committee. The respective role of an audit committee has been conducted by our Board of Directors. Our President/CEO/CFO Director Frank Horkey is a certified public accountant with substantial audit experience. We intend to establish an audit committee as soon as it is practical to do so. When established, the audit committees primary function will be to provide advice with respect to our financial matters and to assist our Board of Directors in fulfilling its oversight responsibilities regarding finance, accounting, and legal compliance. The audit committees primary duties and responsibilities will be to: (i) serve as an independent and objective party to monitor our financial reporting process and internal control system; (ii) review and appraise the audit efforts of our independent accountants; (iii) evaluate our quarterly financial performance as well as its compliance with laws and regulations; (iv) oversee managements establishment and enforcement of financial policies and business practices; and (v) provide an open avenue of communication among the independent accountants, management and our Board of Directors.\nCode of Ethics\nWe do not currently have a Code of Ethics that applies to all employees, including our principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions. We plan to adopt a Code of Ethics.\nDirector Independence\nOur Chairman of the Board, Frank Horkey, is not deemed independent and Mr. Horkey also holds positions as an officer. As of the date of this Annual Report, Michael Christiansen serves on the Companys board of directors and Mr. Christiansen is deemed an independent member of the board of directors. ITEM 11. EXECUTIVE COMPENSATION\nSUMMARY COMPENSATION TABLE\nThe table set forth below summarizes the annual and long-term compensation for services in all capacities to us payable to our principal executive officers during the fiscal years ended June 30, 2022, and June 30, 2021.\nSummary Compensation Table\nName and Principal Position\nFiscal Years\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption Awards\n($)\nNon-Equity Incentive Plan Compensation\n($)\nNonqualified Deferred Compensation Earnings\n($)\nAll Other Compensation\n($)\nTotal\n($)\nFrank Horkey, Note 1)\n2015-2021\n$ 210,000\n$ 210,000\nPresident/Secretary/Treasurer/CFO\n$ 143,500\n$ 29,575\n$ 173,075\nNote 1) On January 1, 2015, the Company entered into a management agreement for a period of 5 years and will issue 350,000 shares of its common stock as consideration and is accounted for on the balance sheet as shares to be issued and will be expensed over the life of the contract (5 years), which resulted in a prepaid consulting expense of $210,000. They were valued on the date of the agreement and the stock price at that time was $.60. These shares were issued on September 9, 2020.\nNote 2) On January 1, 2020, the Company entered into a management agreement for a period of 3 years. We issued 350,000 shares of its common stock as consideration. The shares were valued at $.41 per share. In addition, Mr. Horkey was awarded a classs C warrant to purchase 250,000 shares of the Companys common stock at a price of $1.50 for a period of 3 years from the effective date of the Company registration statement. The shares and warrant were not issued until June 2022.\nOUTSTANDING EQUITY AWARDS\nWe do not have any effective stock option or other equity award plans. Therefore, as of June 30, 2022, the following named executive officers had the following unexercised options, stock that has not vested, and equity incentive plan awards:\nOption Awards\nStock Awards\nName\nNumber of Securities Underlying Unexercised Options\n# Exercisable\n# Un-exercisable\nEquity Incentive Plan Awards: Number of Securities Underlying Unexercised Options\nOption Exercise Price\nOption Expiration Date\nNumber of Shares or Units of Stock\nMarket Value of Shares or Units\nEquity Incentive Plan Awards: Number of Unearned Shares, Units or Other Rights\nValue of Unearned Shares, Units or Other Rights\nFrank Horkey\n350,000\n$ 143,500\n250,000\n$ 29,575\nPres/CEO Secretary CFO\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. We do not have any material bonus or profit-sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers.\nDIRECTOR COMPENSATION\nOur directors received the following compensation for their service as directors during the fiscal years ended June 30, 2022, and June 30, 2021:\nFees Earned or\nPaid in Cash\n$\nStock\nAwards\n$\nOption\nAwards\n$\nNon-Equity\nIncentive Plan Compensation\n$\nNon-Qualified Deferred Compensation Earnings\n$\nAll Other Compensation\n$\nTotal\n$\nFrank Horkey2020-2022\n143,500\n29,575 ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nOn September 9, 2020, Frank Horkey Pres/CEO, Secretary CFO, and sole director was issued 350,000 shares of the Companys common stock pursuant to that certain five-year Management Agreement, which commenced and was dated January 1, 2015, and expired December 30, 2019.\nThe following table sets forth certain information regarding the beneficial ownership of our common stock as of June 30, 2022, by each person or entity known by us to be the beneficial owner of more than 5% of the outstanding shares of common stock, each of our directors and named executive officers, and all of our directors and executive officers as a group.\nTitle of Class\nName and Address of Beneficial Owner\nAmount and Nature of Beneficial Owner\nPercent of\nClass (1)\nOfficers and Directors\nCommon Stock\nFrank Horkey\n7301 NW4th St Suite 102\nPlantation FL 33317\n900,000 shares\n4.8 %\nCommon Stock\nAll directors and named executive officers as a group (1 person)\n900,000 shares\n4.8 %\nBeneficial Owners 5% or Greater\nLazarus Asset Management LLC\n9540 NW 10th St.\nPlantation, FL 33322\n1,445,220 shares\n7.4 %\nSquadron Marketing LLC\n2070 s. Hibiscus Dr\nMiami, FL 33181\n1,445,220 shares\n7.4 %\n________\n(1)\nPercentage of beneficial ownership of our common stock is based on 19,573,952shares of common stock outstanding as of the date of this Annual Report, which total issued and outstanding were reduced in accordance with the Reverse Stock Split.\nChanges in Control\nOther than as described above, our management is not aware of any arrangements which may result in changes in control as that term is defined by the provisions of Item 403(c) of Regulation S-K. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nRelated party transactions.\nNone of the following parties has, since our date of incorporation, had any material interest, direct or indirect, in any transaction with us or in any presently proposed transaction that has or will materially affect us:\n1.\nAny of our directors or officers;\n2.\nAny person proposed as a nominee for election as a director; Any person who beneficially owns, directly or indirectly, shares carrying more than 10% of the voting\n3.\nrights attached to our outstanding shares of common stock;\n4.\nAny member of the immediate family of any of the foregoing persons.\nThere have been no other related party transactions, or any other transactions or relationships required to be disclosed pursuant to Item 404 of Regulation S-K.\nOn January 1, 2015, the Company entered into a management agreement with Frank Horkey for a period of 5 years and will issue 350,000 shares of its common stock as consideration and is accounted for on the balance sheet as shares to be issued and will be expensed over the life of the contract (5 years), which resulted in a prepaid consulting expense of $210,000. They were valued on the date of the agreement and the stock price at that time was $.60. These shares were issued on September 9, 2020. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nAudit Fees\nThe aggregate fees billed for the fiscal years ended June 30, 2022, and June 30, 2021, for professional services rendered by the principal accountant for the audit of our annual financial statements and quarterly review of the financial statements included in our Form 10-K or services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years were $20,000 and $10,000, respectively.\nOther Audit Fees\nFor the fiscal years ended June 30, 2022 and June 30, 2021, there were no fees billed for other audit fees.\nTax Fees\nFor the fiscal years ended June 30, 2022 and June 30, 2021, there were no fees billed for services for tax compliance, tax advice, and tax planning work by our principal accountants.\nAll Other Fees\nNone.\nPre-Approval Policies and Procedures\nPrior to engaging our accountants to perform a particular service, our Board of Directors obtains an estimate for the service to be performed. All of the services described above were approved by the Board of Directors in accordance with its procedures. ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a) Financial Statements.\nIncluded in Item 8\n(b) Exhibits required by Item 601.\nExhibit No.\nDescription\n3.1\nArticles of Incorporation incorporated by reference to Exhibit 3.1 of our Registration Statement on Form S-1 filed on July 25, 2008\n3.3\nBylaws, incorporated by reference to Exhibit 3.1 of our Registration Statement on Form S-1 filed on April 18, 2011\n31.1\nCertification of Principal Executive Officer Required By Rule 13a-14(A) of the Securities Exchange Act of 1934, As Amended, As Adopted Pursuant To Section 302 of the Sarbanes-Oxley Act of 2002*\n31.2\nCertification of Principal Financial Officer Required By Rule 13a-14(A) of the Securities Exchange Act of 1934, As Amended, As Adopted Pursuant To Section 302 of the Sarbanes-Oxley Act of 2002*\n32.1\nCertification of Principal Executive Officer, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002*\n32.2\nCertification of Principal Financial Officer, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002*\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)**\n101.SCH\nInline XBRL Taxonomy Schema**\n101.CAL\nInline XBRL Taxonomy Calculation Linkbase**\n101.DEF\nInline XBRL Taxonomy Definition Linkbase**\n101.LAB\nInline XBRL Taxonomy Label Linkbase**\n101.PRE\nInline XBRL Taxonomy Presentation Linkbase**\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n_____________\n* Filed herewith.\n** XBRL (Extensible Business Reporting Language) information is furnished and not filed or a part of a registration statement or prospectus for purposes of Sections 11 or 12 of the Securities Act of 1933, as amended, is deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, and otherwise is not subject to liability under these sections.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTREX Acquisition Corp.\na Nevada corporation\nOctober 17, 2022\nBy:\n/s/ Frank Horkey\nFrank Horkey\nIts:\nPresident, Director\n(Principal Executive Officer)\nOctober 17, 2022\nBy:\n/s/ Frank Horkey\nFrank Horkey\nIts:\nChief Financial Officer, Secretary, Treasurer, Director\n(Principal Financial and Accounting Officer)\nIn accordance with the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nOctober 17, 2022\nBy:\n/s/ Frank Horkey\nFrank Horkey\nIts:\nDirector"
}