{
    "cik": "1439237",
    "company": "Quality Online Education Group Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-11-22",
    "period_of_report": "2022-08-31",
    "sic": "8700",
    "state_of_inc": "DE",
    "state_location": "A6",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1439237/0001829126-22-019464-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1439237/000182912622019464/qualityonline_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1439237/0001829126-22-019464.txt",
    "filename": "1439237_10K_2022_0001829126-22-019464.htm",
    "content": "ITEM 1. BUSINESS\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS\nSome of the statements under Summary, Risk Factors, Managements Discussion and Analysis of Financial Condition and Results of Operations, Our Business and elsewhere in this Offering Circular constitute forward-looking statements. Forward-looking statements relate to expectations, beliefs, projections, future plans and strategies, anticipated events or trends and similar matters that are not historical facts. In some cases, you can identify forward-looking statements by terms such as anticipate, believe, could, estimate, expect, intend, may, plan, potential, should, will and would or the negatives of these terms or other comparable terminology.\nYou should not place undue reliance on forward looking statements. The cautionary statements set forth in this Offering Circular, including in Risk Factors and elsewhere, identify important factors which you should consider in evaluating our forward-looking statements. These factors include, among other things:\n● Our ability to effectively execute our business plan;\n● Our expectations regarding demand for and market acceptance of our brand and service;\n● Our ability to retain and increase our student enrollment;\n● Our ability to engage, train and retain new teachers;\n● Relevant government policies and regulations relating to our corporate structure, business, and industry; and\n● General economic and business conditions; and our future business development, results of operations, funding, and financial condition.\nAlthough the forward-looking statements in this Offering Circular are based on our beliefs, assumptions, and expectations, taking into account all information currently available to us, we cannot guarantee future transactions, results, performance, achievements, or outcomes. No assurance can be made to any investor by anyone that the expectations reflected in our forward-looking statements will be attained, or that deviations from them will not be material and adverse. We undertake no obligation, other than as may be required by law, to re-issue this Offering Circular or otherwise make public statements updating our forward-looking statements.\nTHE COMPANY\nOur Corporate History\nQuality Online Education Group Inc. (the Company) was incorporated on September 20, 2007 as Life Nutrition Products, Inc. and was previously a dietary supplement company specializing in the development marketing and distribution of all natural, proprietary, dietary supplements under the names Trim For Life® Appetite Control and Trim For Life® Energy Formula. Pursuant to a Certificate of Amendment to our Certificate of Incorporation filed with the State of Delaware and effective as of July 19, 2013, LNP changed its corporate name to ADGS Advisory, Inc.. On May 14, 2021, the Company changed its name to Quality Online Education Group Inc., and its symbol to QOEG.\nOn September 7, 2010, the Company entered into a Share Exchange Agreement (the Conqueror Share Exchange Agreement) with Conqueror Group Limited, a Hong Kong corporation (Conqueror) and Acumen Charm Ltd., a British Virgin Islands corporation (the Conqueror Shareholder). Pursuant to the Conqueror Share Exchange Agreement, at the closing of the transaction contemplated in the Conqueror Share Exchange Agreement (the Conqueror Transaction), the Company was to acquire 100% of the issued and outstanding capital stock of Conqueror from the Conqueror Shareholder, making Conqueror a wholly-owned subsidiary of the Company.\nThe Closing was to transpire on or before January 31, 2011 but it did not occur by that date. However, as of May 11, 2011, among other things, Michael M. Salerno, the Companys then sole officer and director, resigned as an officer and director of the Company, and appointed Chu Zhanjun and Li Gang as directors, and Chu Zhanjun as President, Chief Executive Officer and Principal Financial Officer of the Company, each a designee of Conqueror. As a result, a change in control occurred, due to the resignation of Mr. Salerno as sole officer and director, appointment of Mr. Chu as President, Chief Executive Officer and Principal Financial Officer of the Company, and appointment of Mr. Chu and Mr. Li as directors. At the time, the parties anticipated that the transaction contemplated by the Conqueror Share Exchange Agreement would not be completed at any time in future.\nOn December 7, 2012, LNP entered into the Original Exchange Agreement with ADGS and ADGS Holding. Pursuant to the Original Exchange Agreement, at the closing of the transaction contemplated thereunder (the Transaction), we agreed to acquire 100% of the issued and outstanding capital stock of ADGS, making ADGS a wholly-owned subsidiary of the Company. On March 28, 2013, we entered into an amendment (the Amendment) to the Original Exchange Agreement (the Original Exchange Agreement, as amended is referred to in this report as the Exchange Agreement) pursuant to which we agreed to acquire all of the outstanding shares of Almonds Kisses Limited (BVI), a British Virgin Islands company (Almonds Kisses BVI), from the eight shareholders of Almonds Kisses BVI (the Shareholders), instead of the shares of ADGS, on the same terms and conditions set forth in the Exchange Agreement. Almonds Kisses BVI is the owner of 100% of the issued and outstanding capital stock of ADGS. The Original Exchange Agreement incorrectly indicated that such owner was ADGS Holdings which error was corrected in the Amendment. The Shareholders are Tong Wing Yee, Tong Wing Shan, Tso Yin Yee, Pang Yiu Kwong, Sin Kok Ho, Fahy Roase-Collette, Tsang Kwai Chun and ADGS Holdings, each of whom executed the Amendment. In addition, on March 28, 2013, the parties to the Exchange Agreement entered into an Extension Agreement (the Extension Agreement) extending the closing date of the Transaction to on or before April 15, 2013.\nThus, upon consummation of the Acquisition which occurred on April 12, 2013, Almonds Kisses BVI became our wholly-owned subsidiary and the former shareholders of Almonds Kisses BVI became our controlling shareholders, and Almond Kisses BVI in turn owns all of the issued and outstanding capital stock of ADGS. In January 2013, Almonds Kisses BVI also became the owner of 100% of the issued and outstanding capital stock of Vantage, a Hong Kong corporation. Almond Kisses (BVI) in turn also owns all of the issued and outstanding capital stock of Vantage. ADGS owns 80% of ADGS Tax Advisory Limited (ADGS Tax) which is a Hong Kong incorporated holding company, and ADGS Tax owns a 30% interest in Dynamic Golden Limited which is also a Hong Kong incorporated company.\nAlmonds Kisses BVI was incorporated on March 1, 2011 as a limited liability company in the British Virgin Islands (BVI) and, as originally constituted, was owned by the eight Shareholders identified above. ADGS is a Hong Kong corporation which was incorporated on April 28, 2011 and, as originally constituted, was solely owned by Tong Wing Yee and Tong Wing Shan (two of the shareholders of Almonds Kisses BVI) until being acquired by Almonds Kisses BVI pursuant to a transaction completed on April 30, 2011 in contemplation of the Acquisition. In this regard and in anticipation of effecting a transaction which resulted in the Acquisition, on April 30, 2011 Tong Wing Yee and Tong Wing Shan exchanged their shares for additional shares in Almonds Kisses BVI in order to create a BVI holding company structure for the operating business. British Virgin Islands holding companies have been utilized in Hong Kong for many years by entrepreneurs undertaking business in Hong Kong. Management believes such structure may provide certain advantages in the future in that shares held in a Hong Kong corporation are subject to a fairly substantial stamp duty on the transfer of any of such shares while the transfer of shares in a BVI company is not subject to any stamp duty in the BVI. In addition, Management further believes the BVI holding company structure may provide other benefits in the future including more corporate flexibility in that mergers can be effected by a BVI company compared to Hong Kong where a Hong Kong company is not able to merge with any entity insofar that a merger is not provided for under the Hong Kong Companies Ordinance.\nOn July 19, 2013, Life Nutrition Products, Inc. changed its name to ADGS Advisory, Inc. The Company also changed its symbol from LIPN to ADGS on such date. ADGS Advisory, Inc. is a holding company.\nOn December 11, 2019, Rhonda Keaveney purchased 1,000,000 shares of Convertible Preferred Series A Stock from the Company, resulting in Ms. Keaveney gaining voting control of the Company\nOn January 30, 2020, Rhonda Keaveney sold the controlling voting shares to Golden Panegyric Inc., and a change of control took place.\nOn June 26, 2020, Golden Panegyric Inc. sold the controlling voting shares to Xuye Wu, and a change of control took place.\nOn August 31, 2020, pursuant to the Share Exchange Agreement, the Company acquired Quality Online Education Group Inc., an Ontario company, in exchange for 3 Billion (3,000,000,000) shares of common stock of the Company, and a change of control occurred.\nOn May 14, 2021, the Company changed its name to Quality Online Education Group Inc., and its symbol to QOEG.\nOn August 25, 2022, the Company was qualified for the Reg A.\nOur Office\nOur principal executive office is located at Unit 1, 60 Riviera Dr. Markham, ON L3R 5M1.\nOur Website\nwww.qualityonline.education\nOur Business Objectives\nOur principal business objective is to maximize shareholder returns through our online English programs for K12 and adults, white-label online tutoring services, and end-to-end management software solutions for education institutions. The companys primary business is in educational services delivered through online and mobile education platforms that enable students around the world to take live interactive English lessons with highly qualified English native speaking teachers.\nOur Mission\nOur Mission is to develop students self-confidence so they can reach their goals through an enjoyable yet efficient learning experience.\nOur Products\nWe have designed a holistic learning solution that enhances effective learning through the integration of live lessons, practice, and mentoring. Our academic materials for K12 students include pre-reading, picture books, videos, and songs. Through our custom-built mobile solutions, students and parents can set their goals and follow student progress in a one-stop service. Before taking lessons, students preview course materials using exercises and illustrations, supported by a pronunciation recognition and rating system. Our teaching assistants mentor students by coaching them on the proper learning methods and attending to their needs throughout the learning process. We have designed a holistic learning solution that enhances effective learning through the integration of live lessons, practice, assessment, and mentoring. Our live lessons allow for frequent interactions between students and teachers, which is a key factor in improving English communication skills. Assessments includes post-lesson quizzes, both of which help students better assess their learning outcome and identify areas for improvement.\nLive lessons\nOne on one online lessons with native English speaker teachers\nA majority of our students take live one-on-one lessons. Lessons are typically 25 minutes long. Teachers and students interact using real-time audio and visual streaming technology. Our teachers provide instructions using our standardized curriculum. Teachers are allowed to adjust the pace of each lesson according to student performance and reaction, thus accommodating students across all learning curves.\nIn order to give students a consistent and seamless learning experience, we arrange the same teacher for most of the classes for each student, and the teaching assistants regularly review the feedback from students, their parents, and the teachers.\nWe pack our lessons into 3 groups - 75 lessons valid for 9 months, 150 lessons valid for 18 months, and 300 lessons valid for 36 months. The unit lesson price is different regarding the package the students choose and the teachers teaching experience and background, ranging from USD $6.5 to $17.2.\nSmall class lessons with native English speaker teachers\nIn April 2021, we launched our small class program to give students more options that cater to their needs to learn with peers, with a fixed schedule, fixed classmates, and fixed teachers.\nStudents opting in for small class lessons will choose a class with a fixed teacher designated for the class and a fixed weekly schedule for a period of approximately three months. Students will take two lessons each week. Each lesson comprises two 25-minute sessions. Each small class is composed of up to four students. The small class lesson format encourages students to interact with the teachers and classmates and engage students in the in-class environment through learning with the same groups of classmates and teachers every time.\nWe offer the lesson in 3 groups - autumn term package, spring term package, and 1-year package. About 60 lessons for each term and 120 lessons for 1 year. The unit lesson price is USD $ 4.15.\nEffective Practice\nStudents are encouraged to preview course materials through our APP platform. Pre-lesson learning is particularly important, as such a process allows young students to engage in more productive interactions with teachers during live lessons.\nOur pre-lesson studying system contains key vocabulary, word pronunciation practice, and grammar learning points. Our system is interactive, featuring audio functions that allow students to hear the correct pronunciation of key vocabulary words and model sentences. Students can record their pronunciation of individual words to be graded by our system. To build a more instinctive understanding of the English language for our students, our pre-lesson studying system relies on cartoons or interesting graphic stories to explain the meaning of vocabulary and phrases, rather than simply presenting the translation.\nMentoring by local service team\nWe maintain a pool of service teams or teachers for our students all around the world. The customer service is provided by a third-party service partner. We are planning to hire local service teams as our customer base grow in France, Brazil, Thailand and Vietnam. We have established stringent selection criteria and will make hiring decisions based on education service experience.\nBusiness Partners\nWe also provide a one-stop educational service to our business partners, including recruiting native English speaker tutors, customizing teaching content, and training the tutors. We provide native English speaker tutor recruiting and training services to business customers. Given the interactive nature of our lessons and targeting students, we seek to engage teachers who have a strong command of the English language and good communication skills. Prospective candidates must go through a resume screening, phone interview screening, pre-service orientation, new teacher training, and demonstration to be qualified to deliver live lessons to our students. We also leverage the native English speaker tutor recruiting and training services to business customers.\nTeacher engagement\nOur teachers from the Philippines and North America have high English proficiency and experience in service industries or the education industry. The individual skill sets and backgrounds of prospective teachers, combined with our rigorous selection and training program, have enabled us to build a team of passionate and patient teachers who are highly qualified to assist students in meeting their learning objectives. The majority of our teachers are university graduates in the Philippine, including many from reputable universities, medical and nursing schools, as well as experienced teachers. For our American Academy program, we mainly engage teachers from North America with primary school and kindergarten teaching experience.\nWe attract applicants through various online social media platforms and career websites and regularly participate in job fairs in the Philippines.\nTeacher training and development\nThrough the ongoing online enhancement of teaching methods and teacher training centers in the Philippines, most of our teachers can develop the skills to communicate key learning points more effectively to our students. We believe that empowering our teachers with these skills is essential to improve the student experience and ensuring that our students receive a quality education. We also add requirements and customize the training content according to the demand or the business customers.\nThe newly engaged teachers are generally required to undergo standard training programs that focus on the curriculum from us or business customers, teaching skills in a live lesson setting, as well as the learning about the behavior and objectives of different types of students. After completing our new teacher training program, the candidates will be assessed by our team of experienced evaluators before they are allowed to offer lessons on our platform or start the service for our business customers.\nThe teachers are ranked according to student feedback and peer evaluation process. Teachers must accumulate the required amount of teaching hours, maintain high student ratings, and complete the training modules to get a promotion or salary increase. Our training program is updated and customized based on changes to our curriculum, the demand of business customers, and feedback from our quality assurance team and students.\nDescription of the Business\nQuality Online Education Group Inc. (QOEG) is an E-learning company that provides comprehensive online lessons to students in different parts of the world. We deliver quality education to students and noticeable results from our passionate teachers and teaching assistants. We combined Education and Entertainment (Edu-tainment) as part of our method. It is our mission to develop confidence in our students so they can reach their goals with happiness and efficiency! The main business scope of the Group includes K12 English Online education services, courseware development, an exam preparation course of International English Language Testing System (IELTS) for adults, and Education-technology platform development.\nMost of our management team is based in Ontario, Canada. Most of the full time tutors we hire are in the Philippines. Our main operation functions such as accounting, education content, R&D, IT, and marketing are based in Toronto. We have tutor resource management vendors in the Philippines. We have sales partners in Southeast Asia, Europe and South America. Historically, Tianjin Zhipin Education Technology Co., as a sales and service center for Chinese customers, collected the revenue from Chinese customers and Quality Online Education Group Inc. (Ontario) collected the revenue from the customers of other areas. The Company adjusted the organization structure in September 2021. All the revenues including those from China is collected by Quality Online Education Group Inc. (Ontario). From Dec 2021, we stopped acquiring new students from mainland China. The Company ceased offering tutoring services to students in mainland China in the end of April 2022.\nOur Strategy - Business Plan\nQuality Online Education Group, QOEGs operating company, was founded in August 2018 in Ontario Canada with a global reach. We provide comprehensive online English lessons to students around the world. English education resources are unbalanced between areas. The students in some of the Southeast Asia and European countries are extremely under-served. To address this unmet need, we have developed online and mobile education platforms, customized the content and optimized the marketing method to provide high quality yet affordable products that enable students around the world to take live English lessons with English native speaking teachers. We connect our students with highly qualified foreign teachers. The teachers have gone through our rigorous selection and training process before they deliver lessons to the students. We hire, train, and manage our tutors for North America and the Philippines.\nOur market consists of students from K12 to adults. The lessons we provide are focused on the interaction and application of English as well as test preparation such as IELTS.\nWhile remaining based in Canada, we have successfully launched a direct selling model around the world. This business model is cost-effective, enabling us to save significant sales and marketing dollars and build a stronger cash flow outlook compared to the competitors who only use online advertising.\nWe are also launching small group lessons, one teacher teaches 2-4 students online at the same time, which unit price is lower than other competitors, which may be affordable for more students in our target cities yet with a higher margin.\nWe intend to further develop our sales of our online products through making it available and recognized in more and more countries in need of English teaching resources. Moreover, we anticipate a greater margin of profit by increasing the student retention rate and launching new product lines, like group lessons.\nAll our cash is paid directly by our customers to our Canadian company. We pay service expenses and sales commissions to the service partners in different countries for the local customer service.\nCompetitive Conditions\nThe online English education services market in general is fragmented, rapidly evolving, and highly competitive. We also face competition from other online and mobile platforms or internet companies that plan to expand their business into English education.\nWe believe that the principal competitive factors in our markets include the following:\n● scope and quality of course offerings;\n● quality and performance of the teachers;\n● overall student experience and satisfaction;\n● ability to effectively market course offerings to target customer groups, and\n● cost-effectiveness of courses;\nWe believe that we are well-positioned to effectively compete in the selected cities market in which we operate on the basis of our innovative approach to acquire students, scalable and efficient business model, extensive and high-quality teacher network, high course quality, and experienced management team caring about all the stakeholders including students, parents of our students, business partners, as well as the tutors.\nHowever, some of our current or future competitors may have longer operating histories, greater brand recognition, or greater financial, technical, or marketing resources than we do. For a discussion of risks related to competition, see more discussion in Risk Factors.\nSales and Marketing\nTo customer business marketing and sales\nWe market our platform through a combination of online social media and offline channels, and we also generate sales leads through referrals, which we called The Mommy Influencer Sales.\nThe Mommy Influencers\nWe have historically generated a significant percentage of our sales leads through word-of-mouth referrals by our students and their parents in K-12 product lines. New enrollments through word-of-mouth referrals have benefited from the rapid growth in our student base, as well as our reputation, brand, and the proven learning results of our students. We integrated social network functionalities into our mobile app, such as sharing functions with WeChat, to encourage students to share their learning experiences with their friends. We believe the rapid growth of our K-12 student base, greater brand awareness, and the success of our K-12 students in achieving their English learning objectives lead to more word-of-mouth referrals and the purchase of larger course packages by our K-12 students initially.\nWe have a KOL (Key Opinion Leader) marketing ecosystem in online and offline communities, including online social media groups and offline training camps. the KOLs bring significant leads to our sales team. We pay influencers when their referrals end up buying the products. Its known in marketing circles as fission sales. To support this sales model, we developed a virtual campus system and recruit headmasters for the virtual campus. Each headmaster manages a group of mummy influencers who provide leads to our telemarketing team.\nOur telemarketing teams follow-up on sales leads by providing additional information and support and trying to convince prospective students to enroll in our free trial lessons. Our course consultants then follow up with prospective students who have taken our free trial lessons and promote course packages most suited to each students background, proficiency, and learning objectives.\nBranding\nWe are focused on promoting our brand and increasing the overall effectiveness of our sales and marketing efforts. In 2019, we engaged Chris Downs, a Canadian educator, author, teacher, celebrity, and popular guest star of a TV series and movies in China. We believe Chriss success in his career and image echoes with our company principle on delivering good quality education for all the students.\nTo business marketing and sales\nWe also provide online English tutor solutions to business customers by direct sales model. We help the business customers build up their own brand online English lessons or add native English speaker tutors. Many small-medium education centers and institutions around the globe are interested in expanding their product line to foreign teacher English lessons, for example, after school tutoring centers, kids picture book clubs, immigration agencies etc.\nWe provide holistic solutions to business customers including recruiting, training, and managing the tutors. Our dedicated corporate sales force regularly communicates with potential business clients in every city we enter.\nRegulation\nFrom Dec 2021, we stopped acquiring the students live in mainland China. In compliance with the New Regulation, the Opinions on Further Alleviating the Burden of Homework and After-School Tutoring for Students in Compulsory Education published in July 2021 by the General Office of the CPC Central Committee and the General Office of the State Council of the PRC, the Company ceased offering tutoring services to students in mainland China in the end of April 2022.\nAbout 550 students in mainland China were still active, which was about 1/3 of our monthly active students by end of Feb 2022. The lessons of those active students were delivered, and contracts were terminated by the end of April 2022. We havent had any operations in China since then.\nThe Administrative Measures on Internet Information Services, or the ICP Measures, promulgated by the PRC State Council and as last amended on January 8, 2011, sets forth more specific rules on the provision of internet information services. According to the ICP Measures, any company that engages in the provision of commercial internet information services must obtain a sub-category VATS License for Internet Information Services, or the ICP License, from the relevant government authorities before providing any commercial internet information services within the PRC. The Company does not have a proper ICP license after the termination of the only existing VIE contract with Tianjin Zhipin Education Technology Co., Ltd.\nOn July 24, 2021 Chinas official state media, including Xinhua News Agency and China Central Television, announced the Opinions on Further Alleviating the Burden of Homework and After-School Tutoring for Students in Compulsory Education (the Opinion), issued by the General Office of the CPC Central Committee and the General Office of the State Council. The Opinion contains high-level policy directives about requirements and restrictions related to online and offline after-school tutoring services, including, (i) foreign capital is prohibited from controlling or participating in Academic AST providers through merger and acquisitions, entrusted operations, joining franchise or using variable interest entities. (ii) banning foreign teachers located overseas from providing tutoring services in China.\nThis Opinion does affect the operation in China. The company made following restructurings and decisions.\nDue to PRC legal restrictions on foreign ownership and investment in the value-added telecommunications market, we operated our online platform through Tianjin Zhipin Education Technology Co., Ltd, our consolidated variable interest entity, or VIE, in the PRC. Tianjin Zhipin Education Technology Co., Ltd held our ICP license necessary to operate our online service in China. We relied on a series of contractual arrangements among Tianjin Zhipin Education Technology Co., Ltd and its shareholders to operate our online and mobile platforms in China. We did not have equity interests in Tianjin Zhipin Education Technology Co., Ltd. However, as a result of these contractual arrangements, we were the primary beneficiary of Tianjin Zhipin Education Technology Co., Ltd and treat it as our consolidated VIE under U.S. GAAP.\nWe terminated the VIE contract in September 2021 and entered a new service contract with Tianjin Zhipin Education Technology Co., Ltd as one of the suppliers on global online market research, education consulting and information technology consulting service. Our agreement with Tianjin Zhipin Education Technology Co. is attached hereto as an Exhibit. By the termination of the VIE contracts the company also does not have proper ICP license to deliver online education service to students in mainland China. Thus, we ceased the operations in China in the end of April 2022.\nThe Company is not planning to invest in Tianjin Zhipin Education Technology Co., Ltd. or any other companies in China. We no longer own any companies or invest in any companies in China as a foreign investor.\nThe Companys compliance with these measures will not have a material adverse impact on its existing business in the countries other than China. To make sure our customers are not from mainland China, we stopped the marketing and sales activities in mainland China, and the updated service agreement required the customers announce that they are not living in mainland China. Our updated service agreement is attached hereto as an Exhibit. ITEM 1A. RISK FACTORS\nRISK FACTORS\nGeneral Risks\nThe Company is a Smaller Reporting Company\nQOEG (as this is the name of the ticker symbol) is a smaller reporting company. Investing in our Common Stock involves a high degree of risk.\n● We may be unable to invest the proceeds of this offering on acceptable terms, or at all.\n● We are dependent on our key personnel for our success. The departure of any of our executive officers or key personnel could have a material adverse effect on our business.\n● Our growth depends on external sources of capital, which may not be available on favorable terms or at all.\n● Investors participating in this offering will incur immediate dilution.\nContingent or unknown liabilities could materially and adversely affect our business, financial condition, liquidity and results of operations.\nWe may in the future acquire online education companies, subject to liabilities and without any recourse, or with only limited recourse, with respect to unknown liabilities. As a result, if a claim were asserted against us based on ownership of any of these properties, we may have to pay substantial amounts to defend or settle the claim. If the magnitude of such unknown liabilities is high, individually or in the aggregate, our business, financial condition, liquidity and results of operations would be materially and adversely affected.\nIt is possible that investors may lose their entire investment.\nWe will be reliant on the proceeds of this offering to expand our operations. We may not be successful in implementing our business strategy or that we will be successful in achieving our objectives. Our prospects for success must be considered in the context of a thinly capitalized company in a highly competitive market. As a result, investors may lose their entire investment.\nRisks Related to Financing Our Business\nExpenses required to operate as a public company will reduce funds available to develop our business and could negatively affect our stock price and adversely affect our results of operations, cash flow and financial condition.\nOperating as a public company is more expensive than operating as a private company, including additional funds required to obtain outside assistance from legal, accounting, investor relations, or other professionals that could be more costly than planned. We may also be required to hire additional staff to comply with additional SEC and OTC Markets reporting requirements. We anticipate that these costs will be approximately $100,000 annually. Our failure to comply with reporting requirements and other provisions of securities laws could negatively affect our results of operations, cash flow and financial condition.\nOur growth depends on external sources of capital, which may not be available on favorable terms or at all. In addition, investors, banks, and other financial institutions may be reluctant to enter into any lending or financial transactions with us, because we intend to enter into the cultivation and production of sustainable agriculture. If any of the source of funding is unavailable to us, our growth may be limited, and our operating profit may be impaired.\nWe may not be in a position to take advantage of attractive investment opportunities for growth if we are unable, due to global or regional economic uncertainty, changes in the state or federal regulatory environment relating to the sustainable agriculture industry, our own operating or financial performance or otherwise, to access capital markets on a timely basis and on favorable terms or at all. Because we intend to grow our business, this limitation may require us to raise additional equity or incur debt at a time when it may be disadvantageous to do so.\nOur access to capital will depend upon a number of factors over which we have little or no control, including general market conditions and the markets perception of our current and potential future earnings. If general economic instability or downturn leads to an inability to obtain capital to finance, the operation could be negatively impacted. In addition, investors, banks, and other financial institutions may be reluctant to enter into financing transactions with us, because we intend to acquire properties for the use in the cultivation and production of sustainable agriculture. If this source of funding is unavailable to us, our growth may be limited.\nOur ability to raise funding is subject to all of the above factors and will also be affected by our future financial position, results of operations and cash flows. All of these events would have a material adverse effect on our business, financial condition, liquidity, and results of operations.\nAny future indebtedness reduces cash available for distribution and may expose us to the risk of default under debt obligations that we may incur in the future.\nPayments of principal and interest on borrowings that we may incur in the future may leave us with insufficient cash resources to operate the business. Our level of debt and the limitations imposed on us by debt agreements could have significant material and adverse consequences, including the following:\n● our cash flow may be insufficient to meet our required principal and interest payments;\n● we may be unable to borrow additional funds as needed or on favorable terms, or at all;\n● we may be unable to refinance our indebtedness at maturity or the refinancing terms may be less favorable than the terms of our original indebtedness;\n● to the extent we borrow debt that bears interest at variable rates, increases in interest rates could materially increase our interest expense;\n● we may default on our obligations or violate restrictive covenants; in which case the lenders may accelerate these debt obligations.\n● our default under any loan with cross default provisions could result in a default on other indebtedness.\nIf any one of these events were to occur, our financial condition, results of operations, cash flow, and our ability to make distributions to our shareholders could be materially and adversely affected.\nRisks Related to Our Organization, Structure and Business\nThe change of the business in recent months may be unsuccessful.\nIn December of 2021, we stopped acquiring students who live in mainland China. In compliance with the New Regulation, the Opinions on Further Alleviating the Burden of Homework and After-School Tutoring for Students in Compulsory Education published in July 2021 by the General Office of the CPC Central Committee and the General Office of the State Council of the PRC, the Company ceased offering tutoring services to students in mainland China in April 2022. We delivered all the services in active contract before the cessation. Our failure to now further increase our student enrollment could negatively affect our results of operations, cash flow and financial condition.\nWe are dependent on our key personnel for our success.\nWe will depend upon the efforts, experience, diligence, skill, and network of business contacts of our senior management team; therefore, our success will depend on their continued service. The departure of any of our executive officers or key personnel could have a material adverse effect on our business. If any of our key personnel were to cease their employment, our operating results could suffer. Further, we do not intend to maintain key person life insurance that would provide us with proceeds in the event of death or disability of any of our key personnel.\nWe believe our future success depends upon our senior management teams ability to hire and retain highly skilled managerial, operational, and marketing personnel. Competition for such personnel is intense, and we cannot assure you that we will be successful in attracting and retaining such skilled personnel. If we lose or are unable to obtain the services of key personnel, our ability to implement our investment strategies could be delayed or hindered, and the value of your investment may decline.\nFurthermore, we may retain independent contractors to provide various services for us, including administrative services, transfer agent services and professional services. Such contractors have no fiduciary duty to us and may not perform as expected or desired.\nWe have a limited operating history with our current business model, which makes it difficult to predict our future prospects and financial performance.\nWe have a short operating history with our current business model. Our business since inception has generated limited gross billings and revenues, and may not produce significant gross billings and revenues in the near term, or at all, which may harm our ability to obtain additional financing and may require us to reduce or discontinue our operations. If we do generate significant gross billings and revenues in the future, we expect it will be largely from the sale of our English course packages on our online and mobile education platforms. You must consider our business and prospects in light of the risks and difficulties we may encounter as an early-stage operating company in a new and rapidly evolving industry. We may not be able to successfully address these risks and difficulties, which could significantly harm our business, operating results, and financial condition.\nOur senior management team will manage our business subject to very broad management guidelines and generally will not seek board approval for each management decision.\nOur senior management team has discretion over the use of proceeds from this offering, and you will have no opportunity to evaluate the terms of transactions or other economic or financial data concerning our operations that are not described in this offering circular or other periodic filings with the SEC. Furthermore, currently a substantial portion of the net proceeds of this offering is not specifically committed to any specific projects or business. We will rely on the senior management teams ability to execute the business plan, subject to the oversight and approval of our board of directors. Accordingly, you should not purchase Common Stock of the Company unless you are willing to entrust all aspects of our day-to-day management to our senior management team.\nOur board of directors may change our operation objectives and strategies without shareholders consent.\nOur board of directors determines our major policies, including regarding financing, growth, debt capitalization, distributions, and other material events. Our board of directors may amend or revise these and other policies without a vote of the shareholders. Under our Articles of Incorporation and Bylaws, our shareholders generally have a right to vote only on the following matters:\n● change the name or other designation or the par value of the Common Stock;\n● increase or decrease the aggregate number of Common Stock that we have the authority to issue;\n● increase or decrease the aggregate number of Common Stock that we have the authority to issue; our being a party to a merger, consolidation, sale or other disposition of all or substantially all of our assets or statutory merger or acquisition.\n● All other matters are subject to the discretion of our board of directors.\nThe fact that we have generated operating losses in the past raises doubt about our ability to continue as a going concern.\nThe Company may generate operating losses before the expansion of our courses and students. We may have to cover any shortfall in operating capital from sales of equity and debt securities, but there can be no assurance that we will continue to be able to do so. The unpredictable economy in the United States and Canada and the volatile public or private equity markets may make it more difficult for us to raise capital as and when we need it, and it is difficult for us to assess the impact this might have on our operations or liquidity. If we cannot raise the funds that we require to continue our business operations, there is a substantial risk that our business will fail.\nWe may be unable to attract and retain qualified, experienced, highly skilled personnel, which could adversely affect the implementation of our business plan.\nOur success depends to a significant degree upon our ability to attract, retain and motivate skilled and qualified personnel. As we become a more mature company in the future, we may find recruiting and retention efforts more challenging. If we do not succeed in attracting, hiring and integrating excellent personnel, or retaining and motivating existing personnel, we may be unable to grow effectively. The loss of any key employee, including shareholders of our senior management team, and our inability to attract highly skilled personnel with sufficient experience in our industries could harm our business.\nIf we are not able to continue to attract students to purchase our course packages and to increase the spending of our students on our platform, our business and prospects will be materially and adversely affected.\nOur ability to continue to attract students to purchase our course packages and to increase their spending on our education platform, are critical to the continued success and growth of our business. This in turn will depend on several factors, including our ability to effectively market our platform to a broader base of prospective students, continue to develop, adapt, or enhance quality educational content and services to meet the evolving demands of our existing or prospective students and expand our geographic reach. We must also manage our growth while maintaining consistent and high teaching quality, and respond effectively to competitive pressures. If we are unable to continue to attract students to purchase our course packages and to increase the spending of our students on our platform, our gross billings and net revenues may decline, which may have a material adverse effect on our business, financial condition and results of operations.\nIf we are unable to conduct sales and marketing activities cost-effectively, our results of operations and financial condition may be materially and adversely affected.\nWe have incurred significant sales and marketing expenses. Our sales expenses include telemarketing sales and free trial lesson related expenses, and our marketing expenses include online and offline marketing and seminar expenses.\nOur sales activities may not be well received by students and may not result in the levels of sales that we anticipate, and our trial lessons may not be attractive to our prospective students. Furthermore, we may not be able to achieve the operational efficiency necessary to increase the gross billings per sales and marketing staff. We also may not be able to retain or recruit experienced sales staff, or to efficiently train junior sales staff. Further, marketing and branding approaches and tools in the online education market are evolving, especially for mobile platforms. This further requires us to enhance our marketing and branding approaches and experiment with new methods to keep pace with industry developments and student preferences. Failure to refine our existing marketing and branding approaches or to introduce new marketing and branding approaches in a cost-effective manner may reduce our market share, cause our revenues to decline and negatively impact our profitability.\nIf we are not able to continue to engage, train and retain qualified teachers, we may not be able to maintain consistent teaching quality on our platform, and our business, financial conditions and operating results may be materially and adversely affected.\nOur teachers are critical to the learning experience of our students and our reputation. We seek to engage highly qualified teachers with strong English and teaching skills. We must provide competitive pay and other benefits, such as nice company culture and clear career path to attract and retain them. We must also provide ongoing training to our teachers to ensure that they stay abreast of changes in course materials, student demands and other changes and trends necessary to teach effectively. Furthermore, as we continue to develop new course contents and lesson formats, we may need to engage additional teachers with appropriate skill sets or backgrounds to deliver instructions effectively. We cannot guarantee that we will be able to effectively engage and train such teachers quickly, or at all. Further, given other potential more attractive opportunities for our quality teachers, over time some of them may choose to leave our platform. We have not experienced major difficulties in engaging, training or retaining qualified teachers in the past, however, we may not always be able to engage, train and retain enough qualified teachers to keep pace with our growth while maintaining consistent education quality. We may also face significant competition in engaging qualified teachers from our competitors or from other opportunities that are perceived as more desirable. A shortage of qualified teachers, a decrease in the quality of our teachers performance, whether actual or perceived, or a significant increase in the cost to engage or retain qualified teachers would have a material adverse effect on our business and financial conditions and results of operations.\nThe Chinese government could attempt to farther extend its reach to include our Company.\nIf the Chinese government attempts to further extend its reach of authority. If it does so to the degree that it covers the Company because of our past operations in China, it could materially harm the value of our common stock or could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and cause the value of such securities to significantly decline or be worthless.\nIf we fail to successfully execute our growth strategies, our business and prospects may be materially and adversely affected.\nOur growth strategies include grow our student base and increase student enrollments, increasing our market penetration amongst K-12 students, expanding our course offerings, enhancing our teaching methods, improving the learning experience of our students, and advancing our technology. We may not succeed in executing these growth strategies due to a number of factors, including the following:\n● we may not be able to replicate the success and growth of our business model from existing cities to other cities\n● we may fail to further promote our platforms;\n● we may not be successful in effectively delivering and promoting our small class lessons\n● we may fail to effectively promote our solutions to business customers\n● we may not be able to engage, train and retain a sufficient number of qualified teachers and other key personnel;\n● we may not be able to continue to improve our personalized learning experience of our students and to enhance our existing courses or develop new courses, especially for young students, that meet the changing demands for English learners;\n● we may fail to maintain the technology necessary to deliver a smooth learning experience to our students; and\n● we may not be able to identify suitable targets for acquisitions and partnership.\nIf we fail to successfully execute our growth strategies, we may not be able to maintain our growth rate and our business and prospects may be materially and adversely affected as a result.\nIf we fail to develop and introduce new courses that meet our existing and prospective students expectations, or adopt new technologies important to our business, our competitive position and ability to generate revenues may be materially and adversely affected.\nHistorically, our core business centered on one-on-one English courses. We have since expanded our course offerings to small class lessons, and test preparation targeting a wide range of student demographics. We intend to continue developing new courses. The timing of the introduction of new courses is subject to risks and uncertainties. Unexpected technical, operational, or other problems could delay or prevent the introduction of one or more new courses. Moreover, we cannot assure you that any of these courses or programs will match the quality or popularity of those developed by our competitors, achieve widespread market acceptance or contribute the desired level of income.\nTechnology standards in internet and value-added telecommunications services and products in general, and in online education in particular, may change over time. If we fail to anticipate and adapt to technological changes, our market share and our business development could suffer, which in turn could have a material and adverse effect on our financial condition and results of operations. If we are unsuccessful in addressing any of the risks related to new courses, our reputation and business may be materially and adversely affected.\nWe use the streaming technology and infrastructure of a third-party to deliver all the lessons to our students and to conduct teacher training. Any interruption to or discontinuation of our cooperative relationship with this company may severely and negatively impact our ability to deliver our course content to students.\nWe use the technology of EEO EDUCATION TECHNOLOGY CO. LTD. (EEO), to deliver audio and video data, and their technology is important to our ongoing ability to operate our online and mobile education platforms. Loss of their services could keep us from operating.\nSome students may decide not to continue taking our courses for a number of reasons, including a perceived lack of improvement in their English proficiency or general dissatisfaction with our programs, which may adversely affect our business, financial condition, results of operations and reputation.\nThe success of our business depends in large part on our ability to retain our students by delivering a satisfactory learning experience and improving their English proficiency. If students feel that we are not providing them the experience they are seeking, they may choose not to renew their existing packages. For example, our education programs may fail to significantly improve a students English proficiency. There are no standard assessments or tests to measure the effectiveness of our lessons or teaching methods, and our ability to improve the English proficiency of our students is largely dependent upon the interests, efforts and time commitment of each student. For K-12 students, parent satisfaction with our programs is also a key factor. Their satisfaction may decline for a number of reasons, many of which may not reflect the effectiveness of our lessons and teaching methods. A students learning experience may also suffer if his or her relationship with our teachers and teaching assistants does not meet expectations. We have observed an increase in forfeiture rate historically, which may negatively impact the perceived effectiveness of our curriculum and the level of student engagement on our platform. If a significant number of students fail to significantly improve their English proficiency after taking our lessons or if their learning experiences with us are unsatisfactory, they may not purchase additional lessons from us or refer other students to us and our business, financial condition, results of operations and reputation would be adversely affected.\nWe may encounter disputes from time to time relating to our use of intellectual property of third parties.\nWe cannot be certain that third parties will not claim that our business infringes upon or otherwise violates patents, copyrights or other intellectual property rights that they hold. We cannot assure you that third parties will not claim that our courses and marketing materials, online courses, products, and platform or other intellectual property developed or used by us infringe upon valid copyrights or other intellectual property rights that they hold. We may be subject to claims by educational institutions and organizations, content providers and publishers, competitors and others on the grounds of intellectual property rights infringement, defamation, negligence or other legal theories based on the content of the materials that we or our teachers distribute or use in our business operation. These types of claims have been brought, sometimes successfully, against print publications and educational institutions in the past. We may encounter disputes from time to time over rights and obligations concerning intellectual property, and we may not prevail in those disputes.\nAny claims against us, with or without merit, could be time consuming and costly to defend or litigate, divert our managements attention and resources, or result in the loss of goodwill associated with our brand. If a lawsuit against us is successful, we may be required to pay substantial damages and/or enter into royalty or license agreements that may not be based upon commercially reasonable terms, or we may be unable to enter into such agreements at all. We may also lose, or be limited in, the rights to offer some of our programs, parts of our platform and products or be required to make changes to our course materials or websites. As a result, the scope of our course materials could be reduced, which could adversely affect the effectiveness of our curriculum, limit our ability to attract new students, harm our reputation and have a material adverse effect on our results of operations and financial position.\nFailure to protect confidential information of our teachers and students against security breaches could damage our reputation and brand and substantially harm our business and results of operations.\nA significant challenge to the online education industry is the secure storage of confidential information and its secure transmission over public networks. Other than purchases made by our corporate partners, all purchases of our course packages are made through our website and our mobile apps. In addition, online payments for our course packages are settled through third-party online payment services. Maintaining complete security for the storage and transmission of confidential information on our technology platform, such as student names, personal information and billing addresses, is essential to maintaining student confidence.\nWe have adopted security policies and measures to protect our proprietary data and student information. However, advances in technology, the expertise of hackers, new discoveries in the field of cryptography or other events or developments could result in a compromise or breach of the technology that we use to protect confidential information. We may not be able to prevent third parties, especially hackers or other individuals or entities engaging in similar activities, from illegally obtaining such confidential or private information we hold as a result of our students visits to our website and use of our mobile apps. Such individuals or entities obtaining our students confidential or private information may further engage in various other illegal activities using such information. Any negative publicity on our websites or mobile apps safety or privacy protection mechanisms and policies, and any claims asserted against us or fines imposed upon us as a result of actual or perceived failures, could have a material and adverse effect on our public image, reputation, financial condition and results of operations.\nPractices regarding the collection, use, storage, transmission and security of personal information by companies operating over the internet and mobile platforms have recently come under increased public scrutiny. Increased regulation by the PRC government of data privacy on the internet is likely and we may become subject to new laws and regulations applying to the solicitation, collection, processing or use of personal or consumer information that could affect how we store and process the data of our teachers and students. We generally comply with industry standards and are subject to the terms of our own privacy policies. Compliance with any additional laws could be expensive, and may place restrictions on the conduct of our business and the manner in which we interact with our students. Any failure to comply with applicable regulations could also result in regulatory enforcement actions against us.\nSignificant capital and other resources may be required to protect against information security breaches or to alleviate problems caused by such breaches or to comply with our privacy policies or privacy-related legal obligations. The resources required may increase over time as the methods used by hackers and others engaged in online criminal activities are increasingly sophisticated and constantly evolving. Any failure or perceived failure by us to prevent information security breaches or to comply with privacy policies or privacy-related legal obligations, or any compromise of security that results in the unauthorized release or transfer of personally identifiable information or other student data, could cause our students to lose trust in us and could expose us to legal claims. Any perception by the public that online transactions or the privacy of user information are becoming increasingly unsafe or vulnerable to attacks could inhibit the growth of online education services generally, which may negatively impact our business prospects.\nOur employees may engage in misconduct or other improper activities or misuse our platform, which could harm our reputation.\nWe are exposed to the risk of employee fraud or other misconduct. Employee misconduct could include intentionally failing to comply government regulations, engaging in unauthorized activities and misrepresentation to our potential students during marketing activities, which could harm our reputation. Employee misconduct could also involve improper use of our students and teachers sensitive or classified information, which could result in regulatory sanctions against us and serious harm to our reputation. Employee misconduct could also involve making payments to government officials or third parties that would expose us to being in violation of laws. It is not always possible to deter employee misconduct, and the precautions we take to prevent and detect this activity may not be effective in controlling unknown or unmanaged risks or losses, which could harm our business, financial condition and results of operations.\nWe are subject to certain regional political and economic risks that may have a material adverse effect on our results of operations.\nWe engage teachers and operate offices mostly in North America, with some in the Philippines. Accordingly, our business, results of operations and financial condition may be materially and adversely affected by significant political, social and economic developments in North America and the Philippines or changes in the laws and regulations. In particular, our operations and our operating results may be adversely affected by:\n● changes in policies of the government or changes in laws and regulations, or in the interpretation or enforcement of these laws and regulations;\n● measures that may be introduced to control inflation, such as interest rate increases or bank account withdrawal controls; and\n● changes in the tax laws and regulations.\nIn addition, the Philippines has and may in the future experience political instability, including strikes, demonstrations, protests, marches, or other types of civil disorder. These instabilities and any adverse changes in the political environment in the Philippines could increase our costs, increase our exposure to legal and business risks, disrupt our office operations in the Philippines or affect our ability to engage teachers. We engage our teachers in the Philippines as independent contractors, whose rights are different from those of employees. Under Philippine labor laws, the level and extent of control exercised by the hiring entity would determine the employment status. Our labor costs will increase if we engage our teachers in the Philippines as full-time employees or if courts or relevant authorities in the Philippines determine that our teachers are deemed employees.\nRisks Related to Our Stockholders and Purchasing Shares of Common Stock\nYour percentage of ownership may become diluted if we issue new Common Stock or other securities, including shares that are eligible for exchange.\nOur board of directors is authorized, without your approval, to cause us to issue additional Common Stock to raise capital through the issuance of Common Stock (including equity or debt securities convertible into Common Stock), and other rights, on terms and for consideration as our board of directors in its sole discretion may determine. Any such issuance could result in dilution of the equity of our shareholders. We also have 1,207,885,627 as of August 31, 2022 shares that are still exchangeable from Quality Online Education Group Inc, an Ontario company, and our subsidiary, which could cause us to issue 1,207,885,627 new shares of QOEG common stock, which would further dilute our current shareholders and any investors in this Offering\nWe have not voluntarily implemented various corporate governance measures.\nFederal legislation, including the Sarbanes-Oxley Act of 2002, has resulted in the adoption of various corporate governance measures designed to promote the integrity of the corporate management and the securities markets. Some of these measures have been adopted in response to legal requirements. Others have been adopted by companies in response to the requirements of national securities exchanges, such as the NYSE or The NASDAQ Stock Market, on which their securities are listed. Among the corporate governance measures that are required under the rules of national securities exchanges are those that address board of directors independence, audit committee oversight and the adoption of a Code of Ethics. Our Board of Directors expects to adopt a Code of Ethics at its next Board meeting. The Company has not adopted exchange-mandated corporate governance measures and, since our securities are not listed on a national securities exchange, we are not required to do so. It is possible that if we were to adopt some or all of these corporate governance measures, stockholders would benefit from somewhat greater assurances that internal corporate decisions were being made by disinterested directors and that policies had been implemented to define responsible conduct. For example, in the absence of audit, nominating and compensation committees comprised of at least a majority of independent directors, decisions concerning matters such as compensation packages to our senior officers and recommendations for director nominees may be made by a majority of directors who have an interest in the outcome of the matters being decided. Prospective investors should bear in mind our current lack of corporate governance measures in formulating their investment decisions.\nWe may be exposed to potential risks relating to our internal control over financial reporting.\nAs directed by Section 404 of the Sarbanes-Oxley Act of 2002 (SOX 404), the SEC has adopted rules requiring public companies to include a report of management on the Companys internal control over financial reporting in its annual reports. While we expect to expend significant resources in developing the necessary documentation and testing procedures required by SOX 404, there is a risk that we will not comply with all of the requirements imposed thereby. At present, there is no precedent available with which to measure compliance adequately. In the event we identify significant deficiencies or material weaknesses in our internal control over financial reporting that we cannot remediate in a timely manner, investors and others may lose confidence in the reliability of our financial statements and our ability to obtain equity or debt financing could suffer.\nWe have many authorized but unissued shares of our common stock.\nWe have a large number of authorized but unissued shares of common stock, which our management may issue without further stockholder approval, thereby causing dilution of your holdings of our common stock. Our management will continue to have broad discretion to issue shares of our common stock in a range of transactions, including capital-raising transactions, mergers, acquisitions, and other transactions, without obtaining stockholder approval, unless stockholder approval is required. If our management determines to issue shares of our common stock from the large pool of authorized but unissued shares for any purpose in the future, your ownership position would be diluted without your further ability to vote on that transaction.\nShares of our common stock may continue to be subject to illiquidity because our shares may continue to be thinly traded and may never become eligible for trading on a national securities exchange.\nWhile we may at some point be able to meet the requirements necessary for our common stock to be listed on a national securities exchange, we cannot assure you that we will ever achieve a listing of our common stock on a national securities exchange. Our shares will only be eligible for quotation on the OTC Markets, which is not an exchange. Initial listing on a national securities exchange is subject to a variety of requirements, including minimum trading price and minimum public float requirements, and could also be affected by the general skepticism of such markets concerning companies that are the result of mergers with inactive, publicly-held companies. There are also continuing eligibility requirements for companies listed on public trading markets. If we are unable to satisfy the initial or continuing eligibility requirements of any such market, then our stock may not be listed or could be delisted. This could result in a lower trading price for our common stock and may limit your ability to sell your shares, any of which could result in you losing some or all of your investments.\nThe market valuation of our business may fluctuate due to factors beyond our control and the value of your investment may fluctuate correspondingly.\nThe market valuation of emerging growth companies, such as us, frequently fluctuate due to factors unrelated to the past or present operating performance of such companies. Our market valuation may fluctuate significantly in response to a number of factors, many of which are beyond our control, including:\ni. changes in securities analysts estimates of our financial performance, although there are currently no analysts covering our stock;\nii. fluctuations in stock market prices and volumes, particularly among securities of emerging growth companies;\niii. changes in market valuations of similar companies;\niv. announcements by us or our competitors of significant contracts, new technologies, acquisitions, commercial relationships, joint ventures or capital commitments;\nv. variations in our quarterly operating results;\nvi. fluctuations in related labor cost; and\nvii. additions or departures of key personnel.\nAs a result, the value of your investment in us may fluctuate.\nWe have never paid dividends on our common stock.\nWe have never paid cash dividends on our common stock and do not presently intend to pay any dividends in the foreseeable future. Investors should not look to dividends as a source of income.\nIn the interest of reinvesting initial profits back into our business, we do not intend to pay cash dividends in the foreseeable future. Consequently, any economic return will initially be derived, if at all, from appreciation in the fair market value of our stock, and not as a result of dividend payments. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone ITEM 2. PROPERTIES\nThe Companys headquarters are located Unit 1, 60 Riviera Dr. Markham, Ontario, Canada L3R 5M1. Our phone number is (905) 882-1585. Management believes that our current leased property will be sufficient for its current and immediately foreseeable administrative needs. ITEM 3. LEGAL PROCEEDINGS\nThere are no legal proceedings that have occurred within the past five years concerning the Company, our directors, or control persons which involved a criminal conviction, a criminal proceeding, an administrative or civil proceeding limiting ones participation in the securities or banking industries, or a finding of securities or commodities law violations. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPart II ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock is quoted on the OTC Pink Sheets under the symbol QOEG.\nHolders\nAs of the date of this report there were approximately 178 holders of record of Company common stock. This does not include an indeterminate number of persons who hold our Common Stock in brokerage accounts and otherwise in street name.\nStock Authorized\nThe Company is authorized to issue two classes of stock. It consists of Five Billion (5,000,000,000) shares of Common Stock, $0.0001 par value and Twenty Million (20,000,000) shares of preferred stock, $0.0001 par value (the Preferred Stock).\nStock Issued\nThe Company issued common shares to the following shareholders for their service provided during the fiscal year ended August 31,\nNumber\nIssuance Date\nShareholder Name\n# of Common Shares\nSeptember 3, 2021\nAleth Dimaano de Vela\n75,000\nSeptember 3, 2021\nWengang XU\n20,258,836\nSeptember 3, 2021\nChanJuan WANG\n9,600,613\nSeptember 3, 2021\nShuqing Liu\n10,509,752\nSeptember 3, 2021\nMingfang Jiang\n10,000,000\nSeptember 3, 2021\nTianjie LI\n10,000,000\nSeptember 3, 2021\nLin Zhao\n13,142,542\nFebruary 16,2\nHouxiong Su\n714,447\nFebruary 16,2\nQing Feng\n746,177\nFebruary 16,2\nYu Dong\n424,600\nFebruary 16,2\nShan Tian\n1,106,678\nFebruary 16,2\nQiying Zhou\n1,240,913\nFebruary 16,2\nJuanjuan Zhang\n37,500\nFebruary 16,2\nFang Yang\n267,823\nFebruary 16,2\nXue Liu\n419,765\nFebruary 16,2\nYan Yu\n290,030\nFebruary 16,2\nChanjuan Wang\n6,260,254\nFebruary 16,2\nWengang Xu\n5,596,549\nFebruary 16,2\nAixia Hu\n1,975,000\nFebruary 16,2\nRed Marketing Inc.\n296,521\nFebruary 16,2\nChow Chun Kit\n932,350\nFebruary 16,2\nDU XUAN\n1,500,000\nNumber 19: The control person for Red Marketing Inc. is Rebecca Liu.\nDividends\nWe have not previously declared or paid any dividends on our common stock and do not anticipate declaring any dividends in the foreseeable future. The payment of dividends on our common stock is within the discretion of our board of directors.\nOptions and Warrants\nWe do not have any outstanding options or warrants.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company has some arrangements for individual compensation with respect to its Common Stock. The issuance of any of our Common Stock or Preferred Stock is within the discretion of our Board of Directors, which has the power to issue any or all of our authorized but unissued shares without stockholder approval.\nTransfer Agent\nThe transfer agent for our Preferred and Common Stock is Olde Monmouth Stock Transfer Co., Inc. at 200 Memorial Parkway, Atlantic Highlands, NJ 07716. The transfer agents telephone number is (732) 872-2727.\nRecent Sales of Unregistered Securities\nNone\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nWe did not purchase any of our shares of common stock or other securities during the year ended August 31, 2022. ITEM 6. [RESERVED]\nNot required for smaller reporting companies. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following managements discussion and analysis (MD&A) should be read in conjunction with financial statements of Quality Online Education Group Inc. (ticker symbol: QOEG) for the years ended August 31, 2022 and 2021.\nSafe Harbor for Forward-Looking Statements\nCertain statements included in this MD&A constitute forward-looking statements, including those identified by the expressions anticipate, believe, plan, estimate, expect, intend, and similar expressions to the extent they relate to Quality Online Education Group Inc. (ticker symbol: QOEG) or its management. These forward-looking statements are not facts, promises, or guarantees; rather, they reflect current expectations regarding future results or events. These forward-looking statements are subject to risks and uncertainties that could cause actual results, activities, performance, or events to differ materially from current expectations. These include risks related to revenue growth, operating results, industry, products, and litigation, as well as the matters discussed in QOEGs MD&A under Risk Factors. Readers should not place undue reliance on any such forward-looking statements. QOEG disclaims any obligation to publicly update or to revise any such statements to reflect any change in the Companys expectations or in events, conditions, or circumstances on which any such statements may be based, or that may affect the likelihood that actual results will differ from those set forth in the forward-looking statements.\nThe following discussion of our financial condition and results of operations should be read in conjunction with our financial statements and the related notes included in this report.\nLiquidity, Capital Resources and Plan of Operations\nGoing Concern\nOur financial statements appearing elsewhere in this offering circular have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. The Companys ability to continue as a going concern is contingent upon its ability to raise additional capital as required. For the year ended August 31, 2022, the Company incurred net losses of ($3,790,411). Initially, we intend to finance our operations through equity financings.\nOur auditors have indicated that these conditions raise substantial doubt about the Companys ability to continue as a going concern. These financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts or amounts and classification of liabilities that might result from this uncertainty.\nThere are no external sources of liquidity.\nFinancings and Securities Offerings\nInvesting Activities.\nSince inception, our principal sources of operating funds have been proceeds from equity financing including the sale of our Common Stock to initial investors known to management and principal shareholders of the Company. We do not expect that our current cash on hand will fund our existing operations. We will need to raise additional capital in order execute our business plan and growth goals for at least the next twelve-month period thereafter. If the Company is unable to raise sufficient additional funds, it will have to execute a slower than planned growth path, reduce overhead and scale back its business plan until sufficient additional capital is raised to support further operational expansion and growth. There can be no assurance that such a plan will be successful.\nBusiness Strategy\nQuality Online Education Group has founded in Aug 2018 in Ontario Canada with a global reach. We provide comprehensive online English lessons to students around the world. English education resource is unbalanced between areas. To address this unmet need, we have developed online and mobile education platforms, customized the content and optimized the marketing method to provide high quality yet affordable products that enable students around the world to take live online English lessons with native English-speaking teachers. We connect our students with highly qualified teachers who have gone through our rigorous selection and training process before they deliver lessons. We hire, train, and manage our tutors from North America and the Philippines.\nOur market consists of students from K12 to adults. The lessons we provide are focused on the interaction and application of English.\nWe have successfully launched a direct selling model through Mommy Influencer in different part of Southeast Asia countries. This business model is cost-effective, saving us significant sales and marketing dollars and build a better cash flow outlook compared to the competitors who only use online advertisement. With the proper expansion of operations, coupled with the replication of our direct selling model to targeted areas around the world more than 200 cities around the globe, we expect to achieve magnitudes of exponential growth.\nCompanys Plan of Operation.\nWe are launching small group lessons, where one teacher simultaneously teaches 2-4 students online. The one-to-many model has a lower unit price than other competitors, and may be affordable for more students yet yield a higher margin.\nWe intend to further develop our sales platform by entering additional cities in Southeast Asia and other countries in need of English teaching resources. Also, we plan to develop and launch new product lines such as the test preparation training for IELTS and non-English types. Our current student base covers Japan, Thailand, France and Germany. We anticipate a more significant profit margin through increasing the student retention rate and launching new product lines, like group lessons.\nRevenue\nDuring the year ended 31st Aug, 2022, the Company billed our customers over $2.70 million and realized a revenue of $1.67 million compared to $481,561 for the year ended 2021. The gross margin for the year ended 31st Aug, 2022 was $961,424 or 57.3%, compared to $45,365 or 9.4% for the year ended 31st Aug, 2021. The increased average selling prices and reduced free demo and trial classes for customers primarily drove the increase in gross margin.\nThe low gross margin for both periods ended 2020 and 2021 was primarily due to:\n1) Provided free demo classes and trial classes to students for better market adoption;\n2) Intentionally lowered our pricing in the competitive market for customer attraction.\nWe terminated the only VIE contract in September 2021, and stopped acquiring students from mainland China in December 2021, and ceased offering tutoring services to students in mainland China by the end of April 2022. Our focus is on North America, Southeast Asia and Europe markets. We are ambitiously looking for more overseas business partners, and researched and developed our education platform better for customers. As a result, we do not anticipate that the cessation of services to students in China will negatively impact our revenues in the future.\nOperating expenses\nThe following is the breakdown of operating expenses for year ended of 8/31/22 and 8/31/21:\nFor year ended\n8/31/2022 For year ended\n8/31/2021\nOperating expenses:\nAdvertising & Marketing 67,414 59,739\nDepreciation 3,599 68,842\nCommission 412,664 82,729\nBusiness consulting 3,962,795 30,828\nGeneral & Administrative expenses 119,447 355,178\nLegal & Professional fees 93,408 134,633\nPayroll & Benefits 92,508 1,408,434\nTotal operating expenses 4,751,835 2,140,383\nOperating expenses were $4,751,835 for the year ended Aug 31, 2022 compared to $2,140,383 for the year ended Aug 31, 2021. The 122% increase in operating expenses during the year ended Aug 31, 2022 was primarily driven by business consulting expenses.\nAdvertising and Marketing\nAdvertising and marketing expenses are related to promoting the Company and service to our potential customers. For year ended Aug 31, 2022, the Company incurred an advertising and marketing expense of $67,414 compared to $59,739 for the same period of the prior year. The increase was mainly due to the more usage of services from social media channels and marketing companies.\nDepreciation\nDepreciation is related to computers, office furniture and equipment. For year ended Aug 31, 2022, the Company incurred a depreciation expense of $3,599, compared to $68,842 for the same period of the prior year. The decrease in depreciation expenses was due to the termination of a VIE with Tianjin Zhipin Education Technology Co., Ltd.\nCommission\nCommission expenses are related to sales made by our Mommy Influencers and sales teams. For year ended Aug 31, 2022, the Company incurred a commission expense of $412,664, compared to $82,729 for the same period of the prior year. The increase in commission expenses was mainly driven by recruiting more commission-based salespeople.\nBusiness Consulting\nBusiness consulting expenses are related to the professional services provided by contractors. For year ended Aug 31, 2022, the Company incurred a business consulting fee of $3,962,795 compared to $30,828 for the same period of the prior year. The significant increase was primarily due to the expenses related to the service contract with Tianjin Zhipin Education Technology Co., Ltd., which provided online education market research, business and information technology consulting services.\nGeneral and Administrative expenses\nGeneral and administrative expenses are related to rent, office expenses, utilities, and meals, and entertainment. For year ended Aug 31, 2022, the Company incurred General and Administrative expenses of $119,447, compared to $355,178 for the same period of the prior year. The decrease was primarily due to the termination of the VIE with Tianjin Zhipin Education Technology Co., Ltd.\nLegal and Professional fees\nLegal and professional fees are related to professional services provided by lawyers and accountants. For year ended Aug 31, 2022, the Company incurred a legal and professional expense of $93,408 as compared to $134,633 for the same period of the prior year. There increase in the prior year was due to the audit fees the Company paid to the previous years.\nPayroll& Benefits\nFor year ended Aug 31, 2022, payroll and benefits were $92,508, compared to $1,408,434 for the prior year. The significant decrease was primarily due to the termination of VIE contract with Tianjin Zhipin Education Technology Co., Ltd.\nContractual Obligations, Commitments and Contingencies\nAs of the date there are none.\nOff-Balance Sheet Arrangements\nWe did not have during the periods presented, and we do not currently have, any off-balance sheet arrangements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a smaller reporting company (as defined in Rule 12b-2 of the Exchange Act), we are not required to provide the information called for by Item 304 of Regulation S-K. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY\nQUALITY ONLINE EDUCATION GROUP INC.\nAUDITED CONSOLIDATED FINANCIAL STATEMENTS\nFOR\nTHE YEAR ENDED AUGUST 31, 2022\nQUALITY ONLINE EDUCATION GROUP INC.\nAUDITED CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED AUGUST 31, 2022\nPage\nAudited Consolidated Statement of Balance Sheet\nAudited Consolidated Statement of Income and Comprehensive Income\nAudited Consolidated Statements of Changes in Stockholders equity\nAudited Consolidated Statements of Cash Flows\nNotes to Audited Consolidated Financial Statements -\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Quality Online Education Group, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Quality Online Education Group, Inc. as of August 31, 2022 and 2021, the related statements of operations, stockholders equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Companys auditor since 2021\nLakewood, CO\nNovember XX, 2022\nQUALITY ONLINE EDUCATION GROUP INC.\nAUDITED CONSOLIDATED STATEMENT OF BALANCE SHEET\nAS OF AUG 31, 2022\nAUDITED AUDITED\n31-Aug-22 31-Aug-21\nUS$ US$\nCurrent Assets:\nCash 179,895 104,415\nAccount receivables 41,006 -\nOther receivables - 70,274\nPrepayments and other current assets - 43,003\nTotal current assets 220,901 217,692\nLong term prepaid expense - 31,948\nIntangible assets 759,266 1,003,535\nProperty, plant and equipment, net 3,593 16,717\nTotal Assets 983,760 1,269,892\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent Liabilities:\nAccounts Payable 182,096 12,315\nReceipt in advance 1,400,427 950,358\nThird party loan payable 20,194 48,969\nAssets acquisition payable 114,408 293,802\nDue to related party 140,764 130,645\nAccrued liabilities and other payable 16,460 162,181\nTaxes payable - 5,596\nTotal current liabilities 1,874,349 1,603,866\nLong-term loan\nLong-term accounts payable 91,526 95,111\nTotal liabilities 1,965,875 1,698,977\nTotal Equity:\nShare capital\nPreferred shares, $0.0001 par value Issued and outstanding shares - 1,000,000\nCommon shares, $0.0001 par value Issued and outstanding shares - 1,749,903,669 170,969 161,530\nExchangeable shares, $0.0001 par value Issued and outstanding shares - 1,207,885,627 120,789 117,485\nAdditional paid in capital 7,622,202 5,442,572\nRetained Earnings (8,888,264 ) (6,146,744 )\nAccumulated other comprehensive loss (7,911 ) (4,028 )\nTotal stockholders equity (982,115 ) (429,085 )\nTotal liabilities and stockholders equity 983,760 1,269,892\nThe accompany notes are an integral part of these consolidated financial statements\nQUALITY ONLINE EDUCATION GROUP INC.\nAUDITED CONSOLIDATED STATEMENT OF INCOME AND COMPREHENSIVE INCOME\nFOR THE YEAR ENDED AUG 31, 2022\nAUDITED AUDITED\n31-Aug-22 31-Aug-21\nUS$ US$\nRevenues 1,677,912 481,561\nTotal Revenues 1,677,912 481,561\nCost of Revenue 716,488 436,196\nTotal Cost of Revenues 716,488 436,196\nGross Profit (Loss) 961,424 45,365\nOperating expenses:\nAdvertising & Marketing 67,414 59,739\nDepreciation 3,599 68,842\nCommission 412,664 82,729\nBusiness consulting 3,962,795 30,828\nLegal & Professional fees 93,408 134,633\nGeneral & Administrative expenses 119,447 355,178\nPayroll & Benefits 92,508 1,408,434\nTotal operating expenses 4,751,835 2,140,383\nIncome from Operations (3,790,411 ) (2,095,018 )\nOther income:\nOther expenses - -\nOther income, net - 1,353\nTotal other income - 1,353\nIncome before income taxes (3,790,411 ) (2,093,665 )\nProvision for income taxes - -\nNet Income (loss) (3,790,411 ) (2,093,665 )\nForeign currency translation adjustment - -\nComprehensive income (3,790,411 ) (2,093,665 )\nEarning/(loss) per share - Basic 0.00 0.00\nEarning/(loss) per share - Diluted 0.00 0.00\nThe accompany notes are an integral part of these consolidated financial statements\nQUALITY ONLINE EDUCATION GROUP INC.\nAUDITED CONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nFOR THE YEAR ENDED AUG 31, 2022\nPreferred Stock Exchangeable Shares Common Stock Additional\nForeign currency\nShares\n(‘000) Amount $ Shares\n(‘000) Amount $ Shares\n(‘000) Amount $ Paid in\nCapital Retained\nEarnings translation\ngain Total\nBalance at AUG 31, 2020 1,000 - - 39,204 - $ 4,518,826 $ (4,053,079 ) $ (221,896 ) $ 243,951\nShares issuance\n1,174,848 117,485 1,615,304 161,530\n279,015\nCapital in excess of par value\n923,746\n923,746\nNet loss for the period\n-\n(2,093,665 )\n(2,093,665 )\nForeign currency translation gain\n217,868 217,868\nBalance at AUG 31, 2021 1,000 1,174,848 117,485 1,654,508 161,530 $ 5,442,572 $ (6,146,744 ) $ (4,028 ) $ (429,085 )\nEffect on VIE termination\n1,048,891 (98,326 ) 950,565\nBalance at AUG 31, 2021 1,000 1,174,848 117,485 1,654,508 161,530 $ 5,442,572 $ (5,097,853 ) $ (102,354 ) $ 521,480\nShares issuance\n33,037 3,304 95,395 9,439\n12,743\nCapital in excess of par value\n2,179,630\n2,179,630\nNet loss for the period\n-\n(3,790,411 )\n(3,790,411 )\nForeign currency translation gain\n94,443 94,443\nBalance at AUG 31, 2022 1,000 1,207,885 120,789 1,749,903 170,969 $ 7,622,202 $ (8,888,264 ) $ (7,911 ) $ (982,115 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nQUALITY ONLINE EDUCATION GROUP INC.\nAUDITED CONSOLIDATED STATEMENT OF CASH FLOW\nFOR THE YEAR ENDED AUG 31, 2022\nAUDITED AUDITED\n31-Aug-22 31-Aug-21\nUS$ US$\nCash flows from operating activities:\nNet Loss (3,790,411 ) (2,093,665 )\nNet income from continuing operations\nAdjustments to reconcile net income to net cash provided by (used in) operating activities:\nDepreciation and amortization 3,599 22,706\nAccounts receivable & other receivable (41,006 ) (41,994 )\nPrepayments and other assets 145,224 (52,091 )\nAccounts payable 166,194 (51,700 )\nAccrued expenses and other liabilities (145,721 ) 142,590\nAdvanced from customers 450,070 617,089\nTax payable (5,596 ) 4,494\nNet cash provided by (used in) operating activities (3,217,647 ) (1,452,571 )\nCash flows from investing activities:\nAdditions to property, plant and equipment 9,526 (1,111 )\nAdditions to intangible assets 244,270 5,980\nNet cash provided (used in) investing activities 253,796 4,869\nCash flows from financing activities:\nDue to related party 10,119 80,066\nProceeds from third party loan (208,169 ) 7,947\nShare subscriptions 2,192,373 1,202,761\nNet cash provided (used in) financing activities 1,994,323 1,290,774\nEffect of exchange rate changes on cash 94,443 217,868\nEffect of termination VIE structure 950,565 -\nNet increase in cash 75,480 60,940\nCash, beginning of period 104,415 43,475\nCash, end of period 179,895 104,415\nThe accompany notes are an integral part of these consolidated financial statements\nQUALITY ONLINE EDUCATION GROUP INC.\nNOTES TO AUDITED CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED AUGUST 31, 2022\nNOTE 1 NATURE OF BUSINESS\nQuality Online Education Group Inc. (QOEG) is a leading E-learning company which provides comprehensive online lessons to students in different parts of the world. It locates in Toronto of Canada and has one wholly owned subsidiary company: Golden Bridge Human Resources Consulting Inc., an Ontario, Canada, based company provides tutoring services and courseware development services.\nWe are the pioneer and leader of providing real-time online small group classes. We deliver quality education to students and noticeable results from our passionate teachers and teaching assistants. With our Artificial Intelligent system, we combined Education and Entertainment (Edu-tertainment) in part of the learning. It is our mission to develop confidence in our students so they can reach their goals with happiness and efficiency! The main business scope of the Group includes K12 English Online education services, courseware development and Education-technology platform development.\nNOTE 2 GOING CONCERN\nThe Companys ability to continue operating as a going concern is dependent on its ability to increase revenues and raise sufficient additional working capital. These matters raise substantial doubt about the Companys ability to continue as a going concern. The financial statements have been prepared on a going concern basis, which contemplates realization of assets and liquidation of liabilities in the ordinary course of business. The Company plans to raise additional capital as needed. There can be no assurance that this capital will be available and if is not, the Company may be forced to substantially curtail or cease operations. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nThe Opinion announced on July 24, 2021 by Chinas official state media may lead to policies and regulations that have material impacts on our existing business operations, financial condition, and corporate structure. The Company terminated the VIE contract in September 2021 and entered a new service contract with Tianjin Zhipin Education Technology Co., Ltd as one of the suppliers on global online market research, education consulting and information technology consulting service.\nNOTE 3 SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation:\nThe consolidated financial statements include the accounts of QOEG and its subsidiaries and have been prepared in accordance with generally accepted accounting principles (GAAP). All material inter-company accounts and transactions have been eliminated in consolidation.\nUse of Estimates:\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. Actual results could differ from those estimates.\nFinancial Statements in U.S. dollars:\nThe reporting currency of the Company is the U.S. dollar (dollar). The dollar is the functional currency of the Company and the Companys U.S. subsidiary. The financial statements of the non-US subsidiaries are translated to U.S. dollars using the methods mandated by ASC 830.\nCash and Cash Equivalents:\nThe Company considers all highly liquid investments originally purchased with maturities of three months or less to be cash equivalents. These financial statements have not been subjected to an audit or review or compilation engagement, and no assurance is provided on them.\nRevenue Recognition:\nThe Company recognizes revenues when persuasive evidence of an arrangement exists, delivery has occurred or services rendered, the sales price of fee is fixed or determinable, and its collectability is reasonably assured.\nStock based compensation:\nThe Company records stock-based compensation in accordance with the ASC 718 Shares-Based Compensation FASB Accounting Standards Classification using the fair value method. All transactions in which goods or services are the consideration received for the issuance of equity instruments are accounted for based on the fair value of the consideration received or the fair value of the equity instrument issued, whichever is more reliably measurable. Equity instruments issued to employees and the cost of the services received as consideration are measured and recognized based on the fair value of the equity instruments issued.\nForeign Currency:\nThe Company translates the financial statements of our foreign subsidiaries from the local (functional) currencies to U.S. dollars. The rates of exchange at each fiscal year end are used for translating the assets and liabilities and the average monthly rates of exchange for each year are used for the consolidated statements of operations and comprehensive loss. Gains or losses resulting from the translation of the foreign subsidiaries financial statements are included in the accompany consolidated balance sheets as a separate component of stockholders equity.\nNOTE 4 OTHER RECEIVABLES\nOther receivables consist of the following:\nSchedule of other receivables\nAs of August 31\nRMB¥ CAD$ RMB¥ CAD$\nValue-Added Tax Input - 24,156 - -\nAdvance to employees 75,300 - - -\nPrepaid rental & other deposits 222,638 - - -\n297,938 24,156 - -\nThe change in RMB¥of Other Receivables was due to the termination of VIE contract with Tianjin Zhipin Education Technology Co., Ltd in September 2021.\nNOTE 5 INTANGIBLE ASSETS\nThe company acquired the existing customers and copyright of its teaching and course materials from a third party tutoring business. The company also entered into an endorsement contract with a Canadian celebrity, Christopher Downs, during the years. The intangible assets acquired for the year ended Aug 31, 2021 and Aug 31, 2022 were US$1,003,535 and US$759,266, respectively.\nNOTE 6 PROPERTY AND EQUIPMENT\nMajor classes of property and equipment at August 31, 2021 and 2022 are as follows:\nSchedule of property and equipment\nAs of August 31\nRMB¥ CAD$ RMB¥ CAD$\nComputers & Equipment 209,469 16,301 - 19,316\nFurniture & fixtures 24,159 4,575 - 4,575\nTotal 233,628 20,876 - 23,891\nLess: Accumulated depreciation 148,509 13,791 - 18,871\nProperty & Equipment, net 85,119 7,085 - 5,020\nThe change in RMB¥of Other Receivables was due to the termination of VIE contract with Tianjin Zhipin Education Technology Co., Ltd in September 2021.\nNOTE 7 RECEIPT IN ADVANCE\nReceipt in advance is amount the company receives from customer before tutoring service is provided to them. The receipt in advance for the year ended Aug 31, 2021 and Aug 31, 2022 were US $950,358 and US $1,400,427, respectively. All receipt in advance are current.\nNOTE 8 ASSETS ACQUISITION PAYABLE\nThe company entered into contracts to acquire the existing customers and copyright of its teaching and course materials with a third party tutoring business. It also entered into an endorsement contract with a Canadian celebrity, Christopher Downs. As of Aug 31, 2021, & Aug 31, 2022, the amount outstanding on the contracts were US$293,802 & US$114,408, respectively.\nNOTE 9 DUE TO RELATED PARTY\nDue to related party consists of loans from shareholders. In support of the Companys efforts and cash requirements, it may rely on advances from shareholders until such time that the Company can support its operations or attains adequate financing through sales of its equity or traditional debt financing. There is no formal written commitment for continued support by shareholders. Amounts represent advances or amounts paid in satisfaction of liabilities. The advances are considered temporary in nature and have not been formalized by a promissory note. The loans are payable on demand, unsecured and bears no interest. As of Aug 31, 2021, & Aug 31, 2022, the loan from shareholders were US$130,645 and US$140,764, respectively.\nNOTE 10 ACCRUED LIABILITIES AND OTHER PAYABLE\nAccrued liabilities consist of the salaries that have been earned by employees but not yet paid to them and accounting services provided by third party but not yet pay to them. The amounts for accrued salaries on Aug 31, 2021 and Aug 31, 2022 are US$162,181 & US$16,460. The accrued accounting services fee were nil for both years ended Aug 31, 2021 and Aug 31, 2022, respectively.\nNOTE 11 INCOME TAXES\nThe net operating loss carryovers may be subject to limitation under Internal Revenue Code due to significant changes in the Companys ownership. The Company has provided a full valuation allowance against the full amount of the net operating loss benefit, since, in the opinion of management, based upon the earnings history of the Company it is more likely than not that the benefit will not be realized.\nNOTE 12 STOCKHOLDERS EQUITY COMMON STOCK\nAfter the acquisition and merger on Aug 31,2020, the management had canceled the original common stock of the Company and authorized new share capital. It consists of 50,000,000 shares of common stock of which 39,129,789 shares were outstanding as of Aug 31, 2020 and 3,581,517 were free trading. On October 7, 2020, the Company announced to increase the number of authorized common shares to 5,000,000,000, up to 3 billion of which will be reserved in order to enact the Merger Agreement. The remainder of the increase will be reserved to fund potential new product line development, market expansion, and any further mergers and acquisitions as such opportunities arise. At the same time, an exchangeable shares structure will be used to finalize the current acquisition of QOEG. Pursuant to the Share Exchange Agreement dated Aug 31, 2020, ADGS Advisory, Inc. and QOEG started to exchange shares. As of August 31, 2022, there were 1,207,885,627 QOEG exchangeable shares that have not been exchanged to QOEG common shares. QOEG has 5,000,000,000 common shares and 20,000,000 preferred shares authorized. Among those shares, 1,749,903,669 QOEG common shares and 1,000,000 QOEG preferred shares were issued and outstanding.\nNOTE 13 COMMITMENTS AND CONTINGENCIES\nThe Company has entered into a service contract with Tianjin Zhipin Education Technology Co., Ltd as one of the outsourcing vendors on global online market research, education consulting and information technology consulting service in September 2021 for three years. The Company is not aware of any litigation incidental to the conduct of our business as of August 31, 2022. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURES\nWe have had no disagreements (as such term is defined in Item 304 of Regulation S-K) with our Accountant on any matter of accounting principles or practices, financial statement disclosure, or auditing scope or procedures. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our chief executive, we conducted an evaluation of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) and Rule 15d-15(e) promulgated under the Securities Exchange Act of 1934. Based on this evaluation, our chief executive officer and principal financial officer have concluded such controls and procedures to be ineffective as of August 31, 2021, to ensure that information required to be disclosed by the issuer in the reports that it files or submits under the Act is recorded, processed, summarized and reported, within the time periods specified in the Commissions rules and forms and to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Act is accumulated and communicated to the issuers management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nManagements Annual Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rules 13a-15 (f) and 15d- 15 (f) under the Exchange Act, for the Company.\nOur internal control over financial reporting is the process designed by and under the supervision of our CEO, or the persons performing similar functions, to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of our financial statements for external reporting in accordance with accounting principles generally accepted in the United States of America. Management has evaluated the effectiveness of our internal control over financial reporting using the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control over Financial Reporting - Guidance for Smaller Public Companies.\nUnder the supervision and with the participation of our CEO, or the persons performing similar functions, our management has assessed the effectiveness of our internal control over financial reporting as of August 31, 2022, and concluded that it is not effective because of the material weakness described below:\nIn connection with the preparation of our financial statements for the year ended August 31, 2022, due to resource constraints, material weaknesses became evident to management regarding our lack of resources and segregation of duties. The Company has not established an audit committee and lacks documentation of its internal control process. A material weakness is a significant deficiency in one or more of the internal control components that alone or in the aggregate precludes our internal controls from reducing to an appropriately low level the risk that material misstatements in our consolidated financial statements will not be prevented or detected on a timely basis.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the registrants registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the registrant to provide only managements report in this annual report.\nEvaluation of Changes in Internal Control over Financial Reporting\nDuring the year ended December 31, 2021, there were no changes in our internal control over financial reporting identified in connection with the evaluation required by paragraph (d) of Securities Exchange Act Rules 13a-15 or 15d-15 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. We intend to recruit additional professionals, as our business conditions warrant, to ensure that we include all necessary disclosure in our filings with the Securities and Exchange Commission. Although we believe that these corrective steps will enable management to conclude that the internal controls over our financial reporting are effective when the staff is in place and trained, we cannot provide assurance that these steps will be sufficient. We may be required to expend additional resources to identify, assess and correct any additional weaknesses in internal control.\nImportant Considerations\nThe effectiveness of our disclosure controls and procedures and our internal control over financial reporting is subject to various inherent limitations, including cost limitations, judgments used in decision making, assumptions about the likelihood of future events, the soundness of our systems, the possibility of human error, and the risk of fraud. Moreover, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions and the risk that the degree of compliance with policies or procedures may deteriorate over time. Because of these limitations, there can be no assurance that any system of disclosure controls and procedures or internal control over financial reporting will be successful in preventing all errors or fraud or in making all material information known in a timely manner to the appropriate levels of management. ITEM 9B. OTHER INFORMATION\nNone\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable\nPART III ITEM 10. DIRECTORS AND EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nIdentity of Officers and Directors\nOur bylaws provide that the number of directors who shall constitute the whole board shall be such number as the board of directors shall at the time have designated. Each director shall be selected for a term of one year and until his successor is elected and qualified. Vacancies are filled by a majority vote of the remaining directors then in office with the successor elected for the unexpired term and until the successor is elected and qualified.\nExecutive Officers and Directors\nThe names of our executive officers and directors, as of August 31, 2022, and the positions currently held by each are as follows:\nName\nPosition\nTerm of Office\nXuYe Wu\nage 27__\nChief Executive Officer and Chairman of the Board\nOne (1) year\nXijin Wu\nage 38__\nBoard Member\nOne (1) year\nDirector Independence\nWe do not have any independent directors serving on our Board of Director.\nExecutive Officers and Directors\nXuYe Wu\nXuYe Wu, age 27, has been serving as the CEO and the director of the Company since January 1, 2021. Prior to that, he founded Golden Voice English Online Education in 2015. After receiving multiple rounds of venture capital investment, he left and founded Quality Online Education Group Inc. with a refined understanding of the industry and the market. Mr. Wu attended the University of Toronto from 2013 to 2015, majoring in Economics. Through his prior experiences, Edward possesses good understanding of the education industry, and his experience managing an online education company helps him making critical strategic goals balancing cost and the rate of growth. His working experience qualifies him to serve on our board and bring in valuable insights on running the company.\nXijin Wu\nXijin Wu, Age 38, has been serving as the CEO and the directors of the Company since February 7, 2020 and remains as the director since January 1st, 2021. He is a serial entrepreneur and angel investor and has been focused on education and e-commerce over the past 15 years. Prior to joining QOEG, he was the founder and CEO of Dongyang Aibel Education Group and Ningbo Realfun Education Group. He successfully established several enterprises with a total annual revenue of hundreds of millions. He has participated in more than dozens of angel investment projects, including Mobike, Auro Robotics, Flirtey, Bingz Canada, Instawork,etc.\nBoard Leadership Structure and Risk Oversight\nThe Board oversees our business and considers the risks associated with our business strategy and decisions. The Board currently implements its risk oversight function as a whole. Each of the Board committees, when established, will also provide risk oversight in respect of its areas of concentration and reports material risks to the board for further consideration.\nTerm of Office\nDirectors serve until the next annual meeting and until their successors are elected and qualified. Officers are appointed to serve for one (1) year until the meeting of the Board following the annual meeting of shareholders and until their successors have been elected and qualified.\nDirector Independence\nWe use the definition of independence of The NASDAQ Stock Market to make this determination. NASDAQ Listing Rule 5605(a)(2) provides that an independent director is a person other than an officer or employee of the company or any other individual having a relationship which, in the opinion of the Companys Board, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. The NASDAQ listing rules provide that a director cannot be considered independent if:\n● the director is, or at any time during the past three (3) years was, an employee of the company;\n● the director or a family member of the director accepted any compensation from the company in excess of $120,000 during any period of twelve (12) consecutive months within the three (3) years preceding the independence determination (subject to certain exemptions, including, among other things, compensation for board or board committee service);\n● the director or a family member of the director is a partner in, controlling shareholder of, or an executive officer of an entity to which the company made, or from which the company received, payments in the current or any of the past three fiscal years that exceed 5% of the recipients consolidated gross revenue for that year or $200,000, whichever is greater (subject to certain exemptions;\n● the director or a family member of the director is employed as an executive officer of an entity where, at any time during the past three (3) years, any of the executive officers of the company served on the compensation committee of such other entity; or\n● the director or a family member of the director is a current partner of the companys outside auditor, or at any time during the past three (3) years was a partner or employee of the companys outside auditor, and who worked on the companys audit.\nUnder such definitions, we have no independent directors. However, our Common Stock is not currently quoted or listed on any national exchange or interdealer quotation system with a requirement that a majority of our Board be independent and, therefore, the Company is not subject to any director independence requirements.\nFamily Relationships\nThere are no additional family members serving as Officers and Directors of the Company.\nInvolvement in Certain Legal Proceedings\nDuring the past five years none of our directors, executive officers, promoters or control persons was:\n1) the subject of any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2) convicted in a criminal proceeding or is subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3) subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities; or\n4) found by a court of competent jurisdiction (in a civil action), the Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law.\nCode of Business Conduct and Ethics\nOur Board plans to adopt a written code of business conduct and ethics (Code) that applies to our directors, officers and employees, including our principal executive officer, principal financial officer and principal accounting officer or controller, or persons performing similar functions. We intend to post on our website a current copy of the Code and all disclosures that are required by law in regard to any amendments to, or waivers from, any provision of the Code.\nEvaluation of Disclosure Controls and Procedures\nWe carried out an evaluation, under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, of the effectiveness of our disclosure controls and procedures (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)). Based upon that evaluation, our principal executive officer and principal financial officer concluded that, as of the end of the period covered in this report, our disclosure controls and procedures were not effective to ensure that information required to be disclosed in reports filed under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the required time periods and is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nOur management, including our principal executive officer and principal financial officer, does not expect that our disclosure controls and procedures or our internal controls will prevent all error or fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. To address the material weaknesses, we performed additional analysis and other post-closing procedures in an effort to ensure our consolidated financial statements included in this offering circular have been prepared in accordance with generally accepted accounting principles. Accordingly, management believes that the financial statements included in this report fairly present in all material respects our financial condition, results of operations and cash flows for the periods presented.\nChange in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during our last fiscal year that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nAttestation Report of the Registered Public Accounting Firm\nThis offering circular does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only managements report in this annual report. ITEM 11. EXECUTIVE COMPENSATION\nThe following summary compensation table reflects all compensation awarded to, earned by, or paid to our Chief Executive Officer and directors for all services rendered to us in all capacities during 2020 to 2022.\nSummary Compensation Table\nName and\nPrincipal\nPosition (a)\nYear (b) Salary ($) (c) Bonus ($) (d)\nStock\nAwards ($) (e) Option\nAwards ($) (f)\nAll Other\nCompensation ($) (g) Total ($) (h)\nXuYe Wu, CEO, Director\nCAD $60,000\nCAD $100,000 worth of QOEG Common Shares\nCAD $160,000\nXijin Wu, Director\nCAD $100,000 worth of QOEG Common Shares\nCAD $100,000\nCAD $100,000 worth of QOEG Common Shares\nCAD $100,000 ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nDuring the 12 months ended of August 31, 2022, Kuido Wu, advanced the Company $26,356. The advance is non-interest bearing and due on demand.\nSECURITY OWNERSHIP OF MANAGEMENT & CERTAIN SECURITY HOLDERS\nThe following table shows the beneficial ownership of our Common Stock as of the date of this Offering Circular held by (i) each person known to us to be the beneficial owner of more than five percent (5%) of any class of our shares; (ii) each director; (iii) each executive officer; and (iv) all directors and executive officers as a group. As of August 31, 2019, there were 39,079,889 shares of our Common Stock issued and outstanding. As of August 31, 2020 and August 31, 2021, there were 39,079,889 and 1,654,508,319 shares of our Common Stock issued and outstanding respectively. As of August 31, 2022, there were 1,749,903,669 Common Stock outstanding.\nWe believe that all persons named in the table have sole voting and investment power with respect to all shares beneficially owned by them, except as noted.\nPercentage ownership in the following table is based on 1,749,903,669 shares of Common Stock outstanding as of August 31, 2022. Each beneficial owners percentage ownership is determined by dividing the number of shares beneficially owned by that person by the base number of outstanding shares, increased to reflect the shares underlying options, warrants or other convertible securities included in that persons holdings, but not those underlying shares held by any other person.\nBeneficial Owner Number of\nShares Percentage\nXuYe Wu - CEO and Director 234,134,787 13.38 %\nXijin Wu - Director 0 %\nLin Zhao 88,218,309 5.04 %\nQiang Tong 588,713,336 33.64 %\nYang Song 117,742,668 6.73 %\nAll Directors and Executives (2 person) 234,134,787 13.38 % ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nDESCRIPTION OF SECURITIES\nThe following is a summary of the rights of our capital stock as provided in our certificate of incorporation, bylaws and certificate of designation. For more detailed information, please see our certificate of incorporation, bylaws and certificate of designation which have been filed as exhibits to the Offering Statement of which this Offering Circular is a part.\nGeneral\nThe Company is authorized to issue multiple classes of stock. The total number of shares of stock which the Company is authorized to issue is five billion twenty million (5,020,000,000) shares of capital stock, consisting of five billion (5,000,000,000) shares of Common Stock, $0.0001 par value, and twenty million (20,000,000) shares of preferred stock, $0.0001 par value (the Preferred Stock).\nIndebtedness.\nAs of the date of this Offering Circular, except for approximately $1,965,875 in payable and debt obligations owed by the Company.\nCommon Stock\nAs of the date of this Offering Circular, the Company had 1,749,903,669 shares of Common Stock issued and outstanding.\nVoting\nThe holders of the Common Stock are entitled to one vote for each share held at all meetings of shareholders (and written actions in lieu of meeting). There shall be no cumulative voting. Preferred stockholders have rights to dividends when and as declared by the Board from funds legally available therefore, and upon liquidation are entitled to share pro rata in any distribution to holders of Preferred. There are no preemptive, conversion or redemption privileges, nor sinking fund provisions with respect to the Common Stock. There are conversion and redemption privileges, for Preferred stock, and may convert each 1 Preferred share to 1,000 Common shares.\nChanges in Authorized Number\nThe number of authorized shares of Common Stock may be increased or decreased subject to the Companys legal commitments at any time and from time to time to issue them, by the affirmative vote of the holders of a majority of the stock of the Company entitled to vote.\nPreferred Stock\nThe Preferred Stock may be issued from time to time in one or more series. The Board is authorized to fix the number of shares of any series of Preferred Stock and to determine the designation of any such series. The Board is also authorized to determine or alter the rights, preferences, privileges, and restrictions granted to or imposed upon any wholly unissued series of Preferred A Stock and, within the limits and restrictions stated in any resolution or resolutions of the Board originally fixing the number of shares constituting any series, to increase or decrease (but not below the number of shares of such series than outstanding) the number of shares of any such series subsequent to the issue of shares of that series.\nDividend Policy\nWe will not distribute cash to our Common Stock shareholders. We currently intend to retain future earnings, if any, to finance the expansion of our business and for general corporate purposes. We cannot assure you that we will distribute any cash in the future. Our cash distribution policy is within the discretion of our Board of Directors and will depend upon various factors, including our results of operations, financial condition, capital requirements and investment opportunities.\nEquity Compensation Plan Information\nCompany plans to establish a Common Stock Option Plan for the benefit of its employees in the near future. The vesting and terms of all of the options are determined by the Board of Directors and may vary by optionee; however, the term may be no longer than 10 years from the date of grant. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nAudit Fees\nThe following table presents the aggregate fees billed for each of the last two fiscal years by Ben Borgers, our Independent Registered Public Accounting Firm, in connection with the audit of our financial statements and other professional services rendered by those accounting firms.\nAudit fees USD $ 59,400 USD $ 48,700\nAudit-related fees - $ -\nTax fees - $ -\nAll other fees\nAudit fees represent fees for professional services rendered by our principal accountants for the audit of our annual financial statements and review of the financial statements included in our Forms 10-Q or services that are normally provided by our principal accountants in connection with statutory and regulatory filings or engagements.\nAudit-related fees represent professional services rendered for assurance and related services by the accounting firm that are reasonably related to the performance of the audit or review of our financial statements that are not reported under audit fees.\nTax fees represent professional services rendered by the accounting firm for tax compliance, tax advice, and tax planning.\nAll other fees represent fees billed for products and services provided by the accounting firm, other than the services reported for the other three categories.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a)(1) Financial Statements\nThe audited financial statements of the Company are included in this report under Item 8.\n(a)(2) Financial Statement Schedules\nAll financial statement schedules are included in the footnotes to the financial statements or are inapplicable or not required.\n(a)(3) Exhibits\nThe following documents have been filed as part of this report.\nExhibit No. Description\n31.1 Rule 13a14(a)/15d-14(a) Certification of Chief Executive Officer and Director\n32.1 Section 1350 Certification of Chief Executive Officer and Director\nSIGNATURES\nIn accordance with the requirements of the Exchange Act, the Registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nQuality Online Education Group Inc.\nBy: /s/ XuYe Wu\nName: XuYe Wu\nTitle: Chief Executive Officer, Principal Executive Officer, Principal Financial Officer, Principal Accounting Officer, and Director\nDated: Nov 20, 2022\nBy: /s/ Xijin Wu\nName: Xijin Wu\nTitle: Director\nDated: Nov 20, 2022"
}