{
    "cik": "1440153",
    "company": "Bakhu Holdings, Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-11-07",
    "period_of_report": "2022-07-31",
    "sic": "6794",
    "state_of_inc": "NV",
    "state_location": "CA",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1440153/0001096906-22-002650-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1440153/000109690622002650/bkhu-20220731.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1440153/0001096906-22-002650.txt",
    "filename": "1440153_10K_2022_0001096906-22-002650.htm",
    "content": "ITEM 1. BUSINESS\nOverview\nWe hold a license from Cell Science to plant cell-extraction and replication technology and related proprietary equipment, processes, and formulations to produce, manufacture, and sell cannabis-related byproducts-sometimes referred to as cannabinoids-exclusively in North America, Central America, and the Caribbean for medical, food additive, and recreational uses.\nDuring our fiscal year ended July 31, 2021, we collaborated with Cell Science, through Dr. Peter Whitton, the principal inventor of the technology and an affiliate of both Cell Science and us, to demonstrate application of the technology. In a July 2021 amendment to our license agreement with Cell Science, we altered the testing requirements and accepted the results then achieved, which required us to issue a one-year note for a one-time payment of $3.5 million, subject to specified setoffs, to obtain a fully paid license. In January 2022, and in lieu of any reduction to the one-time payment note, we agreed to accept assignment of all rights under the lease for the facility in which the laboratory that we used for the efficacy demonstration testing process is located, as well as all rights in all laboratory equipment and related assets used in the efficacy demonstration testing process.\nDuring our most recent fiscal year completed on July 31, 2022, we expanded our consulting team to support our efforts to organize the launch of our commercialization efforts, identify possible sources of required financing, and initiate conversations with potential commercialization partners, particularly selected multi-state operators with established production, distribution, and marketing infrastructure, expertise, and financing. Conversations with some of these sources and potential commercialization partners continue, but we have not reached any definitive commitments, understandings, or agreements. We are continuing our efforts.\nWe propose to undertake additional work to determine the limits of the technology, maximize production efficiency, reduce production costs, and customize the process and products for potential commercialization partners, which we believe will enhance our commercialization efforts. We intend to coordinate these efforts with the requirements of potential funding and commercialization opportunities. Subject to successfully completing our ongoing work, we intend to seek to commercialize the licensed technology through joint ventures, strategic partners, sublicenses, and other arrangements that may enable us to take advantage of the technical, regulatory relationships and experience, and financial resources of experienced cannabinoid production firms. We intend to authorize these third parties to incorporate the technology into production facilities they fund, build, and operate to produce medical, food additive, and recreational cannabis-related products in compliance with applicable state and federal law. We will need additional financing from external sources to begin these efforts.\nThe licensed intellectual property is based on established bioscience principles and practices and has been demonstrated on a limited basis. Testing of the process has met agreed technical specifications, including equipment, processes, and formulations, for production in batches in which seed cells are grown in a biologically active controlled and monitored environment within our proprietary production pods that could be replicated to produce commercial quantities. However, our licensed technology has not been scaled up to produce cannabinoids in commercial quantities routinely and reliably. Accordingly, our ability to commercialize the intellectual property through strategic partners, joint venturers, and sublicensees is dependent on successful completion of necessary application engineering, which we cannot assure will occur.\nOur licensed technology describes a process to mirror, or replicate, the cannabinoid flavor, aroma, and CBD and THC potency qualities of the source plants cells without growing the plant. We do not now, and do not intend to, produce, transport, or sell cannabis or cannabinoids directly.\nSince early 2020, our business activities and all efforts to advance the demonstration of the validity of our licensed technology have been adversely affected due to the COVID-19 pandemic. The COVID-19 virus and its Delta, Omicron, and possible other variants, as well as government and private sector responses to them, have caused and continue to cause delays, increased costs, and interrupted travel and, in general, to negatively impact all our activities.\nOur License\nBased on completion of conditions specified in our Integrated License Agreement discussed below, on May 17, 2022, we filed and recorded with the US Patent and Trademark Office the Patent and Technology License, which we refer in this document as the License. In this document, Cell Science granted us a fully-paid, exclusive, royalty free, perpetual, irrevocable right and license, with the right to sublicense, cell-extraction and replication technology and related proprietary equipment, processes, and formulations to produce, manufacture, and sell cannabis-related byproducts-sometimes referred to as cannabinoids-exclusively in North America, Central America, and the Caribbean for medical, food additive, and recreational uses.\nOur Integrated License Agreement\nOn December 20, 2018, we entered into a Patent and Technology License Agreement, which was amended and restated effective December 31, 2019, which in turn was further amended on September 22, 2020 (the Amended Restated License), to license, with the right to sublicense, the described cell-extraction and replication technology and related proprietary equipment, processes, and medium formulations to be used in a commercially-sized bioreactor laboratory to produce, manufacture, and sell cannabinoids - exclusively in North America, Central America, and the Caribbean - for medical, food additive, and recreational uses. As consideration for the grant of the license, we issued 210,000,000 shares of common stock, subject to adjustment, and agreed to a one-time payment of $3.5 million, less an amount equal to all cash and expense advances to Cell Science representatives to the technical team involved in the testing (the One-time Payment). The One-time Payment is evidenced by a promissory note for $3.5 million to Cell Science due in January 2023. As a result of the issuance of these shares, Cell Science became our largest stockholder.\nIn consideration of the December 2018 license granted by Cell Science, we issued to Cell Science 210,000,000 shares of common stock, which constituted about 69.70% of our issued stock as July 31, 2022. The shares initially issued to Cell Science were subject to reduction if the results of the efficacy demonstration showed less than targeted results. In September 2020, we released 20,000,000 shares from possible reduction, and in February 2021, we released an additional 6,000,000 shares.\nBased on an evaluation of the efficacy demonstration testing results achieved to date, and in light of the desire to accelerate the launch of our commercialization program directed at achieving recurring revenue, on July 12, 2021, we agreed to rely on the results from five bioreactors rather than two groups of five preselected bioreactors. We accelerated the measurement criteria to measure the commercial efficacy of the licensed technology, and further determined to accept the test results from the five bioreactors as meeting the Cell Science efficacy demonstration requirements. As a result of our acceptance of the efficacy demonstration test results in July 2021, we released all remaining 184,000,000 shares initially issued to Cell Science under our intellectual property license. In January 2022, we accepted assignment of all rights under the lease for the facility in which the laboratory we use is located including all rights in all laboratory equipment and related assets used in the efficacy demonstration testing process in lieu of any reduction to the One-time Payment note. See below.\nThe Amended Restated License, as subsequently amended by the 2020 and 2021 successive amendments, are all are merged into a single, integrated agreement that are together hereinafter referred to as the Integrated License Agreement.\nUnder the Integrated License Agreement and notwithstanding the grant of the License as described above, we remain obligated to pay certain patent prosecution and other intellectual property protection costs that could be substantial. We do not plan to establish or maintain any deposits or reserves to pay these costs. If we fail to meet these obligations, Cell Science could terminate our License and then have the right to assume our position in any outstanding commercialization arrangements. If Cell Science assumes outstanding obligations, it would step into our position as commercial partner or sublicensee, precluding us from participating in further revenue from that relationship, notwithstanding our potential continuing liability for obligations to commercial partners, or from further commercialization efforts.\nThe possibility that Cell Science, a foreign entity, may assume our obligations to our commercial partners may be a risk to them that may have a material adverse effect on our commercialization efforts. If Cell Science refuses to assume our obligations under our commercialization arrangements, the rights of our commercial partners may be subject to dispute, which would likely result in claims for damages that our commercial partners would seek to recover from us. The existence of the right of Cell Science to terminate our License on which our commercialization arrangements will be based may be considered a substantial risk to potential commercial partners and correspondingly impair the success of our commercialization efforts.\nProduct and Process Refinement\nHaving accepted the test results demonstrating efficacy of the licensed technology in July 2021 and subject to obtaining required financing, we will continue to refine the licensed process, focusing on determining the limits of the technology, maximizing production efficiency, reducing production costs, and customizing features to address the requirements of potential commercialization partners. We undertake specific tasks based on our understanding of the expectations and anticipated requirements on potential commercialization partners. These efforts are underway at laboratory facilities in Van Nuys, California, in which the efficacy demonstration was completed. We acquired rights to use that facility through agreements with our affiliates, Cell Science and OZ Corporation, in January 2022. As part of our ongoing laboratory work, we will develop a standardized operating manual, technical descriptions, and related documentation with a view to supporting joint venturers, strategic alliance partners, sublicensees, and others in constructing and operating commercial production plants. We intend to more fully define the scope and description of the technology and outline general requirements for equipment, materials, utility requirements, facility specifications, and consumables. This work will require that we hire employees and engage consultants with required scientific and technical expertise.\nProposed Commercialization\nGeneral\nWe are proceeding with efforts to generate revenue through commercializing our licensed technology. In order to access the technical, financial, and operating and regulatory experience of companies already in the cannabinoid industry, we are identifying and initiating discussions with multi-state cannabinoid producers and marketers about possible joint venture arrangements or other strategic relationships. In pursuing these relationships, we will seek to balance the cash and other resources that the other party may provide to accelerate our market entry against the potential revenue that we will need to share with our partner. Our focus on joint ventures and strategic relationships will take priority over our earlier intent to sublicense to third parties the use of the licensed technology and related specifications for proprietary equipment, processes, and medium formulations to produce, manufacture, and sell cannabinoids. We do not currently have any commitment for any joint venture, strategic alliance, sublicense, and other arrangement, except as described below. We do not now, and do not at any time intend to, produce, distribute, or market cannabis or cannabis products.\nWe intend to enter commercialization arrangements for the licensed technology only with third parties that are permitted in the applicable jurisdiction to legally produce and manufacture cannabis-derived products and byproducts for sale and use, including a cannabis concentrate powder product for the medical, food additive, and recreational cannabis consumption markets. The licensed technology is designed to produce, after the final processing step, both THC and CBD concentrates that mirror the source cells with potency meeting our requirements. Generally, we will seek commercialization through firms that have the requisite cannabinoid permits and financial ability to scale-up commercially sized bioreactor production facilities capable of producing at each production site 60,000 pounds per annum of a predictably harvested plant-derived material with reliable qualities and quantities.\nCurrently, state cannabinoid regulations are generally based on live-grow plant-based cannabinoid production that may not specifically address possible production through a plant cell-extraction and replication process. Further, current regulatory regimes may not easily be adaptable to laboratory production methods such as ours. Therefore, to support our commercialization program, we anticipate that initially we will need to collaborate with state regulators to adapt or amend current statutes, regulations, and administrative policies to accommodate laboratory production, and we may need to obtain any special clearances from state licensing authorities for our\nplant cell-extraction and replication processes on behalf of commercial partners. These efforts may not be successful and will likely increase costs and delay commercialization and revenues.\nIn addition to initial engineering that we plan to undertake, we will be responsible for ongoing research and development costs and creating a licensing sales and support operation. Commercial partners will be required to fund production facilities construction, staffing, and operation. Commercial partners will also be responsible for all required regulatory permits and compliance.\nSublicense with Integrity Cannabis Solutions, Inc.\nOn April 17, 2020, through our subsidiary, we entered into a Strategic Alliance Agreement with Integrity Cannabis Solutions, Inc. (ICS), an unaffiliated Florida corporation, to collaborate: (i) to facilitate the building and operation of a commercial-scale production facility in Florida; and (ii) to enter a sublicense.\nWe entered into a Patent and Technology Sublicense Agreement (the Sublicense Agreement) on April 22, 2020, under which we granted to ICS the right to use the sublicensed technology to produce, manufacture, market, and sell CBD and related byproducts and derivatives having less than 0.3% measurable THC on a dry weight basis. The sublicense will become effective when the efficacy demonstration is complete with confirmed results demonstrating that: (a) the cannabinoid concentrates produced, harvested, and dried during a full cycle of the licensed technology process contain at least 90% of the measurable percentage levels of THC and CBD as the donor cells; (b) this result is achieved at a project utility, production, and supplies cost of $0.10 per gram, or roughly $100 per kilogram; (c) we have provided the operations manual; and (d) we have provided all necessary equipment designs and vendor resources. Since we waived compliance with the original efficacy demonstration requirements that were effective when we entered into our agreements with ICS, we will need to renegotiate the terms of our arrangements with ICS, and we cannot assure that we will be successful in doing so.\nUnder the existing Sublicense Agreement, ICS is obligated to pay to us a continuing royalty equal to 8% of the wholesale product price sales revenue from the production of CBD raw product concentrate in the production facility using the sublicensed technology. The royalty payments are payable quarterly in arrears, beginning after the first quarter of commercial production. We cannot predict when actual production may commence.\nWe have informally discussed with ICS how we might move forward with our arrangements for placing a plant into production, but no new agreements have been reached, and we cannot assure that we will be able to negotiate mutually acceptable terms for proceeding.\nCommercialization Support Services\nWe intend to provide our commercial partners with business and technical support to help them build and equip a commercial production laboratory to use our cell-extraction and replication technologies and related proprietary equipment, processes, and medium formulations. Our technical support will include component planning related to a variety of matters, such as:\n·build-out requirements, including necessary leasehold improvements to support the operation of the licensed science production facility, utility requirements, equipment procurement and set-up, initial testing, plans, and permits;\n·regulatory compliance review of the licensed science;\n·staffing plans, including in-house sales, recommended qualifications for hiring a science officer and technical team members;\n·introduction to external consultant, engineer, compliance, shipping/packing, and distribution resources;\n·procurement and installation of proprietary bioreactors and all support equipment;\n·process training for:\noseed culture harvest from donor plants;\noseed culture growth cycle;\nocell growth cultivation filtration cycle;\nodrying equipment operation post-production processing options for the plant material;\noconcentrate plant material distillation process;\noinitial product harvest and packaging plant material handling;\noguidelines for internal and third-party laboratory testing contract review of services;\noguidelines for product to market options; and\n·consulting to utilize the product in regulated proprietary products.\nSources and Availability of Raw Materials\nCompletion and operation of a facility using our licensed technology to produce cannabinoids is dependent on the availability of standard biological laboratory equipment and supplies and the acquisition and operation of proprietary equipment. In some cases, existing available equipment must be significantly modified and customized to perform required tasks and procedures. Similarly, medium formulations have been developed from raw materials commercially available from multiple suppliers. Since early 2020, the efficacy testing has been materially and adversely impacted by the shortages or unavailability of equipment or supplies. We will continue to be subject to these shortages and delays as we continue the production and process engineering.\nOur commercialization of the cell-extraction and replication technology will require us to obtain raw materials for cell culture media that are mixed and packaged by third parties for sale to a sublicensee. We cannot predict whether commercial partners will be able to readily acquire or build the equipment or obtain the supplies necessary to construct and operate a commercial cannabinoid production without unusual costs or delays.\nPatents\nWe license the following patent applications under our Integrated License Agreement. We do not currently own any other intellectual property.\nPatents:\nApplication No.\nTitle\nFiling Date\nJurisdiction\n1717554.8\nA method of production of phytocannabinoids for use in medical treatments\n10/25/2017\nUnited Kingdom\n16/290,708(*)\nA method of production of phytocannabinoids for use in medical treatments\n3/1/2019\nUnited States\n*The United States Patent and Trademark Office approved and granted Patent US10477791 on November 19, 2019.\nPatents Cooperation Treaty Filing:\nApplication No.\nTitle\nFiling Date\nJurisdiction\n2018/077149\nA method of production of phytocannabinoids for use in medical treatments\n10/5/2018\nPCT\nThe protection of proprietary rights relating to our licensed cell-extraction and replication technology is critical for the business. We intend to file additional patent applications to protect certain technology and improvements considered important to the development of the licensed technology and our business. We also intend to rely upon trade secrets, know-how, continuing technological innovation and licensing opportunities, and a comprehensive and robust confidentiality and nondisclosure discipline.\nAlthough we intend to seek patent protection for additionally developed proprietary technology, the patent positions of our products are generally uncertain and involve complex legal and factual questions. Consequently, we do not know whether any current or possible future patent applications will result in the issuance of any patents or whether such patent applications will be circumvented or invalidated. We cannot assure that all U.S. patents that may pose a risk of infringement can or will be identified. In addition, although we do not believe that any patents or other proprietary rights that we license infringe upon the rights of third parties, there may be third parties that hold patents of which we are unaware. This includes competitors or potential competitors that may have filed applications for, or received, patents and obtained additional patents and proprietary rights relating to compounds or processes competitive with those covered under the Integrated License Agreement.\nWe could incur substantial legal and other costs to protect our proprietary rights against infringement by third parties. Similarly, we cannot assure that others may not assert infringement claims against us in the future, and we recognize that any such assertion may require us to incur legal and other defense costs, enter compromise royalty arrangements, or terminate the use of some technologies. Furthermore, we could face delays in obtaining licenses when we may have infringed on other patents and may encounter delays in product market introductions while attempting to design around conflicting intellectual property rights.\nWe rely on patented and unpatented trade secrets, and we cannot assure that we can meaningfully protect our rights to them or that others will not independently develop substantially equivalent proprietary information and techniques or otherwise gain access to or disclose our trade secrets and technology. We require confidentiality agreements to be executed in circumstances when our personnel, consultants, and advisors will have access to proprietary information. We cannot assure, however, that these agreements will provide meaningful protection against, or in the event of, unauthorized use or disclosure of such information. Further, disclosures of our proprietary information may enable others to challenge our process or facilitate reverse engineering important components of our technology.\nResearch and Development\nWe had no research and development expenditures during the fiscal years ended July 31, 2021 and 2020, and thereafter. Instead, we have benefitted from, and relied on, the research and development of affiliates.\nCannabis Industry\nAccording to trade journals, business news following the cannabis industry worldwide, and public company information available for Canadian companies and U.S. companies domiciling in Canada, the average industry reported (including both private and public companies) cost to grow cannabis flower and trim in an inside-grow facility in California is approximately $800 to $950 per pound, without capital expenses or taxes, and approximately $420 per pound in a typical California greenhouse grow. The end-product flower, before taxation, depending on the state and the strain, is selling for $1,200 a pound to over $4,000 a pound.\nWe believe that the combination of the licensed technology and processes could deliver a high-quality plant-derived material at costs below $250 per pound, including the license royalty payments to us in a commercially scaled laboratory, which we estimate is approximately one-third the capital expense cost of a comparable greenhouse grow facility.\nCompetition\nWe believe that competition in the commercial cannabinoid industry is based primarily on price per unit, predictable and replicable taste, aroma, and CBD or THC concentration, and compatibility with applicable regulatory requirements.\nCost is a function of both amortization of required capital costs and operating expenses. Based on the efficacy testing to date, we believe that capital costs for our cell-extraction and replication production facilities will compare favorably to capital costs required for a plant-based open-grow greenhouse or an inside-grow hydroponic production facility of similar capacity. Similarly, we project lower per-unit production operating costs for cell-replicated production than open-grow greenhouse or hydroponic production facilities. Our estimates are financial approximations of the economic effects derived during the efficacy testing, and we cannot assure their accuracy for scaled production.\nAnother principal competitive factor is the replicable and predictable ability of our cell-extraction and replication technology to produce cannabinoids with flavor, aroma, and CBD or THC concentration that accurately mirrors the source cells. A part of this quality consistence and assurance is that laboratory-produced cannabinoids are free of pests, blights, and varied flower potency harvests common to the current plant-based live-grow industry. Our planned production and process engineering will address assuring that the satisfactory test results achieved to date can be achieved in large-scale commercial production facilities.\nWe believe the value to potential commercial partners will be dependent on their ability to scale the application of the technology and trade secret processes in production laboratories at the same or lower capital and operating costs than approaches common to the industry for live-grow plants in outside, greenhouse, or hydroponic production.\nAs noted and discussed in greater detail below under Government Approvals and Regulation in the U.S. Cannabis Industry, we anticipate that our ability to enter commercialization arrangements will face competition from sponsors of live-grow plant production facilities that are more directly and predictably regulated than plant cell-extraction and replication technologies like we use. The need for us and our prospective commercial partners to coordinate regulatory licenses and compliance for our nontraditional production approach may result in delays and regulatory unpredictability that may adversely affect our commercialization efforts. Therefore, to support our commercialization program, we expect that we will need to initiate efforts to obtain any required special clearances from state licensing authorities for our production processes as well as provide continued support to our commercial partners.\nWe consider anyone producing THC and CBD to be both a prospect for commercializing our licensed science as well as a competitor for any prospective commercialization arrangement. We believe principal competitors for our plant-based process are the synthetic producers, such as Ginko and many others, as well as traditional greenhouse production methods, which claim lower capital costs and higher quality than warehouse grown cannabis. MedMen, for example, enjoys the advantages of established production capabilities. MedMen, headquartered in Culver City, California, is engaged in the clone-to-production cannabis business with operations for cultivation and retail paired in California and eight other U.S. states. These companies have been in the market for many years and have significant resources and established market share. There are a growing number of new entrants of various sizes into the cannabis growing industry that, together with the industry leaders, present a large, diversified, well-funded, and capably managed array of competitors with capital investments in competing cultivation processes. Many of the firms with which our commercial partners will compete have large financial and management resources and established positive industry reputations, distribution channels, customer relationships, operating histories, and reputations. We cannot assure that our licensed science will be able to compete effectively.\nGovernment Approvals and Regulation in the U.S. Cannabis Industry\nLegislation and Interpretation\nThirty-three states and the District of Columbia currently have laws broadly legalizing cannabis in some form for either medicinal or recreational use. However, cannabis is a Schedule I drug under the Controlled Substances Act of 1970, or CSA, and is therefore illegal under federal law. The U.S. Supreme Court has ruled that the federal government has the right to regulate and criminalize the sale, possession, and use of cannabis, even for medical purposes. Thus, even where cannabis has been legalized under state law, its use, possession, or cultivation remains a violation of federal law.\nThe U.S. Department of Justice, or DOJ, stated that Schedule I controlled substances are the most dangerous drugs with potentially severe psychological or physical dependence. If the federal government decides to enforce the CSA, those charged with distributing, possessing with intent to distribute, or growing cannabis could be subject to fines of up to $50,000,000 or prison sentences up to life, even if they comply with state law. Further, individuals and entities may violate federal law if they intentionally aid and abet another violator or conspire to do so.\nWe have not requested or obtained any opinion of counsel or authority ruling to determine whether our operations comply with any state or federal laws or if we are assisting others to violate said laws. If our operations are deemed to violate any state or federal laws or if we are deemed to be assisting others in violating said laws, any resulting liability could cause us to modify or cease our operations until we are able to comply with applicable requirements.\nIn the light of the conflict between federal and state cannabis laws, in August 2013, under the Obama administration, DOJ Deputy Attorney General James M. Cole issued the Cole Memorandum to U.S. Attorneys providing guidance concerning marijuana enforcement under the CSA. It effectively stated it was not an efficient use of federal resources to direct federal law enforcement agencies to prosecute individuals following state laws that allow medical cannabis. The Cole Memorandum stated that, when states have implemented strong and effective regulatory and enforcement systems to control the cultivation, distribution, sale, and possession of cannabis, conduct in compliance with those laws is less likely to threaten federal priorities, and that state and local law enforcement and regulatory bodies should remain the primary means of addressing cannabis-related activity.\nIn January 2018, under the Trump administration, the DOJ issued a policy memorandum on federal marijuana enforcement announcing a return to the rule of law and rescinding previous guidance documents, including the Cole Memorandum. In this memorandum, Attorney General Jeff Sessions directed U.S. Attorneys to determine whether to pursue prosecution of cannabis activity based upon the seriousness of the crime, the deterrent effect of criminal prosecution, and the cumulative impact of crimes on the community. The DOJ claimed this action was a return of trust and local control to federal prosecutors who knew where and how to deploy federal resources most effectively to reduce violent crime, stem the tide of the drug crisis, and dismantle criminal gangs. Mr. Sessions reiterated that the cultivation, distribution, and possession of marijuana continued to be a crime under the CSA, that it was the DOJs mission to enforce the laws of the United States, and that all U.S. Attorneys should use previously established prosecutorial principles to disrupt criminal organizations, tackle the growing drug crisis, and thwart violent crime across our country. Notwithstanding the change in guidance, year-end reports on the federal judiciary indicated that federal marijuana prosecutions dropped in both 2018 and 2019, even as the total number of defendants charged with drug crimes increased.\nOn March 11, 2021, Merrick Garland was sworn in as the new U.S. Attorney General. During his campaign, President Biden stated a policy goal to decriminalize possession of cannabis at the federal level, but he has not publicly supported the full legalization of cannabis. During his February 2021 congressional testimony, Mr. Garland stated that he would reinstitute a version of the Cole Memorandum. In his written responses to the Senate Judiciary Committee, he reiterated the statement that the DOJ under his leadership would not pursue cases against Americans complying with the laws in states that have legalized and are effectively regulating marijuana. It is not yet known whether the DOJ under President Biden and Attorney General Garland will readopt the Cole Memorandum or announce a substantive marijuana enforcement policy. Mr. Garland indicated at a confirmation hearing before the United States Senate that it did not seem to him to be a useful use of limited resources to pursue prosecutions in states that have legalized and that are regulating the use of marijuana, either medically or otherwise. It is unclear what impact, if any, the new administration will have on U.S. federal government enforcement policy on cannabis. Nevertheless, the DOJ could decide to strongly enforce the federal laws applicable to cannabis, causing us significant or irreparable financial damage.\nCongress possesses broad authority to change the status of cannabis under the CSA and related federal laws. In each budget cycle since 2014, Congress has passed an appropriations rider known as the Rohrabacher-Farr Amendment, barring the DOJ from using taxpayer funds to prevent states from implementing their own laws that authorize the use, distribution, possession, or cultivation of medical marijuana. Because the DOJ memorandums serve as discretionary agency guidance and do not constitute a force of law, cannabis-related businesses have worked to continually renew the Rohrabacher-Farr Amendment that has been included in federal annual spending bills since 2014. This amendment does not change the legal status of cannabis, prevent criminal liability, or effect recreational marijuana. It must be renewed each fiscal year to remain in effect, and if Congress repealed the rider, the DOJ could prosecute CSA violations retroactively while the rider was in effect. The U.S. Court of Appeals for the Ninth Circuit held in 2016 that the Rohrabacher-Blumenauer Amendment, or Rohrabacher-Farr Amendment, also prohibits the DOJ from spending funds from other relevant appropriations acts to prosecute individuals who engage in conduct permitted by state medical-use cannabis laws and who strictly comply with said state laws. This opinion applies only to states within the Ninth Circuit in the western United States.\nOn March 15, 2022, the amendment was renewed through the signing of the fiscal year 2022 omnibus spending bill and will be effective through September 30, 2022. Notably, the Rohrabacher-Farr Amendment has applied only to medical marijuana programs and has not provided the same protections to enforcement against adult-use activities. If the Rohrabacher-Farr Amendment is no longer in effect, the risk of federal enforcement and override of state marijuana laws would increase.\nUnder the 2018 Agriculture Improvement Act, hemp, a member of the cannabis family, is no longer considered a Schedule I controlled substance under the CSA if it contains less than 0.3 percent THC. Hemp cultivation is now broadly permitted. It is unknown, however, if other cannabis derivatives will be federally legalized.\nIf the federal government were to strictly enforce federal law regarding cannabis and its chemically active compounds, we would likely be unable to execute our business plan. Even if our activities do not interfere with any of the enforcement priorities of the DOJ, we could be deemed to violate federal law and be unable to conduct our business.\nLocal and state regulatory regimes generally prohibit cannabinoid-related activities that are not specifically permitted and frequently address only plant live-grow production. We will need to analyze each individual states regulations and collaborate with authorities to adapt regulatory regimes to our plant cell-extraction and replication technology. Some jurisdictions may need to amend or revise their statutes and regulations or revise their administrative and enforcement policies to accommodate our production technologies, and we may need to obtain special clearances from state licensing authorities for our plant cell-extraction and replication processes on behalf of commercial partners. We cannot predict whether or how we can meet any state requirements or the time that might be required to do so.\nFinancial Transactions and Future Laws\nFinancial transactions involving cannabis-related proceeds may trigger prosecution under federal money laundering statutes, unlicensed money transmitter statutes, and the U.S. Bank Secrecy Act, or BSA. The penalties for violations of these laws include imprisonment, substantial fines, and forfeiture. With the uncertainty surrounding the Cole Memorandum, the risk remains that federal law enforcement authorities could seek to pursue money laundering charges against entities or individuals engaged in supporting the cannabis industry.\nIn response to the Cole Memorandum, in February 2014, the Financial Crimes Enforcement Network, a division of the U.S. Department of the Treasury, issued guidance regarding how financial institutions can provide services to cannabis-related businesses consistent with their obligations under the BSA. In August 2014, the DOJ further directed federal prosecutors to consider the federal enforcement priorities in the Cole Memorandum when determining whether to charge institutions or individuals with financial crimes based upon cannabis-related activity. Nevertheless, banks remain hesitant to offer banking services to cannabis-related businesses. Thus, it is difficult for businesses in the cannabis industry to establish banking relationships. Although we do not produce, transport, or sell cannabis or its products, financial institutions may refuse to do business with us based on their conclusion that our activities are intertwined with the cannabis industry. Our inability to maintain our current bank accounts would\nmake it difficult for us to operate our business, increase our operating costs, and pose additional operational, logistical, and security challenges that could result in our inability to implement our business plan.\nThe BSA requires us to report currency transactions over $10,000 to the IRS, including identification of customers by name and tax identification number. The BSA also requires us to report certain suspicious activity, including any transaction over $5,000 that we suspect may involve funds from illegal activity or is designed to evade federal regulations or reporting requirements, and to verify sources of funds. Substantial penalties can be imposed against us if we fail to comply with this regulation, which could have a material adverse effect on our business, financial condition, and results of operations. These BSA requirements may adversely affect us because many of the firms with which we may do business rely on cash transactions because of their inability to establish regular banking relationships.\nFederal prosecutors have significant discretion, and we cannot ensure that federal prosecutors in the judicial districts in which we operate will not choose to strictly enforce federal cannabis laws. Any change in the federal governments enforcement posture respecting state-licensed cultivation of cannabis or its chemical components, including the postures of individual federal prosecutors, may result in our inability to execute our business plan, and we would likely suffer significant losses, which would adversely affect the value of our securities.\nShould the federal government legalize cannabis for medical use, it is possible that the U.S. Food and Drug Administration, or FDA, would seek to regulate it under the Food, Drug and Cosmetics Act of 1938. Additionally, the FDA may issue rules and regulations, including requirements to use certified good manufacturing practices related to the growth, cultivation, harvesting, and processing of medical cannabis. Clinical trials may be needed to verify efficacy and safety. It is also possible that the FDA would require that facilities where medical cannabis is grown be registered with the FDA and comply with certain federally prescribed regulations. If these regulations were imposed, we do not know what the impact would be on the cannabis industry generally and on us specifically and what costs, requirements, and prohibitions may be enforced. If our commercial partners are unable to comply with the regulations or registration as prescribed by the FDA, they may be unable to continue to operate their businesses in the U.S. markets.\nThe U.S. House of Representatives has passed the Secure and Fair Enforcement Act (the SAFE Banking Act) six times, most recently in February 2022 as an amendment to the America COMPETES Act. Previously, the SAFE Banking Act, as a standalone bill, passed the House by a vote of 321 to 101 on April 19, 2021, with 106 Republicans voting in support. This bill is currently sitting within the Senates Committee on Banking, Housing and Urban Affairs awaiting consideration. Should the SAFE Banking Act pass, it will alleviate many of the financial institutions concerns regarding transacting with cannabis-related businesses by providing several protective measures, including generally:\n·prohibiting federal banking regulators from restricting, penalizing, or discouraging a financial institution or depository institution from providing banking services to a legitimate cannabis-related business;\n·establishing that transactions involving proceeds from legitimate cannabis-related businesses are not considered proceeds of unlawful activities and, thus, not within the purview of anti-money laundering regulations;\n·establishing that depository institutions are not, under federal law, liable or subject to asset forfeiture for providing loans or other financial services to legitimate cannabis-related businesses;\n·prohibiting a federal banking regulator from requesting or ordering a depository institution to terminate its customer relationship with a protected cannabis-related business unless the agency has a legitimate reason not based on reputational risk; and\n·amending the reporting requirements for Suspicious Activity Reports, or SARs, and requiring the Financial Crimes Enforcement Network to issue guidance on transactions related to cannabis-related businesses that is consistent with the purpose and intent of the SAFE Banking Act and does not significantly inhibit the provision of financial services to said businesses.\nThe SAFE Banking Act would extend protection to legitimate hemp-related businesses, including CBD businesses. It also requires federal bank regulators to issue annual reports to Congress with: (1) data on availability of access to financial services for minority-owned and women-owned legitimate cannabis-related businesses; and (2) recommendations to further help such businesses access financial services.\nIf passed, the SAFE Banking Act could pave a path forward for cannabis-related businesses to have ready access to crucial banking and financial services, with federally backed financial institutions being able to work with cannabis companies without fear of incrimination, federal prosecution, and regulatory penalties.\nLocal and state marijuana laws and regulations are broad in scope and subject to evolving interpretations, which could require us or our commercial partners to incur substantial costs associated with compliance or altering our business plan. Allegations or findings that we have violated these laws could disrupt our business and result in a material adverse effect on our operations. In addition, future regulations may be enacted that are directly applicable to our proposed business. We cannot predict the nature of any future laws, regulations, interpretations, or applications, nor can we determine what effect they may have on our business.\nState Border Regulation\nFederal law states that cannabis and cannabis products may not be transported across state lines in the United States. As a result, all cannabis consumed in a state must be grown and produced in that same state. To meet this limitation, we intend to enter into commercialization arrangements with third parties that are restricted on a state-by-state basis. Typical cannabis growers cannot import or export crop across state lines to meet product demands. Therefore, excess production capacity in any given state that is not matched by increased demand in that state could exert downward pressure on the retail price for the products. A large number of retail licenses authorized by authorities in any given state could result in increased competition and exert downward pressure on the retail price for cannabinoid products our commercial partners sell.\nWe initially intend to concentrate our commercialization efforts in the United States. We believe that the value of a potential commercialization of our technology in Canada may be materially lower than in the balance of our territory due to product oversupply and excess production capacity.\nTax Concerns\nAn additional challenge to cannabis-related businesses is that the provisions of Internal Revenue Code Section 280E are being applied by the U.S. Internal Revenue Service to businesses operating in the medical and adult-use cannabis industry. Section 280E prohibits cannabis businesses from deducting their ordinary and necessary business expenses, forcing them to pay higher effective federal tax rates than similar companies in other industries. The effective tax rate on a cannabis business depends on how large its ratio of nondeductible expenses is to its total revenues. Therefore, businesses in the legal cannabis industry may be less profitable than they would otherwise be.\nOverall, the U.S. federal government has specifically reserved the right to enforce federal law regarding the sale and disbursement of medical or adult-use marijuana even if such sale and disbursement is sanctioned by state law. Accordingly, there are several significant risks associated with our business and unless and until the United States Congress amends the CSA respecting medical and/or adult-use cannabis (and we cannot assure the timing or scope of any such potential amendments), there is a significant risk that federal authorities may enforce current federal law, our business may be deemed to be producing, cultivating, extracting, or dispensing cannabis or aiding or abetting or otherwise engaging in a conspiracy to commit such acts in violation of federal law in the United States. We do not intend to produce, transport, market, or sell cannabis products. We are not aware of enforcement determinations or policies under Section 280E targeting software companies, fertilizer companies, greenhouse companies, or similar businesses that provide goods or services to companies that do produce, transport, market, or sell cannabis products.\nIn the future we may separate components of our business under different subsidiaries in an effort to compartmentalize liability, but we cannot assure that such a strategy will be successful.\nCosts and Effects of Compliance with Environmental Laws\nWe do not anticipate that our business activities or future business activities will subject us to any environmental compliance regulations. However, our commercial partners may be subject to environmental regulation in the various jurisdictions in which they operate. These regulations mandate, among other things, the maintenance of air and water quality standards and land reclamation. They also set forth limitations on the generation, transportation, storage, and disposal of solid and hazardous waste. The processes and medium formulations that are parts of our licensed technology must be applied, used, and discarded in accordance with these requirements. Environmental legislation is evolving in a manner that will require stricter standards and enforcement, increased fines and penalties for noncompliance, more stringent environmental assessments of proposed projects, and a heightened degree of responsibility for companies and their officers, directors, and employees. We cannot assure that future changes in environmental regulation, if any, will not adversely affect the operations of a commercial partner, which in turn will affect our operations. To address or mitigate environmental compliance concerns, our licensed technology process recycles water, does not use pesticides, and uses compact space.\nGovernment approvals and permits are currently and may in the future be required in connection with the operations of our commercial partners. To the extent such approvals are required and not obtained, our commercial partners may be curtailed or prohibited from production of adult-use or medical cannabis-related products, delaying the development of our operations as currently proposed.\nFailure to comply with applicable environmental laws and regulations could subject our commercial partners to regulatory or agency proceedings or investigations and may result in enforcement actions thereunder, including orders issued by regulatory or judicial authorities causing operations to cease or be curtailed, and may include damage awards, fines, penalties, or corrective measures requiring capital expenditures or remedial actions. Our commercial partners may be required to compensate those suffering loss or damage by reason of their operations using our technology, and civil or criminal fines or penalties may be imposed for violations of applicable laws or regulations.\nEmployees\nAs of the date of this prospectus, we have three employees, which include, Aristotle Popolizio, our Vice President and Secretary, and who is also a director, Juan Carlos Garcia La Sienra Garcia, our Chief Financial Officer, and Michael Hawthorne, our Deputy Chief Executive Officer. We intend to hire additional personnel as we undertake additional laboratory work and launch our commercialization efforts. A significant amount of competition still exists for skilled personnel in the medical cannabis-related industry. Nevertheless, we expect to be able to attract and retain additional employees as necessary, commensurate with the anticipated future expansion of our business. Further, we expect to continue to use consultants, contract labor, attorneys, and accountants as necessary.\nKey Consultants\nWe rely on consultants to provide key technical services in connection with our current laboratory efforts respecting our licensed technology. Key current consultants include:\n·Mitch Kahn assists with our technology commercialization effort and long-term strategic planning, based on his experience as a co-founder and chief executive officer of Grassroots Cannabis, which was purchased by Curaleaf Holdings in 2020.\n·Chris Ganan assists with our technology commercialization effort and long-term strategic planning, based on his experience as chief strategy officer of Medmen Enterprises Inc.\n·Donald Clark is responsible for regulatory compliance and the rollout of full-scale production plants. He has gained regulatory approval for our Research and Development process in California and is working to do the same in other states.\n·David Slomczynski, PhD, has over 20 years post-doctoral experience in the fermentation and cell culture fields. He is an expert in analysis and experimental design. Dr. Slomczynski initiates and manages cultures and assists with improving our production process.\n·Damien Solomon has substantial cannabis industry plant experience and is advising us regarding product quality and design to meet market trends.\n·Sean Akhavan has substantial experience as a chemist in the cannabis industry. He works on product design and quality. He is also an experienced project manager and overseas the management of our research projects.\nEach of our consultants has obligations in addition to providing services to us and devotes such time to our company as we may mutually agree.\nOur Organization\nWe were organized in Nevada on April 24, 2008, under the name Planet Resources, Corp., to reprocess mine tailings from previous mining operations. We were not successful in implementing this business plan. Previous management considered various alternatives to ensure our viability and solvency, but those efforts were unsuccessful, and we had no activities between April 2011 and June 2018. To revive our company, a receiver was appointed in a Nevada state court proceeding in August 2015. We were released from receivership in July 2018.\nOn May 15, 2018, we privately sold 335,000 shares of restricted common stock, which constituted about 56% of our issued common stock, at $1.00 per share to OZ Corporation for consulting services. We subsequently appointed new management and directors. Further, on August 8, 2018, we issued four shares of newly authorized Series A Preferred stock to OZ Corporation in consideration of consulting services. On November 6, 2020, the four shares of Series A Preferred stock were transferred to Cell Science. The Series A Preferred Stock has super voting rights that enable the holder to control the election of our board of directors and, ultimately, our direction.\nFollowing the above change in control, we embarked on a new business plan to license and commercialize cell-extraction and replication technologies, primarily for medical products for pain relief and insomnia. These efforts lead to our initial license agreement with Cell Science in December 2018. As discussed in this prospectus, that original license agreement has since been amended and revised as the Integrated License Agreement. ITEM 1A. RISK FACTORS\nInvestment in our common stock involves significant risk. You should carefully consider the information described in the following risk factors, together with the other information appearing elsewhere in this report, before making an investment decision regarding our common stock. If any of the events or circumstances described in these risks factors occur, our business, financial conditions, results of operations, and future growth prospects would likely be materially and adversely affected. In these circumstances, the market price of our common stock could decline, and you may lose all or a part of your investment in our common stock.\nRisks Related to Ukrainian Crises\nRussias recent military intervention in Ukraine and the international communitys response have created substantial political and economic disruption, uncertainty, and risk.\nRussias military intervention in Ukraine in late February 2022, Ukraines widespread resistance, and the NATO led and United States coordinated economic, financial, communications, and other sanctions imposed by other countries have created significant political and economic world uncertainty and contributed to worldwide inflation. There is significant risk of expanded military confrontation between Russia and other countries, possibly including the United States. Current and likely additional international sanctions against Russia may contribute to higher costs, particularly for petroleum-based products. These and related actions, responses, and consequences that cannot now be predicted or controlled may contribute to worldwide economic reversals and inflation. In these circumstances, our efforts to commercialize our technology may be delayed or otherwise negatively impacted.\nRisks Related to our Business\nOur entire business relies on the commercial-scale validation of our licensed cell-extraction and replication technology.\nOur ability to exploit our licensed cell-extraction and replication technology for the commercial production of cannabinoids through joint ventures, strategic partners, and sublicenses is conditional on satisfactory completion of ongoing process and product refinement and customization, which has not been funded. We cannot predict when or whether we will obtain necessary funding or complete our planned work. We cannot assure that the substantive results of our planned efforts will be accepted by prospective commercial partners. Our commercialization efforts will be dependent on our ability to convince prospective commercial partners that our licensed cell-extraction and replication technology warrants the required commitment of capital, expertise, and other resources in the face of related risks, regulatory hurdles, and competitive factors. Even after a successful completion of planned process and product refinement and customization, there will initially be no established commercially operating facility using this technology successfully to support our commercialization efforts. We cannot assure that any initial costs we incur will be recovered.\nWe cannot accurately predict when planned further work on our licensed technology will be completed satisfactorily.\nWe cannot accurately predict when the planned further work related to our licensed technology, which we believe will accelerate our commercialization efforts, can be funded or completed. Any delay in obtaining required funding or completing the planned work could postpone the commencement of our commercialization efforts and our potential for revenue. Our planned laboratory work will require substantial financial, technical, and management resources that have not been arranged, so we cannot predict whether or when the required work will be completed. We expect that the foregoing will require us to obtain additional capital, which we cannot assure that we will be able to obtain on acceptable terms or at all. If required financing and planned work cannot be completed timely, we may have to abandon efforts involving the cell-extraction and replication technology for cannabinoid production and seek other business opportunities or suspend operations. Consequently, we would be unable to recover previous costs related to these abandoned activities. We have no other technology or know-how to exploit commercially.\nOur licensed proprietary cannabinoid production technology has only been tested on a limited basis by related parties without qualified third-party replication.\nTo date the propriety technology that we have licensed has only been tested on a limited basis by our affiliates, Cell Science, which is also the licensor, and OZ Corporation, both of which benefit from favorable test results. Further, the testing was conducted by or under the supervision of Dr. Peter Whitton, the inventor of the licensed technology and our director, who will benefit substantially from the successful test that triggered the release of a large block of our common stock and a one-time payment required under the license agreement under which we acquired our rights. No qualified third party has independently replicated the entire process, results, processes, or procedures. Accordingly, we expect that prospective third-party investors, commercialization partners, investment bankers, and others will want to conduct their own independent tests to confirm the test results to date before transacting business with us. This requirement that potential commercial partners or others commit their own financial, technical, and management efforts to confirm the efficacy, reliability, and predictability of the proprietary technology may be a substantial barrier to commercialization.\nOur license from Cell Science may be terminated if we fail to meet certain covenants, which could adversely affect our commercialization program.\nUnder the Integrated License Agreement through which we were granted our License, we remain obligated to pay certain patent prosecution and other intellectual property protection costs that could be substantial. We do not plan to establish or maintain any deposits or reserves to pay these costs. If we fail to meet these obligations, Cell Science could terminate our license. Under our Integrated License Agreement, Cell Science would then have the right to assume our position in any outstanding commercialization arrangements. If Cell Science assumes outstanding obligations, it would step into our position as commercial partner or sublicensee, precluding us from participating in further revenue from that relationship, notwithstanding our potential continuing liability for our obligations to commercial partners, or from further commercialization efforts. The possibility that Cell Science, a\nforeign entity, may assume our obligations to our commercial partners may be a risk to them that may have a material adverse effect on our commercialization efforts. If Cell Science refuses to assume our obligations under our commercialization arrangements, the rights of our commercial partners may be subject to dispute, which would likely result in claims for damages that our commercial partners would seek to recover from us. The existence of the right of Cell Science to terminate our license on which our commercialization arrangements will be based may be considered a substantial risk to potential commercial partners and correspondingly impair the success of our commercialization efforts.\nWe are obligated to pay Cell Science a one-time payment of $3.5 million.\nWe are required to pay Cell Science a one-time payment under a one-year note for $3.5 million due in January 2023. We currently do not have funds with which to pay this amount and have not arranged or obtained commitments for such funding from any source. Potential new providers of financing to the company may preclude or limit such payment from fresh funds.\nOur ability to attract and enter joint ventures, strategic alliances, or sublicenses with producers, distributors, and sellers is uncertain.\nWe will need to identify and attract qualified, interested third parties to commercialize our cell-extraction and replication technology for cannabinoid production. We cannot assure that we will be able to successfully enter any commercialization arrangement. We estimate that a new facility designed to produce about 5,000 pounds of dry plant-derived material per month using our licensed technology will require a capital investment of from $3.9 million to $4.6 million. We expect to encounter third-party reluctance to commit substantial capital to use our technology, which will at least initially be commercially untried by others. Accordingly, we cannot predict when or the pace at which we may be able to enter commercial arrangements to generate revenue. We may be forced to delay planned commercialization efforts, seek other commercialization strategies, or obtain additional capital to continue.\nWe cannot assure that we will be able to transfer the required technical know-how respecting our licensed technology to enable commercial partners to commercially produce cannabinoids.\nOur licensed cell-extraction and replication technology for cannabinoid production is relatively sophisticated and complex and requires scientific expertise in sterile production facility plant construction and operation, particularly as compared to traditional open-grown, greenhouse, or hydroponic production. We cannot assure that the licensed technology transfer and consulting strategies we plan to develop and use will enable our potential commercial partners to produce cannabinoids reliably, economically, and competitively.\nOur long-term success will depend on the profitability of our commercialization arrangements, which we cannot control or predict.\nOur long-term success will depend on the success of our future commercial partners and their ability to construct and operate commercial cannabinoid production facilities, market their products competitively, and achieve an overall, sustainable profit. The degree of commercial success and profitability of our commercial partners will affect our success in attracting additional commercial partners and the economic terms of our third-party arrangements. We cannot assure that our commercial partners will be successful, which may incentivize us to adjust the terms of our existing or new arrangements to include terms less favorable to us.\nOthers may challenge the validity and enforceability of the licensed patents, trade secrets, and related intellectual property.\nOur future success is dependent on the validity and enforceability of our licensed patents, trade secrets, intellectual property, and related rights. Unauthorized parties may attempt to replicate or otherwise obtain and use the licensed intellectual property granted to us. Policing the unauthorized use of our current or future rights to patents, trade secrets, intellectual property, or licensed rights and enforcing these rights against unauthorized use by others could be difficult, expensive, time-consuming, and unpredictable. Identifying unauthorized use of these rights is difficult because we may be unable to effectively monitor and evaluate whether products being distributed by our competitors were made using our technology, including parties such as unlicensed producers. In addition, in any infringement proceeding, some or all our trademarks, patents, other intellectual property rights, licensed rights, trade\nsecrets or other proprietary know-how, or arrangements or agreements that we are seeking to protect may be found invalid, unenforceable, anticompetitive, or not infringed. An adverse result in any litigation or defense proceeding could put one or more of our trademarks, patents, other intellectual property, or licensed rights at risk of being invalidated or interpreted narrowly and could put existing intellectual property applications for patent protection at risk of not being issued. Any or all of these events could materially and adversely affect our business, financial condition, and results of operations.\nIn addition, other parties may claim that our products infringe on their proprietary and perhaps patent-protected rights. Such claims, whether meritorious or not, may subject us to significant financial and managerial costs and expenses, legal fees, injunctions, temporary restraining orders, or an award of damages. We may need to obtain licenses from third parties that allege that we have infringed on their lawful rights, which may not be available on terms acceptable to us or at all. In addition, we may not be able to use or obtain licenses or other rights for intellectual property that we do not own on terms that are favorable to us or at all.\nUnder our Integrated License Agreement with Cell Science, we are obligated to defend the licensed technology against third-party infringement. Therefore, we may be obligated to incur substantial legal, expert witness, and related litigation costs in any litigation that may be involved, whether initiated by us or a third party. We cannot assure that we would be able to recover any costs incurred by us.\nThe markets for cannabinoid products may not grow at the rate projected by industry market data or at all.\nWe partially base our long-term business model on the anticipated growing demand for cannabis and cannabis-related products in North America, particularly in the United States, because of regulatory liberalization and growing social acceptance and use. We cannot assure that our projections, based on numerous assumptions and projected effects of future events, will materialize. Limitations or slowness in the increase of demand for cannabis and cannabis-related products in the United States would also limit our possible growth. We cannot predict the extent to which some reported local market saturation may affect us.\nConsumers may consider our licensed technology will result in a genetically modified organism.\nSome consumers may consider our laboratory plant-derived cell production method constitutes genetic modification and resist acceptance of cannabinoids produced by commercial partners.\nSubsequent clinical or laboratory research on the characteristics of cannabinoids or their effects could adversely affect public attitudes and consumer perception towards cannabinoids and, ultimately, the commercialization of our licensed technology.\nA variety of institutions worldwide are continuing clinical and laboratory research of the use and effects of cannabinoids. Research in the United States and internationally regarding the medical benefits, viability, safety, efficacy, and dosing of cannabis or isolated cannabinoids such as CBD and THC remains in relatively early stages. Future research, studies, and clinical trials may lead to conclusions that dispute or conflict with the current general understanding and belief regarding the medical or recreational benefits, viability, safety, efficacy, dosing, and social acceptance of cannabinoids and the demand for the products produced by our commercial partners.\nWe believe the cannabinoid industry is highly dependent upon consumer perception regarding the safety, efficacy, and quality of cannabis and related products distributed to consumers. Consumer perception of the products produced by commercial partners using our licensed technology can be significantly influenced by scientific research or findings, regulatory investigations, litigation, media attention, informal social media exchanges, and other publicity regarding the consumption or use of cannabinoid products. We cannot assure that future scientific research, reports, findings, regulatory proceedings, litigation, media attention, or other publicity will be favorable to the cannabis market or products or consistent with earlier publicity. Future research reports, findings, regulatory proceedings, litigation, media attention, informal social media exchanges, or other publicity that is perceived as less favorable than, or that questions, earlier research reports, findings, or publicity could have a material adverse effect on the demand for use of the licensed technology and consequently, our business, results of operations, financial condition, and cash flows. Negative publicity or public opinion may adversely affect consumer demand for cannabinoids produced and sold by our commercial partners, which would also adversely affect our ability to establish new commercial relationships that generate royalty revenues from commercial partners or sublicensees. In\nturn, these adverse effects would have an adverse impact on our business, results of operations, financial condition, and cash flows.\nUnfavorable publicity or other media attention regarding the safety, efficacy, and quality of cannabis and related products produced using the licensed technology or associating the consumption of cannabis or related products with illness or other negative effects or events could also have such a material adverse effect. Negative publicity or other media attention could arise even if the adverse effects associated with such products resulted from a commercial partners failure to use the licensed technology correctly or a consumers failure to consume or use the products appropriately or as directed. The increased usage of social media and other web-based tools to generate, publish, and discuss user-generated content and to connect with other users has made it significantly easier for individuals and groups to communicate and share opinions and views about us, our activities, or our licensed technology, whether true or not. Although we intend to operate in a manner that will be respectful to all stakeholders and protect our image and reputation, we will not be able to control how we are perceived by others. Reputational loss may result in decreased investor confidence, increased challenges in developing and maintaining community relations, and impediment to our overall ability to advance our projects, thereby having a material adverse effect on our financial performance, financial condition, cash flows, and growth prospects.\nThird parties may refuse to do business with us if they perceive that we are too closely connected to the cannabis industry.\nAlthough we do not cultivate, produce, manufacture, or sell cannabis-derived products, some firms with which we may want to transact business may find the cannabis industry generally objectionable or determine that they are exposed to reputational risk because they perceive that we are too closely connected to the cannabis industry. As a result, these firms may refuse to deal with us. Failure to establish or maintain business relationships in general could have a material adverse effect on us.\nOur connection to the retail cannabis industry may impair our access to the large and lucrative pharmaceutical/biotechnology sector in due course.\nSecurities broker-dealers, clearing firms, and others in the financial services industry may refuse to handle securities transactions in our stock because of our connections with the cannabis industry.\nRisks Related to Significant Regulation\nThe activities of our potential commercial partners are highly regulated by extensive and complex federal and state regulatory regimes that make maintaining compliance difficult and challenging.\nThe commercial cannabis industry is a relatively new industry, and we anticipate that regulations will constantly be changing as the federal government and each state monitors the applicable regulatory regime and commercial activity. Our commercial partners will be subject to a variety of laws, regulations, and guidelines relating to the production, manufacturing, management, transportation, disposal, storage, distribution, sales, use, health, and safety of cannabis and derived products and byproducts as well as laws and regulations relating to drugs, controlled substances, health, and safety. In addition, publicly held cannabinoid producers may be subject to other federal and state securities laws and the rules and regulations of self-regulatory organizations such as the exchanges on which their securities are traded.\nLaws, regulations, and guidelines generally applicable to the cannabis industry domestically and internationally may change in unforeseen ways. New laws and changes to existing laws or regulatory regimes may adversely affect our commercial partners directly and us indirectly. Regulatory changes could reduce demand for cannabis-derived products and byproducts, which would decrease the potential success of our commercialization efforts, the profitability of potential strategic partners or sublicensees, and the potential for revenue to us, which would adversely affect our financial condition, results of operations, and prospects.\nAmendments to current laws, regulations, and permitting requirements, or more stringent application of existing laws or regulations, may have a material adverse effect on our commercial partners or us and our business, resulting in increased capital expenditures or production costs, reduced levels of production, or abandonment or delays in the development of facilities.\nOur ability to commercialize our technology will depend on the compatibility of our plant cell-extraction and replication technology with current regulatory regimes designed to regulate live-grow plant production and the predictability of the nature and extent of further regulation. Further, our business will depend on the ability of our commercial partners to maintain compliance with these laws, regulations, and interpretative and enforcement policies. Delays by our commercial partners in obtaining or failing to obtain and maintain the requisite regulatory approvals may significantly delay or negatively impair our commercialization program.\nWe may incur ongoing costs and obligations related to regulatory compliance or assisting our commercial partners in their regulatory compliance. Failure to comply with applicable laws and regulations could result in regulatory or agency proceedings, investigations, and enforcement actions, including orders causing operations to cease or be curtailed and levying damage awards, fines, penalties, or corrective measures, all of which would require unanticipated capital expenditures or remedial actions. Parties may be liable for civil or criminal fines or penalties imposed for violations of applicable laws or regulations. The outcome of any regulatory or agency proceedings, investigations, audits, and enforcement actions could harm our commercial partners directly and us indirectly.\nWe are subject to various state regulations governing the production, transportation, and sale of cannabinoids generally that can severely restrict our ability to execute our business plan.\nStates that permit the production, transportation, and sale of cannabinoids for either medicinal or recreational purposes have adopted a comprehensive regulatory and taxation regime. The state regulations generally impose stringent record keeping, compliance, reporting, and taxation requirements. State enforcement of applicable laws, regulations, and administrative policies can result in sanctions, fines, license termination and other sanctions against companies producing, transporting, or selling cannabinoids, State compliance requirements will directly apply to our strategic partners and will indirectly require us to adopt compatible policies and practices.\nWe cannot assure that state and local regulatory regimes will accommodate our plant cell-extraction and replication cannabinoid production technology.\nWe cannot assure that state and local cannabinoid regulatory regimes that are based on plant live-grow production are compatible with our plant cell-extraction and replication technology. We anticipate that we will need to address the regulatory regimes in each state and local jurisdiction to assure that it is compatible with and will accommodate our plant cell-extraction and replication production technology. Further, we cannot assure that any necessary changes in laws, regulations, or administrative policies or interpretations will be adopted or implemented. Accordingly, we may be limited in or prohibited from establishing commercial partners in certain states.\nStrict enforcement of federal laws regarding cannabis would likely severely restrict our ability to execute our business plan.\nIn the United States, cannabis is largely regulated at the state level. Currently, in the United States, 37 states, the District of Columbia, Puerto Rico, Guam, and the U.S. Virgin Islands have legalized medical cannabis, and 18 states, in addition to the District of Columbia, the Commonwealth of the Northern Mariana Islands, and Guam, have legalized cannabis for recreational purposes or adult-use. Notwithstanding the permissive regulatory environment of cannabis at the state level, cannabis continues to be categorized as a controlled substance under the Controlled Substances Act of 1970 (the CSA) and as such, cultivation, distribution, sale, and possession of cannabis violates federal law in the United States. The inconsistency between federal and state laws and regulations is a major risk factor. Even in those jurisdictions in which the manufacture and use of medical cannabis has been legalized at the state level, the interstate production, transportation, possession, sale, and use of cannabis remain violations of federal law that are punishable by imprisonment, substantial fines, and forfeiture. Our commercial partners will be directly subject to these laws and regulations. Companies that are not engaged directly in the cultivation, production, manufacturing, or sale of cannabis or cannabis-derived products nevertheless may violate federal law if they intentionally aid and abet another in violating these federal controlled substance laws. Therefore, strict enforcement of federal laws regarding cannabis would likely result in our inability and the inability of our commercial partners to execute our respective business plans.\nAnticipated relaxation of regulatory restraints may not materialize.\nCurrently, the market for THC cannabinoids in the United States is severely restricted by the federal regulatory position listing cannabis as a Schedule I controlled substance, which prohibits cannabis in interstate commerce, with attendant secondary and tertiary adverse effects. Accordingly, intrastate production, transportation, and sale of cannabis and cannabis-related products are regulated on a state-by-state basis. Although in recent years several states have changed their laws to legalize and tax cannabis and cannabis-related products for medical or recreational use, we cannot predict whether this trend will continue or whether the federal government will take similar action. We expect the disparity between federal and state cannabis legalization and regulation will continue. The continuation of the current regulatory regime may limit the commercialization of our licensed technology.\nThe Rohrabacher-Farr Amendment may not be renewed.\nThe Rohrabacher-Farr amendment (also known as the Rohrabacher-Blumenauer amendment) prohibits the U.S. Department of Justice (DOJ) from spending funds appropriated by Congress to enforce the tenets of the CSA against the medical cannabis industry in states that have legalized such activity. On March 15, 2022, the amendment was renewed through the signing of the fiscal year 2022 omnibus spending bill and will be effective through September 30, 2022. We cannot assure that the federal government will not seek to prosecute cases involving medical cannabis businesses that are otherwise compliant with state law. Potential proceedings could involve significant restrictions being imposed upon us or our commercial partners, which could have a material adverse effect on us.\nWe and our commercial partners may have difficulty accessing the services of banks, which may make it difficult to sell our products and services.\nFederal and federally insured state banks currently do not do business with companies that grow and sell cannabis products on the stated ground that growing and selling cannabis is illegal under federal law. Financial transactions involving proceeds generated by cannabis-related activities can form the basis for prosecution under certain federal statutes, including the BSA. Guidance issued by the Financial Crimes Enforcement Network, a division of the U.S. Department of the Treasury, clarifies how financial institutions can provide services to cannabis-related businesses consistent with their obligations under the BSA. Furthermore, supplemental guidance from the DOJ directs federal prosecutors to consider the enforcement priorities enumerated in the so-called Cole Memo, issued on August 29, 2013, under the Obama Administration, when determining whether to charge institutions or individuals with any of the financial crimes based upon cannabis-related activity. However, in January 2018, under the Trump Administration, the DOJ issued a policy memorandum on federal marijuana enforcement announcing a return to the rule of law and rescinding previous guidance documents, including the Cole Memorandum. In this memorandum, Attorney General Jeff Sessions directed U.S. Attorneys to determine whether to pursue prosecution of cannabis activity based upon the seriousness of the crime, the deterrent effect of criminal prosecution, and the cumulative impact of crimes on the community. In his February 2021 congressional testimony, then-nominee for U.S. Attorney General, Merrick Garland, stated that he would reinstitute a version of the Cole Memorandum and reiterated the statement that the Justice Department under his leadership would not pursue cases against Americans complying with the laws in states that have legalized and are effectively regulating marijuana, in written responses to the Senate Judiciary Committee. However, to date, the DOJ has not taken any formal steps respecting this matter. Therefore, banks remain hesitant to offer banking services to cannabis-related businesses, which continue to encounter difficulty accessing banking services. We cannot assure that we will be able to avoid being considered by financial institutions to be engaged in the cannabis industry, which would adversely affect our banking relationships. Our inability to maintain bank accounts would make it difficult for us to operate our business, increase our operating costs, and pose additional operational, logistical, and security challenges that could result in our inability to implement our business plan.\nWe are subject to certain federal regulations relating to currency transactions.\nThe BSA requires us to report currency transactions of over $10,000, including identification of the customer by name and social security number, to the IRS. This regulation also requires us to report certain suspicious activity, including any transaction that exceeds $5,000 that we know, suspect, or have reason to believe involves funds from illegal activity or is designed to evade federal regulations or reporting requirements, and to verify sources of funds. We may be pressured by commercial partners to accept cash payments in view of the federal regulation of banks that restricts commercial partners access to banks. If we fail to comply with these laws and regulations, the imposition of substantial penalties could have a material adverse effect on our business, financial condition, and results of operations. Increasingly, foreign jurisdictions in which we may do business have similar regulatory regimes.\nWe are subject to risk of civil asset forfeiture.\nBecause the cannabis industry remains illegal under U.S. federal law, any property owned by participants in the cannabis industry that is either used in conducting such business, or was obtained with the proceeds of such business, could be subject to seizure by law enforcement and subsequent civil asset forfeiture. Even if the owner of the property is never charged with a crime, the property in question could still be seized and subject to an administrative proceeding by which, with minimal due process, it could be subject to forfeiture.\nOur commercial partners may be subject to compliance with laws and regulations governing cannabis in foreign jurisdictions.\nOur ability to commercialize our licensed technology in foreign jurisdiction within our licensed territory may be contingent, in part, upon our prospective commercial partners obtaining approval and complying with applicable regulatory requirements enacted by those governmental authorities. We cannot predict the effect to our business of foreign compliance regulations on our commercial partners in producing and manufacturing cannabinoids, the length of time to secure appropriate regulatory approvals to use our licensing technology and process, or the extent of testing and documentation that may be required in those jurisdictions. Delays in obtaining, or failing to obtain, regulatory approvals may negatively affect the development of commercialization arrangements with these partners and could have a material adverse effect on our business, financial condition, results of operations, and prospects.\nWe anticipate that both we and our commercial partners will incur ongoing costs and obligations related to regulatory compliance. Failure by us or our commercial partners to comply with regulations may result in additional costs for corrective measures, penalties, or restrictions on our operations. In addition, changes in regulations, more vigorous enforcement thereof, or other unanticipated events could require extensive changes to our operations, increase compliance costs, or give rise to material liabilities, which could have a material adverse effect on our business, financial condition, results of operations, and prospects.\nProhibitions or restrictions from investing in, or transacting business with, companies in the cannabis industry may have an adverse effect on our operations.\nCertain jurisdictions may prohibit or restrict their citizens or residents from investing in, or transacting business with, companies involved in the cannabis industry, even if such companies only conduct business in jurisdictions where cannabis is legal, or the companies are not directly engaged in the cultivation, production, manufacturing, or sale of cannabis-derived products. Similar prohibitions or restrictions may apply in other jurisdictions where cannabis has not been legalized. In the United States, there have been certain instances of the U.S. Customs and Border Protection preventing citizens of foreign countries from entering the United States for reasons related to the cannabis industry.\nWe may rely on foreign advisors and consultants respecting local legal, regulatory, or governmental requirements or business practices.\nThe legal and regulatory requirements in the foreign countries in which we may operate respecting the cultivation, production, manufacturing, and sale of cannabis and cannabis-related products by our intended commercial partners, as well as banking systems and controls and local business culture and practices, are different from those in the United States. Although members of our management may have previous experience working and conducting business in these countries, we may retain and rely on local consultants, advisors, legal counsel, and other expert professionals to keep apprised of legal, regulatory, and governmental developments as they pertain to our business, banking, financing, labor, litigation, and tax matters in these jurisdictions. Any changes in the local legal, regulatory, or governmental requirements or business practices are beyond our control and may adversely affect our business, financial condition, and results of operations.\nThere remains doubt and uncertainty that we will be able to legally enforce contracts.\nIt is a fundamental principle of law that a contract will not be enforced if it involves a violation of law or public policy. Because cannabis remains illegal at a federal level, judges in multiple U.S. states have on several occasions refused to enforce contracts relating to the cannabis industry, including for the repayment of money when the loan was used in connection with activities that violate federal law, even if there is no violation of state law. There remains doubt and uncertainty that we will be able to legally enforce contracts we enter, if necessary. We cannot assure that we will have a remedy for breach of contract, which could have a material adverse effect on our business, revenues, operating results, financial condition, and prospects.\nWe would suffer severe penalties and other consequences if we or our agents are found to be in violation of the Foreign Corrupt Practices Act or anti-bribery laws.\nOur business is subject to U.S. laws that generally prohibit companies and personnel from engaging in bribery or other prohibited payments to foreign officials for the purpose of obtaining or retaining business. In addition, we are subject to the anti-bribery laws of any other countries in which we may conduct business. Even though our policies and procedures mandate compliance with these anti-corruption and anti-bribery laws, our personnel or other agents may, without our knowledge and despite our efforts otherwise, engage in prohibited conduct for which we may be held responsible. We cannot assure that our internal control policies and procedures will always protect us from recklessness, fraudulent behavior, dishonesty, or other inappropriate acts committed by our affiliates, personnel, contractors, or agents. If our personnel or other agents are found to have engaged in such practices, we could suffer severe penalties and other consequences that may have a material adverse effect on our business, financial condition, and results of operations.\nOur business may be adversely affected by the environmental regulations applicable to the businesses of our commercial partners.\nWe do not anticipate that our future business activities will subject us to any direct environmental compliance regulations. However, the operations of our commercial partners may be subject to environmental regulation in the various jurisdictions in which they operate. These regulations may mandate, among other things, the maintenance of air and water quality standards and land reclamation. They also set forth limitations on the generation, transportation, storage, and disposal of solid and hazardous waste. The processes and media formulations that are parts of our licensed technology must be applied, used, and discarded in accordance with these requirements. Environmental legislation is evolving in a manner that may require stricter standards and enforcement, increased fines and penalties for noncompliance, more stringent environmental assessments of proposed projects, and a heightened degree of responsibility for companies and their officers, directors, and employees. We cannot assure that future changes in environmental regulation, if any, will not adversely affect the operations of a commercial partners or sublicensees, which in turn will affect our operations.\nGovernment approvals and permits are currently and may in the future be required in connection with the operations of our commercial partners. To the extent such approvals are required and not obtained, our commercial partners may be curtailed or prohibited from production of adult-use or medical cannabis-related products, delaying the development of our operations as currently proposed.\nFailure to comply with applicable environmental laws and regulations could subject our commercial partners to regulatory or agency proceedings or investigations and may result in enforcement actions thereunder, including orders issued by regulatory or judicial authorities causing operations to cease or be curtailed, and may include damage awards, fines, penalties, or corrective measures requiring capital expenditures or remedial actions. Our commercial partners may be required to compensate those suffering loss or damage by reason of their operations using our technology and civil or criminal fines or penalties may be imposed for violations of applicable laws or regulations. These events would negatively impact our operations.\nWe will be subject to Federal Trade Commission and state regulation of business opportunities in connection with our commercialization activities.\nWe must comply with regulations adopted by the U.S. Federal Trade Commission (the FTC) and several state laws that regulate the offer and sale of business opportunities. The FTC and certain state laws require that we furnish prospective commercial partners with a business opportunity disclosure document containing information prescribed by applicable FTC and state laws, rules, and regulations, including, for example:\n·whether legal action has ever been taken against us;\n·whether there is a cancellation or refund policy for the business transaction;\n·any claims that a commercialization partner will earn a specific amount of money through the business opportunity; and\n·references for our company.\nWe cannot assure that any disclosure document that we use will comply with the FTC rules and applicable state disclosure requirements. Our failure to meet applicable business opportunity requirements may expose us to regulatory sanctions, civil liability to commercial partners, and business interruptions while we bring disclosure into regulatory compliance.\nRisks Related to our Company\nCertain of our officers and directors have been and are subject to substantial conflicts of interest in dealings with Cell Science and others.\nSince 2018 until very recently, a majority or all of our directors were or are also affiliates of Cell Science, the licensor of the intellectual property on which our business activities are based, and its affiliates. Accordingly, the terms of the following were not the result of arms-length negotiations:\n·the Integrated License Agreement;\n·the July 2021 reduction in the technical requirements of the efficacy demonstration and the agreement to accept test results to date as warranting release from cancellation of 184,000,000 shares issued under the Integrated License Agreement and the amount of the credits to reduce the amount of the one-time payment note;\n·the terms of our office sharing agreement;\n·the ownership of improvements to the licensed technology;\n·the amounts and repayment terms of certain intercorporate advances; and\n·other interpretation and administrative decisions.\nThese conflicting interest transactions directly and indirectly benefited the affiliates of the directors with a conflict of interest. These conflicts are likely to continue. We do not have policies or procedures in place to resolve any conflicts of interest in our favor. We have no governance policy to preclude or limit decisions with related parties.\nOur Code of Ethics may not apply or may be waived.\nWe have adopted a Code of Ethics that requires our board of directors to refrain from approving any transaction that is not in our best interests and is not on terms at least as favorable to us as could be obtained as a result of arms-length negotiations between unrelated parties in a similar situation. We have not adopted any other policy respecting decisions involving conflicts of interest and cannot assure that any such issues will be resolved in\nour favor. We cannot assure that the Code of Ethics has or will apply to all potential conflicts or that its provisions will not be waived.\nThe impact of the COVID-19 pandemic on our business, financial position, and results of operations continues to be unpredictable and will likely continue to have negative effects on our business and results of operations and commercialization of the licensed intellectual technology.\nThe impacts of the COVID-19 pandemic continue to be highly unpredictable and volatile in the light of the potential for a resurgence of infection rates or because of future mutations, variants, or related strains of the virus. Recent years have demonstrated the widespread and varying impacts of the pandemic on certain business operations, costs of doing business, supply chain operations, the extent and duration of measures to try to contain the virus (such as travel bans and restrictions, quarantines, shelter-in-place orders, business and government shutdowns, and other restrictions on retailers), and our ability to predict future performance, among other things.\nFor us, the COVID-19 pandemic substantially delayed efforts to test the commercial efficacy of our licensed technology and resulted in additional costs and delays. These costs and delays continue as we proceed with our engineering and commercialization efforts.\nThe duration and magnitude of the impacts from the COVID-19 pandemic impacts on our business operations and overall financial performance are unknown at this time and will depend on numerous circumstances outside our control or the ability of anyone to predict accurately. The secondary and tertiary unpredictable adverse economic effects on our business and on the worldwide economy are proving to be ongoing and broad. There are high probabilities of reoccurring widespread or localized outbreaks of existing new virus strains that may continue for many months, that may result in further government-ordered vaccination mandates, lockdowns, stay-home or shelter-in-place orders, social distancing, restrictions on travel, and other extensive measures. Government-approved vaccines have not been accepted by some people and are not widely available in all countries. Effective treatments for those infected by the virus are not always reliable, may not be widely available, and may not be widely accepted. We cannot predict the effect of these circumstances on us and our vendors, suppliers, and potential commercial partners, the global economy and political conditions, and the health of our personnel, consultants, and their families, all of which will affect how quickly and to what extent normal economic and operating activities can resume.\nEven if the COVID-19 pandemic subsides, we may continue to experience an adverse effect on our business because of its global economic impact, labor shortages, and supply chain disruptions, as well as the prospect of inflation or a recession. These circumstances will likely exert similar hardships on those with which we deal, such as vendors, shippers, distributors, and potential commercial partners. As a result, we will need to continue to adjust our business and expenditures to correlate our activities with business exigencies, including restrictions on executive and employee travel, hiring freezes or delays, and limitations on marketing. The ultimate financial impact and duration of the foregoing cannot now be predicted and may well exceed our expectations or our ability to cope with them.\nThe auditors reports for the years ended July 31, 2022 and 2021, contain explanatory paragraphs about our ability to continue as a going concern.\nWe have not generated revenue and have limited capital. We have incurred losses since inception resulting in an accumulated deficit of $43,529,628 as of July 31, 2022. Our auditor stated in its report on our audited financial statements that it has substantial doubt that we will be able to continue as a going concern without further financing. Our ability to continue as a going concern is dependent upon our ability to successfully accomplish our business plan and eventually attain profitable operations and to obtain acceptable financing in the interim period.\nWe anticipate that any additional funding that we obtain will be in the form of equity financing from the sale of our common stock or debt. However, we cannot assure that we will be able to raise sufficient funding from the sale of our common stock or be able to obtain debt financing. The risky nature of our business enterprise and our lack of revenue may place debt financing beyond the creditworthiness required by most banks or typical investors in corporate debt until such time as we generate recurring revenue from technology commercialization. We do not have any arrangements for any future equity financing. If we are unable to secure additional funding, we will cease or suspend operations. We have no plans, arrangements, or contingencies in place if we cease operations.\nWe have identified material weaknesses in our internal control over financial reporting that may cause us to fail to meet our reporting obligations or result in material misstatements of our financial statements.\nOur management, which is responsible to establish and maintain internal control over financial reporting, has concluded that our internal controls and procedures were not effective due to the following material weaknesses:\nlack of appropriate segregation of duties;\nlack of control procedures that include multiple levels of supervision and review; and\nlack of full-time executive personnel to oversee financial reporting and controls.\nBecause of these factors, we have failed to: (i) maintain records that in reasonable detail accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements in accordance with generally accepted accounting principles in the United States (GAAP) and the receipts and expenditures of company assets are made and in accordance with our management and directors authorization; and (iii) provide reasonable assurance regarding the prevention or timely detection of unauthorized acquisition, use, or disposition of assets that could have a material effect on our financial statements. As a result of these weaknesses, we were unable to file timely our Annual Report on Form 10-K for the year ended July 31, 2021, and have amended our quarterly reports on Form 10-Q for the fiscal quarters ended October 31, 2020, January 31, 2021, and April 30, 2021, and our Annual Report on Form 10-K for the year ended July 31, 2021, to correct the initial filings or add omitted information. We have not implemented curative measures to address these weaknesses.\nWe have a limited operating history.\nWe were incorporated in 2008 but had little or no activity until we obtained license rights to cell-extraction and replication technology for commercial cannabinoid production in late 2018. However, we have not completed required planned engineering, so we have not commenced commercialization in this technology to generate revenue. Therefore, we are subject to the risks common to early-stage enterprises, including undercapitalization, few personnel, limited financial and other resources, and lack of revenues. We cannot assure that we will be successful in achieving a return on our stockholders investments. Our likelihood of success must be considered in the light of our early stage of operations.\nWe have not generated any revenue since our inception, and we may never achieve profitability.\nWe are a development-stage company that has not generated any revenue. If the planned product refinement and customization meets the requirements of prospective partners so we can launch our commercialization effort, our expenses are expected to increase significantly before we can begin generating revenue. Even as we begin to market and commercialize our licensed technology, we expect our losses to continue because of ongoing sales and marketing expenses, technology transfer costs, research and development, and other operational matters. These losses, among other things, have had and will continue to have an adverse effect on our working capital, total assets, and stockholders equity. Because of the numerous risks and uncertainties that we will encounter, we are unable to predict if or when we will become profitable. Even if we do achieve profitability, we may not be able to sustain or increase profitability on a quarterly or annual basis. If we are unable to achieve and then maintain profitability, our business, financial condition, and results of operations will be negatively affected, and the market value of our common stock will likely decline.\nOur ability to successfully implement a commercialization strategy does not ensure our profitability.\nWe cannot assure that our strategy of commercializing our technology through third-party cannabinoid producers, even if we enter several or multiple arrangements, will generate sufficient revenue to meet related costs and result in a profit. We will incur operating costs in marketing our technology, completing commercialization arrangements, providing technical and operational support to our commercial partners, and otherwise operating our business. We cannot assure that our revenue will offset these costs. We may not be profitable.\nWe are a smaller reporting company, which reduces our reporting obligations.\nWe are currently a smaller reporting company, meaning that we are not an investment company, an asset-backed issuer, or a majority-owned subsidiary of a parent company that is not a smaller reporting company, and we have a public float of less than $3.5 million and had annual revenues of less than $50.0 million during the most recently completed fiscal year. Because we are a smaller reporting company, the disclosure required in our SEC filings is less than it would be if we were not considered to be a smaller reporting company. Specifically, smaller reporting companies are able to provide simplified executive compensation disclosures in their filings, are exempt from the provisions of Section 404(b) of the Sarbanes-Oxley Act requiring that independent registered public accounting firms provide an attestation on the effectiveness of internal control over financial reporting, are required to provide only two years of audited financial statements in annual reports, and have certain other decreased disclosure obligations in their SEC filings. Decreased disclosures in our SEC filings due to our status as a smaller reporting company may make it harder for investors to analyze our results of operations and financial prospects.\nUnsolicited takeover proposals may distract management and adversely affect our business.\nThe review and consideration of any takeover proposal may be a significant distraction for our management and personnel and could require the expenditure of significant time and resources by us. Moreover, any unsolicited takeover proposal may create uncertainty for our personnel that may adversely affect our ability to retain key personnel and to hire new talent. Management and employee distractions related to any such takeover proposal also may adversely impact our ability to optimally conduct our commercialization program and otherwise advance our business and pursue our strategic objectives. An unsolicited takeover proposal may also create uncertainty for our commercial partners, suppliers, and other business partners, which may cause them to terminate, or not to renew or enter, arrangements with us. The uncertainty arising from unsolicited takeover proposals and any resulting costly litigation may disrupt our business, which could result in an adverse effect on our business, financial condition, and results of operations.\nWe rely on key personnel and consultants.\nOur success is dependent upon the ability, expertise, judgment, discretion, and good faith of our executive management and consultants and our ability to continue to attract, develop, motivate, and retain highly qualified and skilled personnel and consultants. We rely on scientific advice from Dr. Peter Whitton, the inventor of the cell-extraction and replication technology on which our business is based, who has numerous other commitments and demands on his attention. Qualified, experienced individuals and cannabis industry consultants, such as our principal technical consultant, are in high demand, and we may incur significant costs to engage them. The loss of the services of our executive management or consultants, or an inability to attract other suitably qualified persons when needed, could have a material adverse effect on our ability to execute our business plan and strategy, and we may be unable to find adequate replacements on a timely basis or at all. We have no key-man life insurance on any of our employees or consultants.\nWe may incur product liability claims related to the application of the intellectual property we commercialize for cannabinoid production.\nOur potential commercial partners producing cannabinoids will face an inherent risk of exposure to third-party product liability claims, regulatory action, and litigation, which would expose us to potential liability if our processes, procedures, or medium formulations are alleged to have caused significant loss or injury. In addition, the sale of products produced by a commercial partner using intellectual property involves the risk of injury to consumers due to product contamination or tampering by unauthorized third parties. Previously unknown adverse reactions could occur resulting from human consumption of such products alone or in combination with other medications or substances. We may be subject to various third-party product liability claims, including claims that the products produced using the licensed technology caused injury or illness, that such products did not include adequate warnings concerning possible side effects or interactions with other substances, or that the use of the licensed technology did not include adequate instructions for use.\nProduct liability claims or regulatory actions against us could result in increased costs, adversely affect our reputation generally with existing or potentially new commercial partners, and have a material adverse effect on our results of operations and financial condition. Although we are also currently pursuing additional insurance coverage\nfor product liability claims, such insurance is expensive, and we cannot assure that we will be able to obtain desired insurance coverage on acceptable terms or at all. Any insurance coverage we maintain will be subject to coverage limits and exclusions and may not be available for the risks and hazards to which we are exposed. Our inability to obtain sufficient insurance coverage on reasonable terms or to otherwise protect against potential product liability claims could prevent or inhibit the commercialization of the licensed technology.\nOur business could be adversely impacted by failures or interruptions of information technology systems and potential cyber-attacks.\nOur business will depend on information technology hardware, software, telecommunications, and other services and systems we obtain from third parties. Therefore, our operations depend, in part, on how well we and our suppliers protect networks, equipment, information technology systems, and software against damage from numerous threats, including damage to physical facilities, capacity limitations, natural disasters, intentional damage and destruction, fire, power loss, hacking, computer viruses, vandalism, and theft. Our operations also depend on the timely maintenance, upgrade, and replacement of networks, equipment, information technology systems, and software, as well as preemptive expenses to mitigate the risks of failures. Any of these and other events could result in information system failures and delays or increased capital expenses. The failure of information systems or a component of information systems could, depending on the nature of any failure, adversely impact our reputation and results of operations.\nWe may also be subject to cyber-attacks or other information security breaches, and we cannot assure that we will not incur such losses in the future. Our risk and exposure to these matters cannot be fully mitigated because of, among other things, the evolving nature of these threats. As a result, we will prioritize cybersecurity and the continued development and enhancement of controls, processes, and practices designed to protect systems, computers, software, data, and networks from attack, damage, or unauthorized access. As cyber threats continue to evolve, we may be required to expend additional resources to continue to modify or enhance protective measures or to investigate and remediate any security vulnerabilities.\nOngoing domestic and international financial conditions will adversely affect our business and operations, our prospective commercial partners, the cannabinoid industry, and the world generally.\nIn recent years, global commercial and financial markets have experienced significant reoccurring disruptions, including severely diminished liquidity and credit availability, larger levels of sovereign and individual indebtedness, increased trade tariffs and barriers, supply chain delays or failures, declines in consumer confidence, declines in economic growth, increased unemployment, and uncertainty about economic stability. We cannot assure that significant deterioration in credit and financial markets, prevailing interest rates, international trade, and confidence in economic conditions will not occur in the future. Any economic downturn, volatile business environment, or continued unpredictable and unstable market conditions could have a material adverse effect on our business, financial condition, and results of operations.\nFurther, global credit and financial markets have displayed arguably increased volatility in response to global economic, pandemic, or political events. Future crises may be precipitated by any number of causes, including natural disasters, geopolitical instability, changes to energy prices, or sovereign defaults. These factors may impact our ability to obtain equity or debt financing in the future, and if obtained, on terms favorable to us. Increased levels of volatility and market turmoil can adversely impact our operations and value, including the price of our common stock.\nWe cannot assure that we will be able to compete successfully.\nWe expect significant competition from other companies offering cannabinoid production technologies or producing, transporting, or marketing cannabinoids. We believe that competition in the commercial cannabinoid industry is based primarily on price per unit; predictable and replicable product flavor, aroma, CBD or THC concentration; and ease and predictability of regulatory compliance. Price per unit of production will be based on the cost of amortizing capital expenditures and covering production and operating costs, and we cannot assure that production using our licensed technology will enable commercial partners to compete on these terms. Our potential commercial partners principal known competitors have established production, transportation, and marketing\ninfrastructure and market recognition in the multiple states in which they operate and are well capitalized with experienced management and technical resources. Numerous companies appear to be applying for cultivation, processing, and sale licenses, some of which may have significantly greater financial, technical, marketing, and other resources than we have. These competitors may be able to devote greater resources to the development, promotion, sale, and support of their products and services, and may have more extensive customer bases and broader customer relationships. We may be at a competitive disadvantage to live-grow plant producers because of the lack of established regulatory accommodation of plant cell-extraction and replication production methods. To the extent that we are not able to market and enter enough commercialization arrangements, our business, financial condition, and results of operations could be materially and adversely affected.\nWe may not have a competitive price advantage as compared to producers of CBD containing less than 0.3% THC from hemp, which was sanctioned in 2018 under the Agriculture Improvement Act.\nRisks Related to our Common Stock\nThe market for our common stock is volatile.\nThe market price of our common stock has been volatile and subject to wide fluctuations in price and trading volume in response to numerous factors, many of which are beyond our control. This volatility may affect the ability of holders of our common stock to sell their securities at an advantageous price or at all. There is extremely limited trading volume in our common stock, with no transactions for many consecutive trading days.\nMarket price fluctuations in our common stock may be due to the quotation or transaction volume our results of operations or public releases failing to meet market expectations, negative news about us or the cannabis industry, adverse changes in general market conditions or economic trends, social media activity outside our control, or other material public announcements by us or others. Financial markets for the stock of smaller capitalized companies historically have experienced significant price and volume fluctuations that have often been unrelated to the operating performance, underlying asset values, or prospects of such companies. Accordingly, the market price of our common stock may decline even if our results of operations, underlying asset values, or prospects improve or do not change. We cannot assure that continuing fluctuations in price and volume of our common stock will not occur. If increased levels of volatility and market turmoil continue, our ability to obtain capital from external sources, the trading price of our common stock, and our operations could be adversely affected.\nWe will continue to be controlled by our principal stockholders.\nCell Science owns four shares of Series A Preferred Stock, representing 100% of our outstanding Series A Preferred Stock. The super voting rights of the Series A Preferred Stock entitle its holder to voting power equivalent to four times the aggregate voting power of all other outstanding common and preferred stock outstanding, or 1,204,731,932 votes. Cell Science is owned by Inter-M Traders FZ LLE (40%), Mentone Ltd (30%), and The OZ Corporation (30%), and each of the foregoing is deemed to beneficially own the four (4) shares of Preferred Stock owned by Cell Science. Therefore, the holders of the preferred stock now have and will continue to have 80% of all votes on all matters submitted to the stockholders for consideration, voting together as a single class, which enables Cell Science directly, and its controlling stockholders indirectly, to control the election of our directors and the approval or disapproval of all other matters, including mergers, the sale of all or substantially all of our assets, liquidation, and the adoption or amendment of provisions in our articles of incorporation and bylaws.\nInter-M Traders FZ, LLE is currently the beneficial owner of 116,783,555 shares of common stock, representing 38.77% of our outstanding common stock, and as a result of its 40% ownership of Cell Science is deemed to be the beneficial owner of four (4) shares of Series A Preferred Stock.\nMentone Ltd. is currently the beneficial owner of 6,000,000 shares of common stock, representing 1.99% of our outstanding common stock, and as a result of its 30% ownership of Cell Science is deemed to be the beneficial owner of four (4) shares of Series A Preferred Stock. Mentone Ltd. is owned and controlled by Peter Whitton (a director) who is currently the beneficial owner of 23,943,562 shares of common stock, representing 7.951% of our outstanding common stock, Geoffrey Dixon who is currently the beneficial owner of 23,952,188 shares of common stock, representing 7.95% of our outstanding common stock, and Karl Watkin who, through his Company, Menelaus\nHolding FZ LLC, is currently the beneficial owner of 26,952,187 shares of common stock, representing 8.95% of our outstanding common stock.\nOZ Corporation is owned and controlled by John R. Munoz. OZ Corporation is currently the beneficial and owner of record of 10,980,994 shares of common stock directly, and John R. Munoz is currently the beneficial owner of 3,168,000 shares of common stock, which in the aggregate represent 5.08% of our outstanding common stock. OZ Corporation, and John R. Munoz as a result of OZ Corporations 30% ownership of Cell Science is deemed to be the beneficial owner of four (4) shares of Series A Preferred Stock\nWe may issue common stock in the future, which may dilute a stockholders holdings in our company, including the investors in this offering, or have a negative effect on the market price of our stock.\nWe may sell equity securities (including convertible securities) in offerings, which may dilute a stockholders holdings in our company. Our articles of incorporation grant our board of directors discretion to issue, sell, and determine the price and terms of additional preferred or common stock, including at prices less than the current market price per share. Our stockholders do not have preemptive rights. Moreover, additional common stock will be issued by us on the exercise of options under our stock option plan or warrants. Any transaction involving the issuance of preferred or common stock, or securities convertible into common stock, would result in dilution, possibly substantial, to our security holders, including the investors in this offering.\nSales of substantial amounts of our securities by us or our existing stockholders, or the availability of such securities for sale, could adversely affect the prevailing market prices for our securities and dilute an investors per-share earnings, if any. A decline in the market prices of our securities could also impair our ability to raise additional capital through the sale of securities should we desire to do so.\nLimited trading volumes for our common stock may limit the ability of our stockholders to obtain liquidity.\nDue to the limited trading volume for our common stock, our stockholders may be unable to sell any or large quantities of our common stock into the public trading market without a significant reduction in the price of their common stock. We cannot assure that there will be sufficient liquidity of the common stock on the trading market and that we will continue to meet the listing requirements of any public listing exchange or quotation medium.\nWe do not anticipate paying dividends.\nWe do not have earnings from which to pay dividends and have no current intention to declare dividends, even if we were to become profitable. If we were to achieve earnings, any discretionary decision to pay dividends would depend on, among other things, our results of operations, current and anticipated cash requirements and surplus, financial condition, future contractual restrictions and financing agreement covenants, solvency tests imposed by corporate law, and other factors that our board of directors may deem relevant. Rather than pay dividends, we anticipate that we will retain earnings to fund expansion and growth.\nThe regulated nature of our business may impede or discourage a takeover.\nOur business is subject to cannabinoid industry direct and indirect regulatory or licensing requirements that may not necessarily continue to apply to an acquirer of our business following a change of control. These licensing requirements could impede a merger, amalgamation, takeover, or other business combination involving us or discourage a potential acquirer from making a tender offer for common stock, which under certain circumstances could reduce the market price of the common stock. ITEM 1B. UNRESOLVED STAFF COMMENTS\nWe are not required to provide the information called for by this item. ITEM 2. PROPERTIES\nOur principal executive offices are located at One World Trade Center, Suite 130, Long Beach, California 90831, telephone 858-682-2528. Our corporate internet address is www.bakhuholdings.com. The reference to our website is an inactive textual reference only and is not a hyperlink. The contents of our website are not part of this prospectus, and you should not consider the contents of our website in making an investment decision respecting our common stock.\nOZ Corporation, an affiliate, provides our office and office-related equipment and communication facilities, including administrative services, for a fixed monthly fee of $34,000. We intend to find an alternative office facility and enter a long-term office lease with an unaffiliated party at prevailing market rates when increased operations warrant.\nIn lieu of any reduction to the one-time payment note owed to Cell Science, in January 2022, we accepted assignment of all rights under the lease for the 5,000 square-foot facility and all rights in all laboratory equipment and related assets used in the efficacy demonstration testing process located at 15614 Oxnard Avenue, Sherman Oaks, California. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in legal proceedings or be subject to claims arising in the ordinary course of our business. To the best of our knowledge, we are not presently a party to any legal proceedings that, if determined adversely to us, would individually or taken together have a material adverse effect on our business, operating results, financial condition, or cash flows. Regardless of the outcome, litigation can have an adverse impact on us because of defense and settlement costs, diversion of management resources, and other factors. ITEM 4. MINE SAFETY DISCLOSURES\nThis item is not applicable to our business.\nPART II. ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nOur common stock is quoted on the Pink Sheets of the OTC Markets Group under the trading symbol BKUH. These over-the-counter market quotations reflect inter-dealer prices, without retail mark-up, mark-down, or commission, and may not necessarily represent actual transactions. Since our inception, the sporadic trading activity in our common stock and the fluctuations in our common stock price have been volatile, and we cannot assure that any market for our common stock will be maintained. The following table sets forth the range of high and low closing sales prices for our common stock for each of the periods indicated as reported and summarized by the Pink Tier of the OTC Markets Group:\nCommon Stock Prices\nHigh\nLow\nFiscal 2022\nQuarter ended July 31, 2022\n$\n3.30\n$\n0.001\nQuarter ending April 30, 2022\n$\n4.00\n$\n3.00\nQuarter ended January 31, 2022\n$\n5.01\n$\n2.43\nQuarter ended October 31, 2021\n$\n7.99\n$\n3.57\nFiscal 2021\nQuarter ended July 31, 2021\n$\n5.21\n$\n2.60\nQuarter ended April 30, 2021\n$\n14.00\n$\n4.25\nQuarter ended January 31, 2021\n$\n8.65\n$\n4.63\nQuarter ended October 31, 2020\n$\n6.10\n$\n4.00\nFiscal 2020\nQuarter ended July 31. 2020\n$\n10.80\n$\n4.20\nQuarter ended April 30. 2020\n$\n6.05\n$\n4.00\nQuarter ended January 31, 2020\n$\n5.25\n$\n2.05\nQuarter ended October 31, 2019\n$\n4.55\n$\n4.01\nThere is extremely limited trading volume in our common stock, with no transactions for many consecutive trading days. For example, in the 19 trading days between September 1-28, a total of only 230 shares traded on one day. In the 23 trading days in August, there were transactions on two days for a total of 1,619 shares. In July, a total of 200 shares traded. During June, a total of 4,091 shares traded on two days.\nOn October 31, 2022, the closing quotation price per share for our common stock on the Pink Tier of the OTC Markets Group was $2.00. We have 392 common stockholders of record. As of October 31, 2022, we had 301,182,983 shares of our common stock issued and outstanding, 12,418,085 shares reserved for issuance on the exercise of vested and unvested options, and 15,000,000 shares reserved for issuance on the exercise of vested and unvested warrants.\nNo Dividends\nCommon Stock\nNo dividends have ever been paid on our common stock. We expect that that any future earnings will be retained for use in developing and expanding our business, and we do not currently anticipate paying any dividends in the foreseeable future. Future dividend policy will be determined by our board of directors in the light of our prevailing financial need and earnings, if any, and other relevant factors.\nPreferred Stock\nUnder our articles of incorporation, our board of directors is authorized, without stockholder action, to issue preferred stock in one or more series and to fix the number of shares and rights, preferences, and limitations of each series. Among the specific matters, if any, that may be determined by the board of directors are the dividend rate, the redemption price, conversion rights, the amount payable in the event of any voluntary liquidation or dissolution of our company, and voting rights. As of the date of this prospectus, four shares of Series A Preferred Stock were issued and outstanding. This preferred stock has super voting rights that enable the holder to control the election of our board of directors and, ultimately, our direction.\nPayment of dividends on the common stock and preferred stock is within the discretion of the board of directors, is subject to state law, and will depend upon our earnings, if any, our capital requirements, financial condition, and other relevant factors.\nTransfer Agent and Registrar\nOur transfer agent is Colonial Stock Transfer Company, Inc., whose address is 66 Exchange Place, Salt Lake City, Utah 84111.\nEquity Compensation Plan\nOn September 22, 2020, our board of directors adopted the Bakhu Holdings Corp. 2020 Long-term Incentive Plan (the 2020 Plan), under which 20,000,000 shares of our common stock were reserved for issuance by us to attract and retain employees and directors and to provide such persons with incentives and awards for superior performance and providing services to us. This plan was approved by our stockholders effective September 10, 2021. The 2020 Plan is administered by a committee comprised of our directors or appointed by our board of directors, which has broad flexibility in designing stock-based incentives. The board of directors determines the number of shares granted and the option exercise price, pursuant to the terms of the 2020 Plan.\nAs of July 31, 2022, options to purchase 17,820,000 shares have been granted under this plan. 495,464 shares of common stock have been issued upon the exercise of options, 4,906,269 options have been cancelled, and there are 12,418,085 options outstanding of which 4,749,408 options have vested and are exercisable. See Item 11. Executive Compensation - Long Term Incentive Plan.\nThe following table sets forth information as of July 31, 2022, respecting our equity compensation plans previously approved by stockholders and equity compensation plans not previously approved by stockholders:\nEquity Compensation Plan Information\nNumber of securities to\nbe issued upon exercise\nof outstanding options,\nwarrants and rights\nWeighted average\nexercise price of\noutstanding options,\nwarrants and rights\nNumber of securities\nremaining available for\nfuture issuance under\nequity compensation\nplans (excluding\nsecurities reflected in\ncolumn (a))\nPlan Category\n(a)\n(b)\n(c)\nEquity compensation plans approved by stockholders\n12,418,085(1)\n$\n$3.10\n7,086,269\nEquity compensation plans not approved by stockholders\n15,000,000(2)\n$\n3.00\nTotal\n15,600,000\n7,086,269\n_______________\n(1)Represents 400,000 options with an exercise price of $5.10 per share, 718,085 options with an exercise price of $4.50 per share, 200,000 options with an exercise price of $4.20 per share, 540,000 options with an exercise price of $3.40 per share, 2,600,000 options with an exercise price of $3.30 per share, 5,640,000 options with an exercise price of $3.00 per share, 1,400,000 options with an exercise price of $2.60 per share and 920,000 options with an exercise price of $1.50 per share. As of July 31, 2022, 7,086,269 shares were available for issuance under the 2020 Plan. Shares\navailable under the 2020 Plan may be used for any type of award authorized in that plan, including stock options, stock appreciation rights, and full-value awards.\n(2)We have 15,000,000 warrants issued outside our 2020 Plan to consultants.\nNon-Equity Incentives\nIn addition to the above equity incentives, under our amended consulting agreement with Donald Clarks company, Bus Dev Center, Inc. we have agreed to pay Bus Dev performance bonuses equal to 3% of the sublicense fees, including royalties, paid by three designated sublicensee prospects and 5% of the sublicense fees, including royalties, on all other qualifying sublicensee prospects, in each case until the sublicense terminates or until our company is sold. In lieu of the award of common stock or other equity incentives, we have further agreed to pay Bus Dev pursuant to a sliding scale ranging from 2.0% to 5.0% of the amount by which the consideration received by us or our stockholders in specified liquidity or reorganization events exceeds $30.0 million with certain anti-dilution protection against stock issued after April 30, 2022. These incentives will be reduced by amounts paid in connection with our sublicensing activities as described above. Our agreement with Bus Dev expires January 30, 2023, with payments due respecting covered transactions based on various applicable dates as set forth in the amended consulting agreement. ITEM 6. RESERVED. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATION\nThe following discussion contains forward-looking statements within the meaning of Section 27A of the Securities Act and Section 21E of the Exchange Act relating to future events or our future performance. The following discussion should be read in conjunction with our consolidated financial statements and notes to our financial statements included elsewhere in this report. This discussion contains forward-looking statements that relate to future events or our future performance. Although management believes that the assumptions made and expectations reflected in the forward-looking statements are reasonable, we cannot assure that the underlying assumptions will, in fact, prove to be correct or that actual results will not be different from expectations expressed in this report.\nBusiness Overview\nSince December 2018, we have focused on testing and commercializing cannabis plant cell-extraction and replication technologies under a technology license granted by Cell Science. This licensed technology uses plant cell-extraction and replication technology and related proprietary equipment, processes, and medium formulations in a commercially-sized bioreactor laboratory to produce, manufacture, and sell plant-based cannabis products-sometimes referred in the industry as cannabinoids-exclusively in North and Central America and the Caribbean for medical, food additive, and recreational uses.\nDuring our fiscal year ended July 31, 2021, we collaborated with Cell Science, through Dr. Peter Whitten, the principal inventor of the technology and an affiliate of both Cell Science and us, to demonstrate application of the technology. In a July 2021 amendment to our license agreement with Cell Science, we altered the testing requirements and accepted the results then achieved, which required us to issue a one-year note for a one-time payment of $3.5 million, subject to specified setoffs, to obtain a fully paid license. In January 2022, we agreed to accept assignment of all rights under the lease for the facility in which the laboratory is located and all rights in all laboratory equipment and related assets used in the Efficacy Demonstration testing process in lieu of any reduction to the one-time payment note. See below and Item 13. Certain Relationships and Related Transactions, and Director Independence.\nDuring our most recent fiscal year completed on July 31, 2022, we expanded our consulting team to support our efforts to organize the launch of our commercialization efforts, identify possible sources of required financing, and initiate conversations with potential commercialization partners, particularly selected multi-state operators with established production, distribution, and marketing infrastructure, expertise, and financing. Conversations with some of these sources and potential commercialization partners continue, but we have not reached any definitive commitments, understandings, or agreements. We are continuing our efforts.\nWe now propose to undertake additional work to determining the limits of the technology, maximize production efficiency, reduce production costs, and customize products for prospective commercial partners, which we believe will enhance our commercialization efforts. Subject to successfully completing our ongoing work, we intend to seek to commercialize the licensed technology through joint ventures strategic partners, sublicenses, and other arrangements that may enable us to take advantage of the technical, regulatory relationships and experience, and financial resources of experienced cannabinoid production firms. We intend to authorize these third parties to incorporate the technology into production facilities they fund, build, and operate to produce medical, food additive, and recreational cannabis-related products in compliance with applicable state and federal law. We will need additional financing from external sources for these efforts.\nDuring the last three fiscal years, we have not generated revenue and have devoted our limited management, technical, and financial resources to pay general and administrative expenses in order to position us to be able to commercially exploit the licensed technology after completion of the efficacy testing required to demonstrate its commercial viability, organize our corporate structure, and seek substantial amounts of additional capital required to implement our business plan.\nWe need additional external capital to continue operations.\nResults of Operations\nYears Ended July 31, 2022 and 2021\nRevenues. We had no revenues during the years ended July 31, 2022 and 2021.\nConsulting Fees. Consulting fees were $15,379,799 and $4,892,478 for the years ended July 31, 2022 and 2021, respectively, an increase of $10,487,321, or 214%, as we substantially increased our 2022 fiscal year activities following successful demonstration of the efficacy of our licensed technology near the end of our preceding fiscal year. During the year ended July 31, 2022, we issued 16,420,000 stock options and 15,000,000 stock warrants and recognized stock-based compensation of $14,616,834 as we continued to rely on equity incentives for employees and consultants in the face of limited cash resources. As of July 31, 2022, there was $42,288,293 of total unrecognized stock-based compensation that is expected to be recognized over the vesting period of each option or warrant.\nProfessional Fees. Professional fees were $900,492 and $535,361 for the years ended July 31, 2022 and 2021, respectively, an increase of $365,131, or 68% during the latter period. Increases in professional fees period over the period resulted from our increased activities and our corresponding periodic reporting obligations under federal securities laws. We expect these increased costs will continue.\nSelling, General, and Administrative Expenses. Selling, general, and administrative expenses were $1,762,877 and $1,394,524 for the years ended July 31, 2022 and 2021, respectively, an increase of $368,353, or 26%. The increase period over period is attributable to increasing activities and laboratory expenses, including costs under our office sharing agreement with an affiliate, insurance, equipment, staff and other related laboratory related costs, which we expect will continue to increase.\nOther Income (Expenses). We had net other expenses of $2,871,772 and $67,647 for the years ended July 31, 2022 and 2021, respectively, which is over a four-fold increase in fiscal 2022. Included in other expenses for the year ended July 31, 2022, was the impairment of intangible assets in the amount of $2,734,839 associated with the acquisition of tangible and intangible laboratory assets from an affiliate. Also included in other expenses were interest expenses related to our $136,933 in notes payable to related parties for the year ended July 31, 2022. The increase in interest expenses is a result of the increase in loans and notes payable due to related parties, which increased by a principal amount of $4,442,948 from July 31, 2021 to July 31, 2022. We used these borrowed funds for operating expenses.\nNet Loss. We had a net loss of $20,914,940 for the year ended July 31, 2022, compared to $6,890,010 for the year ended July 31, 2021, an increase of $14,024,930, or 204%. Since we had no revenues in either year, the increase in net loss was due to the increased expenses as discussed above.\nLiquidity and Capital Resources\nAs of July 31, 2022\nAs of July 31, 2022, we had cash of $12,451, compared to $46,929 as of July 31, 2021. We continue to consume working capital in the pursuit of our business plan using proceeds from loans or sales of our equity.\nFor the year ended July 31, 2022, cash decreased by $34,478 from $46,929 on July 31, 2021 to $12,451 on July 31, 2022.\nNet cash used in operating activities was $2,583,430 during the year ended July 31, 2022, because of a net loss of $20,914,940, which was offset by stock-based compensation of $14,616,834, impairment of intangible assets of $2,734,839, depreciation of $76,517, an increase in accounts payable of $766,388, and an increase in accrued liabilities of $136,932.\nDuring the year ended July 31, 2022, we had no net cash flows from investing activities.\nDuring the year ended July 31, 2022, financing activities provided $2,548,952 in net cash, which consisted of $1,606,004 in proceeds from the sale of common stock and $1,058,994 in proceeds from notes payable issued to related parties, which were reduced by $116,046 paid to related parties to reduce outstanding indebtedness.\nFuture Capital Requirements\nOur July 31, 2022, current capital resources plus $1,420,000 in proceeds from our private sale of common stock after July 31, 2022, will not be sufficient to fund our planned laboratory activities, continue our planned efforts to seek to commercialize our licensed technology, and meet other financial requirements during the next 12 months. Our ability to continue as a going concern is contingent upon our ability to obtain capital through the sale of equity or issuance of debt and, ultimately, to attain profitable operations. We expect that we will continue to rely on debt and equity financing from external sources, including related parties during the next 12 months. We cannot assure that we will be able to successfully complete any of these activities.\nWe are presently seeking debt and equity financing to fund the $3.5 million One-time Payment to Cell Science due January 2023 and the $3,085,013 due for related-party advances and accrued interest under a note due December 31, 2022. We cannot assure, however, that any required financing ro repay indebtedness will be obtained or will be available on terms acceptable to us. Any transaction involving the issuance of common stock, or securities convertible into common stock, would result in dilution, possibly substantial, to our existing security holders. Further, we cannot assure that these related parties will extend the payment dates for this indebtedness aggregating about $6.6 million.\nWe estimate that we will require approximately $8.5 million in external capital to fund our activities during the next 12 months. This consists of between $1.1 million and $1.4 million during the next twelve months for our planned laboratory work to improve and customize our licensed processes. The actual amount of work completed will depend on the amount of capital available for those expenditures. Reductions in available capital would correspondingly delay and disrupt laboratory plans and, in turn, the commencement of our commercialization program that we anticipate will lead to recurring revenue. In addition to the above, we expect that operating capital for planned regular, non-laboratory corporate operations with require between approximately $5.8 million and $6.2 million during the next 12 months. Less available capital will require us to implement cost-cutting measures and may delay planned activities.\nTo fund the above requirements totaling about $15.1 million, we are currently seeking between $12.0 and $15.0 million through the sale of common stock or convertible debt. We received $1,420,000 from the sale of common stock after July 31, 2021. We have no commitments or agreements to complete the offering.\nWe may also seek additional debt and equity financing to fund payment of additional trade and other obligations incurred and costs of implementing our business plan. Our ability to attract debt financing will be substantially impaired by our current lack of both revenues and a robust, viable trading market for our common stock. Accordingly, any debt financing will likely be convertible to common stock, at the lenders option, at prices discounted to our stock trading price at the time of conversion, which could dilute the interests of existing stockholders. We cannot assure that any such financings will be available, or can be completed on terms acceptable, to us. Any transaction involving the issuance of preferred or common stock, or securities convertible into common stock, would result in dilution, possibly substantial, to our current security holders.\nManagements Plan to Continue as a Going Concern\nOur independent registered public accounting firms report on our financial statements for the years ended July 31, 2022 and 3031, as for previous years, contains an explanatory paragraph expressing substantial doubt about our ability to continue as a going concern, which may hinder our ability to obtain future financing. In order to continue as a going concern, we will need, among other things, additional capital resources. Managements plans to obtain capital from the sale of our securities and short-term borrowings from stockholders or related parties when needed. However, management cannot provide any assurance that we will be successful in accomplishing any of our plans. Our ability to continue as a going concern is dependent upon our ability to successfully accomplish the plans described in the preceding paragraph and eventually secure other sources of financing and attain profitable operations.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements.\nCritical Accounting Pronouncements\nOur financial statements and related public financial information are based on the application of generally accepted accounting principles in the United States (GAAP). GAAP requires the use of estimates, assumptions, judgments, and subjective interpretations of accounting principles that have an impact on the assets, liabilities, revenues, and expense amounts reported. These estimates can also affect supplemental information contained in our external disclosures, including information regarding contingencies, risk, and financial condition. We believe our use of estimates and underlying accounting assumptions adhere to GAAP and are consistently and conservatively applied. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances. Actual results may differ materially from these estimates under different assumptions or conditions. We continue to monitor estimates made during the preparation of our financial statements.\nFinancial Reporting Release No. 60, published by the SEC, recommends that all companies include a discussion of critical accounting policies used in the preparation of their financial statements.\nWhile all these accounting policies impact our financial condition and results of operations, we view certain of these policies as critical. Policies determined to be critical are those that have the most substantial impact on our financial statements and require management to use a greater degree of judgment and estimates. Our management believes that given current facts and circumstances, it is unlikely that applying any other reasonable judgments or estimate methodologies would cause a material effect on our results of operations, financial position, or liquidity for the periods presented in our annual report.\nCash and Cash Equivalents\nCash equivalents include short-term, highly liquid investments with maturities of three months or less at the time of acquisition.\nRevenue Recognition\nRevenue is recognized upon delivery of goods when the sales price is fixed or determinable and collectability is reasonably assured. Revenue is not recognized until persuasive evidence of an arrangement exists.\nStock-Based Compensation\nWe account for stock-based compensation under Accounting Standards Codification Topic 718, Compensation-Stock Compensation, using the fair value-based method. Under this method, compensation cost is measured at the grant date based on the value of the award and is recognized over the service period, which is usually the vesting period. This guidance establishes standards for the accounting for transactions in which an entity exchanges its equity instruments for goods or services. It also addresses transactions in which an entity incurs liabilities in exchange for goods or services that are based on the fair value of the entitys equity instruments or that may be settled by the issuance of those equity instruments.\nAdvertising\nAdvertising costs that are not material for the periods presented are expensed as incurred.\nBasic and Fully Diluted Net Loss per Share\nBasic net loss per common share is based on the weighted average number of shares outstanding during the periods presented. Diluted earnings per share is computed using the weighted average number of common shares plus dilutive common share equivalents outstanding during the period. There are no common stock equivalents as of July 31, 2021 and 2020, and for the periods presented.\nRecent Accounting Pronouncements\nWe have evaluated recent accounting pronouncements and believe that none of them will have a material effect on our financial statements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nOur consolidated financial statements, including the Report of Independent Registered Public Accounting Firm on our consolidated financial statements, are included following the signature page to this report beginning on page and are incorporated herein by reference. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed by us in the reports that we file or submit to the U.S. Securities and Exchange Commission (the SEC) under the Exchange Act, is recorded, processed, summarized, and reported within the time periods specified by the SECs rules and forms, and that information is accumulated and communicated to our management, including our principal executive and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control, as is defined in the Exchange Act. These internal controls are designed to provide reasonable assurance that the reported financial information is presented fairly, that disclosures are adequate and that the judgments inherent in the preparation of financial statements are reasonable. There are inherent limitations in the effectiveness of any system of internal controls, including the possibility of human error and overriding of controls. Consequently, an effective internal control system can only provide reasonable, not absolute, assurance respecting reporting financial information.\nOur internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that in reasonable detail accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements in accordance with GAAP and the receipts and expenditures of company assets are made and in accordance with our management and directors authorization; and (iii) provide reasonable assurance regarding the prevention or timely detection of unauthorized acquisition, use, or disposition of assets that could have a material effect on our financial statements.\nManagement has undertaken an assessment of the effectiveness of our internal control over financial reporting based on the framework and criteria established in the Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based upon this evaluation, management concluded that our internal control over financial reporting was not effective as of July 31, 2021.\nBased on that evaluation, management concluded that, during the period covered by this report, such internal controls and procedures were not effective due to the following material weakness identified:\n·lack of appropriate segregation of duties\n·lack of control procedures that include multiple levels of supervision and review\n·lack of full-time executive personnel to oversee financial reporting and controls\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to rules of the SEC that permit us to provide only the managements report in this annual report.\nImplemented or Planned Remedial Actions in Response to the Material Weaknesses\nWe will continue to strive to correct the above noted weakness in internal control once we have adequate funds to do so. We believe appointing a director who qualifies as a financial expert will improve the overall performance of our control over our financial reporting.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control over Financial Reporting\nOn December 6, 2022, we entered into an employment agreement with, and hired, Juan Carlos Garcia La LaSienra Garcia as our new Chief Financial Officer. There were no other changes in our internal control over financial reporting that occurred during the year ended July 31, 2022, that materially affect, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone\nITEM 9C.DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable.\nPART III. ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nOur current directors and executive officers are as follows:\nName\nAge\nTitle\nDirector Since\nEvripides Drakos\nPresident, Chief Executive Officer\nand Chairman of the Board of Directors\nJanuary 2020\nAristotle Popolizio\nVice President, Secretary and Director\nJanuary 2020\nJuan Carlos Garcia La Sienra Garcia\nChief Financial and Accounting Officer\nDecember 2021\nPeter Whitton\nDirector\nJanuary 2020\nTom Vaknin\nDirector\nJuly 2022\nMoshe Morgenstern\nDirector\nJuly 2022\nDr. Michael R. Hawthorne\nDeputy Chief Executive Officer\nN/A\nTerm of Office\nAll our directors hold office until the next annual general meeting of the stockholders or until their successors are elected and qualified. The officers are appointed by, and serve at the pleasure of, our board of directors.\nFamily Relationships\nThere are no family relationships between any of our directors or executive officers, either by blood or by marriage.\nBackground and Business Experience\nThe business experience during the past five years of each of the persons serving as an officer of director is described below.\nEvripides (Roy) Drakos has served as a director since January 2020 and was appointed as the chairman and our chief executive officer on November 10, 2021. Since 2013, Mr. Drakos has served as an independent business consultant and advisor to various companies. During his services in the last three decades, he has accumulated unique experience through his involvement in technology pioneering and financial engineering in emerging markets, medical science, renewable energy, and hi-tech patent investments. He has also acted as the principal advisor for private equity investments and boutique family offices. Mr. Drakos also supports the satellite communication industry, as his principal activity, focusing on strategy and business development in emerging markets for blue chip satellite communication company. He also offers investment advice to various private equity groups. Motivated through his passion to serve the underserved around the world, Mr. Drakos has accumulated a global network of associates and business leaders actively sharing the same values and vision. As an inspirational leader and investment advisor he is well recognized for his ability to create great value for investors and deliver expansion strategies for high-end pioneering networks and solutions.\nAristotle Popolizio has served as a director since January 2020 and was appointed as the vice president and secretary on September 22, 2020. Since 2019, Mr. Popolizio has served as the head of investor relations at Inter-M Traders Ltd., Limassol, Cyprus, a family office investment fund with offices in Cyprus and New York City, and our affiliate. Mr. Popolizio leads a team in investment research, capital raising, and operational risk management plans and ensures that we are appropriately and strategically positioned with analysts, investors, and stakeholders. Mr. Popolizio has a BS in risk management and a minor in international business from the Smeal College of Business at The Pennsylvania State University. Mr. Popolizio worked as a financial planner for Prudential, in the New York Metro Area, from 2018 through 2019. In January 2017 through June 2018, he worked as a financial advisor for McAdam LLC.\nDr. Peter Whitton has served as a director since January 2020. Dr. Whitton has over 20 years experience in plant cell culturing and research. Dr. Whitton has a BSC from the University of London in biology with chemistry and a PhD in biochemistry from Westminster University. He is a member of the Institute of Biology, a chartered biologist, a member of the Royal Society of Chemistry, and a Fellow of the Institute of Biomedical Sciences. Dr. Whitton has provided advisory services to leading pharmaceutical companies such as GlaxoSmithKline, Brentford, United Kingdom, and Boots, Nottingham, United Kingdom, on regulatory strategy, as well as directing research and providing toxicology advice to Pfizer Pharmaceutical Company, Parsippany, New Jersey. Between 2004 and 2010, Dr. Whitton served as director and chief scientific officer for Naturally Scientific Technologies Ltd., Nottingham, United Kingdom, where he developed and patented methods for the production of glyceraldehyde from CO2 and the production of lipids using plant cell culture technologies. Prior to joining Naturally Scientific, Dr. Whitton ran and managed his own research organization, Phyto-Research Ltd., Loughborough, United Kingdom, for five years and secured numerous patents in the field of plant tissue cultures and natural sciences, as well as providing research and advisory services to leading pharmaceutical companies and universities. During this period, Dr. Whitton also worked with The Serious and Organized Crime Directorate of the Metropolitan Police, New Scotland Yard, London, United Kingdom, with Assistant Commissioner Tarique Gaffur on the development of new drug and explosive detection techniques. Dr. Whitton held the position of senior scientist between 1994 and 1999 for Phyto Medica Ltd, Hinckley, United Kingdom, specializing in the preparation of herbal-based remedies and cosmetics and was responsible for research, quality, and conformance with British Pharmacopeia Standards and compliance with Cosmetic Safety regulations. Dr. Whitton was the lead inventor of bio-technology patents, with a particular focus on the use of plant cell technology for industrial applications. Dr. Whitton was a co-founder in 2016 and currently services as a director of Lykke Research Ltd., Syston Leicester, United Kingdom, a bio-technology company that has developed and patented a process to produce the API (Active Pharmaceutical Ingredient) from the Hoodia Gordonii plant from cell cultures for use in the dietary supplements market as an appetite suppressant.\nJuan Carlos Garcia La Sienra Garcia was appointed as our chief financial officer on December 7, 2021, and also served as a director from December 7, 2021 until his resignation from the Board on July 29, 2022. Mr. Garcia is a co-founder and chief executive officer of Borromeo Group, Mexico City, Mexico, a business and financial consulting firm, and has served in this capacity since August 2018. Mr. Garcia is the former President of Woodbook Group Holdings, Inc., an international firm of financial consultants, with its principal office located in Cyprus, the founder and president of EPR Holdings, located in The Woodlands, Texas, a provider of disbursement solutions for banking networks, closed-loop electronic payment networks, and merchant retail networks. From January 2016 to August 2018, Mr. Garcia was the chief financial officer of TCB Pay LTD, Henderson, Nevada, which is a merchant processing solutions company, and president of HGM Capital Los Angeles, California, a loyalty program processing entity. From January 2011 until February 2015, Mr. Garcia was the vice-president of business development and a co-founder of CorpoRed, Mexico City, Mexico, a technology solutions company that allows users to sell products and services electronically, without a credit card, handling all operations by bank deposits. Mr. Garcia started his career working at PWC (international tax area) and served as chief financial officer of Blue Label Telecoms, Reebok, and First Data. Mr. Garcia graduated from Anahuac University with a CPA (1997) and a masters in finance (1998).\nTom Vaknin was appointed as a director on July 29, 2022. Mr. Vaknin is a serial tech entrepreneur focusing on enterprise software and Fintech. Mr. Vaknin is the Co-Founder and Co-CEO of Pay.com, US, UK, CY, with offices in NY, London, Limassol, an EU Regulated payment institution which launched in 2020 and is currently expanding with five global offices. Mr. Vaknin was the Co-Founder and Chief Technical Officer of Engage.com, Tel Aviv, Israel from August 2018 to November 2020, working to reinvent and transform the customer engagement space to make it more effective, efficient, and evocative, using cutting-edge AI. Mr. Vaknin served as the Co-Founder and Chief Technical Officer of Interactbot, Tel Aviv Area, Israel, From April 2017 to July 2018, and Co-founder and Chief Technical Officers of The ORG7, Tel Aviv, Israel, from February 2015 to January 2016. Mr. Vaknin earned a B.A., MIS Management Information Systems from The College for Academic Studies, Tel Aviv, Israel, in 2014.\nMoshe Morgenstern was appointed as a director on July 29, 2022. Mr. Morgenstern has over 18 years of experience in management and global business development in finance and insurance and since 2017 has served as the Deputy CEO and Chief Information Office of Menora Mivtachim Insurance Ltd., one of the largest publicly traded financial services organizations in Israel. As a senior executive, his key roles include product development, partnership growth, legacy system automation, and investment in Fintech and Insurtech start-up companies. He has led numerous large-scale projects throughout his career, including multi-interface data integration, service improvement and efficiency, AI-based digital processes, and cross-platform automation and robotics (RPA) tools. Mr. Morgenstern served as Deputy CEO and Director, Life Insurance Division from 2011 to 2017, and Strategy, Product Development, and Computing - Life Insurance Division from 2003 to 2011. Mr. Morgenstern was awarded the Best Chief Information Officer of the year in 2020 at Israel's Conference of Information Technology and recognized as Chief Information Officer of the Year in 2019 by People and Computers Magazine. Mr. Morgenstern earned a BA in Business Administration from Ruppin Academic Center at Emek Hefer, Israel in 2014.\nDr. Michael R. Hawthorne was appointed our deputy chief executive officer on February 11, 2022. Dr. Hawthorne has served as the executive chairman of Domainex Ltd (Cambridge, UK), a global drug discovery contract research organization, since August 2021 and as an advisor to Closed Loop Medicine Ltd (London, UK) since 2017. Dr. Hawthorne was awarded a Fellowship of The Royal Society of Biology in 2020 in recognition of his contribution to global biosciences. Dr. Hawthorne is an investor and has served as a director of BG Capital (USA) from 2016 to present.\nDirectorships\nNo director or person nominated or chosen to become a director holds any other directorship in any company with a class of securities registered pursuant to Section 12 of the Exchange Act, or subject to the requirements of Section 15(d) of such act or any other company registered as an investment company under the Investment Company Act of 1940.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Exchange Act requires our directors, executive officers, and persons that own more than 10% of a registered class of our equity securities to file with the SEC initial report of ownership and reporting of changes in ownership of our equity securities. Officers, directors, and greater than 10% stockholders are required to furnish us with copies of all Section 16(a) forms they file.\nBased solely on its review of the copies of such forms filed with the SEC electronically, received by us and representations from certain reporting persons, we believe that for the fiscal year ended July 31, 2022, the required beneficial ownership reports have been filed by all officers and directors, but certain beneficial owners of more than 10% of equity have failed to file the required reports. We have requested that such parties file the delinquent reports to comply with its filing requirements.\nCode of Ethics\nOn September 22, 2020, we adopted a Code of Ethics that applies to our principal executive officer, principal financial officer, and principal accounting officer that is reasonably designed to deter wrongdoing and to promote:\n·honest and ethical conduct, including ethical handling of actual or apparent conflicts of interest between personal and professional relationships;\n·full, fair, accurate, timely, and understandable disclosure in SEC reports and in other public communications;\n·compliance with applicable governmental laws, rules, and regulations;\n·prompt internal reporting of violations of the Code of Ethics to the appropriate person or persons identified in the Code of Ethics; and\n·accountability for adherence to the Code of Ethics.\nThe description of the Code of Ethics contained in this prospectus is qualified in its entirety by reference to the full text of the Code of Ethics, which is incorporated by reference to the full text of the charter filed as Exhibit 14.01 to our Current Report on Form 8-K filed October 1, 2020. The Code of Ethics is also available on our website at www.bakhuholdings.com.\nCommittees of the Board\nIn the absence of any applicable regulatory or trading exchange requirement, we currently do not have nominating, compensation, or audit committees or committees performing similar functions, and we do not have written nominating, compensation, or audit committee charters. Our board of directors believes that it is not necessary to have these committees, at this time, because the directors can adequately perform the functions of such committees. ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table\nThe following table sets forth, for each of our last two completed fiscal years, the dollar value of all cash and noncash compensation earned by any person who was our principal executive officer and each of our three most highly compensated other executive officers or persons who were serving in such capacities during the preceding fiscal year (Named Executive Officers):\nName and\nPrincipal Position\nYear\nEnded\nJuly 31\nSalary\n($)\nBonus\n($)\nOption\nAwards\n($)\nNon\nEquity\nIncentive\nPlan\nCompen-\nsation\nAll Other\nCompen-\nsation\n($)\nTotal ($)\n(a)\n(b)\n(c)\n(d)\n(f)\n(g)\n(i)\n(j)\nEvripides Drakos\n-\n-\n$1,591,896\n-\n-\n$1,591,896\nPresident and CEO\n-\n-\n$ 711,246\n-\n-\n$ 711,246\nThomas K. Emmitt(1)\n-\n-\n-\n-\n-\n-\nPresident and CEO\n-\n-\n$ 711,246\n-\n-\n$ 711,246\nAristotle Popolizio\n$ 80,000\n-\n$1,591,896\n-\n-\n$1,671,896\nVice President and Secretary\n-\n-\n$ 711,246\n-\n-\n$ 711,246\nJuan Carlos Garcia La Sienra Garcia\n$ 30,000\n-\n$ 430,561\n-\n-\n$ 460,561\nChief Financial Officer\n-\n-\n-\n-\n-\n-\nMichael Hawthorne\n-\n-\n$ 455,982\n-\n-\n$ 455,982\nDeputy CEO\n-\n-\n-\n-\n-\n-\nNarrative Disclosure to Summary Compensation Table\nMr. Emmitt was appointed as the president, chief executive officer, secretary, chief financial officer, and director on May 15, 2018, and served in such capacities until his resignation on September 16, 2021. Mr. Emmitt served without compensation through September 22, 2020. On September 22, 2020, Mr. Emmitt was granted a non-qualified stock option to purchase 300,000 shares of common stock at an exercise price per share of $5.10. As of July 31, 2022, Mr. Emmitt held unexercised vested options to purchase 100,000 shares of common stock at $5.10 per share.\nMr. Drakos was appointed as a director on January 7, 2020, and as the chief executive officer and chairman on November 10, 2021. On September 22, 2020, Mr. Drakos was granted a non-qualified stock option to purchase 300,000 shares of common stock at an exercise price of $5.10 per share. On January 5, 2022, Mr. Drakos was granted a non-qualified stock option to purchase 700,000 shares of common stock at an exercise price of $2.60 per share, and on April 18, 2022, Mr. Drakos was granted a non-qualified stock option to purchase 1,300,000 shares of common stock at an exercise price of $3.30 per share. As of July 31, 2022, Mr. Drakos held unexercised vested options to purchase 941,665 shares of common stock.\nMr. Popolizio was appointed as a director on January 7, 2020, and as the vice president and secretary of September 22, 2022. On September 22, 2020, Mr. Popolizio was granted a non-qualified stock option to purchase 300,000 shares of common stock at an exercise price of $5.10 per share. On January 5, 2022, Mr. Popolizio was granted a non-qualified stock option to purchase 700,000 shares of common stock at an exercise price of $2.60 per share, and on April 18, 2022, Mr. Popolizio was granted a non-qualified stock option to purchase 1,300,000 shares of common stock at an exercise price of $3.30 per share. As of July 31, 2022, Mr. Popolizio held unexercised vested options to purchase 941,665 shares of common stock.\nMr. La Sienra Garcia was appointed as a director and chief financial officer on December 7, 2021. On December 7, 2021, Mr. La Sierna Garcia was granted a non-qualified stock option to purchase 300,000 shares of common stock at an exercise price of $3.40 per share. On July 29, 2029, Mr. La Sienra Garcia was granted a non-qualified stock option to purchase 160,000 shares of common stock at an exercise price of $1.50 per share. As of July 31, 2022, Mr. La Sienra Garcia held unexercised vested options to purchase 180,000 shares of common stock.\nMr. Hawthorne was appointed the Deputy chief executive officer on February 11, 2022, and was granted a non-qualified stock option to purchase 2,000,000 shares of common stock at an exercise price of $3.00 per share. As of July 31, 2022, Mr. Hawthorne held unexercised vested options to purchase 749,988 shares of common stock.\nDirector Compensation\nOn September 22, 2020, pursuant to our 2020 Long-Term Incentive Plan, or 2020 Plan, we granted to each of Thomas K. Emmitt, Dr. Peter Whitton, Aristotle Popolizio, and Evripides (Roy) Drakos, a non-qualified seven-year stock option to purchase 300,000 shares of common stock, for a total of 1,200,000 shares, at an exercise price of $5.10 per share, which was the approximate fair market value of our common stock as of the date of grant. Options for 60,000 shares vested and became exercisable immediately, with the remaining options vesting at the rate of 1/12 per month thereafter, so that all options will be fully vested and exercisable on the first anniversary of the date of grant. We also reimburse our non-employee directors for out-of-pocket expenses incurred in connection with attending board and committee meetings and have entered into an indemnification agreement with each of them.\nThe following table sets forth information concerning the compensation of our directors, for fiscal year ended July 31, 2022:\nName\nFees earned or paid in cash\n($)\nOption\nAwards\n($)\nAll Other\nCompen-\nsation\n($)\nTotal ($)\nEvripides Drakos(1)\n-\n$1,591,896\n-\n$1,591,896\nAristotle Popolizio(2)\n$ 80,000\n$1,591,896\n-\n$1,671,896\nPeter Whitton\n-\n-\n-\n-\nSagi Rozen(3)\n-\n$ 382,074\n-\n$ 382,074\nJuan Carlos Garcia La Sienra Garcia(4)\n$ 30,000\n$ 430,561\n-\n$ 460,561\nTom Vaknin(5)\n-\n$ 40,195\n-\n$ 40,195\nMoshe Morgenstern(5)\n-\n$ 40,195\n-\n$ 40,195\n(1)Includes the aggregate grant date fair value of 700,000 options with an exercise price of $2.60 per share granted on January 5, 2022, and 1,300,000 options with an exercise price of $3.30 per shares granted on April 18, 2022, as computed in accordance with FASB ASC Topic 718.\n(2)For Mr. Popolizio, reflects $80,000 cash compensation for his service as our vice president and secretary and includes the aggregate grant date fair value of 700,000 options with an exercise price of $2.60 per share granted on January 5, 2022, and 1,300,000 options with an exercise price of $3.30 per shares granted on April 18, 2022, as computed in accordance with FASB ASC Topic 718.\n(3)Mr. Rozen ceased serving on the Board as of July 29, 2022. Includes the aggregate grant date fair value of 300,000 options with an exercise price of $3.00 per share granted on December 3, 2021, and 160,000 options with an exercise price of $1.50 per shares granted on July 29, 2022, as computed in accordance with FASB ASC Topic 718.\n(4)Mr. La Sienra Garcia ceased serving on the Board as of July 29, 2022, but continues to serve as our chief financial officer. For Mr. La Sienra Garcia, reflects $30,000 cash compensation for his service as our Chief Financial Officer, and includes the aggregate grant date fair value of 300,000 options with an exercise price of $3.40 per share granted on December 7, 2021, and 160,000 options with an exercise price of $1.50 per shares granted on July 29, 2022, as computed in accordance with FASB ASC Topic 718.\n(5)Includes the aggregate grant date fair value of 300,000 options with an exercise price of $1.60 per share granted on July 29, 2022, as computed in accordance with FASB ASC Topic 718.\nOutstanding Equity Awards at Fiscal Year End\nThe following table provides information for the named executive officers on stock option holdings as of July 31, 2022.\nName\nGrant Date\nNumber of Shares of Stock Underlying Unexercised Vested Options (#)\nNumber of Shares of Stock Underlying Options that\nHave Not Vested (#)\nEquity Incentive plan awards: Number of securities underlying unexercised unearned options (#)\nOption Exercise Price ($)\nOption Expiration Date\nEvripides Drakos\n9/22/2020(1)\n100,000\n-\n-\n$\n5.10\n9/22/2027\nPresident and CEO\n1/5/2022(2)\n408,333\n291,667\n-\n$\n2.60\n1/4/2029\n4/18/2022(3)\n433,332\n866,668\n-\n$\n3.30\n4/17/2029\nAristotle Popolizio\n9/22/2020(1)\n100,000\n-\n-\n$\n5.10\n9/22/2027\nVice President and\n1/5/2022(4)\n408,333\n291,667\n-\n$\n2.60\n1/4/2029\nSecretary\n4/18/2022(5)\n433,332\n866,668\n-\n$\n3.30\n4/17/2029\nJuan Carlos Garcia\nLa Sienra Garcia\n12/6/2021(6)\n140,000\n-\n160,000\n$\n3.40\n12/5/2028\nCFO\n7/29/2022(7)\n40,000\n120,000\n-\n$\n1.50\n7/28/2029\nMichael Hawthorne\n2/11/2022(8)\n749,988\n1,250,012\n-\n$\n3.00\n2/10/2029\nDeputy CEO\n(1)Vesting commenced 9/22/2020 at a rate of 1/12 per month over 12 months.\n(2)Vesting commenced 1/31/2022 at a rate of 1/12 per month over 12 months. 100% of the options immediately vest (i) in the event of a Change in Control, or (ii) the optionees resignation as the chief executive officer (and not due to death or disability), or is not being reappointed in order to provide for the appointment of a new chief executive officer. In the event of the acceleration of vesting, such options shall remain exercisable for full term through the expiration date of such options.\n(3)Vesting commenced 4/30/2022 at a rate of 1/12 per month over 12 months. 100% of the options immediately vest (i) in the event of a Change in Control, or (ii) the optionees resignation as the chief executive officer (and not due to death or disability), or is not being reappointed in order to provide for the appointment of a new chief executive officer. In the event of the acceleration of vesting, such options shall remain exercisable for full term through the expiration date of such options.\n(4)Vesting commenced 1/31/2022 at a rate of 1/12 per month over 12 months. 100% of the options immediately vest (i) in the event of a Change in Control, or (ii) the optionees resignation as the vice president (and not due to death or disability), or is not being reappointed in order to provide for the appointment of a new vice president. In the event of the acceleration of vesting, such options shall remain exercisable for full term through the expiration date of such options.\n(5)Vesting commenced 4/30/2022 at a rate of 1/12 per month over 12 months. 100% of the options immediately vest (i) in the event of a Change in Control, or (ii) the optionees resignation as vice president (and not due to death or disability), or is not being reappointed in order to provide for the appointment of a new vice president. In the event of acceleration of vesting, such options shall remain exercisable for full term through the expiration date of such options.\n(6)60,000 options vested immediately with the balance vesting at the rate of 1/12 per month over 12 months commencing 12/31/2021.\n(7)Mr. La Sienra Garcia resigned as a director on July 29, 2022. As of the date of his resignation, options to purchase 140,000 shares were vested and remain exercisable through December 2, 2028, except in the event of his death, in which case such options will terminate if not exercised within six months.\n(8)40,000 options vested immediately with the balance vesting at the rate of 1/12 per month over 6 months commencing 8/29/2022. The 100% of the options immediately vest in the event of a Change in Control.\n(9)Vesting commenced 2/28/2022 at a rate of 1/48 per month over 48 months. In the event of a Change in Control, there shall be an acceleration of the vesting of the number options equal to 1,000,000 minus the number of options already vested.\nOptions Exercises at Fiscal Year End\nThere were no exercises of stock options during the fiscal year ended as of July 31, 2022.\nLong Term Equity Incentive Plan\nOn September 22, 2020, the board of directors adopted the 2020 Plan, under which 20,000,000 shares of our common stock were reserved for issuance by us to attract and retain employees and directors and to provide such persons with incentives and awards for superior performance and providing services to us. The 2020 Plan is administered by a committee comprised of our board of directors or appointed by the board of directors, which has broad flexibility in designing stock-based incentives. The board of directors determines the number of shares granted and the option exercise price pursuant to the 2020 Plan.\nUnder the 2020 Plan, incentive stock options may be granted only to our employees and non-qualified stock options, stock purchase rights, restricted stock units, and performance stock awards may be granted to employees, directors, or consultants who are natural persons under contract with us to provide bona fide services that are not in connection with a capital-raising transaction or do not directly or indirectly promote or maintain a market for our securities.\nThe 2020 Plan was effective on adoption by the board and will continue in effect for a term of no more than 10 years. The 2020 Plan was approved by the stockholders effective September 10, 2021. The board may amend, alter, suspend, or terminate the 2020 Plan, and material amendments to the 2020 Plan may require stockholder approval. The 2020 Plan provides for adjustments in the number of shares of common stock covered by each outstanding option award resulting from a future recapitalization. In the event of a merger with another company or the sale of substantially all of our assets, each outstanding stock option award will be assumed, or an equivalent option award will be substituted, by the successor corporation.\nAwards under the 2020 Plan cannot be sold, pledged, or assigned and may only be transferred under limited circumstances by will or by the laws of descent to immediate family members as defined in the 2020 Plan. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following tables sets forth certain information, as of October 31, 2022, respecting the beneficial ownership of our outstanding common stock by: (i) any holder of more than 5%; (ii) each of the Named Executive Officers (defined as any person who was principal executive officer during the preceding fiscal year and each other highest compensated executive officers earning more than $100,000 during the last fiscal year) and directors; and (iii) our directors and Named Executive Officers as a group, based on 301,182,983 shares of common stock and four shares of Series A Preferred Stock outstanding:\nSecurity Ownership of Certain Beneficial Owners\nCommon Stock\nPreferred Stock\nCombined\nName and Address\nof Beneficial Owner\nShares\nPercent\nof\nClass *\nShares\nPercent\nof\nClass *\nTotal\nVoting Power\nCombined\nVoting Power\nCell Science Holding Ltd. (1) and (2)\nPanteli Katelari 18A\nAgios, Ioannis\n3012 Limassol, Cyprus\n-\n0.00%\n100.00%\n1,204,731,932\n80.00%\nInter-M Traders FZ LLE (1) (2) and (3)\nPanteli Katelari 18A\nAgios, Ioannis, 3012 Limassol, Cyprus\n116,783,555\n38.77%\n100.00%\n1,321,515,487\n87.75%\nMentone Ltd. (1) (2) and (4)\nCoplow Crescent\nSyston, Leicester, England LE7 2JE\n6,000,000\n1.99%\n100.00%\n1,210,731,932\n80.40%\nThe OZ Corporation (1)(2) and (5)\nOne World Trade Center, Suite 130\nLong Beach, CA 90831\n10,980,994\n3.65%\n100.00%\n1,215,712,926\n80.73%\nPetro Charalambous (1) and (2)\nPanteli Katelari 18A\nAgios, Ioannis\n3012 Limassol, Cyprus\n116,783,555\n38.77%\n100.00%\n1,321,515,487\n87.75%\nPeter Whitton (1) (2) (4) and (6)\n3 Coplow Crescent\nSyston, Leicester, England LE7 2JE\n30,043,562\n9.97%\n100.00%\n1,234,775,494\n81.99%\nJohn R. Munoz (1) (2) and (5)\nOne World Trade Center, Suite 130\nLong Beach, CA 90831\n14,148,994\n4.70%\n100.00%\n1,218,880,926\n80.94%\nGeoffrey Dixon (1) (2) (4) and (7)\n3 Coplow Crescent\nSyston, Leicester, England LE7 2JE\n29,952,188\n9.94%\n100.00%\n1,234,684,120\n81.99%\nKarl Watkin (1) (2) (4) and (8)\n3 Coplow Crescent\nSyston, Leicester, England LE7 2JE\n32,952,187\n10.94%\n100.00%\n1,237,684,119\n82.19%\nThere are 301,182,983 shares of common stock and four (4) shares of Series A Preferred Stock outstanding. Each share of Series A Preferred Stock has voting rights equal to four (4) times the aggregate votes of the total number of shares of common stock issued and outstanding plus the total number of votes of all other classes of preferred stock issued and outstanding, divided by the number of shares of Series A Preferred Stock issued and outstanding, which have an equivalent of 1,204,731,932 votes.\nBeneficial ownership is determined in accordance with the rules of the Securities and Exchange Commission (SEC) which generally attribute beneficial ownership of securities to person, entity or group that directly or indirectly has or shares voting power or investment power with respect to those securities and includes the power to dispose, or direct the disposition of such securities, and includes shares of our common stock issuable pursuant to the exercise of stock options, warrants, preferred stock or other securities that are immediately exercisable or convertible or exercisable or convertible within 60 days.\n* To calculate a stockholders percentage of beneficial ownership of common stock, we must include in the numerator and denominator those shares of common stock underlying options, warrants and convertible securities that such stockholder is considered to beneficially own. Shares of common stock underlying options, warrants and convertible securities held by other stockholders, however, are disregarded in this calculation. Therefore, the denominator used in calculating beneficial ownership of each of the stockholders may be different.\n(1)Under the rules of the Securities and Exchange Commission, the named person or group is deemed to be the beneficial owner of all shares over which he or it exercises sole or shared dispositive or voting control, which includes the four (4) shares of Series A Preferred Stock owned of record by Cell Science.\n(2)Cell Science is owned by Inter-M Traders FZ LLE (40%), Mentone Ltd (30%), and The OZ Corporation (30%). The sole director of Cell Science is Petros Charalambous. Each of the foregoing is deemed to beneficially own the four (4) shares of Preferred Stock owned by Cell Science.\n(3)Inter-M Traders FZ LLE is owned and controlled by Petros Charalambous, and therefore Mr. Charalambous is deemed to beneficially own the shares owned by Inter-M Traders FZ LLE, which consists of 116,783,555 shares of common Stock, and the four (4) shares of Series A Preferred Stock owned beneficially through Cell Science.\n(4)Mentone Ltd. is owned by Peter Whitton, Geoffrey Dixon, and Karl Watkin. Each of the foregoing is deemed the beneficial owner of shares of Common Stock owned by Mentone, Ltd, and the four (4) shares of Series A Preferred Stock owned beneficially through Cell Science.\n(5)The OZ Corporation is owned and controlled by John R. Munoz. Each of the foregoing is deemed to beneficially own 10,980,994 shares of Common Stock owned beneficially and of record directly, 3,168,000 shares owned of beneficially by John R. Munoz, and four (4) shares of Series A Preferred Stock owned by Cell Science, of which The OZ Corporation is a 30% owner.\n(6)Consists of 23,943,562 shares of Common Stock owned beneficially and of record directly, 6,000,000 shares of Common Stock owned by Mentone Ltd., of which Mr. Whitton is an owner, 100,000 shares of Common Stock which Mr. Whitton currently has or will have within 60 days the right to acquire pursuant to stock options, and four (4) shares of Series A Preferred Stock owned beneficially through Cell Science, of which Mentone Ltd., is a 30% owner.\n(7)Consists of 23,952,188 shares of Common Stock owned beneficially and of record directly, 6,000,000 shares of Common Stock owned by Mentone Ltd., of which Mr. Dixon is an owner, and four (4) shares of Series A Preferred Stock owned beneficially through Cell Science, of which Mentone Ltd., is a 30% owner\n(8)Consists of 26,952,187 shares of Common Stock owned beneficially through his company Menelaus Holding FZ LLC, of record directly by Mentone Ltd., 6,000,000 shares of Common Stock owned by Mentone Ltd., of which Mr. Watkin is an owner, and four (4) shares of Series A Preferred Stock owned beneficially through Cell Science, of which Mentone Ltd., is a 30% owner.\nSecurity Ownership of Management\nCommon Stock\nPreferred Stock\nCombined\nName and Address\nof Beneficial Owner\nShares\nPercent\nof\nClass *\nShares\nPercent\nof\nClass *\nTotal\nVoting Power\nCombined\nVoting Power\nPeter Whitton (1) (2) and (3)\n3 Coplow Crescent\nSyston, Leicester, England LE7 2JE\n30,043,562\n9.97%\n100.00%\n1,234,775,494\n81.99%\nEvripides (Roy) Drakos (4)\nSfakion 10,\n4001 Limassol Cyprus\n1,901,879\n0.63%\n-\n0.00%\n1,901,879\n0.13%\nAristotle Popolizio (5)\n206 Passaic Avenue\nRoseland, NJ 07068\n1,901,879\n0.63%\n-\n0.00%\n1,901,879\n0.13%\nTom Vaknin (6)\nSprou Kyprianou 16\n4529 Pyrhos, Limassol\n160,000\n0.05%\n-\n0.00%\n160,000\n0.01%\nMoshe Morgenstern (7)\n23 Ze'ev Jabotinsky Street\nRamat Gan, Israel\n160,000\n0.05%\n-\n0.00%\n160,000\n0.01%\nJuan Carlo Garcia La Sienra Garci (8)\n3 Shanewood Court\nThe Woodlands, TX 77382\n280,000\n0.09%\n-\n0.00%\n280,000\n0.02%\nMichael R. Hawthorne (10)\nInchdarnie House\nMelrose, UK TD6 0BB\n458,326\n0.15%\n-\n0.00%\n458,326\n0.03%\nAll executive officers and directors as a group (seven persons)\n28,585,646\n9.35%\n100.00%\n1,233,317,578\n81.66%\nThere are 301,182,983 shares of common stock and four (4) shares of Series A Preferred Stock outstanding. Each share of Series A Preferred Stock has voting rights equal to four (4) times the aggregate votes of the total number of shares of common stock issued and outstanding plus the total number of votes of all other classes of preferred stock issued and outstanding, divided by the number of shares of Series A Preferred Stock issued and outstanding, which have an equivalent of 1,204,731,932 votes.\nBeneficial ownership is determined in accordance with the rules of the Securities and Exchange Commission (SEC) which generally attribute beneficial ownership of securities to person, entity or group that directly or indirectly has or shares voting power or investment power with respect to those securities and includes the power to dispose, or direct the disposition of such securities, and includes shares of our common stock issuable pursuant to the exercise of stock options, warrants, preferred stock or other securities that are immediately exercisable or convertible or exercisable or convertible within 60 days.\n* To calculate a stockholders percentage of beneficial ownership of common stock, we must include in the numerator and denominator those shares of common stock underlying options, warrants and convertible securities that such stockholder is considered to beneficially own. Shares of common stock underlying options, warrants and convertible securities held by other stockholders, however, are disregarded in this calculation. Therefore, the denominator used in calculating beneficial ownership of each of the stockholders may be different.\n(1)Cell Science is owned by Inter-M Traders FZ LLE (40%), Mentone Ltd (30%), and The OZ Corporation (30%). The sole director of Cell Science is Petros Charalambous. Each of the foregoing is deemed to beneficially own the four (4) shares of Preferred Stock owned by Cell Science.\n(2)Mentone Ltd. is owned by Peter Whitton, Geoffrey Dixon, and Karl Watkin. Each of the foregoing is deemed the beneficial owner of shares of Common Stock owned by Mentone, Ltd, and the four (4) shares of Series A Preferred Stock owned beneficially through Cell Science.\n(3)Consists of 23,943,562 shares of Common Stock owned beneficially and of record directly, 6,000,000 shares of Common Stock owned by Mentone Ltd., of which Mr. Whitton is an owner, 100,000 shares of Common Stock which Mr. Whitton currently has, or will have within 60 days, the right to acquire pursuant to stock options, and four (4) shares of Series A Preferred Stock owned beneficially through Cell Science, of which Mentone Ltd., is a 30% owner.\n(4)Consists of 126,882 shares of Common Stock owned beneficially and of record directly, and 1,774,997 shares of Common Stock which Mr. Drakos currently has, or will have within 60 days, the right to acquire pursuant to stock options.\n(5)Consists of 126,882 shares of Common Stock owned beneficially and of record directly, and 1,774,997 shares of Common Stock which Mr. Popolizio currently has, or will have within 60 days, the right to acquire pursuant to stock options.\n(6)Consists of 160,000 shares of Common Stock which Mr. Vaknin currently has, or will have within 60 days, the right to acquire pursuant to stock options.\n(7)Consists of 160,000 shares of Common Stock which Mr. Morgenstern currently has, or will have within 60 days, the right to acquire pursuant to stock options.\n(8)Consists of 280,000 shares of Common Stock which Mr. Garcia currently has, or will have within 60 days, the right to acquire pursuant to stock options.\n(9)Consists of 458,326 shares of Common Stock which Mr. Hawthorne currently has or will have within 60 days the right to acquire pursuant to stock options.\nExcept as noted, the persons named in the above tables have sole voting and dispositive power respecting all shares beneficially owned, subject to community property laws where applicable. Beneficial ownership is determined according to the rules of the SEC, which generally means that a person is deemed to have beneficial ownership of a security if he, she, or it possesses sole or shared voting or investment power over that security. Each director, executive officer, or 5% or more beneficial stockholder has furnished the information respecting beneficial ownership. All securities of the same class beneficially owned by a person, regardless of the form of such beneficial ownership, are aggregated in calculating the number of shares beneficially owned by such person. Shares owned by an entity are generally deemed beneficially owned by each executive officer, director, or beneficial or of record owner of 10% or more of the issued common stock of the entity. Stock held by a person in a trust or other entity organized by a person to circumvent the beneficial ownership attribution rules are deemed owned by the person creating such trust or other entity.\nEach share of Series A Preferred Stock has voting rights equal to four times the aggregate votes of the total number of shares of common stock issued and outstanding plus the total number of votes of all other classes of preferred stock issued and outstanding, divided by the number of shares of Series A Preferred Stock issued and outstanding. Consequently, the four shares of Series A Preferred Stock have the equivalent of 1,204,731,932 votes, and thus, the holders of the four shares of Series A Preferred Stock are able to unilaterally control the election of our board of directors and, ultimately, our direction.\nApplicable ownership percentages are based on 301,182,983 shares of common stock and four shares of Series A Preferred Stock outstanding as of the date of this prospectus. In computing the number of shares of common stock beneficially owned and the percentage ownership of a person, we deemed the holder of options to beneficially own the common stock purchasable on exercise of the options, without respect to when the granted options may vest. We considered shares issuable under options held by a particular person or group as outstanding for the calculation of percentages of ownership of that particular person or group. However, we did not deem these shares outstanding for the purpose of computing the percentage ownership of any other person.\nChanges in Control\nTo the best of our knowledge there are no present arrangements or pledges of our securities that may result in a change in control. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nOur Organization\nCommencing in 2017, Inter-M Traders FZ, LLE, a UAE company, initiated an effort to commercialize a proprietary cell replication technology invented principally by Dr. Whitton and held with his associates by Mentone, Inc. To implement this strategy, the cell replication intellectual property was transferred to a newly organized Cyprus limited liability company, Cell Science Holding Ltd. (Cell Science), which is owned 40% by Inter-M Traders FZ LLE, 30% by Mentone Ltd, and 30% by OZ Corporation. In turn, in late 2018, Cell Science granted to Bakhu certain licensing rights to the cell replication technology to produce cannabinoids in North America. Bakhu was then a dormant US publicly held corporation. As partial consideration for the license, Bakhu issued 210,000,000 shares of common stock to Cell Science. The following details material current relationships.\nCertain Relationships\nThe following relationships are known by us to exist among parties with whom or which we have had or have transactions.\n·We obtained the license of rights to the intellectual property on which our business is based from Cell Science Holding Ltd., which is owned 40% by Inter-M Traders FZ, LLE., 30% by Mentone Ltd., and 30% by OZ Corporation.\n·Cell Science Holding Ltd., the licensor owns all four shares of our outstanding Series A Preferred Stock which represents 80.00% of the voting power of the corporation on all matters submitted to the stockholders for consideration.\n·Inter-M Traders FZ, LLE, owns 116,783,555 shares of our outstanding common stock, and as a 40% owner of Cell Science, which owns all four shares of our outstanding Series A Preferred Stock, these holdings together represent 87.75% of the voting power of the corporation on all matters submitted to the stockholders for consideration. Additionally, as a result of its ownership in Cell Science, Inter-M Traders FZ, LLE has a direct interest in the licensor, Cell Science.\n·Petros Charalambous is the sole owner, director and Manager of each of Cell Science and Inter-M Traders FZ LLE, and is therefore deemed to be the beneficial owner of the 116,783,555 shares of our outstanding common stock owned by Inter-M Traders FZ LLE, and the four shares of our outstanding Series A Preferred Stock owned by Cell Science, which these holdings together represent 87.75% of the voting power of the corporation on all matters submitted to the stockholders for consideration. Petros Charalambous is also a director of the Inter-M Group of Companies.\n·Mentone Ltd., a United Kingdom company, is owned by Dr. Peter Whitton, Geoffrey Dixon, and Karl Watkin. Mentone Ltd. owns 6,000,000 shares of our outstanding common stock. In addition, Mentone Ltd. is a 30% owner of Cell Science, which owns all four shares of our outstanding Series A Preferred Stock. Collectively, Mentone Ltd.s ownership of our stock represents 80.40% of the voting power of the Corporation on all matters submitted to the stockholders for consideration. Additionally, Messrs. Whitton, Dixon, and Watkin as a result of their ownership of Mentone Ltd., are therefore each deemed to be the beneficial owner of the shares of common stock Mentone owns and the four shares of our outstanding Series A Preferred Stock.\n·Dr. Peter Whitton, our director, is the inventor of the licensed technology that is the subject of the Integrated License Agreement set forth above. As a result of his direct ownership of shares of common stock, his ownership in Mentone Ltd., and Mentones ownership of Cell Science, Dr. Whittons collective ownership of our stock represents 81.99% of the voting power of the Corporation on all matters submitted to the stockholders for consideration. Dr. Whitton is also an Associate Director of the Inter-M Group of Companies.\n·Geoffrey Dixon is a 33% owner of Mentone Ltd. As a result of his direct ownership of shares of common stock, his ownership in Mentone Ltd., and Mentones ownership of Cell Science, Mr. Dixons collective ownership of our stock represents 81.99% of the voting power of the Corporation on all matters submitted to the stockholders for consideration. Mr. Dixon is also an Associate Director of the Inter-M Group of Companies.\n·OZ Corporation is owned and controlled by John R. Munoz. OZ Corporation is the beneficial owner and owner of record of 10,980,994 shares of our common stock, and John R. Munoz is the beneficial owner of 3,168,000 shares of our outstanding common stock. In addition, OZ Corporation is a 30% owner of Cell Science. As a result of his and OZ Corporations direct ownership of shares of common stock and OZ Corporations ownership of Cell Science, OZ Corporation and Mr. Munozs collective ownership of our stock represents 80.94% of the voting power of the Corporation on all matters submitted to the stockholders for consideration. As a result of its ownership in Cell Science, OZ Corporation has a direct interest in the licensor, Cell Science. Additionally, Mr. Munoz is a Managing Partner of the Inter-M Traders Group of Companies.\n·Demetri Michalakis, the Chairman of Inter-M Traders Group of Companies provides financial, strategic and advisory services to the Company. The Inter-M Traders Group of Companies has an ongoing and continuing relationship with Cell Science, Bakhu, OZ Corporation, and Blackhawk Science among others. Mr. Michalakis is the father of Aristotle Popolizio, our director and an executive officer.\n·Thomas K. Emmitt, a former director and our former, president, chief executive officer, and chief financial officer, also serves as in-house legal counsel to OZ Corporation, which is a direct owner of our equity and owns 30% of Cell Science, the licensor.\n·Aristotle Popolizio, our director, vice president and secretary, also serves as head of investment relations at the Inter-M Trading Group of Companies, and is the son of Demetri Michalakis, the Chairman of Inter-M Trading Group of Companies.\n·Evripides (Roy) Drakos is our director and a high-tech investment advisor focusing on national and international expansion strategies.\n·Juan Carlos Garcia La Sienra Garcia is a former director, our Chief Financial Officer, and the former president of Woodbrook Group Holdings, Inc., one of the Inter-M Traders Group of Companies.\nDirector Independence\nThe board has determined that three of its directors, Evripides Drakos, Tom Vaknin and Moshe Morgenstern have met the independence requirements based upon the application of objective categorical standards adopted by the board. In determining director independence, the board considers all relevant facts and circumstances, including the directors commercial, banking, consulting, legal, accounting, charitable, and familial relationships and such other criteria as the board may determine from time to time.\nRelated Party Transactions\nThe following transactions to which we are a party, were entered into between related parties and are not, therefore, the result of arms-length negotiations. We cannot assure that the terms and conditions of these transactions are as favorable to us as we could have obtained in arms-length negotiations between qualified unrelated parties in similar circumstances.\nEfficacy Demonstration Laboratory Agreement\nAs stated above, we and OZ Corporation are parties to that certain Efficacy Demonstration Laboratory Agreement that memorializes the understanding and agreement under which we engaged OZ Corporation to undertake the efficacy demonstration required under the Amended Restated License. Pursuant to the Efficacy Demonstration Laboratory Agreement, we agreed to repay all costs incurred by OZ Corporation in performing the\nefficacy demonstration in accordance with the Efficacy Demonstration Laboratory Agreement. We consider this agreement to have been superseded by the Agreement, Assignment Waiver and Estoppel dated September 22, 2020, between us, OZ Corporation, and others. Therefore, the Efficacy Demonstration Laboratory Agreement is not being implemented.\nOZ Corporations Loans and Advances to Us\nOZ Corporation has loaned monies to us and has advanced to us or paid on our behalf certain expenses associated with our operations. Such loans or advances are evidenced by a Promissory Note dated August 1, 2019 (the 2019 OZ Note). As of July 31, 2022, the outstanding principal balance and accrued interest owing under the 2019 OZ Note was $2,723,731and $210,190, respectively. The principal amount of the 2019 OZ Note will be increased by the amount of any additional advances of funds made by OZ Corporation to us, from time to time. This 2019 OZ Note was due December 31, 2020, but we did not have cash available to pay it. The note provides that we may extend the due date by an additional 12 months by paying an extension fee of 1.00% of the outstanding principal loan balance, which may, at OZ Corporations option, be advanced and added to the then outstanding principal balance. Effective as of December 31, 2020, OZ Corporation extended the maturity date of the note until December 31, 2021, and we have further extended the due date of the note by an additional 12 months, until December 31, 2022, by paying an extension fee of 1.00% of the outstanding principal loan balance, which may, at OZ Corporations option, be advanced and added to the then outstanding principal balance. The note provides that OZ Corporation may, at any time, convert all or any portion of the then unpaid principal balance and any unpaid accrued interest into shares of our common stock at a conversion price equal to 80% of the average closing price of our common stock for the 90 trading days before the conversion date, rounded up to the nearest whole share.\nAdditionally, under a separate Promissory Note dated June 23, 2022 (the 2022 OZ Note), OZ Corporation loaned us the principal amount of $150,000 for insurance related expensed. Under the terms of the 2022 OZ Note simple interest will accrue at rate of 7% per annum until paid in full. All unpaid principal and unpaid accrued interest will be due and payable from the first net proceeds received by the Company from external funding of any kind or nature provided by persons that are not, directly or indirectly, affiliates of the Company, but in any event on or before the close of business on December 15, 2024.\nPatent and Technology License\nOriginal 2018 Agreement. As discussed above, our Integrated License Agreement comprises a Patent and Technology License Agreement dated December 20, 2018, and entered into with Cell Science. That Patent and Technology License Agreement was amended and restated by an Amended and Restated Patent and Technology License Agreement (the Amended Restated License) dated December 31, 2019, which was in turn amended successively on September 22, 2020, February 8, 2021 and July 12, 2021. As consideration for this 2018 license, we issued 210,000,000 shares of our common stock to Cell Science, which then became our principal common stockholder. With the completion of the efficacy demonstration as discussed above, all 210,000,000 shares have been released and are no longer subject to reduction or forfeiture. Further, as additional consideration for the grant of the License, we will make a one-time payment of $3.5 million subject to certain adjustments and credits, payable pursuant to a promissory note to be issued to Cell Science, and payable one year from the date of issuance of the promissory note.\nSeptember 22, 2020, Amendment to the Amended Restated License. On September 22, 2020, we and Cell Science entered an Amendment to the Amended Restated License (the 2020 Amendment). Pursuant to the 2020 Amendment, the Amended Restated License was revised and amended as follows:\n1.The previous specifications for the efficacy demonstration were replaced with new requirements.\n2.Section 4.1 of the Amended Restated License was amended to provide that 190,000,000 of the 210,000,000 shares of common stock we previously delivered to Cell Science would remain subject to forfeiture, and 20,000,000 shares would be free from possible forfeiture and be released to Cell Science.\n3.The 2020 Amendment clarified the criteria and procedure to be applied in the efficacy demonstration in determining the percentage of achievement against the standard results claimed by the inventor that would be used to calculate the number of available to be forfeited by Cell Science and returned to us.\n4.The one-time cash payment of $3.5 million, less agreed credits, would be paid pursuant to a one-year promissory note.\n5.Cell Science would execute, have acknowledged, and deliver to us a Patent and Technology License that we would hold in trust. Upon our delivery of the one-time payment note we would record the Patent and Technology License.\n6.Upon delivery of the one-time payment note, we would be deemed to have satisfied all representations, warranties, terms, covenants, and conditions required to have been performed, satisfied, or met by us so that any subsequent breach would alter or affect in any way our rights to the license. Notwithstanding the foregoing, if we are found to have breached any covenant under the agreement, Cell Sciences remedy would be limited to substitution in our place in any commercialization arrangement we have entered, subject to generally prevailing equitable principles and applicable rights and limitation under U.S. Bankruptcy Law.\n7.Any breach of or default by us relating to patent prosecution or expenses would not alter, affect, or result in the forfeiture of any of our rights and license.\nFebruary 2021 Amendment. Under the February 2021 amendment, the Amended and Restated License was further was amended to reflect that 26,000,000 shares, rather than 20,000,000 shares provided under the 2020 Amendment, will be free from possible forfeiture under the License Agreement, pursuant to the terms and provisions of this amendment.\nJuly 2021 Amendment. Based on an evaluation of the technical laboratory testing results achieved by July 2021, and in the light of the desire to launch immediately an aggressive commercialization program directed at achieving recurring revenue, we agreed to a substantial revision to the technical specifications, protocols, and procedures to be followed to measure the commercial efficacy of the licensed technology, which accelerated the date on which the efficacy demonstration requirement of the technology was satisfied.\nUnder the July 2021 amendment, we and Cell Science adopted new efficacy demonstration technical specifications, protocols, and procedures that, in general, provided that:\n1.the existing seed cultures can be used for the extended loading of the bioreactors used in the test;\n2.the results of the three last bioreactors harvested, along with two bioreactors specifically designated as bioreactors 4 and 5, which have been recently loaded, will comprise the five bioreactors on which results will be tested;\n3.results from bioreactors 1 through 5 (or successive successful bioreactor tests), will be used to determine the percentage of target results achieved under the license agreement; and\n4.the requirement that the results be replicated in five additional bioreactors be eliminated.\nUnder these revised criteria, actual test results from the five bioreactors, confirmed by an independent laboratory, demonstrated that the following testing standards were fully satisfied:\n1.a quantity standard of harvested and dried cell concentrate equaling or exceeding both 90 kilograms (approximately 198 pounds) for two successive groups of five bioreactors each and 18 kilogram (approximately 39 pounds) of cells and media culture for each bioreactor in the group;\n2.a quality standard of cells produced, harvested, and dried during the full cycle of the process from each bioreactor harvest contain the targeted volume of cannabinoids expressed in kilogram that mirror the same levels of THC and CBD as the donor cells utilizing the formula: 18 times original THC/CBD\npercentage of donor plant equals the end product expressed in kilogram, with this result from each bioreactor and all five bioreactors of two successive groups of five reactors each affirmed by a third-party testing laboratory; and\n3.a cost standard of projected utilities and supplies plus actual material costs per bioreactor and for two successive groups of five bioreactors, excluding administrative and labor expenses, capital expenditures, or prorated leasehold expenses, of $0.10 per gram of THC/CBD.\nAs a result of this successful testing, all 184,000,000 shares subject to return to us were released to their owners, and we became obligated to issue Cell Science a one-year promissory note in the principal amount of $3.5 million, reduced by specified offsets and credits. Importantly, upon the issuance of this promissory note, we can record the Patent and Technology License to publicly notify potential commercial partners and others of our vested rights.\nJanuary 2022 Amendment to Integrated License. On January 31, 2022, we and Cell Science entered into the Third Amendment to Integrated License Agreement in which we agreed:\n1.There would be no reduction and offset against the $3.5 million one-time payment for certain costs paid by us or on our behalf. Therefore, we issued a $3.5 million promissory note, bearing interest at the applicable federal short-term rate of 0.44% under IRC Section 1274(d), payable in January 2023.\n2.In lieu of any offset and reduction against the one-time payment note, Cell Science agreed to convey to us the lease on the California laboratory in which the efficacy demonstration was conducted, including all related equipment, improvements, supplies, and related tangible and intangible assets.\n3.Cell Science caused OZ Corporation to execute and deliver a similar conveyance of all rights to the California laboratory.\n4.The Integrated License Agreement was clarified to provide that all improvements to the licensed technology made by us would be owned by Cell Science and included in the licensed technology.\nOffice Cost Sharing Agreement\nOn September 22, 2020, we and OZ Corporation, our controlling stockholder, entered into an Office Cost Sharing Agreement under which we agreed to share the office costs and expenses associated with the office space, equipment, telephone and internet service, utilities, answer services and support staff provided by OZ Corporation for a fixed amount of $34,000 per month. We use these facilities as our principal offices, for our accounting staff, and for Bus Dev Centre, Inc. and its principal, Donald Clark, who provides advisory and consulting services in furtherance of, among other things, our anticipated commercialization efforts. During the year ended July 31, 2021, we had not paid any of the fees due to OZ Corporation under the Officer Sharing Agreement.\n____________________\nThe foregoing transactions described in this section between us, on the one hand, and Cell Science and the other persons or entities set forth above, on the other hand, were not the result of arms-length negotiations.\nThe foregoing summary of the terms of the various agreements described is not complete, does not contain all information that is of interest to the reader, and is qualified in its entirety by reference to the full text of each such agreement, which is included or incorporated by reference as an exhibit to this prospectus.\nExcept as set forth above, we have not been a party to any transactions with persons who were, at the time of the transaction, an executive officer, director, principal stockholder, or other affiliate of our company. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe firm of BF Borgers CPA, P.C. has served as our independent registered public accounting firm since the year ended July 31, 2018. We anticipate that representatives of BF Borgers CPA, P.C. will be present at any annual meeting and will be provided the opportunity to make a statement, if they desire to do so, and respond to appropriate questions.\nAudit Fees\nFor our fiscal year ended July 31, 2022, we were billed approximately $83,800 for professional services rendered for the audit and reviews of our consolidated financial statements. For our fiscal year ended July 31, 2021, we were billed approximately $36,720 for professional services rendered for the audit and review of our consolidated financial statements.\nAudit Related Fees\nFor our fiscal years ended July 31, 2022 and 2021, we did not incur any audit-related fees.\nTax Fees\nWe did not incur any fees for professional services rendered for tax compliance, tax advice, and tax planning services for the fiscal years ended July 31, 2022 and 2021.\nAll Other Fees\nWe did not incur any other fees related to services rendered by our principal accountant for the fiscal years ended July 31, 2022 and 2021.\nAudit and Non-Audit Service Preapproval Policy\nIn accordance with the requirements of the Sarbanes-Oxley Act of 2002 and the rules and regulations promulgated thereunder, our board of directors has adopted an informal approval policy that it believes will result in an effective and efficient procedure to preapprove services performed by the independent registered public accounting firm.\nAll professional services rendered by principal accountants for the audit of our annual financial statements that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for last two fiscal years were approved by our board of directors.\nAudit Services\nAudit services include the annual financial statement audit (including quarterly reviews) and other procedures required to be performed by the independent registered public accounting firm to be able to form an opinion on our consolidated financial statements. The board of directors preapproves specified annual audit services engagement terms and fees and other specified audit fees. All other audit services must be specifically preapproved by the board of directors. The board of directors monitors the audit services engagement and may approve, if necessary, any changes in terms, conditions, and fees resulting from changes in audit scope or other items.\nAudit-Related Services\nAudit-related services are assurance and related services that are reasonably related to the performance of the audit or review of our consolidated financial statements, which historically have been provided to us by the independent registered public accounting firm and are consistent with the Securities and Exchange Commissions rules on auditor independence. The board of directors preapproves specified audit-related services within preapproved fee levels. All other audit-related services must be preapproved by the board of directors.\nTax Services\nThe board of directors preapproves specified tax services that it believes would not impair the independence of the independent registered public accounting firm and that are consistent with Securities and Exchange Commissions rules and guidance. The board of directors must specifically approve all other tax services.\nAll Other Services\nOther services are services provided by the independent registered public accounting firm that do not fall within the established audit, audit-related, and tax services categories. The board of directors preapproves specified other services that do not fall within any of the specified prohibited categories of services.\nProcedures\nAll proposals for services to be provided by the independent registered public accounting firm, which must include a detailed description of the services to be rendered and the amount of corresponding fees, are submitted to the board of directors and the chief financial officer. The chief financial officer authorizes services that have been preapproved by the board of directors. The chief financial officer submits requests or applications to provide services that have not been preapproved by board of directors, which must include an affirmation by the chief financial officer and the independent registered public accounting firm that the request or application is consistent with the Securities and Exchange Commissions rules on auditor independence, to the board of directors for approval.\nPART IV. ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Exhibits. The following exhibits are either filed as a part hereof or are incorporated by reference. Exhibit numbers correspond to the numbering system in Item 601 of Regulation S-K.\nExhibit\nNumber*\nDescription of Exhibit\n3(i)\nAmended and Restated Articles of Incorporation of Bakhu Holdings, Corp. (1)\n3(ii)\nAmended and Restated By-Laws of Bakhu Holdings, Corp. (1)\n4(i)\nCertificate of Designation of Series A Preferred Stock (1)\n4(ii)\nCertificate of Designation of Series B Preferred Stock (1)\n10.1\nPatent and Technology License Agreement dated December 20, 2018 (2)\n10.2\nAmended and Restated Patent and Technology License Agreement dated December 31, 2019 (3)\n10.3\nStrategic Alliance Agreement between CBD Biotech Inc and ICS dated April 17, 2020\n10.4\nSublicense Agreement between CBD Biotech and ICS dated April 22, 2020\n10.6\nEfficacy Demonstration Laboratory Agreement dated June 10, 2020 (5)\n10.7\nAmendment to Amended and Restated License Agreement dated September 22, 2020 (6)\n10.8\nAgreement, Assignment Waiver and Estoppel dated September 22, 2020 (6)\n10.9\nForm of Indemnification Agreement entered into between the Company and directors Thomas Emmitt, Peter Whitton, Aristotle Popolizio and Euripides Drakes on September 22, 2022, and with Teddy Scott on September 16, 2021(6)\n10.10\nAssignment and Assumption Agreement dated September 22, 2020 (6)\n10.11\nOffice Cost Sharing Agreement dated September 22, 2020 (6)\n10.12\nBakhu 2020 Long-Term Incentive Plan (6)\n10.13\nAudit Committee Charter (6)\n10.14\nConsulting Agreement with Fourth and G Holdings, LLC dated June 7, 2021(7)\n10.15\nTranche 1 Warrant issued to Fourth and G Holdings, LLC dated June 7, 2021(7)\n10.16\nTranche 2 Warrant issued to Fourth and G Holdings, LLC dated June 7, 2021(7)\n10.17\nFirst Amendment to Amended and Restated License Agreement dated February 12, 2021(12)\n10.18\nSecond Amendment to Amended and Restated License Agreement dated July 12, 2021(8)\n10.19\nConsulting Agreement with Damian Solomon dated July 28, 2021(9)\n10.20\nConsulting Agreement with Sean Akhavan dated July 28, 2021(9)\n10.21\nFirst Amendment to Consulting Agreement and Warrants dated September 12, 2021(10)\n10.22\nExecutive Employment Agreement with Teddy Scott dated September 16, 2021(11)\n10.23\nThird Amendment to Integrated License Agreement dated January 31, 2022(13)\n10.24\nEmployment Agreement dated February 11, 2022(14)\n10.25\nConsulting Agreement dated February 11, 2022(14)\n10.26\nSecond Amendment to BDC Consulting Agreement dated July 14, 2022(15)\n10.27\nPromissory Note dated June 23, 2022(15)\n10.28\nForm of Director Agreement(16)\n10.29\nForm of Confidentiality and Nondisclosure Agreement(16)\n10.30\nForm of Indemnification Agreement(16)\n14.01\nCode of Ethics (6)\nSubsidiaries (5)\n31(i)\nCEO certification pursuant to Section 302 of the Sarbanes - Oxley Act of 2002 (17)\n31(ii)\nCFO certification pursuant to Section 302 of the Sarbanes - Oxley Act of 2002 (17)\nCEO and CFO certification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (17)\n101**\nThe following materials from the Company's Annual Report on Form 10-K for the year ended July 31, 2022 formatted in Extensible Business Reporting Language (\"XBRL\"): (i) the balance sheets (unaudited); (ii) the statements of operations (unaudited); (iii) the statements of cash flows (unaudited); and, (iv) related notes.\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase\n101.LAB\nXBRL Taxonomy Extension Label Linkbase\n(1)Previously filed on Form 8-K on August 22, 2018\n(2)Previously filed on Form 8-K on December 27, 2018\n(3)Previously filed on Form 8-K on January 14, 2020\n(4)Previously filed on Form 8-K on April 27, 2020\n(5)Previously filed on Form 8-K on June 12, 2020\n(6)Previously filed on Form 8-K on October 1, 2020\n(7)Previously filed on Form 8-K on June 16, 2021\n(8)Previously filed on Form 8-K on July 12, 2021\n(9)Previously filed on Form 8-K on August 2, 2021\n(10)Previously filed on Form 8-K on September 14, 2021\n(11)Previously filed on Form 8-K on September 21, 2021\n(12)Previously filed on Form 10-Q on January 11, 2022\n(13)Previously filed on Form 8-K on February 3, 2022\n(14)Previously filed on Form 8-K on February 17, 2022\n(15)Previously filed on Form 8-K on July 22, 2022\n(16)Previously filed on Form 8-K on August 4, 2022\n(17) Filed herewith\n*\nAll exhibits are numbered with the number preceding the decimal indicating the applicable SEC reference number in Item 601 and the number following the decimal indicating the sequence of the particular document.\n(b)Financial Statement Schedules. The following financial statements are filed as part of this report:\nPage\nAudited Consolidated Financial Statements for the Years Ended July 31, 2022 and 2021:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of July 31, 2022 and 2021\nConsolidated Statements of Operations for the Years Ended July 31, 2022 and 2021\nConsolidated Statements of Changes in stockholders Equity for the Years Ended July 31, 2022 and 2021\nConsolidated Statements of Cash Flows for the Years Ended July 31, 2022 and 2021\nNotes to the Consolidated Financial Statements\nAll financial statement schedules are omitted because the information required to be set forth therein is not applicable or is shown in the financial statements or the notes thereto.\nITEM 16.FORM 10-K SUMMARY\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nBAKHU HOLDINGS, CORP.\nDated: November 4, 2022\n/s/ Evripides Drakos\nBy: Evripides Drakos\nIts: Chief Executive Officer and Principal Executive Officer\nDated: November 4, 2022\n/s/ Juan Carlos Garcia La Sienra Garcia\nBy: Juan Carlos Garcia La Sienra Garcia\nIts: Chief Financial Officer and Principal Accounting Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDated: November 4, 2022\n/s/ Evripides Drakos\nBy: Evripides Drakos, Director\nDated: November 4, 2022\n/s/ Aristotle Popolizio\nBy: Aristotle Popolizio, Director\nDated: November 4, 2022\n/s/ Peter Whitton\nBy: Peter Whitton, Director\nDated: November 4, 2022\n/s/ Tom Vaknin\nBy: Tom Vaknin, Director\nDated: November 4, 2022\n/s/ Moshe Morgenstern\nBy: Moshe Morgenstern, Director\nBAKHU HOLDINGS, CORP.\nFINANCIAL STATEMENTS\nJuly 31, 2022 and 2021\nC O N T E N T S\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of stockholders Equity (Deficit)\nConsolidated Statements of Cash Flows\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Bakhu Holdings, Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Bakhu Holdings, Corp. as of July 31, 2022 and 2021, the related statements of operations, stockholders' equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Companys significant operating losses raise substantial doubt about its ability to continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matter\nCritical audit matters are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments.\nWe determined that there are no critical audit matters.\n/S/ BF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Company's auditor since 2016\nLakewood, CO\nOctober 31, 2022\nBAKHU HOLDINGS, CORP.\nConsolidated Balance Sheets\nJuly 31,\nJuly 31,\nASSETS\nCURRENT ASSETS\nCash and cash equivalents\n$12,451\n$46,929\nTotal Current Assets\n12,451\n46,929\nOTHER ASSETS\nFixed assets, net of accumulated depreciation of $76,516 and $-0-, respectively\n688,644\n-\nTotal Other Assets\n688,644\n-\nTOTAL ASSETS\n$701,095\n$46,929\nLIABILITIES AND STOCKHOLDERS' EQUITY (DEFICIT)\nCURRENT LIABILITIES\nAccounts payable and accrued liabilities\n$1,265,968\n$499,580\nAccrued interest\n218,919\n81,987\nNotes payable - related parties\n6,373,731\n1,930,783\nTotal Current Liabilities\n7,858,618\n2,512,350\nTOTAL LIABILITIES\n7,858,618\n2,512,350\nSTOCKHOLDERS' EQUITY (DEFICIT)\nPreferred stock, $0.001 par value; 50,000,000 shares authorized,\n4 and 4 shares issued and outstanding, respectively\n-\n-\nCommon stock, $0.001 par value; 500,000,000 shares authorized, 301,282,983 and 300,697,980 shares issued and outstanding, respectively\n301,283\n300,698\nAdditional paid-in capital\n36,070,822\n19,848,569\nAccumulated deficit\n(43,529,628)\n(22,614,688)\nTotal Stockholders' Equity (Deficit)\n(7,157,523)\n(2,465,421)\nTOTAL LIABILITIES AND STOCKHOLDERS' EQUITY (DEFICIT)\n$701,095\n$46,929\nThe accompanying notes are an integral part of these financial statements.\nBAKHU HOLDINGS, CORP.\nConsolidated Statements of Operations\nFor the Years Ended\nJuly 31,\nNET REVENUES\n$-\n$-\nOPERATING EXPENSES\nConsulting fees\n15,379,799\n4,892,478\nProfessional fees\n900,492\n535,361\nSelling, general and administrative\n1,762,877\n1,394,524\nTotal Operating Expenses\n18,043,168\n6,822,363\nLOSS FROM OPERATIONS\n(18,043,168)\n(6,822,363)\nOTHER INCOME (EXPENSES)\nImpairment of intangible assets\n(2,734,839)\n-\nInterest expense\n(136,933)\n(67,647)\nTotal Other Income (Expenses)\n(2,871,772)\n(67,647)\nLOSS BEFORE INCOME TAXES\n(20,914,940)\n(6,890,010)\nPROVISION FOR INCOME TAXES\n-\n-\nNET LOSS\n$(20,914,940)\n$(6,890,010)\nBASIC NET LOSS PER SHARE\n$(0.07)\n$(0.02)\nWEIGHTED AVERAGE NUMBER OF\nSHARES OUTSTANDING\n301,113,657\n300,256,860\nThe accompanying notes are an integral part of these financial statements.\nBAKHU HOLDINGS, CORP.\nConsolidated Statements of Stockholders' Equity (Deficit)\nFor the Period July 31, 2020 through July 31, 2022\nAdditional\nTotal\nPreferred Stock\nCommon Stock\nPaid-In\nAccumulated\nStockholders'\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nEquity (Deficit)\nBalance, July 31, 2020\n-\n300,114,000\n300,114\n15,004,900\n(15,724,678)\n(419,664)\nStock issued for cash\n-\n-\n88,334\n264,912\n-\n265,000\nIssuance of stock options\n-\n-\n-\n-\n4,579,252\n-\n4,579,252\nStock issued for exercise of\nstock options\n-\n-\n495,646\n(495)\n-\n-\nNet loss for the year ended\nJuly 31, 2021\n-\n-\n-\n-\n-\n(6,890,010)\n(6,890,010)\nBalance, July 31, 2021\n-\n300,697,980\n300,698\n19,848,569\n(22,614,688)\n(2,465,421)\nStock issued for cash\n-\n-\n585,003\n1,605,419\n-\n1,606,004\nIssuance of stock options\n-\n-\n-\n-\n14,616,834\n-\n14,616,834\nNet loss for the year ended\nJuly 31, 2022\n-\n-\n-\n-\n-\n(20,914,940)\n(20,914,940)\nBalance, July 31, 2022\n$-\n301,282,983\n$301,283\n$36,070,822\n$(43,529,628)\n$(7,157,523)\nThe accompanying notes are an integral part of these financial statements.\nBAKHU HOLDINGS, CORP.\nConsolidated Statements of Cash Flows\nFor the Years Ended\nJuly 31,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$(20,914,940)\n$(6,890,010)\nAdjustments to reconcile net loss to net cash used by operating activities:\nStock based compensation\n14,616,834\n4,579,253\nImpairment of intangible assets\n2,734,839\n-\nDepreciation\n76,517\n-\nChanges in operating assets and liabilities:\nAccounts payable\n766,388\n449,176\nAccrued liabilities\n136,932\n67,251\nNet Cash Used by Operating Activities\n(2,583,430)\n(1,794,330)\nCASH FLOWS FROM INVESTING ACTIVITIES\n-\n-\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from sale of common stock\n1,606,004\n265,000\nPayments on notes payable - related parties\n(116,046)\n(163,713)\nProceeds from notes payable - related parties\n1,058,994\n1,720,218\nNet Cash Provided by Financing Activities\n2,548,952\n1,821,505\nINCREASE (DECREASE) IN CASH AND CASH EQUIVALENTS\n(34,478)\n27,175\nCASH AND CASH EQUIVALENTS AT BEGINNING OF PERIOD\n46,929\n19,754\nCASH AND CASH EQUIVALENTS AT END OF PERIOD\n$12,451\n$46,929\nSUPPLEMENTAL DISCLOSURES:\nCash Payments For:\nInterest\n$-\n$-\nIncome taxes\n$-\n$-\nNon-cash financing activity:\nIssuance of notes payable for fixed assets\n$765,161\n$-\nStock issued for the exercise of stock options\n$-\n$495\nThe accompanying notes are an integral part of these financial statements.\nBAKHU HOLDINGS, CORP.\nNotes to Financial Statements\nJuly 31, 2022 and 2021\nNOTE 1 - ORGANIZATION AND BUSINESS OPERATIONS\nBakhu Holdings, Corp. (formerly Planet Resources, Corp.) (the Company) was incorporated under the laws of the State of Nevada, U.S., on April 24, 2008. In May 2009, the Company began to look for other types of business to pursue that would benefit the stockholders. To pursue businesses outside the mining industry the name of the Company was changed with the approval of the directors and stockholders to Bakhu Holdings, Corp. on May 4, 2009.\nThe Company has not generated any revenue to date and consequently its operations are subject to all risks inherent in the establishment of a new business enterprise. For the period from inception, April 24, 2008 through July 31, 2022 the Company has accumulated losses of $43,529,628.\nOn August 9, 2019, the Company formed Cell Science CBD International, Inc., a California corporation as a wholly owned subsidiary to commercialize use of the licensed technology to produce and manufacture cannabis and their byproducts that have measurable tetrahydrocannabinol (THC) concentration potency less than 3% on a dry weight basis. This subsidiary had no active operations as of July 31, 2022. When used herein, the Company includes this consolidated subsidiary.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\na)Basis of Presentation\nThe financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America and are presented in US dollars.\nb)Going Concern\nThe financial statements have been prepared on a going concern basis which assumes the Company will be able to realize its assets and discharge its liabilities in the normal course of business for the foreseeable future. The Company has incurred losses since inception resulting in an accumulated deficit of $43,529,628 as of July 31, 2022 and further losses are anticipated in the development of its business raising substantial doubt about the Companys ability to continue as a going concern.\nc)Cash and Cash Equivalents\nThe Company considers all highly liquid instruments with a maturity of three months or less at the time of issuance to be cash equivalents.\nd)Use of Estimates and Assumptions\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\ne)Foreign Currency Translation\nThe Companys functional currency and its reporting currency is the United States dollar.\nBAKHU HOLDINGS, CORP.\nNotes to Financial Statements\nJuly 31, 2022 and 2021\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (continued)\nf) Financial Instruments\nThe carrying value of the Companys financial instruments approximates their fair value because of the short maturity of these instruments.\ng) Stock-based Compensation\nOn January 31, 2021, the Company had one stock-based compensation plan, the 2020 Long-Term Incentive Plan (2020 Plan), which is more fully described in Note 3.\nOn September 22, 2020, the Company granted to each of its directors, Thomas K. Emmitt, Peter Whitton, Aristotle Popolizio and Evripides Drakos, a non-qualified stock option to purchase 300,000 shares of common stock, for a total of 1,200,000 shares, at an exercise price of $5.10 per share, representing the current price at which the Company is offering and selling its restricted shares for cash in its capital raising efforts. Such Options shall be exercisable for a period of seven years. Twenty percent (20%) (i.e., 60,000) of the options shall vest and be exercisable immediately with the remaining 240,000 options vesting at the rate of 1/12 (i.e. 20,000 shares) per month so that all options shall be fully vested and exercisable on the first anniversary of the Grant Date. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nOn June 7, 2021, we entered a consulting agreement with Fourth and G Holdings, LLC, through which Christopher Ganan provides consulting services. We granted the consultant one warrant to purchase 1,500,000 shares, vesting over two years, and another warrant to purchase 28,500,000 shares, vesting in increments based on specified technology commercialization accomplishments. The exercise price of these warrants is $3.00 per share, which was approximately equivalent to the market price of our common stock as of the date of grant. Warrant vesting is subject to the continued term of the consulting agreement on the vesting date. Vesting will accelerate upon certain specified events. The fair value of each warrant grant was estimated using the Black-Scholes option pricing model. The consulting agreement further provides that the Company shall pay the Consultant a Transaction Bonus of 5,000,000 shares of Common Stock if the Company closes a transaction with a transaction value of less than $1.25 Billion.\nOn September 11, 2021, the Company and Fourth and G Holdings, LLC, amended their June 2021 agreement, to reflect that the total warrants were reduced from 30,000,000 to 15,000,000, of which warrants to purchase 300,000 shares were vested on signing the initial agreement.\nOn July 27, 2021, the Company entered into Consulting Agreements with two consultants to assist the Science team and granted each Consultant a seven-year stock option to purchase 100,000 shares of Common Stock at an exercise price of $4.20 per share, which was approximately equal to the closing price for our common stock on the date of grant. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nOn September 16, 2021, the Company granted to its Chief Executive Office, Teddy Scott, a non-qualified stock option to purchase 5,000,000 shares of common stock at an exercise price of $4.50 per share, representing the current market price on the date of the issuance of the option. Such Options shall be exercisable for a period of ten years. Six hundred twenty-five thousand (625,000) of the options shall vest and be exercisable immediately with the remaining options vesting at the rate of ninety-three thousand eighty-five (93,085) shares per month over a period of forty-seven (47) months. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nBAKHU HOLDINGS, CORP.\nNotes to Financial Statements\nJuly 31, 2022 and 2021\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (continued)\nDr. Scott resigned as a director and chief executive officer on November 10, 2021. As of the date of his resignation, 718,085 options were vested and are exercisable through the expiration of such options on September 16, 2031, except in the event of his death, in which case such options will terminate if not exercised within six months. The remaining 4,281,915 options terminated upon Dr. Scotts resignation as a director.\nOn December 3, 2021, the Company appointed an additional director and granted him a seven-year stock option to purchase 300,000 shares of common stock at $3.00 per share, which was approximately equal to the closing price for our common stock on the date of grant. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nOn December 6, 2021, the Company appointed a new Chief Financial and Accounting Officer and director of the Company at an annual base salary of $60,000 and granted him a seven-year stock option to purchase 300,000 shares of common stock at $3.40 per share, which was approximately equal to the closing price for our common stock on the date of grant. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nOn December 7, 2021, the Company entered into Consulting Agreements with two consultants to assist the Science team Pursuant to the Consulting Agreements, the Company granted each Consultant a seven-year stock option to purchase 200,000 shares of Common Stock at an exercise price of $3.40 per share, which was approximately equal to the closing price for our common stock on the date of grant. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nOn January 5, 2022, in consideration of the services of our Chief Executive Officer and our Vice President and Secretary of the Company, we granted them each a seven-year stock option to purchase 700,000 shares of common stock at $2.60 per share which was approximately equal to the closing price for our common stock on the date of grant. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nOn February 11, 2022, the Company appointed a new Deputy Chief Executive Officer and granted him a seven-year stock option to purchase 2,000,000 shares of common stock at an exercise price of $3.00 per share which was approximately equal to the closing price for our common stock on the date of grant. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nOn February 11, 2022, the Company entered into a Consulting Agreement with an advisor to the board and granted him a seven-year stock option to purchase 3,500,000 shares of common stock at an exercise price of $3.00 per share which was approximately equal to the closing price for our common stock on the date of grant. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nOn April 18, 2022, in consideration of the services of our Chief Executive Officer and our Vice President and Secretary of the Company, we granted them each a seven-year stock option to purchase 1,300,000 shares of common stock at $3.30 per share which was approximately equal to the closing price for our common stock on the date of grant. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nOn July 29, 2022, in consideration of the services of two of our Directors, we granted them each a seven-year stock option to purchase 300,000 shares of common stock at $1.50 per share which was approximately equal to the closing price for our common stock on the date of grant. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nBAKHU HOLDINGS, CORP.\nNotes to Financial Statements\nJuly 31, 2022 and 2021\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (continued)\nOn July 29, 2022, in consideration of the services of a Senior Board Advisor and our Chief Financial Officer of the Company, we granted them each a seven-year stock option to purchase 160,000 shares of common stock at $1.50 per share which was approximately equal to the closing price for our common stock on the date of grant. The fair value of each option grant issued under the 2020 Plan was estimated using the Black-Scholes option pricing model.\nBased on the above assumptions for all stock options and warrants, the Company recognized stock-based compensation of $14,616,834 which is included in consulting fees on the Statement of Operations for the year ended July 31, 2022. As of July 31, 2022, there was $42,288,293 of total unrecognized stock-based compensation that is expected to be recognized over the vesting period of the options and warrants.\nh) Income Taxes\nIncome taxes are accounted for under the assets and liability method. Deferred tax assets and liabilities are recognized for the estimated future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carry forwards. Deferred tax assets and liabilities are measured using enacted tax rates in effect for the year in which those temporary differences are expected to be recovered or settled.\ni) Basic and Diluted Net Loss per Share\nThe Company computes net loss per share in accordance with ASC 105, Earnings per Share. ASC 105 requires presentation of both basic and diluted earnings per share (EPS) on the face of the income statement.\nBasic EPS is computed by dividing net loss available to common stockholders (numerator) by the weighted average number of shares outstanding (denominator) during the period. Diluted EPS gives effect to all potentially dilutive common shares outstanding during the period. Diluted EPS excludes all potentially dilutive shares if their effect is anti-dilutive.\nj) Professional fees\nSubstantially all professional fees presented in the financial statements represent accounting fees, audit fees and legal fees associated with the filing of reports with the Securities and Exchange Commission. Also included in professional fees are fees paid to the stock transfer agent. The fees are expensed as incurred.\nk) Fiscal Periods\nThe Companys fiscal year end is July 31.\nl) Recently Issued Accounting Pronouncements\nWe have reviewed accounting pronouncements issued during the past two years and have adopted any that are applicable to the Company. We have determined that none had a material impact on our financial position, results of operations, or cash flows for the periods presented in this report.\nBAKHU HOLDINGS, CORP.\nNotes to Financial Statements\nJuly 31, 2022 and 2021\nNOTE 3 - FIXED ASSETS\nOn January 31, 2022, the Company and Cell Science entered into the Third Amendment to the December 20, 2018, Patent and Technology License Agreement (see Note 7). As part of this transaction, the Company acquired all related equipment, improvements, supplies, and related tangible and intangible assets. The Company determined that the lab equipment acquired had a cost basis of $765,160. These costs are depreciated using the straight-line method over their estimated economic lives which is estimated to be 5 years.\nFixed Assets consisted of the following:\nJuly 31, 2022\nJuly 31, 2021\nLaboratory equipment and components - at cost\n$ 765,160\n$ -\nAccumulated depreciation\n(76,516)\n-\nFixed assets - net\n$ 688,644\n$ -\nNOTE 4 - PREFERRED AND COMMON STOCK\nOn August 8, 2018, the board of directors of the Company approved the amendment and restatement of the Companys Articles of Incorporation. The purpose of the amendment and restatement of the Articles of Incorporation was to:\n(i)Increase the number of authorized shares of common stock to 500,000,000;\n(ii)Increase the number of authorized shares of Preferred Stock to 50,000,000;\n(iii)Grant the board of directors the right to designate classes of preferred stock, and to define the powers, preferences, rights, and restrictions thereof;\nThe preferred and common stock has a par value of $0.001 per share.\nOn August 8, 2018, the Company issued four shares of Series A Preferred Stock to the Companys controlling stockholder, The OZ Corporation, a California corporation, in consideration of consulting services rendered to the Company.\nOn December 20, 2018, the Company entered into a Patent and Technology License Agreement with Cell Science, Ltd. (Cell Science). Pursuant to the Patent and Technology License Agreement, the Company is being granted an exclusive license by Cell Science with respect to certain patents and intellectual property for the production of phytocannabinoids for use in medical treatments and in exchange for 210,000,000 shares of common stock of the Company. On February 14, 2019 the stock was issued and recorded as consulting fees valued at $10,500,000.\nOn April 7, 2019 the Company issued 7,000,000 shares of common stock for the conversion of convertible notes payable and accrued interest in the amount of $10,199.\nOn March 9, 2020, the Company issued 11,061,816 restricted shares of common stock to OZ Corporation, in consideration of ongoing consulting and advisory services provided to the Company, on terms as previously agreed to the Company and OZ Corporation. The securities were issued pursuant to an exemption from registration provided by Section 4(a)(2) of the Securities Act of 1933. OZ Corporation is intimately acquainted with the Companys business plan and proposed activities at the time of issuance and possessed information on the Company necessary to make an informed investment decision. The estimated fair value of the stock was $553,091 and has been expensed and included in Consulting fees in the year ended July 31, 2020.\nBAKHU HOLDINGS, CORP.\nNotes to Financial Statements\nJuly 31, 2022 and 2021\nNOTE 4 - PREFERRED AND COMMON STOCK (continued)\nOn July 24, 2020, the Company issued 88,334 restricted shares of common stock to five accredited investors, for cash at a price of $3.00 per share for aggregate consideration of $265,000. No underwriters were used. The shares were issued pursuant to an exemption from registration provided by Section 4(a)(2) and Regulation S of the Securities Act of 1933.\nStock Option Plan\nOn September 22, 2020, the board of directors adopted the 2020 Long-Term Incentive Plan (2020 Plan), under which 20,000,000 shares of our common stock were reserved for issuance by us to attract and retain employees and directors and to provide such persons with incentives and awards for superior performance and providing services to us. The 2020 Plan is administered by a committee comprised of our board of directors or appointed by the board of directors, which has broad flexibility in designing stock-based incentives. The board of directors determines the number of shares granted and the option exercise price pursuant to the 2020 Plan.\nOn April 27, 2021, the Company issued an aggregate of 495,646 restricted shares of common stock upon the cashless exercise of 800,000 vested options at an exercise price of $5.10 per share on April 22, 2021. Based on the closing price of the Companys common stock of $12.00 on April 22, 2021, 304,354 shares were canceled in payment of the aggregate exercise price of $4,080,000, resulting in the issuance of the 495,646 shares.\nThe following table summarizes the stock option award activity under the 2020 Plan during the year ended July 31, 2022:\nNumber of options\nOutstanding at July 31, 2021\n600,000\nGranted\n16,420,000\nExercised\n-\nForfeited\n(4,601,915)\nOutstanding at July 31, 2022\n12,418,085\nThe following table summarizes the warrants activity during the year ended July 31, 2022:\nNumber of warrants\nOutstanding at July 31, 2021\n30,000,000\nGranted\n-\nExercised\n-\nAmended agreement\n(15,000,000)\nOutstanding at July 31, 2022\n15,000,000\nThe above table reflects the amended agreement with Fourth and G Holdings, LLC, effective September 11, 2021, where it was agreed that the total warrants were reduced from 30,000,000 to 15,000,000.\nSee Stock-based Compensation under Note 2 for description of options and warrants granted.\nBAKHU HOLDINGS, CORP.\nNotes to Financial Statements\nJuly 31, 2022 and 2021\nNOTE 5 - INCOME TAXES\nAs of July 31, 2022, the Company had net operating loss carry forwards that may be available to reduce future years taxable income through 2032. Future tax benefits which may arise as a result of these losses have not been recognized in these financial statements, as their realization is determined not likely to occur and accordingly, the Company has recorded a valuation allowance for the deferred tax asset relating to these tax loss carry-forwards.\nNOTE 6 - NOTES PAYABLE - RELATED PARTIES\nOn August 1, 2019, the Company executed a promissory note in favor of Companys controlling shareholder, OZ Corporation, to evidence monies loan to the Company from December 26, 2018, through July 31, 2019 in the amount of $147,513, and to evidence any additional amounts that may be loaned to the Company thereafter. Pursuant to the terms of the promissory note, the principal and unpaid accrued simple interest at the rate of 6.0% per annum was due and payable on December 31, 2019.The promissory note also provides that the Company may extend the maturity date for an additional 12 months, until December 31, 2020, by paying an extension fee of 1.00% of the outstanding principal loan balance, which may at the lenders option be advanced and added to the then outstanding principal balance. On December 31, 2021 the maturity date was extended until December 2021, and on December 31, 2021, OZ Corporation at the Companys request extend the term of the Note for an additional 12 months, until December 31, 2022. The principal amount of the promissory note is to be increased by the amount of any additional advances of funds made by OZ Corporation to the Company, from time to time, from the date of such advance. Under the terms of the promissory note, OZ Corporation, at its option may, at any time, convert all or any portion of the then unpaid principal balance and any unpaid accrued interest into shares of the Companys common stock. The number of shares of common stock to be issued upon such conversion shall be equal to the quotient obtained by dividing (i) the then unpaid principal balance and any unpaid accrued interest of the promissory note being converted by (ii) 80% of the average closing price of the common stock of the Company, for the ninety (90) trading days before the conversion date, rounded up to the nearest whole share. The principal balance and accrued interest due on the note was $2,723,731 and $210,190, respectively as of July 31, 2022.\nThe Company did not assign any value to the conversion feature of the Note because the 80% of the common stock of the Company had a negative book value of as of July 31, 2022, and continues to have a negative book value. Furthermore, the Company has not generated any revenue to date.\nOn January 31, 2022, the Company and Cell Science entered into the Third Amendment to the December 20, 2018, Patent and Technology License Agreement (see Note 7). As part of this transaction, the Company issued a $3,500,000 promissory note, bearing interest at the applicable federal short-term rate of 0.44% under IRC Section 1274(d), payable in January 2023. The principal balance and accrued interest due on the note were $3,500,000 and $7,637, respectively, as of July 31, 2022.\nNOTE 7 - COMMITMENTS AND CONTINGENCIES\nUnder the April 2020 strategic alliance agreement and related sublicense between the Companys subsidiary, CBD Biotech, Inc., and Integrity Cannabis Solutions, Inc. (ICS), the Company is obligated to issue to ICS that number of shares of Bakhu common stock equal to 0.5% of the number of shares outstanding as of the date that the production facility of ICS is completed and commences production. Further, if the sublicense is terminated, CBD Biotech will be obligated to repay to ICS its initial $250,000 license fee and reimburse ICS for the cost of the laboratory operational equipment used in its production facility, which thereafter will be owned and managed jointly by ICS and CBD Biotech.\nBAKHU HOLDINGS, CORP.\nNotes to Financial Statements\nJuly 31, 2022 and 2021\nNOTE 7 - COMMITMENTS AND CONTINGENCIES (continued)\nAs a result of successfully completing the efficacy demonstration of our licensed technology in July 2021, we became obligated to issue to Cell Science, the licensor, a one-year note for an agreed one-time payment of $3.5 million, less certain credits. The amount of the credits to the note were determined and on January 31, 2022, the Company and Cell Science entered into the Third Amendment to the December 20, 2018, Patent and Technology License Agreement, as subsequently amended. with Cell Science in which the Company agreed as follows:\n·There would be no reduction or offset against the $3.5 million One-time Payment for costs paid by the Company or on its behalf. Therefore, the Company issued a $3.5 million promissory note, bearing interest at the applicable federal short-term rate of 0.44% under IRC Section 1274(d), payable in January 2023.\n· In lieu of any offset or reduction against the One-Time Payment Note, Cell Science agreed to convey to the Company the lease on the California laboratory in which the efficacy demonstration was conducted, including all related equipment, improvements, supplies, and related tangible and intangible assets.\n·Cell Science and OZ Corporation would execute and deliver to the Company a similar conveyance of all rights to the California laboratory.\n·The Integrated License Agreement was clarified to provide that all improvements to the licensed technology made by the Company would be owned by Cell Science and included in the license.\nNOTE 8 - IMPAIRMENT OF INTANGIBLE ASSETS\nOn January 31, 2022, the Company and Cell Science entered into the Third Amendment to the December 20, 2018, Patent and Technology License Agreement (see Note 7). As part of this transaction, the Company received all related equipment, improvements, supplies, and related tangible and intangible assets. The Company determined that the lab equipment acquired had a cost basis of $765,160. The remaining balance of $2,734,839 was assigned to intangible assets as the value of the patent and license technology. Since the value of the intangible assets was difficult to ascertain, the Company expensed this amount as Impairment of intangible assets on the Statement of Operations for the year ended July 31, 2022."
}