{
    "cik": "1445942",
    "company": "Texas Mineral Resources Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-11-29",
    "period_of_report": "2023-08-31",
    "sic": "1040",
    "state_of_inc": "DE",
    "state_location": "TX",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1445942/0001999371-23-000633-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1445942/000199937123000633/tmrc-10k_083123.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1445942/0001999371-23-000633.txt",
    "filename": "1445942_10K_2023_0001999371-23-000633.htm",
    "content": "ITEM 1. BUSINESS\nNarrative Description of Business\nWe are a mining company engaged in the business of the acquisition, exploration and development of mineral properties. We currently own a 19.611% membership interest in Round Top, which entity holds two mineral property leases with the GLO to explore and develop a 950-acre rare earths project located in Hudspeth County, Texas, known as the Round Top Project. The leases expire in 2030 with provisions for automatic renewal if Round Top is producing in paying quantities (the receipt from the sale of materials exceeds all costs and expenses associated therewith for the prior 12 months). Round Top also holds prospecting permits covering 9,345 acres adjacent to the Round Top Project and other related assets. The strategy with Round Top is to develop a metallurgical process to concentrate or otherwise extract the metals from the Round Top Projects rhyolite, conduct additional engineering, design, geotechnical work, and permitting necessary for a bankable feasibility study and then to extract mineral resources from the Round Top Project. The Round Top Project has not established as of the date hereof that any of the properties contain any probable mineral reserves or proven mineral reserves under Item 1300 of Regulation S-K.\nRare earth elements are a group of chemically similar elements that usually are found together in nature - they are referred to as the lanthanide series. These individual elements have a variety of characteristics that are critical in a wide range of technologies, products, and applications and are critical inputs in existing and emerging applications. Without these elements, multiple high-tech technologies would not be possible. These technologies include:\n● cell phones,\n● computer and television screens,\n● battery operated vehicles,\n● clean energy technologies, such as hybrid and electric vehicles and wind power turbines,\n● fiber optics, lasers and hard disk drives,\n● numerous defense applications, such as guidance and control systems and global positioning systems, and\n● advanced water treatment technology for use in industrial and military.\nBecause of these applications, global demand for REE is projected to steadily increase due to continuing growth in existing applications and increased innovation and development of new end uses. Interest in developing resources domestically has become a strategic necessity as there is limited production of these elements outside of China. Our ability to raise additional funds to continue to fund our participation interest in the Round Top Project may be impacted by, among other factors, future prices for REEs.\nAs a part of our ongoing operations, we will occasionally investigate new mining opportunities. We may also incur expenses associated with our investigations. These costs are expensed as incurred until such time when we have agreements in place to purchase such mining rights. See Properties - Alhambra Project.\nOperations Update\nUSARE, the operating manager of the Round Top project, has advised TMRC that it continues to progress the Round Top Project toward operations. Over the last twelve months, Round Top achieved several major milestones including: (i) favorable breaker trials with the goal to increase mine throughput; (ii) favorable CIX separation trials for rare earth elements indicating that the CIX technology employed can extract commercial quality rare earths from the Round Top Project ore; and (iii) favorable membrane concentration trials. The USARE Round Top team continues its work to determine an efficient means of managing alumina content, adding gallium to its output and is working with a major lithium company to maximize the value of the lithium content. USARE has advised the Company that it (i) currently expects that (A) a PFS reflecting this work should be completed during calendar 2024 and (B) a small manufacturing unit should be established to begin processing Round Top Project ore in calendar 2025, and (ii) believes that Round Top remains an attractive venture and is in the process of updating the Round Top Project economic model.\nHistory of the Round Top Project\nIn 2011, the Company entered into two leases with the GLO to explore and develop the Round Top Project, which leases were transferred to Round Top in 2021.\nIn March 2013, we purchased the 54,990 acre surface lease covering the Round Top Project, known as the West Lease, from the Southwest Wildlife and Range Foundation (Foundation) for $500,000 and the issuance of 1,063,830 shares of our Common Stock and agreed to support the Foundation through an annual payment of $45,000 for ten years to support conservation efforts within the Rio Grande Basin. The West Lease provides exclusive surface access to the area for the potential development and mining of the Round Top Project. We transferred the West lease to Round Top in 2021.\nIn October 2014, we executed agreements with the GLO securing the option to purchase the surface rights covering the Round Top Project mine and plant areas and, separately, a groundwater lease. The option to purchase the surface rights covers approximately 5,670 acres over the mining lease and we believe that the additional acreage should be adequate to site all potential heap leaching and processing operations as currently anticipated by Round Top. The option may be exercised for all or part of the option acreage at any time during the primary term of the mineral lease as defined above. The primary term of the GLO mineral leases and the option is through August 2030. The option can be kept current by an annual payment of $10,000. The purchase price will be the appraised value of the surface at the time of exercising the option. The ground water lease secures the right to develop the ground water within a 13,120-acre lease area located approximately 4 miles from the Round Top Project. This lease has an annual minimum production payment of $5,000 prior to production of water for the operation. After initiation of production payments of $0.95 per thousand gallons or $20,000 annually, whichever is greater, is required. This lease remains effective as long as the mineral lease is in effect. We transferred the option to produce the surface lease and water lease to Round Top in 2021.\nCautionary Note\nCautionary Note to Investors: The PEA dated August 16, 2019 was prepared in accordance with Canadian National Instrument 43-101 - Standards of Disclosure for Mineral Projects (NI 43-101) and the Canadian Institute of Mining, Metallurgy and Petroleum (the CIM) - CIM Definition Standards on Mineral Resources and Mineral Reserves, adopted by the CIM Council, as amended. The Company voluntarily had the PEA prepared in accordance with NI 43-101 but the Company is not subject to regulation by Canadian regulatory authorities and no Canadian regulatory authority has reviewed the PEA or passed upon its accuracy or compliance with NI 43-101. The terms mineral reserve, proven mineral reserve and probable mineral reserve are Canadian mining terms as defined in accordance with NI 43-101. These definitions differ from the definitions in Item 1300 of Regulation S-K under the United States Securities Act of 1933, as amended (the Securities Act). Under Item 1300 of Regulation S-K standards, a final or bankable feasibility study is required to report reserves, the three-year historical average price is used in any reserve or cash flow analysis to designate reserves and the primary environmental analysis or report must be filed with the appropriate governmental authority. In addition, the terms mineral resource, measured mineral resource, indicated mineral resource and inferred mineral resource while defined in NI 43-101 and Item 1300 of Regulation S-K are normally not permitted to be used in reports and registration statements filed with the SEC. Investors are cautioned not to assume that all or any part of mineral deposits in these categories will ever be converted into reserves. Inferred mineral resources have a great amount of uncertainty as to their existence, and great uncertainty as to their economic and legal feasibility. It cannot be assumed that all or any part of an inferred mineral resource will ever be upgraded to a higher category. Under Canadian rules, estimates of inferred mineral resources may not form the basis of feasibility or pre-feasibility studies, except in rare cases. Investors are cautioned not to assume that all or any part of an inferred mineral resource exists or is economically or legally mineable. Disclosure of contained ounces in a resource is permitted disclosure under Canadian regulations; however, the SEC normally only permits issuers to report mineralization that does not constitute reserves by Item 1300 of Regulation S-K standards as in place tonnage and grade without reference to unit measures. Accordingly, information in the PEA contains descriptions of our mineral deposits that may not be comparable to similar information made public by United States companies subject to the reporting and disclosure requirements under the United States federal securities laws and the rules and regulations thereunder. The Round Top Project as described in the PEA currently does not contain any known proven or probable mineral reserves under Item 1300 of Regulation S-K reporting standards. U.S. investors are urged to consider closely the disclosure in the Registrants latest reports filed with the SEC. U.S. Investors are cautioned not to assume that any defined resources in these categories will ever be converted into Item 1300 of Regulation S-K compliant reserves.\nUSA Rare Earth Agreement\nIn August 2018, the Company and Morzev Pty. Ltd. (Morzev) entered into an agreement (the 2018 Option Agreement) whereby Morzev was granted the exclusive right to earn and acquire a 70% interest in the Round Top Project by financing $10 million of expenditures in connection with the Round Top Project, increasable to an 80% interest, for an additional $3 million payment to the Company. Morzev began engaging in business as USA Rare Earth and in May 2019 notified the Company that it was nominating USA Rare Earth, LLC (USARE) as the optionee under the terms of the 2018 Option Agreement. In August 2019, the Company and USARE entered into an amended and restated option agreement as further amended on June 29, 2020 (the 2019 Option Agreement and collectively with the 2018 Option Agreement, the Option Agreement), whereby the Company restated its agreement to grant USARE the exclusive right to earn and acquire a 70% interest, increasable to an 80% interest, in the Round Top Project.\nIn May 2021, and in accordance with the terms of the Option Agreement, the Company and USARE entered into a contribution agreement (Contribution Agreement) whereby the Company and USARE contributed assets to Round Top, at the time a wholly-owned subsidiary of the Company, in exchange for their initial ownership interests in Round Top, of which the Company initially owned a membership interest equating to 20% of Round Top and USARE initially owned a membership interest equating to 80% of Round Top. Concurrently therewith, the Company and USARE as the two members entered into a limited liability company agreement (Operating Agreement) governing the operations of Round Top which contains customary and industry standard terms as contemplated by the Option Agreement. USARE serves as manager of Round Top.\nUpon entry into the Contribution Agreement, the Company assigned the following contracts and assets to Round Top in exchange for its initial 20% membership interest in Round Top:\n● the assignment and assumption agreement with respect to the mineral leases from the Company to Round Top;\n● the assignment and assumption agreement with respect to the surface lease from the Company to Round Top;\n● the assignment and assumption agreement with respect to the surface purchase option from the Company to Round Top;\n● the assignment and assumption agreement with respect to the water lease from the Company to Round Top; and\n● the bill of sale and assignment agreement of existing data and other relevant contracts and permits with respect to Round Top owned by the Company.\nand USARE assigned the following assets to Round Top (or the Company, as applicable) for its initial 80% membership interest in Round Top:\n● cash to Round Top to continue to fund Round Top operations in the amount of approximately $3,761,750 comprising the balance of the $10 million required expenditure to earn a 70% interest in Round Top;\n● cash in the amount of $3 million to the Company upon exercise of the USARE option to acquire from the Company an additional 10% interest in Round Top, resulting in the aggregate ownership interest of 80% in Round Top;\n● bill of sale and assignment agreement of the Pilot Plant and other relevant contracts and permits to Round Top; and\n● bill of sale and assignment agreement of existing data and intellectual property owned by USARE to Round Top.\nOn June 26, 2023, the Company, USARE and the manager amended and restated the Operating Agreement and the following material amendments to the Operating Agreement were adopted:\nCash Calls.\nOn the basis of the adopted program and budget (sometimes referred to as the Budget) then in effect, the manager will submit to each member monthly cash calls at least 10 days before the last day of each month, and within 10 days of receipt, (a) USARE will pay to RTMD, as an additional capital contribution, its proportionate share of the estimated cash requirements based on its interest and (b) the Company will either (i) pay to RTMD, as an additional capital contribution, its proportionate share of the estimated cash requirements based on its interest, or (ii) deliver to RTMD a written notice indicating what amount, if any, of the applicable estimated cash requirements that the Company will contribute (the Notice of Non-Contribution). Failure by the Company to deliver payment of its proportionate share of the estimated cash requirements, as an additional capital contribution, or to deliver a Notice of Non-Contribution within the 10 day period shall automatically be considered a Deemed Non-Contribution and shall have the same effect as if the Company provided a timely Notice of Non-Contribution with respect to non-contribution of its entire proportionate share of the applicable cash call.\nRemedies for Failure to Meet Cash Calls\nNon-Contribution. Capital contributions only will be made to fund programs and budgets. If the Company does not contribute all or any portion of any additional capital contribution that it is required to contribute pursuant to a Notice of Non-Contribution or a Deemed Non-Contribution (such unfunded amount shall be deemed the Shortfall Amount), then USARE shall fund the entire Shortfall Amount within 5 business days after the Notice of Non-Contribution or Deemed Non-Contribution.\nDilution. Upon the contribution of the Shortfall Amount by USARE, the interests of the members will be recalculated based on the adjustment provision set forth below in the sub-heading - Adjustment of Interests.\nMaximum Dilution. The dilution of the Company shall not fall below a 3% interest in RTMD (the Minimum Percentage Interest). Upon the contribution by USARE of a Shortfall Amount which otherwise would result in a dilution of the Company below the Minimum Percentage Interest, USARE will receive a priority distribution of available cash, in addition to a distribution of available cash to which USARE otherwise is entitled to receive as a result of its proportionate additional capital contribution pursuant to the applicable cash call request, up to the Shortfall Amount that would have resulted in the Companys interest being further diluted but for the Minimum Percentage Interest (the Priority Distribution). The Priority Distribution will continue until USARE has been reimbursed for its contribution of the Shortfall Amount that would have resulted in the Company having an interest below the Minimum Percentage Interest, after which time the members shall receive distributions of available cash pro rata in proportion to their respective interests.\nAdjustment of Interests.\nIf USARE contributes the Shortfall Amount, then the then current interest of the Company will be reduced (subject to the Minimum Percentage Interest), effective as of each cash call under an additional capital contribution for the applicable program and budget, by a fraction, expressed as a percentage:\n● the numerator of which equals the Shortfall Amount actually funded by USARE; and\n● the denominator of which equals the market capitalization of the Company.\nFor example, the dilution with respect to the December 2023 Round Top cash call notice that was sent on November 16, 2023 was calculated as follows: (A) the USARE ownership interest in Round Top at October 27, 2023 was 80.274% and the Companys ownership interest in Round Top at October 27, 2023 was 19.726%; (B) the December 2023 Round Top cash call noticed on November 16, 2023 was for an aggregate amount of $726,188, of which $582,939 is to be contributed by USARE and $143,249 is to be contributed by the Company; (C) the Company provided a Notice of Non-Contribution stating that it will not contribute the $143,249 which then became the Shortfall Amount; (D) USARE will contribute its $582,939 plus the Shortfall Amount; and (E) the Company as of the date of the Notice of Non-Contribution had a market capitalization of $24,585,099. Accordingly, the Shortfall Amount equaled 0.583% of the Companys market capitalization, and the Companys percentage Interest in the Company was reduced to 19.611%.\nDistributions\nCash in excess of authorized reserves will be distributed to the members pro-rata in proportion to their respective interests on a periodic basis as determined by the management committee. RTMD will be required to make tax distributions to each member. Once USARE has been paid the Priority Distribution, if applicable, all distributions made in connection with the sale or exchange of all or substantially all of RTMDs assets and all distributions made in connection with the liquidation of RTMD will be made to the members pro-rata in accordance with their respective interests.\nOther material terms of the Operating Agreement that remain unchanged are as follows:\nManagement.\nA management committee will make the major decisions of RTMD, such as approval of the respective program and budget, and the manager will implement such decisions. The management committee consists of three representatives of the members, with two being appointed by USARE and one by the Company which is Dan Gorski. The representatives vote the ownership percentage interests of their appointing member.\nManagement Committee Meetings.\nMeetings will be held every three months unless otherwise agreed. For matters before the management committee that require a vote, voting is by simple majority except for certain major decisions that require a unanimous vote. So long as the Company maintains a 15% or greater ownership interest, the nine decisions identified in the bullet points below require unanimous approval. If the Companys ownership interest falls below 15%, the number of unanimous decisions is reduced to five (being the first five bullet points below). If the Company is acquired by a REE mining company or sells its ownership interest to a REE mining company, in each case who elects a majority of the Companys board, this unanimous approval requirement can be suspended by USARE, at its option. The major decisions requiring unanimous approval, as set forth above, are:\n● approval of an amendment to any program and budget that causes the program and budget to increase by 15% or more, except for emergencies;\n● other than purchase money security interests or other security interests in RTMD equipment to finance the acquisition or lease of RTMD equipment used in operations, the consummation of a project financing or the incurrence by RTMD of any indebtedness for borrowed money that requires the guarantee by any member of any obligations of RTMD;\n● substitution of a member under certain circumstances and dissolution of RTMD;\n● the issuance of an ownership interest or other equity interest in RTMD, or the admission of any person as a new member of RTMD, other than in connection with the exercise of a right of first offer by a member;\n● the redemption of all or any portion of an ownership interest, except for limited circumstances provided for in the Operating Agreement;\n● a decision to grant authorization for RTMD to file a petition for relief under any chapter of the United States Bankruptcy Code, to consent to such relief in any involuntary petition filed against RTMD by any third party, or to admit in writing any insolvency of RTMD or inability to pay its debts as they become due, or to consent to any receivership of RTMD;\n● acquisition or disposition of significant mineral rights, other real property or water rights outside of the area of interest as set forth in the Operating Agreement or outside of the ordinary course of business;\n● the merger of RTMD into or with any other entity; and\n● the sale of all or substantially all of RTMDs assets.\nManager.\nThe manager will manage, direct and control operations in accordance with program and budget, will prepare and present to the management committee a proposed program and budget, and will generally oversee and implement all of the day to day activities of RTMD. The manager will conduct necessary equipment and materials procurement and property and equipment maintenance activities, with all operations to be conducted in accordance with adopted program and budget.\nPermitted Transfers.\nCertain transfers are permitted under the Operating Agreement, including transfers to affiliates or through certain mergers or other forms of business reorganization. A member may also encumber its ownership interest provided that if the ownership interest is foreclosed upon, the other member has a pre-emptive right to acquire such ownership interest at the foreclosure sale. If the transfer is a permitted transfer, the transferee is automatically admitted as a member; otherwise unless the other member agrees, the transferee is only an economic interest holder with no voting or other rights held by a member.\nRight of First Offer.\nIf a member desires to transfer all or a portion of its ownership interest to a third party (other than a permitted transfer), it may do that without the consent of the other member so long as it gives the other member the first right to purchase its ownership interest on the same terms. If the other member does not elect to purchase the ownership interest on such terms, the member may sell its ownership interest on such terms and the transfer will be a permitted transfer.\nDrag-Along Right.\nIf USARE accepts a bona fide offer to purchase its entire ownership interest and all other rights under the Operating Agreement from an unrelated third party, the Company will then be obligated to sell its entire ownership interest and all other rights under the Operating Agreement to the unrelated third party on the same terms and conditions as are accepted by USARE.\nCurrent Ownership in Round Top.\nPursuant to the Operating Agreement, USARE initially owned membership interests equating to 80% of Round Top and the Company initially owned membership interests equating to 20% of Round Top. These ownership interests have been and will be adjusted further under a variety of circumstances, including a decision by us not to fund in cash our portion of a Budget. USAREs contribution of approximately $3,761,750 in cash to Round Top in May 2021 was used first to fund operations pursuant to the initial Budget. Currently, USARE and the Company are obligated, subject to an election by the Company not to fund in cash its portion of a Round Top cash call and in lieu thereof to incur dilution to its membership interests, to fund further expenditures in proportion to their respective ownership interests. We funded $386,400 in cash during the fiscal year ended August 31, 2023 and elected not to fund $448,800 which resulted in the dilution of our Round Top membership interest to 19.874% at August 31, 2023. Subsequent to September 1, 2023 through the date of this Annual Report, we notified USARE that we had elected not to contribute in cash our proportionate interest in aggregate cash calls of $396,249 which reduced our RTMD ownership interest to 19.611% as of the date of this Annual Report pursuant to the dilution mechanism in the June 2023 amended Operating Agreement. USARE has advised us that the preliminary estimate of the Round Top Budget for the fiscal year ending August 31, 2024, is currently anticipated to be between $15 million to $20 million, with the Companys portion currently being estimated to be between $3 million to $4 million. It is possible that the Round Top Budget for the current fiscal year could increase and it should be expected that in future periods the Round Top Budget will be higher. The Company likely will decide to incur dilution to its then current membership interest in lieu of funding in cash its Round Top Budget obligations during this fiscal year, as it currently does not have sufficient capital to fund its currently expected cash calls and general and administrative expenses during the fiscal year ending August 31, 2024; consequently our ownership interest in the Round Top Project will likely be further diluted during this current fiscal year. In future periods, we will be required to raise additional capital to fund future cash calls from Round Top (unless we elect in lieu of making cash contributions to dilute our membership interest percentage, which dilution could be significant), and there can be no assurance that we will be able to raise the necessary capital to fund our Round Top cash calls. See Managements Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Capital Resources.\nOperations of the Round Top Project\nDuring the fiscal year ending August 31, 2024, Round Top is currently anticipated to fund the expenditure of between $15 million to $20 million to optimize the leaching and developing of the CIX/CIC processing of the Round Top Project. Initial process design work will be carried out at USAREs facility in Wheat Ridge, Colorado. Pending completion of the initial process development, this facility will either be relocated to or replicated at USAREs Oklahoma facility where a pilot plant is expected to be established. It is estimated that the Round Top Project will require additional time and further expenditure to complete a bankable feasibility study. As such, it is possible that the Round Top Budget will increase in the current fiscal year. In accordance with the current Round Top Budget, the Company does not have sufficient capital to fund its total cash calls (currently anticipated to be between $3 million to $4 million) and expected general and administrative expenses (of not less than $600,000) during the fiscal year ending August 31, 2024; accordingly, we expect to incur dilution to our then current membership interest in lieu of funding our Round Top cash calls.\nTrends - Markets\nRare earth elements, or REEs, are a group of chemically similar elements that usually are found together in nature - they are referred to as the lanthanide series. These individual elements have a variety of characteristics that are important in a wide range of technologies, products, and applications and are critical inputs in existing and emerging applications including: computer hard drives, cell phones, clean energy technologies, such as hybrid and electric vehicles and wind power turbines; multiple high-tech uses, including fiber optics, lasers and hard disk drives; numerous defense applications, such as guidance and control systems and global positioning systems; and advanced water treatment technology for use in industrial, military and outdoor recreation applications. As a result, global demand for REE is projected to steadily increase due to continuing growth in existing applications and increased innovation and development of new end uses. Interest in developing resources domestically has become a strategic necessity as there is limited production of these elements outside of China. Our ability, if any, to raise additional funds in order to fund our expected cash calls in RTMD may be impacted by future prices for REEs.\nSources and Availability of Raw Materials\nThe Round Top Project is currently in the exploration stage and as such Round Top does not require any significant raw materials in order to carry out its primary operating activities. The goal of RTMD is to continue to fund the exploration and development of the Round Top Project to determine whether it is commercially feasible, of which there can be no assurance. The raw materials that the current operations of Round Top rely upon are gasoline and diesel fuel for the exploration vehicles and for the heavy equipment required to build roads and conduct drilling operations. Water is expected to be provided per service contract by Eagle Mountain Gang or through other sources.\nSeasonality\nSeasonality in the State of Texas is not a material factor to our operations for our project.\nCompetition\nThe mining industry is highly competitive. Round Top competes with numerous companies, substantially all of which have greater financial resources available to them. Round Top is, therefore, operating at a significant disadvantage in the course of acquiring mining properties and obtaining materials, supplies, labor, and equipment. Additionally, Round Top is and we are and will continue to be an insignificant participant in the business of exploration and mineral property development. A large number of established and well-financed companies are active in the mining industry and will have an advantage over RTMD and the Company if they are competing for the same properties. Nearly all such entities have greater financial resources, technical expertise and managerial capabilities than ourselves and, consequently, RTMD and the Company will be at a competitive disadvantage in identifying possible mining properties and procuring the same.\nChina accounts for the vast majority of rare earth element production. While rare earth element projects exist outside of China, very few are in actual production. Further, given the timeline for current exploration projects to come into production, if at all, it is likely that the Chinese will be able to dominate the market for rare earth elements into the future. This gives the Chinese a competitive advantage in controlling the supply of rare earth elements and engaging in competitive price reductions to discourage competition. Any increase in the amount of rare earth elements exported from other nations, and increased competition, may result in price reductions, reduced margins and loss of potential market share, any of which could materially adversely affect our operations. As a result of these factors, RTMD and the Company may not be able to compete effectively against current and future competitors.\nGovernment Approvals\nThe exploration, drilling and mining industries operate in a legal environment that requires permits to conduct virtually all operations. Thus permits are required by local, state and federal government agencies. Local authorities, usually counties, also have control over mining activity. The various permits address such issues as prospecting, development, production, labor standards, taxes, occupational health and safety, toxic substances, air quality, water use, water discharge, water quality, noise, dust, wildlife impacts, as well as other environmental and socioeconomic issues.\nPrior to receiving the necessary permits to explore or mine, the operator must comply with all regulatory requirements imposed by all governmental authorities having jurisdiction over the project area. Very often, in order to obtain the requisite permits, the operator must have its land reclamation, restoration or replacement plans pre-approved. Specifically, the operator must present its plan as to how it intends to restore or replace the affected area. Often all or any of these requirements can cause delays or involve costly studies or alterations of the proposed activity or time frame of operations, in order to mitigate impacts. All of these factors make it more difficult and costly to operate and have a negative and sometimes fatal impact on the viability of the exploration or mining operation. It is possible that future changes in these laws or regulations could have a significant impact on our business as well as RTMDs business, causing those activities to be economically reevaluated at that time.\nEffect of Existing or Probable Government and Environmental Regulations\nMineral exploration, including mining operations are subject to governmental regulation. The Round Top operations may be affected in varying degrees by government regulation such as restrictions on production, price controls, tax increases, expropriation of property, environmental and pollution controls or changes in conditions under which minerals may be marketed. An excess supply of certain minerals may exist from time to time due to lack of markets, restrictions on exports, and numerous factors beyond our control. These factors include market fluctuations and government regulations relating to prices, taxes, royalties, allowable production and importing and exporting minerals. The effect of these factors cannot be accurately determined. This section is intended as a brief overview of the laws and regulations described herein and is not intended to be a comprehensive treatment of the subject matter.\nOverview. Like all other mining companies doing business in the United States, Round Top is subject to a variety of federal, state and local statutes, rules and regulations designed to protect the quality of the air and water, and threatened or endangered species, in the vicinity of its operations. These include permitting or pre-operating approval requirements designed to ensure the environmental integrity of a proposed mining facility, operating requirements designed to mitigate the effects of discharges into the environment during exploration, mining operations, and reclamation or post-operation requirements designed to remediate the lands affected by a mining facility once commercial mining operations have ceased.\nFederal legislation in the United States and implementing regulations adopted and administered by the Environmental Protection Agency, the Forest Service, the Bureau of Land Management, the Fish and Wildlife Service, the Army Corps of Engineers and other agencies-in particular, legislation such as the federal Clean Water Act, the Clean Air Act, the National Environmental Policy Act, the Endangered Species Act, the National Forest Management Act, the Wilderness Act, and the Comprehensive Environmental Response, Compensation and Liability Act-have a direct bearing on domestic mining operations. These federal initiatives are often administered and enforced through state agencies operating under parallel state statutes and regulations.\nThe Clean Water Act. The federal Clean Water Act is the principal federal environmental protection law regulating mining operations in the United States as it pertains to water quality.\nAt the state level, water quality is regulated by the Environment Department, Water and Waste Management Division under the Water Quality Act (state). If our exploration or any future development activities might affect a ground water aquifer, it will have to apply for a Ground Water Discharge Permit from the Ground Water Quality Bureau in compliance with the Groundwater Regulations. If exploration affects surface water, then compliance with the Surface Water Regulations is required.\nThe Clean Air Act. The federal Clean Air Act establishes ambient air quality standards, limits the discharges of new sources and hazardous air pollutants and establishes a federal air quality permitting program for such discharges. Hazardous materials are defined in the federal Clean Air Act and enabling regulations adopted under the federal Clean Air Act to include various metals. The federal Clean Air Act also imposes limitations on the level of particulate matter generated from mining operations.\nNational Environmental Policy Act (NEPA). NEPA requires all governmental agencies to consider the impact on the human environment of major federal actions as therein defined.\nEndangered Species Act (ESA). The ESA requires federal agencies to ensure that any action authorized, funded or carried out by such agency is not likely to jeopardize the continued existence of any endangered or threatened species or result in the destruction or adverse modification of their critical habitat. In order to facilitate the conservation of imperiled species, the ESA establishes an interagency consultation process. When a federal agency proposes an action that may affect a listed species, it must consult with the United States Fish and Wildlife Service (USFWS) and must prepare a biological assessment of the effects of a major construction activity if the USFWS advises that a threatened species may be present in the area of the activity.\nNational Forest Management Act. The National Forest Management Act, as implemented through title 36 of the Code of Federal Regulations, provides a planning framework for lands and resource management of the National Forests. The planning framework seeks to manage the National Forest System resources in a combination that best serves the public interest without impairment of the productivity of the land, consistent with the Multiple Use Sustained Yield Act of 1960.\nWilderness Act. The Wilderness Act of 1964 created a National Wilderness Preservation System composed of federally owned areas designated by Congress as wilderness areas to be preserved for future use and enjoyment.\nThe Comprehensive Environmental Response, Compensation and Liability Act (CERCLA). CERCLA imposes clean-up and reclamation responsibilities with respect to discharges into the environment, and establishes significant criminal and civil penalties against those persons who are primarily responsible for such discharges.\nThe Resource Conservation and Recovery Act (RCRA). RCRA was designed and implemented to regulate the disposal of solid and hazardous wastes. It restricts solid waste disposal practices and the management, reuse or recovery of solid wastes and imposes substantial additional requirements on the subcategory of solid wastes that are determined to be hazardous. Like the Clean Water Act, RCRA provides for citizens suits to enforce the provisions of the law.\nNational Historic Preservation Act. The National Historic Preservation Act was designed and implemented to protect historic and cultural properties. Compliance with the Act is necessary where federal properties or federal actions are undertaken, such as mineral exploration on federal land, which may impact historic or traditional cultural properties, including native or Indian cultural sites.\nIn the fiscal year ended August 31, 2023, RTMD incurred minimal costs in complying with environmental laws and regulations in relation to its operating activities.\nEmployees\nIncluding our executive officers, we currently have two full-time employees. We also utilize the services of qualified consultants with geological and mineralogical expertise as well as an individual for accounting services.\nInvestment Company Act Exclusion\nSection 3(c)(9) of the Investment Company Act of 1940, as amended (1940 Act), provides that a company substantially all of whose business consists of owning or holding oil, gas, or other mineral royalties or leases, or fractional interests therein, or certificates of interest or participation in or investment contracts relative to such royalties, leases, or fractional interests is not an investment company within the meaning of the 1940 Act. The Company has determined that this exemption applies to it giving consideration to the following four factors:\n● whether the exempted activity constitutes substantially all of our business;\n○ The Company has owned mineral leases since 2010, all of our business to date has been comprised of owning and developing the mineral leases and, after the May 2021 farm-down of its 100% interest in the mineral leases, substantially all of our business continues to be comprised of owning and holding a certificate of interest and a participation in the mineral leases owned by Round Top. The Companys mineral assets historically, as well as the value of the certificate of interest at August 31, 2023, have been booked at cost in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP). We have an accumulated deficit of approximately $42.7 million at August 31, 2023 as a result of owning and developing the Round Top Project.\n● whether we own or trade in the mineral leases;\n○ The Company has owned the mineral leases, which are now owned by Round Top, since 2010 and neither the Company nor Round Top is in the business of dealing or trading in the mineral leases.\n● what qualifies as an eligible asset for purposes of the exception; and\n○ The statute specifically references mineral leases and our mineral leases were owned by the Company and are now owned by Round Top. In accordance with Regulation S-K Item 1300 that governs disclosure by registrants engaged in mining operations, the definition of mineral resource is a concentration or occurrence of material of economic interest in or on the Earths crust. Our rare earth elements and minerals underlying the mineral leases meet that definition, as well as does coal, silver, gold and other material mined for economic value by registrants involved in mining operations. The SEC staff has recognized that an excepted entity can also engage in related business activities such as exploring, developing, and operating the eligible assets.\n● what qualifies as a certificate of interest or participation in or an investment contract relative to the eligible assets.\n○ The statute allows a Company to own a certificate of interest or participation in the mineral leases. The SEC staff has advised that limited partnership interests and/or similar securities issued by entities that themselves own the leases constitute certificate of interest or participation in or investment contracts related to such leases. The Companys 20% membership interest in Round Top constitutes a certificate of interest and a participation in the mineral leases that are owned by Round Top.\nThe Company intends to continue to conduct its business operations in order to continue to be excluded from the definition of an investment company under the 1940 Act.\nAvailable Information\nWe make available, free of charge, on or through our Internet website, at www.TMRC.com our annual reports on Form 10-K, our quarterly reports on Form 10-Q and our current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act. Our Internet website and the information contained therein or connected thereto are not intended to be, and are not incorporated into this Annual Report. ITEM 1A. RISK FACTORS\nThe following sets forth certain risks and uncertainties that could have a material adverse effect on our business, financial condition and/or results of operations, and the trading price of our common stock which may decline (it has recently declined and may continue to further decline) and investors may lose all or part of their investment. These risk factors should be considered along with the forward-looking statements contained in this Annual Report on Form 10-K because these factors could cause our actual results or financial condition to differ materially from those projected in forward-looking statements. Additional risks and uncertainties that we do not presently know or that we currently deem immaterial also may impair our business operations. We cannot assure you that we will successfully address these risks or that other unknown risks exist that may affect our business.\nRisks Associated with our investment in Round Top\nFailure to fund cash calls.\nUSARE, as manager, will issue monthly cash calls pursuant to adopted Budgets. Both parties, as members, will have 10 days after receipt of such a billing to meet the cash call. Failure to meet a cash call results in dilution. The governing provisions of the Operating Agreement with respect to cash calls and dilution are as follows:\nCash Calls.\nOn the basis of the adopted program and budget then in effect, the manager will submit to each member monthly cash calls at least 10 days before the last day of each month, and within 10 days of receipt, (a) USARE will pay to RTMD, as an additional capital contribution, its proportionate share of the estimated cash requirements based on its interest and (b) the Company will either (i) pay to RTMD, as an additional capital contribution, its proportionate share of the estimated cash requirements based on its interest, or (ii) deliver to RTMD a written notice indicating what amount, if any, of the applicable estimated cash requirements that the Company will contribute, being the Notice of Non-Contribution. Failure by the Company to deliver payment of its proportionate share of the estimated cash requirements, as an additional capital contribution, or to deliver a Notice of Non-Contribution within the 10 day period shall automatically be considered a Deemed Non-Contribution and shall have the same effect as if the Company provided a timely Notice of Non-Contribution with respect to non-contribution of its entire proportionate share of the applicable cash call.\nRemedies for Failure to Meet Cash Calls\nNon-Contribution. Capital contributions only will be made to fund programs and budgets. If the Company does not contribute all or any portion of any additional capital contribution that it is required to contribute pursuant to a Notice of Non-Contribution or a Deemed Non-Contribution, then USARE shall fund the entire shortfall, being the Shortfall Amount, within 5 business days after the Notice of Non-Contribution or Deemed Non-Contribution.\nDilution. Upon the contribution of the Shortfall Amount by USARE, the interests of the members will be recalculated based on the adjustment provision set forth below in the sub-heading - Adjustment of Interests.\nMaximum Dilution. The dilution of the Company shall not fall below a 3% interest in RTMD, being the Minimum Percentage Interest. Upon the contribution by USARE of a Shortfall Amount which otherwise would result in a dilution of the Company below the Minimum Percentage Interest, USARE will receive a priority distribution of available cash, in addition to a distribution of available cash to which USARE otherwise is entitled to receive as a result of its proportionate additional capital contribution pursuant to the applicable cash call request, up to the Shortfall Amount that would have resulted in the Companys interest being further diluted but for the Minimum Percentage Interest, being the Priority Distribution. The Priority Distribution will continue until USARE has been reimbursed for its contribution of the Shortfall Amount that would have resulted in the Company having an interest below the Minimum Percentage Interest, after which time the members shall receive distributions of available cash pro rata in proportion to their respective interests.\nAdjustment of Interests.\nIf USARE contributes the Shortfall Amount, then the then current interest of the Company will be reduced (subject to the Minimum Percentage Interest), effective as of each cash call under an additional capital contribution for the applicable program and budget, by a fraction, expressed as a percentage:\n● the numerator of which equals the Shortfall Amount actually funded by USARE; and\n● the denominator of which equals the market capitalization of the Company.\nAs such, the failure by us to fund our cash calls will result in dilution to our membership interest in RTMD, which could be significant over time and could ultimately reduce us to a 3% membership interest and possibly a Priority Distribution owed to USARE, as described above. Dilution to our membership interest in RTMD will adversely affect the value of our Company and likely the value of our Common Stock. We currently do not have the necessary capital to fund future cash calls and there can be no assurance that we will be able to raise additional capital to fund cash calls. Moreover, the raising of capital by issuing shares of Common Stock will result in dilution to our common stockholders).\nCertain matters that require unanimous management committee approval will not be applicable if the Companys membership interest falls below 15% in Round Top.\nMeetings will be held every three months unless otherwise agreed. For matters before the management committee that require a vote, voting is by simple majority except for certain major decisions that require a unanimous vote. So long as the Company maintains a 15% or greater ownership interest, the nine decisions identified in the bullet points below require unanimous approval. If the Companys ownership interest falls below 15%, the number of unanimous decisions is reduced to five (being the first five bullet points below). If the Company is acquired by a REE mining company or sells its ownership interest to a REE mining company, in each case who elects a majority of the Companys board, this unanimous approval requirement can be suspended by USARE, at its option. The major decisions requiring unanimous approval, as set forth above, are:\n● approval of an amendment to any Budget that causes the Budget to increase by 15% or more, except for emergencies;\n● other than purchase money security interests or other security interests in Round Top equipment to finance the acquisition or lease of Round Top equipment used in operations, the consummation of a project financing or the incurrence by Round Top of any indebtedness for borrowed money that requires the guarantee by any member of any obligations of Round Top;\n● substitution of a member under certain circumstances and dissolution of Round Top;\n● the issuance of an ownership interest or other equity interest in Round Top, or the admission of any person as a new member of Round Top, other than in connection with the exercise of a right of first offer by a member;\n● the redemption of all or any portion of an ownership interest, except for limited circumstances provided for in the Operating Agreement;\n● a decision to grant authorization for Round Top to file a petition for relief under any chapter of the United States Bankruptcy Code, to consent to such relief in any involuntary petition filed against Round Top by any third party, or to admit in writing any insolvency of Round Top or inability to pay its debts as they become due, or to consent to any receivership of Round Top;\n● acquisition or disposition of significant mineral rights, other real property or water rights outside of the area of interest as set forth in the Operating Agreement or outside of the ordinary course of business;\n● the merger of Round Top into or with any other entity; and\n● the sale of all or substantially all of Round Tops assets.\nAny future dilution of our membership interest in RTMD below 15% will adversely impact our input with respect to certain RTMD corporate actions, which could adversely affect us.\nWe have relied on an exclusion from the definition of investment company in order to avoid being subject to the Investment Company Act of 1940. To the extent the nature of our business changes in the future, we may become subject to the requirements of the 1940 Act, which would limit our business operations and require us to spend significant resources in order to comply with such Act.\nThe 1940 Act defines an investment company, among other things, as an issuer that is engaged in the business of investing, reinvesting, owning, holding or trading in securities and owns investment securities having a value exceeding 40 percent of the issuers unconsolidated assets, excluding cash items and securities issued by the federal government. However, the 1940 Act excludes from this definition any person substantially all of whose business consists of owning or holding oil, gas or other mineral royalties or leases or fractional interests therein, or certificates of interest or participation relating to such mineral royalties or leases. We believe that we satisfy this mineral company exception to the definition of investment company. If our reliance on the mineral company exclusion from the definition of investment company is misplaced, we may have been in violation of the 1940 Act, the consequences of which can be significant. For example, investment companies that fail to register under the 1940 Act are prohibited from conducting business in interstate commerce, which includes selling securities or entering into other contracts in interstate commerce.\nIf in the future the nature of our business changes, or a regulatory agency would disagree with our analysis regarding the exclusion from the 1940 Act, such that the mineral company exception to the threshold definition of investment company is not available to us, we will be required to register as an investment company with the SEC. The ramifications of becoming an investment company, both in terms of the restrictions it would have on our Company and the cost of compliance, would be significant. For example, in addition to expenses related to initially registering as an investment company, the 1940 Act also imposes various restrictions with regard to our ability to enter into affiliated transactions, the diversification of our assets and our ability to borrow money. If we became subject to the 1940 Act at some point in the future, our ability to continue pursuing our business plan would be severely limited as it would be significantly more difficult for us to raise additional capital in a manner that would comply with the requirements of the 1940 Act. To the extent we are unable to raise additional capital, we may be forced to discontinue our operations or sell or otherwise dispose of our mineral assets.\nRisk Related to Our Business, Including Being an Owner of a 19.611% membership interest in a Mineral Project Being Operated by Round Top\nOur financial statements have been prepared assuming that the Company will continue as a going concern.\nOur financial statements have been prepared assuming that the Company will continue as a going concern. The Company has an accumulated deficit from inception through August 31, 2023, of approximately $42,344,000 and has yet to achieve profitable operations, and projects further losses in the development of its business. At August 31, 2023, the Company had a working capital surplus of approximately $1,025,000; however the Companys ability to continue as a going concern is dependent upon its ability to obtain the necessary financing to meet its obligations and pay its liabilities arising from normal business operations when they come due.\nIn accordance with our current projected Budget, the Company does not have sufficient capital to fund its (i) total cash calls expected during the fiscal year ending August 31, 2024 (currently anticipated to be between approximately $3 million to $4 million) and (ii) expected general and administrative expenses during the fiscal year ending August 31, 2024 (expected to be at least $600,000). Thus far during the current fiscal year, we have elected to incur dilution to our Round Top membership interest which as of the date of this Annual report is 19.611% and the failure of the Company to make required cash calls to Round Top during the remainder of our current fiscal year will result in further dilution to our current 19.611% ownership interest. We expect to incur dilution to our then current membership interest to fund our cash call obligations during the fiscal year ending August 31, 2024. The Company may be required to raise additional capital to fund its obligations (pursuant to the current Budget if it elects not to incur dilution to its then current membership interest and to fund general and administrative expenses) during the fiscal year ended August 31, 2024. There can be no assurance that the Company will be able to raise the necessary capital to fund its cash calls and expected general and administrative expenses. We have no firm commitments for equity or debt financing and any financing that may be obtained will be on a best efforts basis. Based on these factors, there is substantial doubt as to the Companys ability to continue as a going concern for a period of twelve months from the issuance date of these financial statements. The failure to obtain sufficient financing may cause us to curtail or discontinue operations.\nWe have a history of losses and will require additional financing to fund operations. Failure to obtain additional financing could have a material adverse effect on our financial condition and results of operation and could cast uncertainty on our ability to continue as a going concern in future periods.\nDuring the fiscal year ended August 31, 2023, we had no revenues. For the fiscal year ended August 31, 2023, our net loss was approximately $2.6 million and our accumulated deficit at August 31, 2023 was approximately $42.3 million. At August 31, 2023, our cash position was approximately $1.1 million and our working capital surplus was approximately $1.0 million. Round Top has not commenced commercial production on any of its mineral properties, and there can be no assurance that the Round Top Project will ever commence commercial production.\nDuring the fiscal year ending August 31, 2024, it is likely that USARE will be required to fund our portion of current Round Top Budget estimated to be between $3 million and $4 million to optimize the leaching and developing of the CIX/CIC processing of the Round Top Project, based on our current cash position (which will result in dilution to our membership interest in RTMD). Initial process design work will be carried out at USAREs facility in Wheat Ridge, Colorado. Pending completion of the initial process development, this facility will either be relocated to or replicated at USAREs Oklahoma facility where a pilot plant is expected to be established. It is estimated that the Round Top Project will require additional time and further expenditure to complete a bankable feasibility study, if at all.\nIn accordance with the current Round Top Budget, the Company will likely continue to elect to incur dilution to its Round Top membership interest in lieu of providing cash payments to fund its portion of the Round Top Budget, as we dont have sufficient capital to fund currently expected cash calls and general and administrative expenses during the fiscal year ending August 31, 2024. If we were to elect to fund our portion of the expected Round Top Budget in cash, we would be required to raise additional capital to fund our obligations during this fiscal year. Moreover, it is possible that the Round Top Budget for the fiscal year ended August 31, 2024 could increase and it should be expected that such Round Top Budget will be higher in future periods. There can be no assurance that we will be able to raise the necessary capital to fund our cash calls and general and administrative expenses either during this current fiscal year or thereafter. The failure to fund our portion of the Round Top Budget during this current fiscal year and/or thereafter would result in the continued dilution of our membership interest Round Top (currently 19.611%, which dilution during this current fiscal year and/or thereafter could be significant), and/or could cause us to curtail or cease our operations. The most likely source of future financing presently available to us is through the sale of our securities, of which there is no assurance that we will be able to raise additional capital on reasonable terms, if at all. Any sale of our shares of Common Stock to raise capital will result in dilution of equity ownership to existing stockholders. This means that if we sell shares of Common Stock, more shares will be outstanding and each existing stockholder will own a smaller percentage of the shares then outstanding. Additionally, the actual or perceived sale of additional shares of Common Stock could have the effect of decreasing our stock price, which would further exacerbate dilution to our existing shareholders. Alternatively, we may rely on debt financing and assume debt obligations that require us to make substantial interest and principal payments. Also, we may issue or grant warrants or options in the future pursuant to which additional shares of Common Stock may be issued. Exercise of such warrants or options will result in dilution of equity ownership to our existing stockholders. We have no firm commitments with respect to obtaining equity or debt financing and, accordingly, we will be reliant upon a best efforts financing strategy. The failure to obtain sufficient financing in this current fiscal year or subsequent thereto will result in the continued dilution of our membership interest in RTMD (which could be significant) and/or may cause us to curtail or discontinue operations.\nWe have a limited operating history on which to base an evaluation of our business and properties.\nAny investment in the Company should be considered a high-risk investment because investors will be placing funds at risk in an early stage, under-capitalized business with unforeseen costs, expenses, competition, a history of operating losses and other problems to which start-up ventures are often subject. Investors should not invest in the Company unless they can afford to lose their entire investment. Your investment must be considered in light of the risks, expenses, and difficulties encountered in establishing a new business in a highly competitive and mature industry. Our operating history has been restricted to the acquisition and sampling of the Round Top Project and this does not provide a meaningful basis for an evaluation of the Round Top Project. Other than through conventional and typical exploration methods and procedures, we have no additional way to evaluate the likelihood of whether the Round Top Project contains commercial quantities of mineral reserves or, if it does, that it will be operated successfully. We anticipate that we will continue to incur operating costs in the form of cash calls in connection with our current 19.611% membership interest in Round Top without realizing any revenues during the foreseeable future. If we continue to satisfy our Round Top cash call obligations through dilution to our then current membership interest, then we will incur continued dilution to our membership interest, which could be significant. To date, substantially all of our business consists of owning a 19.611% membership interest in Round Top as of the date of this Annual Report.\nThe Round Top Project is in the exploration stage. There is no assurance that Round Top can establish the existence of any mineral reserve from the Round Top Project in commercially exploitable quantities. Until then, we cannot earn any revenues from the Round Top Project, and our business could fail.\nWe have not established that the Round Top Project contains any commercial exploitable quantities of mineral reserve, nor can there be any assurance that we will be able to do so. The probability of the Round Top Project ever having a commercial exploitable mineral reserve that meets the requirements of the SEC may be remote. Even if we do eventually discover commercial exploitable quantities of mineral reserve on the Round Top Project, there can be no assurance that it can be developed into a producing mine and extract those minerals. Both mineral exploration and development involve a high degree of risk and few properties, which are explored, are ultimately developed into producing mines.\nThe commercial viability of an established mineral deposit will depend on a number of factors including, by way of example, the size, grade and other attributes of the mineral deposit, the proximity of the deposit to infrastructure such as a smelter, roads and a point for shipping, government regulation and market prices. Most of these factors will be beyond our control, and any of them could increase costs and make extraction of any identified mineral deposit unprofitable.\nEven if commercial viability of a mineral deposit is established, it may take several years in the initial phases of drilling until production is possible, during which time the economic feasibility of production may change. Substantial expenditures are required to establish proven and probable reserves through drilling and bulk sampling, to determine the optimal metallurgical process to extract the metals from the ore and, in the case of new properties, to construct mining and processing facilities. Because of these uncertainties, no assurance can be given that our exploration programs will result in the establishment or expansion of a mineral deposit or reserves.\nThe Round Top Project is a high risk project and investors should not make an investment in the Company unless you have the ability to lose your entire investment.\nThere is no history of producing metals from the Round Top Project.\nThere is no history of producing metals from the Round Top Project. The Round Top Project is an exploration stage property in the early stage of exploration and evaluation. Advancing properties from exploration into the development stage requires significant capital and time, and successful commercial production from the Round Top Project, if any, will be subject to completing feasibility studies, permitting and construction of the mine, processing plants, roads, and other related works and infrastructure. As a result, we are subject to all of the risks associated with developing and establishing new mining operations and business enterprises including:\n● completion of feasibility studies to verify reserves and commercial viability, including the ability to find sufficient REE reserves to support a commercial mining operation;\n● the timing and cost, which can be considerable, of further exploration, preparing feasibility studies, permitting and construction of infrastructure, mining and processing facilities;\n● the availability and costs of drill equipment, exploration personnel, skilled labor and mining and processing equipment, if required;\n● the availability and cost of appropriate smelting and/or refining arrangements, if required, and securing a commercially viable sales outlet for our products;\n● compliance with environmental and other governmental approval and permit requirements;\n● the availability of funds to finance exploration, development and construction activities, as warranted;\n● potential opposition from non-governmental organizations, environmental groups, local groups or local inhabitants which may delay or prevent development activities;\n● dilution to our membership interest in Round Top, which could be significant;\n● potential increases in exploration, construction and operating costs due to changes in the cost of fuel, power, materials and supplies; and\n● potential shortages of mineral processing, construction and other facilities related supplies.\nThe costs, timing and complexities of exploration, development and construction activities may be increased by the location of the Round Top Project (or other properties that may subsequently be acquired) and demand by other mineral exploration and mining companies. It is common in exploration programs to experience unexpected problems and delays during drill programs and, if warranted, development, construction and mine start-up activities. Accordingly, Round Tops activities may not result in profitable mining operations and Round Top may not succeed in establishing mining operations or profitably producing metals with respect to the Round Top Project. This is a high risk project and investors should not make an investment in the Company unless you have the ability to lose your entire investment.\nIf we establish the existence of a mineral reserve in the Round Top Project in a commercially exploitable quantity, we will require additional capital in order to maintain our current membership interest in Round Top and fund our proportionate costs to develop the property into a producing mine. If we cannot raise this additional capital, our membership interest in RTMD will be diluted, our membership interest will lose value, and our Company could fail.\nRound Top will be required to expend significant funds to determine if there exist mineral reserves in commercially exploitable quantities in the Round Top Project, and then Round Top will be required to expend substantial additional sums of money to establish the extent of the reserve, develop processes to extract it and develop extraction and processing facilities and infrastructure. Each of USARE and the Company, as the members of Round Top, will likely need to fund such expenditure. Our failure to raise capital to fund our portion of future cash calls will result in our current 19.611% membership interest being diluted. Round Top does not have adequate capital to fund expenditures at the project level, therefore requiring the members to fund cash calls based upon our current ownership interests in Round Top and we can elect to satisfy our cash call obligations through incurring dilution to our Round Top membership interest. There is no assurance that any Round Top project level financing can ever be obtained, which will depend initially upon obtaining a preliminary feasibility study which is anticipated to be completed during calendar 2024, although there can be no assurance that this will be obtained. As such, there is no assurance that, either at the member level or project level, the necessary financing can be obtained to develop necessary facilities and infrastructure to accomplish our goals. Although Round Top may derive substantial benefits from the discovery of a major mineral deposit, there can be no assurance that such a deposit will be large enough to justify commercial operations, nor can there be any assurance that Round Top will be able to raise the funds at the Round Top level required for development on a timely basis. If Round Top cannot raise the necessary capital at the Round Top level or complete the necessary facilities and infrastructure, cash calls from the members will continue and if we cant fund our position, our membership interest will continue to be diluted (which dilution could be significant) and/or our business may fail and your investment in our Common Stock will be lost. Since June 2023 through the date of this Annual Report on Form 10-K, our current membership interest was diluted from 20% to 19.611%, and it should be expected that our membership interest will be further diluted during this current fiscal year.\nOur exploration activities may not be commercially successful.\nOur long-term success depends on our ability to identify mineral deposits in the Round Top Project or other properties we may acquire, if any, that we can then develop into commercially viable mining operations. Our belief that the Round Top Project contains commercially exploitable minerals has been based solely on preliminary tests that Round Top has conducted and data provided by third parties (including USARE). There can be no assurance that the tests and data upon which we have relied is correct or accurate and, accordingly, there is no assurance that the Round Top Project contains commercially exploitable minerals. Moreover, mineral exploration is highly speculative in nature, involves many risks and is frequently non-productive. Unusual or unexpected geologic formations and the inability to obtain suitable or adequate machinery, equipment or labor are risks involved in the conduct of exploration programs. The success of mineral exploration and development is determined in part by the following factors:\n● the identification of potential mineralization based on analysis;\n● the availability of exploration permits;\n● the quality of our management and our geological and technical expertise; and\n● the capital available for exploration.\nSubstantial expenditures and time are required to establish existing proven and probable reserves through drilling and analysis, to develop metallurgical processes to extract metal, and to develop the mining and processing facilities and infrastructure at any site chosen for mining. Whether a mineral deposit will be commercially viable depends on a number of factors, which include, without limitation, the particular attributes of the deposit, such as size, grade and proximity to infrastructure; metal prices, which fluctuate widely; and government regulations, including, without limitation, regulations relating to prices, taxes, royalties, land tenure, land use, allowable production, importing and exporting of minerals and environmental protection. Any one or a combination of these factors may result in us not receiving an adequate return on our investment in Round Top or any other mineral project we may pursue. The decision to abandon a project will have an adverse effect on the market value of our securities and our ability, if any, to raise future financing.\nIncreased costs could affect our financial condition.\nWe anticipate that costs at the Round Top Project as it is developed, if warranted, will frequently be subject to variation from one year to the next due to a number of factors, such as changing ore grade, metallurgy and revisions to mine plans, if any, in response to the physical shape and location of the ore body. In addition, costs are affected by the price of commodities such as fuel, rubber, and electricity. Such commodities are at times subject to volatile price movements, including increases that could make production at certain operations less profitable. A material increase in costs at any significant location could have a significant effect on the Round Top operations as well as Round Top member funding requirements.\nMacroeconomic conditions, domestic and global political turbulence could have a materially adverse impact on our business, financial condition, or results of operations.\nMacroeconomic conditions, such as high inflation, changes to monetary policy, high interest rates, volatile currency exchange rates, decreasing consumer confidence and spending, and global or local recessions could negatively impact our business, financial condition, or results of operations. Recent macroeconomic conditions have been and likely will continue to be adversely impacted by political instability and military hostilities in multiple geographies (including the ongoing conflict between Ukraine and Russia and the conflict in the Middle East). The results of these macroeconomic conditions, and the actions taken by governments and consumers in response, have, and may continue to, result in higher inflation and higher interest rates in the U.S. and globally, which may, in turn, lead to an increase in costs and cause changes in fiscal and monetary policy, including additional increased interest rates.\nNo assurance that the Company will enter into any agreement with respect to the Alhambra project owned by Santa Fe or that this project will proceed.\nWhile the Company has entered into a mineral exploration and operation agreement with Santa Fe, there is no assurance the Company will enter into a formal joint venture agreement or otherwise pursue this project. Even if the Company enters into a formal joint venture agreement with Santa Fe, there is no assurance that this project will be economically feasible, that exploration will be successful or that this project will be a commercial success. The Company is currently pursuing financing sources for this project and there can be no assurance that the Company will be able to arrange and procure necessary financing to commercially exploit a silver property currently held by Santa Fe within the Black Hawk Mining District in Grant County, New Mexico. The status of our electromagnetic surveying and testing with respect to this project is preliminary in nature and there can be no assurance that this project will proceed or that results will be positive.\nLicensing and permitting of mining operations in the State of New Mexico is difficult and could have a material effect on the length of time and cost of securing the required permits.\nRegulatory agencies governing permitting include the New Mexico Mining and Minerals Division of the State of New Mexico, New Mexico Environmental Department, New Mexico Office of the State Engineer, the US Forest Service, the US Fish and Wildlife Service, the EPA, Mine Safety and Health Administration and Grant County, New Mexico. Permitting process is also vulnerable to the intrusion of various non-governmental organizations hostile to mining. Accordingly, there is no assurance that we will be able to obtain the necessary permits with respect to the Alhambra project, either at the state or federal level.\nA shortage of equipment and supplies could adversely affect our ability to operate our business.\nRound Top is and will be dependent on various supplies and equipment to carry out mining exploration and, if warranted, development operations. The shortage of such supplies, equipment and parts could have a material adverse effect on the ability to carry out Round Tops operations and therefore limit or increase the cost of production.\nMining and mineral exploration is inherently dangerous and subject to conditions or events beyond our control, which could have a material adverse effect on our business and plans.\nMining and mineral exploration involves various types of risks and hazards, including:\n● environmental hazards;\n● power outages;\n● metallurgical and other processing problems;\n● unusual or unexpected geological formations;\n● personal injury, flooding, fire, explosions, cave-ins, landslides and rock-bursts;\n● inability to obtain suitable or adequate machinery, equipment, or labor;\n● metals losses;\n● fluctuations in exploration, development and production costs;\n● labor disputes;\n● unanticipated variations in grade;\n● mechanical equipment failure; and\n● periodic interruptions due to inclement or hazardous weather conditions.\nThese risks could result in damage to, or destruction of, the Round Top Project, production facilities or other properties, personal injury, environmental damage, delays in mining, increased production costs, monetary losses and possible legal liability. Round Top may not be able to obtain insurance to cover these risks at economically feasible premiums. Insurance against certain environmental risks, including potential liability for pollution or other hazards as a result of the disposal of waste products occurring from production, may be prohibitively expensive. Round Top may suffer a material adverse effect on its business if not covered by insurance policies.\nThe figures for our mineralization are estimates based on interpretation and assumptions and may yield less mineral production under actual conditions than is currently estimated.\nUnless otherwise indicated, mineralization figures presented in this Annual Report and in our filings with securities regulatory authorities, press releases and other public statements that may be made from time to time are based upon estimates made by independent geologists and our internal geologists. When making determinations about whether to advance to development any project that we have or may have interest in will be reliant upon such estimated calculations as to the mineral reserves and grades of mineralization on our properties. Until ore is actually mined and processed, mineral reserves and grades of mineralization must be considered as estimates only. All resource and grade estimates are based on state of the art analytical methods. However, any procedure for analyzing small amounts of metals in a chemically complex matrix may be subject to error and other uncertainties.\nEstimates made to date rely on geophysical data, and geophysics is an indirect method of exploration and must be verified by drilling and underground investigation. Additionally, estimates can be imprecise and depend upon geological interpretation and statistical inferences drawn from drilling and sampling analysis, which may prove to be unreliable. We cannot assure you that:\n● these interpretations and inferences will be accurate;\n● mineralization estimates will be accurate; or\n● this mineralization can be mined or processed profitably.\nInvestors should not rely upon any such figures in making an investment decision to acquire our Common Stock.\nThe Round Top operations may contain significant uninsured risks which could negatively impact future profitability.\nAny exploration of the Round Top Project contains and will contain certain risks, including unexpected or unusual operating conditions including rock bursts, cave-ins, flooding, fire and earthquakes. It is not always possible to insure against these risks. Should events such as these arise, they could reduce or eliminate our investment in Round Top as well as result in increased costs and a decline in the value of our investment.\nMineral operations are subject to market forces outside of our control which could negatively impact us.\nThe marketability of minerals is affected by numerous factors beyond our control including market fluctuations, government regulations relating to prices, taxes, royalties, allowable production, imports, exports and supply and demand. One or more of these risk elements could have an impact on the costs of the Round Top operations and, if significant enough, could impact our investment.\nWe may be adversely affected by fluctuations in demand for, and prices of, rare earth minerals and products.\nOur goal is for Round Top to derive revenues, if any, from the sale of rare earth and related minerals by Round Top. Changes in demand for, and the market price of, these minerals could significantly affect us. The value and price of our Common Stock and our financial results may be significantly adversely affected by declines in the prices of rare earth minerals and products. Rare earth minerals and product prices may fluctuate and are affected by numerous factors beyond our control such as interest rates, exchange rates, inflation or deflation, fluctuation in the relative value of the U.S. dollar against foreign currencies on the world market, global and regional supply and demand for rare earth minerals and products, and the political and economic conditions of countries (including specifically China and the U.S.s relationship with China at any given time) that produce rare earth minerals and products.\nA prolonged or significant economic contraction in the United States or worldwide could put further downward pressure on market prices of rare earth minerals and products. Protracted periods of low prices for rare earth minerals and products could significantly reduce revenues and the availability of required development funds in the future. This could cause substantial reductions to, or a suspension of, REO production operations, impair asset values and if reserves are established on our prospects, reduce our proven and probable rare earth ore reserves.\nIn contrast, extended periods of high commodity prices may create economic dislocations that may be destabilizing to rare earth minerals supply and demand and ultimately to the broader markets. Periods of high rare earth mineral market prices generally are beneficial to us. However, strong rare earth mineral prices also create economic pressure to identify or create alternate technologies that ultimately could depress future long-term demand for rare earth minerals and products, and at the same time may incentivize development of otherwise marginal mining properties.\nPermitting, licensing and approval processes are required for the operations at the Round Top Project and obtaining and maintaining required permits and licenses is subject to conditions which may be unable to be achieved.\nBoth mineral exploration and extraction at the Round Top Project requires permits from various federal, state, provincial and local governmental authorities and are governed by laws and regulations, including those with respect to prospecting, mine development, mineral production, transport, export, taxation, labor standards, occupational health, waste disposal, toxic substances, land use, environmental protection, mine safety and other matters. Permits known to be required are (i) an operating plan for the conduct of exploration and development approved by the GLO, (ii) an operating plan for production approved by the GLO, (iii) various reporting to and approval by the Texas Railroad Commission regarding drilling and plugging of drill holes, and (v) reporting to and compliance with regulations of the Texas Commission of Environmental Quality. If Round Top recovers uranium at the Round Top Project, it will be required to obtain a source material license from the United States Nuclear Regulatory Commission. Round Top may also be subject to the reporting requirements and regulations of the Texas Department of Health. Such licenses and permits are subject to changes in regulations and changes in various operating circumstances. Companies that engage in exploration activities often experience increased costs and delays in production and other schedules as a result of the need to comply with applicable laws, regulations and permits. Issuance of permits for the Round Top activities is subject to the discretion of government authorities, and Round Top may be unable to obtain or maintain such permits. Permits required for future exploration or development may not be obtainable on reasonable terms or on a timely basis. There can be no assurance that Round Top will be able to obtain or maintain any of the permits required for the continued exploration or development of the Round Top Project (or any other of our mineral properties that we may subsequently acquire) or for the construction and operation of a mine on our properties that we may subsequently acquire at economically viable costs. If Round Top or we cannot accomplish these objectives, our business could face difficulty and/or fail.\nRound Top is subject to significant governmental regulations, which affect its operations and costs of conducting its business.\nRound Tops current and future operations are and will be governed by laws and regulations, including:\n● laws and regulations governing mineral concession acquisition, prospecting, development, mining and production;\n● laws and regulations related to exports, taxes and fees;\n● labor standards and regulations related to occupational health and mine safety;\n● environmental standards and regulations related to waste disposal, toxic substances, land use and environmental protection; and\n● other matters.\nCorporations engaged in exploration activities often experience increased costs and delays in production and other schedules as a result of the need to comply with applicable laws, regulations and permits. Failure to comply with applicable laws, regulations and permits may result in enforcement actions, including the forfeiture of claims, orders issued by regulatory or judicial authorities requiring operations to cease or be curtailed, and may include corrective measures requiring capital expenditures, installation of additional equipment or costly remedial actions. Round Top may be required to compensate those suffering loss or damage by reason of its mineral exploration activities and may have civil or criminal fines or penalties imposed for violations of such laws, regulations and permits.\nExisting and possible future laws, regulations and permits governing operations and activities of exploration companies, or more stringent implementation, could have a material adverse impact on Round Tops business and cause increases in capital expenditures or require abandonment or delays in exploration.\nRegulations and pending legislation governing issues involving climate change could result in increased operating costs, which could have a material adverse effect on Round Top as well as any other business in which we engage.\nA number of governments or governmental bodies have introduced or are contemplating regulatory changes in response to various climate change interest groups and the potential impact of climate change. Legislation and increased regulation regarding climate change could impose significant costs on Round Top, our venture partners and our suppliers, including costs related to increased energy requirements, capital equipment, environmental monitoring and reporting and other costs to comply with such regulations. Any adopted future climate change regulations could also negatively impact the ability to compete with companies situated in areas not subject to such limitations. Given the emotion, political significance and uncertainty around the impact of climate change and how it should be dealt with, we cannot predict how legislation and regulation will affect our financial condition, operating performance and ability to compete. Furthermore, even without such regulation, increased awareness and any adverse publicity in the global marketplace about potential impacts on climate change by us or other companies in our industry could harm our reputation. The potential physical impacts of climate change on our operations are highly uncertain, and would be particular to the geographic circumstances in areas in which we operate. These may include changes in rainfall and storm patterns and intensities, water shortages, changing sea levels and changing temperatures. These impacts may adversely impact the cost, production and financial performance of the Round Top operations or any other mineral projects we may pursue.\nRound Tops exploration and development activities are subject to environmental risks, which could expose Round Top to significant liability and delay, suspension or termination of our operations.\nThe exploration, possible future development and production phases of the Round Top business will be subject to federal, state and local environmental regulation. These regulations mandate, among other things, the maintenance of air and water quality standards and land reclamation. They also set out limitations on the generation, transportation, storage and disposal of solid and hazardous waste. Environmental legislation is evolving in a manner which will require stricter standards and enforcement, increased fines and penalties for non-compliance, more stringent environmental assessments, and a heightened degree of responsibility for companies and their officers, directors and employees. Future changes in environmental regulations, if any, may adversely affect our operations. If Round Top fails to comply with any of the applicable environmental laws, regulations or permit requirements, it could face regulatory or judicial sanctions. Penalties imposed by either the courts or administrative bodies could delay or stop operations or require a considerable capital expenditure. Although Round Top intends to comply with all environmental laws and permitting obligations in conducting its business, there is a possibility that those opposed to exploration and mining will attempt to interfere with its operations, whether by legal process, regulatory process or otherwise.\nEnvironmental hazards unknown to Round Top, which have been caused by previous or existing owners or operators of the properties, may exist on the properties comprising the Round Top Project. It is possible that these properties could be located on or near the site of a Federal Superfund cleanup project; as such, it is possible that environmental cleanup or other environmental restoration procedures could remain to be completed or mandated by law, causing unpredictable and unexpected liabilities to arise.\nThe Comprehensive Environmental, Response, Compensation, and Liability Act (CERCLA), and comparable state statutes, impose strict, joint and several liability on current and former owners and operators of sites and on persons who disposed of or arranged for the disposal of hazardous substances found at such sites. It is not uncommon for the government to file claims requiring cleanup actions, demands for reimbursement for government-incurred cleanup costs, or natural resource damages, or for neighboring landowners and other third parties to file claims for personal injury and property damage allegedly caused by hazardous substances released into the environment. The Federal Resource Conservation and Recovery Act (RCRA), and comparable state statutes, govern the disposal of solid waste and hazardous waste and authorize the imposition of substantial fines and penalties for noncompliance, as well as requirements for corrective actions. CERCLA, RCRA and comparable state statutes can impose liability for clean-up of sites and disposal of substances found on exploration, mining and processing sites long after activities on such sites have been completed.\nThe Clean Air Act, as amended, restricts the emission of air pollutants from many sources, including mining and processing activities. Our mining operations may produce air emissions, including fugitive dust and other air pollutants from stationary equipment, storage facilities and the use of mobile sources such as trucks and heavy construction equipment, which are subject to review, monitoring and/or control requirements under the Clean Air Act and state air quality laws. New facilities may be required to obtain permits before work can begin, and existing facilities may be required to incur capital costs in order to remain in compliance. In addition, permitting rules may impose limitations on our production levels or result in additional capital expenditures in order to comply with the rules.\nThe National Environmental Policy Act (NEPA) requires federal agencies to integrate environmental considerations into their decision-making processes by evaluating the environmental impacts of their proposed actions, including issuance of permits to mining facilities, and assessing alternatives to those actions. If a proposed action could significantly affect the environment, the agency must prepare a detailed statement known as an Environmental Impact Statement (EIS). The U.S. Environmental Protection Agency (EPA), other federal agencies, and any interested third parties will review and comment on the scoping of the EIS and the adequacy of and findings set forth in the draft and final EIS. This process can cause delays in issuance of required permits or result in changes to a project to mitigate its potential environmental impacts, which can in turn impact the economic feasibility of a proposed project.\nThe Clean Water Act (CWA), and comparable state statutes, imposes restrictions and controls on the discharge of pollutants into waters of the United States. The discharge of pollutants into regulated waters is prohibited, except in accordance with the terms of a permit issued by the EPA or an analogous state agency. The CWA regulates storm water mining facilities and requires a storm water discharge permit for certain activities. Such a permit requires the regulated facility to monitor and sample storm water run-off from its operations. The CWA and regulations implemented thereunder also prohibit discharges of dredged and fill material in wetlands and other waters of the United States unless authorized by an appropriately issued permit. The CWA and comparable state statutes provide for civil, criminal and administrative penalties for unauthorized discharges of pollutants and impose liability on parties responsible for those discharges for the costs of cleaning up any environmental damage caused by the release and for natural resource damages resulting from the release.\nThe Safe Drinking Water Act (SDWA) and the Underground Injection Control (UIC) program promulgated thereunder, regulate the drilling and operation of subsurface injection wells. EPA directly administers the UIC program in some states and in others the responsibility for the program has been delegated to the state. The program requires that a permit be obtained before drilling a disposal or injection well. Violation of these regulations and/or contamination of groundwater by mining related activities may result in fines, penalties, and remediation costs, among other sanctions and liabilities under the SWDA and state laws. In addition, third party claims may be filed by landowners and other parties claiming damages for alternative water supplies, property damages, and bodily injury.\nRound Top could be subject to environmental lawsuits.\nNeighboring landowners and other third parties could file claims based on environmental statutes and common law for personal injury and property damage allegedly caused by the release of hazardous substances or other waste material into the environment on or around the Round Top Project. There can be no assurance that any defense of such claims will be successful. A successful claim against Round Top could have an adverse effect on not only Round Top, but us and our business prospects, financial condition and results of operation.\nLand reclamation requirements for the Round Top Project may be burdensome and expensive.\nAlthough variability exists by location and the governing authority, land reclamation requirements are generally imposed on mineral exploration companies (as well as companies with mining operations) in order to minimize long term effects of land disturbance.\nReclamation may include requirements to:\n● control dispersion of potentially deleterious effluents;\n● treat ground and surface water to drinking water standards; and\n● reasonably re-establish pre-disturbance land forms and vegetation.\nIn order to carry out reclamation obligations imposed on Round Top in connection with potential development activities, Round Top must allocate financial resources that might otherwise be spent on further exploration and development programs. Round Top plans to set up a provision for our reclamation obligations on its properties, as appropriate, but this provision may not be adequate. If Round Top is required to carry out unanticipated reclamation work, its financial position could be adversely affected. In accordance with GLO lease/prospecting permits, all the areas impacted by the surface operations shall be reclaimed upon completion of the activity, including (a) removal of all trash, debris, plastic and contaminated soil by off-site disposal, and (b) upon completion of surface grading, the soil surface shall be left in a roughened condition to negate wind and enhance water infiltration.\nMining presents potential health risks; payment of any liabilities that arise from these health risks may adversely impact Round Top.\nComplying with health and safety standards will require additional expenditure on testing and the installation of safety equipment. Moreover, inhalation of certain minerals can result in specific potential health risks. Symptoms of these associated diseases may take years to manifest. Failure to comply with health and safety standards could result in statutory penalties and civil liability. Round Top does not currently maintain any insurance coverage against these health risks. The payment of any liabilities that arise from any such occurrences could have a material, adverse impact on Round Top.\nThere may be challenges to the title of the Round Top Project or any other mineral properties that we may acquire.\nWe expect that any additional properties to be acquired by Round Top or by us (with respect to any other opportunities) will be by unpatented claims or by lease from those owning the property. The lease of the Round Top Project property was issued by the State of Texas. The validity of title to many types of natural resource property depends upon numerous circumstances and factual matters (many of which are not discoverable of record or by other readily available means) and is subject to many uncertainties of existing law and its application. We cannot assure you that the validity of Round Tops titles to its properties or our title to properties we may purchase in the future will be upheld or that third parties will not otherwise invalidate those rights. In the event the validity of Round Tops or our titles with respect to any future properties are not upheld, such an event would have a material adverse effect on Round Top and us.\nIncreased competition could adversely affect our ability to attract necessary capital funding or acquire suitable producing properties or prospects for mineral exploration in the future.\nThe mining industry is intensely competitive. Significant competition exists for the acquisition of properties producing or capable of producing, REE or other metals. We likely are at a competitive disadvantage in acquiring additional mining properties because we must compete with other individuals and companies, most of which have greater financial resources, operational experience and technical capabilities than us. We may also encounter increasing competition from other mining companies in our efforts to hire experienced mining professionals. Competition for exploration resources at all levels is currently very intense, particularly affecting the availability of manpower, drill rigs, mining equipment and production equipment. Increased competition could adversely affect our ability to attract necessary capital funding or acquire suitable producing properties or prospects for mineral exploration in the future.\nRound Top competes with larger, better capitalized competitors in the mining industry.\nThe mining industry is competitive in all of its phases, including financing, technical resources, personnel and property acquisition. Round Top will require significant capital, technical resources, personnel and operational experience to effectively compete in the mining industry. Because of the high costs associated with exploration, the expertise required to analyze a projects potential and the capital required to develop a mine, larger companies with significant resources may have a competitive advantage over Round Top. Round Top faces strong competition from other mining companies, some with greater financial resources, operational experience and technical capabilities than us. As a result of this competition, neither Round Top nor us may be able to acquire financing, personnel, technical resources or attractive mining properties on acceptable terms, if at all.\nCurrent economic conditions and capital markets are subject to fluctuations which could adversely affect our ability to access the capital markets, and thus adversely affect our business and liquidity.\nThe current economic conditions are in a state of flux that could have a negative impact on our ability to access the capital markets, and thus have a negative impact on our business and liquidity. We currently face the macroeconomic headwinds of inflation and high interest rates. Furthermore, it is unclear how global hostilities will impact our business. Our ability to access the capital markets has been and continues to be severely restricted at a time when we need to access such markets, which could have a negative impact on our business plans. Even if we are able to raise capital, it may not be at a price or on terms that are favorable to us. We cannot predict the occurrence of future financial disruptions or how long the current market conditions may continue. It should be expected that we will have difficulty to raise funds, if we are even able to raise funds at all, and any such capital raises will be dilutive to our current stockholders (which dilution could be significant).\nOur resources may not be sufficient to manage our existing business as well as any growth; failure to properly manage our existing business will be detrimental.\nWe may fail to adequately manage our current business. Furthermore, any growth in our operations, of which there can be no assurance, will place a significant strain on our administrative, financial and operational resources, and increase demands on our management and on our operational and administrative systems, controls and other resources. We cannot assure you that our existing personnel, systems, procedures or controls will be adequate to support our current operations or operations in the future or that we will be able to successfully implement appropriate measures consistent with any growth. We may have to implement new operational and financial systems, procedures and controls to expand, train and manage our employee base, and maintain close coordination among our staff. We cannot guarantee that we will be able to do so, or that if we are able to do so, we will be able to effectively integrate them into our existing staff and systems. Moreover, there can be no assurance that cybersecurity threats, breaches, or disruptions will not adversely affect us.\nIf we are unable to manage our current business effectively, our financial condition could be materially adversely affected. There is no assurance that our current business will grow and it may well shrink due to lack of capital.\nWe may experience difficulty attracting and retaining qualified management to meet our current business needs and/or any growth needs, and the failure to manage any growth effectively could have a material adverse effect on our business and financial condition.\nCompetition for additional qualified management is intense, and we may be unable to attract and retain additional key personnel, or to attract and retain personnel on terms acceptable to us. Management personnel are currently limited and they may be unable to manage our expansion successfully and the failure to do so could have a material adverse effect on our business, results of operations and financial condition. We have not entered into non-competition agreements. As our business is substantially dependent upon the directors, executive officers and consultants, the lack of non-competition agreements poses a significant risk to us in the event such persons were to resign or be terminated from such positions. Under such circumstances, such persons may provide confidential information and key contacts to our competitors and we may have difficulties in preventing the disclosure of such information. Such disclosure would have a material adverse effect on our business and operations.\nOur operations are dependent upon key personnel, the loss of which would be detrimental to our business.\nThe nature of our business, including our ability to continue our exploration and development activities, depends, in large part, on the efforts of key personnel such as Daniel Gorski, our Chief Executive Officer. The loss of Mr. Gorski could have a material adverse effect on our business. We do not maintain key man life insurance policies on any of our officers or employees.\nRisks Associated with our Common Stock\nInvestment in our Company has a high degree of risk. Before you invest you should carefully consider the risks and uncertainties described below. If any of the following risks actually occur, our business, operating results and financial condition could be harmed and the value of our stock could go down.\nWe have a history of losses and fluctuating operating results that raises doubt about our ability to continue as a going concern.\nFrom inception through August 31, 2023, we have incurred aggregate losses of approximately $42.334 million. There is no assurance that we will operate profitably or will generate positive cash flow in the future. In addition, our operating results in the future may be subject to significant fluctuations due to many factors not within our control, such as general economic conditions, hostilities in the Middle East and Ukraine, market price of minerals and exploration and development costs. If we cannot raise sufficient financing to continue our operations, then we may be forced to scale down or even close our operations. Until such time as we generate revenues (not in the foreseeable future), we expect an increase in development costs and operating costs. Consequently, we expect to incur operating losses and negative cash flow until our properties enter commercial production (if such event occurs).\nOur stock price is highly volatile.\nThe market price of our Common Stock has fluctuated and may continue to fluctuate. These fluctuations may be exaggerated since the trading volume of our Common Stock is limited, sporadic, and volatile. These fluctuations may or may not be based upon any business or operating results. Our Common Stock may experience similar or even more dramatic price and volume fluctuations in the future. Our Common Stock price has decreased from $1.31 per share on January 3, 2023 to $0.31 per share on November 10, 2023. We have limited trading volume in our Common Stock. There is no assurance that our Common Stock price will not continue to decline. Based on current market prices and current trading volume, raising any capital will likely be dilutive and difficult, and may not be possible at all.\nThe market for our Common Stock is limited, sporadic and volatile. Any failure to develop or maintain an active trading market could negatively affect the value of our shares and make it difficult or impossible for you to sell your shares.\nOur Common Stock is currently traded on the OTCQB. Although our Common Stock is traded on the OTCQB, a regular trading market for our securities may not be sustained in the future. Prices for, and coverage of, securities quoted solely on the OTCQB may be difficult to obtain. In addition, stocks quoted solely on the OTCQB tend to have a limited number of market makers and a larger spread between the bid and ask prices than those listed on an exchange. All of these factors may cause holders of our Common Stock to be unable to resell their securities at any price. It should be expected that this limited trading also could decrease or eliminate our ability to raise additional funds through issuances of our securities.\nFailure to develop or maintain an active trading market would negatively affect the value of our shares, make it difficult for you to sell your shares or recover any part of your investment in us, and impact our ability to raise capital through the sale of shares of our Common Stock. Even if an active market for our Common Stock does develop, the market price of our Common Stock may be highly volatile. In addition to the uncertainties relating to our future operating performance and any profitability of our operations, factors such as variations in our interim financial results, or various, as yet unpredictable factors, many of which are beyond our control, may have a negative effect on the market price of our Common Stock. Accordingly, there can be no assurance as to the liquidity of any active markets that may develop for our Common Stock, the ability of holders of our Common Stock to sell our Common Stock, the prices at which holders may be able to sell our Common Stock, or our ability (if any) to sell shares of our Common Stock to raise capital.\nThe sale of substantial shares of our Common Stock or the issuance of shares upon exercise of our common stock equivalents will cause immediate and substantial dilution to our existing stockholders and may depress the market price of our Common Stock.\nIn order to provide capital for the operation of our business, we may enter into additional financing arrangements. These arrangements may involve the issuance of new Common Stock, preferred stock that is convertible into Common Stock, debt securities that are convertible into Common Stock or warrants for the purchase of Common Stock. Any of these items could result in a material increase in the number of shares of Common Stock outstanding which would in turn result in a dilution of the ownership interest of existing Common Stockholders. It is likely that any future private placements of our Common Stock will be at prices below market, thereby further placing pressure on the price of our Common Stock that trade on the OTCQB - this would have the effect of both reducing our market price and diluting our current stockholders. As such, any future capital raises will likely adversely affect our shareholders. In addition, these new securities could contain provisions, such as priorities on distributions and voting rights, which could affect the value of our existing Common Stock.\nAs of November 21, 2023, we have 73,784,810 shares of Common Stock issued and outstanding (100,000,000 shares of Common Stock are authorized to be issued), and 1,030,000 shares of our Common Stock underlying common stock equivalents at exercise prices between $0.10 and $1.31 per share, expiring through August 2028.\nA low market price may severely limit the potential market for our Common Stock.\nAn equity security that trades below a certain price per share is subject to SEC rules requiring additional disclosures by broker-dealers. These rules generally apply to any non-Nasdaq equity security that has a market price of less than $5.00 per share, subject to certain exceptions (a penny stock). Such rules require the delivery, prior to any penny stock transaction, of a disclosure schedule explaining the penny stock market and the risks associated therewith and impose various sales practice requirements on broker-dealers who sell penny stocks to persons other than established customers and institutional or wealthy investors. For these types of transactions, the broker-dealer must make a special suitability determination for the purchaser and have received the purchasers written consent to the transaction prior to the sale. The broker-dealer also must disclose the commissions payable to the broker-dealer, current bid and offer quotations for the penny stock and, if the broker-dealer is the sole market maker, the broker-dealer must disclose this fact and the broker-dealers presumed control over the market. Such information must be provided to the customer orally or in writing before or with the written confirmation of trade sent to the customer. Monthly statements must be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks. Since our Common Stock trades at a price of less than $5.00 per share, the additional burdens imposed upon broker-dealers by such requirements could discourage broker-dealers from effecting transactions in our Common Stock.\nWe do not currently intend to pay cash dividends.\nWe have not declared any dividends since incorporation and do not anticipate that we will do so in the foreseeable future. Our present policy is to retain all available funds for use in our operations and the expansion of our business. Payment of future cash dividends, if any, will be at the discretion of our Board and will depend on our financial condition, results of operations, contractual restrictions, capital requirements, business prospects and other factors that our Board considers relevant. Accordingly, investors will only see a return on their investment if the value of our securities appreciates.\nControl by current stockholders.\nThe current stockholders have elected the directors and the directors have appointed current executive officers to serve our Company. The voting power of these stockholders could also discourage others from seeking to acquire control of us through the purchase of our Common Stock which might depress the price of our Common Stock.\nThere is not now, and there may never be, an active market for our Common Stock.\nShares of our Common Stock have historically been thinly traded. Currently there is a limited, sporadic and highly volatile market for our Common Stock, and no active market for our Common Stock may develop in the future. As a result, our stock price as quoted by the OTCQB may not reflect an actual or perceived value. Moreover, several days may pass before any shares are traded; meaning that the number of persons interested in purchasing our common shares at or near ask prices at any given time may be relatively small or non-existent. This situation is attributable to a number of factors, including, but not limited to:\n● we are a small company that is relatively unknown to stock analysts, stock brokers, institutional investors and others in the investment community that generate or influence sales volume; and\n● stock analysts, stock brokers and institutional investors may be risk-averse and reluctant to follow a company such as ours that may in the future face substantial doubt about the ability to continue as a going concern or to purchase or recommend the purchase of our shares until such time as we become more viable.\nAs a result, an investor may find it difficult to dispose of, or to obtain accurate quotations of the price of, our Common Stock. Accordingly, investors must assume they may have to bear the economic risk of an investment in our Common Stock for an indefinite period of time, and may lose their entire investment. There can be no assurance that a more active market for our Common Stock will develop, or if one should develop, there is no assurance that it will be sustained. This severely limits the liquidity of our Common Stock and would likely have a material adverse effect on the market price of our Common Stock and on our ability to raise additional capital.\nWe may issue shares of preferred stock.\nOur Certificate of Incorporation authorizes the issuance of up to 10,000,000 shares of blank check preferred stock at $0.001 par value with designations, rights and preferences determined from time to time by the board of directors. There are currently no shares of preferred stock issued and outstanding. Our board of directors is empowered, without stockholder approval, to issue preferred stock with dividend, liquidation, conversion, voting, or other rights which could adversely affect the voting power or other rights of the holders of the Common Stock. In the event of issuance, the preferred stock could be utilized, under certain circumstances, as a method of discouraging, delaying or preventing a change in control of the Company. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.\nITEM 1C. CYBERSECURITY\nN/A ITEM 2. PROPERTIES\nExecutive and Field Offices. Our headquarters are located at 539 El Paso Street, Sierra Blanca, Texas 79851. Our accounting functions are conducted by personnel in Galveston, Texas and Denver, Colorado, all under the supervision of our chief financial officer.\nOverview of the Round Top Project. Round Top is currently in the exploration stage and has not established that the Round Top Project contains proven mineral reserves or probable mineral reserves as defined under Item 1300 of Regulation S-K. The Round Top Project is currently owned by Round Top Development, LLC in which we currently have a 19.611% membership interest.\nDescription and Access\nThe Round Top Project is located in Hudspeth County approximately eight miles northwest of the town of Sierra Blanca. The property is reached by truck on a private dirt road that turns north off Interstate 10 access road approximately one mile west of the town of Sierra Blanca. A railroad line is located approximately one to three miles from the Round Top Project and a spur line stops at a stone quarry within three miles of the Round Top Project.\nRound Top Location Map\nAugust 2010 Lease\nIn August 2010, the Company entered into a new mining lease with the GLO covering Sections 7 and 18 of Township 7, Block 71 and Section 12 of Block 72, covering approximately 860 acres at Round Top Mountain in Hudspeth County, Texas. The mining lease issued by the GLO provided for the right to explore, produce, develop, mine, extract, mill, remove, and market uranium, rare earth elements, all other base and precious metals, industrial minerals and construction materials and all other minerals excluding oil, gas, coal, lignite, sulfur, salt, and potash. The term of the lease is nineteen years from the execution date of the lease so long as minerals are produced in paying quantities. This lease was assigned to Round Top in May 2021.\nUnder the lease, Round Top is obligated to pay the State of Texas a lease bonus of $142,518; $44,718 of which the Company previously paid upon the execution of the lease, and $97,800 which will be due and payable by Round Top upon the submission of a supplemental plan of operations to conduct mining. Upon the sale of minerals removed from the Round Top Project, Round Top will be required to pay the State of Texas a $500,000 minimum advance royalty.\nThereafter, Round Top will be required to pay the State of Texas a production royalty equal to eight percent of the market value of uranium and other fissionable materials removed and sold from Round Top and six and one quarter percent of the market value of all other minerals removed and sold from the Round Top Project.\nIf paying quantities have not been obtained, Round Top may pay additional delay rental fees to extend the term of the lease for successive one (1) year periods pursuant to the following schedule:\nPer Acre\nAmount Total\nAmount\nSeptember 2, 2020 - 2024 $ 150 $ 134,155\nSeptember 2, 2025 - 2029 $ 200 $ 178,873\nIn August 2023, Round Top paid the State of Texas a delay rental to extend the term of the lease in an amount equal to $134,155.\nNovember 2011 Lease\nIn November 2011, the Company entered into a mining lease with the State of Texas covering approximately 90 acres contiguous with and extending the August 2010 Lease. Under the lease, the Company paid the State of Texas a lease bonus of $20,700 which was paid upon the execution of the lease. Upon the sale of minerals removed from the Round Top Project, Round Top will be required to pay the State of Texas a $50,000 minimum advance royalty. Thereafter, Round Top will be required to pay the State of Texas a production royalty equal to eight percent of the market value of uranium and other fissionable materials removed and sold from the Round Top Project and six and one quarter percent of the market value of all other minerals sold from the Round Top Project. The term of the lease is nineteen years from the execution date of the lease so long as minerals are produced in paying quantities. This lease was assigned to Round Top in May 2021.\nAcquisition and Ownership\nIf paying quantities have not been obtained, Round Top may pay additional delay rental fees to extend the term of the lease for successive one (1) year periods pursuant to the following schedule:\nPer Acre\nAmount Total\nAmount\nNovember 1, 2020 - 2024 $ 150 $ 13,500\nNovember 1, 2025 - 2029 $ 200 $ 18,000\nIn August 2023, Round Top paid the State of Texas a delay rental to extend the term of the lease in an amount equal to $13,500.\nMarch 2013 Lease\nOn March 6, 2013, the Company purchased the surface lease at the Round Top Project, known as the West Lease, from the Southwest Wildlife and Range Foundation (since renamed the Rio Grande Foundation) for $500,000 cash and 1,063,830 shares of common stock valued at $500,000. The Company also agreed to support the Foundation through an annual payment of $45,000 for ten years to support conservation efforts within the Rio Grande Basin. The West Lease comprises approximately 54,990 acres. The purchase of the surface lease provides unrestricted surface access for the potential development and mining of the Round Top Project. The West Lease was assigned to Round Top in May 2021.\nOctober 2014 Surface Option and Water Lease\nIn October 2014, the Company executed agreements with the GLO securing the option to purchase the surface rights covering the potential Round Top Project mine and plant areas and, separately, a groundwater lease. The option to purchase the surface rights covers approximately 5,670 acres over the mining lease and the additional acreage should be adequate to site all potential heap leaching and processing operations as currently anticipated by Round Top. Round Top may exercise the option for all or part of the option acreage at any time during the sixteen year primary term of the mineral lease. The option can be kept current by an annual payment of $10,000. The purchase price will be the appraised value of the surface at the time of exercising the option.\nThe ground water lease secures the right to develop the ground water within a 13,120 acre lease area located approximately 4 miles from the Round Top deposit. This lease has an annual minimum production payment of $5,000 prior to production of water for the operation. After initiation of production Round Top will pay $0.95 per thousand gallons or $20,000 annually, whichever is greater. This lease remains effective as long as the mineral lease is in effect.\nThis option and groundwater lease were assigned to Round Top in May 2021.\nMarch 2021 Purchased the South ½ of Section 45, Block 71, Township 6, T&P RR Survey\nThis ½ section comprising 320 acres more or less was purchased for a price of $400 per acre, or a total of approximately $128,000. This tract was purchased for siting the demonstration plant when it is relocated from its present location at Wheatridge, Colorado. This tract is contiguous with the Surface Option area and was assigned to Round Top in May 2021.\nMay 2021 Easements\nOn May 7, 2021, the Company purchased a road, water line and power line easement extending slightly over a mile from the western boundary of the Water lease to the southeastern corner of the Section 45 tract. This easement completes the arrangements for the main access road from State Highway 111, across the Water Lease and into the Surface Option area, and was assigned to Round Top in May 2021.\nGeology\nThe Round Top Project area lies within the Texas Lineament Zone or Trans-Pecos Trend. The lineament is a northwest trending structural zone where Laramide thrust faulting followed by basin and range normal faulting were active. Tertiary igneous activity is also associated with the lineament zone, both intrusive and extrusive.\nLocally the project area is characterized by five Tertiary rhyolite bodies that intruded Cretaceous sedimentary rocks. The rhyolites occur as laccoliths, mushroom-shaped bodies emplaced at relatively shallow depths. At the current erosional levels, laccoliths form resistant peaks with relief up to 2,000 feet. The rhyolites are enriched with various metals which may or may not be economical to recover. The rare earth elements are located within the intrusive rhyolite body.\nSedimentary rocks exposed in the area are middle to upper Cretaceous limestone shales and sandstones. The limestone, where it is in contact with the microgranites, is the host for fluorspar mineralization.\nInitial exploration took place in the mid-1980s. During the course of this exploration, approximately 200 drill holes were drilled, targeting potential beryllium mineralization which penetrated varying thicknesses of the rhyolite volcanic rock that makes up the mass of Round Top Mountain.\nThe Texas Bureau of Economic Geology, working with the project geologists, conducted an investigation of the rhyolite to better understand its rare metal content. This research shows that the rhyolite laccoliths at Sierra Blanca are enriched in a variety of REEs, lithium gallium, beryllium, hafnium, and zirconium. They analyzed a series of samples from outcrop and drill holes and studied the geochemistry and mineralogy of the rhyolite. The results of their research were published in the GSA, Geological Society of America, Special Paper 246, 1990.\nMineralization\nRound Top rhyolite is enriched in REEs, lithium, gallium, hafnium and beryllium. REE mineralization occurs primarily as disseminated microcrystals of varieties of fluorite (such as yttrium-rich yttrofluorite). REE minerals occur mainly in vugs and as crystal coatings, suggesting late-stage crystallization from an incompatible element-rich fluid.\nAlhambra Project\nIn November 2021, the Company entered into a mineral exploration and option agreement with Santa Fe Gold Corporation (Santa Fe). Under the option agreement, the Company and Santa Fe plan to pursue, negotiate and subsequently enter into a joint venture agreement to jointly explore and develop a target silver property to be selected by the Company among patented and unpatented mining claims held by Santa Fe within the Black Hawk Mining District in Grant County, New Mexico. Completion of a joint venture agreement, if any, is subject to the successful outcome of a multi-phase exploration plan leading to a bankable feasibility study to be undertaken in the near future by the Company. Under the contemplated terms of the proposed joint venture agreement, the Company would be project operator and initially own 50.5% of the joint venture while Santa Fe would initially own 49.5%. Additional terms of the joint venture are expected to be negotiated between the Company and Santa Fe in the future. There can be no assurance that the Company and Santa Fe will enter into a formal join venture agreement.\nUnder the terms of the option agreement, the Company plans to conduct a district-wide evaluation among the patented and unpatented claims held by Santa Fe, consisting of geologic mapping, sampling, trenching, radiometric surveying, geophysics, drilling and/or other methods as warranted. Based on the district-wide evaluation, the Company would designate one 80-acre tract as the project area and commence detailed exploration work. The property covered in the option agreement is approximately 1,300 acres and covers approximately 75% of the known mining district. The area to be studied also includes a two-mile radius area of interest. The option agreement provides the Company with the right to designate any properties within the area of interest as project area properties. The term of the option is for so long as the Company continues to conduct exploration activities in the Project Area and can be exercised on 60 days notice to Santa Fe.\nThe Black Hawk district and the Alhambra mine, in particular, are historically known for the occurrence of native silver lenses, randomly distributed in narrow carbonate veins. The ore shoots are small, ranging from ten feet to seventy feet along the vertical axis and five to fifty along the horizontal axis. We believe that the excessive cost of locating and mining these small ore shoots has been the principal reason for the inability to sustain a mining operation in this district.\nBecause of the high native silver content of ore historically mined in the district, we have considered the use of geophysics to locate these small lenses and pods, with the goal to make potential development and mining feasible. We are working with a geophysical service provider and consultants, and have completed four phases of electromagnetic surveying in the immediate area of the Alhambra mine. The method producing the most meaningful geological data is a method called NANOTEM by its developer, Zonge International. This technique was developed to locate small electrically conducting objects such as pipes, underground tanks and unexploded ordinance. Working with consultants and with Zonge International this technique was modified and applied to the immediate area of the Alhambra mine. Results are encouraging and plans have been made to conduct a diamond drilling campaign to test the electrically conductive anomalies detected to date. This drilling is sited to test these anomalies within the geologically favorable area along the vein immediately to the north of the Alhambra mine workings.\nIf the diamond drilling yields positive results, the anticipated next phase will be to enter the mine and extend the one hundred twelve foot level into the area drilled. Work to be done upon re-entry of the mine will be determined by diamond drilling results and conditions encountered in the mine.\nBecause the desired aim of the geophysics and diamond drilling is to gain the confidence to re-enter the mine, very careful consideration has to be given to the permitting of this project. The permitting plan being submitted goes beyond the permits required for a simple drilling program and seeks to anticipate such factors as shaft rehabilitation, water management, road access and later, mine development. ITEM 3. LEGAL PROCEEDINGS\nNone. ITEM 4. MINE SAFETY DISCLOSURES\nPursuant to Section 1503(a) of the recently enacted Dodd-Frank Wall Street Reform and Consumer Protection Act (The Dodd-Frank Act), issuers that are operators, or that have a subsidiary that is an operator, of a coal or other mine in the United States are required to disclose in their periodic reports filed with the SEC information regarding specified health and safety violations, orders and citations, related assessments and legal actions, and mining-related fatalities. During the fiscal year ended August 31, 2023, our U.S. exploration properties were not subject to regulation by the Federal Mine Safety and Health Administration (MSHA) under the Federal Mine Safety and Health Act of 1977 (the Mine Act).\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur Common Stock is listed for quotation on the OTCQB operated by OTC Markets Group Inc. under the symbol TMRC. The market for our Common Stock on the OTCQB is limited, sporadic and highly volatile. The quotations reflect inter-dealer prices without retail mark-up, mark-down or commission and may not represent actual transactions. The following table sets forth the range of high and low bid prices during the periods indicated.\nFiscal Year 2023 High Low\nQuarter ended August 31, 2023 $ 1.26 $ 0.79\nQuarter ended May 31, 2023 $ 1.32 $ 0.78\nQuarter ended February 28, 2023 $ 1.79 $ 1.20\nQuarter ended November 30, 2022 $ 2.13 $ 1.76\nFiscal Year 2022 High Low\nQuarter ended August 31, 2022 $ 2.30 $ 1.70\nQuarter ended May 31, 2022 $ 2.21 $ 1.65\nQuarter ended February 28, 2022 $ 2.38 $ 1.62\nQuarter ended November 30, 2021 $ 2.49 $ 1.41\nThe last bid price of our Common Stock on November 17, 2023 was $0.3450 per share.\nHolders\nThe approximate number of holders of record of our Common Stock as of November 17, 2023 was 530.\nDividends\nWe have not paid any cash dividends on our equity securities and our Board has no present intention of declaring any cash dividends. We are not prohibited from paying any dividends pursuant to any agreement or contract.\nSecurities Authorized for Issuance under Equity Compensation Plans\nWe previously adopted a stock option plan, approved by our shareholders (Amended 2008 Plan). The following table sets forth certain information as of August 31, 2023 concerning our Common Stock that may be issued upon the exercise of options issued under the Amended 2008 Plan and outside of such plan:\nPlan Category (a)\nNumber of\nSecurities to be\nIssued Upon\nthe Exercise\nof Outstanding\nOptions\n(b)\nWeighted-\nAverage\nExercise Price of\nOutstanding\nOptions\n(c)\nAvailable for\nFuture\nIssuance Under\nEquity\nCompensation\nPlans\n(Excluding\nSecurities\nReflected in\nColumn (a))\nEquity compensation plan approved by stockholders 330,000 $ 0.34 -\nNonplan equity compensation 700,000 $ 1.02 -\nTotal 1,030,000 $ 0.80 -\nRecent Sales of Unregistered Securities During Fiscal 2023\nExcept as set forth below, all unregistered sales of equity securities during the period covered by the Annual Report were previously disclosed in our current reports on Form 8-K or quarterly reports on Form 10-Q.\nDate Description Number Purchaser Proceeds\n($)\nConsideration Exemption\n(C)\nJune Common Stock 12,227(A) Directors $Nil Services Sec. 4(a)(2)\nJune Common Stock Options 10,000(B) Consultant $Nil Services Sec. 4(a)(2)\nJuly Common Stock Options 10,000(B) Consultant $Nil Services Sec. 4(a)(2)\nAugust Common Stock Options 10,000(B) Consultant $Nil Services Sec. 4(a)(2)\n(A) Common Stock issued to directors for services rendered.\n(B) Non-plan Common Stock options issued pursuant to a consulting agreement for professional services.\n(C) With respect to sales designated by Sec. 4(a)(2), these shares were issued pursuant to the exemption from registration contained in Section 4(a)(2) of the Securities Act as privately negotiated, isolated, non-recurring transactions not involving any public offer or solicitation. Each purchaser represented that such purchasers intention to acquire the shares for investment only and not with a view toward distribution. None of the securities were sold through an underwriter and accordingly, there were no underwriting discounts or commissions involved. ITEM 6. RESERVED ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nYou should read the following discussion and analysis of our financial condition and results of operations together with our financial statements and related notes appearing elsewhere in this Annual Report. This discussion and analysis contains forward-looking statements that involve risks, uncertainties and assumptions. See Cautionary Note Regarding Forward-Looking Statements. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of many factors, including, but not limited to, those set forth under Risk Factors and elsewhere in this Annual Report.\nOverview\nWe are a mining company engaged in the business of the acquisition, exploration and development of mineral properties. We currently own a 19.611% membership interest in Round Top, which entity holds two mineral property leases with the GLO to explore and develop a 950-acre rare earths project located in Hudspeth County, Texas, known as the Round Top Project. The leases expire in 2030 with provisions for automatic renewal if Round Top is producing in paying quantities (the receipt from the sale of materials exceeds all costs and expenses associated therewith for the prior 12 months). Round Top also holds prospecting permits covering 9,345 acres adjacent to the Round Top Project. The business strategy of Round Top is to develop a metallurgical process to concentrate or otherwise extract the metals from the Round Top Projects rhyolite, conduct additional engineering, design, geotechnical work, and permitting necessary for a bankable feasibility study and then to extract mineral resources from the Round Top Project. There can be no assurance that Round Top will be successful in this endeavor. The Round Top Project has not established as of the date hereof that any of the properties contain any probable mineral reserves or proven mineral reserves under Item 1300 of Regulation S-K nor can there be any assurance that this will occur.\nRare earth elements are a group of chemically similar elements that usually are found together in nature - they are referred to as the lanthanide series. These individual elements have a variety of characteristics that are critical in a wide range of technologies, products, and applications and are critical inputs in existing and emerging applications. Without these elements, multiple high-tech technologies would not be possible. These technologies include:\n● cell phones;\n● computer and television screens;\n● battery operated vehicles;\n● clean energy technologies, such as hybrid and electric vehicles and wind power turbines;\n● fiber optics, lasers and hard disk drives;\n● numerous defense applications, such as guidance and control systems and global positioning systems; and\n● advanced water treatment technology for use in industrial, military.\nBecause of these applications, global demand for REE is projected to steadily increase due to continuing growth in existing applications and increased innovation and development of new end uses. Interest in developing resources domestically has become a strategic necessity as there is limited production of these elements outside of China. Our ability to raise additional funds to continue to fund our participation interest in the Round Top Project may be impacted by future prices for REEs.\nOperations Update\nUSARE, the operating manager of the Round Top project, has advised TMRC that it continues to progress the Round Top Project toward operations. Over the last twelve months, Round Top achieved several major milestones including: (i) favorable breaker trials with the goal to increase mine throughput; (ii) favorable CIX separation trials for rare earth elements indicating that the CIX technology employed can extract commercial quality rare earths from the Round Top Project ore; and (iii) favorable membrane concentration trials. The USARE Round Top team continues its work to determine an efficient means of managing alumina content, adding gallium to its output and is working with a major lithium company to maximize the value of the lithium content. USARE has advised the Company that it (i) currently expects that (A) a PFS reflecting this work should be completed during calendar 2024 and (B) a small manufacturing unit should be established to begin processing Round Top Project ore in calendar 2025, and (ii) believes that Round Top remains an attractive venture and is in the process of updating the Round Top Project economic model.\nHistory of the Round Top Project\nIn May 2021, we contributed our assets in the Round Top Project to Round Top in exchange for our original 20% membership interest in Round Top. Between June 2023 through the date of this Annual Report, we elected not to contribute an aggregate of $845,049 to fund our cash calls and our membership interest in Round Top was diluted from 20% to 19.611%, our current membership interest in Round Top.\nAs a part of our ongoing operations, we will occasionally investigate new mining opportunities. We may also incur expenses associated with our investigations. These costs are expensed as incurred until such time when we have agreements in place to purchase such mining rights.\nInvestment Company Act Exclusion\nSection 3(c)(9) of the 1940 Act provides that a company substantially all of whose business consists of owning or holding oil, gas, or other mineral royalties or leases, or fractional interests therein, or certificates of interest or participation in or investment contracts relative to such royalties, leases, or fractional interests is not an investment company within the meaning of the 1940 Act. The Company has determined that this exemption applies to it giving consideration to the following four factors:\n● the exempted activity (ownership of our certificate of interest in the underlying mineral leases) constitutes substantially all of our business;\n● we own, and do not trade, in the certificate of interest in the mineral leases or the underlying mineral leases;\n● mineral leases qualify as an eligible asset for purposes of the exception; and\n● a membership interest in a limited liability company constitutes a certificate of interest or participation in or an investment contract relative to the eligible assets.\nThe Company intends to continue to conduct its business operations in order to continue to be excluded from the definition of an investment company under the 1940 Act.\nOur financial statements have been prepared assuming that the Company will continue as a going concern.\nOur financial statements have been prepared assuming that the Company will continue as a going concern. The Company has an accumulated deficit from inception through August 31, 2023, of approximately $42,344,000 and has yet to achieve profitable operations, and projects further losses in the development of its business. At August 31, 2023, the Company had a working capital surplus of approximately $1,025,000; however the Companys ability to continue as a going concern is dependent upon its ability to obtain the necessary financing to meet its obligations and pay its liabilities arising from normal business operations when they come due.\nIn accordance with our current projected Budget, the Company does not have sufficient capital to fund its (i) total cash calls expected during the fiscal year ending August 31, 2024 (currently anticipated to be between $3 million to $4 million) and (ii) expected general and administrative expenses during the fiscal year ending August 31, 2024 (anticipated to be at least $600,000). The Company expects to incur dilution to its Round Top membership interest rather than to fund in cash its Round Top cash calls during the fiscal year ending August 31, 2024. If the Company were to determine to fund the Round Top cash calls in cash (rather than to incur dilution to its membership interest), the Company would be required to raise additional capital to fund its obligations (pursuant to the Budget and to fund general and administrative expenses) during the fiscal year ending August 31, 2024. There can be no assurance that the Company will be able to raise the necessary capital to fund its cash calls and expected general and administrative expenses. We have no firm commitments for equity or debt financing and any financing that may be obtained will be on a best efforts basis. Based on these factors, there is substantial doubt as to the Companys ability to continue as a going concern for a period of twelve months from the issuance date of these financial statements. The failure to obtain sufficient financing may cause us to curtail or discontinue operations.\nLiquidity and Capital Resources\nAt August 31, 2023, our accumulated deficit was approximately $42,344,000 and our cash position was approximately $1,079,000. We had a working capital surplus of approximately $1,025,000. Round Top has not commenced commercial production on the Round Top Project. We have no revenues from operations and anticipate we will have no operating revenues until we place one or more of our properties into production, of which there can be no assurance. All properties are in the exploration stage.\nDuring the fiscal year ending August 31, 2023, we funded approximately $386,400 to Round Top pursuant to our funding obligations set forth in the Operating Agreement. In lieu of funding $448,800 of cash calls in June through August 2023, we incurred dilution in our membership interest from 20% to 19.874% at August 31, 2023.\nDuring the current fiscal year, USARE has advised us that Round Top is expected to fund expenditures of approximately $15 million to $20 million to optimize the leaching and developing of the CIX/CIC processing of the Round Top Project. Initial process design work will be carried out at USAREs facility in Wheat Ridge, Colorado. Pending completion of the initial process development, this facility will either be relocated to or replicated at USAREs Oklahoma facility where a pilot plant is expected to be established. It is estimated that the Round Top Project will require additional time and further expenditure to complete a bankable feasibility study. Our current expected funding obligation is projected to be between approximately $3 million to $4 million of the expected expenditures by Round Top during our current fiscal year, and we currently expect to incur dilution to our Round Top membership interest in lieu of funding the Round Top cash calls in cash. It is possible that the Round Top Budget could increase in this current fiscal year and it should be expected that the Round Top Budget will be higher in future periods. The failure of us to raise capital to fund our cash call commitments in this current fiscal year and thereafter will result in dilution of our Round Top membership interest, which could be significant. See Item 1, Business - USA Rare Earth Agreement for a discussion of the calculation of the dilution mechanics.\nWe do not have sufficient cash on hand to fund our portion of the Round Top Budget during our current fiscal year. Therefore, we will need to raise additional capital to fund our portion of the Round Top Budget if we elect not to dilute our Round Top membership interest. If we elect to dilute our Round Top membership interest (through choice or as a result of the failure to raise capital), such event will result in the dilution to our Round Top membership interest. The most likely source of future financing presently available to us is through the sale of our securities. Any sale of our shares of Common Stock will result in dilution of equity ownership to existing stockholders. This means that if we sell shares of Common Stock, more shares will be outstanding and each existing stockholder will own a smaller percentage of the shares then outstanding. Moreover, the actual or perceived sale of additional shares of our Common Stock to raise capital could further depress the price of our Common Stock which could adversely impact our ability to raise capital, result in more dilution to be incurred by existing stockholders, and possibly cause us to curtail or cease our operations. Alternatively, we may rely on debt financing and assume debt obligations that require us to make substantial interest and capital payments. Also, we may issue or grant warrants or options in the future pursuant to which additional shares of Common Stock may be issued. Exercise of such warrants or options will result in dilution of equity ownership to our existing stockholders. We have no firm commitment with respect to obtaining debt or equity financing and, accordingly, we will be reliant upon a best efforts financing strategy. Accordingly, there is no assurance that we will be able to raise necessary capital, if any, to fund our portion of the Round Top Budget and our general administrative expenses during the fiscal year ending August 31, 2024, the failure of which could ultimately cause us to curtail or cease our operations.\nResults of Operations\nFiscal Years ended August 31, 2023 and 2022\nGrant Income\nGrants received from government and other agencies in advance of a specific projects expenses are deferred and recognized as other income in the statements of operations in the period they are earned and the related project costs are incurred. For the years ended August 31, 2023 and 2022, we recognized $0 and $561,950, respectively, of grant income which is presented in other income net of grant related expenses totaling approximately $0 and $561,860, respectively.\nRevenue\nDuring the fiscal year ended August 31, 2023 and 2022, we had no revenues. For the fiscal year ended August 31, 2023, our net loss was approximately $2,592,000. We are not currently profitable. As a result of ongoing operating losses, we had an accumulated deficit of approximately $42,344,000 as of August 31, 2023.\nOperating expenses and resulting losses from operations.\nWe incurred exploration costs for the fiscal years ended August 31, 2023 and 2022, in the amount of approximately $782,000 and $1,535,000, respectively. Expenditures during fiscal year 2023 were primarily for our obligation to fund our portion of the cash requirements set forth by our joint venture agreement with USARE and for project contractors for our New Mexico mining exploration. Currently most of the expenditures associated with the USARE joint venture are funded by our joint venture partner, USARE.\nOur general and administrative expenses for the fiscal year ended August 31, 2023 were approximately $1,822,000 of which approximately $952,000 were stock compensation for services. The remaining expenditures were primarily for payroll, professional fees and other general administrative expenses necessary for our operations.\nOur general and administrative expenses for the fiscal year ended August 31, 2022 were approximately $1,376,000 of which approximately $503,000 were stock compensation for services. The remaining expenditures were primarily for payroll, professional fees and other general administrative expenses necessary for our operations.\nWe had losses from operations for the fiscal years ended August 31, 2023 and 2022 totaling approximately $2,604,000 and $2,911,000, respectively. We had a net loss for the fiscal year ended August 31, 2023 and 2022 totaling approximately $2,592,000 and $2,904,000, respectively. We earned interest from our cash balances of approximately $34,000 and $7,000 for the years ended August 31, 2023 and 2022, respectively.\nOff-Balance Sheet Arrangements\nNone\nRecently Issued Accounting Pronouncements\nThe Company does not expect the adoption of recently issued accounting pronouncements to have a significant impact on our results of operations, financial position, or cash flow.\nCritical Accounting Estimates\nManagements discussion and analysis of financial condition and results of operations is based on our financial statements, which have been prepared in accordance with U.S. GAAP. Preparation of financial statements requires management to make assumptions, estimates and judgments that affect the reported amounts of assets, liabilities, revenues, costs and expenses, and the related disclosures of contingencies. Management bases its estimates on various assumptions and historical experience, which are believed to be reasonable; however, due to the inherent nature of estimates, actual results may differ significantly due to changed conditions or assumptions. On a regular basis, management reviews the accounting policies, assumptions, estimates and judgments to ensure that our financial statements are fairly presented in accordance with U.S. GAAP. However, because future events and their effects cannot be determined with certainty, actual results could differ from our assumptions and estimates, and such differences could be material. Management believes that the following critical accounting estimates and judgments have a significant impact on our financial statements and valuation of options granted to directors and officers using the Black-Scholes model. The accounting policies are described in greater detail in Note 2 to our audited financial statements for the fiscal year ended August 31, 2023. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of\nTexas Mineral Resources Corp.\nSierra Blanca, Texas\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Texas Mineral Resources Corp. (the Company) as of August 31, 2023 and 2022, and the related consolidated statements of operations, shareholders equity, and cash flows for each of the years in the two-year period ended August 31, 2023, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2023 and 2022, and the results of its operations and its cash flows for each of the years in the two-year period ended August 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Companys inability to meet funding requirements for its interest in Round Top Mountain Development, LLC would result in dilution of its ownership interest. The Company has not generated any revenues and the Company does not have resources sufficient to meet the projected funding requirements. This raises substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters also are described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) represented especially challenging, subjective, or complex judgements. We determined that there are no critical audit matters.\n/s/ Ham, Langston & Brezina, L.L.P.\nWe have served as the Companys auditor since 2020.\nHouston, Texas\nNovember 29, 2023\nTEXAS MINERAL RESOURCES CORP.\nCONSOLIDATED BALANCE SHEETS\nAugust 31, 2023 and 2022\nASSETS\nCURRENT ASSETS\nCash and cash equivalents $ 1,079,307 $ 1,838,300\nShort-term investments - 505,611\nPrepaid expenses and other current assets 39,577 293,130\nTotal current assets 1,118,884 2,637,041\nProperty and equipment, net - 23,853\nMineral properties, net 415,607 415,607\nDeposit - 7,500\nTOTAL ASSETS $ 1,534,491 $ 3,084,001\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCURRENT LIABILITIES\nAccounts payable and accrued liabilities $ 93,406 $ 41,101\nTotal current liabilities 93,406 41,101\nCOMMITMENTS AND CONTINGENCIES\nSHAREHOLDERS' EQUITY\nPreferred stock, par value $0.001; 10,000,000 shares authorized, no shares issued and outstanding - -\nCommon stock, par value $0.01; 100,000,000 shares authorized, 73,728,263 and 72,869,220 shares issued and outstanding as of August 31, 2023 and 2022, respectively 737,283 728,692\nAdditional paid-in capital 43,047,824 42,066,269\nAccumulated deficit (42,344,022 ) (39,752,061 )\nTotal shareholders' equity 1,441,085 3,042,900\nTOTAL LIABILITIES AND SHAREHOLDERS' EQUITY $ 1,534,491 $ 3,084,001\nThe accompanying notes are an integral part of these consolidated financial statements.\nTEXAS MINERAL RESOURCES CORP.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended August 31, 2023 and 2022\nOPERATING EXPENSES\nExploration costs $ 781,547 $ 1,534,915\nGeneral and administrative 1,821,984 1,376,274\nTotal operating expenses 2,603,531 2,911,189\nLOSS FROM OPERATIONS (2,603,531 ) (2,911,189 )\nOTHER INCOME (EXPENSE), NET\nGain on sale of assets (22,689 ) -\nGrant income, net of related expenses -\nInterest and other income 34,259 7,357\nTotal other income, net 11,570 7,450\nNET LOSS $ (2,591,961 ) $ (2,903,739 )\nNet loss per common share\nBasic and diluted $ (0.04 ) $ (0.04 )\nWeighted average shares outstanding\nBasic and diluted 73,199,501 72,403,029\nThe accompanying notes are an integral part of these consolidated financial statements.\nTEXAS MINERAL RESOURCES CORP.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended August 31, 2023 and 2022\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss $ (2,591,961 ) $ (2,903,739 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation and amortization expense 1,164 6,981\nLoss on disposal of property and equipment 22,689 -\nStock based compensation 952,146 503,442\nChanges in operating assets and liabilities:\nPrepaid expenses and other assets 253,553 (220,101 )\nAccounts payable and accrued liabilities 52,305 (150,293 )\nAccounts payable - related parties - (10,000 )\nNet cash used in operating activities (1,310,104 ) (2,773,710 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nReturn of deposits 7,500 5,120\nPurchases of short-term investments - (505,611 )\nPurchases of mineral properties - (233,852 )\nProceeds from maturity of short-term investments 505,611 -\nNet cash provided by (used in) investing activities 513,111 (734,343 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from exercise of common stock options and warrants 38,000 239,700\nNet cash provided by financing activities 38,000 239,700\nNET CHANGE IN CASH AND CASH EQUIVALENTS (758,993 ) (3,268,353 )\nCASH AND CASH EQUIVALENTS AT BEGINNING OF PERIOD 1,838,300 5,106,653\nCASH AND CASH EQUIVALENTS AT END OF PERIOD $ 1,079,307 $ 1,838,300\nSUPPLEMENTAL DISCLOSURE OF CASH FLOWS INFORMATION:\nCash paid for interest expense $ - $ -\nCash paid for income taxes $ - $ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nTEXAS MINERAL RESOURCES CORP.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS' EQUITY\nFor the Years Ended August 31, 2023 and 2022\nPreferred Stock Common Stock Additional\nPaid-in Accumulated\nShares Amount Shares Amount Capital Deficit Total\nBalance at August 31, 2021 - $ - 71,934,065 $ 719,341 $ 41,332,478 $ (36,848,322 ) $ 5,203,497\nStock based compensation - - 131,825 1,318 176,689 - 178,007\nCommon stock options and warrants Issued for services - - - - 325,435 - 325,435\nCommon stock issued upon exercise of options and warrants - - 726,000 7,260 232,440 - 239,700\nCommon stock issued upon cashless exercise of options and warrants - - 77,330 (773 ) - -\nNet loss - - - - - (2,903,739 ) (2,903,739 )\nBalance at August 31, 2022 - - 72,869,220 728,692 42,066,269 (39,752,061 ) 3,042,900\nStock based compensation - - 136,544 1,366 166,304 - 167,670\nCommon stock issued for prior services rendered - - 612,498 6,125 (6,125 ) - -\nCommon stock options issued for services - - - - 784,476 - 784,476\nCommon stock issued upon exercise of options and warrants - - 110,000 1,100 36,900 - 38,000\nNet loss - - - - - (2,591,961 ) (2,591,961 )\nBalance at August 31, 2023 - $ - 73,728,262 $ 737,283 $ 43,047,824 $ (42,344,022 ) $ 1,441,085\nThe accompanying notes are an integral part of these consolidated financial statements.\nTEXAS MINERAL RESOURCES CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAUGUST 31, 2023 AND 2022\nNOTE 1 - ORGANIZATION AND NATURE OF BUSINESS\nTexas Mineral Resources Corp. (the Company) was incorporated in the State of Nevada in 1970 as Standard Silver Corporation. In 2010, the Company changed its name from Standard Silver Corporation to Texas Rare Earth Resources Corp. In 2012, the Company changed its state of incorporation from Nevada to Delaware under a plan of conversion dated August 24, 2012. In 2016, the Company changed its name to Texas Mineral Resources Corp.\nWe are a mining company engaged in the business of the acquisition, exploration and development of mineral properties. At August 31, 2023, we owned a 19.874% membership interest in Round Top Mountain Development, LLC, a Delaware limited liability company (Round Top or RTMD), which entity holds two mineral property leases with the GLO to explore and develop a 950-acre rare earths project located in Hudspeth County, Texas, known as the Round Top Project. The leases expire in 2030. Round Top also holds prospecting permits covering 9,345 acres adjacent to the Round Top Project. The business strategy of Round Top is to develop a metallurgical process to concentrate or otherwise extract the metals from the Round Top Projects rhyolite, conduct additional engineering, design, geotechnical work, and permitting necessary for a bankable feasibility study and then to extract mineral resources from the Round Top Project. The Round Top Project has not established as of the date hereof that any of the properties contain any probable mineral reserves or proven mineral reserves under Item 1300 of Regulation S-K (Item 1300).\nNOTE 2 - SUMMARY OF ACCOUNTING POLICIES\nExploration-Stage Company\nSince January 1, 2009, the Company has been classified as an exploration stage company for purposes of Item 1300 of the U.S. Securities and Exchange Commission (SEC). Under Item 1300, companies engaged in significant mining operations are classified into three categories, referred to as stages - exploration, development, and production. Exploration stage includes all companies that do not have established reserves in accordance with Item 1300. Such companies are deemed to be in the search for mineral deposits. Notwithstanding the nature and extent of development-type or production-type activities that have been undertaken or completed, a company cannot be classified as a development or production stage company unless it has established reserves in accordance with Item 1300.\nBasis of Presentation\nThe Companys financial records are maintained on the accrual basis of accounting in accordance with accounting principles generally accepted in the United States of America (US GAAP).\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of Texas Mineral Resources Corp and its proportionate interest in the assets, liabilities, and operations of Round Top. All significant intercompany balances and transactions have been eliminated.\nGoing Concern\nThese financial statements have been prepared assuming that the Company will continue as a going concern. The Company has an accumulated deficit from inception through August 31, 2023, of approximately $42,344,000 and has yet to achieve profitable operations, and projects further losses in the development of its business.\nAt August 31, 2023, the Company had a working capital surplus of approximately $1,025,000, however the Companys ability to continue as a going concern is dependent upon its ability to generate profitable operations in the future and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. These financial statements do not include any adjustments to the amounts and classifications of assets and liabilities that may be necessary should we be unable to continue as a going concern.\nNOTE 2 - SUMMARY OF ACCOUNTING POLICIES (CONTINUED)\nIn accordance with our current projected budget, the Company does not have sufficient capital to fund its total cash calls and expected general and administrative expenses during the fiscal year ending August 31, 2024. Failure by the Company to make required cash calls to Round Top during the 12 months from the issuance date of these financial statements would result in dilution to its membership interest in Round Top, which is 19.874% at August 31, 2023. Accordingly, the Company may be required to raise additional capital to fund its obligations during the fiscal year ended August 31, 2024. There can be no assurance that the Company will be able to raise the necessary capital to fund its cash calls and expected general and administrative expenses. The Company may also seek to obtain short-term loans from the directors of the Company. Based on these factors, there is substantial doubt as to the Companys ability to continue as a going concern for a period of twelve months from the issuance date of these financial statements.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents. Cash and cash equivalents currently consist only of demand deposits at commercial banks. The Company maintains cash and cash equivalents at banks selected by management based upon their assessment of the financial stability of the institution. Balances periodically exceed the federal depository insurance limit; however, the Company has not experienced any losses on deposits.\nShort-term investments\nShort-term investments consists of certificates of deposit and similar time-based deposits with financial institutions with original maturity dates over three months and up to twelve months. The carrying value approximates fair value due to the short duration of the instrument.\nProperty and Equipment\nProperty and equipment consist primarily of vehicles, furniture and equipment, and are recorded at cost. Expenditures related to acquiring or extending the useful life of property and equipment are capitalized. Expenditures for repair and maintenance are charged to operations as incurred. Depreciation is computed using the straight-line method over an estimated useful life of 3-20 years.\nLease Deposits\nFrom time to time, the Company makes deposits in anticipation of executing leases. The deposits are capitalized upon execution of the applicable agreements.\nLong-lived Assets\nThe Company reviews the recoverability of long-lived assets whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable through operations. To determine if these costs are in excess of their recoverable amount, periodic evaluation of carrying value of capitalized costs and any related property and equipment costs are based upon expected future cash flows and/or estimated salvage value in accordance with Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC 360), Property, Plant and Equipment. The Companys assets susceptible to impairment analysis are the mineral properties described in Note 5.\nMineral Exploration and Development Costs\nAll exploration expenditures are expensed as incurred. Costs of acquisition and option costs of mineral rights are capitalized upon acquisition. Costs incurred to maintain current production or to maintain assets on a standby basis are charged to operations. If the Company does not continue with exploration after the completion of the feasibility study, the mineral rights will be expensed at that time. Costs of abandoned projects are charged to mining costs including related property and equipment costs. To determine if these costs are in excess of their recoverable amount, periodic evaluation of carrying value of capitalized costs and any related property and equipment costs are based upon expected future cash flows and/or estimated salvage value in accordance with ASC 360-10-35-15, Impairment or Disposal of Long-Lived Assets.\nNOTE 2 - SUMMARY OF ACCOUNTING POLICIES (CONTINUED)\nShare-based Payments\nThe Company estimates the fair value of share-based compensation on the date of grant using the Black-Scholes valuation model, in accordance with the provisions of ASC 718, Stock Compensation. Key inputs and assumptions used to estimate the fair value of stock options include the exercise price of the award, the expected option term, market price of the underlying common stock, volatility of the common stock, risk-free rate, and dividend yield. Estimates of fair value are not intended to predict actual future events or the value ultimately realized by the option holders, and subsequent events are not indicative of the reasonableness of the original estimates of fair value.\nIncome Taxes\nIncome taxes are computed using the asset and liability method, in accordance with ASC 740, Income Taxes. Under the asset and liability method, deferred income tax assets and liabilities are determined based on the differences between the financial reporting and tax basis of assets and liabilities and are measured using the currently enacted tax rates and laws. A valuation allowance is provided for the amount of deferred tax assets that, based on available evidence, are not expected to be realized.\nThe Company recognizes and measures a tax benefit from uncertain tax positions when it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The Company recognizes a liability for unrecognized tax benefits resulting from uncertain tax positions taken or expected to be taken in a tax return. The Company adjusts these liabilities when its judgement changes as a result of the evaluation of new information not previously available. Due to the complexity of some of these uncertainties, the ultimate resolution may result in a payment that is materially different from the current estimate or future recognition of an unrecognized tax benefit. These differences will be reflected as increases or decreases to income tax expense in the period in which they are determined. The Company recognizes interest and penalties related to unrecognized tax positions within the income tax expense line in the statements of operations. Management believes the Company has no uncertain tax positions at August 31, 2023 and 2022.\nBasic and Diluted Income (Loss) Per Share\nThe Company computes income (loss) per share in accordance with ASC 260, Earnings Per Share, which requires presentation of both basic and diluted earnings per share on the face of the Statements of Operations. Basic income (loss) per share is computed by dividing net income (loss) available to common shareholders by the weighted average number of outstanding common shares during the period. Diluted income (loss) per share gives effect to all dilutive potential common shares outstanding during the period, including stock options and warrants using the treasury method. Dilutive income (loss) per share excludes all potential common shares if their effect is anti-dilutive.\nAt August 31, 2023, options to purchase 1,030,000 shares of common stock were outstanding but not included in the computation of dilutive earnings per share because these options were antidilutive.\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nNOTE 2 - SUMMARY OF ACCOUNTING POLICIES (CONTINUED)\nFair Value Measurements\nThe Company accounts for assets and liabilities measured at fair value in accordance with ASC 820, Fair Value Measurements and Disclosures. ASC 820 emphasizes that fair value is a market-based measurement, not an entity-specific measurement. Therefore, a fair value measurement should be determined based on the assumptions that market participants would use in pricing the asset or liability. As a basis for considering market participant assumptions in fair value measurements, ASC 820 establishes a fair value hierarchy that distinguishes between market participant assumptions based on market data obtained from sources independent of the reporting entity (observable inputs that are classified with Levels 1 and 2 of the hierarchy) and the reporting entitys own assumptions about market participant assumptions (unobservable inputs classified within Level 3 of the hierarchy).The three levels of inputs used to measure fair value are as follows:\n● Level 1: Observable inputs that reflect unadjusted quoted prices for identical assets or liabilities traded in active markets.\n● Level 2: Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly.\n● Level 3: Inputs that are generally unobservable. These inputs may be used with internally developed methodologies that result in managements best estimate of fair value.\nThe Companys financial instruments consist principally of cash, short-term investments and accounts payable and accrued liabilities. The carrying amounts of such financial instruments in the accompanying financial statements approximate their fair values due to their relatively short-term nature. It is managements opinion that the Company is not exposed to any significant currency or credit risks arising from these financial instruments.\nNOTE 3 - JOINT VENTURE ARRANGEMENTS\nIn August 2018, the Company and Morzev Pty. Ltd. (Morzev) entered into an agreement (the 2018 Option Agreement) whereby Morzev was granted the exclusive right to earn and acquire a 70% interest in the Round Top Project by financing $10 million of expenditures in connection with the Round Top Project, increasable to an 80% interest, for an additional $3 million payment to the Company. Morzev began engaging in business as USA Rare Earth and in May 2019 notified the Company that it was nominating USA Rare Earth, LLC (USARE) as the optionee under the terms of the 2018 Option Agreement. In August 2019, the Company and USARE entered into an amended and restated option agreement as further amended on June 29, 2020 (the 2019 Option Agreement and collectively with the 2018 Option Agreement, the Option Agreement), whereby the Company restated its agreement to grant USARE the exclusive right to earn and acquire a 70% interest, increasable to an 80% interest, in the Round Top Project.\nIn May 2021, and in accordance with the terms of the Option Agreement, the Company and USARE entered into a contribution agreement (Contribution Agreement) whereby the Company and USARE contributed assets to Round Top, at the time a wholly-owned subsidiary of the Company, in exchange for their initial ownership interests in Round Top, of which the Company initially owned a membership interest equating to 20% of Round Top and USARE initially owned a membership interest equating to 80% of Round Top. Concurrently therewith, the Company and USARE as the two members entered into a limited liability company agreement (Operating Agreement) governing the operations of Round Top which contains customary and industry standard terms as contemplated by the Option Agreement. USARE serves as manager of Round Top.\nUpon entry into the Contribution Agreement, the Company assigned the following contracts and assets to Round Top in exchange for its initial 20% membership interest in Round Top:\nNOTE 3 - JOINT VENTURE ARRANGEMENTS (CONTINUED)\n● the assignment and assumption agreement with respect to the mineral leases from the Company to Round Top;\n● the assignment and assumption agreement with respect to the surface lease from the Company to Round Top;\n● the assignment and assumption agreement with respect to the surface purchase option from the Company to Round Top;\n● the assignment and assumption agreement with respect to the water lease from the Company to Round Top; and\n● the bill of sale and assignment agreement of existing data and other relevant contracts and permits with respect to Round Top owned by the Company.\nand USARE assigned the following assets to Round Top (or the Company, as applicable) for its initial 80% membership interest in Round Top:\n● cash to Round Top to continue to fund Round Top operations in the amount of approximately $3,761,750 comprising the balance of the $10 million required expenditure to earn a 70% interest in Round Top;\n● cash in the amount of $3 million to the Company upon exercise of the USARE option to acquire from the Company an additional 10% interest in Round Top, resulting in the aggregate ownership interest of 80% in Round Top;\n● bill of sale and assignment agreement of the Pilot Plant and other relevant contracts and permits to Round Top; and\n● bill of sale and assignment agreement of existing data and intellectual property owned by USARE to Round Top.\nOn June 26, 2023, the Company, USARE and the manager amended and restated the Operating Agreement and the following material amendments to the Operating Agreement were adopted:\nCash Calls\nOn the basis of the adopted program and budget then in effect, the manager will submit to each member monthly cash calls at least 10 days before the last day of each month, and within 10 days of receipt, (a) USARE will pay to RTMD, as an additional capital contribution, its proportionate share of the estimated cash requirements based on its interest and (b) the Company will either (i) pay to RTMD, as an additional capital contribution, its proportionate share of the estimated cash requirements based on its interest, or (ii) deliver to RTMD a written notice indicating what amount, if any, of the applicable estimated cash requirements that the Company will contribute (the Notice of Non-Contribution). Failure by the Company to deliver payment of its proportionate share of the estimated cash requirements, as an additional capital contribution, or to deliver a Notice of Non-Contribution within the 10 day period shall automatically be considered a Deemed Non-Contribution and shall have the same effect as if the Company provided a timely Notice of Non-Contribution with respect to non-contribution of its entire proportionate share of the applicable cash call.\nRemedies for Failure to Meet Cash Calls\nNon-Contribution. Capital contributions only will be made to fund programs and budgets. If the Company does not contribute all or any portion of any additional capital contribution that it is required to contribute pursuant to a Notice of Non-Contribution or a Deemed Non-Contribution (such unfunded amount shall be deemed the Shortfall Amount), then USARE shall fund the entire Shortfall Amount within 5 business days after the Notice of Non-Contribution or Deemed Non-Contribution.\nNOTE 3 - JOINT VENTURE ARRANGEMENTS (CONTINUED)\nDilution. Upon the contribution of the Shortfall Amount by USARE, the interests of the members will be recalculated based on the adjustment provision set forth below in the sub-heading - Adjustment of Interests.\nMaximum Dilution. The dilution of the Company shall not fall below a 3% interest in RTMD (the Minimum Percentage Interest). Upon the contribution by USARE of a Shortfall Amount which otherwise would result in a dilution of the Company below the Minimum Percentage Interest, USARE will receive a priority distribution of available cash, in addition to a distribution of available cash to which USARE otherwise is entitled to receive as a result of its proportionate additional capital contribution pursuant to the applicable cash call request, up to the Shortfall Amount that would have resulted in the Companys interest being further diluted but for the Minimum Percentage Interest (the Priority Distribution). The Priority Distribution will continue until USARE has been reimbursed for its contribution of the Shortfall Amount that would have resulted in the Company having an interest below the Minimum Percentage Interest, after which time the members shall receive distributions of available cash pro rata in proportion to their respective interests.\nAdjustment of Interests. If USARE contributes the Shortfall Amount, then the then current interest of the Company will be reduced (subject to the Minimum Percentage Interest), effective as of each cash call under an additional capital contribution for the applicable program and budget, by a fraction, expressed as a percentage:\n● the numerator of which equals the Shortfall Amount actually funded by USARE; and\n● the denominator of which equals the market capitalization of the Company.\nDistributions\nCash in excess of authorized reserves will be distributed to the members pro-rata in proportion to their respective interests on a periodic basis as determined by the management committee. RTMD will be required to make tax distributions to each member. Once USARE has been paid the Priority Distribution, if applicable, all distributions made in connection with the sale or exchange of all or substantially all of RTMDs assets and all distributions made in connection with the liquidation of RTMD will be made to the members pro-rata in accordance with their respective interests.\nOther material terms of the Operating Agreement that remain unchanged are as follows:\nManagement\nA management committee will make the major decisions of RTMD, such as approval of the respective program and budget, and the manager will implement such decisions. The management committee consists of three representatives of the members, with two being appointed by USARE and one by the Company which is Dan Gorski. The representatives vote the ownership percentage interests of their appointing member.\nManagement Committee Meetings\nMeetings will be held every three months unless otherwise agreed. For matters before the management committee that require a vote, oting is by simple majority except for certain major decisions that require a unanimous vote. So long as the Company maintains a 15% or greater ownership interest, the nine decisions identified in the bullet points below require unanimous approval. If the Companys ownership interest falls below 15%, the number of unanimous decisions is reduced to five (being the first five bullet points below). If the Company is acquired by a REE mining company or sells its ownership interest to a REE mining company, in each case who elects a majority of the Companys board, this unanimous approval requirement can be suspended by USARE, at its option. The major decisions requiring unanimous approval, as set forth above, are:\nNOTE 3 - JOINT VENTURE ARRANGEMENTS (CONTINUED)\n● approval of an amendment to any program and budget that causes the program and budget to increase by 15% or more, except for emergencies;\n● other than purchase money security interests or other security interests in RTMD equipment to finance the acquisition or lease of RTMD equipment used in operations, the consummation of a project financing or the incurrence by RTMD of any indebtedness for borrowed money that requires the guarantee by any member of any obligations of RTMD;\n● substitution of a member under certain circumstances and dissolution of RTMD;\n● the issuance of an ownership interest or other equity interest in RTMD, or the admission of any person as a new member of RTMD, other than in connection with the exercise of a right of first offer by a member;\n● the redemption of all or any portion of an ownership interest, except for limited circumstances provided for in the Operating Agreement;\n● a decision to grant authorization for RTMD to file a petition for relief under any chapter of the United States Bankruptcy Code, to consent to such relief in any involuntary petition filed against RTMD by any third party, or to admit in writing any insolvency of RTMD or inability to pay its debts as they become due, or to consent to any receivership of RTMD;\n● acquisition or disposition of significant mineral rights, other real property or water rights outside of the area of interest as set forth in the Operating Agreement or outside of the ordinary course of business;\n● the merger of RTMD into or with any other entity; and\n● the sale of all or substantially all of RTMDs assets.\nManager\nThe manager will manage, direct and control operations in accordance with program and budget, will prepare and present to the management committee a proposed program and budget, and will generally oversee and implement all of the day to day activities of RTMD. The manager will conduct necessary equipment and materials procurement and property and equipment maintenance activities, with all operations to be conducted in accordance with adopted program and budget.\nThe Company accounts for its interest in Round Top using the proportionate consolidation method, which is an exception available to entities in the extractive industries, thereby recognizing its pro-rate share of the assets, liabilities, and operations of Round Top in the appropriate classifications in the financial statements.\nNOTE 4 - PROPERTY AND EQUIPMENT, NET\nProperty and equipment consist of office furniture, equipment and vehicles. Property and equipment are depreciated using the straight-line method over their estimated useful life of 3-20 years. Following is an analysis of property and equipment at August 31, 2023 and 2022:\nSchedule of property and equipment\nFurniture and office equipment $ - $ 75,606\nVehicles - 124,092\nComputers and software - 48,711\nField equipment - 71,396\nTotal cost basis - 319,805\nLess: accumulated depreciation - (295,951 )\nProperty and equipment, net $ - $ 23,853\nNOTE 4 - PROPERTY AND EQUIPMENT, NET (CONTINUED)\nDepreciation expense for the years ending August 31, 2023 and 2022 was $1,164 and $6,981, respectively.\nNOTE 5 - MINERAL PROPERTIES\nAs further discussed in Note 3, Joint Venture Arrangements, in May 2021, the Company assigned all rights and obligations related to the Round Top Project to Round Top in exchange for a 20% interest. The following discussion of the August 2010 Lease, November 2011 Lease, March 2013 Lease, and October 2014 Surface Option and Water Lease pertain to the Round Top Project and were assigned to Round Top in May 2021.\nAugust 2010 Lease\nOn August 17, 2010, the Company executed a new mining lease with the Texas General Land Office covering Sections 7 and 18 of Township 7, Block 71 and Section 12 of Block 72, covering approximately 860 acres at Round Top Mountain in Hudspeth County, Texas. The mining lease issued by the Texas General Land Office provides for the right to explore, produce, develop, mine, extract, mill, remove, and market rare earth elements, all other base and precious metals, industrial minerals and construction materials and all other minerals excluding oil, gas, coal, lignite, sulfur, salt, and potash. The term of the lease is nineteen years so long as minerals are produced in paying quantities.\nUnder the terms of the lease, Round Top is obligated to pay the State of Texas a total lease bonus of $142,518. The Company paid $44,718 upon the execution of the lease, and Round Top will be required to pay the remaining $97,800 upon submission of a supplemental plan of operations to conduct mining. Upon the sale of any minerals removed from the Round Top Project, Round Top will pay the State of Texas a $500,000 minimum advance royalty. Thereafter, if paying quantities of minerals are obtained, Round Top will be required to pay the State of Texas a production royalty equal to eight percent of the market value of uranium and other fissionable materials removed and sold from the Round Top Project and six and one quarter percent of the market value of all other minerals removed and sold. If paying quantities have not been obtained, Round Top may pay additional delay rental fees to extend the term of the lease for successive one (1) year periods pursuant to the following schedule:\nSchedule of August 2010 Lease\nPer Acre\nAmount Total\nAmount\nSeptember 2, 2020 - 2024 $ 150 $ 134,155\nSeptember 2, 2025 - 2029 178,873\nIn August 2023, Round Top paid the State of Texas a delay rental to extend the term of the lease in an amount equal to $134,155.\nNovember 2011 Lease\nOn November 1, 2011, the Company executed a mining lease with the State of Texas covering approximately 90 acres of land that is adjacent to the August 2010 Lease. Under the lease, the Company paid the State of Texas a lease bonus of $20,700 upon the execution of the lease. Upon the sale of minerals removed from the Round Top Project, Round Top will be required to pay the State of Texas a $50,000 minimum advance royalty. Thereafter, if paying quantities of minerals are obtained, Round Top will be required to pay the State of Texas a production royalty equal to eight percent of the market value of uranium and other fissionable materials removed and sold from the Round Top Project and six and one quarter percent of the market value of all other minerals. If paying quantities have not been obtained, Round Top may pay additional delay rental fees to extend the term of the lease for successive one (1) year periods pursuant to the following schedule:\nNOTE 5 - MINERAL PROPERTIES (CONTINUED)\nSchedule of November 2011 Lease\nPer Acre\nAmount Total\nAmount\nNovember 1, 2020 - 2024 $ 150 $ 13,500\nNovember 1, 2025 - 2029 18,000\nIn August 2023, Round Top paid the State of Texas a delay rental to extend the term of the lease in an amount equal to $13,500.\nMarch 2013 Lease\nOn March 6, 2013, the Company purchased the surface lease at the Round Top Project, known as the West Lease, from the Southwest Wildlife and Range Foundation (since renamed the Rio Grande Foundation) for $500,000 cash and 1,063,830 shares of common stock valued at $500,000. The Company also agreed to support the Foundation through an annual payment of $45,000 for ten years to support conservation efforts within the Rio Grande Basin. The West Lease comprises approximately 54,990 acres. The purchase of the surface lease provides unrestricted surface access for the potential development and mining of the Round Top Project.\nOctober 2014 Surface Option and Water Lease\nOn October 29, 2014, the Company announced the execution of agreements with the Texas General Land Office securing the option to purchase the surface rights covering the potential Round Top project mine and plant areas and, separately, a groundwater lease. The option to purchase the surface rights covers approximately 5,670 acres over the mining lease. Round Top may exercise the option for all or part of the option acreage at any time during the sixteen-year primary term of the mineral lease. The option can be maintained through annual payments of $10,000. The purchase price will be the appraised value of the surface at the time of option exercise. All annual payments have been made as of the date of this filing.\nThe ground water lease secures the right to develop the ground water within a 13,120-acre lease area located approximately 4 miles from the Round Top deposit. The lease terms include an annual minimum production payment of $5,000 prior to production of water for the operation. After initiation of production Round Top will pay $0.95 per thousand gallons or $20,000 annually, whichever is greater. This lease remains in effect so long as the mineral lease is in effect.\nSanta Fe Gold Corporation/Alhambra Project\nIn November 2021, the Company entered into a mineral exploration and option agreement with Santa Fe Gold Corporation (Santa Fe). Under the option agreement, the Company and Santa Fe plan to pursue, negotiate and subsequently enter into a joint venture agreement to jointly explore and develop a target silver property to be selected by the Company among patented and unpatented mining claims held by Santa Fe within the Black Hawk Mining District in Grant County, New Mexico. Completion of a joint venture agreement, if any, is subject to the successful outcome of a multi-phase exploration plan leading to a bankable feasibility study to be undertaken in the near future by the Company. Under the contemplated terms of the proposed joint venture agreement, the Company would be project operator and initially own 50.5% of the joint venture while Santa Fe would initially own 49.5%. Additional terms of the joint venture are expected to be negotiated between the Company and Santa Fe in the future.\nUnder the terms of the option agreement, the Company plans to conduct a district-wide evaluation among the patented and unpatented claims held by Santa Fe, consisting of geologic mapping, sampling, trenching, radiometric surveying, geophysics, drilling and/or other methods as warranted. Based on the district-wide evaluation, the Company will designate one 80-acre tract as the project area and commence detailed exploration work. The property covered in the option agreement is approximately 1,300 acres and covers approximately 75% of the known mining district. The area to be studied also includes a two-mile radius area of interest. The option agreement provides the Company with the right to designate any properties within the area of interest as project area properties.\nThe term of the option is for so long as the Company continues to conduct exploration activities in the Project Area and can be exercised on 60 days notice to Santa Fe.\nNOTE 6 - INCOME TAXES\nThe following table sets forth a reconciliation of the federal income tax benefit to the United States federal statutory rate of 21% for the years ended August 31, 2023 and 2022:\nSchedule of effective income tax rate reconciliation\nIncome tax benefit at 21% statutory rate $ 544,311 $ 609,785\nStock-based compensation (199,950 ) (105,723 )\n(Increase) decrease in valuation allowance (344,361 ) (504,062 )\n$ - $ -\nThe tax effects of the temporary differences between reportable financial statement income and taxable income are recognized as a deferred tax asset and liability. Significant components of the deferred tax assets are set out below along with a valuation allowance to reduce the net deferred tax asset to zero.\nManagement has established a valuation allowance because, based on an analysis of the tax benefits underlying deferred tax assets, it is unable to establish that it is more-likely-than-not that a tax benefit will be realized. Significant components of deferred tax asset at August 31, 2023 and 2022 are as follows:\nSchedule of deferred tax assets and liabilities\nNet operating loss carryforward $ 4,702,990 $ 4,522,754\nDifference in property and equipment basis 961,015 796,890\nLess valuation allowance (5,664,005 ) (5,319,644 )\nNet deferred tax asset $ - $ -\nAs a result of a change in control effective in April 2007, net operating losses prior to that date may be partially or entirely unavailable under tax law, to offset future income and; accordingly, these net operating losses are excluded from deferred tax assets.\nThe net operating loss carryforward in the approximate amount of $22,395,000 began to expire in 2022. The Company files income tax returns in the United States and in one state jurisdiction. With few exceptions, the Company is no longer subject to United States federal income tax examinations for fiscal years ending before 2021 and no longer subject to state tax examinations for years before 2020.\nNOTE 7 - SHAREHOLDERS EQUITY\nThe Companys authorized capital stock consists of 100,000,000 shares of common stock, with a par value of $0.01 per share, and 10,000,000 preferred shares with a par value of $0.001 per share.\nAll shares of common stock have equal voting rights and, when validly issued and outstanding, are entitled to one non-cumulative vote per share in all matters to be voted upon by shareholders. Shares of common stock have no pre-emptive, subscription, conversion or redemption rights and may be issued only as fully paid and non-assessable shares. Holders of common stock are entitled to equal ratable rights to dividends and distributions with respect to the common stock, as may be declared by the Companys Board of Directors (the Board) out of funds legally available. In the event of a liquidation, dissolution or winding up of the affairs of the Company, the holders of common stock are entitled to share ratably in all assets remaining available for distribution to them after payment or provision for all liabilities and any preferential liquidation rights of any preferred stock then outstanding.\nNOTE 7 - SHAREHOLDERS EQUITY (CONTINUED)\nFollowing is an analysis of common stock issuances during the years ended August 31, 2023 and 2022:\nIssuances during the fiscal year ended August 31, 2023\nIn October 2022, we issued 26,833 shares of common stock related to director fees earned and expensed during the year ended August 31, 2022.\nDuring the year ended August 31, 2023, the Company issued 109,711 shares of common stock valued at a market value of $128,167, as payment for director fees. In addition, the Company recognized stock compensation and a corresponding charge to additional paid-in capital in the amount of $39,503 for directors fees earned during the quarter ended August 31, 2023. The Company issued the related 56,547 shares of common stock in October 2023.\nIn January 2020, the Company entered into three separate consulting agreements for total consideration of 699,999 shares of common stock (233,333 per agreement). The common stock underlying the agreements had a total market value of $448,000, based on the $0.64 quoted market price per share of the common stock on the agreement date. The right to receive the common stock is subject to ratable vesting over a 24-month period and at August 31, 2022, all 699,999 shares had vested and 87,501 shares had been issued. The Company recognized $0 and $74,667 of compensation expense under these consulting agreements during the years ended August 31, 2023 and 2022, respectively. The consultants had requested that the Company hold the remaining shares issuable under the agreements in trust to allow the consultants to request their shares as they vest. During the year ended August 31, 2023, the Company issued the remaining 612,498 shares under the agreement.\nDuring the year ended August 31, 2023, the holders of 110,000 common stock options were exercised for total cash consideration of $38,000. The exercise price of the common stock options ranged from $0.22 to $0.45 per share.\nIssuance during the fiscal year ended August 31, 2022\nIn October 2021, the Company issued 41,231 shares of common stock related to Director fees earned and expensed during the year ended August 31, 2021.\nDuring the year ended August 31, 2022, the Company issued 90,594 shares of common stock at a market value of $136,505, as payment for director fees. In addition, the Company recognized stock compensation and a corresponding charge to additional paid-in capital in the amount of $41,502 for directors fees earned during the quarter ended August 31, 2022. The Company issued the related 26,833 shares of common stock in October 2022.\nDuring the year ended August 31, 2022, the holders of 720,000 common stock options and 6,000 common stock warrants exercised the related instruments for total cash consideration of $239,700. The exercise price of the common stock options ranged from $0.30 to $0.45 per share and the exercise price of the common stock warrants were $0.20 per share.\nDuring the year ended August 31, 2022, a total of 100,000 common stock options were exercised on a cashless basis into 77,330 shares of common stock. The common stock options had an exercise price of $0.45 per share.\nNOTE 7 - SHAREHOLDERS EQUITY (CONTINUED)\nOptions\nThe following table sets forth certain information as of August 31, 2023 and 2022 concerning common stock that may be issued upon the exercise of options issued under the Amended 2008 Plan and outside of the Amended 2008 Plan (all options are fully vested and exercisable at August 31, 2023 and 2022):\nSchedule of options\nShares Weighted\nAverage\nExercise\nPrice\nWeighted\nAverage\nRemaining\nContractual\nLife\n(In Years)\nAggregate\nIntrinsic\nValue\nOutstanding, vested and exercisable at August 31, 2021 1,477,500 $ 0.40 2.68 $ 1,523,430\nOptions granted 120,000 0.30 - -\nOptions exercised (820,000 ) 0.35 - -\nOptions cancelled/forfeited/expired (257,500 ) 0.45 - -\nOutstanding, vested and exercisable at August 31, 2022 520,000 0.31 2.79 693,300\nOptions granted 620,000 1.11 - -\nOptions exercised (110,000 ) 0.35 - -\nOptions cancelled forfeited/expired - - - -\nOptions vested and exercisable at August 31, 2023 1,030,000 $ 0.80 4.37 $ 784,476\nIn September 2008, the Board adopted the 2008 Stock Option Plan (the 2008 Plan), which was approved by the Companys shareholders and provided 2,000,000 shares available for grant. In 2011, 2012, and 2016, the Board adopted amendments to the 2008 Plan, approved by the shareholders, that increased the shares available for issuance under the 2008 Plan by a total of 7,000,000 shares (as amended, the Amended 2008 Plan). No further derivative securities are eligible to be issued pursuant to the Amended 2008 Plan.\nDuring the year ended August 31, 2023, the Company granted a total of 120,000 non-qualified, non-plan stock options, with a fair value of $146,928 on the date of grant, to a consultant. The fair value of the options was determined using the Black-Scholes option-pricing model. The weighted average assumptions used to calculate the fair market value are as follows: (i) risk-free interest rate of 4.00%, (ii) estimated volatility of 202% (iii) dividend yield of 0.00% and (iv) expected life of all options of 5 years. The Company recognized the full $146,928 as compensation expense during the year ended August 31, 2023.\nDuring the year ended August 31, 2023, the Company granted a total of 500,000 non-qualified, non-plan stock options, with a fair value of $637,548 on the date of grant, to Mr. Marchese for services rendered as chairman of the board of directors. The fair value of the options was determined using the Black-Scholes option-pricing model. The weighted average assumptions used to calculate the fair market value are as follows: (i) risk-free interest rate of 5.00%, (ii) estimated volatility of 194% (iii) dividend yield of 0.00% and (iv) expected life of all options of 5 years. The Company recognized the full $637,548 as compensation expense during the year ended August 31, 2023.\nDuring the year ended August 31, 2022, the Company granted a total of 120,000 non-qualified, non-plan stock options, with a fair value of $250,768 on the date of grant, to a consultant. The fair value of the options was determined using the Black-Scholes option-pricing model. The weighted average assumptions used to calculate the fair market value are as follows: (i) risk-free interest rate between 0.25% and 2.33% (ii) estimated volatility between 197% and 202% (iii) dividend yield of 0.00% and (iv) expected life of all options of 5 years. The Company recognized the full $250,768 as compensation expense during the year ended August 31, 2022.\nNOTE 7 - SHAREHOLDERS EQUITY (CONTINUED)\nWarrants\nWarrant activity for the years ended August 31, 2023 and 2022 was as follows:\nSchedule of warrants\nShares Weighted\nAverage\nExercise\nPrice\nWeighted\nAverage\nRemaining\nContractual\nLife\n(In Years)\nAggregate\nIntrinsic\nValue\nOutstanding and exercisable at August 31, 2021 34,000 $ 0.10 1.2 $ 45,660\nWarrants granted - - - -\nWarrants exercised (6,000 ) 0.20 - -\nWarrants cancelled/forfeited/expired (16,000 ) 0.10 - -\nOutstanding and exercisable at August 31, 2022 12,000 0.04 1.0 23,780\nWarrants granted - - - -\nWarrants exercised - - - -\nWarrants cancelled forfeited/expired (12,000 ) 0.04 - -\nOutstanding and exercisable at August 31, 2023 - $ - - $ -\nNOTE 8 - SUBSEQUENT EVENTS\nIn October 2023, we issued 56,547 shares of common stock to our directors for accrued director fees earned from June through August 2023.\nThe Company did not make its required October, November and December cash call in the amount of $133,000, $120,000 and $143,249, respectively. Consequently, the Companys interest in RTMD decreased from 19.874% at August 31, 2023 to 19.803% at September 30, 2023, 19.726% at October 31, 2023, and to 19.611% as of November 22, 2023. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nAt the end of the period covered by this Annual Report on Form 10-K for the fiscal year ended August 31, 2023, an evaluation was carried out under the supervision of and with the participation of our management, including the Chief Executive Officer (CEO) and Chief Financial Officer (CFO), of the effectiveness of the design and operations of our disclosure controls and procedures (as defined in Rule 13a-15(e) and Rule 15d-15(e) under the Exchange Act). Based on that evaluation the CEO and the CFO have concluded that as of the end of the period covered by this Annual Report, our disclosure controls and procedures were not effective in ensuring that: (i) information required to be disclosed by us in reports that we file or submit to the SEC under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in applicable rules and forms and (ii) material information required to be disclosed in our reports filed under the Exchange Act is accumulated and communicated to our management, including our CEO and CFO, as appropriate, to allow for accurate and timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles (GAAP). Management has assessed the effectiveness of internal control over financial reporting based on the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework. A material weakness, as defined by SEC rules, is a control deficiency, or combination of control deficiencies, such that there is a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis. The material weaknesses in internal control over financial reporting that were identified are:\na) We did not maintain sufficient personnel with an appropriate level of technical accounting knowledge, experience, and training in the application of U.S. GAAP commensurate with our complexity and our financial accounting and reporting requirements. We have limited experience in the areas of financial reporting and disclosure controls and procedures. As a result, there is a lack of monitoring of the financial reporting process and there is a reasonable possibility that material misstatements of the financial statements, including disclosures, will not be prevented or detected on a timely basis; and\nb) Due to our small size, we do not have a proper segregation of duties in certain areas of our financial reporting process. The areas where we have a lack of segregation of duties include cash receipts and disbursements, approval of purchases and approval of accounts payable invoices for payment. This control deficiency, which is pervasive in nature, results in a reasonable possibility that material misstatements of the financial statements will not be prevented or detected on a timely basis.\nAs a result of the existence of these material weaknesses as of August 31, 2023, management has concluded that we did not maintain effective internal control over financial reporting as of August 31, 2023, based on the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework.\nThis Annual Report does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our independent registered public accounting firm pursuant to rules of the SEC that permit the company to provide only managements report in this annual report.\nChanges to Internal Controls and Procedures over Financial Reporting\nWe regularly review our system of internal control over financial reporting to ensure we maintain an effective internal control environment. There were no changes in our internal control over financial reporting that occurred during the year that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagements Remediation Plans\nWe will look to increase our personnel resources and technical accounting expertise within the accounting function. Management believes that hiring additional knowledgeable personnel with technical accounting expertise will remedy the material weakness: insufficient personnel with an appropriate level of technical accounting knowledge, experience, and training in the application of GAAP commensurate with our complexity and our financial accounting and reporting requirements. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table sets forth certain information with respect to our current directors and executive officers. The term for each director expires at our next Annual Meeting or until his or her successor is appointed and qualified. The ages of the directors and officers are shown as of August 31, 2023:\nName\nAge\nCurrent Office with Company\nPositions Held Since\nDaniel E. Gorski\nDirector\nChief Executive Officer\nJanuary\nAugust\nAnthony Marchese\nDirector\nDecember\nCecil Wall\nDirector\nAugust\nPeter Denetclaw\nDirector\nAugust\nLaVern (Vern) Kenneth Lund\nDirector\nMay\nKevin Francis\nDirector\nNovember\nWm Chris Mathers\nChief Financial Officer\nFebruary\nDaniel E. Gorski - Mr. Gorski has served as a director of the Company since January 2007 and as the Companys chief executive officer since August 2012. Prior thereto, Mr. Gorski served as the Companys president and chief executive officer from January 2007 to May 2011 and chief operating officer from May 2011 to December 2011. From July 2004 to January 2006, Mr. Gorski was the co-founder and vice president of operations for High Plains Uranium Inc., a uranium exploration and development company that went public on the Toronto Stock Exchange in December 2005. Between June 1996 to May 2004, Mr. Gorski served as an officer and director of Metalline Mining Co., a publicly traded mining and development company with holdings in the Sierra Mojada Mining District, Coahuila, Mexico. From January 1992 to June 1996, Mr. Gorski was the exploration geologist under contract to USMX Inc. and worked exclusively in Latin America. Mr. Gorski earned a BS in 1960 from Sul Ross State College, in Alpine, Texas and an MA in 1970 from the University of Texas in Austin, Texas. Mr. Gorski has over forty-five years of experience in the mining industry.\nMr. Gorskis extensive technical knowledge and experience in the mining industry combined with his historical relationship with the Companys principal property, the Round Top project, permits Mr. Gorski to provide the Board with valuable insight to the exploration and development of the Round Top project. Accordingly, the Board believes that Mr. Gorski should serve on the Board.\nAnthony Marchese - Mr. Marchese has served as a director since December 2009. Since July 2018, Mr. Marchese has served as President of Marchese Management Co., LLC, a strategic advisory firm that consults to both public and private emerging growth companies. Mr. Marchese also serves as the general partner and chief investment officer of the Insiders Trend Fund, LP, an investment partnership whose mandate is to invest in those public companies whose officers and/or directors have been active acquirers of their own stock. Mr. Marcheses prior experience includes TriPoint Global Equities (Managing Director/Capital Markets- 2012-2018), Axiom Capital Management, Inc. (Managing Director - 2011-2012), Monarch Capital Group, LLC (President and Chief Operating Officer - 2003 to 2011), Laidlaw Equities (senior vice president - April 1997 to March 2002), Southcoast Capital (senior vice president - May 1988 to April 1997), Oppenheimer & Co (limited partner - September 1982 to May 1988), Prudential-Bache (vice president - July 1981 to August 1982) and the General Motors Corporation (analyst - June 1980 to June 1981). Mr. Marchese served in the military with the Army Security Agency and the U.S. Army Intelligence and Security Command. Mr. Marchese received an MBA in Finance from the University of Chicago. Mr. Marchese provides the Board with exceptional leadership and management knowledge, having gained extensive management and corporate finance experience during the course of his career. Mr. Marcheses specific experience, qualifications, attributes and skills described above led the Board to conclude that Mr. Marchese should serve as a member of the Board of Directors.\nCecil C. Wall - Cecil C. Wall was born in Duchene County, Utah in 1931. Mr. Wall attended Carbon County College and Utah State University. In 1969, he acquired control of a publicly traded company, Altex Oil Co. (formerly known as Mountain Valley Uranium), listed on the American Stock Exchange. Under Mr. Walls leadership, Altex established a 20,000 acre position in what became the Greater Altamont Field at Altamont, Utah. Mr. Wall sold his interest in Altex in 1985. Mr. Wall was also part of the founding group for the 2007 reorganization of Standard Silver Corp. which became TMRC. He sat on the TMRC board of directors and served as the Secretary and Treasurer from January 2004 to April 2012. He is currently the manager for C-Wall Investment Company, LLC, a Utah Limited Liability Company. In addition, he is the president of several family-owned private companies, and he brings wide business experience and close relations with many of the original shareholders.\nMr. Walls past experience with the Company as its Secretary and Treasurer and his past experience with public companies serve the Board at this time by providing needed guidance on public company matters and insight into the Companys historical operations. Mr. Walls specific experience, qualifications, attributes and skills described above led the Board to conclude that Mr. Wall should serve as a member of the Board of Directors.\nPeter Denetclaw, Jr. - Mr. Denetclaw has served as a manager of Freeport McMoran since 2008. Mr. Denetclaw has served as vice-chair of the management committee for Navajo Transitional Energy Company since 2014. Mr. Denetclaws specific mining and business experience and qualifications led the Board to conclude that Mr. Denetclaw, Jr. should serve as a member of the Board of Directors.\nLaVern Kenneth Lund - Mr. Lund began his career as an Engineer with North American Coal Corporation (NACoal) in 1996. Mr. Lund has served as chief executive officer of Navajo Transitional Energy Company since February 1, 2022. Over the past 25 years prior to Navajo Transitional Energy Company, Mr. Lund had held various technical, operational management and executive level positions, including over 18 years of field operating experience while working at five different surface mines located in North Dakota, Texas and Mississippi. Mr. Lund is a Registered Professional Engineer in the state of Mississippi. He also holds a Masters of Business Administration from Auburn University and is a graduate of Wharton Advanced Management Program. Mr. Lunds specific mining and business experience and qualifications led the Board to conclude that Mr. Lund should serve as a member of the Board of Directors.\nKevin Francis - Mr. Francis has served as principal of Mineral Resource Management LLC since April 2016, providing project management, technical and expert witness services, and permitting leadership to the mining industry. Mr. Francis served as vice president of project development of Aurcana Corporation from March 2017 to June 2019, managing and advancing all technical studies. Mr. Francis served as vice president, technical services and general manager of Oracle Mining Corp. from May 2012 to May 2016 (a wholly-owned subsidiary of Oracle Mining Corp. was placed into a court-ordered receivership in 2015), managing interdisciplinary technical functions including direction of geologists, mining engineers and consultants, as well as developing scopes of work, managing budgets and reviewing deliverables of studies. Mr. Francis specific mining and business experience and qualifications led the Board to conclude that Mr. Francis should serve as a member of the Board of Directors.\nWm. Chris Mathers - Mr. Mathers is a senior finance and accounting professional with more than 40 years of experience in financial accounting, mergers and acquisition, Securities and Exchange Commission compliance and operational and administrative support. Mr. Mathers holds a BBA in Accounting from Southwestern University at Georgetown, Texas, and is a certified public accountant. Mr. Mathers began his career in public accounting in 1981 with the accounting firm of Price Waterhouse focusing on multi-national public audits. From 1983 through 1989, Mr. Mathers was in private practice focusing on tax preparation, and the financial audits of corporations, partnerships and individuals. From 1989 through 1993, Mr. Mathers was a Controller and Administrative Officer of GJR Investments, Inc., a national real estate firm.\nBeginning in 1994, Mr. Mathers began work as chief financial officer for several privately and publicly held companies, including: InterSystems, Inc. of Houston, Texas, a multi-state manufacturing firm; Nexus Custom Electronics, Inc., a manufacturer of circuit boards to private industry and the U.S. Department of Defense; Interactive Nutrition International, Inc., Ottawa, Canada, a manufacturer of Nutritional products.\nArrangements between Officers and Directors\nTo our knowledge, there is no arrangement or understanding between any of our directors and executive officers with any other person, including directors and executive officers, pursuant to which the director or officer was selected to serve in such position.\nFamily Relationships\nNone of our directors or executive officers are related by blood, marriage, or adoption to any other director or executive officer.\nOther Directorships\nNo directors of the Company are also directors of issuers with a class of securities registered under Section 12 of the United States Securities Exchange Act (or which otherwise are required to file periodic reports under the Exchange Act).\nBoard of Directors Structure\nThe Companys current bylaws require the Board to consist of one or more directors, the number of directors to be determined from time to time by resolution of the stockholders or by resolution of the Board. The current Board is composed of six directors.\nDirector Independence\nThe Company currently has five independent directors, as defined by the OTC Markets Group OTCQB independence standards, as follows:\n● Anthony Marchese\n● Cecil Wall\n● Peter Denetclaw\n● LaVern Lund\n● Kevin Francis\nMeetings of the Board and Board Member Attendance at Annual Meeting\nDuring the fiscal year ending August 31, 2023, the Board held four (4) meetings of the Board. None of the incumbent Directors attended fewer than 75% of the board meetings which occurred during their tenure on the Board.\nCommunications to the Board\nStockholders who are interested in communicating directly with members of the Board, or the Board as a group, may do so by writing directly to the individual Board member c/o Corporate Secretary, at P.O. Box 159, 539 El Paso Street, Sierra Blanca, Texas 79851. The Companys Secretary will forward communications directly to the appropriate Board member. If the correspondence is not addressed to the particular member, the communication will be forwarded to a Board member to bring to the attention of the Board. The Companys Secretary will review all communications before forwarding them to the appropriate Board member.\nBoard Committees\nThe Board has established three board committees: an Audit Committee, a Compensation Committee, and a Corporate Governance and Nominating Committee.\nThe information below sets out the current members of each of the Companys board committees and summarizes the functions of each of the committees in accordance with their mandates.\nAudit Committee and Audit Committee Financial Experts\nThe Company has a standing Audit Committee and audit committee charter, which complies with Rule 10A-3 of the Exchange Act. The Audit Committee was established in accordance with Section 3(a)(58)(A) of the Exchange Act. The Audit Committee is currently comprised of three (3) directors, all of whom, in the opinion of the Board, are independent (in accordance with the OTC Markets Group, Inc. OTCQB independence standards), being Anthony Marchese (Chairman), LaVern Lund (appointed on November 25, 2023) and Cecil Wall. Mr. Marchese is a financial expert as defined under Item 407(d)(5) of Regulation S-K.\nThe Audit Committee is responsible for the oversight of the Companys accounting and financial reporting processes. This includes the selection and engagement of the Companys independent registered public accounting firm and review of the scope of the annual audit, audit fees and results of the audit.\nThe Audit Committee monitors the Companys audit and the preparation of financial statements and all financial disclosure contained in the Companys SEC filings. The Audit Committee appoints the Companys external auditors, monitors their qualifications and independence and determines the appropriate level of their remuneration. The external auditors report directly to the Audit Committee. The Audit Committee has the authority to terminate the Companys external auditors engagement and approve in advance any services to be provided by the external auditors that are not related to the audit.\nA copy of the Audit Committee charter is available for review on the Companys website at www.TMRC.com.\nAudit Committee Report\nThe Companys Audit Committee oversees the Companys financial reporting process on behalf of the Board. The Committee operates under a written charter adopted by the Board.\nThe Committee assists the Board by overseeing the (1) integrity of the Companys financial reporting and internal control, (2) independence and performance of the Companys independent auditors, (3) and provides an avenue of communication between management, the independent auditors and the Board.\nIn the course of providing its oversight responsibilities regarding the audited annual financial statements for the year ended August 31, 2023, the Committee reviewed the audited annual financial statements for the year ended August 31, 2023 with management and the Companys independent auditors. The Committee reviewed accounting principles, practices, and judgments as well as the adequacy and clarity of the notes to the financial statements.\nThe Committee reviewed the independence and performance of the independent auditors who are responsible for expressing an opinion on the conformity of those audited financial statements with accounting principles generally accepted in the United States, and such other matters as required to be communicated by the independent auditors in accordance with Auditing Standard No. 1301, Communications with Audit Committees, issued by the Public Company Accounting Oversight Board (PCAOB).\nThe Committee meets with the independent auditors to discuss their audit plans, scope and timing on a regular basis, with or without management present. The Committee has received the written disclosures and the letter from the independent auditors required by applicable requirements of the Public Company Accounting Oversight Board for independent auditor communications with Audit Committees concerning independence, as may be modified or supplemented.\nIn reliance on the reviews and discussions referred to above, the Committee recommended to the Board, and the Board has approved, that the audited financial statements be included in the Annual Report to the SEC on Form 10-K for the year ended August 31, 2023. The Committee and the Board have also recommended the selection of Ham, Langston & Brezina, L.L.P. as independent auditors for the Company for the fiscal year ending August 31, 2023.\nSubmitted by the Audit Committee Members\n● Anthony Marchese (Chairman)\n● Cecil Wall\nCompensation Committee\nThe Company has a Compensation Committee comprised of three (3) directors, each of whom, in the opinion of the Board, are independent (as determined under the OTC Markets Group OTCQB independence standards): Cecil Wall (Chairman), Kevin Francis and Anthony Marchese.\nThe Compensation Committee has adopted a charter. The Compensation Committee is responsible for considering and authorizing terms of employment and compensation of executive officers and providing advice on compensation structures in the various jurisdictions in which the Company operates. The Companys Chief Executive Officer may not be present during the voting determination or deliberations of his or her compensation; however, the Compensation Committee does consult with the Companys Chief Executive Officer in determining and recommending the compensation of directors and other executive officers.\nIn addition, the Companys Compensation Committee reviews both our overall salary objectives and significant modifications made to employee benefit plans, including those applicable to executive officers, and proposes awards of stock options. The Compensation Committee has determined that the Companys compensation policies and practices for its employees generally, not just executive officers, are not reasonably likely to have a material adverse effect on the Company.\nThe Compensation Committee does not and cannot delegate its authority to determine director and executive officer compensation. Our Compensation Committee and management did not engage the services of an external compensation consultant during fiscal year 2023.\nA copy of the Compensation Committee charter is available for review on the Companys website at www.TMRC.com.\nCompensation Committee Interlocks and Insider Participation\nThere are no Compensation Committee or Board interlocks among the members of the Companys Board.\nCorporate Governance and Nominating Committee\nGeneral\nThe Company has a Corporate Governance and Nominating Committee composed of 1 director, Anthony Marchese, with two vacancies.\nThe Companys Corporate Governance and Nominating Committee are responsible for developing the Companys approach to corporate governance issues. The Committee evaluates the qualifications of potential candidates for director and recommends to the Board nominees for election at the next annual meeting or any special meeting of stockholders, and any person to be considered to fill a Board vacancy resulting from death, disability, removal, resignation or an increase in Board size. The Committee has not adopted a formal policy which sets forth the criteria the Board will assess in connection with the consideration of a candidate. Instead the Committee considers a multitude of qualifications and characteristics, including the candidates integrity, reputation, judgment, knowledge, independence, experience, accomplishments, commitment and skills, all in the context of an assessment of the perceived needs of the Board at that time.\nA copy of the Corporate Governance and Nominating Committee charter is available on the Companys website at www.TMRC.com.\nBoard Diversity\nThe Company does not have a formal policy regarding diversity in the selection of nominees for directors. The Corporate Governance and Nominating Committee does, however, consider diversity on an informal basis as part of its overall selection strategy.\nRecommendations to the Board\nThe Committee will consider recommendations for director nominees made by stockholders and others if these individuals meet the criteria for consideration. For consideration by the Committee, the nominating stockholder or other person must provide the Corporate Secretary at the Companys principal offices with information about the nominee, including the detailed background of the suggested candidate that will demonstrate how the individual meets the Companys director nomination criteria. If a candidate proposed by a stockholder meets the criteria, the individual will be considered on the same basis as other candidates.\nBoard Leadership Structure\nThe Board has reviewed the Companys current Board leadership structure in light of the composition of the Board, the Companys size, the nature of the Companys business, the regulatory framework under which the Company operates, the Companys stockholder base, the Companys peer group and other relevant factors. Considering these factors the Board has determined to have a separate Chief Executive Officer and Chairman of the Board. The Chairman of the Board is a non-executive position. The Board has determined that this structure is currently the most appropriate Board leadership structure for the Company.\nThe Board of Directors Role in Risk Management Oversight\nThe understanding, identification and management of risk are essential elements for the successful management of the Company. Risk oversight begins with the Board and the Audit Committee. The Audit Committee reviews and discusses policies with respect to risk assessment and risk management. The Audit Committee also has oversight responsibility with respect to the integrity of the Companys financial reporting process and systems of internal control regarding finance and accounting, as well as its financial statements. Annually, management presents to the Audit Committee a report summarizing the review of the Companys methods for identifying and managing risks. Based on a review of the nature of operations, the Board does not believe that any areas of the Company have incentive to take excessive risks that would likely have a material adverse effect on the Companys operations.\nCode of Business and Ethical Conduct\nThe Company has adopted a corporate Code of Business and Ethical Conduct administered by its President and Chief Executive Officer, Daniel Gorski. The Company believes its Code of Business and Ethical Conduct is reasonably designed to deter wrongdoing and promote honest and ethical conduct, to provide full, fair, accurate, timely and understandable disclosure in public reports, to comply with applicable laws, to ensure prompt internal reporting of code violations, and to provide accountability for adherence to the code. The Companys Code of Business and Ethical Conduct provides written standards that are reasonably designed to deter wrongdoing and to promote:\n● Honest and ethical conduct, including the ethical handling of actual or apparent conflicts of interest between personal and professional relationships;\n● Full, fair, accurate, timely and understandable disclosure in reports and documents that are filed with, or submitted to, the Commission and in other public communications made by an issuer;\n● Compliance with applicable governmental laws, rules and regulations; and\n● The prompt internal reporting of violations of the code to an appropriate person or persons identified in the code; and\n● Accountability for adherence to the code.\nThe Companys Code of Business and Ethical Conduct is available on our web site at www.TMRC.com. A copy of the Code of Business and Ethical Conduct will be provided to any person without charge upon written request to the Company at its executive offices. We intend to disclose any waiver from a provision of the Code of Business and Ethical Conduct that applies to any of the Companys principal executive officer, principal financial officer, principal accounting officer or controller or persons performing similar functions that relates to any element of the Companys Code of Business and Ethical Conduct on the Companys website. No waivers were granted from the requirements of the Code of Business and Ethical Conduct during the year ended August 31, 2023, or during the subsequent period thereto. ITEM 11. EXECUTIVE COMPENSATION\nThe following summary compensation tables set forth information concerning the annual and long-term compensation for services in all capacities to the Company for the years stated for those persons who were, at August 31, 2023 named executive officers. Named Executive Officer means: (a) each principal executive officer, (b) the two most highly compensated executive officers other than the principal executive officer, at the end of the most recently completed financial year; and (c) up to two additional individuals who would be an Named Executive Officer under paragraph (b) but for the fact that the individual was not serving as an executive officer of the Company at the end of that financial year. There are only two Named Executive Officers, each of which is listed below.\nSummary Compensation Table\nOption\nAll Other\nTotal\nSalary\nAwards\nCompensation\nCompensation\nName and principal position\nYear\n(US$)\n(US$)\n(US$)\n(US$)\nDaniel Gorski\n$ 120,000\n$ -\n$ -\n$ 120,000\nChief Executive Officer\n$ 120,000\n$ -\n$ -\n$ 120,000\nWm Chris Mathers\n$ 60,000\n$ -\n$ -\n$ 60,000\nChief Financial Officer\n$ 60,000\n$ -\n$ -\n$ 60,000\nIn August 2012, the Company agreed to pay to Mr. Daniel Gorski the amount of $120,000 annually in connection with his appointment as Chief Executive Officer of the Company. The Company and Mr. Gorski have not entered into a formal written employment agreement in relation to Mr. Gorskis compensation and employment terms as Chief Executive Officer. Mr. Gorski is currently being paid $120,000 per year. Mr. Mathers is currently being paid $60,000 per year pursuant to an at-will employment arrangement. The Company does not believe that its compensation arrangements with its Named Executive Officers creates inherent risks that may have a material adverse effect on the Company.\nThere is no pay ratio disclosure as there are only two employees, the principal executive officer and chief financial officer, who comprise the Named Executive Officers.\nAs required under SEC rules adopted pursuant to the Dodd-Frank Act and Item 402(v) of Regulation S-K, we are providing the following information about the relationship between executive compensation and certain measurements of the Companys performance.\nThe following table sets forth the information of our NEOs, consisting of the Companys primary executive officer (PEO) and primary financial officer (PFO) for the fiscal years ended August 31, 2023 and 2022. The amounts represented under compensation actually paid (CAP) were computed in accordance with SEC rules relative to Item 402(v) of Regulation S-K.\nPay Versus Performance Table\nYear Summary compensation table total for first PEO (1) Summary compensation table total for second PEO (2) Compensation actually paid to first PEO Compensation actually paid to second PEO Average summary compensation table total for non-PEO NEOs (3) Average compensation actually paid to non-PEO and NEOs (3) Value of initial fixed $100 investment based on total shareholder return Net income\n(Loss)\n8/31/2022 $ 120,000 $ 60,000 $ 120,000 $ 60,000 $ - $ - $ 142.03 $ (2,903,739 )\n8/31/2023 $ 120,000 $ 60,000 $ 120,000 $ 60,000 $ - $ - $ 40.31 $ (2,591,961 )\n(1) Represents amounts actually paid to our CEO Daniel E Gorski\n(2) Represents amounts actually paid to our CFO Wm Chris Mathers\n(3) No non-PEO NEOs were paid by the Company\nExecutive Compensation Agreements and Summary of Executive Compensation\nReport on Executive Compensation\nDuring the year ended August 31, 2023, the Board and the Companys Compensation Committee were responsible for establishing a compensation policy and administering the compensation programs of the Companys executive officers.\nSalary\nThe amount of compensation paid by the Company to each of the Companys officers and the terms of those persons employment is determined by the Compensation Committee. The Compensation Committee evaluates past performance and considers future incentive and retention in considering the appropriate compensation for the Companys officers. The Company believes that the compensation paid to the Companys directors and officers is fair to the Company.\nStock Incentive Awards\nThe Compensation Committee believes that the use of direct stock awards is at times appropriate for employees, and in the future may use direct stock awards to reward outstanding service or to attract and retain individuals with exceptional talent and credentials. The use of stock options and other awards is intended to strengthen the alignment of interests of executive officers and other key employees with those of our stockholders.\nExecutive Compensation Agreements\nAgreement with Mr. Gorski\nThe Company pays Mr. Daniel Gorski a salary in the amount of $120,000 annually in connection with his appointment as Chief Executive Officer of the Company. The Company and Mr. Gorski have not entered into a formal written employment agreement.\nAgreement with Wm. Chris Mathers\nThe Company pays Mr. Wm. Chris Mathers a salary in the amount of $60,000 annually in connection with his appointment as Chief Financial Officer of the Company. The Company and Mr. Mathers have not entered into a formal written employment agreement.\nOutstanding Equity Awards At Fiscal Year-End\nThere were no awarded stock options previously issued to Named Executive Officers that were outstanding as of August 31, 2023.\nNonqualified Deferred Compensation\nThe Company does not offer nonqualified deferred compensation to any of its named executive officers.\nDirector Compensation\nThe following table sets forth the compensation granted to our directors during the fiscal year ended August 31, 2023. No cash director fees are paid and this has been the Companys policy for more than the last two fiscal years. All director fees for services rendered are paid through the issuance of shares of Company Common Stock or through non-qualified options to purchase shares of Company Common Stock. No director compensation is paid to Mr. Gorski.\nFees Paid or\nFee Paid or\nEarned in\nEarned in\nOption\nCash\nStock\nAwards\nTotal\nName\n($)\n($)\n($)\n($)\nAnthony Marchese\n$ -\n$ 55,000 (1)\n$ 637,548 (2)\n$ 692,548\nCecil Wall\n$ -\n$ 25,000 (1)\n$ -\n$ 25,000\nPeter Denetclaw, Jr.\n$ -\n$ 25,000 (1)\n$ -\n$ 25,000\nLaVern Lund\n$ -\n$ 25,000 (1)\n$ -\n$ 25,000\nKevin Francis\n$ -\n$ 33,000 (1)\n$ -\n$ 33,000\n(1) This value calculation equates to the market value of our Common Stock on the date of grant of shares of Common Stock issued for director services rendered, less a 20% discount.\n(2) During the year ended August 31, 2023, the Company granted Mr. Marchese a five-year non-qualified option to purchase 500,000 shares of Common Stock at an exercise price of $1.31 per share, with a Black-Scholes option pricing model valuation of $637,548 on the date of grant, for services rendered as chairman of the board of directors.\nEach of our directors are reimbursed reasonable out of pocket expenses associated with attending our board meetings. ITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following tables set forth information as of November 21, 2023, regarding the ownership of the Companys common stock by: (i) each Named Executive Officer, each director and all of the Companys directors and executive officers as a group; and (ii) each person who is known by us to own more than 5% of the Companys shares of common stock. The number of shares beneficially owned and the percentage of shares beneficially owned are based on 73,784,810 shares of common stock outstanding as of November 21, 2023.\nBeneficial ownership is determined in accordance with the rules and regulations of the Securities and Exchange Commission. Shares subject to options that are exercisable within 60 days following November 21, 2023 are deemed to be outstanding and beneficially owned by the optionee for the purpose of computing share and percentage ownership of that optionee but are not deemed to be outstanding for the purpose of computing the percentage ownership of any other person. Except as indicated in the footnotes to this table, and as affected by applicable community property laws, all persons listed have sole voting and investment power for all shares shown as beneficially owned by them.\nName and Address of Beneficial Owner\nNumber of\nShares of\nCommon Stock\nBeneficially\nOwned\nPercent of\nClass\nBeneficially\nOwned\nDaniel E. Gorski\n7,006,423 (1)\n9.5 %\nAnthony Marchese\n6,637,814 (2)\n8.9 %\nCecil Wall\n1,885,265 (3)\n2.6 %\nWm Chris Mathers\n488,454 (4)\n*\nPeter Denetclaw, Jr.\n10,169,464 (5)\n13.8 %\nLaVern Lund\n10,146,744 (6)\n13.8 %\nKevin Francis\n64,217 (7)\n*\nAll directors and executive officers as a group (7 persons)\n26,350,715\n35.5 %\nNavajo Transitional Energy Company\n10,111,883 (8)\n13.7 %\n* Less than 1%.\n(1) Represents 7,006,423 shares of Common Stock.\n(2) Consists of (i) 4,113,774 shares of Common Stock owned individually, (ii) 2,024,040 shares of common stock registered in the name of the Insiders Trend Fund, LP., an entity in which Mr. Marchese serves as general partner and chief investment officer and (iii) 500,000 shares of common stock underlying a currently exercisable option.\n(3) Consists of (i) 26,732 shares of Common Stock owned by Cecil Wall individually and (ii) 1,858,533 shares of Common Stock owned by various trusts controlled by Mr. Wall.\n(4) Comprised of 488,454 shares of Common Stock.\n(5) Comprised of (i) 57,581 shares of Common Stock owned individually and (ii) 10,111,883 shares of common stock owned by Navajo Transitional Energy Company, of which Mr. Denetclaw is deemed to be a beneficial owner.\n(6) Comprised of (i) 34,861, shares of Common Stock owned individually and (ii) 10,111,883 shares of common stock owned by Navajo Transitional Energy Company, of which Mr. Lund is deemed to be a beneficial owner.\n(7) Comprised of 64,217 shares of Common Stock\n(8) Messrs. Denetclaw and Lund have voting and investment power with respect to these shares.\nIt is believed by the Company that all persons named have full voting and investment power with respect to the shares indicated, unless otherwise noted in the table and the footnotes thereto. Under the rules of the Securities and Exchange Commission, a person (or group of persons) is deemed to be a beneficial owner of a security if he or she, directly or indirectly, has or shares the power to vote or to direct the voting of such security, or the power to dispose of or to direct the disposition of such security. Accordingly, more than one person may be deemed to be a beneficial owner of the same security. A person is also deemed to be a beneficial owner of any security, which that person has the right to acquire within 60 days, such as options or warrants to purchase our common stock.\nThe Company is not, to the best of our knowledge, directly or indirectly owned or controlled by another corporation or foreign government.\nChange in Control\nThe Company is not aware of any arrangement that might result in a change in control in the future. The Company has no knowledge of any arrangements, including any pledge by any person of our securities, the operation of which may at a subsequent date result in a change in the Companys control.\nSection 16(a) Beneficial Ownership Reporting Compliance; Delinquent Section 16(a) Reports\nSection 16(a) of the Exchange Act requires the Companys officers, directors, and persons who beneficially own more than 10% of the Companys common stock, to file reports of ownership and changes in ownership with the SEC.\nBased solely on our review of the copies of such forms received by us, or written representations from certain reporting persons, the Company believes that during fiscal year ended August 31, 2023 the filing requirements applicable to its officers, directors and greater than 10% percent beneficial owners were complied with, except for : (i) Mr. Lund was issued 6,546 shares of the Companys Common Stock on October 18, 2022 and December 28, 2022, respectively, as a director and failed to timely file a Form 4; (ii) Mr. Lund was issued 11,336 shares of the Companys Common Stock on March 31, 2023 and April 10, 2023, respectively, as a director and failed to timely file a Form 4; (iii) Mr. Denetclaw was issued 57,581 shares of the Companys Common Stock on dates between October 27, 2020 and October 9, 2023 as a director and failed to timely file a Form 4; (iv) Mr. Wall was issued 3,313 shares of the Companys Common Stock on October 18, 2022 and December 28, 2022, respectively, as a director and failed to timely file a Form 4; (v) Mr. Francis was issued 4,526 and 4,638 shares of the Companys Common Stock on October 18, 2022 and December 28, 2022, respectively, as a director and failed to timely file a Form 4; (vi) Mr. Francis was issued 7,557 shares of the Companys Common Stock on March 31, 2023 as a director and failed to timely file a Form 4; (vii) Mr. Francis was issued 2,476 shares of the Companys Common Stock on June 22, 2023 as a director and failed to timely file a Form 4; and (viii) Mr. Marchese was issued 8,082 and 8,282 shares of the Companys Common Stock on October 18, 2022 and December 28, 2022, respectively, as a director and failed to timely file a Form 4. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe Company has a policy for the review of transactions with related persons as set forth in the Companys Audit Committee Charter and internal practices. The policy requires review, approval or ratification of all transactions in which the Company is a participant and in which any of the Companys directors, executive officers, significant stockholders or an immediate family member of any of the foregoing persons has a direct or indirect material interest, subject to certain categories of transactions that are deemed to be pre-approved under the policy - including employment of executive officers, director compensation (in general, where such transactions are required to be reported in the Companys proxy statement pursuant to SEC compensation disclosure requirements), as well as certain transactions where the amounts involved do not exceed specified thresholds. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe following table sets forth information regarding the amount billed to us by our independent auditor, Ham, Langston & Brezina, L.L.P., for our two fiscal years ended August 31, 2023 and 2022, respectively:\nYears Ended August 31,\nAudit Fees\n$ 79,000\n$ 66,855\nAudit Related Fees\n-\n-\nTax Fees\n5,000\n5,000\nAll Other Fees\n-\n-\nTotal\n$ 84,000\n$ 71,855\nAudit Fees\nConsist of fees billed for professional services rendered for the audit of our financial statements and review of interim financial statements included in quarterly reports and services that are normally provided by the principal accountants in connection with statutory and regulatory filings or engagements.\nAudit Related Fees\nThere were no Audit Related Fees charged which would have consisted of fees billed for assurance and related services that are reasonably related to the performance of the audit or review of our financial statements and are not reported under Audit Fees.\nTax Fees\nConsist of fees billed for professional services for tax compliance, tax advice and tax planning. These services include preparation of federal and state income tax returns.\nAll Other Fees\nThere were no All Other Fees which would have consisted of fees for product and services other than the services reported above.\nPolicy on Pre-Approval by Audit Committee of Services Performed by Independent Auditors\nThe Audit Committee has adopted procedures requiring the Audit Committee to review and approve in advance, all particular engagements for services provided by the Companys independent auditor. Consistent with applicable laws, the procedures permit limited amounts of services, other than audit, review or attest services, to be approved by one or more members of the Audit Committee pursuant to authority delegated by the Audit Committee, provided the Audit Committee is informed of each particular service. All of the engagements and fees for 2023 were pre-approved by the Audit Committee. The Audit Committee reviews with Ham, Langston & Brezina, L.L.P., whether the non-audit services to be provided are compatible with maintaining the auditors independence.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENTS AND SCHEDULES\nDocuments filed as part of this Annual Report on Form 10-K or incorporated by reference:\n(1) The financial statements are listed on the Index to Financial Statements in Item 8.\n(2) Financial Statement Schedules (omitted because the Company is a smaller reporting issuer).\nThe following exhibits are attached hereto or are incorporated by reference:\nExhibit\nNo.\nDescription\n2.1\nPlan of Conversion, dated August 24, 2012, incorporated by reference to Exhibit 2.1 of our Form 8-K filed with the SEC on August 29, 2012.\n3.1\nDelaware Certificate of Conversion, incorporated by reference to Exhibit 3.1 of our Form 8-K filed with the SEC on August 29, 2012.\n3.2\nDelaware Certificate of Incorporation, incorporated by reference to Exhibit 3.2 of our Form 8-K filed with the SEC on August 29, 2012.\n3.3\nDelaware Certificate of Amendment, incorporated by reference to Exhibit 3.1 of our Form 8-K filed with the SEC on March 18, 2016\n3.4\nDelaware Bylaws, incorporated by reference to Exhibit 3.3 of our Form 8-K filed with the SEC on August 29, 2012.\n3.5\nCommon Stock, par value $0.01; 100,000,000 shares authorized, 72,869,220 shares issued and outstanding as of August 31, 2022.\n4.1\nForm of Common Stock Certificate, incorporated by reference to Exhibit 4.1 of our Form 10-K for the period ended August 31, 2009 filed with the SEC on February 8, 2011.\n4.2\nForm of Warrant Indenture, incorporated by reference to Exhibit 4.2 of our Form S-1/A filed with the SEC on December 10, 2014.\n4.3\nForm of Class A Warrant, included as Schedule A in Exhibit 4.2.\n4.4\nForm of Class B Warrant, included as Schedule B in Exhibit 4.2.\n10.1\nAmended and Restated 2008 Stock Option Plan, incorporated by reference to Exhibit 10.1 of our Form 10-Q for the period ended May 31, 2011 filed with the SEC on July 15, 2011.\n10.2\nMining Lease, incorporated by reference to Exhibit 10.2 of our Form 10-K for the period ended August 31, 2009 filed with the SEC on February 8, 2011.\n10.3\nMining Lease dated November 2011 with the State of Texas, incorporated by reference to Exhibit 10.3 of the Companys Annual Report on Form 10-K for the period ended August 31, 2019 filed with the SEC on November 27, 2019.\n10.4\nPurchase option agreement dated September 2014 with the State of Texas, incorporated by reference to Exhibit 10.4 of the Companys Annual Report on Form 10-K for the period ended August 31, 2019 filed with the SEC on November 27, 2019.\n10.5\nGroundwater lease dated September 2014 with the State of Texas, incorporated by reference to Exhibit 10.5 of the Companys Annual Report on Form 10-K for the period ended August 31, 2019 filed with the SEC on November 27, 2019.\n10.6\nReeTech Operating Agreement, incorporated by reference to Exhibit 10.1 to the Companys Form 8-K as filed with the Commission on July 21, 2015\n10.7\nAmendment Number One to the Reetech Operating Agreement, incorporated by reference to Exhibit 10.1 to the Companys Form 8-K as filed with the Commission on November 30, 2015\n10.8\nAmendment Number One to the TRER License, incorporated by reference to Exhibit 10.3 to the Companys Form 8-K as filed with the Commission on November 30, 2015\n10.9*\nDirectors Agreement by and between the Company and Anthony Marchese, incorporated by reference to Exhibit 10.6 of our Form 10-K for the period ended August 31, 2009 filed with the SEC on February 8, 2011.\n10.10*\nSummary of Dan Gorski Employment Arrangement, incorporated by reference to Exhibit 10.10 of the Companys Annual Report on Form 10-K for the period ended August 31, 2019 filed with the SEC on November 27, 2019\n10.11*\nSummary of Wm. Chris Mathers Employment Arrangement, incorporated by reference to Exhibit 10.11 of the Companys Annual Report on Form 10-K for the period ended August 31, 2019 filed with the SEC on November 27, 2019\n10.12*\nOption Agreement for Wm. Chris Mathers incorporated by reference to Exhibit 10.21 of our Amendment No. 2 to its Registration Statement on Form S-1 (333-172116) filed with the SEC on May 25, 2011.\n10.13*\nForm of Directors Option Agreement incorporated by reference to Exhibit 10.22 of our Amendment No. 2 to its Registration Statement on Form S-1 (333-172116) filed with the SEC on May 25, 2011.\n10.14\nConsulting Agreement between the Company and Chemetals, Inc., dated January 22, 2013, incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed with the SEC on January 28, 2013.\n10.15\nLease Agreement between the Company and Southwest Range & Wildlife Foundation, Inc., dated March 6, 2013, incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed with the SEC on March 12, 2013.\n10.16\nVariation agreement with Morzev PTY LTD. (USA Rare Earth) dated October 2018, incorporated by reference to Exhibit 10.16 of the Companys Annual Report on Form 10-K for the period ended August 31, 2019 filed with the SEC on November 27, 2019.\n10.17\nAmended and Restated Option Agreement with Morzev (USA Rare Earth) dated August 2019, incorporated by reference to Exhibit 10.17 of the Companys Annual Report on Form 10-K for the period ended August 31, 2019 filed with the SEC on November 27, 2019.\n10.18\nFirst Amendment to the Amended and Restated Option Agreement with USA Rare Earth dated June 29, 2020, incorporated by reference to the definitive proxy statement on Schedule 14A filed with the SEC on July 15, 2020\n10.19\nMining Lease dated September 2011, incorporated by reference to Exhibit 10.19 of the Form 10-K for the period ended August 31, 2020 filed with the SEC on November 30, 2020.\n10.20\nContribution Agreement, effective as of May 17, 2021, among USA Rare Earth, LLC, Texas Mineral Resources Corp., and Round Top Mountain Development, LLC, filed with the SEC on Form 8-K on May 21, 2021\n10.21\nLimited Liability Company Agreement dated effective as of May 17, 2021, among USA Rare Earth, LLC, Texas Mineral Resources Corp., and Round Top Mountain Development, LLC, filed with the SEC on Form 8-K on May 21, 2021\n10.22\nMineral Exploration and Option Agreement dated effective October 7, 2021 between Standard Silver Corp. and Santa Fe Gold Corporation, filed with the SEC on Form 8-K on November 10, 2021.\n10.23\nAmended and Restated Limited Liability Company Agreement dated effective as of June 26, 2023, among USA Rare Earth, LLC, Texas Mineral Resources Corp., and Round Top Mountain Development, LLC, filed with the SEC on Form 8-K on June 27, 2023.\n31.1\nSection 302 Certification(1)\n31.2\nSection 302 Certification(1)\n32.1\nSection 906 Certification(1)\n32.2\nSection 906 Certification(1)\n101.INS(2) XBRL Instance Document\n101.SCH(2) XBRL Taxonomy Extension - Schema\n101.CAL(2) XBRL Taxonomy Extension - Calculations\n101.DEF(2) XBRL Taxonomy Extension - Definitions\n101.LAB(2) XBRL Taxonomy Extension - Labels\n101.PRE(2) XBRL Taxonomy Extension - Presentations\n* Management contract or compensatory plan or arrangement.\n(1) Filed herewith.\n(2) Submitted Electronically Herewith. Attached as Exhibit 101 to this report are the following formatted in XBRL (Extensible Business Reporting Language): (i) Consolidated Balance Sheets at August 31, 2023 and 2022; (ii) Consolidated Statements of Operations for the years ended August 31, 2023 and 2022; (iii) Consolidated Statements of Cash Flows for the years ended August 31, 2023 and 2022; (iv) Consolidated Statements of Shareholders Equity for the years ended August 31, 2023 and 2022; and (v) Notes to Consolidated Financial Statements.\nITEM 16. FORM 10-K SUMMARY\nNone included.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTEXAS MINERAL RESOURCES CORP.\n/s/ Daniel E Gorski\nDaniel E Gorski, Chief Executive Officer\nDATED: November 29, 2023\n/s/ Wm Chris Mathers\nWm Chris Mathers, Chief Financial Officer\nDATED: November 29, 2023\nPursuant to the requirements of the Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nCapacity\nDate\n/s/ Daniel E Gorski\nChief Executive Officer, Principal Executive Officer and Director\nNovember 29, 2023\nDaniel E Gorski\n/s/ Wm Chris Mathers\nChief Financial Officer\nNovember 29, 2023\nWm Chris Mathers\n/s/Anthony Marchese\nChairman of the Board\nNovember 29, 2023\nAnthony Marchese\n/s/ Cecil C Wall\nDirector\nNovember 29, 2023\nCecil C Wall\n/s/ Peter Denetclaw, Jr.\nDirector\nNovember 29, 2023\nPeter Denetclaw, Jr\n/s/ LaVern Lund\nDirector\nNovember 29, 2023\nLaVern Lund\n/s/ Kevin Francis\nDirector\nNovember 29, 2023\nKevin Francis"
}