{
    "cik": "1467845",
    "company": "Kashin, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-15",
    "period_of_report": "2022-04-30",
    "sic": "8200",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0430",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1467845/0001683168-22-008449-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1467845/000168316822008449/kashin_i10k-043022.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1467845/0001683168-22-008449.txt",
    "filename": "1467845_10K_2022_0001683168-22-008449.htm",
    "content": "Item 1. Business.\nORGANIZATION WITHIN THE LAST FIVE YEARS\nOverview\nSingular Chef, Inc. was incorporated in the State of Nevada on April 9, 2009 and has a fiscal year end of April 30. We were a development-stage Company that intended to provide specialized step-by-step cooking tutorials through our website for monthly subscribers and on pay-per-view basis.\nOn October 10, 2012 the Company changed the name of the Company from Singular Chef, Inc. to One Clean Planet, Inc.. The Board of Directors approved an amendment to increase the number of shares of authorized common stock from 75,000,000 shares of common stock, par value $0.001 per share to 550,000,000 shares of common stock, par value $0.001 per share.\nOn October 10, 2012 the Board of Directors approved an amendment to effect a forward split of all issued and outstanding shares of common stock, at a ratio of 526.3:1 (the \"Forward Stock Split\").\nOn November 26, 2014 by and amongst One Clean Planet, Inc. (CLPT) and Kashin/Txtpay USA, Inc., a company incorporated and registered in the State of California, company number C3704841, whose registered office is at 1740 W Katella Ave Suite Q, Orange County, California 92867, USA (Kashin) together with TXTPAY LIMITED, a company incorporated and registered in New Zealand, company number 2273279, whose registered office is at C/-4 Blake Street, Surfdale, Waiheke Island, New Zealand (Txtpay together with Kashin, Kashin/Txtpay) CLPT and Kashin/Txtpay, collectively referred to as the Parties (the Agreement) whereby Kashin/Txtpay shall sell, convey, transfer, assign, and deliver to CLPT, and CLPT shall purchase from Kashin/Txtpay, 100% of the business of Kashin/Txtpay and any of its subsidiaries and/or affiliates.\nIn exchange, CLPT was to issue to the Kashin/Txtpay Shareholders, their designees or assigns, 10,000,000 shares of our common stock or 50% of the shares of the Companys common stock issued and outstanding after the Closing as per the terms set forth in the Agreement.\nThe Board of Directors conducted a review of the Material Definitive Agreement (MDA) between the Issuer and Txtpay/Kashin New Zealand as to the validity and the compliance of the terms of such MDA by Txtpay/Kashin New Zealand and its principles. Management believes there were misrepresentations made by the principles of Txtpay/Kashin New Zealand, therefore the value of the New Zealand division is not confirmed. As a result, Management will not be issuing 10,000,000 post consolidation shares to Txtpay/Kashin New Zealand shareholders.\nOn June 26 th 2015, the directors resolved to change the Company name to Kashin, Inc., to reduce the authorized capital to 75,000,000 shares and effect a reverse stock split of 1:35. The name change/reverse split took effect at the open of business 7/27/2015.\nWe are unable to complete our business plan or marketing efforts because we didnt have enough money, we ceased our development and/or marketing activities until we raise money. We had no activity from 2015 to current. We are currently bringing our company filings current to allow a reverse merger of a viable corporation to ensure our investors do not lose their entire investment.\nPlan of Operation\nOver the next twelve months, the Company will be focusing on the implementation of obtaining new avenues of revenue with Kashin, Inc. / Kashin USA, Inc. At this time, we are currently seeking new revenue sources.\nBUSINESS OF KASHIN\nOverview\nKashin, Inc. fka One Clean Planet , Singular Chef, Inc. (\"the Company\", our or \"we\") was incorporated in the State of Nevada as a for-profit company on April 09, 2009. We have not had any significant development of our business nor have we received any revenue. Due to the lack of results in our attempt to implement our original business plan, management determined it was in the best interests of the shareholders to look for other potential business opportunities that might be available to the Company.\nIn 2014, the company rebranded its name to Kashin (trademarked) and established operations in USA and Africa (Uganda & Kenya). During 2014, Kashin has connected its billing platform to VOIP systems and now provides low cost international calls from any mobile to any country (branded Kashin Kredits). Kashin Kredits is now connected to major Telcos providing mobile money services in Africa (MTN Uganda, Airtel Uganda, MTN Kenya and MPESA Kenya). Kashin is currently in the process of connecting to PayNearMe services, which will provide 20,000 stores for customers to use cash to top-up their Kashin mobile wallets for instant purchases of goods & services globally. Kashin has since engaged with several other service providers on an international level to allow Kashin Remote Top ups of minutes.\nIn Dec 2014, Kashin merged with One Clean Planet, Inc. a public company in which Kashin Inc. will become the surviving entity.\nApril 30, 2021, Kashin has been a dormant company since 2014 and is now considered a Shell Company.\nSales, Marketing, and Distribution\nKashin has been dormant and is currently looking for a merger candidate.\nIntellectual Property\nTrademarks and Trade Secrets\nNone\nManagement believes that if additional subsequent private placements are successful, we will generate sales revenue within the following twelve months thereof. However, additional equity financing may not be available to us on acceptable terms or at all, and thus we could fail to satisfy our future cash requirements.\nIf One Clean Planet is unsuccessful in raising the additional proceeds through a private placement offering it will then have to seek additional funds through debt financing, which would be very difficult for a new development stage company to secure. Therefore, the company is highly dependent upon the success of the anticipated private placement offering described herein and failure thereof would result in One Clean Planet having to seek capital from other resources such as debt financing, which may not even be available to the company. However, if such financing were available, because One Clean Planet is a development stage company with no operations to date, it would likely have to pay additional costs associated with high risk loans and be subject to an above market interest rate. At such time these funds are required, management would evaluate the terms of such debt financing and determine whether the business could sustain operations and growth and manage the debt load. If One Clean Planet cannot raise additional proceeds via a private placement of its common stock or secure debt financing, it would be required to cease business operations. As a result, investors in One Clean Planets common stock would lose all of their investment.\nManagement does not plan to hire additional employees at this time.\nWe do not expect to be purchasing or selling plant or significant equipment during the next twelve months. Item 1A. Risk Factors.\nWe are a smaller reporting company as defined in Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 1B. Unresolved Staff Comments.\nNone Item 2. Properties.\nWe do not own any real estate or other properties. The office space is provided by the president at no charge. Item 3. Legal Proceedings.\nThe Company is not a party to any pending legal proceedings.\nNo director, officer, or affiliate of the issuer and no owner of record or beneficiary of more than 5% of the securities of the issuer, or any security holder is a party adverse to the small business issuer or has a material interest adverse to the small business issuer. Item 4. Mine Safety Disclosures.\nN/A\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nAs of April 30, 2022, the Company has issued a total of 28,560,745 shares. The Company has not paid cash dividends and has no outstanding options as of April 30, 2022.  Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our financial statements and related notes included elsewhere in this report.\nThis annual report contains forward looking statements relating to our Company's future economic performance, plans and objectives of management for future operations, projections of revenue mix and other financial items that are based on the beliefs of, as well as assumptions made by and information currently known to, our management. The words \"expects, intends, believes, anticipates, may, could, should\" and similar expressions and variations thereof are intended to identify forward-looking statements. The cautionary statements set forth in this section are intended to emphasize that actual results may differ materially from those contained in any forward looking statement.\nOur auditors report on our April 30, 2022 financial statements expresses an opinion that substantial doubt exists as to whether we can continue as an ongoing business. Since our officer and director may be unwilling or unable to loan or advance us additional capital, we believe that if we do not raise additional capital over the next 12 months, we may be required to suspend or cease the implementation of our business plans. See April 30, 2022 Audited Financial Statements - Auditors Report.\nAs of April 30, 2022, Kashin had $0 cash on hand. Management believes this amount will not satisfy our cash requirements for the next twelve months or until such time that additional proceeds are raised. We plan to satisfy our future cash requirements - primarily the working capital required for the development of our course guides and marketing campaign and to offset legal and accounting fees - by additional equity financing. This will likely be in the form of private placements of common stock.\nManagement believes that if subsequent private placements are successful, we will be able to generate sales revenue within the following twelve months thereof. However, additional equity financing may not be available to us on acceptable terms or at all, and thus we could fail to satisfy our future cash requirements.\nOne Clean Planet believes if we do not raise additional proceeds through an extra private placement offering it will then have to seek additional funds through debt financing, which would be highly difficult for a new development stage company to secure. However, if such financing were available, because One Clean Planet has not developed any operations to date, it would likely have to pay additional costs associated with high risk loans and be subject to an above market interest rate. At such time these funds are required, management would evaluate the terms of such debt financing and determine whether the business could sustain operations and growth and manage the debt load. If One Clean Planet cannot raise additional proceeds via a private placement of its common stock or secure debt financing it would be required to cease business operations. As a result, investors in One Clean Planets common stock would lose all of their investment.\nThe development and marketing of our services will start over the next 12 months.\nAs of April 30, 2022 the Company has not generated any revenue. We incurred operating expenses in the amount of $0 in the fiscal year ended April 30, 2022 as compared to $0 at April 30, 2021 due to the company becoming dormant for the past two years.\nAs of the date of this Annual Report, the current funds available to the Company will not be sufficient to continue operations. The cost to establish the Company and begin operations was estimated to be approximately $250,000 over the next twelve months and the cost of maintaining our reporting status was estimated to be $25,000 over this same period.\nOther than the above described situation the Company does not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on the Company's financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nWe are a smaller reporting company as defined in Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 8. Financial Statements and Supplementary Data.\nKASHIN, INC.\nFINANCIAL STATEMENTS\nApril 30, 2022\nAudited\nReport of Independent Registered Public Accounting Firm\nBALANCE SHEETS\nSTATEMENTS OF OPERATIONS\nSTATEMENTS OF STOCKHOLDERS' EQUITY (DEFICIT)\nSTATEMENTS OF CASH FLOWS\nNOTES TO AUDITED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm To the shareholders and the board of directors of Kashin, Inc\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Kashin, Inc. as of April 30, 2022, the related statements of operations, stockholders' equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the \"financial statements\").\nIn our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of April 30, 2022, and the results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States. The financial statement of Kashin, Inc. As of April 30, 2021, were audited by other auditors whose report dated December 1, 2021, expressed an unqualify opinion on those statement.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Company's ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. We conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ Olayinka Oyebola and Co\nOlayinka Oyebola and Co\nWe have served as the Company's auditor since October 2022\nLagos Nigeria\nDecember 5, 2022\nKASHIN, INC.\nBALANCE SHEETS\nAudited\nApril 30, 2022 April 30, 2021\nASSETS\nCURRENT ASSETS\nCash $ - $ -\nTOTAL CURRENT ASSETS $ - $ -\nLIABILITIES AND STOCKHOLDERS' EQUITY (DEFICIT)\nCURRENT LIABILITIES\nAccounts payable and accrued liabilities $ 4,876 $ 11,493\nOther payables 28,501 -\nNotes Payable - -\nTOTAL CURRENT LIABILITIES 33,377 11,493\nSTOCKHOLDERS' EQUITY (DEFICIT)\nCapital stock, Authorized 75,000,000 shares of common stock, $0.001 par value, 28,560,745 shares issued and outstanding\n28,561\n28,561\nAdditional paid-in capital 494,019 494,019\nAccumulated deficit (555,957 ) (534,073 )\nTOTAL STOCKHOLDERS' EQUITY/(DEFICIT) (33,377 ) (11,493 )\nTOTAL LIABILITIES AND STOCKHOLDERS' EQUITY/(DEFICIT) $ - $ -\nThe accompanying notes are an integral part of these financial statements\nKASHIN, INC.\nSTATEMENTS OF OPERATIONS\nAudited\nYear Year\nended ended\nApril 30, 2022 April 30, 2021\nREVENUE\nRevenues $ - $ -\nTotal Revenues - -\nEXPENSES\nGeneral and Administrative expense 5,719 -\nProfessional fees 21,110 1,428\nTotal Expenses, before provision of income taxes 26,829 1,428\nOTHER INCOME\nPayable forgiveness/written off debt 4,945 100,000\nProvision for income taxes - -\nNET INCOME /(LOSS) $ (21,884 ) $ 98,572\nBASIC AND DILUTED LOSS PER COMMON SHARE $ - $ -\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING 28,560,745 28,560,745\nThe accompanying notes are an integral part of these financial statements\nKASHIN, INC.\nSTATEMENTS OF STOCKHOLDERS' EQUITY (DEFICIT)\nAs at April 30, 2022\nAudited\nCommon Stock Additional Share\nNumber of\nPaid-in Subscriptions Accumulated\nShares Amount Capital Receivable Deficit Total\nBalance, April 30, 2020 28,560,745 $ 28,561 $ 494,019 $ - $ (632,645 ) $ (108,637 )\nNet profit for the year ended April 30, 2021 - - - - 98,572 98,572\nBalance, April 30, 2021 28,560,745 $ 28,561 $ 494,019 $ - $ (534,073 ) $ (11,493 )\nNet profit for the year ended April 30, 2022 - - - - (21,884 ) (21,884 )\nBalance, April 30, 2022 28,560,745 $ 28,561 $ 494,019 $ - $ (555,957 ) $ (33,377 )\nThe accompanying notes are an integral part of these financial statements\nKASHIN, INC.\nSTATEMENTS OF CASH FLOWS\nAudited\nYear Year\nended ended\nApril 30, 2022 April 30, 2021\nOPERATING ACTIVITIES\nNet loss $ (21,884 ) $ 98,572\nAdjustment to reconcile net loss to net cash used in operating activities:\nAccounts Payable 21,884 1,428\nNotes Payable - (100,000 )\nNET CASH PROVIDED BY (USED IN) OPERATING ACTIVITIES - -\nFINANCING ACTIVITIES\nProceeds from sale of common stock - -\nLoan from related party - -\nNET CASH PROVIDED BY FINANCING ACTIVITIES $ - $ -\nNET INCREASE (DECREASE) IN CASH $ - $ -\nCASH, BEGINNING OF PERIOD $ - $ -\nCASH, END OF PERIOD $ - $ -\nSupplemental cash flow & noncash financing activities:\nCash paid for:\nInterest $ - $ -\nIncome taxes $ - $ -\nThe accompanying notes are an integral part of these financial statements\nKASHIN, INC.\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nApril 30, 2022\nNOTE 1 - NATURE OF OPERATIONS AND BASIS OF PRESENTATION\nThe Company was incorporated in the State of Nevada as a for-profit Company on April 9, 2009 and established a fiscal year end of April 30.\nOne Clean Planet intends to enter into the online content provider industry specializing in step-by-step cookery tutorial companies.\nThe Company changed its name on July 27, 2015 to Kashin, Inc. having received FINRAs approval.\nSince the company has been dormant for over two years, the company now has a Shell status.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nIn the opinion of management, the accompanying balance sheets, statements of operations, stockholders' equity (deficit) and cash flows include all adjustments, consisting only of normal recurring items, for their fair presentation in conformity with accounting principles generally accepted in the United States. These financial statements are presented in United States dollars.\nAdvertising\nAdvertising costs are expensed as incurred. As of April 30, 2022 and 2021, no advertising costs have been incurred.\nProperty\nThe Company does not own or rent any property. The office space is provided by the president at no charge.\nRevenue and Cost Recognition\nNone\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with maturity of three months or less to be cash equivalents.\nUse of Estimates and Assumptions\nPreparation of the financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect certain reported amounts and disclosures. Accordingly, actual results could differ from those estimates.\nIncome Taxes\nThe Company follows the liability method of accounting for income taxes. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax balances. Deferred tax assets and liabilities are measured using enacted or substantially enacted tax rates expected to apply to the taxable income in the years in which those differences are expected to be recovered or settled. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the date of enactment or substantive enactment.\nNet Loss per Share\nBasic loss per share includes no dilution and is computed by dividing loss available to common stockholders by the weighted average number of common shares outstanding for the period. Dilutive loss per share reflects the potential dilution of securities that could share in the losses of the Company. Because the Company does not have any potentially dilutive securities, the accompanying presentation is only of basic loss per share.\nRecent Accounting Pronouncements\nThe company has evaluated all the recent accounting pronouncements and believes that none of them will have a material effect on the companys financial statement.\nNOTE 3 - GOING CONCERN\nThe Companys financial statements are prepared in accordance with generally accepted accounting principles applicable to a going concern. This contemplates the realization of assets and the liquidation of liabilities in the normal course of business. Currently, the Company has a working capital deficit of $33,377, an accumulated deficit of $555,957 and net loss from operations of $21,884. The Company does not have a source of revenue sufficient to cover its operation costs giving substantial doubt for it to continue as a going concern. The Company will be dependent upon the raising of additional capital through placement of our common stock in order to implement its business plan, or merge with an operating company. There can be no assurance that the Company will be successful in either situation in order to continue as a going concern. The Company funded its initial operations by way of issuing Founders shares. The officers and directors have committed to advancing certain operating costs of the Company, including Legal, Audit, Transfer Agency and Edgarizing costs.\nNOTE 4 - FAIR VALUE OF FINANCIAL INSTRUMENTS\nThe Company has determined the estimated fair value of financial instruments using available market information and appropriate valuation methodologies. The fair value of financial instruments classified as current assets or liabilities approximate their carrying value due to the short-term maturity of the instruments.\nNOTE 5 - CAPITAL STOCK\nThe Companys capitalization was reduced to 75,000,000 common shares with a par value of $0.001 per share, on July 27, 2015. No preferred shares have been authorized or issued.\nAs of April 30, 2022, the Company has not granted any stock options and has not recorded any stock-based compensation.\nOn April 30, 2021, and on April 30, 2021 the Company had 28,560,745 common shares issued and outstanding.\nNOTE 6 - RELATED PARTY TRANSACTIONS\nWe do not have any related party transactions.\nNOTE 7 - INCOME TAXES\nWe did not provide any current or deferred U.S. federal income tax provision or benefit for any of the periods presented because we have experienced operating losses since inception. Accounting for Uncertainty in Income Taxes when it is more likely than not that a tax asset cannot be realized through future income the Company must allow for this future tax benefit. We provided a full valuation allowance on the net deferred tax asset, consisting of net operating loss carry forwards, because management has determined that it is more likely than not that we will not earn income sufficient to realize the deferred tax assets during the carry forward period.\nThe components of the Companys deferred tax asset and reconciliation of income taxes computed at the statutory rate to the income tax amount recorded as of April 30, 2022, and 2021 are as follows:\nSchedule of deferred tax assets April 30, 2022 April 30, 2021\nNet operating loss carry forward\nEffective Tax rate 35% 35%\nDeferred Tax Assets\nLess: Valuation Allowance - -\nNet deferred tax asset $ - $ -\nThe net federal operating loss carry forward will expire between 2033 and 2034. This carry forward may be limited upon the consummation of a business combination under IRC Section 381.\nNOTE 8 - SUBSEQUENT EVENTS\nNone Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone Item 9A. Controls and Procedures.\nIn accordance with Rule 13a-15(b) of the Securities Exchange Act of 1934 as amended (the Exchange Act), as of the end of the period covered by this Annual Report on Form 10-K, the Companys management evaluated, with the participation of the Companys principal executive and financial officer, the effectiveness of the design and operation of the Companys disclosure controls and procedures (as defined in Rule 13a-15(e) or Rule 15d-15(e) under the Exchange Act). Disclosure controls and procedures are defined as those controls and other procedures of an issuer that are designed to ensure that the information required to be disclosed by the issuer in the reports it files or submits under the Act is recorded, processed, summarized and reported, within the time periods specified in the Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Act is accumulated and communicated to the issuer's management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. Based on that Evaluation he concluded that the Registrants disclosure controls and procedures are ineffective in gathering, analyzing and disclosing information needed to satisfy the registrants disclosure obligations under the Exchange Act. Based upon an evaluation of the effectiveness of disclosure controls and procedures, our Companys principal executive and principal financial officer has concluded that as of the end of the period covered by this Annual Report on Form 10K our disclosure controls and procedures (as defined in Rules 13a-15(e) or 15d-15(e) under the Exchange Act) are not effective because of the material weaknesses in our disclosure controls and procedures which are identified below. It should be noted that the design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions, regardless of how remote.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting for the company (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act). Internal control over financial reporting is to provide reasonable assurance regarding the reliability of our financial reporting for external purposes in accordance with accounting principles generally accepted in the United States of America. Internal control over financial reporting includes maintain records that in reasonable detail accurately and fairly reflect our transactions; providing reasonable assurance that transactions are recorded as necessary for preparation of our financial statements; providing reasonable assurance that receipts and expenditures of company assets are made in accordance with management authorization; and providing reasonable assurance that unauthorized acquisition, use or disposition of company assets that could have a material effect on our financial statements would be prevented or detected.\nAs of April 30, 2015, management assessed the effectiveness of the Companys internal control over financial reporting based on the criteria for effective internal control over financial reporting established in SEC guidance on conducting such assessments. Based on this evaluation under the COSO Framework, our management concluded that our internal control over financial reporting is not effective as of April 30, 2013. In making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework. Based on that evaluation, they concluded that, as of April 30, 2015, such internal controls and procedures were not effective to detect the inappropriate application of US GAAP rules as more fully described below. This was due to deficiencies that existed in the design or operation of our internal control over financial reporting that adversely affected our internal controls and that may be considered to be material weaknesses.\nThe matters involving internal controls and procedures that the Companys management considered to be material weaknesses under the standards of the Public Company Accounting Oversight Board were: (1) lack of a functioning audit committee and lack of a majority of outside directors on the Company's board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (2) inadequate segregation of duties consistent with control objectives; (3) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements; and (4) ineffective controls over period end financial disclosure and reporting processes. The aforementioned material weaknesses were identified by the Company's Chief Financial Officer in connection with the review of our financial statements as of April 30, 2015 and communicated to our management.\nManagement believes that the material weaknesses set forth in items (2), (3) and (4) above did not have an effect on the Company's financial results. However, management believes that the lack of a functioning audit committee and lack of a majority of outside directors on the Company's board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures can result in the Company's determination to its financial statements for the future years.\nWe are committed to improving our financial organization. As part of this commitment, we will create a position to segregate duties consistent with control objectives and will increase our personnel resources and technical accounting expertise within the accounting function when funds are available to the Company: i) Appointing one or more outside directors to our board of directors who shall be appointed to the audit committee of the Company resulting in a fully functioning audit committee who will undertake the oversight in the establishment and monitoring of required internal controls and procedures; and ii) Preparing and implementing sufficient written policies and checklists which will set forth procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements.\nManagement believes that the appointment of more outside directors, who shall be appointed to a fully functioning audit committee, will remedy the lack of a functioning audit committee and a lack of a majority of outside directors on the Company's Board. In addition, management believes that preparing and implementing sufficient written policies and checklists will remedy the following material weaknesses (i) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements; and (ii) ineffective controls over period end financial close and reporting processes. Further, management believes that the hiring of additional personnel who have the technical expertise and knowledge will result proper segregation of duties and provide more checks and balances within the department. Additional personnel will also provide the cross training needed to support the Company if personnel turn over issues within the department occur. This coupled with the appointment of additional outside directors will greatly decrease any control and procedure issues the company may encounter in the future.\nWe will continue to monitor and evaluate the effectiveness of our internal controls and procedures and our internal controls over financial reporting on an ongoing basis and are committed to taking further action and implementing additional enhancements or improvements, as necessary and as funds allow.\nThere have been no changes in our internal controls over financial reporting that occurred during the year ended April 30, 2015 that have materially affected or are reasonably likely to materially affect, our internal controls over financial reporting.\nThis annual report does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys independent registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit the Company to provide management report in the Annual Report. Item 9B. Other Information.\nNone\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nOur directors serve until their respective successors are elected and qualified. The names, addresses, ages and positions of our present officers and our directors are set forth below:\nName\nAge\nPosition(s)\nCarl Maybin\nChief Executive Officer, Director\nBackground of Officer and Director\nCarl Maybin is the Founder, President and Chief Executive Officer at IP Triple Communications a USA-based Federal Communications Commission licensed global Telecommunications Company. Mr. Maybin is an experienced leader and prior to founding IP Triple was the Vice President of Sales and Marketing for Mitsubishi Satellites SkyTiger Asia Pacific Group, Vice President of Partnership Development for International recognized start-up Cignal Global Communications who purchased his company Pegasus Integration. Cignal Global was acquired by Liberty Medias UPC Group in the UK for $200 million in 2001 to become Europes first Triple Play provider of Voice, Internet and Television. Prior to Cignal Global, Mr. Maybin founded 3 different companies and led Fujitsus Broadband Telecommunications Group in Southern California to $305 million in sales in his first year which was more than the entire rest of the US operations combined.\nFamily Relations\nThere are no family relationships among the Directors and Officers of Kashin, Inc. fka One Clean Planet, Inc.\nInvolvement in Legal Proceedings\nNo executive Officer or Director of the Company has been convicted in any criminal proceeding (excluding traffic violations) or is the subject of a criminal proceeding that is currently pending.\nNo executive Officer or Director of the Company is the subject of any pending legal proceedings.\nNo Executive Officer or Director of the Company is involved in any bankruptcy petition by or against any business in which they are a general partner or executive officer at this time or within two years of any involvement as a general partner, executive officer, or Director of any business. Item 11. Executive Compensation.\nOur current executive officers and directors have not and do not receive any compensation and have not received any restricted shares awards, options or any other payouts. As such, we have not included a Summary Compensation Table.\nThere are no current employment agreements between the Company and its executive officers. Our executive officers and directors have agreed to work without remuneration until such time as we receive revenues that are sufficiently necessary to provide proper salaries to the officer and compensate the director for participation. Our executive officers and directors have the responsibility of determining the timing of remuneration programs for key personnel based upon such factors as positive cash flow, shares sales, product sales, estimated cash expenditures, accounts receivable, accounts payable, notes payable, and a cash balances. At this time, management cannot accurately estimate when sufficient revenues will occur to implement this compensation, or the exact amount of compensation.\nThere are no annuity, pension or retirement benefits proposed to be paid to officers, directors or employees of the corporation in the event of retirement at normal retirement date pursuant to any presently existing plan provided or contributed to by Company. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nTitle of Class\nName and Address of Beneficial Owner [1]\nAmount and Nature of Beneficial Owner\nPercent of Class\nCommon Stock\n601 JULLIAN LLC\n1153 BERGEN PKWY # 165\nEVERGREEN CO 80439-9501\n7,200,000\n25.209%\nCommon Stock\nCARL MAYBIN\n300 KUULEI RD STE A\nKAILUA HI 96734-2701\n6,750,000\n\t23.634%\nCommon Stock\nRyan Morgan Hamouth\nVitri 33A, Costa del Este\nPanama City, Panama\n5,314,858\n18.609 %\nAll Beneficial Owners as a Group (3 person)\n6,048,104\n67.452 % Item 13. Certain Relationships and Related Transactions, and Director Independence.\nCurrently, there are no contemplated transactions that the Company may enter into with our officers, directors or affiliates. If any such transactions are contemplated we will file such disclosure in a timely manner with the Commission on the proper form making such transaction available for the public to view.\nThe Company has no formal written employment agreement or other contracts with our current officer and director and there is no assurance that the services to be provided by him will be available for any specific length of time in the future. Mr. Adamson anticipates devoting at a minimum of ten to fifteen percent of his available time to the Companys affairs. The amounts of compensation and other terms of any full time employment arrangements would be determined, if and when, such arrangements become necessary. Item 14. Principal Accounting Fees and Services.\nDuring the fiscal year ended April 30, 2022 we incurred approximately $21,000 in fees to our principal independent accountants for professional services rendered in connection with the audit of financial statements for the fiscal year ended April 30, 2021. For review of our financial statements for the quarters ended October 31, 2021, October 31, 2021, and January 31, 2022, we incurred approximately $1400 in fees to our principal independent accountants for professional services.\nDuring the fiscal year ended April 30, 2021 we incurred approximately $0 in fees to our principal independent accountants for professional services rendered in connection with the audit of financial statements for the fiscal year ended April 30, 2021. For review of our financial statements for the quarters ended October 31, 2020, October 31, 2020 and January 31, 2021, we incurred approximately $0 in fees to our principal independent accountants for professional services.\nDuring the fiscal year ended April 30, 2022, we did not incur any other fees for professional services rendered by our principal independent accountants for all other non-audit services which may include, but not limited to, tax related services, actuarial services or valuation services.\nPART IV Item 15. Exhibits, Financial Statement Schedules.\n3.1\nArticles of Incorporation of Kashin, Inc. fka Singular Chef, Inc. (incorporated by reference from our Registration Statement on Form S-1 filed on August 11, 2009)\n3.2\nBylaws of Kashin, Inc. fka Singular Chef, Inc. (incorporated by reference from our Registration Statement on Form S-1 filed on August 11, 2009)\n31.1\nRule 13(a)-14(a)/15(d)-14(a) Certification of Chief Executive Officer\n31.2\nRule 13(a)-14(a)/15(d)-14(a) Certification of Chief Financial Officer *\n32.1\nSection 1350 Certification of Chief Executive Officer\n32.2\nSection 1350 Certification of Chief Financial Officer **\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n_______\n* Included in Exhibit 31.1\n** Included in Exhibit 32.1\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nKashin, Inc.\n(Registrant)\nDate: December 15, 2022 By /s/ Carl Maybin\nCarl Maybin\nPresident and Director\nPrincipal and Executive Officer\nPrincipal Financial Officer\nPrincipal Accounting Officer"
}