{
    "cik": "1468978",
    "company": "SOUTHERN ITS INTERNATIONAL, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-11-22",
    "period_of_report": "2015-12-31",
    "sic": "7372",
    "state_of_inc": "NV",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1468978/0001477932-23-008761-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1468978/000147793223008761/sitsf_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1468978/0001477932-23-008761.txt",
    "filename": "1468978_10K_2015_0001477932-23-008761.htm",
    "content": "ITEM 1\nDescription of Business ITEM 1A\nRisk Factors ITEM 1B\nUnresolved Staff Comments Item 2. Properties.\nAs of December 31, 2015, our business office was located at 7935 W. Sahara Ave., Suite 103, Las Vegas, NV 89117, which is leased office space. In addition, as of December 31, 2015, we had a leased office and warehouse building in DIberville, Mississippi. Item 3. Legal Proceedings.\nWe are not currently a party to any legal proceedings, and we are not aware of any pending or potential legal actions. Item 4. Mine Safety Disclosures.\nNot Applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities.\nAs of December 31, 2015, our common stock traded on the Pink Sheets Tier of OTC Market Group LLCs Marketplace under the symbol SITS. The OTC Market is a network of security dealers who buy and sell stock. The dealers are connected by a computer network that provides information on current bids and asks, as well as volume information.\nThe reported high and low prices for our common stock are shown below for the period from January 1, 2014 through December 31, 2015. All quoted prices reflect inter-dealer prices without retail markup, mark-down or commission and may not necessarily represent actual transactions.\nHigh Bid\nLow Bid\nHigh Bid\nLow Bid\nFirst Quarter ended March 31\n$ 0.13\n$ 0.06\n$ 0.30\n$ 0.25\nSecond Quarter ended June 30\n$ 0.13\n$ 0.02\n$ 0.61\n$ 0.51\nThird Quarter ended September 30\n$ 0.06\n$ 0.01\n$ 0.21\n$ 0.18\nFourth Quarter ended December 31\n$ 0.06\n$ 0.01\n$ 0.09\n$ 0.08\nRegistered Holders of our Common Stock\nAs of December 31, 2015, there were approximately 66 record owners of our common stock. We believe that some additional stockholders hold stock on deposit with their brokers or investment bankers registered in the name of stock depositories.\nDividends\nThe Company has not declared any dividends since inception and does not anticipate paying any dividends in the foreseeable future on its common stock. The payment of dividends is within the discretion of the Board of Directors and will depend on the Companys earnings, capital requirements, financial condition, and other relevant factors. There are no restrictions that currently limit the Companys ability to pay dividends on its common stock other than those generally imposed by applicable state law.\nEquity Compensation Plans\nNone\nRecent Sales of Unregistered Securities\nNone.\nIssuer Purchases of Equity Securities\nDuring the fiscal year ended December 31, 2015, the Company did not repurchase any shares of its Common Stock.\nStock Transfer Agent\nOur stock transfer agent is Pacific Stock Transfer, 4045 South Spencer Street, Suite 403, Las Vegas, NV 89119, (702) 361-3033 voice, (702) 433-1979 fax. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nOVERVIEW\nWe are a development stage corporation with limited operations and no revenues from our business operations. We do not anticipate that we will generate significant revenues until we have raised significant funds. There is no assurance we will ever generate revenue even if we raised all necessary funds.\nGOING CONCERN\nOur financial statements are prepared using generally accepted accounting principles in the United States of America applicable to a going concern, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. We are in start-up stage operations and have not generated any revenues. This means that we believe there is substantial doubt that we can continue as an on-going business for the next twelve months.\nWe cannot guarantee we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources and possible cost overruns due to price and cost increases in services and products.\nWe have no assurance that future financing will be available to us on acceptable terms. If financing is not available on satisfactory terms, we may be unable to continue, develop or expand our operations. Equity financing could result in additional dilution to existing shareholders.\nCRITICAL ACCOUTNING POLICIES\nPlease refer to Note 2 - Summary of Significant Accounting Policies in the accompanying Notes to the Consolidated Financial Statements.\nRESULTS OF OPERATIONS\nRevenues.\nThe Company had revenues of $1,390,258 for the 12 months ended December 31, 2015, compared to $508,035 for the 12 months ended December 31, 2014. Our costs of goods were $1,377,127 and $287,653 for the 12-month periods ended December 31, 2015 and December 31, 2014, respectively.\nExpenses\nOur operating expenses were $295,215 in the 12 months ended December 31, 2015, and consisted of wages of $55,521, consulting fees of $28,049, professional fees of $5,030, and general and administrative expenses of $206,615. In the three months ended December 31, 2014, our operating expenses were $518,329, and consisted of wages of $82,679, consulting fees of $141,693, professional fees of $39.511, and general and administrative expenses of $254,446.\nWe had interest expense of $42,458 in the 12 months ended December 31, 2015 as compared to net interest expense of $95,376 for the 12 months ended December 31, 2014.\nOur net loss for the 12 months ended December 31, 2015, was $1,018,006 compared to a net loss of $470,583 for the 12 months ended December 31, 2014.\nAs of December 31, 2015 and December 31, 2014, the number of shares outstanding were 20,884,708 and 19,134,708, respectively\nLIQUIDITY AND CAPITAL RESOURCES\nAs of December 31, 2015 and December 31, 2014, our total assets were $29,796 and $707,592, respectively.\nAs of December 31, 2015, and December 31, 2014, our total liabilities were $3,074,706 and $2,736,246, respectively.\nCash Flows from Operating Activities\nWe have not generated positive cash flows from operating activities for the 12 months ended December 31, 2015, net cash flows used in operating activities were $30,816. Cash flows used in operating activities for the 12 months ended December 31, 2014, were $162,300.\nCash Flows from Investing Activities\nWe have not generated cash flows from investing activities for the 12 months ended December 31, 2015, and 2014, respectively.\nCash Flows from Financing Activities\nWe have financed our operations primarily from either advancements or the issuance of equity and debt instruments. For the 12 months ended December 31, 2015, net cash provided by financing activities was $25,000. For the 12 months ended December 31, 2014, net cash from financing activities was $83,324.\nOther Income (Expense).\nWe had impairment of prepaid expenses of $693,464 in the 12 months ended December 31, 2015 and derivative expense of $77,260 in the 12 months ended December 31, 2014.\nPLAN OF OPERATION\nOur plan of operation for the following twelve months ending December 31, 2016 is to expand our historical operations:\nSouthern ITS International, Inc. provides proprietary equipment and services to support government regulated high compliance industries . This success is measured by the facts that the equipment and systems installed operated according to contract specifications and the warranties for said installations were provided by and supported by SITS . Government sectors (correctional facilities and programs), and private sectors, including gaming and now medical marijuana and recreational marijuana (MMJ/MJ), have had challenges, but have been brought into the mainstream and are now subject to stringent compliance to tough government regulations.\nSouthern ITS International, Inc. has historically developed and delivered to the gaming and corrections sectors high compliance support systems facilitating the integration and implementation of complementary technologies. SITS continues to deliver such electronic security and networking infrastructures to those clients.\nSITS is expanding to deliver the same quality of auditing and compliance technology to the emerging MMJ/MJ market sector that it delivers to other high compliance industries. Additionally SITS has and will continue developing new patent pending equipment and systems specifically addressing MMJ/MJ-related government and banking regulations and requirements. Specifically, addressing the FinCEN problems related to all cash businesses.\nOur market position in the Security Systems sector and in the MMJ Financial Security Systems sector is in the lower segment of service providers. We do not enjoy the position of a large service provider or a multi-state office system. We market to the industries through networking, telephone and print ads and Industry Conventions. We compete on the basis of pricing and flexibility of installation timing.\nOFF-BALANCE SHEET ARRANGEMENTS\nWe have no off-balance sheet arrangements. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot applicable to smaller reporting companies. Item 8. Financial Statements and Supplementary Data\nThe Companys Financial Statements required by Item 8, are set forth on pages through of this report and are incorporated by reference in this Item 8.\nSOUTHERN ITS INTERNATIONAL, INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nBalance Sheets at December 31, 2015 and 2014\nStatements of Operations for the years ended December 31, 2015 and 2014\nStatements of Stockholders Deficit for the years ended December 31, 2015 and 2014\nStatements of Cash Flows for the years ended December 31, 2015 and 2014\nNotes to the Financial Statements\nThe accompanying notes are an integral part of these financial statements\nNeither the financial statements nor the notes have been reviewed by our auditors\nSOUTHERN ITS INTERNATIONAL, INC.\nCONSOLIDATED BALANCE SHEET\nDecember 31,\nDecember 31,\nASSETS\nCurrent Assets\nCash and cash equivalents\n$ 15,178\n$ 20,994\nAdvances to non-related parties\n10,000\n10,000\nPrepaids\n2,000\n673,150\nTotal Current Assets\n27,178\n704,144\nNon - Current Assets\nFixed assets\n2,618\n3,448\nTOTAL ASSETS\n$ 29,796\n$ 707,592\nLIABILITIES AND STOCKHOLDERS' EQUITY:\nCurrent Liabilities\nAccounts payable and accrued expenses\n$ 371,927\n$ 128,829\nAccrued interest\n458,244\n387,882\nConvertible notes payable - related party\n294,712\n294,712\nConvertible notes payable\n390,000\n375,000\nNotes payable - related party\n106,205\n96,205\nDerivative liability\n1,453,618\n1,453,618\nTotal Current Liabilities\n3,074,706\n2,736,246\nTOTAL LIABILITIES\n3,074,706\n2,736,246\nStockholders' Equity:\nPreferred stock, $0.001 par value, 10,000,000 shares authorized;\n5,000,000 shares issued and outstanding\n$ 5,000\n$ 5,000\nCommon stock, $0.001 par value, 50,000,000 shares authorized; 20,884,708 (2014-19,134,708) shares issued and outstanding\n20,885\n19,135\nAdditional paid-in capital\n6,098,117\n6,098,117\nAccumulated deficit\n(9,168,912 )\n(8,150,906 )\nTotal Stockholders' Equity:\n(3,044,910 )\n(2,028,654 )\nTOTAL LIABILITIES AND STOCKHOLDERS' EQUITY:\n$ 29,796\n$ 707,592\nThe accompanying notes are an integral part of these financial statements\nNeither the financial statements nor the notes have been reviewed by our auditors\nSOUTHERN ITS INTERNATIONAL, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the year ended\nDecember 31,\nRevenues\n$ 1,390,258\n$ 508,035\nCost of Goods Sold\n1,377,127\n287,653\nGross profit\n13,131\n220,382\nOperating Expenses\nConsulting\n28,049\n141,693\nProfessional fees\n5,030\n39,511\nWages\n55,521\n82,679\nGeneral and administrative expenses\n206,615\n254,446\nTotal operating expenses\n295,215\n518,329\nLoss from operations\n(282,084 )\n(297,947 )\nOther income/(expenses)\nInterest expense\n(42,458 )\n(95,396 )\nDerivative expense\n-\n(77,260 )\nInterest income\n-\nImpairment of prepaid expenses\n(693,464 )\n-\nTotal Other income/(expenses)\n(735,922 )\n(172,636 )\nLoss before taxes\n(1,018,006 )\n(470,583 )\nProvision for income tax\n-\n-\nNet loss\n(1,018,006 )\n(470,583 )\nBasic and dilutive net loss per share\n$ (0.05 )\n$ (0.02 )\nWeighted average shares outstanding - basic and diluted\n20,884,708\n19,134,708\nThe accompanying notes are an integral part of these financial statements\nNeither the financial statements nor the notes have been reviewed by our auditors\nSOUTHERN ITS INTERNATIONAL, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED DECEMBER 31, 2015 AND 2014\nAdditional\nPreferred Stock\nCommon Stock\npaid in\nAccumulated\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nTotal\nBalance, December 31, 2013\n5,000,000\n$ 5,000\n3,764,348\n$ 3,764\n$ 5,365,388\n$ (7,680,323 )\n$ (2,306,171 )\nStock cancelled J. Bell per agreement\n-\n-\n(400,000 )\n(400 )\n(19,600 )\n-\n(20,000 )\nReverse split (50 to 1) adjustment\n-\n-\n(79,640 )\n(79 )\n-\n-\nStock issued for debt reduction\n-\n-\n3,100,000\n3,100\n-\n-\n3,100\nStock issued for services\n-\n-\n12,750,000\n12,750\n752,250\n-\n765,000\nNet loss for the year\n-\n-\n-\n-\n-\n(470,583 )\n(470,583 )\nBalance, December 31, 2014\n5,000,000\n$ 5,000\n19,134,708\n$ 19,135\n$ 6,098,117\n$ (8,150,906 )\n$ (2,028,654 )\nStock issued during the year\n-\n-\n1,750,000\n1,750\n-\n-\n1,750\nNet loss for the year\n-\n-\n-\n-\n-\n(1,018,006 )\n(1,018,006 )\nBalance, December 31, 2015\n5,000,000\n$ 5,000\n20,884,708\n$ 20,885\n$ 6,098,117\n$ (9,168,912 )\n$ (3,044,910 )\nThe accompanying notes are an integral part of these financial statements\nNeither the financial statements nor the notes have been reviewed by our auditors\nSOUTHERN ITS INTERNATIONAL, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the year ended\nDecember 31,\nCash Flows from Operating Activities:\nNet loss\n$ (1,018,006 )\n$ (470,583 )\nAdjustments to reconcile net loss to net cash used in operations:\nDepreciation and amortization\nStock issued for services\n1,750\n93,000\nDerivative expense\n-\n77,260\nImpairment of prepaid expense\n693,464\n-\nChanges in operating assets and liabilities:\nAccounts payable and accrued liabilities\n243,098\n96,405\nPrepaid\n(22,314 )\n(1,150 )\nAccrued Interest\n70,362\n62,325\nAccounts receivable, net\n-\n(20,386 )\nNet Cash Provided by (Used in) Operating Activities\n(30,816 )\n(162,300 )\nCash Flows from Financing Activities:\nProceeds from convertible note to related party\n-\n22,871\nProceeds from note payable\n25,000\n70,000\nPayment on note payable to related party\n-\n(9,547 )\nNet Cash Provided by (Used in) Financing Activities\n25,000\n83,324\nNet change in cash\n(5,816 )\n(78,976 )\nCash, beginning of period\n20,994\n99,970\nCash, end of period\n$ 15,178\n$ 20,994\nSupplemental cash flow information\nInterest paid\n$ -\n$ -\nIncome taxes paid\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements\nNeither the financial statements nor the notes have been reviewed by our auditors\nSOUTHERN ITS INTERNATIONAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDECEMBER 31, 2015 AND 2014\nNOTE 1 - NATURE AND DESCRIPTION OF BUSINESS\nSouthern ITS International, Inc. (formerly Alco Advanced Technologies, Inc.) (Company) was incorporated in the State of Nevada on September 27, 1984. On March 21, 2012, the Company changed its name from Alco Advanced Technologies, Inc. to Southern ITS International, Inc.\nThe Company executed a share exchange with Southern ITS Corporation (the Subsidiary) in which the result was Southern ITS becoming a wholly-owned subsidiary of the Company. Refer to Note 9 for more information. The Companys operations consist of providing turnkey integration of electronic security systems for various types of industries, such as transportation, gaming and other secure operations in both government and private sectors. The integration includes surveillance, access control, network infrastructure, data communications and fire and burglar alarm systems. Today, security technologies are evolving rapidly and require remote access through various networks, firewalls and internet security. Surveillance systems and access control are all network dependent and work best for the end user when they are completely integrated. The Companys mission is to provide a complete integration of the various electronic security systems with the computer networks that they are dependent upon and ensuring that the systems will remain secure from potential cyber attack.\nOn July 17, 2014, the Company enacted a 1-for-50 reverse stock split. The Company has adjusted all periods presented for the effects of the stock split.\nOn August 15, 2014, the Company amended its articles of incorporation to decrease its authorized shares of common stock from Two Hundred Fifty Million (250,000,000) shares to Fifty Million (50,000,000) shares, with a par value of $0.001. The Company remains to have Ten Million (10,000,000) preferred shares with par value of $0.001 authorized. The Company designated 10,000,000 Series A Preferred Stock which have preferred voting rights equal to 500 votes for each 1 preferred share.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of presentation\nThe Companys financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nThe accompanying audited financial statements have been prepared in accordance with accounting principles generally accepted in The United States of America and the rules and regulations of the Securities and Exchange Commission for interim financial information. Accordingly, they do not include all the information necessary for a comprehensive presentation of financial position and results of operations.\nIt is managements opinion, however, that all material adjustments (consisting of normal and recurring adjustments) have been made which are necessary for a fair financial statements presentation. The results for the interim period are not necessarily indicative of the results to be expected for the year.\nRestatement of Financial Statements\nCertain amounts in the prior period financial statements have been adjusted to conform to the current period presentation pursuant to a 1 for 50 reverse stock split.\nBasis of Consolidation\nThe accompanying consolidated financial statements include all of the accounts of the Company and Southern ITS as of December 31, 2015 and 2014 for the periods then ended. All intercompany balances and transactions have been eliminated.\nNeither these financial statements nor the notes have been reviewed by our auditors\nUse of estimates\nThe preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period.\nSuch estimates and assumptions impact, among others, the valuation allowance for deferred tax assets, due to continuing and expected future losses, and share-based payments.\nMaking estimates requires management to exercise significant judgment. It is at least reasonably possible that the estimate of the effect of a condition, situation or set of circumstances that existed at the date of the financial statements, which management considered in formulating its estimate could change in the near term due to one or more future confirming events. Accordingly, the actual results could differ significantly from estimates.\nCash and cash equivalents\nThe Company considers all highly liquid instruments purchased with a maturity of three months or less to be cash equivalents.\nThe Company minimizes its credit risk associated with cash by periodically evaluating the credit quality of its primary financial institution. The balance at times may exceed federally insured limits.\nAllowance for Doubtful Accounts\nThe Company evaluates the collectability of its accounts receivable based on a combination of factors. In circumstances where it is aware of a specific customers ability to meet its financial obligations, it records a specific reserve to reduce the amounts recorded to what it believes will be collected. For all other customers, it recognizes reserves for bad debts based on historical experience. The company had an allowance for doubtful account balance of $0 at December 31, 2015 and 2014.\nFair Value of Financial Instruments\nThe Company follows paragraph 825-10-50-10 of the FASB Accounting Standards Codification for disclosures about fair value of its financial instruments and paragraph 820-10-35-37 of the FASB Accounting Standards Codification (Paragraph 820-10-35-37) to measure the fair value of its financial instruments. Paragraph 820-10- 35-37 establishes a framework for measuring fair value in accounting principles generally accepted in the United States of America (U.S. GAAP), and expands disclosures about fair value measurements. To increase consistency and comparability in fair value measurements and related disclosures, Paragraph 820-10-35-37 establishes a fair value hierarchy which prioritizes the inputs to valuation techniques used to measure fair value into three (3) broad levels. The fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The three (3) levels of fair value hierarchy defined by Paragraph 820-10-35-37 are described below:\nLevel 1\nQuoted market prices available in active markets for identical assets or liabilities as of the reporting date.\nLevel 2\nPricing inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the reporting date.\nLevel 3\nPricing inputs that are generally observable inputs and not corroborated by market data.\nThe carrying amount of the Companys financial assets and liabilities, such as cash, prepaid expenses and accrued expenses approximate their fair value because of the short maturity of those instruments.\nNeither these financial statements nor the notes have been reviewed by our auditors\nThe Company does not have any assets or liabilities measured at fair value on a recurring or a non-recurring basis, consequently, the Company did not have any fair value adjustments for assets and liabilities measured at fair value at December 31, 2015 and 2014; no gains or losses are reported in the consolidated statements of operations that are attributable to the change in unrealized gains or losses relating to those assets and liabilities still held at the reporting date ended December 31, 2015 and,2014.\nProperty and Equipment\nProperty and equipment is stated at cost, less accumulated depreciation on a straight line basis over the estimated useful lives of 5 to 7 years. Maintenance and repairs are charged to operations when incurred. Betterment and renewals are capitalized when deemed material. When property and equipment are sold or otherwise disposed of, the asset account and related accumulated depreciation account are relieved, and any gain or loss is included in operations.\nIntangible Assets\nValuation of intangible assets include significant estimates and assumptions such as estimating future cash flows from product sales, developing appropriate discount rates, estimating probability rates for the successful completion of projects, continuation of customer relationships and renewal of customer contracts, and approximating the useful lives of the intangible assets acquired.\nLong Lived Assets\nThe Company reviews the recover-ability of the carrying value of identified intangibles and other long-lived assets, including fixed assets, whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recover-ability of these assets is determined based upon the forecasted undiscounted future net cash flows expected to result from the use of such asset and its eventual disposition. The Companys estimate of future cash flows is based upon, among other things, certain assumptions about expected future operating performance, growth rates and other factors. The actual cash flows realized from these assets may vary significantly from its estimates due to increased competition, changes in technology, fluctuations in demand, consolidation of its customers and reductions in average selling prices. If the carrying value of an asset is determined not to be recoverable from future operating cash flows, the asset is deemed impaired and an impairment loss is recognized to the extent the carrying value exceeds the estimated fair market value of the asset.\nRevenue recognition\nThe Company follows paragraph 605-10-S99-1 of the FASB Accounting Standards Codification for revenue recognition. The Company will recognize revenue when it is realized or realizable and earned. The Company considers revenue realized or realizable and earned when all of the following criteria are met: (i) persuasive evidence of an arrangement exists, (ii) the product has been shipped or the services have been rendered to the customer, (iii) the sales price is fixed or determinable, and (iv) the collectability is reasonably assured. There are no price incentives and the product can only be returned if defective. As the Company does not believe defective merchandise is likely an allowance has not been recognized. Revenue is recognized on a gross basis with corresponding costs of goods as a reduction to revenue in cost of sales. The Companys subsidiary earned the majority of the Companys revenues in 2012 from installing network surveillance systems. The Company applies the percentage-of-completion revenue recognition principles of accounting when recording revenues for ongoing projects.\nRisks and uncertainties\nThe Company operates in an industry that is subject to rapid change. The Companys operations are subject to significant risk and uncertainties including financial and operational risks including the potential risk of business failure. Also, see Note 3 regarding going concern matters.\nSegment information\nDuring 2015 and 2014, the Company only operated in one segment; therefore, segment information has not been presented.\nNeither these financial statements nor the notes have been reviewed by our auditors\nShare based payments\nGenerally, all forms of share-based payments, including stock option grants, restricted stock grants and stock appreciation rights, are measured at their fair value on the awards grant date, and based on the estimated number of awards that are ultimately expected to vest. Share-based payment awards issued to non-employees for services rendered are recorded at either the fair value of the services rendered or the fair value of the share-based payment, whichever is more readily determinable. The expense resulting from share-based payments are recorded as a component of general and administrative expense.\nEarnings per share\nIn accordance with accounting guidance now codified as FASB ASC Topic 260, Earnings per Share, Basic earnings per share (EPS) is computed by dividing net loss available to common stockholders by the weighted average number of common shares outstanding during the period, excluding the effects of any potentially dilutive securities. Diluted EPS gives effect to all dilutive potential of shares of common stock outstanding during the period including stock options or warrants, using the treasury stock method (by using the average stock price for the period to determine the number of shares assumed to be purchased from the exercise of stock options or warrants), and convertible debt or convertible preferred stock, using the if-converted method. Diluted EPS excludes all dilutive potential of shares of common stock if their effect is anti-dilutive. At December 31, 2015, there were 30,166,314 potential dilutive shares outstanding which relate to the outstanding warrants with exercise prices below the closing trading price of the Companys stock as of December 31, 2015.\nIncome Taxes\nThe Company accounts for income taxes in accordance with accounting guidance now codified as FASB ASC Topic 740, Income Taxes, which requires that the Company recognize deferred tax liabilities and assets based on the differences between the financial statement carrying amounts and the tax bases of assets and liabilities, using enacted tax rates in effect in the years the differences are expected to reverse. Deferred income tax benefit (expense) results from the change in net deferred tax assets or deferred tax liabilities. A valuation allowance is recorded when it is more likely than not that some or all deferred tax assets will not be realized.\nAccounting guidance now codified as FASB ASC Topic 740-20, Income Taxes - Intra-period Tax Allocation, clarifies the accounting for uncertainties in income taxes recognized in accordance with FASB ASC Topic 740-20 by prescribing guidance for the recognition, de-recognition and measurement in financial statements of income tax positions taken in previously filed tax returns or tax positions expected to be taken in tax returns, including a decision whether to file or not to file in a Particular jurisdiction. FASB ASC Topic 740-20 requires that any liability created for unrecognized tax benefits is disclosed. The application of FASB ASC Topic 740-20 may also affect the tax bases of assets and liabilities and therefore may change or create deferred tax liabilities or assets.\nRecent accounting pronouncements\nOn January 15, 2014-The Financial Accounting Standards Board (FASB) issued Accounting Standards Update No. 2011-08, Intangibles-Accounting for Goodwill (Topic 350):. The Update simplifies the accounting alternative, if elected, to goodwill existing as of the beginning of the period of adoption and any new goodwill recognized in annual periods beginning after December 15, 2014.\nIn April 2013, the FASB issued ASU No. 2010-17, Revenue Recognition - Milestone Method (Topic 605): Milestone Method of Revenue Recognition (codified within ASC 605 - Revenue Recognition). ASU 2013-45 provides guidance on defining a milestone and determining when it may be appropriate to apply the milestone method of revenue recognition for construction contracts.\nCompany management does not believe that any other recently issued, but not yet effective accounting pronouncements, if adopted, would have a material effect on the accompanying financial statements.\nNeither these financial statements nor the notes have been reviewed by our auditors\nNOTE 3 - GOING CONCERN\nThe Companys financial statements are prepared using generally accepted accounting principles applicable to a going concern which contemplates the realization of assets and liquidation of liabilities in the normal course of business. As reflected in the accompanying financial statements, the Company has an accumulated deficit of $8,911,236 from inception (September 27, 1984) to December 31, 2015. Its ability to continue as a going concern is dependent upon the ability of the Company to generate profitable operations in the future and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management intends to address the going concern issue by funding future operations through the sale of equity capital and by director loans, if needed.\nThe Company is in the development stage and anticipates that it will be able to have profitable operations in the near future. The Company believes its current available cash, along with anticipated revenues, will be sufficient to meet its cash needs for the near future. There can be no assurance that future financing will be available in amounts or terms acceptable to the Company, if at all.\nThese conditions raise substantial doubt about the Companys ability to continue as a going concern. The ability of the Company to continue its operations is dependent on Managements plans, which include the raising of capital through debt and/or equity markets with some additional funding from other traditional financing sources, including term notes, until such time that funds provided by operations are sufficient to fund working capital requirements.\nThe Company may need to incur additional liabilities with certain related parties to sustain the Companys existence.\nThese financial statements do not include any adjustments relating to the recovery of the recorded assets or the classification of the liabilities that might be necessary should the Company be unable to continue as a going concern.\nIn response to these problems, management has taken the following actions:\n·\nseeking additional debt and/or equity financing,\n·\ncontinue with development and implementation of the business plan,\n·\nassess business markets and related opportunities so that more significant revenues can be generated, and\n·\nallocation of sufficient resources to continue with service product marketing efforts.\nNOTE 4 - REVERSE STOCK SPLIT\nOn August 4, 2014, the Company executed a reverse stock split whereby the holders of stock in the Company, Southern ITS International, Inc., received one (1) post reverse stock-split share of common stock, $0.001 par value per share, in exchange for every fifty (50) shares of common stock (in effect, a 1 for 50 reverse split). The Company has adjusted the equity statement and equity portion of the balance sheet to retroactively account for the reverse stock split as if it occurred at inception.\nNOTE 5 - PREPAIDS\nThe prepaid asset balance at December 31, 2015, is a prepaid office rent deposit of $2,000\nNOTE 6 - FIXED ASSETS\nAt December 31, 2015 and December 31, 2014 the Company has the following fixed assets:\nDecember 31,\nDecember 31,\nFurniture & Equipment\n$ 5,808\n$ 5,808\nLess: Accumulated Depreciation\n(3,190 )\n(2,360 )\nFixed Assets, net\n$ 2,618\n$ 3,448\nDepreciation expense for the period ended December 31, 2015 was $830. Depreciation expense for the year ended December 31, 2014 was $829.\nNeither these financial statements nor the notes have been reviewed by our auditors\nNOTE 7 - NOTES PAYABLE\nThe company has unsecured notes payable and convertible notes payable to related parties and non-related parties at December 31, 2015 under the following general terms:\nConvertible notes payable to related parties\nBetween May 12, 2008 and December 29, 2011, the Company entered into multiple convertible promissory notes, all of which have identical terms, with Bonavel Development, S.A. for a total amount of $130,820. The notes bear a 10% interest rate per annum and have a maturity date of March 31, 2015 and is currently in default. The convertible notes principle and accrued interest may at any time be converted into shares of the Companys stock at a conversion rate fixed at $0.025 per share. As of December 31, 2015, there is a principle balance outstanding in the amount of $37,820 with accrued interest of $45,047. Of the total amount of $130,820 in principle, $93,000 was converted into stock of the Company, all of which occurred prior to January 1, 2013. As of December 31, 2015, the Company recorded a derivative liability of $164,005 which was calculated using the Black Scholes Model.\nBetween November 2, 2009 and December 21, 2012, the Company entered into multiple convertible promissory notes, all of which have identical terms, with Alco Scanning Services, Inc. for a total amount of $348,643. The notes bear a 10% interest rate per annum and have a maturity date of December 31, 2012, and is currently in default. The convertible notes principle and accrued interest may at any time be converted into shares of the Companys stock at a conversion rate fixed at $0.025 per share. As of December 31, 2015, there is a principle balance outstanding in the amount of $256,891 with accrued interest of $120,123. Of the total amount of $348,643 in principle, $91,752 was repaid with cash, all of which occurred prior to January 1, 2013. As of December 31, 2015, no principle has been converted into shares of stock in the Company. As of December 31, 2015, the Company recorded a derivative liability of $744,500 which was calculated using the Black Scholes Model.\nConvertible notes payable to non-related parties\nOn April 20, 2009, the Company entered into a convertible promissory note with Katherine Loren Armagnac in the amount of $30,000 with an interest rate of 10% per annum. The note is convertible into common shares of the Company at a fixed conversion price of $0.10 per share. As of December 31, 2015, no principle has been converted into shares of stock in the Company. The Company did not record derivative liability pertaining to this note because the conversion price is greater than the fair market stock price as of December 31, 2015.\nOn June 8, 2009, the Company entered into a convertible promissory note with Steven R. Hammond in the amount of $75,000 with an interest rate of 10% per annum. The note is convertible into common shares of the Company at a fixed conversion price of $0.10 per share. As of December 31, 2015, no principle has been converted into shares of stock in the Company. The Company did not record derivative liability pertaining to this note because the conversion price is greater than the fair market stock price as of December 31, 2015.\nOn March 22, 2015, the Company entered into a convertible promissory note with Chip Spear in the amount of $10,000 with an interest rate of 10% per annum. The note is convertible into common shares of the Company at a fixed conversion price of $0.25 per share. As of December 31, 2015, no principle has been converted into shares of stock in the Company. The Company did not record derivative liability pertaining to this note because the conversion price is greater than the fair market stock price as of December 31, 2015.\nOn March 2, 2015, the Company entered into a convertible promissory note with Craig Plummer in the amount of $25,000 with an interest rate of 10% per annum. The note is convertible into common shares of the Company at a fixed conversion price of $0.25 per share. As of December 31, 2015, no principle has been converted into shares of stock in the Company. The Company did not record derivative liability pertaining to this note because the conversion price is greater than the fair market stock price as of December 31, 2015.\nNeither these financial statements nor the notes have been reviewed by our auditors\nOn April 20, 2015, the Company entered into a convertible promissory note with Casey Saunders in the amount of $10,000 with an interest rate of 20% per annum. The note was paid off personally by Sylvain Desrosiers on 12/16/2016. The note remains to be convertible into common shares of the Company at a fixed conversion price of $0.25 per share. As of December 31, 2015, no principle has been converted into shares of stock in the Company. The Company did not record derivative liability pertaining to this note because the conversion price is greater than the fair market stock price as of December 31, 2015.\nOn December 12, 2014, the Company entered into a convertible promissory note with Erik Miller in the amount of $50,000 with an interest rate of 10% per annum, unsecured, and due December 12, 2015. The convertible notes principle and accrued interest may at any time be converted into shares of the Companys stock at a conversion rate equal to $0.10 per share. As of December 31, 2015, no principle has been converted into shares of stock in the Company. As of December 31, 2015, the Company recorded a derivative liability of $77,260 which was calculated using the Black Scholes Model.\nOn June 3, 2009, the Company entered into a convertible promissory note with Marflu S.A. for a total amount of $200,000. The note bears 10% interest rate per annum and has a maturity date of June 3, 2014, and is currently in default. The convertible notes principle and accrued interest may at any time be converted into shares of the Companys stock at a conversion rate fixed at $0.001 per share. As of December 31, 2015, there is a principle balance outstanding in the amount of $200,000 with accrued interest of $87,447. As of December 31, 2015, no principle has been converted into shares of stock in the Company. As of December 31, 2015, the Company recorded a derivative liability of $467,853 which was calculated using the Black Scholes Model.\nNotes payable to related parties\nBeginning on December 31, 2008, Sylvain Desrosiers, CEO has loaned various sums to the company. These are recorded as a loan from related party. The note bears a 10% interest rate per annum and has no maturity date. As of December 31, 2015, there is a principle balance outstanding in the amount of $106,205 with accrued interest of $70,969.\nNotes payable to non-related parties\nOn August 29, 2014, the Company entered into a promissory note agreement with Infinity International Holdings, LLC in the amount of $20,000 with a fixed interest payment of $20,000 interest due within 360 days.\nThe following table summarized the Companys notes payable and convertible notes payable balances as of December 31, 2015 and 2014:\nDecember 31,\nDecember 31,\nConvertible notes payable to related parties bearing interest at 10% - in default\n$ 294,712\n$ 294,712\nConvertible notes payable to non-related parties bearing interest at 10%\n390,000\n375,000\nNotes payable to related parties bearing interest at 10%\n106,205\n96,205\nTotal\n$ 790,917\n$ 765,917\nThe Company had an accrued interest balance on the notes payable in the amount of $458,243 and $387,882 as of December 31, 2015 and 2014.\nThe convertible note holders may convert at any time to common shares at a per share price stipulated in their agreement.\nNeither these financial statements nor the notes have been reviewed by our auditors\nConversion of Notes Payable\nThere were no conversions of debt in the period ended December 31, 2015. In the year ended December 31, 2014, two non-related party note holders converted a total of $16,000 of principle debt and $1,500 of accrued interest on said debt into 3,100,000 post reverse-split shares of common stock.\nNOTE 8 - SHARE EXCHANGE AGREEMENT\nOn April 17, 2012, the Company issued 200,000,000 post reverse-split shares of common stock to the sole equity owner of Southern ITS Corporation for 100% of the issued and outstanding shares of capital stock in Southern ITS. This executed share exchange agreement resulted in Southern ITS Corporation becoming a wholly-owned subsidiary of the Company.\nAddendum to Share Exchange Agreement\nOn April 30, 2013, the Company entered into an addendum with Southern ITS to amend its previously executed share exchange agreement on April 17, 2012. The addendum includes a mutually agreed upon revaluation of the consideration paid to acquire SIC whereby the new valuation will be 400,000 post reverse-split shares instead of 4,000,000 post reverse-split shares of common stock. The Company was returned the initial 4,000,000 post reverse-split shares from Southern ITS which they then canceled. The Company then issued a new certificate for 400,000 post reverse-split to the president of Southern ITS in September of 2013. The Company has restated its prior year comparative financial information to account for this revaluation.\nOn March 18, 2014, the company entered into an addendum with Southern ITS to amend its previous agreement and Southern ITS returned 400,000 post reverse-split shares of common stock to the treasury.\nNOTE 9 - OFFICER AND RELATED PARTY TRANSACTIONS\nEmployment agreements with CFO/Treasurer\nOn August 31, 2014, the Company executed an employment agreement with its CFO and Treasurer, William Noll whereby the Company issued Mr. Noll 2,000,000 post reverse-split shares of common stock for five (5) years services. As of the date of the executed employment agreement, the value of the 2,000,000 post reverse-split shares of common stock were valued at $0.06 per share which resulted in a valuation of $120,000.\nEmployment agreement with CEO\nOn August 31, 2014, the Company executed an employment agreement with its CEO, Sylvain Desrosiers, whereby the Company issued Mr. Desrosiers 10,000,000 post reverse-split shares of common stock for five (5) years services. As of the date of the executed employment agreement, the value of the 10,000,000 post reverse-split shares of common stock were valued at $0.06 per share which resulted in a valuation of $600,000.\nConvertible Notes Payable- Related Parties\nAs of December 31, 2015 and December 31, 2014, the Company has convertible notes payable with one related party company which is 100% owned by our chief executive officer. The notes have an interest rate of 10% and are convertible into shares of the Company at a fixed conversion rate of $0.025 per share. The convertible notes payable to related parties balance at December 31, 2015 and December 31, 2014 was $256,891. The note holder may convert to common shares at a fixed price of $.025 per share.\nNotes Payable to Related Parties\nAs of December 31, 2015 and December 31, 2014, the Company has a notes payable with an officer of the Company. The note bears an interest rate of 10%. The balances are $96,205 and $96,205.\nNeither these financial statements nor the notes have been reviewed by our auditors\nStock issued to Officers\nIn September of 2013, the Company issued 400,000 post reverse-split common shares and 5,000,000 preferred shares to Sylvain Desrosiers for services completed by December 31, 2013. Mr. Desrosiers is a Director of the Company.\nIn September of 2014, the Company issued 12,000,000 post reverse-split shares of common stock - 2,000,000 to our CFO and 10,000,000 to our CEO, for past services in lieu of compensation. On July 1, 2015 the company also issued to them separate five (5) year employment agreements for executive services to be provided.\nAddendum to Share Exchange Agreement\nOn April 30, 2013, the Company entered into an addendum with Southern ITS to amend its previously executed share exchange agreement. The addendum includes a mutually agreed upon revaluation of the consideration paid to acquire Southern ITS, whereby the new valuation will be 400,000 post reverse-split shares. The Company was returned the initial 400,000 post reverse-split shares from Jason Bell whom is the President of the Company and previous sole shareholder of Southern ITS. The 4,000,000 post reverse-split shares were then canceled and Mr. Bell was issued a new certificate for 400,000 post reverse-split common shares. This agreement was reversed on March 18, 2014 and Mr. Bell returned the 400,000 post reverse-split common shares to the treasury.\nCancelled Shares\nIn the year ended December 31, 2014, the Company cancelled 4,000,000 post reverse-split outstanding common shares to an officer of the Company for failing to provide contracted services.\nNOTE 10 - STOCKHOLDERS EQUITY\nCommon and preferred stock authorized\nOn April 15, 2014, the Company amended its articles of incorporation to decrease its authorized shares of common stock from Five Hundred Million (500,000,000) shares to Two Hundred Fifty Million (250,000,000) shares with par value of $0.001. On August 15, 2014, the Company amended its articles of incorporation to decrease its authorized shares of common stock from Two Hundred Fifty Million (250,000,000) shares to Fifty Million (50,000,000) shares, with a par value of $0.001.\nThe Company remains to have Ten Million (10,000,000) preferred shares with par value of $0.001 authorized. The Company designated 10,000,000 Series A Preferred Stock which have preferred voting rights equal to 500 votes for each 1 preferred share.\nCommon and preferred stock issued\nOn August 4, 2014, the Company enacted a 1-for-50 reverse stock split. The Company has adjusted all periods presented for the effects of the stock split.\nFor the year ended December 31, 2013, the Company issued 5,000,000 preferred shares and 400,000 post reversesplit common shares to a director of the Company for services completed prior to December 31, 2013. The Company valued the preferred shares at par $0.001, which resulted in an expense of $5,000. The Company valued the 400,000 post reverse-split common shares at the closing stock price on the date of issuance, September 3, 2013 at $0.11, which resulted in an expense of $44,000. The Company also issued 400,000 post reverse-split common shares to Jason Bell, the President of Company, pursuant to the addendum to the Share Exchange Agreement described in Note 8.\nAt December 31, 2013, the Company had 3,764,348 post reverse-split common shares outstanding and had 5,000,000 preferred shares outstanding.\nIn the year ended December 31, 2014, the Company cancelled 400,000 post reverse-split shares of common stock to an officer of the Company for failing to provide contracted services. The Company also issued 3,100,000 post reverse-split shares of common stock for the reduction of $1,600 of notes payable and $1,600 of accrued interest on convertible notes payable. The Company also issued 12,000,000 post reverse-split shares of common stock, 2,000,000 to our CFO and 10,000,000 to our CEO, pursuant to separate five (5) year employment agreements for executive services to be provided. The 12,000,000 post reverse-split shares were valued at the date of the agreement, $0.06, which resulted in an expense of $720,000 being recognized over the life of the employment agreements with the unearned portion recorded as a prepaid expense.\nNeither these financial statements nor the notes have been reviewed by our auditors\nOn November 17, 2015 the company issued 1,750,000 shares of restricted common stock to JJMJ Consulting. This was done in accordance with their consulting agreement. This brought the total of outstanding shares as of 12/31/2015 to 20,884,708.\nStock Warrants\nIncluded in two of our outstanding convertible notes payable are warrants to purchase our stock. They are as follows,\nWarrant 1: 1,000,000 warrants to purchase our stock at an exercise price of $0.05 per share with a 10 year life from May 1, 2010, expiring May 1, 2020.\nWarrant 2: 300,000 warrants to purchase our stock at an exercise price of $0.10 per share with a 5 year life from January 30, 2010, expiring on January 30, 2015.\nWarrants Exercisable December 31, 2013\nExercise Price ($) per share\nWeighted Average Remaining Contractual Life\nExercised Warrants\nWarrants Exercisable December 31, 2014\n1,300,000\n($0.05-$0.10)\n4.75 years\n-\n1,300,000\nNOTE 11 - CONTINGENCIES\nFrom time to time, the Company may become involved in various lawsuits and legal proceedings, which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm its business. Southern ITS International has no pending or threatened legal proceedings or administrative actions either by or against the issuer that could have a material effect on the issuers business, financial condition, or operations and any current, past or pending trading suspensions by a securities regulator.\nNOTE 12 - SUBSEQUENT EVENTS\nOn June 16, 2015 Southern ITS signed a surveillance system installation contract with a privately owned Casino Resort, located in the state of Mississippi. The currently stipulated contract amount is $1.5 million. Management feels that the final contract amount will potentially be higher, after system change orders are received during the project. The preliminary work on the project was begun in late June 2015, but management did not bill for any work until July. Revenues and costs of the project will be reported using the construction percentage of completion method, in the coming months.\nManagement is contesting certain trade accounts payable of approximately $25,000. The full amounts have been reported, but management will keep trying to reduce and resolve the outstanding balances.\nOn June 29, 2017, the Company and our President, Sylvain Desrosiers, entered into an Exchange Agreement with David McCovy whereby Mr. McCovy transferred 100% of the ownership interests in Evolution Enterprises, Inc. (Evolution) in exchange for 76,500,000 shares of common stock of Southern ITS International, Inc. As a part of the transaction, effective June 30, 2017 the Company returned the existing business, operations, assets and liabilities of the Company to Mr. Desrosiers and/or his designee, with the exception of $136,144 of promissory notes payable by the Company. Later in 2017, it was determined that Evolution had no value, and Mr. Desrosiers rescinded the Exchange Agreement. At the same time, Mr. McCovy was removed as President/CEO and a Director of the Company and Mr. Desrosiers re-assumed those positions. In October 2020 Mr. Desrosiers resigned and James E. Shipley was elected as the sole officer and director of Company. Subsequently, on July 13, 2022, the Company filed a lawsuit in Clark County Nevada District Court, Case no. A-22-855339-C, seeking cancelation of a total of 89,172,000 shares of its common stock, 76,500,000 shares of which were previously issued to Mr. McCovy arising out of the acquisition by SITS of Evolution in 2017. The remaining 12,672,000 shares of SITS common stock were caused to be issued by Mr. McCovy to his associates during the period of time that he served as CEO of the Company. Under its present management, the Company found no evidence of any payment of assets (other than the rescinded Evolution acquisition), or services received by the Company in exchange for issuance of the shares of common stock. Pursuant to a Court Order dated January 19, 2023, the Company and the Companys transfer agent canceled an aggregate of 86,225,000 shares of Company common stock, including the 76,500,00 shares owned by Mr. McCovy effective January 23, 2023.\nManagement has evaluated subsequent events pursuant to the requirements of ASC Topic 855 and has determined that no additional material subsequent events exist at the time of this report.\nNeither these financial statements nor the notes have been reviewed by our auditors Item 9. Changes in and Disagreements with Accounting and Financial Disclosures.\nNone. Item 9A. Controls and Procedures.\nDisclosure Controls and Procedures\nDisclosure controls and procedures are designed to ensure that information required to be disclosed in the reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported, within the time period specified in the SECs rules and forms, and that such information is accumulated and communicated to management, including the CEO and CFO, as appropriate, to allow timely decisions regarding required disclosures. Our management necessarily applied its judgment in assessing the costs and benefits of such controls and procedures, which, by their nature, can provide only reasonable assurance regarding managements control objectives.\nOur management, with the participation of our CEO, evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this Report. Based upon this evaluation, our CEO concluded that our disclosure controls and procedures were not effective because of the identification of a material weakness in our internal control over financial reporting which is described below.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Rule 13a-15(f). Our internal control over financial reporting is a process designed to provide reasonable assurance to our management and board of directors regarding the reliability of financial reporting and the preparation of the financial statements for external purposes in accordance with U.S. GAAP.\nOur internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP and our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on our consolidated financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. All internal control systems, no matter how well designed, have inherent limitations, including the possibility of human error and the circumvention of overriding controls. Accordingly, even effective internal control over financial reporting can provide only reasonable assurance with respect to financial statement preparation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of December 31, 2015. In making this assessment, it used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013). Based on this evaluation, management concluded that that our internal control over financial reporting was not effective as of December 31, 2015. Our CEO concluded we have a material weakness due to lack of segregation of duties, a limited corporate governance structure, and a lack of a formal management review process over preparation of financial information. A material weakness is a deficiency, or a combination of control deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis.\nOur size has prevented us from being able to employ sufficient resources to enable us to have an adequate level of supervision and segregation of duties within our system of internal control. Therefore, while there are some compensating controls in place, it is difficult to ensure effective segregation of accounting and financial reporting duties. Management reported the following material weaknesses:\nLack of segregation of duties in certain accounting and financial reporting processes including the initiation, processing, recording and approval of disbursements;\nOur corporate governance responsibilities are performed by the Board of Directors, none of whom are independent under applicable standards; we do not have an audit committee or compensation committee. Our Board of Directors acts primarily by written consent without meetings which results in several of our corporate governance functions not being performed concurrent (or timely) with the underlying transactions, including evaluation of the application of accounting principles and disclosures relating to those transactions; and\nCertain reports that we prepare, and accounting and reporting conclusions reached in connection with the financial statement preparation process are not subjected to a formal review process that includes multiple levels of review and are not submitted timely to the Board of Directors for review or approval.\nWhile we strive to segregate duties as much as practicable, there is an insufficient volume of transactions at this point in time to justify additional full-time staff. We believe that this is typical in many development-stage companies. We may not be able to fully remediate the material weakness until we commence operations at which time, we would expect to hire more staff. We will continue to monitor and assess the costs and benefits of additional staffing.\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to the SEC rules that permit us to provide only managements report in this Annual Report.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during the years ended December 31, 2015 and 2014, that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosures Regarding Foreign Jurisdictions that Prevent Inspections.\nNot Applicable.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nThe name, address and position of our present officers and directors are set forth below:\nName\nAge\nPosition\nSylvain Desrosiers\nChairman of the Board and CEO\nWilliam Noll\nChief Financial Officer/Treasurer\nDelinquent Section 16(a) Reports\nOur common stock is not registered pursuant to Section 12 of the Exchange Act of 1934, as amended (the Exchange Act). Accordingly, our officers, directors and principal stockholders are not subject to the beneficial ownership reporting requirements of Section 16(a) of the Exchange Act.\nCode of Business Conduct\nWe have not adopted a Code of Business Conduct within the meaning of Item 406(b) of Regulation S-K.\nBoard Committees\nWe do not have any Board Committees. Item 11. Executive Compensation.\nThe table below summarizes the total compensation earned by each of our named executive Officers (NEOs) for each of the fiscal years listed.\nSUMMARY COMPENSATION TABLE\nName\nPosition\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n$)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan Compensation ($)\nAll Other\nCompensation\nTotal Compensation ($)\nSylvain Desrosiers\nChairman of the Board and CEO\nWilliam Noll\nCFO and Treasurer\nDuring the past two (2) fiscal years, members of our Board of Directors were not compensated for their services. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matter.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nDirectors and Executive Officers\nThe following table sets forth the beneficial ownership (and the percentages of outstanding shares represented by such beneficial ownership) as of December 31, 2015, of (i) each director, (ii) the current NEOs named in the Summary Compensation Table contained in this Form 10-K and (iii) all current directors and executive officers as a group. Except as otherwise indicated, we believe that the beneficial owners of the common stock listed below, based on information provided by such owners, have sole investment and voting power with respect to such shares, subject to community property laws where applicable. Persons, who have the power to vote or dispose of common stock of the Company, either alone or jointly with others, are deemed to be beneficial owners of such common stock.\nName\nNumber of\nCommon\nShares\nPercent of\nCommon\nStock (1)\nNumber of Series A\nPreferred Stock\nPercent of Series A Preferred Stock\nSylvain Desrosiers\n10,413,734\n49.86 %\n5,000,000\n100 %\nWilliam Noll\n2,000,000\n9.59 %\nn/a\nCertain Stockholders\nThe following table sets forth certain information with respect to each person known by us to be the beneficial owner of five percent or more of either class of the Companys outstanding common stock. The content of this table is based upon the most current information obtained.\nName and Address of Beneficial Owner\nNumber of\nCommon\nShares\nPercent of\nCommon\nStock (1)\nSylvain Desrosiers\n7935 W. Sahara Ave.\nSuite 103\nLas Vegas, NV 89117\n10,413,734\n49.86 %\nWilliam Noll\n7935 W. Sahara Ave.\nSuite 103\nLas Vegas, NV 89117\n2,000,000\n9.59 %\n(1) Percentage of beneficial ownership and voting power is based on 20,844,708 shares of Common Stock outstanding as of December 31, 2015. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nCERTAIN RELATIONSHIPS AND RELATED PARTY TRANSACTIONS\nWe do not currently have written policies and procedures with respect to the approval of related-party transactions. There is no family relationship between any of our management and directors. We have not entered into any related party transactions.\nDIRECTOR INDEPENDENCE\nOur sole director, Sylvain Desrosier, is not considered to be an independent director.\nCommittees: Audit Committee Financial Expert.\nThe Company does not currently have an Audit Committee. Item 14. Principal Accountant Fees and Services.\nFEES TO THE COMPANYS AUDITORS\nSet forth below is a summary of certain fees paid to our independent auditor for the fiscal years 2015 and 2014.\nFee Category\nFiscal Year\nFiscal Year\nAudit Fees\n$\nAudit-Related Fees\nTax Fees\nAll Other Fees\nTotal\n$\nAudit Fees\nAudit fees were for professional services rendered in connection with the audit of our annual financial statements set forth in our Annual Reports on Form 10-K, the review of our quarterly financial statements set forth in our Quarterly Reports on Form 10-Q and consents for other SEC filings.\nAudit-Related Fees\nAudit-related fees consist of fees billed for professional services for consultation on accounting matters.\nApproval of Services Provided by Independent Registered Public Accounting Firm\nThe Board of Directors has considered whether the services provided under other non-audit services are compatible with maintaining the auditors independence and has determined that such services are compatible. The Board of Directors has adopted policies and procedures for pre-approving all non-audit work performed by the external auditors. The Board of Directors will annually pre-approve services in specified accounting areas. The Board of Directors also annually approves the budget for the annual generally accepted accounting principles (GAAP) audit.\nPART IV Item 15. Exhibit and Financial Statement Schedules.\n(a)(1) Financial Statements\nThe following documents are filed as part of this report:\nThe Financial Statements of Southern ITS International, Inc. at December 31, 2015 and 2014, are set forth on pages through of this Report.\n(2) Not applicable.\n(3) Exhibits\nEXHIBIT SCHEDULE\nExhibit\nNumber\nDocument Description\n(1)\n3.1\nArticles of Incorporation\n(1)\n3.2\nBy-laws\n(1)\n3.3\nAmendment of Articles\n(1)\n3.4\nCertificate of Designations of Series A Preferred Stock\n#\n31.1\nCertification of the Chief Executive Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n#\n31.2\nCertification of the Chief Financial Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n##\n32.1\nCertification of the Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of Sarbanes-Oxley Act of 2002.\n#\nThe following financial information from the Annual Report on Form 10-K for the year ended December 31, 2015, formatted in XBRL (eXtensible Business Reporting Language): (i) the Consolidated Balance Sheets; (ii) the Consolidated Statements of Operations; (iii) the Consolidated Statements of Stockholders Equity; (iv) the Consolidated Statements of Cash Flows; and (v) the Notes to the Consolidated Financial Statements.\n(1) Incorporated by reference from the Companys Registration Statement on Form 10 filed with the Securities and Exchange Commission on April 13, 2015.\n# Filed herewith.\n## Furnished, not filed.\nItem 16. Form 10-K Summary.\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on November 22, 2023.\nSOUTHERN ITS INTERNATIONAL, INC.\nBy:\n/s/ James E. Shipley\nJames E. Shipley\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on November 22, 2023.\nSignature\nTitle\n/s/ James E. Shipley\nPresident, Chief Executive Officer, Secretary, and Director\nJames E. Shipley\n(Principal Executive Officer and Principal Accounting Officer)"
}