{
    "cik": "1469115",
    "company": "Ridgedale Holdings Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "6510",
    "state_of_inc": "DE",
    "state_location": "GA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1469115/0001683168-23-007142-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1469115/000168316823007142/ridgedale_10k-063023.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1469115/0001683168-23-007142.txt",
    "filename": "1469115_10K_2023_0001683168-23-007142.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\nAs used in this annual report, the terms we, us, our, the Company, mean Ridgedale Holdings Inc. unless otherwise indicated.\nCautionary Note Regarding Forward-Looking Statements\nThis annual report contains forward-looking statements. These statements relate to future events or our future financial performance. These statements often can be identified by the use of terms such as may, will, expect, believe, anticipate, estimate, approximate or continue, or the negative thereof. We intend that such forward-looking statements be subject to the safe harbors for such statements. We wish to caution readers not to place undue reliance on any such forward-looking statements, which speak only as of the date made. Any forward-looking statements represent managements best judgment as to what may occur in the future. However, forward-looking statements are subject to risks, uncertainties, and important factors beyond our control that could cause actual results and events to differ materially from historical results of operations and events and those presently anticipated or projected. We disclaim any obligation subsequently to revise any forward-looking statements to reflect events or circumstances after the date of such statement or to reflect the occurrence of anticipated or unanticipated events.\nThe results anticipated by any or all of these forward-looking statements might not occur. Important factors, uncertainties, and risks that may cause actual results to differ materially from these forward-looking statements include those described in ITEM 1A. RISK FACTORS\nWe need to find financing for our business idea, which is uncertain and risky.\nOur plan of operation is to obtain debt or equity finance to meet our ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There can be no assurance that any of the events can be successfully completed, that any such business will be identified, or that any stockholder will realize any return on their shares after such a transaction has been completed. In particular, there is no assurance that any such business will be located or that any stockholder will realize any return on their shares after such a transaction. Any merger or acquisition completed by us can be expected to have a significant dilutive effect on the percentage of shares held by our current stockholders.\nWe believe we are an insignificant participant among the firms which engage in the acquisition of business opportunities. There are many established venture capital and financial concerns that have significantly greater financial and personnel resources and technical expertise than we have. Given our limited financial resources and limited management availability, we will continue to be at a significant competitive disadvantage compared to our competitors.\nYou should be aware that there are various risks associated with our business, including the risks discussed below. You should carefully consider these risk factors, as well as the other information contained in this Registration Statement, in evaluating our business and us.\nRather than our previous operating business, our business is now to seek to raise the debt and/or equity to meet our ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There can be no assurance that this series of events will be successfully completed or that any stockholder will realize any return on their shares after the new business plan has been implemented.\nRISKS RELATED TO OUR COMPANY\nWE HAVE INCURRED SIGNIFICANT LOSSES AND ANTICIPATE FUTURE LOSSES.\nAs of June 30, 2023, we had negative working capital of $166,721 and an accumulated deficit of $3,652,982.\nFuture losses are likely to occur as, until we can merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders as we have no sources of income to meet our operating expenses. As a result of these, among other factors, we received from our registered independent public accountants in their report for the financial statements for the year ended June 30, 2023 and 2022, an explanatory paragraph stating that there is substantial doubt about our ability to continue as a going concern.\nOUR EXISTING FINANCIAL RESOURCES ARE INSUFFICIENT TO MEET OUR ONGOING OPERATING EXPENSES.\nWe have no sources of income at this time and no existing cash balances to meet our ongoing operating expenses. In the short term, unless we are able to raise additional debt and/or equity we shall be unable to meet our ongoing operating expenses. On a longer-term basis, we intend to raise the debt and/or equity to meet our ongoing operating expenses and merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There can be no assurance that this series of events will be successfully completed.\nWE INTEND TO PURSUE THE ACQUISITION OF AN OPERATING BUSINESS.\nOur sole strategy is to acquire an operating business. Successful implementation of this strategy depends on our ability to identify a suitable acquisition candidate, acquire such a company on acceptable terms and integrate its operations. In pursuing acquisition opportunities, we compete with other companies with similar strategies. Competition for acquisition targets may result in increased prices of acquisition targets and a diminished pool of companies available for acquisition. Acquisitions involve a number of other risks, including risks of acquiring undisclosed or undesired liabilities, acquired in-process technology, stock compensation expense, diversion of management attention, potential disputes with the seller of one or more acquired entities and possible failure to retain key acquired personnel. Any acquired entity or assets may not perform relative to our expectations. Our ability to meet these challenges has not been established.\nSCARCITY OF, AND COMPETITION FOR, BUSINESS OPPORTUNITIES AND COMBINATIONS.\nWe believe we are an insignificant participant among the firms which engage in the acquisition of business opportunities. There are many established venture capital and financial concerns that have significantly greater financial and personnel resources and technical expertise than we have. Nearly all such entities have significantly greater financial resources, technical expertise and managerial capabilities than us and, consequently, we will be at a competitive disadvantage in identifying possible business opportunities and successfully completing a business combination. Moreover, we will also compete in seeking merger or acquisition candidates with numerous other small public companies. In view of our limited financial resources and limited management availability, we will continue to be at a significant competitive disadvantage compared to our competitors.\nWE HAVE NOT EXECUTED ANY FORMAL AGREEMENT FOR A BUSINESS COMBINATION OR OTHER TRANSACTION AND HAVE ESTABLISHED NO STANDARDS FOR BUSINESS COMBINATIONS.\nWe have not executed any formal arrangement, agreement or understanding with respect to engaging in a merger with, joint venture with or acquisition of a private or public entity. There can be no assurance that we will be successful in identifying and evaluating suitable business opportunities or in concluding a business combination. We have not identified any particular industry or specific business within an industry for evaluation. There is no assurance we will be able to negotiate a business combination on terms favorable, if at all. We have not established a specific length of operating history or specified level of earnings, assets, net worth or other criteria which we will require a target business opportunity to have achieved, and without which we would not consider a business combination. Accordingly, we may enter into a business combination with a business opportunity having no significant operating history, losses, limited or no potential for earnings, limited assets, negative net worth or other negative characteristics.\nWE MAY BE NEGATIVELY AFFECTED BY ADVERSE GENERAL ECONOMIC CONDITIONS.\nCurrent conditions in domestic and global economies are extremely uncertain. Adverse changes may occur as a result of softening global economies, wavering consumer confidence caused by the threat of terrorism and war, and other factors capable of affecting economic conditions. Such changes could have a material adverse effect on our business, financial condition, and the results of operations.\nBECAUSE OUR PRINCIPAL SHAREHOLDER CONTROLS OUR ACTIVITIES, HE MAY CAUSE US TO ACT IN A MANNER THAT IS MOST BENEFICIAL TO HIMSELF AND NOT TO OTHER SHAREHOLDERS WHICH COULD CAUSE US NOT TO TAKE ACTIONS THAT OUTSIDE INVESTORS MIGHT VIEW FAVORABLY.\nOur principal shareholder has voting authority for approximately seventy-eight percent (78%) of our outstanding common stock. As a result, he effectively controls all matters requiring stockholder approval, including the election of directors, the approval of significant corporate transactions, such as mergers and related party transactions. These insiders also can delay or perhaps even block, by their ownership of our stock, an unsolicited tender offer. This concentration of ownership could have the effect of delaying, deterring or preventing a change in control of our company that you might view favorably.\nOUR DIRECTORS MAY HAVE CONFLICTS OF INTEREST WHICH MAY NOT BE RESOLVED FAVORABLY TO US.\nCertain conflicts of interest may exist between our sole director and us. Our sole Director has other business interests to which he devotes his attention and may be expected to continue to do so although management time should be devoted to our business. As a result, conflicts of interest may arise that can be resolved only through exercise of such judgment as is consistent with our fiduciary duties to us. See \"Directors and Executive Officers\" (page 26 below), and \"Conflicts of Interest.\" (page 28 below).\nWE MAY DEPEND UPON OUTSIDE ADVISORS; WHO MAY NOT BE AVAILABLE ON REASONABLE TERMS AND AS NEEDED.\nTo supplement the business experience of our officers and directors, we may be required to employ accountants, technical experts, appraisers, attorneys, or other consultants or advisors. Our Board, without any input from stockholders will make the selection of any such advisors. Furthermore, it is anticipated that such persons may be engaged on an \"as needed\" basis without a continuing fiduciary or other obligation to us. In the event we consider it necessary to hire outside advisors, we may elect to hire persons who are affiliates, if they are able to provide the required services.\nWE ARE AN EMERGING GROWTH COMPANY, AND ANY DECISION ON OUR PART TO COMPLY ONLY WITH CERTAIN REDUCED DISCLOSURE REQUIREMENTS APPLICABLE TO EMERGING GROWTH COMPANIES COULD MAKE OUR COMMON STOCK LESS ATTRACTIVE TO INVESTORS.\nWe are an emerging growth company, as defined in the JOBS Act, and, for as long as we continue to be an emerging growth company, we expect and fully intend to take advantage of exemptions from various reporting requirements applicable to other public companies but not to emerging growth companies, including, but not limited to, not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act of 2002, reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements, and exemptions from the requirements of holding a nonbinding advisory vote on executive compensation and shareholder approval of any golden parachute payments not previously approved. We could be an emerging growth company for up to five years, or until the earliest of (i) the last day of the first fiscal year in which our annual gross revenues exceed $1 billion, (ii) the date that we become a large accelerated filer as defined in Rule 12b-2 under the Exchange Act, which would occur if the market value of our common stock that is held by non-affiliates exceeds $700 million as of the last business day of our most recently completed second fiscal quarter, or (iii) the date on which we have issued more than $1 billion in non-convertible debt during the preceding three year period.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)2(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We have elected to opt for the extended transition period for complying with the revised accounting standards. We have elected to rely on these exemptions and reduced disclosure requirements applicable to emerging growth companies and expect to continue to do so.\nWE MAY NOT BE ABLE TO MEET THE FILING AND INTERNAL CONTROL REPORTING REQUIREMENTS IMPOSED BY THE SEC, WHICH MAY RESULT IN A DECLINE IN THE PRICE OF OUR COMMON SHARES AND AN INABILITY TO OBTAIN FUTURE FINANCING.\nAs directed by Section 404 of the Sarbanes-Oxley Act, as amended by SEC Release No. 33-8934 on June 26, 2008, the SEC adopted rules requiring each public company to include a report of management on the companys internal controls over financial reporting in its annual reports. In addition, the independent registered public accounting firm auditing a companys financial statements may have to also attest to and report on managements assessment of the effectiveness of the companys internal controls over financial reporting. We may be required to include a report of management on its internal control over financial reporting. The internal control report must include a statement.\n· Of managements responsibility for establishing and maintaining adequate internal control over its financial reporting;\n· Of managements assessment of the effectiveness of its internal control over financial reporting as of year-end; and\n· Of the framework used by management to evaluate the effectiveness of our internal control over financial reporting.\nFurthermore, our independent registered public accounting firm may be required to file its attestation on whether it believes that we have maintained, in all material respects, effective internal control over financial reporting.\nWhile we expect to expend significant resources in developing the necessary documentation and testing procedures required by Section 404 of the Sarbanes-Oxley Act, there is a risk that we may not be able to comply timely with all of the requirements imposed by this rule. In the event that we are unable to receive a positive attestation from our independent registered public accounting firm with respect to our internal controls, investors and others may lose confidence in the reliability of our financial statements and our stock price and ability to obtain equity or debt financing as needed could suffer.\nIn addition, in the event that our independent registered public accounting firm is unable to rely on our internal controls in connection with its audit of our financial statements, and in the further event that it is unable to devise alternative procedures in order to satisfy itself as to the material accuracy of our financial statements and related disclosures, it is possible that we would be unable to file our Annual Report on Form 10-K with the SEC, which could also adversely affect the market price of our common stock and our ability to secure additional financing as needed.\nREPORTING REQUIREMENTS UNDER THE EXCHANGE ACT AND COMPLIANCE WITH THE SARBANES-OXLEY ACT OF 2002, INCLUDING ESTABLISHING AND MAINTAINING ACCEPTABLE INTERNAL CONTROLS OVER FINANCIAL REPORTING, ARE COSTLY AND MAY INCREASE SUBSTANTIALLY.\nThe rules and regulations of the SEC require a public company to prepare and file periodic reports under the Exchange Act, which will require that the Company engage legal, accounting, auditing and other professional services. The engagement of such services is costly. Additionally, the Sarbanes-Oxley Act of 2002 (the Sarbanes-Oxley Act) requires, among other things, that we design, implement and maintain adequate internal controls and procedures over financial reporting. The costs of complying with the Sarbanes-Oxley Act and the limited technically qualified personnel we have may make it difficult for us to design, implement and maintain adequate internal controls over financial reporting. In the event that we fail to maintain an effective system of internal controls or discover material weaknesses in our internal controls, we may not be able to produce reliable financial reports or report fraud, which may harm our overall financial condition and result in loss of investor confidence and a decline in our share price.\nAs a public company, we will be subject to the reporting requirements of the Exchange Act, the Sarbanes-Oxley Act, the Dodd-Frank Act of 2010 and other applicable securities rules and regulations. Despite recent reforms made possible by the JOBS Act, compliance with these rules and regulations will nonetheless increase our legal and financial compliance costs, make some activities more difficult, time-consuming or costly and increase demand on our systems and resources, particularly after we are no longer an emerging growth company. The Exchange Act requires, among other things, that we file annual, quarterly, and current reports with respect to our business and operating results.\nWe are working with our legal, accounting and financial advisors to identify those areas in which changes should be made to our financial and management control systems to manage our growth and our obligations as a public company. These areas include corporate governance, corporate control, disclosure controls and procedures and financial reporting and accounting systems. We have made, and will continue to make, changes in these and other areas. However, we anticipate that the expenses that will be required in order to adequately prepare for being a public company could be material. We estimate that the aggregate cost of increased legal services; accounting and audit functions; personnel, such as a chief financial officer familiar with the obligations of public company reporting; consultants to design and implement internal controls; and financial printing alone will be a few hundred thousand dollars per year and could be several hundred thousand dollars per year. In addition, if and when we retain independent directors and/or additional members of senior management, we may incur additional expenses related to director compensation and/or premiums for directors and officers liability insurance, the costs of which we cannot estimate at this time. We may also incur additional expenses associated with investor relations and similar functions, the cost of which we also cannot estimate at this time. However, these additional expenses individually, or in the aggregate, may also be material.\nIn addition, being a public company could make it more difficult or more costly for us to obtain certain types of insurance, including directors and officers liability insurance, and we may be forced to accept reduced policy limits and coverage or incur substantially higher costs to obtain the same or similar coverage. The impact of these events could also make it more difficult for us to attract and retain qualified persons to serve on our board of directors, our board committees or as executive officers.\nThe increased costs associated with operating as a public company may decrease our net income or increase our net loss and may cause us to reduce costs in other areas of our business or increase the prices of our products or services to offset the effect of such increased costs. Additionally, if these requirements divert our managements attention from other business concerns, they could have a material adverse effect on our business, financial condition and results of operations.\nTHE JOBS ACT ALLOWS US TO DELAY THE ADOPTION OF NEW OR REVISED ACCOUNTING STANDARDS THAT HAVE DIFFERENT EFFECTIVE DATES FOR PUBLIC AND PRIVATE COMPANIES.\nSince, we have elected to use the extended transition period for complying with new or revised accounting standards under Section 102(b)(1) of the JOBS Act, this election allows us to delay the adoption of new or revised accounting standards that have different effective dates for public and private companies until those standards apply to private companies. As a result of this election, our financial statements may not be comparable to companies that comply with public company effective dates.\nWE HAVE A MATERIAL WEAKNESS IN OUR CONTROLS AND PROCEDURES.\nWe have conducted an evaluation of our internal control over financial reporting based on the framework in Internal Control Integrated Framework issued by the Committee of Sponsoring Organizations for the Treadway Commission (COSO) and published in 2013, and subsequent guidance prepared by COSO specifically for smaller public companies. Based on that evaluation, management concluded that our internal control over financial reporting was not sufficient as of June 30, 2023 and 2022 for the reasons discussed below:\nA significant deficiency is a deficiency, or combination of deficiencies in internal control over financial reporting, that adversely affects the entitys ability to initiate, authorize, record, process, or report financial data reliably in accordance with generally accepted accounting principles such that there is more than a remote likelihood that a misstatement of the entitys financial statements that is more than inconsequential will not be prevented or detected by the entitys internal control.\nA material weakness is a deficiency or a combination of deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis.\nManagement identified the following material weakness and significant deficiencies in its assessment of the effectiveness of internal control over financial reporting as of June 30, 2023:\n· The Company did not maintain effective controls over certain aspects of the financial reporting process because we lacked personnel with accounting expertise and an adequate supervisory review structure that is commensurate with our financial reporting requirements.\n· Material Weakness - Inadequate segregation of duties.\nThe management of the Company believes that these material weaknesses will remain until such time that the Company has the resources to increase the number of personnel committed to the performance of its financial duties that such weaknesses can be specifically addressed. This will include, but not limited to, the following:\n· Hiring of additional personnel to adequately segregate financial reporting duties.\n· The retention of outside consultants to review our controls and procedures.\nRISKS RELATED TO OUR SECURITIES\nREDUCTION OF PERCENTAGE SHARE OWNERSHIP FOLLOWING BUSINESS COMBINATION AND DILUTION TO STOCKHOLDERS.\nOur primary plan of operation is based upon a business combination with a private concern which, in all likelihood, would result in us issuing securities to stockholders of such a private company. The issuance of previously authorized and unissued shares of our common stock would result in a reduction in percentage of shares owned by present and prospective stockholders and may result in a change in control or management. In addition, any merger or acquisition can be expected to have a significant dilutive effect on the percentage of the shares held by our stockholders.\nTHE REGULATION OF PENNY STOCKS BY SEC AND NASD MAY HAVE AN EFFECT ON THE TRADABILITY OF OUR SECURITIES.\nOur securities are currently traded on the Over the Counter market with a designation of Pink No Information, and we are seeking to have them upgraded to Pink - Current Information. Our shares are subject to a Securities and Exchange Commission rule that imposes special sales practice requirements upon broker-dealers who sell such securities to persons other than established customers or accredited investors. For purposes of the rule, the phrase \"accredited investors\" means, in general terms, institutions with assets in excess of $5,000,000, or individuals having a net worth in excess of $1,000,000 or having an annual income that exceeds $200,000 (or that, when combined with a spouse's income, exceeds $300,000).\nFor transactions covered by the rule, the broker-dealer must make a special suitability determination for the purchaser and receive the purchaser's written agreement to the transaction prior to the sale. Consequently, the rule may affect the ability of broker-dealers to sell our securities and also may affect the ability of purchasers in this offering to sell their securities in any market that might develop, therefore.\nIn addition, the Securities and Exchange Commission has adopted a number of rules to regulate \"penny stocks.\" Such rules include Rules 3a51-1, 15g-1, 15g-2, 15g-3, 15g-4, 15g-5, 15g-6, 15g-7, and 15g-9 under the Securities and Exchange Act of 1934, as amended. Because our securities constitute \"penny stocks\" within the meaning of the rules, the rules would apply to us and to our securities. The rules may further affect the ability of owners of shares to sell our securities in any market that might develop for them.\nShareholders should be aware that, according to the Securities and Exchange Commission, the market for penny stocks has suffered in recent years from patterns of fraud and abuse. Such patterns include (i) control of the market for the security by one or a few broker-dealers that are often related to the promoter or issuer; (ii) manipulation of prices through prearranged matching of purchases and sales and false and misleading press releases; (iii) \"boiler room\" practices involving high-pressure sales tactics and unrealistic price projections by inexperienced sales persons; (iv) excessive and undisclosed bid-ask differentials and markups by selling broker-dealers; and (v) the wholesale dumping of the same securities by promoters and broker-dealers after prices have been manipulated to a desired consequent investor losses. Our management is aware of the abuses that have occurred historically in the penny stock market. Although we do not expect to be in a position to dictate the behavior of the market or of broker-dealers who participate in the market, management will strive within the confines of practical limitations to prevent the described patterns from being established with respect to our securities.\nThe shares of our common stock may be thinly traded on the Pink Sheets, meaning that the number of persons interested in purchasing our shares of common stock at or near ask prices at any given time may be relatively small or non-existent. This situation is attributable to a number of factors, including the fact that we are a small company which is relatively unknown to stock analysts, stock brokers, institutional investors and others in the investment community that generate or influence sales volume, and that even if we came to the attention of such persons, they tend to be risk-averse and would be reluctant to follow an unproven, early stage company such as ours or purchase or recommend the purchase of our shares of common stock until such time as we became more seasoned and viable. As a consequence, there may be periods of several days or more when trading activity in our shares of common stock is minimal or non-existent, as compared to a seasoned issuer which has a large and steady volume of trading activity that will generally support continuous sales without an adverse effect on Securities price.\nOUR STOCK WILL IN ALL LIKELIHOOD BE THINLY TRADED AND AS A RESULT YOU MAY BE UNABLE TO SELL AT OR NEAR ASK PRICES OR AT ALL IF YOU NEED TO LIQUIDATE YOUR SHARES.\nWe cannot give you any assurance that a broader or more active public trading market for our shares of common stock will develop or be sustained, or that any trading levels will be sustained. Due to these conditions, we can give investors no assurance that they will be able to sell their shares of common stock at or near ask prices or at all if you need money or otherwise desire to liquidate your shares of common stock of our Company.\nOTC MARKETS CURRENTLY DISPLAYS A PINK LIMITED INFORMATION SIGN.\nOTC Markets Group designates certain securities as Pink No Information and places a YIELD Sign icon next to the stock symbol to inform investors that the Company has posted limited information through the OTC Markets Disclosure & News service or is late in its filing obligations with the SEC. This is to inform investors there may be reason to exercise additional caution and perform thorough due diligence before making an investment decision in that security.\nOTC Markets will continue to display Pink Limited Information on its securities OTC Markets pages until adequate current information is made available by the issuer pursuant to the Alternative Reporting Standard or by the SEC Reporting Standard, and until OTC Markets believes there is no longer a public interest concern. Investors are encouraged to use caution and due diligence in their investment decisions.\nThe Company is approved for the OTC Markets for its OTC IQ disclosure program. The Company may or may not necessarily continue to disclose information through the OTC IQ program.\nRULE 144 IS NOT AVAILABLE TO DEVELOPMENT STAGE (SHELL) COMPANIES.\nRule 144 provides an exemption from registration allowing for the resale of previously unregistered securities subject to certain conditions being met. However, Rule 144 is unavailable to securities of issuers with no or nominal operations and no or nominal non-cash assets. As a result, holders of our securities which have not been previously registered, or received an exemption from registration, will not be able to sell their securities until such time as the conditions required by Rule 144 have been met.\nRULE 144 SALES IN THE FUTURE MAY HAVE A DEPRESSIVE EFFECT ON OUR STOCK PRICE.\nRule 144 provides in essence that a person who has held restricted securities for one year may, under certain conditions, sell every three months, in brokerage transactions, a number of Shares that does not exceed the greater of 1.0% of a company's outstanding common stock or the average weekly trading volume during the four calendar weeks prior to the sale. There is no limit on the amount of restricted securities that may be sold by a nonaffiliate after the owner has held the restricted securities for a period of two years. A sale under Rule 144 or under any other exemption from the Act, may have a depressive effect upon the price of the common stock in any market that may develop.\nTHE PRICE OF OUR COMMON STOCK COULD BE HIGHLY VOLATILE.\nOur shares are currently listed on the Over the Counter (OTC) market. Due to this listing on the OTC market it is likely that our common stock will be subject to price volatility, low volumes of trades and large spreads in bid and ask prices quoted by market makers. Due to the low volume of shares traded on any trading day, persons buying or selling in relatively small quantities may easily influence the prices of our common stock. This low volume of trades could also cause the price of our stock to fluctuate greatly, with large percentage changes in price occurring in any trading day session. Holders of our common stock may also not be able to readily liquidate their investment or may be forced to sell at depressed prices due to low volume trading. If high spreads between the bid and ask prices of our common stock exist at the time of a purchase, the stock would have to appreciate substantially on a relative percentage basis for an investor to recoup their investment. Broad market fluctuations and general economic and political conditions may also adversely affect the market price of our common stock. No assurance can be given that an active market in our common stock will develop or be sustained. If an active market does not develop, holders of our common stock may be unable to readily sell the shares they hold or may not be able to sell their shares at all.\nLOSS OF CONTROL BY OUR PRESENT MANAGEMENT AND STOCKHOLDERS MAY OCCUR UPON THE ISSUANCE OF ADDITIONAL SHARES.\nWe may issue further shares as consideration for the cash or assets or services out of our authorized but unissued common stock that would, upon issuance, represent a majority of our voting power and equity. The result of such an issuance would be those new stockholders and management would control us, and persons unknown could replace our management at this time. Such an occurrence would result in a greatly reduced percentage of ownership of us by our current Shareholders.\nIF THE REGISTRATION OF OUR COMMON STOCK IS REVOKED IN THE FUTURE, OUR BUSINESS OPPORTUNITIES WILL CEASE TO EXIST.\nIn the event our securities registration was to be revoked, we would not have the ability to raise money through the issuance of shares and would lose the ability to continue the business plan set out in this filing. Common stock issued and outstanding at that time would no longer be tradable.\nWE DO NOT ANTICIPATE PAYING CASH DIVIDENDS ON OUR COMMON STOCK.\nWe do not anticipate paying any cash dividends on our common stock in the foreseeable future.\nWE MAY BE UNSUCCESSFUL IN FINDING A MERGER THAT CAN BE ACCOMPLISHED WITH POSITIVE LONG-TERM RESULTS.\nThe business of selecting and entering into a merger is fraught with all kinds of issues. For instance, the business may need capital that is never achieved, the management is not capable of carrying the business forward successfully, the business plan is ill-conceived, and not executed, or competitive factors cause business failure. There are many other factors in addition to these, as may have been discussed above in Risk Factors which could cause our Company to fail and the investors capital will be at risk. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable. ITEM 2. PROPERTIES\nThe Companys principal business and corporate address is 2030 Powers Ferry Rd. SE, Suite #212 Atlanta, Georgia 30339. ITEM 3. LEGAL PROCEEDINGS\nWe are not currently involved in any legal proceedings and we are not aware of any pending or potential legal actions. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS\nMarket Information\nOur Common Stock is not listed on any securities exchange and is quoted on the OTC Pink Market under the symbol RDGH. Such quotations reflect inter-dealer prices, without retail markup, mark-down, or commission and do not necessarily represent actual transactions.\nHolders\nAs of October 13, 2023 there were 64 shareholders of record of the Companys Common Stock based upon the records of the shareholders provided by the Companys transfer agent. The Companys transfer agent is Empire Stock Transfer, Inc., 1859 Whitney Mesa Dr., Henderson, NV 89014. Their telephone number is (702) 818-5898 / (702) 974-1444 fax.\nDividends\nWe have never paid or declared any dividends on our Common Stock and do not anticipate paying cash dividends in the foreseeable future.\nSecurities Authorized For Issuance Under Equity Compensation Plans\nWe currently do not have any equity compensation plans.\nUnregistered Sales of Equity Securities\nWe have previously disclosed all sales of securities without registration under the Securities Act of 1933. ITEM 6. SELECTED FINANCIAL DATA\nNot Applicable. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULT OF OPERATIONS\nThe Company has no operations or revenue as of the date of this Report. We are currently in the process of developing a business plan. Management intends to explore and identify viable business opportunities within the U.S. including seeking to acquire a business in a reverse merger. Our ability to effectively identify, develop and implement a viable plan for our business may be hindered by risks and uncertainties which are beyond our control, including without limitation, the continued negative effects of the coronavirus pandemic on the U.S. and global economies. For more information about the risk of Covid-19 on our business, see Item 1A Risk Factors.\nPlan of Operation\nThe Company has no operations from a continuing business other than the expenditures related to running the Company and has no revenue from continuing operations as of the date of this Report.\nManagement intends to explore and identify business opportunities within the U.S., including a potential acquisition of an operating entity through a reverse merger, asset purchase, or similar transaction. Our Chief Executive Officer has experience in business consulting, although no assurances can be given that he can identify and implement a viable business strategy or that any such strategy will result in profits. Our ability to effectively identify, develop and implement a viable plan for our business may be hindered by risks and uncertainties which are beyond our control, including without limitation, the continued negative effects of the coronavirus pandemic on the U.S. and global economies. For more information about the risk of coronavirus on our business, see Item 1A Risk Factors.\nWe do not currently engage in any business activities that provide revenue or cash flow. During the next 12-month period we anticipate incurring costs in connection with investigating, evaluating, and negotiating potential business combinations, filing SEC reports, and consummating an acquisition of an operating business.\nGiven our limited capital resources, we may consider a business combination with an entity which has recently commenced operations, is a developing company or is otherwise in need of additional funds for the development of new products or services or expansion into new markets, or is an established business experiencing financial or operating difficulties and is in need of additional capital. Alternatively, a business combination may involve the acquisition of, or merger with, an entity which desires access to the U.S. capital markets.\nAs of the date of this Report, our management has not had any discussions with any representative of any other entity regarding a potential business combination. Any target business that is selected may be financially unstable or in the early stages of development. In such event, we expect to be subject to numerous risks inherent in the business and operations of a financially unstable or early-stage entity. In addition, we may effect a business combination with an entity in an industry characterized by a high level of risk or in which our management has limited experience, and, although our management will endeavor to evaluate the risks inherent in a particular target business, there can be no assurance that we will properly ascertain or assess all significant risks.\nOur management anticipates that we will likely only be able to effect one business combination due to our limited capital. This lack of diversification will likely pose a substantial risk in investing in the Company for the indefinite future because it will not permit us to offset potential losses from one venture or operating territory against gains from another. The risks we face will likely be heightened to the extent we acquire a business operating in a single industry or geographical region.\nWe anticipate that the selection of a business combination will be a complex and risk-prone process. Because of general economic conditions, including unfavorable conditions caused by the coronavirus pandemic, rapid technological advances being made in some industries and shortages of available capital, management believes that there are a number of firms seeking business opportunities at this time at discounted rates with which we will compete. We expect that any potentially available business combinations may appear in a variety of different industries or regions and at various stages of development, all of which will likely render the task of comparative investigation and analysis of such business opportunities extremely difficult and complicated. Once we have developed and begun to implement our business plan, management intends to fund our working capital requirements through a combination of our existing funds and future issuances of debt or equity securities. Our working capital requirements are expected to increase in line with the implementation of a business plan and commencement of operations.\nBased upon our current operations, we do not have sufficient working capital to fund our operations over the next 12 months. If we are able to close a reverse merger, it is likely we will need capital as a condition of closing that acquisition. Because of the uncertainties, we cannot be certain as to how much capital we need to raise or the type of securities we will be required to issue. In connection with a reverse merger, we will be required to issue a controlling block of our securities to the targets shareholders which will be very dilutive.\nAdditional issuances of equity or convertible debt securities will result in dilution to our current shareholders. Further, such securities might have rights, preferences, or privileges senior to our Common Stock. Additional financing may not be available upon acceptable terms, or at all. If adequate funds are not available or are not available on acceptable terms, we may not be able to take advantage of prospective new business endeavors or opportunities, which could significantly and materially restrict our business operations.\nWe anticipate that we will incur operating losses in the next 12 months, principally costs related to our being obligated to file reports with the SEC. Our prospects must be considered in light of the risks, expenses and difficulties frequently encountered by companies in their early stage of development. Such risks for us include, but are not limited to, an evolving and unpredictable business model, recognition of revenue sources, and the management of growth. To address these risks, we must, among other things, develop, implement, and successfully execute our business and marketing strategy, respond to competitive developments, and attract, retain, and motivate qualified personnel. There can be no assurance that we will be successful in addressing such risks, and the failure to do so could have a material adverse effect on our business prospects, financial condition, and results of operations.\nCOVID-19 Update\nTo date, the COVID-19 pandemic has not had a material impact on the Company, particularly due to our current lack of operations. The pandemic may, however, have an impact on our ability to evaluate and acquire an operating entity through a reverse merger or otherwise. See Item 1A Risk Factors for more information.\nOff Balance Sheet Arrangements\nAs of the date of this Report, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nGoing Concern\nThe independent registered public accounting firm auditors report accompanying our June 30, 2023 and June 30, 2022 financial statements contained an explanatory paragraph expressing substantial doubt about our ability to continue as a going concern. The financial statements have been prepared assuming that we will continue as a going concern, which contemplates that we will realize our assets and satisfy our liabilities and commitments in the ordinary course of business. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Ridgedale Holdings Inc. (Formerly UAN Power Corp.)\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Ridgedale Holdings Inc. as of June 30, 2023 and 2022, the related statements of operations, stockholders' equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Company's ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matter\nCritical audit matters are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments.\nWe determined that there are no critical audit matters.\n/S/ BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Company's auditor since\nLakewood, CO\nOctober 13, 2023\nRIDGEDALE HOLDINGS INC.\nBALANCE SHEETS\nJune 30, June 30,\nASSETS\nCash $ 3,647 $ 9,146\nTotal Assets $ 3,647 $ 9,146\nLIABILITIES & STOCKHOLDERS' DEFICIT\nCurrent liabilities\nAccounts payable and accrued liabilities $ 593 $ -\nNotes payable related party 119,660 75,000\nAccrued interest payable 50,115 18,188\nTotal current liabilities 170,368 93,188\nTotal liabilities 170,368 93,188\nCommitments and Contingencies - -\nStockholders' Deficit\nPreferred stock, Par Value $0.00001, 20,000,000 shares authorized, -0- shares and 200,000 issued and outstanding as of June 30, 2023 and June 30, 2022, respectively -\nCommon stock, Par Value $0.00001, 400,000,000 shares authorized, 1,670,000 and 410,000 issued and outstanding as of June 30, 2023 and June 30, 2022, respectively\nAdditional paid in capital 3,486,244 3,473,255\nAccumulated deficit (3,652,982 ) (3,557,302 )\nTotal Stockholders' (Deficit) (166,721 ) (84,041 )\nTotal Liabilities and Stockholders' (Deficit) $ 3,647 $ 9,146\nThe accompanying notes are an integral part of these financial statements.\nRIDGEDALE HOLDINGS INC.\nSTATEMENTS OF OPERATIONS\nYear Ended Year Ended\nJune 30, June 30,\nRevenue $ - $ -\nOperating Expenses:\nAdministrative expenses 63,751 50,036\nTotal operating expenses 63,751 50,036\n(Loss) from operations (63,751 ) (50,036 )\nOther (expense) income\nInterest expense 31,929 15,979\nOther expense, net (31,929 ) (15,979 )\nIncome (loss) before provision for income taxes (95,680 ) (66,014 )\nProvision for income taxes - -\nNet (Loss) $ (95,680 ) $ (66,014 )\nBasic and diluted earnings(loss) per common share $ (0.06 ) $ (0.16 )\nWeighted average number of shares outstanding 1,670,000 410,000\nThe accompanying notes are an integral part of these financial statements.\nRIDGEDALE HOLDINGS INC.\nSTATEMENT OF CHANGES IN STOCKHOLDERS' EQUITY\nAdditional\nTotal\nPreferred stock Common Stock Paid-in Accumulated Stockholders'\nShares Value Shares Value Capital Deficit Equity\nBalance, June 30, 2021 200,000 $ 2 394,157 $ 4 $ 3,473,255 $ (3,491,288 ) $ (18,027 )\nReverse split rounding adjustment - - 15,843 - - - -\nNet loss - - - - - (66,014 ) (66,014 )\nBalance, June 30, 2022 200,000 $ 2 410,000 $ 4 $ 3,473,255 $ (3,557,302 ) $ (84,041 )\nAdditional\nTotal\nPreferred stock Common Stock Paid-in Accumulated Stockholders'\nShares Value Shares Value Capital Deficit Equity\nBalance, June 30, 2022 200,000 $ 2 410,000 $ 4 $ 3,473,255 $ (3,557,302 ) $ (84,041 )\nConversion of preferred stock to common stock -related party (200,000 ) (2 ) 1,000,000 (8 ) - -\nPrivate placement of common shares - - 40,000 - 2,000 - 2,000\nPrivate placement of common shares - - 220,000 10,998 - 11,000\nNet loss - - - - - (95,680 ) (95,680 )\nBalance, June 30, 2023 - $ - 1,670,000 $ 17 $ 3,486,244 $ (3,652,982 ) $ (166,721 )\nThe accompanying notes are an integral part of these financial statements.\nRIDGEDALE HOLDINGS INC.\nSTATEMENTS OF CASH FLOWS\nYear Ended Year Ended\nJune 30, June 30,\nCash Flows From Operating Activities:\nNet loss $ (95,680 ) $ (66,014 )\nAdjustments to reconcile net income to net cash provided by (used for) operating activities\nAccounts payable and accrued liabilities (8,000 )\nAccrued interest 31,928 15,979\nNet cash provided by (used for) operating activities (63,159 ) (58,036 )\nCash Flows From Investing Activities:\nNet cash provided by (used in) investing activities - -\nCash Flows From Financing Activities:\nProceeds from private placement of common stock 13,000 -\nNotes payable related parties 44,660 55,000\nNet cash provided by financing activities 57,660 55,000\nNet (Decrease) In Cash (5,499 ) (3,036 )\nCash At The Beginning Of The Period 9,146 12,182\nCash At The End Of The Period $ 3,647 $ 9,146\nThe accompanying notes are an integral part of these financial statements.\nRIDGEDALE HOLDINGS INC.\nNOTES TO FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION AND DESCRIPTION OF BUSINESS\nRidgedale Holdings Inc., a Delaware corporation, (Ridgedale Holdings, we,\" \"us,\" or our) is a publicly quoted shell company seeking to create value for its shareholders by merging with another entity with experienced management and opportunities for growth in return for shares of our common stock.\nNo potential merger candidate has been identified at this time.\nOur Company was incorporated in the State of Nevada on May 8, 2009, as Gulf Shore Investments, Inc. We completed a reincorporation of our company in Delaware under the name UAN Power Corp. on November 14, 2011.\nEffective September 4, 2014, we filed with the Delaware Secretary of State a Certificate of Amendment of Certificate of Incorporation, wherein we have increased our authorized share capital to 420,000,000 shares of stock which include 400,000,000 shares of common stock, having a par value of $0.00001 per share and 20,000,000 shares of Preferred Stock, having a par value of $0.00001 per share.\nKuan-Yin Cheng resigned as President and Director on October 26, 2020. Erik Nelson was appointed as President of the Company and a member of the Board of Directors of the Company on October 26, 2020. He is currently the sole director. Yin-Chieh Cheng was appointed Chief Financial Officer of the Company on November 18, 2020.\nOn November 20, 2020, we filed a Certificate of Designation, Preferences, and Rights of Series A Preferred Stock with the State of Delaware.\nOn June 24, 2022, the Company filed a Definitive Information Statement to:\n·\nTo authorize a reverse split of the common stock issued and outstanding on a one new share for five hundred thousand (500,000) old shares basis as of July 24, 2022.\n·\nTo authorize a forward split of the common stock issued and outstanding as of July 24, 2022. Subsequent to the 1/500,000 reverse split described above, each share of post reverse split-adjusted issued and outstanding Common Stock shall be forward split on a one for five hundred (500) basis such that each post reverse split old share represents 500 new shares.\n·\nTo authorize the Board of Directors to change the name of the corporation to Ridgedale Holdings, Inc.\nAll of these actions require the approval of the Financial Industry Regulatory Authority (FINRA) and have not yet been approved as of the date of this filing.\nThe Companys year-end is June 30th.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying financial statements have been prepared in accordance with the Financial Accounting Standards Board (FASB) FASB Accounting Standard Codification™ (the Codification) which is the source of authoritative accounting principles recognized by the FASB to be applied by nongovernmental entities in the preparation of financial statements in conformity with generally accepted accounting principles (GAAP) in the United States.\nGoing Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business for the twelve-month period following the date of these financial statements. The Company has incurred operating losses since inception. As of March 31, 2023, the Company had a working capital deficit of $166,721 and an accumulated deficit of $3,652,982.\nBecause the Company does not expect that existing operational cash flow will be sufficient to fund presently anticipated operations, this raises substantial doubt about the Companys ability to continue as a going concern. Therefore, the Company will need to raise additional funds and is currently exploring alternative sources of financing. The Company is currently being funded by Erik Nelson through loans from Coral Investment Partners which he controls. The Company will be required to continue to require funding until its operations become profitable.\nUse of Estimates\nThe preparation of financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of liabilities and disclosure of contingent assets and liabilities at the date of the financial statements. The most significant estimates relate to income taxes and contingencies. The Company bases its estimates on historical experience, known or expected trends, and various other assumptions that are believed to be reasonable given the quality of information available as of the date of these financial statements. The results of these assumptions provide the basis for making estimates about the carrying amounts of assets and liabilities that are not readily apparent from other sources. Actual results could differ from these estimates.\nRevenue Recognition\nOn July 1, 2018, the Company adopted Accounting Standards Codification (ASC) Topic 606, Revenue from Contracts with Customers (ASC 606). Results for reporting periods beginning after January 1, 2018, are presented under ASC 606. As of and for the years ended June 30, 2023 and June 30, 2022 the financial statements were not impacted due to the application of Topic 606 because the Company had no revenues.\nCash and cash equivalents\nThe Company considers all highly liquid temporary cash investments with an original maturity of three months or less to be cash equivalents. On June 30, 2023 and June 30, 2022, the Companys cash equivalents totaled $3,647 and $9,146, respectively.\nStock Purchase Warrants\nThe Company accounts for warrants issued to purchase shares of its common stock as equity in accordance with FASB ASC 480, Accounting for Derivative Financial Instruments Indexed to, and Potentially Settled in, a Companys Own Stock, Distinguishing Liabilities from Equity.\nIncome taxes\nThe Company accounts for income taxes under FASB ASC 740, Accounting for Income Taxes. Under FASB ASC 740, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Under FASB ASC 740, the effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. FASB ASC 740-10-05, Accounting for Uncertainty in Income Taxes prescribes a recognition threshold and a measurement attribute for the financial statement recognition and measurement of tax positions taken or expected to be taken in a tax return. For those benefits to be recognized, a tax position must be more-likely-than-not to be sustained upon examination by taxing authorities.\nThe amount recognized is measured as the largest amount of benefit that is greater than 50 percent likely of being realized upon ultimate settlement. The Company assesses the validity of its conclusions regarding uncertain tax positions quarterly to determine if facts or circumstances have arisen that might cause it to change its judgment regarding the likelihood of a tax positions sustainability under audit.\nStock-based Compensation\nThe Company accounts for stock-based compensation using the fair value method following the guidance outlined in Section 718-10 of the FASB Accounting Standards Codification for disclosure about Stock-Based Compensation. This section requires a public entity to measure the cost of employee services received in exchange for an award of equity instruments based on the grant-date fair value of the award (with limited exceptions). That cost will be recognized over the period during which an employee is required to provide service in exchange for the award- the requisite service period (usually the vesting period). No compensation cost is recognized for equity instruments for which employees do not render the requisite service.\nNet Loss per Share\nNet loss per common share is computed by dividing net loss by the weighted average common shares outstanding during the period as defined by Financial Accounting Standards, ASC Topic 260, Earnings per Share. Basic earnings per common share (EPS) calculations are determined by dividing net income by the weighted average number of shares of common stock outstanding during the year. Diluted earnings per common share calculations are determined by dividing net income by the weighted average number of common shares and dilutive common share equivalents outstanding.\nRecent Accounting Pronouncements\nIn February 2016, the FASB issued ASU No. 2016-02, Leases (Topic 842), which establishes a new lease accounting model for lessees. The updated guidance requires an entity to recognize assets and liabilities arising from financing and operating leases, along with additional qualitative and quantitative disclosures. The amended guidance is effective for fiscal years, and interim periods within those years, beginning after December 15, 2018, with early adoption permitted. In March 2019, the FASB issued ASU 2019-01, Codification Improvements, which clarifies certain aspects of the new lease standard. The FASB issued ASU 2018-10, Codification Improvements to Topic 842, Leases in July 2018. Also in 2018, the FASB issued ASU 2018-11, Leases (Topic 842) Targeted Improvements, which provides an optional transition method whereby the new lease standard is applied at the adoption date and recognized as an adjustment to retained earnings. The amendments have the same effective date and transition requirements as the new lease standard.\nWe adopted ASC 842 on July 1, 2020. The adoption of this guidance did not have any impact on our financial statements.\nStockholders Equity\nCommon stock\nThe Company has authorized 400,000,000 shares of Common Stock with a par value of $0.00001.\nOn September 27, 2022, the Company changed its name and effected a 1 for 1,000 net reverse stock split. As of June 30, 2023 and June 30, 2022 there were 1,670,000 and 410,000 post-split shares outstanding, respectively.\nOn December 8, 2022 CIP converted its 200,000 shares of preferred stock into 1,000,000 shares of common stock. Additionally since December 2022 the Company has received subscriptions for 260,000 Units at a price of $0.05 per Unit with total proceeds of $2,000. Each Unit is comprised of one share of common stock and two warrants. The Class A warrant is exercisable at $2.00 per share and the Class B warrant B is exercisable at $5.00 which are both exercisable until October 31, 2025.\nPreferred stock\nOn November 20, 2020 the Company filed a certificate of Designation with the State of Delaware to designate 10,000,000 shares of Series A convertible stock with a par value of $0.00001.\nAll shares of the Series A Preferred Stock shall rank (i) senior to the Corporations Common Stock and any other class or series of capital stock of the Corporation hereafter created, (ii) pari passu with any class or series of capital stock of the Corporation hereafter created and specifically ranking, by its terms, on par with the Series A Preferred Stock and (iii) junior to any class or series of capital stock of the Corporation hereafter created specifically ranking, by its terms, senior to the Series A Preferred Stock, in each case as to distribution of assets upon liquidation, dissolution or winding up of the Corporation, whether voluntary or involuntary.\nEach share of Series A Preferred Stock is convertible into 5,000 shares of Common Stock.\nOn May 7, 2021, the Company signed a subscription agreement with Coral Investment Partners (CIP) whereby CIP purchased 200,000 shares of preferred stock for the price of $2,000.\nAdditionally, on the same day CIP agreed to purchase cashless 200,000,000 Class A Warrants and 200,000,000 Class B Warrants for a total price of $2,000, or $0.000005 per warrant. This transaction was valued at $500,000 and recorded as stock-based compensation expense during the year ended June 30, 2021. As a result of the 1 for 1,000 stock split effected on September 27, 2023, the number of Class A warrants and Class B warrants was adjusted to 1,000,000 Class A and 1,000,000 Class B warrants, at exercise prices of $2.00 and $5.00, respectively.\nBoth the Company and Coral Investment Partners are controlled by Erik Nelson.\nOn December 8, 2022 CIP converted its 200,000 shares of preferred stock into 1,000,000 shares of common stock. As a result there are no longer any preferred shares outstanding.\nAs of June 30, 2023 and June 30, 2022 there were -0- and 200,000 shares of Series A Preferred Stock outstanding, respectively.\nNOTE 3 - COMMITMENTS AND CONTINGENCIES\nThe Company did not have any contractual commitments of June 30, 2023.\nNOTE 4 - NOTES PAYABLE-RELATED PARTY\nAs of June 30, 2023 the Company has a demand promissory note carrying an interest rate of 24% due to Coral Investment Partners. The principal balance and interest due as of June 30, 2023 and June 30, 2022; was $119,660 and $75,000; and $50,115 and $18,188 respectively.\nNOTE 5 - SUBSEQUENT EVENTS\nIn accordance with FASB ASC 855-10, Subsequent Events, the Company has analyzed its operations subsequent to March 31, 2023 to the date these financial statements were issued and has determined that it does not have any material subsequent events to disclose in these financial statements. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures.\nOur management is responsible for establishing and maintaining a system of disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act) that is designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported, within the time periods specified in the Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to the issuers management, including its principal executive officer or officers and principal financial officer or officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. Management has determined that our disclosure controls and procedures were not effective as of June 30, 2023.\nManagements Report on Internal Control over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that:\n· pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n· provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n· provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting based on the parameters set forth above and has concluded that as of June 30, 2023, our internal control over financial reporting was not effective to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles as a result of the following material weaknesses:\n· The Company does not have sufficient segregation of duties within accounting functions due to only having one officer and limited resources.\n· The Company does not have an independent board of directors or an audit committee.\n· The Company does not have written documentation of our internal control policies and procedures.\n· All of the Companys financial reporting is carried out by a financial consultant.\nWe plan to rectify these weaknesses by implementing an independent board of directors, establishing written policies and procedures for our internal control of financial reporting, and hiring additional accounting personnel at such time as we complete a reverse merger or similar business acquisition.\nChanges in Internal Control over Financial Reporting.\nThere have been no change in our internal control over financial reporting during the year June 30, 2023 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table sets forth the names and positions of our executive officers and directors. Directors will be elected at our annual meeting of stockholders and serve for one year or until their successors are elected and qualify. Officers are elected by the Board and their terms of office are, except to the extent governed by employment contract, at the discretion of the Board.\nThe following table sets forth the names, ages, and positions with us for each of our directors and officers as of September 1, 2022:\nName\nAge\nPosition\nErik S. Nelson\nChief Executive Officer, President, and Director\nYin-Chieh Cheng\nChief Financial Officer\nErik S. Nelson, Chief Executive Officer, President and Director\nErik S. Nelson, age 54, our sole director, was appointed as CEO, President, and a Member of the Board of Directors on October 26, 2020. Mr. Nelson is a graduate of the University of Colorado (1989) with a bachelors in Business Administration, with an emphasis in Finance. Mr. Nelson is also the President of Coral Capital Advisors, LLC. an advisory services firm founded in 1995 that provides services to privately held and publicly traded companies. Mr. Nelson is also the President of Mountain Share Transfer, LLC, an SEC registered stock transfer agent since September 2012. Mr. Nelson has experience in assisting companies to comply with the Securities and Exchange Commission rules, corporate reorganizations , and the FINRA corporate action process. Additionally, Mr. Nelson has extensive experience in evaluating the business plans of companies in a variety of industries. Additionally, Mr. Nelson has served as an officer and/or director of the following companies (in addition to those listed in those companies listed hereafter under additional Information):\n· The Midnight Mining Company: President and Director. Mr. Nelson was appointed President and a member of the Board of Directors in April of 2017. The Midnight Mining Company, while no longer involved in the mining industry or owning any mining claims, is a holding company with approximately 448 shareholders.\n· Lake Shore Tram, Inc.: From January of 2015 to January of 2016,, Mr. Nelson was the President of Lake Shore Tram, a privately held company that produced incline tram systems for residential use. During this period of time, Mr. Nelson provided interim management and turnaround services to the Company.\n· New NRG, Inc.: Mr. Nelson served as the President of New NRG, Inc. a startup biodiesel producer from 2007 to 2008.\n· Telemax Corp.: Director. Mr. Nelson served as a member of the Board of Directors of Telemax Corp. from approximately 1996 to 2004.\nAs President of Coral Capital Advisors, Mr. Nelson has consulted on several acquisitions and corporate restructurings. This includes the acquisition of Nexland, Inc. by Winstar Resources in 1999, ISNI.net, Inc. by Hawkeye Corp. in 2000, 3Pea Technologies, Inc. by Tika, Corp. in 2006, and Digitiliti, Inc. by Themescapes, Inc. in 2007. Additionally, Mr. Nelson provides due diligence services through his consulting firm, Coral Capital Advisors, LLC.\nMountain Share Transfer and Erik Nelson consented to an SEC Order in 2015 related to failure to file an updated correct TA-1 Form and other administrative violations and disclosure matters of the Transfer Agent, Mountain Share Transfer (Administrative Proceeding file no. 3-16378, 34 Act Rel. no. 74226). Mr. Nelson was disciplined by the NASD in 1995 for misconduct involving accounts when he was acting as a registered broker representative. He consented to censure, and a bar from being a representative, and was fined $50,000. He had been terminated as a registered representative and has not been reinstated since then.\nAdditionally, Mr. Nelson provides due diligence services through his consulting firm, Coral Capital Advisors, LLC.\nAdditional Information\nPursuant to the definition contained in the Securities Act, Mr. Nelson is deemed to be a promoter of this Company and those listed below.\nThe business purpose of this blank check company as well as the previous blank check companies that Mr. Nelson was involved with, were to engage in a business merger or acquisition with an unidentified company or companies.\nThe information below summarizes all of the blank check companies, which filed a registration statement on Form 10-12g, with which Mr. Nelson has been affiliated with within the past five years.\nErik S. Nelson, also serves as the President and a director of Bitmine Immersion Technologies, Inc. f/k/a Sandy Springs Holdings, Inc. He was appointed as CEO, President, CFO, and a member of the Board of Directors on August 2, 2019. On July 16, 2021, Mr. Nelson resigned as Chief Financial Officer and corporate secretary. By a written consent dated July 16, 2021, holders of a majority of the Companys issued and outstanding common stock approved a resolution to appoint Jonathan Bates, Raymond Mow, Michael Maloney and Seth Bayles (the New Directors) to the board of directors of the Company, and to appoint Jonathan Bates as Chairman. At the same time, the shareholders approved the issuance of 34,749,999 shares of common stock in the Companys offering of common stock at $0.015 per share. The New Directors or their affiliates acquired an aggregate of 21,450,000 shares of common stock in the offering. As a result of the acquisition, the New Directors control 56% of issued and outstanding common shares of the Company.\nThe appointment of the New Directors to the Companys board, and sale to the New Directors of a controlling interest in the Company, were made in order to enable the Company to enter the business of creating a hosting center for Bitcoin mining computers primarily utilizing immersion cooling technology, as well mining the Bitcoin digital currency for its own account. Prior to the change of control to the New Directors, the Company was a shell company.\nFollowing the acquisition of the controlling interest, the promissory note to Coral Investment Partners was repaid in full. Coral Investment Partners retained 1,505,000 common shares representing 3.68% of the issued and outstanding shares of BitMine Immersion Technologies, Inc.\nMr. Nelson was the Corporate Secretary and a member of the Board of Directors of Nocera, Inc. (Nocera) from September 19, 2011 until December 31, 2021 . On June 30, 2021 Nocera acquired Grand Smooth, Inc. Limited, a Hong Kong corporation. Pursuant to the Agreement and Plan of Merger, Nelson Fiorino Holdings, LLC. was paid a fee of $175,000. At the time of the merger, Mr. Nelson held a 50% interest in Nelson Fiorino Holdings. Mr. Nelson remains the beneficial owner of 652,600 shares representing 7.15% of the issued & outstanding shares. On October 30, 2019, Nocera filed a Regulation A offering, which was subsequently withdrawn on May 12, 2020.\nMr. Nelson was the sole officer (CEO, President, and CFO) and sole Director of Vinings Holdings, Inc. (October 2019 - February 2021). In February of 2021, Vinings Holdings merged with Coeptis Pharmaceuticals, Inc. whereby the company changed its name to Coeptis Therapeutics, Inc. Following the completion of the merger, Mr. Nelson resigned as an officer and director of the Company. Coral Investment Partners retained 400,000 common shares in the company. On November 18, 2021, Coeptis filed a Regulation A offering, which received a Notice of Qualification on December 3, 2021.\nThe information below summarizes all of the blank check companies, which have not filed a registration statement, with which Mr. Nelson has been associated.\n·\nMr. Nelson was appointed President and sole Director of Bellatora, Inc. on June 18, 2021. The Company has not engaged in any business combination and is not currently seeking any business combination, merger, or acquisition.\n·\nMr. Nelson was appointed President and sole Director of Digital Day Agency, Inc. on December 2, 2020. The Company has not engaged in any business combination and is not currently seeking any business combination, merger, or acquisition.\n·\nMr. Nelson was appointed President and a member of the Board of Directors of ATI Networks, Inc. on July 20, 2021. The Company has not engaged in any business combination and is not currently seeking any business combination, merger, or acquisition.\nCONFLICTS OF INTEREST - GENERAL\nOur directors and officers are, or may become, in their individual capacities, officers, directors, controlling shareholder and/or partners of other entities engaged in a variety of businesses. In addition to the business activities listed above, Mr. Nelson is involved with the following businesses.\n·\nSterling Holdings & Investments, LLC: A holding company with no direct operations. Sterling Holdings and Investments hold the ownership of Coral Capital Advisors, LLC. and Mountain Share Transfer, LLC.\n·\nCoral Capital Advisors, LLC: An independent consulting and advisory firm focused on companies and participants in the lower and middle markets.\n·\nMountain Share Transfer, LLC.: A SEC registered stock transfer agent servicing privately held and publicly traded companies.\n·\nCoral Investment Partners, LP.: A private partnership formed for the purpose of providing capital for the restructuring of dormant public companies.\n·\nNelson Fiorino Holdings, LLC.: A holding company formed for the purpose of holding shares of Nocera, Inc. owned by Marina Fiorino and Mr. Nelson.\nThus, there exist potential conflicts of interest including, among other things, time, efforts and corporation opportunity, involved in participation with such other business entities. While officers and the sole director of our business are engaged in business activities outside of our business, they devote to our business such time as they believe to be necessary.\nCONFLICTS OF INTEREST - CORPORATE OPPORTUNITIES\nPresently no requirement contained in our Articles of Incorporation, Bylaws, or minutes which requires officers and directors of our business to disclose to us business opportunities which come to their attention. Our officers and directors do, however, have a fiduciary duty of loyalty to us to disclose to us any business opportunities which come to their attention, in their capacity as an officer and/or director or otherwise. Excluded from this duty would be opportunities which the person learns about through his involvement as an officer and director of another company. We have no intention of merging with or acquiring an affiliate, associate person or business opportunity from any affiliate or any client of any such person.\nElection of Directors and Officers\nDirectors are elected to serve until the next annual meeting of stockholders and until their successors have been elected and qualified. Officers are appointed to serve until the meeting of the Board following the next annual meeting of stockholders and until their successors have been elected and qualified.\nAudit Committee\nWe do not have any committees of the Board as we only have one director.\nDirector Independence\nWe do not currently have any independent directors. We evaluate independence by the standards for director independence established by Marketplace Rule 5605(a)(2) of the Nasdaq Stock Market, Inc.\nBoard Leadership Structure\nWe have chosen to combine the Chief Executive Officer and Board Chairman positions since one person is our sole officer and director.\nCode of Ethics\nOur Board has not adopted a Code of Ethics due to the Companys size and lack of employees. As of the date of this Report, our sole director is also our Chief Executive Officer.\nDelinquent Section 16(a) Reports\nSection 16(a) of the Exchange Act requires the Companys directors, executive officers, and persons who own more than 10% of the Companys Common Stock to file initial reports of ownership and changes in ownership of the Companys Common Stock with the SEC. These individuals are required by the regulations of the SEC to furnish us with copies of all Section 16(a) forms they file. Based solely on a review of the copies of the forms furnished to us none of Companys directors, executive officers, and persons who own more than 10% of the Companys Common Stock failed to comply with Section 16(a) filing requirements. ITEM 11. EXECUTIVE COMPENSATION\nThe following information is related to the compensation paid, distributed, or accrued by us for the fiscal year ended June 30, 2023 to our Chief Executive Officer (principal executive officer) during the last fiscal year and the two other most highly compensated executive officers serving as of the end of the last fiscal year whose compensation exceeded $100,000 (the Named Executive Officers).\nExecutive compensation during the two years ended June 30, 2023 and 2022 was as follows:\nNAME AND PRINCIPAL POSITION YEAR SALARY\n($)\nBONUS\n($)\nSTOCK AWARDS\n($)\nOPTIONS\nAWARDS\n($)\nNON-QUALIFIED DEFERRED COMPENSATION ($) ALL OTHER COMPENSATION\n($)\nTOTAL\nErik S. Nelson, $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nChief Executive Officer and President, Director (1) $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nYin-Chieh Cheng, $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nFormer Chief Financial Officer (2) $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\n1. Erik S. Nelson, our sole director, was appointed as CEO and President on October 26, 2020.\n2. Yin-Chieh Cheng was appointed as CFO on November 18, 2020. He passed away in June, 2023 and Mr. Nelson assumed the position of Chief Financial Officer at that time\nNamed Executive Officer Employment Agreements\nNone.\nTermination Provisions\nAs of the date of this Report, we have no contract, agreement, plan, or arrangement, whether written or unwritten, that provides for payments to a Named Executive Officer at, following, or in connection with any termination, including without limitation resignation, severance, retirement or a constructive termination of a Named Executive Officer, or a change in control of the Company or a change in the Named Executive Officers responsibilities, with respect to each Named Executive Officer.\nOutstanding Equity Awards at Fiscal Year End\nAs of June 30, 2023, none of our Named Executive Officers held any unexercised options, stock that have not vested, or other equity incentive plan awards.\nDirector Compensation\nTo date, we have not paid our director any compensation for services on our Board.\nEquity Compensation Plan Information\nThe Company does not have any securities authorized for issuance or outstanding under an equity compensation plan or equity compensation grants made outside of such a plan. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information regarding beneficial ownership of the Companys Common Stock as of September 30, 2023 by (i) each person who is known by the Company to own beneficially more than 5% of any classes of outstanding Common Stock, and (ii) the Chief Executive Officer of the Company group based upon 1,670,000 shares outstanding.\nTitle of Class Name and Address of Beneficial Owner (1) Amount and Nature of Beneficial Owner Percent of Class Outstanding (2)\nCommon Shares Erik S. Nelson,\nChief Executive Officer, Chief Financial Officer President and Director (3)(5) 3,000,000 81.74%\nCommon Shares All Directors and Executive Officers as a Group\n(1 person) 3,000,000 81.74%\nClass A Warrants Erik S. Nelson,\nChief Executive Officer, President and Director (4) 1,000,000 100%\nClass A Warrants All Directors and Executive Officers as a Group 1,000,000 100%\nClass B Warrants Erik S. Nelson,\nChief Executive Officer, President and Director (4) 1,000,000 100%\nClass B Warrants All Directors and Executive Officers as a Group 1,000,000 100%\n______________________\n(1) The address of each person listed above, unless otherwise indicated, is c/o Ridgedale Holdings Inc. 2030 Powers Ferry Road SE, Suite 212, Atlanta, GA 30339.\n(2) Based upon 1,670,000 common shares issued and outstanding on a fully diluted basis.\n(3) Sterling Holdings & Investments, LLC is Georgia limited liability company. Mr. Nelson is the President and sole shareholder of the company.\n(4) Coral Investment Partners, LP. is an investment partnership. Mr. Nelson is President of the General Partner, and thus has control of the shares owned by the partnership.\n(5) Assumes the full exercise of the Class A and Class B warrants beneficially owned by Mr. Nelson.\nGREATER THAN 5% STOCKHOLDERS\nTitle of Class\nName and Address of Beneficial Owner (1)\nAmount and Nature of Beneficial Owner\nPercent of Class Outstanding (1)\nCommon Shares\nErik Nelson (2)\n2030 Powers Ferry Rd SE, Suite #212\nAtlanta, GA 30339\n1,400,100,000\n78.04%\n(1) Based upon 1,794,157,245 common shares issued and outstanding on a fully diluted basis.\n(2) Coral Investment Partners, LP. is an investment partnership. Mr. Nelson is President of the General Partner, and thus has control of the shares owned by the partnership.\nRule 13d-3 under the Securities Exchange Act of 1934 governs the determination of beneficial ownership of securities. That rule provides that a beneficial owner of a security includes any person who directly or indirectly has or shares voting power and/or investment power with respect to such security. Rule 13d-3 also provides that a beneficial owner of a security includes any person who has the right to acquire beneficial ownership of such security within sixty days, including through the exercise of any option, warrant or conversion of a security. Any securities not outstanding which are subject to such options, warrants or conversion privileges are deemed to be outstanding for the purpose of computing the percentage of outstanding securities of the class owned by such person. Those securities are not deemed to be outstanding for the purpose of computing the percentage of the class owned by any other person.\nAs of the date of this filing and since May 7th, 2021, there have been no issuances of any class of stock, or any other security. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nCoral Investments Partners, an entity managed by our CEO purchased a controlling interest in the Company through the issuance of preferred stock and warrants for $4,000. Additionally, Coral Investment Partners loaned the Company $20,000 during the period ended June 30, 2021 at an interest rate of 24%. As of June 30, 2021, a total of $2,346 had accrued in interest. On July 12, 2021, Coral Investment Partners increased this loan by an additional amount of $10,000 to the Company, on August 4, 2021, Coral Investment Partners increased this loan by an additional amount of $15,000 to the Company, and on November 2, 2021 Coral Investment Partners increased this loan by an additional amount of $20,000 to the Company. During fiscal 2023 Coral Investment Partners increased its loan by $44,600. The stated interest rate of 24% applied to all additional increase to the outstanding loan balance. As of June 30, 2023, the outstanding balance due was $169,775 which included $119,660 in principal and $50,115 in accrued interest. As of June 30, 2023 the Company had not made any payments towards the outstanding balance .\nOn May 7, 2021, Coral Investment Partners purchased 200,000,000 Class A Warrants at a price of $0.000005/warrant for an aggregate price of $1,000; and 200,000,000 Class B Warrants at a price of $0.000005/warrant for an aggregate price of $1,000. As a result of the 1 for 1,000 stock split effected on September 27, 2023, the number of Class A warrants and Class B warrants was adjusted to 1,000,000 Class A and 1,000,000 Class B warrants, at exercise prices of $2.00 and $5.00, respectively.\nOn May 7, 2021, Coral Investment Partners purchased 200,000 Series A Preferred Shares at a price of $0.01/share, for an aggregate price of $2,000.\nAs the Companys office space needs are limited at the current time, Erik Nelson is currently providing space to the Company at no cost. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nFor the years ended June 30, 2023 and June 30, 2022, the Company paid $38,500 and $32,700, respectively, in accounting fees.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nExhibit No.\nDescription\n3.1\nCertificate of Incorporation (Delaware) - 11.14.11\n(1)\n3.2\nCertificate of Amendment to Certificate of Incorporation - 9.4.14\n(1)\n3.3\nBylaws of Ridgedale Holdings Corp.\n(1)\n4.1\nCertificate of Designation, Preferences and Rights of Series A Preferred Stock\n(1)\n4.2\nClass A Warrant Form\n(1)\n4.3\nClass B Warrant Form\n(1)\n10.1\nPromissory Note between Coral Capital and Ridgedale Holdings Corp.\n(1)\n10.2\nAmended Promissory Note between Coral Capital and Ridgedale Holdings Corp.\n(2)\n31.1\nCertification of Chief Executive Officer pursuant to Section 302(a) of the Sarbanes-Oxley Act\n \n32.1\nCertification of Chief Executive Officer and Chief Financial Officer Under Section 1350 as Adopted Pursuant Section 906 of the Sarbanes-Oxley Act\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n(1) Incorporated by reference from the exhibits included in the Companys Registration Statement on Form 10 dated November 17, 2021.\n(2) Incorporated by reference from the exhibits included in the Companys Registration Statement on Form 10/A dated January 12, 2022.\nSIGNATURES\nIn accordance with the requirements of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nRIDGEDALE HOLDINGS INC.\nDated: October 13, 2023 By: /s/ Erik Nelson\nErik Nelson\nChief Executive Officer, Chief Financial Officer\n(Principal Executive Officer and Principal Accounting Officer)"
}