{
    "cik": "1473490",
    "company": "Wall Street Media Co, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-19",
    "period_of_report": "2022-09-30",
    "sic": "5960",
    "state_of_inc": "NV",
    "state_location": "FL",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1473490/0001493152-22-035833-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1473490/000149315222035833/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1473490/0001493152-22-035833.txt",
    "filename": "1473490_10K_2022_0001493152-22-035833.htm",
    "content": "ITEM 1. BUSINESS\nCompany Overview\nWall Street Media Co, Inc. (the Company, we, us, our) was organized as Mycatalogsonline.com, Inc. in the state of Nevada on January 6, 2009. In April 2009, the Company changed its name to My Catalogs Online, Inc. In August 2013 changed its name to Wall Street Media Co, Inc.\nThe Company provides consulting and management services to entities looking to merge with or acquire or otherwise consult with third party entities. These services are currently provided to Landmark-Pegasus, Inc., a related party (Landmark-Pegasus). Landmark-Pegasus is owned by John Moroney, the Companys majority shareholder. Mr. Moroney also acts as Landmark-Pegasus President.\nMarketing Strategy\nThe Company plans to increase its current client base by exploiting its relationship with Landmark-Pegasus, a related party. ITEM 1A. RISK FACTORS\nAn investment in our common stock is highly speculative, involves a high degree of risk, and should be made only by investors who can afford a complete loss. You should carefully consider the following risk factors, together with the other information in this annual report on Form 10-K, including our financial statements and the related notes, before you decide to buy our common stock. If any of the following risks actually occur, our business, financial condition, or results of operations could be materially adversely affected, the trading of our common stock could decline, and you may lose all or part of your investment therein.\nRisks Relating to the Early Stage of our Company\nWe are at a very early operational stage, our success is subject to the substantial risks inherent in the establishment of a new business venture, and 100% of revenues are from a related party.\nThe implementation of our business strategy, particularly our consulting service business, is in a very early stage. Our business and operations should be considered to be in a very early stage and subject to all of the risks inherent in the establishment of a new business venture. Accordingly, our intended business and operations may not prove to be successful in the near future, if at all. Any future success that we might enjoy will depend upon many factors, several of which may be beyond our control, or which cannot be predicted at this time, and which could have a material adverse effect upon our financial condition, business prospects and operations and the value of an investment in our Company.\nFor the fiscal years ended September 30, 2022 and 2021, $60,000 and $72,500, or 100%, respectively, of the Companys revenue was derived from Landmark-Pegasus, a related party. Landmark-Pegasus is wholly owned by John Moroney, who beneficially owns approximately 59.8% of the Companys common stock. Mr. Moroney also acts as Landmark-Pegasus President and is Landmark-Pegasus sole director. Currently, the Companys services are provided solely to Landmark-Pegasus and to a client of Landmark-Pegasus.\nWe have a very limited operating history and our business plan is unproven and may not be successful.\nTo date, we have not provided, licensed or sold any substantial amount of services and do not have any definitive agreements to do so. We have not proven that our business model will allow us to generate a profit. In addition, we currently provide all of our consulting services to Landmark-Pegasus, a related party. For the fiscal years ended September 30, 2022 and 2021, $60,000 and $72,500, or 100%, respectively, of the Companys revenue was derived from Landmark-Pegasus. Landmark-Pegasus is wholly owned by John Moroney, who beneficially owns approximately 59.8% of the Companys common stock. Mr. Moroney also acts as Landmark-Pegasus President and is Landmark-Pegasus sole director. Currently, the Companys services are provided solely to Landmark-Pegasus and to a client of Landmark-Pegasus.\nWe have suffered operating losses since inception and we may not be able to achieve profitability.\nWe had an accumulated deficit of $1,411,138 as of September 30, 2022 and we expect to continue to incur significant developmental expenses in the foreseeable future related to development of our consulting services business. As a result, we are sustaining substantial operating and net losses, and it is possible that we will never be able to sustain or develop the revenue levels necessary to attain profitability.\nWe may have difficulty raising additional capital, which could deprive us of necessary resources.\nWe will need to raise additional funds through public or private debt or equity financing, collaborative relationships or other arrangements. Our ability to raise additional financing depends on many factors beyond our control, including the state of capital markets and the market price of our common stock. Because our common stock is not listed on a national securities exchange, such as the New York Stock Exchange (NYSE) or The NASDAQ Stock Market (NASDAQ), many investors may not be willing or allowed to purchase it or may demand steep discounts. Sufficient additional financing may not be available to us or may be available only on terms that would result in substantial dilution to the current owners of our common stock.\nWe expect to pursue additional capital during the fiscal year ending September 30, 2022, but we do not have any firm commitments for funding. If we are unsuccessful in raising additional capital, or the terms of raising such capital are unacceptable, we may have to modify our business plan and/or significantly curtail our planned activities and other operations.\nThere are substantial doubts about our ability to continue as a going concern and if we are unable to continue our business, our shares may have little or no value.\nThe Companys ability to become a profitable operating company is dependent upon its ability to generate revenues and/or obtain financing adequate to support our cost structure. There can be no assurance that we will generate revenues or financing. These factors have raised substantial doubts about our ability to continue as a going concern. We plan to attempt to raise additional equity capital by selling shares through one or more private placement or public offerings. However, the doubts raised, relating to our ability to continue as a going concern, may make our shares an unattractive investment for potential investors. These factors, among others, may make it difficult to raise any additional capital.\nFailure to effectively manage our growth could place strains on our managerial, operational and financial resources and could adversely affect our business and operating results.\nAny future growth by us, or an increase in the number of our strategic relationships will create a strain on our managerial, operational and financial resources. This strain may inhibit our ability to achieve the rapid execution necessary to implement our business plan, and could have a material adverse effect upon our financial condition, business prospects and operations and the value of an investment in our Company.\nRisks Relating to Our Business\nWe will need to achieve commercial acceptance of our consulting services to generate revenues and achieve profitability.\nWe may not successfully develop successful relationships with potential clients, and even if we do, we may not do so on a timely basis. We cannot predict when significant commercial market acceptance for our consulting services will develop, if at all, and we cannot reliably estimate the projected size of any such potential market. If markets fail to accept our consulting services, we may not be able to generate revenues from the provision of such services. Our revenue growth and achievement of profitability will depend substantially on our ability to introduce services that are accepted by customers. If we are unable to cost-effectively achieve acceptance of our services by customers, or if the associated services do not achieve wide market acceptance, our business will be materially and adversely affected.\nWe will need to establish additional relationships with collaborative and development partners to fully develop and market our services.\nWe do not possess all of the resources necessary to develop and commercialize consulting services on a mass scale. Unless we expand our development capacity and enhance our internal marketing, we will need to make appropriate arrangements with collaborative partners to develop and commercialize consulting services.\nCollaborations may allow us to:\n● generate cash flow and revenue;\n● offset some of the costs associated with our internal development; and\n● successfully commercialize consulting services.\nIf we need, but do not find, appropriate partner arrangements, our ability to develop and commercialize consulting services could be adversely affected. Even if we are able to find collaborative partners, the overall success of the development and commercialization of our services will depend largely on the efforts of other parties and is beyond our control. In addition, in the event we pursue our commercialization strategy through collaboration, there are a variety of attendant technical, business and legal risks, including:\n● a development partner would likely gain access to our proprietary information and knowledge, potentially enabling the partner to develop services without us or design around our intellectual property;\n● We may not be able to control the amount and timing of resources that our collaborators may be willing or able to devote to the development or commercialization of services, or to their marketing and distribution; and\n● Disputes may arise between us and our collaborators that result in the delay or termination of the development or commercialization of our services or that result in costly litigation or arbitration that diverts our managements resources.\nThe occurrence of any of the above risks could impair our ability to generate revenues and harm our business and financial condition.\nWe may not be successful at marketing our consulting services.\nWe may not be able to market our services, or efforts we exert to develop, commercialize or promote such services may not result in revenue or earnings.\nWe may lose out to larger and better-established competitors.\nThe consulting services industry is intensely competitive. Most of our competitors have significantly greater financial, technical, marketing and distribution resources, as well as greater experience in the industry than we have. Our services may not be competitive with their services. If this happens, our sales and revenues will decline. In addition, our current and potential competitors may establish cooperative relationships with larger companies, to gain access to greater development or marketing resources. Competition may result in price reductions, reduced gross margins and loss of market share.\nRisks Relating to our Stock\nTrading on the OTC Markets is volatile, sporadic and often thin, which could depress the market price of our common stock and make it difficult for our stockholders to resell their common stock.\nOur common stock is quoted on the OTCQB tier of the OTC Markets. Trading in securities quoted on the OTC Markets is often thin and characterized by wide fluctuations in trading prices, due to many factors, some of which may have little to do with our operations or business prospects. This volatility could depress the market price of our common stock for reasons unrelated to operating performance. Moreover, the OTC Markets is not a stock exchange, and trading of securities on the OTC Markets is often more sporadic than the trading of securities listed on a stock exchange like NASDAQ or the NYSE. Our common stock has a history of thin trading. During the 52-week period ended September 30, 2022, trades were only reported on 27 trading days. These factors may result in investors having difficulty reselling any shares of our common stock.\nOur common stock price is likely to be highly volatile because of several factors, including a limited public float.\nThe market price of our common stock has been volatile in the past. For example, as of September 30,2022, our common stock has had a 52-week high sale price of $0.3998 and a low sale price of $0.05. The market price of our common stock is likely to be highly volatile in the future, as well. You may not be able to resell shares of our common stock following periods of volatility because of the markets adverse reaction to volatility.\nOther factors that could cause such volatility may include, among other things:\n● actual or anticipated fluctuations in our operating results;\n● the absence of securities analysts covering us and distributing research and recommendations about us;\n● we may have a low trading volume for a number of reasons, including that a large portion of our stock is closely held;\n● overall stock market fluctuations;\n● announcements concerning our business or those of our competitors;\n● actual or perceived limitations on our ability to raise capital when we require it, and to raise such capital on favorable terms;\n● conditions or trends in the industry;\n● litigation;\n● changes in market valuations of other similar companies;\n● future sales of common stock;\n● departure of key personnel or failure to hire key personnel; and\n● general market conditions.\nAny of these factors could have a significant and adverse impact on the market price of our common stock. In addition, the stock market in general has at times experienced extreme volatility and rapid decline that has often been unrelated or disproportionate to the operating performance of particular companies. These broad market fluctuations may adversely affect the trading price of our common stock, regardless of our actual operating performance.\nFuture stock issuances would dilute stockholders ownership, and may reduce our share value.\nIf, in the future, we issue additional shares, the future issuance of common stock or preferred stock may result in substantial dilution in the percentage of our common stock held by our then existing shareholders. We may value any common stock issued in the future on an arbitrary basis. The issuance of common stock for future services or acquisitions or other corporate actions may have the effect of diluting the value of the shares held by our investors, and might have an adverse effect on any trading market for our common stock.\nWe face corporate governance risks and negative investor perceptions because we have only one officer and director and have not adopted a written policy for the review, approval or ratification of transactions with related parties or conflicted parties.\nMr. Lubchansky is our sole officer and director. As such, he has significant control over our business direction. Additionally, because he is our sole director, there are no other board members available to second and/or approve related party transactions involving Mr. Lubchansky, including the compensation Mr. Lubchansky may be paid. Additionally, there is no segregation of duties between officers because Mr. Lubchansky is our sole officer, and as such, he is solely responsible for the oversight of our accounting functions. Because no other directors are approving our financial statements, investors may question the accuracy of financial statements. The price of our common stock may be adversely affected and/or devalued compared to similarly sized companies with multiple officers and directors due to the investing publics perception of limitations facing our company due to the fact that we only have one officer and director.\nOur common stock is currently, has been in the past, and may be in the future, a penny stock under SEC rules. It may be more difficult to resell securities classified as penny stock.\nOur common stock is a penny stock under applicable SEC rules (generally defined as non-exchange traded stock with a per-share price below $5.00). Unless we obtain a per-share price above $5.00, these rules impose additional sales practice requirements on broker-dealers that recommend the purchase or sale of penny stocks to persons other than those who qualify as established customers or accredited investors. For example, broker-dealers must determine the appropriateness for non-qualifying persons of investments in penny stocks. Broker-dealers must also provide, prior to a transaction in a penny stock not otherwise exempt from the rules, a standardized risk disclosure document that provides information about penny stocks and the risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, disclose the compensation of the broker-dealer and its salesperson in the transaction, furnish monthly account statements showing the market value of each penny stock held in the customers account, provide a special written determination that the penny stock is a suitable investment for the purchaser, and receive the purchasers written agreement to the transaction.\nLegal remedies available to an investor in penny stocks may include the following:\n● If a penny stock is sold to the investor in violation of the requirements listed above, or other federal or states securities laws, the investor may be able to cancel the purchase and receive a refund of the investment.\n● If a penny stock is sold to the investor in a fraudulent manner, the investor may be able to sue the persons and firms that committed the fraud for damages.\nHowever, investors who have signed arbitration agreements may have to pursue their claims through arbitration.\nThese requirements may have the effect of reducing the level of trading activity, if any, in the secondary market for a security that becomes subject to the penny stock rules. The additional burdens imposed upon broker-dealers by such requirements may discourage broker-dealers from effecting transactions in our securities, which could severely limit the market price and liquidity of our securities. These requirements may restrict the ability of broker-dealers to sell our common stock and may affect your ability to resell our common stock.\nMany brokerage firms will discourage or refrain from recommending investments in penny stocks. Most institutional investors will not invest in penny stocks. In addition, many individual investors will not invest in penny stocks due, among other reasons, to the increased financial risk generally associated with these investments.\nFor these reasons, penny stocks may have a limited market and, consequently, limited liquidity. We can give no assurance that our common stock will not remain classified as a penny stock in the future.\nIf we fail to maintain effective internal control over financial reporting, the price of our securities may be adversely affected.\nOur internal control over financial reporting may have weaknesses and conditions that could require correction or remediation, the disclosure of which may have an adverse impact on the price of our common stock. We are required to establish and maintain appropriate internal control over financial reporting. Failure to establish those controls, or any failure of those controls once established, could adversely affect our public disclosures regarding our business, prospects, financial condition or results of operations. In addition, managements assessment of internal control over financial reporting may identify weaknesses and conditions that need to be addressed in our internal control over financial reporting or other matters that may raise concerns for investors. Any actual or perceived weaknesses and conditions that need to be addressed in our internal control over financial reporting or disclosure of managements assessment of our internal control over financial reporting may have an adverse impact on the price of our common stock.\nWe are required to comply with certain provisions of Section 404 of the Sarbanes-Oxley Act of 2002, as amended (the Sarbanes-Oxley Act) and if we fail to continue to comply, our business could be harmed and the price of our securities could decline.\nRules adopted by the SEC pursuant to Section 404 of the Sarbanes-Oxley Act require an annual assessment of internal control over financial reporting, and for certain issuers (but not us) an attestation of this assessment by the issuers independent registered public accounting firm. The standards that must be met for management to assess the internal control over financial reporting as effective are evolving and complex, and require significant documentation, testing, and possible remediation to meet the detailed standards. We expect to incur significant expenses and to devote resources to Section 404 compliance on an ongoing basis. It is difficult for us to predict how long it will take or costly it will be to complete the assessment of the effectiveness of our internal control over financial reporting for each year and to remediate any deficiencies in our internal control over financial reporting. As a result, we may not be able to complete the assessment and remediation process on a timely basis. In the event that our Chief Executive Officer or principal financial officer determines that our internal control over financial reporting is not effective as defined under Section 404, we cannot predict how regulators will react or how the market prices of our securities will be affected; however, we believe that there is a risk that investor confidence and the market value of our securities may be negatively affected.\nShares eligible for future sale may adversely affect the market.\nFrom time to time, certain of our stockholders may be eligible to sell all or some of their shares of common stock by means of ordinary brokerage transactions in the open market pursuant to Rule 144 promulgated under the Securities Act, subject to certain limitations. In general, pursuant to Rule 144, non-affiliate stockholders may sell freely after six months, subject only to the current public information requirement. Affiliates may sell after six months, subject to the Rule 144 volume, manner of sale (for equity securities), current public information, and notice requirements. Given the limited trading of our common stock, resale of even a small number of shares of our common stock pursuant to Rule 144 or an effective registration statement may adversely affect the market price of our common stock.\nThe Financial Industry Regulatory Authority (FINRA) sales practice requirements may also limit a stockholders ability to buy and sell our stock.\nIn addition to the penny stock rules discussed above, FINRA rules require that in recommending an investment to a customer, a broker -dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative, low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit the ability to buy and sell our stock and have an adverse effect on the market value for our shares.\nAn investors ability to trade our common stock may be limited by trading volume.\nThe Companys shares are currently quoted on the OTCQB under the symbol, WSCO. An active trading market for our common stock has not developed, and may not develop, on the OTCQB. During the 52-week period ended September 30, 2022, trades were only reported on 27 trading days. A limited trading volume may prevent our shareholders from selling shares at such times or in such amounts as they may otherwise desire.\nOur Company has a concentration of stock ownership and control, which may have the effect of delaying, preventing, or deterring a change of control.\nOur common stock ownership is highly concentrated. Through ownership of shares of our common stock, one shareholder, John Moroney, beneficially owns approximately 59.8% of our total outstanding shares of common stock. As a result of the concentrated ownership of the stock, this stockholder, acting alone, will be able to control all matters requiring stockholder approval, including the election of directors and approval of mergers and other significant corporate transactions. This concentration of ownership may have the effect of delaying, preventing or deterring a change in control of our Company. It could also deprive our stockholders of an opportunity to receive a premium for their shares as part of a sale of our Company and it may affect the market price of our common stock.\nWe have not voluntarily implemented various corporate governance measures, in the absence of which, shareholders may have more limited protections against interested director transactions, conflicts of interest and similar matters.\nFederal legislation, including the Sarbanes-Oxley Act, has resulted in the adoption of various corporate governance measures designed to promote the integrity of the corporate management and the securities markets. Some of these measures have been adopted in response to legal requirements; others have been adopted by companies in response to the requirements of national securities exchanges, such as the NYSE or NASDAQ, on which their securities are listed. Among the corporate governance measures that are required under the rules of national securities exchanges, are those that address the Board of Directors independence, audit committee oversight, and the adoption of a code of ethics. While our Board of Directors has adopted a Code of Ethics, we have not yet adopted any of these corporate governance measures, and since our securities are not listed on a national securities exchange, we are not required to do so. It is possible that if we were to adopt some or all of these corporate governance measures, shareholders would benefit from somewhat greater assurances that internal corporate decisions were being made by disinterested directors and that policies had been implemented to define responsible conduct. For example, in the absence of audit, nominating and compensation committees comprised of at least a majority of independent directors, decisions concerning matters such as compensation packages to our senior officers and recommendations for director nominees, may be made by a majority of directors who have an interest in the outcome of the matters being decided. Prospective investors should bear in mind our current lack of corporate governance measures in formulating their investment decisions.\nBecause we will not pay dividends in the foreseeable future, stockholders will only benefit from owning common stock if it appreciates.\nWe have never paid dividends on our common stock and we do not intend to do so in the foreseeable future. We intend to retain any future earnings to finance our growth. Accordingly, any potential investor who anticipates the need for current dividends from his investment should not purchase our common stock.\nImpact of COVID-19\nIn March 2020, the World Health Organization declared COVID-19 a global pandemic and recommended containment and mitigation measures worldwide. The Company is monitoring this closely, and although operations have not been materially affected by the COVID-19 outbreak to date, the ultimate duration and severity of the outbreak and its impact on the economic environment and business is uncertain. Accordingly, while the Company does not anticipate an impact to the operations, we cannot estimate the duration of the pandemic and potential impact on the business. In addition, a severe or prolonged economic downturn could result in a variety of risks to the business, including a possible delay in implementing the Companys business plan. At this time, the Company is unable to estimate the ultimate impact of this event on its operations. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable. ITEM 2. PROPERTY\nThe Company leases on a month to month basis virtual office space at 110 Front Street - Suite 300, Jupiter, FL 33477. Monthly rent is $141. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in various lawsuits and legal proceedings which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. We are currently not aware of any such legal proceedings or claims that we believe will have, individually or in the aggregate, a material adverse effect on our business, financial condition or operating results ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock is quoted on the OTCQB market tier of the OTC Markets Group under the symbol WSCO. Securities quoted on the OTCQB trade via a dealer network, as opposed to trading on a centralized stock exchange, such as the NYSE. In order to have securities quoted on the OTCQB, a company must be current in its financial reporting, but it is not subject to any minimum financial requirements and listing standards, as is the case with national securities exchanges. Trading in OTCQB stocks can be volatile, sporadic and risky, as thinly traded stocks tend to move more rapidly in price than more liquid securities. Such trading may also depress the market price of our common stock and make it difficult for our stockholders to resell their common stock.\nThe following table sets forth, as reported by the OTCQB, the per share high and low bid quotations for our common stock for each of the periods indicated. These quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions. The data in the table below presents historical information only and is not intended to predict future sale prices of our common stock. Trading in securities, such as our common stock, on the OTC Markets may be volatile and thin and characterized by wide fluctuations in trading prices. See Risk Factors-Trading on the OTC Markets is volatile, sporadic and often thin, which could depress the market price of our common stock and make it difficult for our security holders to resell their common stock.\nHigh Low\nFiscal Year Ended September 30, 2021\nQuarter Ended December 31, 2020 $ 0.1700 $ 0.0280\nQuarter Ended March 31, 2021 $ 0.7980 $ 0.0745\nQuarter Ended June 30, 2021 $ 0.3999 $ 0.1010\nQuarter Ended September 30, 2021 $ 0.3999 $ 0.1110\nFiscal Year Ended September 30, 2022\nQuarter Ended December 31, 2021 $ 0.3280 $ 0.0610\nQuarter Ended March 31, 2022 $ 0.0611 $ 0.0611\nQuarter Ended June 30, 2022 $ 0.0611 $ 0.0611\nQuarter Ended September 30, 2022 $ 0.2800 $ 0.0611\n**On September 14 2022, the most recent day on which our common stock was traded on the OTCQB, the closing price per share of our common stock as quoted on the OTCQB was $0.071.\nAs of September 30, 2022, the Company had 26,922,006 shares of common stock issued, par value $0.001, held by approximately 81 shareholders of record.\nDividend Policy\nWe have not paid any cash dividends on our common stock and do not plan to pay any such dividends in the foreseeable future. Our Board of Directors will determine our future dividend policy on the basis of many factors, including results of operations, capital requirements, and general business conditions.\nRecent Sales of Unregistered Securities; Use of Proceeds from Registered Securities\nThere were no sales of unregistered securities during the fiscal year ended September 30, 2022. ITEM 6. SELECTED FINANCIAL DATA\nNot applicable to smaller reporting companies. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of our financial condition and results of operations should be read in conjunction with the consolidated financial statements and the notes to those financial statements that are included elsewhere in this annual report on Form 10-K.\nFORWARD-LOOKING STATEMENTS\nThere are statements in this annual report on Form 10-K that are not historical facts. These forward-looking statements can be identified by use of terminology such as believe, hope, may, anticipate, should, intend, plan, will, expect, estimate, project, positioned, strategy, and similar expressions. You should be aware that these forward-looking statements are subject to risks and uncertainties that are beyond our control. For a discussion of these risks, you should read this entire annual report on Form 10-K document carefully. Although management believes that the assumptions underlying the forward-looking statements are reasonable, they do not guarantee our future performance, and actual results could differ from those contemplated by these forward-looking statements. The assumptions used for the purposes for the forward-looking statements specified in the following information represent estimates of future events and are subject to uncertainty as to possible changes in the economy, legislative changes, changes in the industry, and other circumstances. As a result, the identification and interpretation of data and other information and their use in developing and selecting assumptions from and among reasonable alternatives require the exercise of judgment. To the extent that the assumed events do not occur, the outcome may vary substantially from anticipated or projected results, and, accordingly, no opinion is expressed on the achievability of those forward-looking statements. In the light of these risks and uncertainties, there can be no assurance that the results and events contemplated by the forward-looking statements contained in this annual report on Form 10-K will in fact transpire. You are cautioned not to place reliance on these forward-looking statements, which speak only as of their dates. We do not undertake any obligation to update or revise any forward-looking statements.\nOVERVIEW\nWall Street Media Co, Inc. (the Company, we, us or our) was organized as Mycatalogsonline.com, Inc. in the state of Nevada on January 6, 2009. The Company went through several name changes until August 2013, when it changed its name to Wall Street Media Co., Inc.\nThe Company provides consulting and management services to entities looking to merge with, or acquire or otherwise consult with third party entities. These services are currently provided to Landmark-Pegasus, Inc., a related party (Landmark-Pegasus). Mr. Moroney also acts as Landmark-Pegasus President and is its sole director.\nCRITICAL ACCOUNTING POLICIES\nIn response to the Securities and Exchange Commissions (the SEC) financial reporting release, FR-60, Cautionary Advice Regarding Disclosure About Critical Accounting Policies, the Company has selected its more subjective accounting estimation processes for purposes of explaining the methodology used in calculating the estimate, in addition to the inherent uncertainties pertaining to the estimate and the possible effects on the Companys financial condition. These accounting estimates are discussed below. These estimates involve certain assumptions that if incorrect could create a material adverse impact on the Companys results of operations and financial condition\nRevenue Recognition\nThe Company recognized revenue using the five-step revenue recognition model as prescribed by ASC 606, Revenue from Contracts with Customers. The underlying principle of new standard is that a business or other organization will recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects what it expects to receive in exchange for the goods or services. The Company adopted the standard using the modified retrospective method and the adoption did not have a material impact on its financial statements.\nThe Company provides consulting services currently to an entity wholly owned by the Companys majority stockholder or the related entitys clients which represents the Companys only revenue source. The Company recognizes revenue when the performance obligation (i.e. consulting services) with the customer is satisfied and when the service is provided. Revenue is measured as the amount of consideration the Company expects to receive in exchange for providing the service.\nRESULTS OF OPERATIONS\nFOR THE YEAR ENDED SEPTEMBER 30, 2022 COMPARED TO THE YEAR ENDED SEPTEMBER 30, 2021\nRevenue: The Companys revenues decreased approximately 17% from $72,500 during the year ended September 30, 2021 to $60,000 for the year ended September 30, 2022 due to a decrease in consulting services provided. All revenues generated during the years ended September 30, 2022 and 2021 are with related parties.\nOperating Expenses: The Companys operating expenses decreased approximately 25% from $73,728 during the year ended September 30, 2021 to $55,504 for the year ended September 30, 2022. The primary reason for this was due to the bad debt expense recovery from a related party.\nInterest Expense: The Companys interest expense increased approximately 1% from $3,711 during the year ended September 30, 2021 as compared to $3,738 for the year ended September 30, 2022 due to an increase in notes payable during the year.\nIncome from Operations: The Companys loss from operations decreased approximately 466% from $1,228 for the year ended September 30, 2021 as compared to income from operations of $4,496 for the year ended September 30, 2022. The primary reasons for this was due to the recovery of the bad debt expense from a related party. $60,000 and $72,500, or 100%, of the Companys revenue during the years ended September 30, 2022 and 2021, respectively, was derived from Landmark-Pegasus, and its related party Skybunker Inc. which is wholly owned by John Moroney, who beneficially owns approximately 59.8% of the Companys common stock. Mr. Moroney also acts as Landmark-Pegasus President and is Landmark-Pegasus sole director.\nLIQUIDITY AND CAPITAL RESOURCES\nNet cash provided by operating activities was $2,036 for the year ended September 30, 2022 as compared to net cash used in operating activities of $8,228 for the year ended September 30, 2021.\nNet cash provided by financing activities was $2,620 for the year ended September 30, 2022 as compared to $0 for the year ended September 30, 2021, primarily due to the proceeds from the note payable - related party.\nThe working capital deficit was $86,738 for the year ended September 30, 2022 as compared to a working capital deficit of $87,496 for the year ended September 30, 2021.\nAs of September 30, 2022, the Company had $5,812 in cash. The Company plans to fund ongoing operations by continuing to pursue contracts to provide consulting services in efforts to generate additional revenue. In addition, the Company is actively seeking investor funding.\nRELATED PERSON TRANSACTIONS\nFor information on related party transactions and their financial impact, see Note 3 to the financial statements.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nIn August, 2020, the FASB issued ASU 2020-06, Debt-Debt with Conversion and other options which simplifies the accounting for convertible debt instruments and convertible preferred stock. The ASU is effective for public companies for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted. This ASU is not expected to have a material impact on the financial statements and disclosures of the Company since it does not have any debt that meets the criteria.\nOFF-BALANCE SHEET ARRANGEMENTS\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources, that is material to investors. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable for smaller reporting companies. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 4048)\nBalance Sheets\nStatements of Operations\nStatements of Changes in Stockholders Deficit\nStatements of Cash Flows\nNotes to Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Wall Street Media Co., Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Wall Street Media Co., Inc. (the Company) as of September 30, 2022 and 2021, and the related statements of operations, stockholders equity (deficit), and cash flows for the years ended September 30, 2022 and 2021, and the related notes to the financial statements (collectively referred to as the financial statements).\nIn our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for the years ended September 30, 2022 and 2021, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt Regarding Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has incurred operating losses, has incurred negative cash flows from operations and has an accumulated deficit and negative working capital. These and other factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plan regarding these matters is also described in Note 2 to the financial statements. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit includes performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there were no critical audit matters.\nD. Brooks and Associates CPAs, P.A.\nWe have served as the Companys auditor since 2020.\nPalm Beach Gardens, Florida\nDecember 15, 2022\nWALL STREET MEDIA CO., INC.\nBalance Sheets\nSeptember 30, 2022 September 30, 2021\nASSETS\nCurrent Assets\nCash $ 5,812 $ 1,156\nAccounts receivable-related party-net of allowance of $0 and $10,000 at September 30, 2022 and 2021, respectively 5,000 5,000\nPrepaid Expenses 5,080 5,000\nTotal Current Assets 15,892 11,156\nDeposits\nTotal Assets $ 16,470 $ 11,734\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent Liabilities\nAccrued interest payable-related party $ 8,510 $ 7,152\nNotes payable -related party 94,120 91,500\nTotal Current Liabilities 102,630 98,652\nTotal Liabilities 102,630 98,652\nCommitments and Contingencies (Note 6) - -\nStockholders Deficit\nPreferred stock, $0.001 par value; 5,000,000 shares authorized; none issued or outstanding - -\nCommon stock, $0.001 par value; 195,000,000 shares authorized; 26,922,006 issued and outstanding at September 30, 2022 and 2021 26,922 26,922\nAdditional paid-in capital 1,298,056 1,298,056\nAccumulated deficit (1,411,138 ) (1,411,896 )\nTotal Stockholders Deficit (86,160 ) (86,918 )\nTotal Liabilities and Stockholders Deficit $ 16,470 $ 11,734\nThe accompanying notes are an integral part of these financial statements.\nWALL STREET MEDIA CO., INC.\nStatements of Operations\nFor the year ended For the year ended\nSeptember 30, 2022 September 30, 2021\nRevenues:\nConsulting fees from related party $ 60,000 $ 72,500\nTotal Revenues 60,000 72,500\nOperating Expenses:\nBad debt recovery -related party (10,000 ) -\nBad debt expense - related party - 10,000\nGeneral and administrative 19,302 16,135\nProfessional fees 44,510 46,045\nRent 1,692 1,548\nTotal Operating Expenses 55,504 73,728\nIncome (Loss) From Operations 4,496 (1,228 )\nOther Expense\nInterest expense (3,738 ) (3,711 )\nTotal Other Expense (3,738 ) (3,711 )\nNet income (loss) $ 758 $ (4,939 )\nNet income (loss) per share - basic and diluted $ 0.00 $ (0.00 )\nWeighted average number of common shares - Basic and Diluted 26,922,006 26,922,006\nThe accompanying notes are an integral part of these financial statements.\nWALL STREET MEDIA CO., INC.\nStatements of Changes in Stockholders Deficit\nFor the Years ended September 30, 2022 and 2021\nShares Issued Amount Paid-in\nCapital\nAccumulated\nDeficit\nStockholders\nDeficit\nCommon Stock Additional\nTotal\nShares Issued Amount Paid-in\nCapital\nAccumulated\nDeficit\nStockholders\nDeficit\nBalance at September 30, 2020 26,922,006 $ 26,922 $1,298,056 $ (1,406,957 ) $ (81,979 )\nNet (loss) - - - (4,939 ) (4,939 )\nBalance at September 30, 2021 26,922,006 26,922 1,298,056 (1,411,896 ) (86,918 )\nBalance 26,922,006 26,922 1,298,056 (1,411,896 ) (86,918 )\nNet income - - -\nNet income (loss) - - -\nBalance at September 30, 2022 26,922,006 $ 26,922 $ 1,298,056 $ (1,411,138 ) $ (86,160 )\nBalance 26,922,006 $ 26,922 $ 1,298,056 $ (1,411,138 ) $ (86,160 )\nThe accompanying notes are an integral part of these financial statements.\nWALL STREET MEDIA CO., INC.\nStatements of Cash Flows\nFor the year ended For the year ended\nSeptember 30, 2022 September 30, 2021\nCash flows provided by (used in) Operating Activities:\nNet income (loss) $ 758 $ (4,939 )\nChanges in operating assets and liabilities:\nPrepaid expenses (80 ) (5,000 )\nAccrued interest payable-related party 1,358 1,711\nNet cash provided by (used in) operating activities 2,036 (8,228 )\nCash flows provided by Financing Activities:\nProceeds from issuance of notes payable-related party 2,620 -\nNet cash provided by financing activities 2,620 -\nIncrease (decrease) in cash during the year 4,656 (8,228 )\nCash, beginning of year 1,156 9,384\nCash, end of year $ 5,812 $ 1,156\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION\nInterest paid in cash $ 2,380 $ 2,000\nTaxes paid in cash $ - $ -\nThe accompanying notes are an integral part of these financial statements.\nWall Street Media Co., Inc.\nNotes to Financial Statements\nFor the Years Ended September 30, 2022 and 2021\nNote 1 - Nature of Operations and Summary of Significant Accounting Policies\nNature of Operations\nWall Street Media Co, Inc. (the Company or Wall Street Media) was organized as Mycatalogsonline.com, Inc. in the state of Nevada on January 26, 2009. The Company went through several name changes until August 2013 when it changed its name to Wall Street Media Co, Inc.\nThe Company provides consulting and management services to entities looking to merge with or acquire or otherwise consult with third party entities. These services are currently provided to Landmark-Pegasus, Inc., a related party (Landmark-Pegasus). Landmark-Pegasus is owned by John Moroney, the Companys majority shareholder. Mr. Moroney also acts as Landmark-Pegasus President.\nImpact of COVID-19\nIn March 2020, the World Health Organization declared COVID-19 a global pandemic and recommended containment and mitigation measures worldwide. The Company is monitoring this closely, and although operations have not been materially affected by the COVID-19 outbreak to date, the ultimate duration and severity of the outbreak and its impact on the economic environment and business is uncertain. Accordingly, while the Company does not anticipate an impact to the operations, we cannot estimate the duration of the pandemic and potential impact on the business. In addition, a severe or prolonged economic downturn could result in a variety of risks to the business, including a possible delay in implementing the Companys business plan. At this time, the Company is unable to estimate the ultimate impact of this event on its operations.\nUse of Estimates\nThe financial statements are prepared in accordance with Accounting Principles Generally Accepted in the United States (GAAP). These accounting principles require the Company to make certain estimates, judgments and assumptions. The Company believes that the estimates, judgments and assumptions upon which it relies are reasonable based upon information available at the time that these estimates, judgments and assumptions are made. These estimates, judgments and assumptions can affect the reported amounts of assets and liabilities as of the date of the financial statements as well as the reported amounts of revenues and expenses during the periods presented. The financial statements would be affected to the extent there are material differences between these estimates and actual results. In many cases, the accounting treatment of a particular transaction is specifically dictated by GAAP and does not require managements judgment in its application. There are also areas in which managements judgment in selecting any available alternative would not produce a materially different result. Significant estimates include the valuation allowance on deferred tax assets.\nRevenue Recognition\nThe Company recognizes revenue using the five-step revenue recognition model as prescribed by ASC 606, Revenue from Contracts with Customers. The underlying principle of ASC 606 is that a business or other organization will recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects what it expects to receive in exchange for the goods or services.\nWall Street Media Co., Inc.\nNotes to Financial Statements\nFor the Years Ended September 30, 2022 and 2021\nThe Company provides consulting services currently to an entity wholly owned by the Companys majority stockholder or the related entitys clients which represents the Companys only revenue source. The Company recognizes revenue when the performance obligation (i.e. consulting services) with the customer is satisfied and when the service is provided. Revenue is measured as the amount of consideration the Company expects to receive in exchange for providing the service.\nIncome Taxes\nThe Company accounts for income taxes pursuant to the provisions of ASC 740-10 Accounting for Income Taxes, which requires, among other things, an asset and liability approach to calculating deferred income taxes. The asset and liability approach requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the carrying amounts and the tax bases of assets and liabilities. A valuation allowance is provided to offset any net deferred tax assets for which management believes it is more likely than not that the net deferred asset will not be realized.\nIn accordance with the guidance of ASC 740-10, the benefit of a tax position is recognized in the financial statements in the period during which, based on all available evidence, management believes it is more likely than not that the position will be sustained upon examination, including the resolution of appeals or litigation processes, if any. Tax positions taken are not offset or aggregated with other positions. Tax positions that meet the more-likely-than-not recognition threshold are measured as the largest amount of tax benefit that is more than 50 percent likely of being realized upon settlement with the applicable taxing authority. The portion of the benefits associated with tax positions taken that exceeds the amount measured as described above should be reflected as a liability for unrecognized tax benefits in the accompanying balance sheet along with any associated interest and penalties that would be payable to the taxing authorities upon examination. The Company believes its tax positions are all highly certain of being upheld upon examination. As such, the Company has not recorded a liability for unrecognized tax benefits. As of September 30, 2022, tax years 2021, 2020, and 2019 remain open for Internal Revenue Service audit. The Company has received no notice of audit from the Internal Revenue Service for any of the open tax years.\nBasic and Diluted Net Loss per Common Share\nBasic net loss per share is computed by dividing the net loss by the weighted average number of common shares outstanding during the period. Diluted net loss per common share is computed by dividing the net loss by the weighted average number of common shares outstanding for the period and, if dilutive, potential common shares outstanding during the period. Potentially dilutive securities consist of the incremental common shares issuable upon exercise of common stock equivalents such as stock options and convertible debt instruments. Potentially dilutive securities are excluded from the computation if their effect is anti-dilutive. There were no potentially dilutive securities outstanding as of September 30, 2022 and 2021.\nWall Street Media Co., Inc.\nNotes to Financial Statements\nFor the Years Ended September 30, 2022 and 2021\nRecent Accounting Pronouncements\nIn August, 2020, the FASB issued ASU 2020-06, Debt-Debt with Conversion and other options which simplifies the accounting for convertible debt instruments and convertible preferred stock. The ASU is effective for public companies for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted. This ASU is not expected to have a material impact on the financial statements and disclosures of the Company since it does not have any debt with conversion options that meets the criteria.\nNote 2 - Going Concern\nAs reflected in the accompanying financial statements for the years ended September 30, 2022 and 2021, the Company reported net income of $758 and a net loss of $4,939, respectively, net cash provided by operating activities of $2,036 in 2022, and used in operating activities was $8,228 in 2021. In addition, the Company has a working capital deficit of $86,738 and an accumulated deficit of $1,411,138 at September 30, 2022. These matters raise substantial doubt about the Companys ability to continue as a going concern for a period of one year from the date of this report. The financial statements do not include any adjustments relating to the recovery of the recorded assets or the classification of the liabilities that might be necessary should the Company be unable to implement its business plan and continue as a going concern. In addition, the Company is actively seeking investor funding.\nNote 3 - Related Party Transactions\n$60,000 and $72,500, or 100% of the Companys revenue during the years ended September 30, 2022 and 2021, respectively, was derived from Landmark-Pegasus and Skybunker, related parties, or direct clients of Landmark-Pegasus. Landmark-Pegasus and Skybunker both wholly owned by John Moroney, who beneficially owns approximately 59.8% of the Companys common stock. Mr. Moroney also acts as Landmark-Pegasus President and is Landmark-Pegasus sole director. As of September 30, 2022 and 2021, $5,000 and $15,000, respectively, of those services remain unpaid by the related party. The Company has also recorded an allowance for doubtful accounts of $10,000 at September 30,2021 due to deterioration in one of the related parties financial position and the uncertainty in collecting these unpaid services. As of September 30, 2021, services remaining unpaid has been presented as accounts receivable - related party on the accompanying balance sheet. During the year ended September 30, 2022, the Company recovered the $10,000 bad debt that had been allowed for and included in the accounts receivable allowance as of September 30, 2021, related to services provided to a related party during the year ended September 30, 2021. This bad debt recovery has been reflected on the statement of operations\nThe Company has notes payable with Landmark-Pegasus that accrues interest at an annual rate of 4%, and are payable on demand. The balance on the notes is $94,120 and $91,500 at September 30, 2022 and September 30, 2021, respectively. At September 30, 2022 and 2021 total interest accrued on the notes payable was $8,510 and $7,152, respectively.\nJeffrey A. Lubchansky, the Companys Chairman of the Board, President, Chief Executive Officer and principal financial officer, received $19,000 during the years ended September 30, 2022 and 2021 as compensation for his services as an executive officer. His compensation is $1,500 per month plus out-of-pocket expenses. This amount is included in Professional fees on the Statements of Operations.\nNote 4 - Stockholders Deficit\nThe Company has 5,000,000 preferred shares authorized. None are designated, issued or outstanding. The Company has 195,000,000 common stock authorized and has 26,922,006 shares issued and outstanding at September 30, 2022 and 2021.\nWall Street Media Co., Inc.\nNotes to Financial Statements\nFor the Years Ended September 30, 2022 and 2021\nNote 5 - Income Taxes\nThere was no income tax expense in fiscal 2022 and 2021 due to the Companys net taxable losses.\nThe reconciliation of income tax expense (benefit) for the years ended September 30, 2022 and 2021 computed at the United States federal tax rate of 21% to income tax expense (benefit) is as follows:\nSchedule of Reconciliation of Income Tax Expense (Benefit)\nTax expense at the United States statutory rate $ 160 $ 1,013\nState income tax, net of federal\nChange in valuation allowance (188 ) (1,253 )\nIncome tax expense (benefits) $ - $ -\nTax expense at the United States statutory rate 21.00 % 21.00 %\nState income tax, net of federal 4.74 % 4.74 %\nChange in valuation allowance (25.74 )% (25.74 )%\nIncome tax expense (benefits) - -\nThe tax effect of temporary differences that give rise to the deferred tax assets is as follows:\nSchedule of Deferred Tax Assets\nNet operating loss carryforward $ 36,361 $ 36,549\nValuation allowance (36,361 ) (36,549 )\nNet deferred tax assets $ - $ -\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. At September 30, 2022, the Company has net operating losses (NOL) of approximately $637,000. Under IRS Code Section 382, the annual allowable NOL deduction will be limited to $31,000 per year for years 2011-2015 due to a change in control that occurred in 2015. Therefore, the Companys NOLs available after Section 382 limitations is approximately $147,000.\nA valuation allowance is established if it is more likely than not that all or a portion of the deferred tax asset will not be realized. Accordingly, a valuation allowance was established at September 30, 2022 and 2021 for the full amount of our deferred tax assets due to the uncertainty of realization. Management believes that based upon its projection of future taxable operating income for the foreseeable future, it is more likely than not that the Company will not be able to realize the benefit of the deferred tax assets at September 30, 2022 and 2021.\nNote 6 - Commitments and Contingencies\nFrom time to time, we may be involved in litigation relating to claims arising out of our operations in the normal course of business. As of September 30, 2022 and 2021, there were no pending or threatened lawsuits that could reasonably be expected to have a material effect on our results of operations.\nNote 7 - Concentrations\nDuring the fiscal years ended September 30, 2022 and 2021, 100% of the Companys revenue was derived from Landmark-Pegasus, a related party, a direct client of Landmark-Pegasus. Landmark-Pegasus is wholly owned by John Moroney, who beneficially owns approximately 59.8% of the Companys common stock. Mr. Moroney also acts as Landmark-Pegasus President and is Landmark-Pegasus sole director. As of September 30, 2022 and 2021, the Companys accounts receivable of $5,000 is due from this related party, ITEM 9. CHANGES AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe carried out an evaluation required by Rule 13a-15(b) of the Securities Exchange Act of 1934, as amended (the Exchange Act), under the supervision and with the participation of our management, including our Chief Executive Officer and principal financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures, as such term is defined in Exchange Act Rule 13a-15(e). Disclosure controls and procedures are designed with the objective of ensuring that (i) information required to be disclosed in an issuers reports filed under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC rules and forms and (ii) information is accumulated and communicated to management, including our Chief Executive Officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosures.\nThe evaluation of our disclosure controls and procedures included a review of our objectives and processes and effect on the information generated for use in this report. This type of evaluation is done quarterly so that the conclusions concerning the effectiveness of these controls can be reported in our periodic reports filed with the SEC. We intend to maintain these controls as processes that may be appropriately modified as circumstances warrant.\nBased on their evaluation, our Chief Executive Officer and principal financial officer has concluded that our disclosure controls and procedures are not effective in timely alerting our Chief Executive Officer and principal financial officer to material information which is required to be included in our periodic reports filed with the SEC as of the end of the period covering this annual report on Form 10-K.\nManagements Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). Under the supervision and with the participation of our management, including our Chief Executive Officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of September 30, 2022, based on the criteria set forth in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013). Based on this evaluation, our management concluded that our internal control over financial reporting was not effective as of September 30, 2022.\nA control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Management necessarily applied its judgment in assessing the benefits of controls relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected. The design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions, regardless of how remote. Because of the inherent limitations in a control system, misstatements due to error or fraud may occur and may not be detected.\nThis annual report on Form 10-K does not include an attestation report of our independent registered public accounting firm regarding the Companys internal control over financial reporting. We were not required to have, nor have we engaged our independent registered public accounting firm to perform, an audit on our internal control over financial reporting pursuant to the rules of the SEC that permit us to provide only managements report in this annual report on Form 10-K.\nChanges in Internal Control Over Financial Reporting\nDuring our most recent fiscal year, there has not been any change in our internal control over financial reporting as such term is defined in Exchange Act Rule 13a-15(f) that has materially affected, or is reasonably likely to affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table sets forth the name, position and age of our sole director and executive officer as of the date of this annual report on Form 10-K. Our directors are elected by our stockholders at each annual meeting and serve for one year and until their successors are elected and qualified. Officers are elected by our board of directors and their terms of office are at the discretion of our board.\nName\nAge\nPosition\nJeffrey A. Lubchansky\nChairman of the Board, Director, President and Chief Executive Officer\nBiographical information concerning our director and executive officer listed above is set forth below.\nJeffrey A. Lubchansky. Mr. Lubchansky has served as the Companys President, Chief Executive Officer and Chairman of the Board since October 2015. He is a Certified Public Accountant who has been at the forefront of integrating technology into the accounting field and providing leadership in management, taxation and accounting in various industries. These industries include sports/entertainment, real estate, financial institutions, highly compensated individuals, nutraceuticals, health and beauty, medical devices, audio/visual and consulting and tax services to CPA firms and attorneys.\nFrom January 2015 until June 2015, Mr. Lubchansky served as interim CFO and provided crisis management services for a major private label beauty products manufacturer. In this role, his main function was to bring the company into compliance with various bank covenant reporting requirements, to prepare the work papers for the year-end review and to implement various internal control procedures.\nFrom 2014 through January 31, 2019, Mr. Lubchansky has acted as Controller for Alacriti, Inc., a leading provider of e-commerce services to numerous financial and operating entities. Also, since 2010, Mr. Lubchansky has maintained a tax and consulting practice specializing in providing CFO/controller services to individuals and small- to medium-sized companies. Between 2006 and 2009, Mr. Lubchansky served as CFO of Juvent Medical, Inc., responsible for the integrity of financial information and systems for this CE-certified medical device manufacturer. From 2004 until 2009, he also served as CFO/controller at Gary Null & Associates, a company involved in the nutraceutical and health products industry. From 2001 until 2007, Mr. Lubchansky served as the controller for Alero Capital Corp.\nMr. Lubchansky earned his B.S. in Accounting with a Minor Degree in Computer and Information Sciences. Early in his career, he worked with major computer manufacturers and software companies to develop accounting software for numerous industries. He is an avid photographer and has been published in numerous periodicals, texts and technical publications.\nCode of Ethics . We have adopted a code of ethics that applies to our directors, officers and all employees, including but not limited to our principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions. The code of ethics may be obtained free of charge by writing to Wall Street Media Co, Inc., Attn: Chief Executive Officer, 110 Front Street - Suite 300, Jupiter, FL 33477. ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table. The following table sets forth certain information concerning the compensation of Mr. Lubchansky, our President and Chief Executive Officer, during the last two fiscal years.\n(a) (b) (c) (d) (e) (f) (g) (h) (i) (j)\nName and Principal Position Year Salary Bonus Stock\nAwards Option\nAwards Non-equity\nIncentive\nplan\ncompensation Nonqualified\nDeferred\nCompensation\nearnings All Other\nCompensation Total\nCompensation\nJeffrey A. Lubchansky,\nPresident and Chief Executive Officer\n$ 19,000 0 $ 19,000\n$ 19,000 0 $ 19,000\nOutstanding Equity Awards at Fiscal Year End. There were no outstanding equity awards as of September 30, 2022.\nCompensation of Directors. Mr. Lubchansky, our President and Chief Executive Officer, is our sole director. No compensation was paid to Mr. Lubchansky in his capacity as a director during the fiscal years ended September 30, 2022 and 2021. In the future, we may seek additional qualified candidates to serve on the Board of Directors and at that point, we may develop a compensation package to offer to members of the Board of Directors and its committees.\nAudit, Compensation and Nominating Committees. Considering the fact that we are an early stage company, we do not maintain standing audit, compensation or nominating committees. The functions typically associated with these committees are performed by the entire Board of Directors which currently consists of one member (Mr. Lubchansky) who is not considered independent. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth, as of September 30, 2022, certain information with respect to the beneficial ownership of shares of our common stock by: (i) each person known to us to be the beneficial owner of more than five percent (5%) of our outstanding shares of common stock, (ii) each director or nominee for director of our Company, (iii) each of the named executive officers , and (iv) our directors and executive officers as a group. Unless otherwise indicated, the address of each shareholder is c/o our Company at our principal office address:\nBeneficial Owner Address Amount and\nNature of\nBeneficial\nOwnership (1)\nPercent of Class (2)\nNamed Executive Officers and Directors:\nJeffrey A. Lubchansky\n2,900 *\nAll directors and executive officers as a group (1 person)\n2,900 *\n5% Stockholders:\nJohn Moroney P.O. Box 1095\n1095 Military Trail\nJupiter, FL 33468 16,094,466 (3) 59.8 %\nNathan Fink 470 New Milford Ave.\nOradell, NJ 07640 4,000,000 14.9 %\n* Less than 1%.\n(1) Beneficial ownership is determined in accordance with the rules of the SEC which generally attribute beneficial ownership of securities to persons who possess sole or shared voting power and/or investment power with respect to those securities. Unless otherwise indicated, voting and investment power are exercised solely by the person named above or shared with members of such persons household. This includes any shares such person has the right to acquire within 60 days.\n(2) Percent of class is calculated on the basis of the number of shares outstanding on September 30, 2022 (26,922,006 shares of common stock).\n(3) Represents shares of common stock held jointly by Mr. Moroney and his spouse.\nSecurities Authorized for Issuance under Equity Compensation Plans\nAs of September 30, 2022, we did not have any securities authorized for issuance under any equity compensation plans, whether approved or not approved by our stockholders. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nWe do not have a written policy for the review, approval or ratification of transactions with related parties or conflicted transactions. When such transactions arise, they are referred to our Board of Directors for its consideration.\n$60,000 and $72,500, or 100% of the Companys revenue during the fiscal years ended September 30, 2022 and 2021, respectively, was derived from Landmark-Pegasus, a related party. Landmark-Pegasus is wholly owned by John Moroney, who beneficially owns approximately 59.8% of the Companys common stock. Mr. Moroney also acts as Landmark-Pegasus President and is Landmark-Pegasus sole director. Currently, the Companys services are provided solely to Landmark-Pegasus and to a client of Landmark-Pegasus. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nWe do not currently have an audit committee; however it is our policy to have all audit and audit-related fees pre-approved by the Board of Directors.\nThe Board of Directors reviews and approves audit and permissible non-audit services performed by its independent registered public accounting firm, as well as the fees charged for such services. In its review of non-audit service and its appointment of D. Brooks & Associates as our independent registered public accounting firm, the Board of Directors considered whether the provision of such services is compatible with maintaining independence. All of the services provided and fees charged by our independent registered public accounting firm in 2022 and 2021 were approved by the Board of Directors.\nThe following table shows the fees that were billed for the audit and other services provided by D. Brooks & Associates, CPAs, PA for the fiscal years ended September 30, 2022 and 2021:\nAudit Fees (1) $ 16,500 $ 16,500\nAudit-Related Fees (2)\n$ 0 $ 0\nTax Fees (3) $ 0 $ 0\nAll Other Fees (4) $ 3,500 $ 3,500\n(1) Audit Fees: This category includes the audit of our annual financial statements, review of financial statements included in our Quarterly Reports on Form 10-Q and services that are normally provided by the independent registered public accounting firm in connection with engagements for those fiscal years. This category also includes advice on audit and accounting matters that arose during, or as a result of, the audit or the review of interim financial statements.\n(2) Audit-Related Fees: This category consists of assurance and related services by the independent registered public accounting firm that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees. No audit-related fees were billed by Brooks during the fiscal years ended September 30, 2022 or 2021.\n(3) Tax Fees: This category consists of professional services rendered by our independent registered public accounting firm for tax compliance and tax advice. The services for the fees disclosed under this category include tax return preparation and technical tax advice. No tax fees were billed by Brooks during the fiscal years ended September 30, 2022 or 2021.\n(4) All Other Fees: This category consists of fees for other miscellaneous items.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a)(1) Financial Statements\nThe financial statements and Report of Independent Registered Public Accounting Firm are listed in the Index to Financial Statements and Schedules on page and included on pages through.\n(2) Financial Statement Schedules\nAll schedules for which provision is made in the applicable accounting regulations of the SEC are either not required under the related instructions, are not applicable (and therefore have been omitted), or the required disclosures are contained in the financial statements included herein.\n(3) Exhibits.\nExhibit No.\nExhibit Type\n3.1*\nArticles of incorporation of the registrant dated January 6, 2009.\n3.2\nCertificate of amendment to articles of incorporation of the registrant dated September 21, 2009 (incorporated by reference to Exhibit 3.2 to the registrants registration statement on Form S-1 (File No. 333-163439) filed with the Commission on December 2, 2009).\n3.3*\nCertificate of change to articles of incorporation of the registrant dated November 14, 2012.\n3.4*\nCertificate of amendment to articles of incorporation of the registrant dated November 14, 2012.\n3.5\nCertificate of amendment to articles of incorporation of the registrant dated August 20, 2013 (incorporated by reference to Exhibit 3.1 to the registrants Current Report on Form 8-K filed with the Commission on September 19, 2013).\n3.6\nBylaws of the registrant (incorporated by reference to Exhibit 3.2 to the registrants registration statement on Form S-1 (File No. 333-163439) filed with the Commission on December 2, 2009).\n10.1\nPromissory Note dated November 24, 2014 made by the registrant in favor of Landmark Pegasus, Inc. (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on November 25, 2014).\n10.2\nIndemnification Agreement between the registrant and Jeffrey A. Lubchansky (incorporated by reference to Exhibit 10.1 to the registrants Quarterly Report on Form 10-Q for the quarter ended March 31, 2016).\n14.1\nCode of Ethics (incorporated by reference to Exhibit 14.1 to the registrants registration statement on Form S-1 (File No. 333-163439) filed with the Commission on December 2, 2009).\n31.1\nCertification of Principal Executive and Financial Officer (Section 302)\n32.1\nCertification of Principal Executive and Financial Officer (Section 906)\n101.INS*\nInline XBRL Instance\n101.SCH*\nInline XBRL Taxonomy Extension Schema\n101.CAL*\nInline XBRL Taxonomy Extension Calculation\n101.DEF*\nInline XBRL Taxonomy Extension Definition\n101.LAB*\nInline XBRL Taxonomy Extension Labels\n101.PRE*\nInline XBRL Taxonomy Extension Presentation\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed herewith.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nWall Street Media Co, Inc.\nDate: December 19, 2022\n/s/ Jeffrey A. Lubchansky\nJeffrey A. Lubchansky\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following person on behalf of the registrant and in the capacities and on the date indicated.\nSignature\nTitle\nDate\n/s/ Jeffrey A. Lubchansky\nPresident, Chief Executive Officer and Director (principal executive officer and principal financial officer)\nDecember 19, 2022\nJeffrey A. Lubchansky"
}