{
    "cik": "1481028",
    "company": "SUNHYDROGEN, INC.",
    "filing_type": "10-K",
    "filing_date": "2022-10-07",
    "period_of_report": "2022-06-30",
    "sic": "3674",
    "state_of_inc": "NV",
    "state_location": "IA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1481028/0001213900-22-062803-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1481028/000121390022062803/f10k2022_sunhydrogen.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1481028/0001213900-22-062803.txt",
    "filename": "1481028_10K_2022_0001213900-22-062803.htm",
    "content": "Item 1. Business.\nUnless otherwise stated or the context requires otherwise, references in this annual report on Form 10-K to SunHydrogen, the Company, we, us, or our refer to SunHydrogen, Inc.\nOverview\nAt SunHydrogen, our goal is to replace fossil fuels with clean, renewable hydrogen.\nHydrogen is the most abundant chemical element in the universe. When hydrogen fuel is used to power transportation and industry, the only byproduct left behind is pure water, unlike hydrocarbon fuels such as oil, coal and natural gas that emit carbon dioxide and other harmful pollutants into the atmosphere. However, naturally occurring elemental hydrogen is rare - so rare, in fact, that today about 95% of hydrogen is produced from steam reforming of natural gas (Source: US Department of Energy, Hydrogen Fuel Basics). This process is both economically and environmentally unsound.\nThe SunHydrogen solution offers an efficient and cost-effective way to produce truly green hydrogen using sunlight and any source of water. Our core technology is a self-contained, nanoparticle-based hydrogen generator that mimics photosynthesis to split water molecules, resulting in hydrogen. By optimizing the science of water electrolysis at the nano-level, we believe we have developed a low-cost method to potentially produce environmentally friendly renewable hydrogen.\nWe believe renewable hydrogen has already proven itself to be a key solution in helping the world meet climate targets, and we believe our technology potentially offers solutions to the challenges that the hydrogen future presents, including cost of production and transportation.\nBecause our process only requires sunlight and water, our technology can be installed near the point of hydrogen use. This eliminates the need for pipelines and trucks that result in high carbon emissions and high capital investment. Additionally, because our process directly uses the electrical charges created by sunlight to generate hydrogen, our nanoparticle technology does not rely on grid power or require the costly power electronics that conventional electrolyzers do.\nWith a target cost of $2.50/kg., we aspire for our technology to be cost-competitive with brown hydrogen and below the cost of clean hydrogen competitors. We believe our solution has the potential to clear a path for green hydrogen to compete with natural gas hydrogen and gain mass market acceptance as a true replacement for fossil fuels.\nOur technology is primarily developed at three laboratories - our independent laboratory in Coralville, Iowa, the SunHydrogen laboratory at the University of Iowa, and the Singh laboratory at University of Michigan.\nA longtime development partner to SunHydrogen, The Iowa research team has worked over the past several years to lead the scale-up of our technology.\nWe started 2022 with the addition of an additional research and development laboratory to fuel our goal of scaling up our nanoparticle-based green hydrogen technology. The Coralville, Iowa laboratory space has enabled us to hire several new senior engineers and chemists and accelerate our developmental targets toward commercialization.\nLed by Chief Scientific Officer Dr. Syed Mubeen and Director of Technology Dr. Joun Lee, the Iowa research team is focused on building tandem photoelectrosynthetic heterostructures (nanoparticle-based tandem semiconductor units) and evaluating their manufacturability at scales relevant for commercialization. This involves porous substrate fabrication and development of SunHydrogens two proprietary semiconductor nanoparticle units within these porous substrates (dual junction devices).\nIn the past year, the Iowa team has met several key developmental milestones in the path to achieving a production-quality prototype of our nanoparticle technology, including the following:\n(1) Developed a robust fabrication toolkit to scale porous anodic alumina on transparent conducting oxide substrates in which the tandem nanoparticle units will be fabricated. This achievement aided SunHydrogens industry partner InRedox in successfully developing a high-throughput substrate fabrication process.\n(2) Developed facile deposition chemistries to fabricate semiconductors, interconnects, and contacts needed for tandem nanoparticle devices. This achievement aided the work of our industry partner MSC Co. LTD, who is supplying SunHydrogen with bulk chemicals for nanoparticle growth.\n(3) Successfully fabricated both of our proprietary semiconductor units and demonstrated photocurrents greater than 10 mA/cm2 for each unit and photovoltages greater than 800 mV for each unit in substrates relevant for prototype demonstration.\n(4) Demonstrated dual junction devices with photovoltages that exceed the theoretical voltage needed for water-splitting.\nIn June 2022, we announced that we achieved successful fabrication of one of our two proprietary semiconductor units at production-quality prototype scale. The Iowa team thoroughly tested its ability for hydrogen production using sunlight and water containing organics derived from biomass resources.\nIn this announcement, we also shared that persisting supply chain challenges have delayed fabrication of our second proprietary semiconductor unit at production-quality prototype scale. However, the Iowa research team has identified alternate solutions to successfully fabricate our second proprietary nanoparticle semiconductor unit at production-quality prototype scale. These solutions include pairing one of the SunHydrogens proprietary semiconductor unit on Silicon Heterojunction solar cells, Perovskite solar cells, or CdTe-based solar cells. The Iowa team recently had success in pairing one of SunHydrogens proprietary semiconductor units with Silicon and Perovskite cells and demonstrated solar hydrogen production. The team is currently optimizing this alternate approach to maximize solar-to-hydrogen efficiency using device housing developed by SunHydrogens industry partners. Moving forward, the team will develop novel deposition chemistry that is vendor independent for growing the second semiconductor unit while working with other solar cells in parallel. Solar-to-hydrogen efficiency for both the approaches will be evaluated using devices fabricated in prototype relevant scales.\nOutside of our central research and development hub in Iowa, weve entered into a sponsored research agreement with the University of Michigan and further expanded our industrial partnerships across the U.S., Germany, South Korea, and Japan. Our current industrial partners include: SCHMID Group of Germany; MSC Co. LTD of South Korea; Geomatec of Japan; Ionomr Innovations of British Columbia; Chromis Technologies of New Jersey; Optimum Anode of California; and RuC2N of South Korea.\nBy diversifying our commercialization strategy in this way, we have been able to form relationships with industrial partners who are specialized in individual components of our technology such as electroplating, substrate processing and catalyst/membrane integration.\nSCHMID Group will focus on the design and engineering of our generator housing as we continue scaling our technology to larger dimensions. InRedox and MSC Co. LTD are focused on substrate manufacturing and electroplating chemistries, respectively. Geomatec is also working to facilitate our transition to large-scale substrate manufacturing.\nWe are working with Ionomr Innovations and Chromis Technologies to integrate both proton exchange membranes (PEM) and anion exchange membranes (AEM) into our proprietary substrates and evaluate performance metrics for sustainable hydrogen production.\nWith our newest partners, Optimum Anode and RuC2N, we are working to achieve successful catalyst integration and identify the best catalyst for hydrogen and oxygen production.\nLed by Dr. Nirala Singh, one of the lead inventors on SunHydrogen Patent No. 9,593,053B1, the University of Michigan team is focused on understanding the requirements of the generator housing and optimizing and testing potential oxygen evolution and hydrogen evolution electrocatalysts to accelerate scaleup and increase efficiency of photoelectrochemically active heterostructures. In the past year, they have demonstrated deposition of oxygen evolution and hydrogen evolution catalysts through atomic layer deposition and tested these materials for their ability to catalyze oxygen evolution and hydrogen evolution. The hydrogen evolution catalysts match the best performing catalysts and can be deposited on our solar cell materials with low thickness to mitigate parasitic light absorption. The atomic layer deposited oxygen evolution catalyst did not match the necessary metrics for further evaluation. However, using a sputtering technique, they synthesized an oxygen evolution electrocatalyst that can match the state-of-the-art oxygen evolution catalysts in the open literature. With these two catalysts, the solar cell voltage provided upon illumination is sufficient to produce hydrogen at high rates. These catalysts are being integrated with the systems used at University of Iowa.\nUniversity of Michigan also identified membrane-to-light absorber integration strategies to help optimize the generator housing dimensions, in collaboration with InRedox. They evaluated the voltage losses in various potential systems to identify the most promising configurations and eliminate configurations that would result in significant energy losses. The most promising systems were sent to Ionomr Innovations and Chromis Technologies to integrate membranes for testing of energy losses and stability. A model to scale up to multi-wafer systems was developed and is being validated. This model incorporated the entire system including generator housing, oxygen evolution catalyst, and hydrogen evolution catalyst and also helps identify the most important components for further increasing hydrogen production efficiency.\nLooking ahead to the final months of 2022, we continue making steady progress toward the developmental targets we initially set for the year, which include:\n● Successful fabrication of semiconductor units at production-quality prototype scales\n● Successful integration of membranes at production-quality prototype scales\n● Successful integration of catalysts at production-quality prototype scales\n● Successful testing and demonstration of production-quality prototype units\nWe have a dedicated scientific and executive team, a growing number of respected industrial partners, and we will continue doing our best to push past any setbacks or supply chain challenges that come our way.\nAdditionally, we are well-capitalized to begin pursuing strategic investments in the hydrogen space. We are actively pursuing opportunities for investment and acquisition of complimentary hydrogen technologies, and we are fortunate to have the resources to maximize our impact in this fast-growing industry.\nMarket Opportunity\nHydrogen generation is projected to become a $1 trillion per year market by 2050 (Source: Goldman Sachs, Carbonomics: The clean hydrogen revolution). Current fossil fuels cant sustain future energy requirements environmentally or economically, and hydrogen fuel technologies are being adopted across all sectors as the world moves toward renewable alternatives.\nOver 110 countries have set goals to achieve net-zero emissions by 2050, and as governments are looking to clean energy sources like hydrogen to help them meet their targets (Source: United Nations, The race to zero emissions, and why the world depends on it). It is estimated that nearly 25% of global energy will come from clean hydrogen alone by 2050 (Source: Goldman Sachs, Green Hydrogen: The next transformational driver of the Utilities industry).\nIn the US, California is leading the way in hydrogen strategies, with more fuel cell passenger vehicles on the road than any other state and one of the largest hydrogen refueling station networks in the world (Source: Sierra Nevada Ally, Hydrogen Fuel Cell Vehicles are Building Momentum in California). Globally, over 320 green hydrogen production demonstration projects have been announced, and governments around the world have put forth ambitious strategies to utilize hydrogen and fuel cell technologies across all sectors of the economy including transportation, feedstock and industrial heat use (Source: International Energy Agency, Hydrogen Projects Database).\nExisting Market Growth\nIn August 2022, The Inflation Reduction Act, which allots $369 billion to renewable energy and climate projects, was signed into law in the US, and it is already reshaping the hydrogen market and the larger clean energy market as we know it. Among its features, the law has a 10-year extension of solar and wind tax credits and incentives to support new technology, with hydrogen and energy storage set to be the greatest beneficiaries, according to Morningstars chief US market strategist Dave Sekera (Source: Markets Insider, Clean energy stocks are set to be the big winners of the sweeping Inflation Reduction Act just signed by Biden, Morningstar says).\nSpecifically, the Act includes a new tax credit that will award up to $3/kg for low carbon hydrogen, with exact credit amounts to be determined by calculating a given projects greenhouse gas emissions (Source: S&P Global, Hydrogen tax credits preserved in new US Inflation Reduction Act).\nThe Inflation Reduction Acts passage also followed a summer of surging gas prices and increased demand for gasoline. As supply chain challenges and geopolitical conflicts continue to affect fuel prices globally, the hydrogen market is rallying support and interest from consumers and governments alike.\nAn additional factor currently driving the global hydrogen market is the need to reduce sulfur content in petroleum products. U.S. federal and state governments have adopted various programs, including the Tier 3 program, to reduce the sulfur content in gasoline, motor oil and diesel. Particularly, there is a growing demand for petroleum products from developing countries. Hydrogen is used in various refining processes including hydrocracking and hydrodesulfurization to crack bigger molecules into lighter ones and produce more usable products.\nFor all these reasons and more, we believe our renewable hydrogen-producing technology possesses significant early market opportunity, especially as innovation and infrastructure continue to develop.\nHydrogen Mobility\nThe auto manufacturing and vehicle industries are among the most recognized applications for hydrogen fuel technologies. According to a 2022 study by Information Trends, close to 44,000 hydrogen fuel cell vehicles had been sold by year-end 2021 since their sales first began. Historically, sales have been held back due to the lack of a solid hydrogen refueling infrastructure, but the numbers are projected to rise quickly, and fuel cell vehicles are gaining momentum around the world. In another study, Information Trends projected that close to 600,000 hydrogen fuel cell buses and minibuses will be in service by 2035 (Source: Information Trends, Global Market for Hydrogen Fuel Cell Buses).\nIn California, labor leaders and CEOs of some of the worlds leading auto and energy companies including Toyota, Hyundai, Chevron, Shell, and more are urging Governor Gavin Newsom to invest in hydrogen to meet climate goals. The joint letter, published in August 2022, calls on Newsom to allocate $300 million in the state budget to fund the final construction of 1,000 hydrogen fueling stations statewide in the next decade (Source: California Hydrogen Coalition, Labor Leaders, CEOs Call on Governor Newson to Invest in Hydrogen to Meet Climate Goals).\nAdditionally, hydrogen has emerged as an ideal solution for a myriad of mobility-related applications beyond fuel cell vehicles.\nIn a 2022 report from the Ocean Conservancy, researchers concluded that green hydrogen-based fuels are the best option to transition the shipping industry away from fossil fuels. Producing green hydrogen-based fuels can kickstart the transition to new shipping fuels along promising green corridor routes within the U.S. and can make key down payments that will drive further investment in renewable energy and feed the demand for climate action within the global transportation sector, said Daniel Hubbell, shipping emissions campaign manager for Ocean Conservancy (Source: Ocean Conservancy, Green Hydrogen-Based Fuels are the Best Option to Transition the Shipping Industry Away from Fossil Fuels, New Report Finds).\nIn the long-haul trucking industry, hydrogen fuel cells present a zero-emission solution where battery-electric vehicles would be too heavy for the job (Source: Truck News, Hydrogen fuel cells ready for work in work trucks). According to speakers at the 2022 Green Truck Summit, however, hydrogen fuel cells may also be well-suited for work trucks that make shorter-term journeys. Very high utilization vehicles, to go zero emission, absolutely need hydrogen, said Craig Knight, CEO of Hyzon Motors. The sweet spot for fuel cells is the dead zone for diesel engines. These are the vehicles that stop and start all the time. These are the vehicles that spend so much time on idle. These are the vehicles with massive PTO loads or refrigeration, Knight continued. So, the best use cases are drayage, refrigerated trucks, concrete trucks, garbage trucks - all these things with the significant auxiliary loads. (Source: Truck News, Hydrogen fuel cells ready for work in work trucks).\nIn August 2022, Germany introduced the first-ever rail line to be entirely run on hydrogen-powered trains. Fourteen hydrogen trains powered by fuel cell propulsion will exclusively run on the route in Bremervörde, Lower Saxony, CNN reported. The trains have a range of 1,000 kilometers, meaning they can run for an entire day on the network on a single tank of hydrogen, and a hydrogen filing station has already been established on the route (Source: CNN, The worlds first hydrogen-powered passenger trains are here).\nHydrogen is even powering factory forklifts for commerce leaders like Walmart and Amazon: In April 2022, Walmart purchased hydrogen from Plug Power to fuel as many as 9,500 machines across the retailers fulfillment and distribution centers (Source: Bloomberg, Walmart Will Run Forklifts on ‘Green Hydrogen in Plug Power Deal). Amazon and Plug Power entered a similar agreement in August 2022, with Plug Power providing Amazon with 10,950 tons of liquefied hydrogen per year that will be used to fuel transportation and building operations starting in 2025 (Source: Forbes, Amazon To Buy Plug Powers ‘Green Hydrogen In Deal with $2.1 Billion Stock Option). Along with fuel for forklifts, Amazon may also use hydrogen to power a range of vehicles used in delivery operations, including long-haul trucks, the article stated.\nWhether in traditional vehicles, marine ships, long-haul trucks, trains, or even factory forklifts, it is clear that hydrogen has already made a significant mark on the mobility industry, and we only expect it to become more prolific as governments continue to support the development of relevant infrastructure that the hydrogen future calls for.\nOur Technology\nTechnology for Making Renewable Hydrogen from Sunlight and Water\nPowered by solar energy, billions of our microscopic nanoparticles split apart water at the molecular level, extracting hydrogen for use as a clean energy source and leaving behind only clean oxygen as a byproduct. This process is similar to what happens inside a plant cell during photosynthesis: Each Photoelectrosynthetically Active Heterostructures (or PAH) nanoparticle is a microscopic machine, composed of multiple layers enabling the solar electrolysis reaction to take place.\nWater Splitting\nIn the process of splitting a water molecule, input energy is transferred into the chemical bonds. Essentially, manufactured hydrogen serves as a carrier or battery-like storage of the input energy. If the input energy is from fossil fuels, such as oil and gas, then carbon fossil fuel energy is simply transferred into hydrogen. If the input energy is renewable, such as solar or wind, then new and clean energy is stored in hydrogen.\nWhile the concept of water splitting is very appealing, the following industry-wide challenges must be addressed for renewable hydrogen to be commercially viable:\n● Energy Inefficiency - Since hydrogen is an energy carrier, the most energy it can store is 100% of the input energy. However, conventional electrolysis methods lose much of the input energy in system components, wires and electrodes resulting in only a small portion of electricity making it into the hydrogen molecules. This translates to high production cost and is the fundamental problem with water splitting for hydrogen production. We intend to address this problem with our low-cost and energy-efficient nanoparticle technology.\n● Need for Clean Water - Conventional electrolysis requires highly purified clean water to prevent fouling of system components. This prevents current technology from using large quantities of available water from oceans, rivers, industrial waste and municipal waste as feedstock. Our technology is being designed to use any natural water or waste water for the unlimited production of renewable hydrogen.\nTechnology\nWater electrolysis in its simplest form is the transfer of input electrons in the following chemical reactions:\n● Cathode (reduction): 2H2O + 2e- ® H2 + 2OH-\n● Anode (oxidation): 4OH- ® O2 + 2H2O + 4 e-\nFrom these equations, one can deduce that if every input electron (e-) is put to work and not lost, then a maximum amount of input electrons (i.e. energy) is transferred and stored in the hydrogen molecules (H2). Additionally, if there were a very high number of cathode and anode reaction areas within a given volume of water, then a very high number of these reactions could happen simultaneously throughout the medium to split each water molecule into hydrogen wherever electrons are available.\nSunHydrogen Panel™\nSince our particles are intended to mimic the natural process of photosynthesis, directly producing hydrogen and oxygen without the need for costly intermediate power conversions, they can be housed in very low-cost reactors. To facilitate the commercial use of our self-contained particle technology, we are developing a modular system that will enable the onsite daily production and storage of hydrogen for any-time use in electricity generation.\nWe refer to our potential product as the SunHydrogen Panel which is comprised of the following components:\n1. The Generator Housing - Our novel device design is the first of its kind to safely separate oxygen and hydrogen in the photoelectrochemical process, minimizing the sacrifice of solar-to-hydrogen efficiency. This device houses the water and the solar particles/cells and is designed with inlets and outlets for water and gasses. Utilizing a novel ion-exchange membrane integration strategy for separating the oxygen from the hydrogen products, efficient ion transport safely enables efficient solar hydrogen production.\n2. The NanoParticle or Solar Cell - Powered by solar energy, billions of our microscopic nanoparticle solar cells split apart water at the molecular level, extracting hydrogen for use as a clean energy source and leaving behind only clean oxygen as a byproduct.\n3. Oxygen Evolution Catalyst - Uniformly applied to the solar cell or nanoparticle, an oxygen evolution catalyst efficiently oxidizes water molecules to generate oxygen gas. The oxygen evolution catalyst must be robust to withstand long operating hours under acidic and alkaline conditions.\n4. Hydrogen Evolution Catalyst - Necessary for collecting electrons to reduce protons for generating hydrogen gas, we have identified a strategy to minimize the use of precious metal-based catalysts and integrated the hydrogen catalyst into our generator system for efficient solar hydrogen production.\n5. Coating Technologies - Two major coating technologies were developed to protect the nanoparticles and solar cells from photocorrosion under water: A transparent conductive coating to protect our nanoparticles and solar cells from photocorrosion during the water splitting process and efficiently transfer charges to catalysts for oxygen and hydrogen evolution reactions; and a polymer combination that protects the semiconductor solar cells that would otherwise fail in aquatic environments, instead ensuring a long lifetime for solar hydrogen production.\nIn the process of optimizing our nanoparticles to be efficient and only use earth abundant materials (an ongoing process), we experimented with commercially available triple junction solar cells to perform tests with our generator housing and other components. Through this experimentation, our discovery led us to believe that we could bring a system (Gen 1) to market utilizing these readily available cells while our nanoparticles are still being optimized. While these solar cells also absorb sunlight and produce the necessary charge for splitting the water molecules into hydrogen and oxygen, their efficiency is low, thus we have made the strategic decision to focus on our NanoParticle strategy (Gen 2) and use the Gen 1 hydrogen generators for proof of concept purposes only.\nOur business and commercialization plan utilizes our second generation of hydrogen panels featuring the nanoparticle-based technology where billions of autonomous solar cells are electrodeposited onto protective porous sheets and manufactured in a roll to roll process or wafer process and inserted into our proprietary panels. For this generation, we have received multiple patents and our target cost of hydrogen production is $2.50 per kilogram before pressurization.\nIn addition to our sponsored research agreements with the University of Iowa and University of Michigan, we are working with a growing group of specialized industrial partners to help commercialize our renewable hydrogen panels that use sunlight and water to generate hydrogen. Our current industrial partners include: SCHMID Group of Germany; MSC Co. LTD of South Korea; Geomatec of Japan; Ionomr Innovations of British Columbia; Chromis Technologies of New Jersey; Optimum Anode of California; and RuC2N of South Korea.\nSCHMID Group will focus on the design and engineering of our generator housing as we continue scaling our technology to larger dimensions. InRedox and MSC Co. LTD are focused on substrate manufacturing and electroplating chemistries, respectively. Geomatec is also working to facilitate our transition to large-scale substrate manufacturing. Ionomr Innovations and Chromis Technologies are working to integrate both proton exchange membranes (PEM) and anion exchange membranes (AEM) into our proprietary substrates and evaluate performance metrics for sustainable hydrogen production. With Optimum Anode and RuC2N, we are working to achieve successful catalyst integration and identify the best catalyst for hydrogen and oxygen production.\nIntellectual Property\nOn November 14, 2011, we filed a provisional application with the U.S. Patent and Trademark Office to protect the intellectual property rights for Photoelectrosynthetically Active Heterostructures A year later on November 14, 2012, we filed a non-provisional application claiming priority to the provisional application. On March 14, 2017, a first patent covering the structural design of Photoelectrosynthetically Active Heterostructures (PAH) was granted as United States Patent No. 9,593,053B1. A divisional application claiming priority to the foregoing applications was filed, and on April 3, 2018, a second patent covering the method for manufacturing PAH was granted as United States Patent No. 9,593,053B2. These patents protect the Companys proprietary design and manufacturing method of a self-contained solar-to-hydrogen device made up of billions of solar-powered water-splitting nanoparticles, per square centimeter. These nanoparticles are separated by a protective coating that prevents corrosion during extended periods of hydrogen production. The aim of producing these nanoparticles is to achieve high solar -to-hydrogen conversion efficiency at low cost. These patents expire on November 14, 2032.\nAn important aspect of the patented technology referred to in the preceding paragraph is the integrated structures of high-density arrays of nano-sized solar cells as part of hydrogen production nanoparticles. The technology enables manufacturing of ultra-thin sheets for solar hydrogen production, requiring substantially less material as compared to conventional solar cells used in rooftop power applications.\nOn March 21, 2014, we jointly filed a provisional application with the University of California, Santa Barbara for the Multi-junction artificial photosynthetic cell with enhanced photovoltages. Thereafter, we filed a non-provisional application on March 16, 2015 and a corresponding PCT Application on March 17, 2015. These applications cover our semiconductor designs to enhance the photovoltages of the nano-sized solar cells in the PAH structures. The semiconductor designs stacking multiple junctions inside the PAH structures would be an efficient and economical solution for the photovoltaic and the photoelectrochemical industries. Patents were granted in Australia in April of 2018, China and Europe in March of 2019, and in the U.S. as United States Patent No. 10,100,415 in October of 2018. A patent application is currently pending in India. This patent expires on October 21, 2036.\nOn September 26, 2016, we filed jointly with the University of Iowa a provisional application for Integrated Membrane Solar Fuel Production Assembly to protect the intellectual property for our generator housing system that safely separates oxygen and hydrogen in the water-splitting process without sacrificing efficiency. This device houses the water, the solar particles/cells and is designed with inlets and outlets for water and gases. Utilizing a special architecture that integrates membranes for separating the oxygen side from the hydrogen side, proton transport is increased which is the key to safely increasing solar-to-hydrogen efficiency. On September 26, 2017, we filed a PCT Application that was later nationalized in the U.S. on March 26, 2019. The U.S. patent application for this important invention is pending and prosecution is ongoing.\nStrategic Partners\nAs of October 1, 2022, we have renewed our sponsored research agreement with the University of Iowa. In the event the research agreement is terminated by the sponsor, the sponsor shall pay all costs accrued by the University as of the date of termination, including non-cancellable obligations. This term of the research agreement runs through September 30, 2023.\nAs of October 1, 2022, the sponsored research agreement with the University of Michigan has been extended through September 30, 2023.\nIn February 2021, we entered into a cooperation agreement with SCHMID Group of Freudenstadt, Germany. Due to delays associated with supply chain challenges brought on by the Covid-19 pandemic, the cooperation agreement was extended to fully complete the work scope with no additional cost to the company. Through the collaboration, we identified key manufacturing needs in the areas of electroplating chemistries, substrate processing and membrane and catalyst integration that require collaboration with specialized industry partners. To address these scale-up challenges, we have since adopted a more diversified scale-up strategy. Our work with SCHMID Group continues with a narrowed concentration. SCHMID Group will focus on the design and engineering of our generator housing as we continue scaling our technology to larger dimensions.\nCompetition\nCurrently, most hydrogen is produced by steam reforming of natural gas or methane. This production technology dominates due to easy availability and low prices of natural gas. Partial oxidation of petroleum oil is second in production capacity after steam reforming of natural gas. The third largest production technology in terms of production capacity is steam gasification of coal. Key players in the traditional hydrogen production industry include Linde, Air Liquide, Air Products, Praxair, and more.\nAt this time, however, we view our primary competition as companies that have developed or are currently developing renewable hydrogen production technology. Green or renewable hydrogen can be produced through electrolyzers if the electrolyzers are powered by renewable energy sources, such as solar or wind. Some of these companies include:\nPlug Power: Plug Power (Stock symbol: PLUG) is engaged in the development of hydrogen fuel cell systems that replace conventional batteries in equipment and vehicles powered by electricity. The company is currently building green hydrogen plants to produce at least 70 tons of liquid green hydrogen daily by the end of 2022 and 500 tons daily by 2025.\nNEL Hydrogen: NEL Hydrogen (Stock symbol: NLLSF) delivers solutions to produce, store, and distribute hydrogen from renewable energy. The companys hydrogen solutions cover the entire value chain from hydrogen production technologies to hydrogen fueling stations, enabling industries to transition to green hydrogen.\nFusion Fuel: Fusion Fuel (Stock symbol: HTOO) has developed a modular solar to hydrogen solution, combining proven solar concentration technology with a proprietary micro-electrolyzer that allows it to produce zero-emissions green hydrogen at highly competitive costs. The company sells its HEVO-Solar technology to customers interested in producing their own green hydrogen. It also develops company-owned green hydrogen farms.\nITM Power: ITM Power (Stock symbol: ITMPF) designs, manufactures, and integrates electrolyzers based on proton exchange membrane technology to produce green hydrogen using renewable electricity and tap water. ITM Power works with strategic partners including Linde, Shell, Snam, Hyundai, and Honda to scale its impact and industrial reach.\nMcPhy: McPhy (Stock symbol: MCPHY) specializes in the design, production and integration of high pressure alkaline electrolyzers and hydrogen stations. McPhy has five development, engineering and production sites in France, Italy, and Germany, and it is backed by solid and constantly-evolving European industrial foundations.\nIf not powered by renewable sources, electrolyzers require external electricity most likely created by coal, gas or oil. We believe that our process when fully developed may potentially offer a competitive advantage as we anticipate it will be fully renewable and utilize no external power other than the sun. However, it should be noted that the renewable hydrogen market is rich with competitors, like the companies mentioned above, who have already successfully commercialized green hydrogen production technologies. We anticipate that existing leaders will continue to hone the efficiency of their products and drive down cost of green hydrogen per kilogram, thus creating a more competitive, challenging environment for emerging, not-yet-commercialized technologies such as our own.\nCorporate Information\nWe were incorporated in the State of Nevada on February 18, 2009. Our executive offices are located at 10 E. Yanonali St., Suite 36, Santa Barbara, CA 93101.\nEmployees\nAs of September 1, 2022, we have 7 full-time employees and several consultants. We have not experienced any work stoppages and we consider relations with our employees and consultants to be good. Our research and development work is performed at our Coralville, Iowa laboratory, as well as with the University of Iowa and the University of Michigan through sponsored research agreements, and in collaboration with our industrial partners. Item 1A. Risk Factors.\nRisks related to our business and industry\nOur limited operating history does not afford investors a sufficient history on which to base an investment decision.\nWe were formed in February 2009 and are currently developing a new technology that has not yet gained market acceptance. There can be no assurance that we will ever operate profitably or that we will have adequate working capital to meet our obligations as they become due.\nInvestors must consider the risks and difficulties frequently encountered by early stage companies, particularly in rapidly evolving markets. Such risks include the following:\n● competition;\n● need for acceptance of products;\n● ability to continue to develop and extend brand identity;\n● ability to anticipate and adapt to a competitive market;\n● ability to effectively manage rapidly expanding operations;\n● amount and timing of operating costs and capital expenditures relating to expansion of our business, operations, and infrastructure; and\n● dependence upon key personnel.\nWe cannot be certain that our business strategy will be successful or that we will successfully address these risks. In the event that we do not successfully address these risks, our business, prospects, financial condition, and results of operations could be materially and adversely affected and we may have to curtail our business.\nWe have a history of losses and have never realized revenues to date. We expect to continue to incur losses and no assurance can be given that we will realize revenues. Accordingly, we may never achieve and sustain profitability.\nAs of June 30, 2022, we have an accumulated deficit of $82,946,019. For the year ended June 30, 2022 we incurred a net income of $90,030,933, due to a non-cash change in derivatives. We expect to continue to incur net losses until we are able to realize revenues to fund our continuing operations. We may fail to achieve any or significant revenues from sales or achieve or sustain profitability. Accordingly, there can be no assurance of when, if ever, we will be profitable or be able to maintain profitability.\nWe have historically raised funds through various capital raising transactions. We will require additional funds in the future to fund our business plans, either through additional equity or debt financings or collaborative agreements or from other sources. We have no commitments to obtain such additional financing, and we may not be able to obtain any such additional financing on terms favorable to us, or at all. In the event we are unable to obtain additional financing, we may be unable to implement our business plan. Even with such financing, we have a history of operating losses and there can be no assurance that we will ever become profitable.\nWe may be unable to manage our growth or implement our expansion strategy.\nWe may not be able to develop our product or implement the other features of our business strategy at the rate or to the extent presently planned. Our projected growth will place a significant strain on our administrative, operational and financial resources. If we are unable to successfully manage our future growth, establish and continue to upgrade our operating and financial control systems, recruit and hire necessary personnel or effectively manage unexpected expansion difficulties, our financial condition and results of operations could be materially and adversely affected.\nWe may not be able to successfully develop and commercialize our technologies which would result in continued losses and may require us to curtail or cease operations.\nWe are currently working to scale the lab-scale prototypes of our nanoparticle technology to larger, commercial-scale prototypes. However, we have not completed a large-scale commercial prototype of our technology and are uncertain at this time when completion of a commercial scale prototype will occur. Although the lab scale prototype demonstrates the viability of our technology, there can be no assurance that we will be able to commercialize our technology.\nOur revenues will be dependent upon acceptance of our products by the market; the failure of which would cause us to curtail or cease operations.\nWe believe that virtually all of our revenues will come from the sale or license of our products. As a result, we will continue to incur substantial operating losses until such time as we are able to develop our product and generate revenues from the sale or license of our products. There can be no assurance that businesses and customers will adopt our technology and products, or that businesses and prospective customers will agree to pay for or license our products. Our technology and product, when fully developed, may not gain market acceptance due to various factors such as not enough cost savings between our method of producing hydrogen and other more conventional methods. In the event that we are not able to significantly increase the number of customers that purchase or license our products, or if we are unable to charge the necessary prices or license fees, our financial condition and results of operations will be materially and adversely affected.\nWe anticipate that we will face intense competition, and many of our competitors have substantially greater resources than we do.\nWe operate in a competitive environment that is characterized by price fluctuation and technological change. We anticipate that we will compete with major international and domestic companies. Some of our current and future potential competitors may have greater market recognition and customer bases, longer operating histories and substantially greater financial, technical, marketing, distribution, purchasing, manufacturing, personnel and other resources than we do. In addition, competitors may be developing similar technologies with a cost similar to, or lower than, our projected costs. As a result, they may be able to respond more quickly to changing customer demands or to devote greater resources to the development, promotion and sales of solar and solar-related products than we can.\nOur business plan relies on sales of our products based on either a demand for truly renewable clean hydrogen or economically produced clean hydrogen. If we fail to compete successfully, our business would suffer and we may lose or be unable to gain market share. Neither the demand for our product nor our ability to manufacture at commercial scale have yet been proven.\nBecause our industry is highly competitive and has low barriers to entry, we may lose market share to larger companies that are better equipped to weather a deterioration in market conditions due to increased competition.\nWe believe that our ability to compete depends in part on a number of factors outside of our control, including:\n● the ability of our competitors to hire, retain and motivate qualified personnel;\n● the ownership by competitors of proprietary tools to customize systems to the needs of a particular customer;\n● the price at which others offer comparable services and equipment;\n● the extent of our competitors responsiveness to customer needs; and\n● installation technology.\nCurrently, competing methods of hydrogen production include steam reforming of natural gas or methane, which dominates due to its easy availability and low price; partial oxidation of petroleum oil; steam gasification of coal; and electrolyzers powered by solar or wind energy. There can be no assurance that we will be able to compete successfully against current and future competitors. If we are unable to compete effectively, or if competition results in a deterioration of market conditions, our business and results of operations would be adversely affected.\nOur business depends on proprietary technology that we may not be able to protect and may infringe on the intellectual property rights of others.\nOur success will depend, in part, on our technologys commercial viability and on the strength of our intellectual property rights. We currently hold patents in the US, China, Australia, and Europe but still have several patents pending in multiple countries. There is no guarantee the pending patents will be granted. In addition, any agreements we enter into with our employees, consultants, advisors, customers and strategic partners will contain restrictions on the disclosure and use of trade secrets, inventions and confidential information relating to our technology may not provide meaningful protection in the event of unauthorized use or disclosure.\nThird parties may assert that our technology, or the products we, our customers or partners commercialize using our technology, infringes upon their proprietary rights. We have yet to complete an infringement analysis and, even if such an analysis were available at the current time, it is virtually impossible for us to be certain that no infringement exists, particularly in our case where our products have not yet been fully developed.\nWe may need to acquire licenses from third parties in order to avoid infringement. Any required license may not be available to us on acceptable terms, or at all.\nWe could incur substantial costs in defending ourselves in suits brought against us for alleged infringement of another partys intellectual property rights as well as in enforcing our rights against others, and if we are found to infringe, the manufacture, sale and use of our or our customers or partners products could be enjoined. Any claims against us, with or without merit, would likely be time-consuming, requiring our management team to dedicate substantial time to addressing the issues presented. Furthermore, the parties bringing claims may have greater resources than we do.\nWe do not maintain theft or casualty insurance and only maintain modest liability and property insurance coverage and therefore, we could incur losses as a result of an uninsured loss.\nWe do not maintain theft, casualty insurance, or property insurance coverage. We cannot assure that we will not incur uninsured liabilities and losses as a result of the conduct of our business. Any such uninsured or insured loss or liability could have a material adverse effect on our results of operations.\nIf we lose key employees and consultants or are unable to attract or retain qualified personnel, our business could suffer.\nOur success is highly dependent on our ability to attract and retain qualified scientific, engineering and management personnel. We are highly dependent on our CEO, Timothy Young, and our development team at the University of Iowa. The loss of this valuable resource could have a material adverse effect on our operations. There can be no assurance that they will remain associated with us. Our managements efforts will be critical to us as we continue to develop our technology and as we attempt to transition from a development stage company to a company with commercialized products and services. If we were to lose Mr. Young or the services of the development team at the university or any other key employees or consultants, we may experience difficulties in competing effectively, developing our technology and implementing our business strategies.\nThe loss of strategic alliances used in the development of our products and technology could impede our ability to complete our product and result in a material adverse effect causing the business to suffer.\nWe pursue strategic alliances with other companies in areas where collaboration can produce technological and industry advancement. For example, we have entered into a sponsored research agreement with the University of Michigan which expired on September 30, 2022. The Company has extended its agreement as of October 1, 2022.\nThe COVID-19 pandemic may negatively affect our operations.\nThe COVID-19 pandemic is having widespread, rapidly evolving, and unpredictable impacts on global society, economies, financial markets, and business practices. The continuing impacts of COVID-19 are highly unpredictable and could be significant, and may have an adverse effect on our business, operations and our future financial performance.\nThe impact of the pandemic on our business, operations and future financial performance could include, but is not limited to, that:\n● We may experience delays in our product development;\n● The rapid and broad-based shift to a remote working environment creates inherent productivity, connectivity, and oversight challenges; and\n● Volatility in the equity markets could affect the value of our equity to shareholders and have an impact on our ability to raise capital.\nRisks relating to our common stock\nThere is a limited trading market for our common stock.\nOur common stock is not listed on any national securities exchange. Accordingly, investors may find it more difficult to buy and sell our shares than if our common stock was traded on an exchange. Although our common stock is quoted on the OTC Pink, it is an unorganized, inter-dealer, over-the-counter market which provides significantly less liquidity than the Nasdaq Capital Market or other national securities exchange. Further, there is limited trading in our common stock. These factors may have an adverse impact on the trading and price of our common stock.\nOur common stock could be subject to extreme volatility.\nThe trading price of our common stock may be affected by a number of factors, including events described in the risk factors set forth in this report, as well as our operating results, financial condition and other events or factors. In addition to the uncertainties relating to future operating performance and the profitability of operations, factors such as variations in interim financial results or various, as yet unpredictable, factors, many of which are beyond our control, may have a negative effect on the market price of our common stock. In recent years, broad stock market indices, in general, and smaller capitalization companies, in particular, have experienced substantial price fluctuations. In a volatile market, we may experience wide fluctuations in the market price of our common stock and wide bid-ask spreads. These fluctuations may have a negative effect on the market price of our common stock. In addition, the securities market has, from time to time, experienced significant price and volume fluctuations that are not related to the operating performance of particular companies. These market fluctuations may also materially and adversely affect the market price of our common stock.\nWe anticipate that our issuance of common stock upon conversion of outstanding convertible notes will result in dilution to our stockholders.\nAs of June 30, 2022, we have outstanding $827,500 in convertible notes that are convertible into common stock at variable conversion prices (see Note 5 to the financial statements included in this report). We anticipate that our issuance of common stock upon conversion of outstanding convertible notes will result in dilution to holders of our common stock, which may have a negative effect on the price of our common stock. In addition, as of June 30, 2022, we have outstanding warrants to purchase 94,895,239 shares of common stock and options to purchase 157,695,711 shares of common stock, and our issuance of shares of common stock upon exercise of outstanding warrants or options may result in additional dilution to our stockholders.\nWe have never paid common stock dividends and have no plans to pay dividends in the future, as a result our common stock may be less valuable because a return on an investors investment will only occur if our stock price appreciates.\nHolders of shares of our common stock are entitled to receive such dividends as may be declared by our Board of Directors. To date, we have paid no cash dividends on our shares of common stock and we do not expect to pay cash dividends on our common stock in the foreseeable future. We intend to retain future earnings, if any, to provide funds for operations of our business. Therefore, any return investors in our common stock will be in the form of appreciation in the market value of our shares of common stock, which may not occur.\nOur common stock is subject to the SECs penny stock rules.\nUnless our common stock is listed on a national securities exchange, including the Nasdaq Capital Market, or we have stockholders equity of $5,000,000 or less and our common stock has a market price per share of less than $5.00, transactions in our common stock will be subject to the SECs penny stock rules. If our common stock remains subject to the penny stock rules promulgated under the Securities Exchange Act of 1934, broker-dealers may find it difficult to effectuate customer transactions and trading activity in our securities may be adversely affected.\nIn accordance with these rules, broker-dealers participating in transactions in low-priced securities must first deliver a risk disclosure document that describes the risks associated with such stocks, the broker-dealers duties in selling the stock, the customers rights and remedies and certain market and other information. Furthermore, the broker-dealer must make a suitability determination approving the customer for low-priced stock transactions based on the customers financial situation, investment experience and objectives. Broker-dealers must also disclose these restrictions in writing to the customer, obtain specific written consent from the customer, and provide monthly account statements to the customer. The effect of these restrictions will probably decrease the willingness of broker-dealers to make a market in our common stock, decrease liquidity of our common stock and increase transaction costs for sales and purchases of our common stock as compared to other securities. Our management is aware of the abuses that have occurred historically in the penny stock market.\nThis may make it more difficult for investors to dispose of our common stock and cause a decline in the market value of our stock.\nOur articles of incorporation allow for our board to create new series of preferred stock without further approval by our stockholders, which could adversely affect the rights of the holders of our common stock.\nOur board of directors has the authority to fix and determine the relative rights and preferences of preferred stock. Our board of directors has the authority to issue up to 5,000,000 shares of our preferred stock without further stockholder approval. As a result, our board of directors could authorize the issuance of a series of preferred stock that would grant to holders of preferred stock the right to our assets upon liquidation, or the right to receive dividend payments before dividends are distributed to the holders of common stock. In addition, our board of directors could authorize the issuance of a series of preferred stock that has greater voting power than our common stock or that is convertible into our common stock, which could decrease the relative voting power of our common stock or result in dilution to our existing stockholders.\nAdditional stock offerings in the future may dilute then-existing shareholders percentage ownership of the Company.\nGiven our plans and expectations that we will need additional capital, we anticipate that we will need to issue additional shares of common stock or securities convertible or exercisable for shares of common stock, including convertible preferred stock, convertible notes, stock options or warrants. We anticipate that our issuance of additional common stock or securities convertible into or exercisable into common stock in the future will dilute the percentage ownership of then current stockholders.  Item 2. Properties.\nOur principal office address is 10 E. Yanonali St., Suite 36, Santa Barbara, CA, 93101. Our independent laboratory is located at the BioVentures Center at 2500 Crosspark Rd., Coralville, IA 52241. Item 3. Legal Proceedings.\nWe are not currently a party to, nor is any of our property currently the subject of, any material legal proceedings. Item 4. Mine Safety Disclosures.\nNot Applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nOur common stock is quoted on the OTC Pink under the symbol HYSR\nCommon Stock\nOur Articles of Incorporation, as amended, authorizes the issuance of 10,000,000,000 shares of common stock, $0.001 par value per share and 5,000,000 shares of preferred stock, par value $0.001 per share.\nAll outstanding shares of common stock are of the same class and have equal rights and attributes. The holders of our common stock are entitled to one vote per share on all matters submitted to a vote of our stockholders. All stockholders are entitled to share equally in dividends, if any, as may be declared from time to time by the Board of Directors out of funds legally available. In the event of liquidation, the holders of our common stock are entitled to share ratably in all assets remaining after payment of all liabilities. The stockholders do not have cumulative or preemptive rights.\nAs of September 24, 2022, our common stock was held by approximately 190 stockholders of record.\nDividend Policy\nWe have never declared or paid any cash dividends on our common stock. We do not anticipate paying any cash dividends to stockholders in the foreseeable future. In addition, any future determination to pay cash dividends will be at the discretion of the Board of Directors and will be dependent upon our financial condition, results of operations, capital requirements, and such other factors as the Board of Directors deem relevant. There are no restrictions in our articles of incorporation or bylaws that restrict us from declaring dividends.\nEquity Compensation Plan Information\nOn January 23, 2019, our Board adopted the Companys 2019 Equity Incentive Plan (the Plan). The stated purpose of the Plan is to promote the success of the Company and to increase stockholder value by providing an additional means through the grant of awards to attract, motivate, retain and reward selected employees and other eligible persons. The maximum number of shares of the Companys common stock that can be issued under the Plan is 300,000,000. The Plan has been approved by stockholders.\nThe following table sets forth information about our equity compensation plans as of June 30, 2022.\nPlan Category Number of\nsecurities to\nbe issued\nupon\nexercise of\noutstanding\noptions,\nwarrants\nand rights Weighted-\naverage\nexercise\nprices of\noutstanding\noptions,\nwarrants\nand rights Number of\nsecurities\nremaining\navailable for\nfuture\nissuance\nunder the\nequity\ncompensation\nplans\n(excluding\nsecurities\nreflected in\ncolumn (a))\n(a) (b)\nEquity compensation plans approved by security holders 138,894,499 $ 0.0099 43,670,096\nEquity compensation plans not approved by security holders 113,966,451 0.0976 -\nTotal 252,860,950\n43,670,096\nRecent Sales of Unregistered Securities\nNone\nIssuer Purchases of Equity Securities\nNone. Item 6. [Reserved.] Item 7. Managements Discussion and Analysis of Financial Conditions and Results of Operations.\nCertain statements in Managements Discussion and Analysis of Financial Condition and Results of Operations below, and elsewhere in this annual report, are not related to historical results, and are forward-looking statements.\nForward-looking statements present our expectations or forecasts of future events. You can identify these statements by the fact that they do not relate strictly to historical or current facts. These statements involve known and unknown risks, uncertainties and other factors that may cause our actual results, levels of activity, performance or achievements to be materially different from any future results, levels of activity, performance or achievements expressed or implied by such forward-looking statements. Forward-looking statements frequently are accompanied by such words such as may, will, should, could, expects, plans, intends, anticipates, believes, estimates, predicts, potential or continue, or the negative of such terms or other words and terms of similar meaning. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance, achievements, or timeliness of such results. Moreover, neither we nor any other person assumes responsibility for the accuracy and completeness of such forward-looking statements. We disclaim any obligation to publicly update these statements, or disclose any difference between actual results and those reflected in these statements, except as may be required under applicable law\nSubsequent written and oral forward looking statements attributable to us or to persons acting in our behalf are expressly qualified in their entirety by the cautionary statements and risk factors set forth below and elsewhere in this annual report, and in other reports filed by us with the SEC.\nYou should read the following description of our financial condition and results of operations in conjunction with the financial statements and accompanying notes included in this Annual Report beginning on page.\nOverview\nAt SunHydrogen, we are developing a breakthrough, low-cost technology to make renewable hydrogen using sunlight and any source of water, including seawater and wastewater. The only byproduct of hydrogen fuel is pure water, unlike hydrocarbon fuels such as oil, coal and natural gas that release carbon dioxide and other contaminants into the atmosphere when used. By optimizing the science of water electrolysis at the nano-level, our low-cost nanoparticles mimic photosynthesis to efficiently use sunlight to separate hydrogen from water, ultimately producing environmentally friendly renewable hydrogen. Using our low-cost method to produce renewable hydrogen, we intend to enable a world of distributed hydrogen production for renewable electricity and hydrogen fuel cell vehicles.\nResults of Operations for the Year Ended June 30, 2022 compared to the Year Ended June 30, 2021\nOperating Expenses\nFor the year ended June 30, 2022, operating expenses were $4,475,225, compared to $5,806,480 for the year ended June 30, 2021. Operating expenses consist primarily of research and development expenses and general and administrative expenses incurred in connection with the operation of our business. The net decrease of $1,331,255 in operating expenses was a result of a decrease in research and development of $204,729, a decrease in equity financing fees of $1,667,650, a decrease in professional fees of $424,604, with an increase in marketing of $259,565, an increase in non-cash stock compensation of $700,745, and an overall increase of $5,418.\nOther Income/(Expenses)\nOther income and (expenses) for the year ended June 30, 2022 was $94,506,158 compared to $(75,691,643) for the year ended June 30, 2021. The majority of the increase of $170,197,801 in other income was the result of the increase in net change in derivatives of $170, 031,049, an increase in loss on redemption of marketable securities of $76,792, an increase in dividend expense of $7,925, an increase in investment income of $233,118, and an increase in loss on settlement of debt of $1,835, with an overall decrease of $20,186.\nNet Income (Loss)\nFor the year ended June 30, 2022, our net income was $90,030,933, compared to a net loss of $(81,498,123), for the year ended June 30, 2021. The majority of the increase in net income of $171,529,056, was related primarily to the net change in derivative estimates each year. These estimates are based on multiple inputs, including the market price of our stock, interest rates, our stock price, volatility, variable conversion prices based on market prices defined in the respective agreements and probabilities of certain outcomes based on managements estimates. These inputs are subject to significant changes from period to period, therefore, the estimated fair value of the derivative liabilities will fluctuate from period to period, and the fluctuation may be material. The Company has not generated any revenues.\nLiquidity and Capital Resources\nLiquidity is the ability of a company to generate funds to support its current and future operations, satisfy its obligations, and otherwise operate on an ongoing basis. Significant factors in the management of liquidity are funds generated by operations, levels of accounts receivable and accounts payable and capital expenditures.\nAs of June 30, 2022, we had a working capital surplus of $24,865,577, compared to a working capital deficit of $(80,099,103) as of June 30, 2021. This decrease in working capital deficit of $(104,964,680) was primarily due to the change in derivative liability.\nDuring the year ended June 30, 2022, we raised an aggregate of $960,000 from registered offerings of common stock through a private placement. During the year ended June 30, 2021, we raised an aggregate of $62,223,350 in registered offerings of common stock and from the exercise of warrants, and $450,000 in private placements of convertible notes.\nCash flow used in operating activities was $3,435,037 for the year ended June 30, 2022, compared to $5,379,489 for the year ended June 30, 2021. The decrease of $1,944,452 in cash used by operating activities was primarily due to a decrease in professional fees. The Company has had no revenues.\nCash used in investing activities for the year ended June 30, 2022 and June 30, 2021 was $24,400,032 and $167,866, respectively. The increase in investing activities was as a result of the purchase of marketable securities.\nCash used in financing activities during the year ended June 30, 2022 was $490,000, compared to cash provided by financing of $61,358,900 for the year ended June 30, 2021. The decrease in cash provided by financing activities was due to a decrease in common stock purchase agreements.\nWe have historically obtained funding from investors, through private placements and registered offerings of equity and debt securities. Management believes that the Company will be able to continue to raise funds through the sale of its securities to its existing shareholders and prospective new investors which will provide the additional cash needed to meet the Companys obligations as they become due and will allow the Company to continue to develop its core business. There can be no assurance that we will be able to continue raising the required capital for our operations on terms and conditions that are acceptable to us, or at all. If we are unable to obtain sufficient funds, we may be forced to curtail and/or cease our operation.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that are reasonably likely to have a current or future effect on our financial condition, revenues or expenses, result of operations, liquidity or capital expenditures.\nCritical Accounting Policies\nOur discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States of America. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosures of contingent assets and liabilities. On an ongoing basis, we evaluate our estimates, including those related to impairment of property, plant and equipment, intangible assets, deferred tax assets and fair value computation using the Binomial lattice valuation pricing model. We base our estimates on historical experience and on various other assumptions, such as the trading value of our common stock and estimated future undiscounted cash flows, that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions; however, we believe that our estimates, including those for the above-described items, are reasonable.\nUse of Estimates\nIn accordance with accounting principles generally accepted in the United States, management utilizes estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements as well as the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. These estimates and assumptions relate to recording, useful lives and impairment of tangible and intangible assets, derivatives, accruals, income taxes, stock-based compensation expense, binomial model inputs and other factors. Management believes it has exercised reasonable judgment in deriving these estimates. Consequently, a change in conditions could affect these estimates.\nFair Value of Financial Instruments\nFair value of financial instruments, requires disclosure of the fair value information, whether or not recognized in the balance sheet, where it is practicable to estimate that value. As of June 30, 2022 and 2021, the amounts reported for cash, accrued interest and other expenses, notes payables, and derivative liability approximate the fair value because of their short maturities.\nRecently Adopted Accounting Pronouncements\nManagement adopted recently issued accounting pronouncements during the year ended June 30, 2022, as disclosed in the Notes to the financial statements included in this report. Item 7A. Quantitative and Qualitative Disclosure About Market Risk.\nNot required for a smaller reporting company. Item 8. Financial Statements.\nAll financial information required by this Item is attached hereto at the end of this report beginning on page and is hereby incorporated by reference. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures.\nOur management, with the participation of our CEO and our Acting CFO, evaluated the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) and Rule 15d-15(e) of the Exchange Act) as of the end of the period covered by this report. Based on that evaluation, our CEO and our Acting CFO concluded that our disclosure controls and procedures as of the end of the period covered by this report were effective to ensure that information required to be disclosed is made known to management and others, as appropriate, to allow timely decision regarding required disclosure and that the information required to be disclosed by us in reports that we file or submit under the Exchange Act is (i) recorded, processed, summarized and reported within the time periods specified in the Commissions rules and forms and (ii) accumulated and communicated to our management, including our CEO and Acting CFO, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. A controls system cannot provide absolute assurance, however, that the objectives of the controls system are met, and no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within a company have been detected.\nManagements Annual Report on Internal Control over Financial Reporting.\nWe are responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). The Companys internal control over financial reporting is a process designed to provide reasonable assurance to our management and board of directors regarding the reliability of financial reporting and the preparation of the financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America.\nOur internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nOur management conducted an evaluation of the effectiveness of our internal control over financial reporting as of June 30, 2022 based on the criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013). Based on this evaluation, management concluded that our internal control over financial reporting was effective as of June 30, 2022, based on those criteria.\nA control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to the rules of the Securities and Exchange Commission that permanently exempt smaller reporting companies\nChanges in Internal Controls\nThere has been no change in our internal control over financial reporting that occurred during the three months ended June 30, 2022 that has materially affected or is reasonably likely to materially affect our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe following table sets forth information about our executive officers and directors:\nName Age Position\nTimothy Young President, CEO, Acting CFO and Chairman of the Board of Directors\nMark J. Richardson Director\nWoosuk Kim Chief Operating Officer and Director\nTimothy Young - President, CEO, Acting CFO and Chairman of the Board of Directors\nTim Young is an accomplished executive with over fifteen years of management experience in media and Internet technology companies. Mr. Young was appointed President, CEO and Chairman of the Company in August 2009. Mr. Young was appointed Acting CFO in 2010.\nThrough his outreach to the public and to leaders in the renewable energy field, Mr. Young has bolstered the companys visibility as a key player in the developing green hydrogen market and rallied a strong investor base. Mr. Youngs proven fundraising ability, along with his leadership and direction of SunHydrogens long-term and short-term goals and strategies, has enabled the company to engage international industrial partners, attract top industry scientists, and most importantly continue to hit milestones toward commercializing its nanoparticle-based green hydrogen technology.\nPrior to founding SunHydrogen, Mr. Young demonstrated a track record of success in management and leadership positions bringing new products to the market in the digital, cable and broadcast media industries. Mr. Young was the President of Rovion, a digital advertising company, where he increased revenues through a channel sales strategy that included companies such as Clear Channel, Disney, CBS, and Fox Television and bolstered the companys technical capabilities through strategic acquisitions.\nPrior to Rovion, Mr. Young enjoyed a decade-long career at Time Warner Inc. where he served as Vice President and Regional Vice President of various divisions including America Online and Time Warner Cable. During his tenure, Mr. Young built some of the highest performing sales organizations at Time Warner with responsibilities ranging from product development and marketing to staff training and leadership development. He led the California and Hawaii sales teams which accounted for over $200 million in revenues with 250 sales and marketing personnel.\nMr. Youngs track record of success and over fifteen years of management and leadership experience bringing new products to the market qualifies him to be a board member of the Company.\nMark J. Richardson - Director\nMr. Richardson was appointed as a director in June 2018. Mr. Richardson has been a securities lawyer since he graduated from the University of Michigan Law School in 1978. He practiced as an associate and partner in large law firms until 1993, when he established his own practice under the name Richardson & Associates. He has been the principal securities counsel on a variety of equity and debt placements for corporations, partnerships, and real estate companies. His practice includes public and private offerings, venture capital placements, debt restructuring, compliance with federal and state securities laws, representation of publicly traded companies, Nasdaq filings, corporate law, partnerships, joint ventures, mergers, asset acquisitions, and stock purchase agreements. As a partner in a major international law firm in the 1980s, Mr. Richardson participated in the leveraged buyout and recapitalization of a well-known producer of animated programming for children, financed by Prudential Insurance and Bear Stearns, Inc. He was also instrumental in restructuring the public debentures of a real estate company without resorting to a bankruptcy proceeding. From 1986 to 1993 Mr. Richardson was a contributing author to State Limited Partnerships Laws - California Practice Guide, Prentice Hall Law and Business. Prior to receiving his Juris Doctor degree cum laude from the University of Michigan Law School in 1978, Mr. Richardson received a Bachelor of Science degree summa cum laude in Resource Economics from the University of Michigan School of Natural Resources in 1975, where he earned the Bankstrom Prize for academic excellence and achieved Phi Beta Kappa honors. Mr. Richardson is an active member of the Los Angeles County and California State Bar Associations, including the Section on Corporations, Business and Finance and the Section on Real Estate.\nThe Board has determined that Mr. Richardson is qualified to serve as a director because of his extensive experience as a practicing attorney representing small companies.\nWoosuk Kim - Chief Operating Officer and Director\nWoosuk Kim has served as our chief operating officer and director since April 1, 2021. From May 2011 to December 2019, Mr. Kim was senior vice president, head of M&A group at SK Innovation in Seoul, South Korea, responsible for expanding core businesses and developing new business opportunities in the renewable energy sector through cross border acquisitions and joint venture transactions. From August 2009 to May 2011 Mr. Kim was vice president, corporate development at SK Telekom. From August 2006 to March 2008, Mr. Kim was chief financial officer at Axon Financial Services in New York. From July 1998 to August 2006, Mr. Kim was executive director at Morgan Stanley in New York, responsible for developing and operating multi-billion dollar asset-backed securities funding platforms, investor marketing, and the corporate treasury function for Discover Card. He received an MBA from Cornell University and a BA from the University of Chicago. Mr. Kims financial industry knowledge and experience qualify him to serve on our board of directors.\nDirectors are elected at our annual meeting of shareholders and serve for one year until the next annual meeting of shareholders or until their successors are elected and qualified.\nFamily Relationships\nThere are no family relationships among our executive officers and directors.\nBoard Leadership Structure and Role in Risk Oversight\nAlthough we have not adopted a formal policy on whether the Chairman and Chief Executive Officer positions should be separate or combined, we have traditionally determined that it is in the best interests of the Company and its shareholders to combine these roles. Currently, our Chief Executive Officer also serves as Chairman of the Board. Due to the small size and early stage of the Company, we believe it is currently most effective to have the Chairman and Chief Executive Officer positions combined.\nInvolvement in Certain Legal Proceedings\nDuring the past ten years, none of our directors, executive officers, promoters, control persons, or nominees has been:\n● the subject of any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n● convicted in a criminal proceeding or is subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n● subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or any Federal or State authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities;\n● found by a court of competent jurisdiction (in a civil action), the Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law.\n● the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of (a) any Federal or State securities or commodities law or regulation; (b) any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or (c) any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n● the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCommittees of the Board\nDue to the small size of the Company and its Board of Directors, we currently have no audit committee, compensation committee or nominations and governance committee of our board of directors. We do not have an audit committee financial expert.\nCode of Ethics\nWe have adopted a Code of Ethics that applies to all of our directors, officers and employees. A copy of the Code of Ethics can be obtained without charge upon request to Timothy Young, CEO and President, 10 E. Yanonali, Suite 36, Santa Barbara, CA 93101 and is also being incorporated by reference herein. Any waiver of the provisions of the Code of Ethics for executive officers and directors may be made only by the Board of Directors. Any such waivers will be promptly disclosed to our shareholders.\nChanges in Nominating Procedures\nNone. Item 11. Executive Compensation\nThe table below sets forth the compensation earned by our named executive officers during the last two fiscal years.\nName & Principal Position\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption Awards\n($)\nNon-Equity\nIncentive Plan\nCompensation ($)\nNon-Qualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation ($)\nTotal\n($)\nTimothy Young,\n$ 315,125\n335,000\n-\n-\n-\n-\n-\n$ 650,125\nCEO and Acting CFO\n$ 340,385\n354,000\n-\n-\n-\n-\n-\n$ 694,385\nWoosuk Kim\n68,750\n-\n-\n-\n-\n-\n-\n$ 68,750\nCOO (1)\n264,423\n206,250\n-\n-\n-\n-\n-\n$ 470,673\n(1) Mr. Kim was appointed our chief operating officer on April 7, 2021.\nEmployment Agreements\nOn January 21, 2021, the Company entered into an employment agreement with Timothy Young, the Companys president, chief executive officer, acting chief financial officer, and chairman. Under the employment agreement, Mr. Young will continue to serve in such positions and will receive an annual base salary of $354,000, effective as of January 1, 2021, which base salary will be reviewed annually by the Board. Mr. Young received a $150,000 signing bonus under the employment agreement and his bonus opportunities will include up to an additional 100% of base salary upon meeting certain objectives to be set by the Board for each calendar year, payable at the end of each calendar quarter as the objectives are satisfied. In addition, upon the Company being up-listed to the Nasdaq Capital Market or New York Stock Exchange, Mr. Young will receive a $250,000 bonus. Mr. Young will also receive a grant of one hundred million shares of restricted stock units, subject to a vesting schedule to be determined by the Board. If Mr. Young is terminated without cause or he resigns voluntarily for good reason, as each term is defined in the agreement, he will be eligible to receive a lump sum of one year of his base salary and of his bonus and 100% of all outstanding unvested equity awards will vest immediately, with all outstanding unexercised stock options remaining exercisable for one year form the date of termination.\nOn April 1, 2021, the Company entered into an employment agreement with Woosuk Kim, pursuant to which Mr. Kim serves as our chief operating officer. Pursuant to the employment agreement, Mr. Kim received a signing bonus of $55,000 and will receive an annual base salary of $275,000, which will be reviewed and may be increased annually by the board of directors. He will also be eligible for an annual bonus of 75% of his annual base salary, upon meeting objectives set by the board of directors. In the event the Company uplists the Companys common stock to Nasdaq or the New York Stock Exchange, Mr. Kim will receive an additional bonus of $150,000. In the event the Company merges with or acquires another company and has an increased market capitalization after the close of the transaction, Mr. Kim will receive an additional bonus of $150,000. Mr. Kim will receive 50,000,000 restricted stock units of the Company, subject to a 24-month vesting schedule to be determined by the board of directors in its discretion. The employment agreement will terminate April 1, 2023, subject to the right of either party to terminate the employment agreement at any time upon written notice, provided that, in the event Mr. Kim is terminated prior to such date by the Company, without Cause (as defined in the employment agreement) or the company is sold, merged, or there is a Change of Control (as defined in the employment agreement), Mr. Kim will be entitled to certain severance payments and benefits including a payment equal to his annual base salary that would have accrued until April 1, 2023, a payment of his bonus amount that would have accrued until April 1, 2023, and immediate accelerated vesting of all outstanding unvested equity awards and any other stock awards.\nOutstanding Equity Awards at Fiscal Year-End\nThe following table discloses information regarding outstanding equity awards granted or accrued as of June 30, 2022, for our named executive officers.\nOutstanding Equity Awards\nOption Awards\nStock Awards\nName\nNumber of\nSecurities\nUnderlying\nUnexercised (#)\nExercisable\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nUnexercisable\nOption\nExercise\nPrice ($)\nOption\nExpiration\nDate\nNumber of\nShares or Units\nof Stock that\nhave not\nVested (#)\nMarket\nValue of\nShares or Units\nof Stock that\nhave not\nVested ($)\nTimothy Young\n125,812,947\n-\n.0099\n1/23/2026\n-\n-\nWoosuk Kim\n-\n-\n-\n-\n-\n-\nDirector Compensation\nThe following table sets forth compensation information regarding the Companys non-employee directors in fiscal 2022:\nName\nFees earned or\npaid in cash\nStock\nAward\n($)\nOption\nAwards\n($)\nNon-equity\nincentive\nplan\ncompensation\nNonqualified\ndeferred\ncompensation\nearnings\nNon-Equity\nIncentive Plan\nCompensation\n($)\nNon-Qualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation ($)\nTotal ($)\nMark R. Richardson\n37,500\n-\n$ -\n-\n-\n-\n-\n-\n37,500 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth certain information, as of October 7, 2022, concerning the number of shares of our common stock owned by: (i) each of our directors; (ii) each of our named executive officers; and (iii) each person or group known by us to beneficially own more than 5% of our outstanding shares of common stock.\nWe believe that all persons named in the table have sole voting and investment power with respect to all shares of common stock beneficially owned by them.\nA person is deemed to be the beneficial owner of securities that can be acquired by him within 60 days of October 7, 2022, upon the exercise or conversion of options, warrants or convertible securities. Each beneficial owners percentage ownership is determined by assuming that options, warrants or convertible securities that are held by him, but not those held by any other person, and which are exercisable within 60 days of September 30, 2022 or have been exercised and converted.\nName and address\nShares of\nCommon\nStock\nPercentage\nof Common\nStock (1)\nDirectors and Officers (2)\nTimothy A. Young\n133,812,947 (3)\n3.1 %\nMark R. Richardson\n3,081,552 (4)\n*\nWoosuk Kim\n-\n--\nAll officers and directors as a group (3 persons)\n136,894,499\n3.2 %\n* Less than 1%.\n(1) Based upon 4,271,749,146 shares issued and outstanding as of October 7, 2022.\n(2) The address for each of the officers and directors is c/o SunHydrogen, Inc. 10 E. Yanonali, Suite 36, Santa Barbara, CA 93101\n(3) Includes 125,812,947 shares underlying options.\n(4) Represents shares underlying options. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nCertain Relationships and Related Transactions\nOn July 20, 2021, the Company entered into redemption agreements with Timothy Young, the Companys chief executive officer, Mark Richardson, a director of the Company, and with a consultant of the Company. Pursuant to the redemption agreements, the Company redeemed an aggregate of 24,887,463 options to purchase shares of common stock of the Company (including 16,300,618 options held by Mr. Young with an exercise price of $0.0099, 4,289,636 options held by Mr. Richardson with an exercise price of $0.0099, and 4,297,209 options held by the consultant with an exercise price of $0.01) for a redemption price of $0.05828 per option (with respect to the options held by Mr. Young and Mr. Richardson) or $0.05818 per option (with respect to the options held by the consultant).\nAs of June 30, 2022, the Company owed $211,750 to Timothy Young in accrued salary.\nDirector Independence\nThe Board has determined that Mr. Richardson is an independent director within the meaning of NASDAQ Rule 5605(a)(2). Item 14. Principal Accountant Fees and Services.\nAudit Fees\nThe aggregate fees billable to us by our principal accounting firm during 2022 and 2021 for the audit of our annual financial statements and review of financial statements included in the our Form 10-Qs or services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years, were approximately$32,000 and $34,800, respectively.\nAudit-Related Fees\nWe incurred fees of $0 and $0 for the years ended June 30, 2022 and 2021, respectively, to our principal accountant for assurance and related services that are reasonably related to the performance of the audit or review of our financial statements and are not reported under Audit Fees above.\nTax Fees\nWe did not incur fees for services rendered to us for tax compliance, tax advice, or tax planning by our principal accountant for the fiscal years ended June 30, 2022 and 2021.\nAll Other Fees\nOur current policy is to not engage M&K CPAS, PLLC to provide, among other things, bookkeeping services, appraisal or valuation services, or international audit services. The policy provides that we engage M&K CPAS, PLLC to provide audit, and other assurance services, such as review of SEC reports or filings. Item 15. Exhibits and Financial Statement Schedules.\n(1) Financial statements.\nThe SunHydrogen, Inc. financial statements are included in Item 8. Financial Statements and Supplementary Data.\n(2) Financial statement schedules: None.\n(3) Exhibits\nExhibit\nDescription\n3.1\nArticles of Incorporation of filed with the Nevada Secretary of State on February 18, 2009 (incorporated by reference to S-1 filed on February 5, 2010).\n3.2\nArticles of Amendment of Articles of Incorporation filed with the Nevada Secretary of State on September 11, 2009 (incorporated by reference to S-1 filed February 5, 2010).\n3.3\nArticles of Amendment of Articles of Incorporation of filed with the Nevada Secretary of State on November 21, 2013 (incorporated by reference 8-K filed on November 21, 2013).\n3.4\nArticles of Amendment of Articles of Incorporation filed with the Nevada Secretary of State on September 13, 2018. (incorporated by reference to 10-K filed on September 25, 2018).\n3.5\nCertificate of Designation of Series A Preferred Stock (incorporated by reference to the Companys Form 8-K filed February 2, 2022)\n3.6\nCertificate of Designation of Series B Preferred Stock (incorporated by reference to the Companys Form 8-K filed November 26, 2019)\n3.7\nCertificate of Designation of Series C Preferred Stock (incorporated by reference to the Companys Form 8-K filed December 17, 2021)\n3.8\nCertificate of Amendment to Articles of Incorporation (incorporated by reference to 8-K filed January 3, 2020)\n3.9\nArticles of Merger (incorporated by reference to 8-K filed June 15, 2020)\n3.10\nCertificate of Amendment to Articles of Incorporation (incorporated by reference to 10-Q filed May 16, 2022)\n3.11\nAmended and Restated Bylaws (incorporated by reference to 8-K filed February 2, 2022)\n4.1\nDescription of Registrants Securities\n10.1\n2019 Equity Incentive Plan (incorporated by reference to Form S-8 on December 19, 2018)\n10.2\nConvertible Promissory Note dated November 10, 2017 (incorporated by reference to Form 10-Q on May 15, 2018)\n10.3\nConvertible Promissory Note dated June 27, 2018 (incorporated by reference to Form 8-K filed on June 29, 2018)\n10.4\nConvertible Promissory Note issued August 10, 2018 (incorporated by reference to Form 8-K filed on August 14, 2018)\n10.5\nForm of Placement Agent Warrant (incorporated by reference to 8-K filed December 3, 2020)\n10.6\nForm of Warrant (incorporated by reference to 8-K filed February 26, 2021)\n10.7\nForm of Placement Agent Warrant (incorporated by reference to 8-K filed February 26, 2021)\n10.8\nCooperation Agreement between the Company and Gebr. SCHMID GmbH (incorporated by reference to 8-K filed February 22, 2021)\n10.9\nEmployment Agreement between the Company and Timothy Young (incorporated by reference to 8-K filed March 1, 2021) ***\n10.10\nEmployment Agreement between the Company and Woosuk Kim (incorporated by reference to 8-K filed April 7, 2021) ***\n10.11\nExtension Agreement between the Company and Gebr. SCHMID GmbH (incorporated by reference to 10-K filed October 8, 2021)\n10.12\nContract, dated October 1, 2022, between the Company and The University of Iowa, Iowa City\n10.13\nResearch Agreement, dated October 1, 2021, between the Company and Regents of the University of Michigan (incorporated by reference to 10-K filed October 8, 2021)\n10.14\nResearch Agreement Amendment No. 1 between the Company and Regents of the University of Michigan\n10.15\nSunHydrogen, Inc. 2022 Stock Incentive Plan\n14.1\nCode of Ethics (incorporated by reference to 10-K filed on September 28, 2012).\n23.1\nConsent of M&K CPAS, LLC\n31.1*\nCertification by Chief Executive Officer and Acting Chief Financial Officer pursuant to Sarbanes-Oxley Section 302\n32.1**\nCertification by Chief Executive Officer and Acting Chief Financial Officer pursuant to 18 U.S.C. Section 1350\nInline XBRL Document Set for the consolidated financial statements and accompanying notes in Part II, Item 8, Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\nInline XBRL for the cover page of this Annual Report on Form 10-K, included in the Exhibit 101 Inline XBRL Document Set.\n* Filed herewith.\n** Furnished herewith.\n*** Indicates management contract or compensatory plan or arrangement.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nSUNHYDROGEN, INC.\nDate: October 7, 2022 By: /s/ Timothy Young\nTimothy Young\nChief Executive Officer,\nActing Chief Financial Officer,\nand Chairman\n(principal executive, financial and\naccounting officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Timothy Young\nChief Executive Officer, President\nOctober 7, 2022\nTimothy Young\n(Principal Executive Officer) Acting Chief Financial Officer\n(Principal Financial and Accounting Officer), and Chairman\n/s/ Mark R. Richardson\nDirector\nOctober 7, 2022\nMark R. Richardson\n/s/ Woosuk Kim\nDirector\nOctober 7, 2022\nWoosuk Kim\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nSunHydrogen, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of SunHydrogen, Inc. (the Company) as of June 30, 2022 and 2021, and the related statements of operations, shareholders equity (deficit), and cash flows for each of the years in the two-year period ended June 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended June 30, 2022 in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB .\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and the significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nCapital Stock and Other Equity Accounts\nAs discussed in Note 3, the Company issued preferred stock to third and related parties. Auditing managements calculation of the fair value of the preferred shares issued can be a significant judgment due to the need of a specialist to evaluate the fair value of the preferred shares issued and the auditor has to test the inputs and estimates used.\nAuditing managements calculation of the fair value of the options and warrants issued can be a significant judgment given the fact that the Company uses management estimates on various inputs to the calculations.\nWe evaluated managements conclusions regarding their fair values and reviewed support for the significant inputs used in the valuation model, as well as assessing the model for reasonableness. In addition, we evaluated the Companys disclosure in relation to this matter included in Notes 3 to the financial statements\n/s/ M&K CPAS, PLLC\nM&K CPAS, PLLC\nWe have served as the Companys auditor since 2020\nFirm ID 2738\nHouston, TX\nOctober 7, 2022\nSUNHYDROGEN, INC.\nBALANCE SHEETS\nJune 30,\nJune 30,\nASSETS\nCURRENT ASSETS\nCash and cash equivalent $ 27,681,485 $ 56,006,555\nMarketable securities 24,323,240 -\nPrepaid expense 2,526 -\nOther receivable 14,868 -\nTOTAL CURRENT ASSETS 52,022,119 56,006,555\nPROPERTY & EQUIPMENT\nComputers and peripherals 11,529 11,529\nVehicle 155,000 155,000\n166,529 166,529\nLess: accumulated depreciation (46,933 ) (11,072 )\nNET PROPERTY AND EQUIPMENT 119,596 155,457\nOTHER ASSETS\nDomain, net of amortization of $4,931 and $4,577, respectively\nTrademark, net of amortization of $601 and $486, respectively\nPatents, net of amortization of $29,779 and $23,215, respectively 71,364 77,928\nTOTAL OTHER ASSETS 72,290 79,323\nTOTAL ASSETS $ 52,214,005 $ 56,241,335\nLIABILITIES AND SHAREHOLDERS DEFICIT\nCURRENT LIABILITIES\nAccounts payable and other payables $ 57,390 $ 223,520\nAccrued expenses 3,070 11,912\nAccrued expenses, related party 211,750 214,820\nAccrued interest on convertible notes 191,763 282,505\nDerivative liability 26,015,069 135,247,303\nConvertible promissory notes, net of debt discount of $0 and $416,472, respectively 677,500 125,598\nTOTAL CURRENT LIABILITIES 27,156,542 136,105,658\nLONG TERM LIABILITIES\nConvertible promissory notes, net of debt discount of $0 and $0, respectively 150,000 703,000\nTOTAL LONG TERM LIABILITIES 150,000 703,000\nTOTAL LIABILITIES 27,306,542 136,808,658\nCOMMIMENTS AND CONTINGENCIES (SEE NOTE 9) - -\nSeries C 10% Preferred Stock, 2,700 and 0 shares issued and outstanding, redeemable value of $270,000 and $0, respectively 270,000 -\nSHAREHOLDERS EQUITY (DEFICIT)\nPreferred Stock, $0.001 par value; 5,000,000 authorized preferred shares outstanding\n4,271,749 3,849,308\nCommon Stock, $0.001 par value; 10,000,000,000 authorized common shares 4,271,749,146 and 3,849,308,495 shares issued and outstanding, respectively - -\nAdditional Paid in Capital 103,311,733 88,560,321\nAccumulated deficit (82,946,019 ) (172,976,952 )\nTOTAL SHAREHOLDERS EQUITY (DEFICIT) 24,637,463 (80,567,323 )\nTOTAL LIABILITIES AND SHAREHOLDERS EQUITY $ 52,214,005 $ 56,241,335\nThe accompanying notes are an integral part of these financial statements\nSUNHYDROGEN, INC.\nSTATEMENTS OF OPERATIONS\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\nYear Ended\nJune 30,\nJune 30,\nREVENUE $ -\n$ -\nOPERATING EXPENSES\nSelling and Marketing 372,604 113,039\nGeneral and administrative expenses 2,267,270 3,674,282\nResearch and development cost 1,792,457 1,997,186\nDepreciation and amortization 42,894 21,973\nTOTAL OPERATING EXPENSES 4,475,225 5,806,480\nLOSS FROM OPERATIONS BEFORE OTHER INCOME (EXPENSES) (4,475,225 ) (5,806,480 )\nOTHER INCOME/(EXPENSES)\nInvestment income 239,953 6,835\nGain on sale of asset - 1,473\nDividend expense (7,925 ) -\nLoss on settlement of debt (1,835 ) -\nLoss on redemption of marketable securities (76,792 ) -\nLoss on settlement of derivative liability (1,109,761 ) -\nGain (Loss) on change in derivative liability 96,001,226 (75,139,584 )\nInterest expense (538,708 ) (560,367 )\nTOTAL OTHER INCOME (EXPENSES) 94,506,158 (75,691,643 )\nNET INCOME (LOSS) $ 90,030,933 $ (81,498,123 )\nCOMMON STOCK WARRANTS DEEMED DIVIDENDS -\n(15,928,314 )\nNET LOSS ATTRIBUTABLE TO COMMON SHAREHOLDERS $ 90,030,933 $ (97,426,437 )\nBASIC EARNINGS (LOSS) PER SHARE $ 0.02 $ (0.04 )\nDILUTED EARNINGS (LOSS) PER SHARE $ 0.02 $ (0.04 )\nWEIGHTED-AVERAGE COMMON SHARES OUTSTANDING\nBASIC 4,103,301,026 2,756,925,374\nDILUTED 5,217,576,101 2,756,925,374\nThe accompanying notes are an integral part of these audited financial statements\nSUNHYDROGEN, INC.\nSTATEMENTS OF SHAREHOLDERS EQUITY/(DEFICIT)\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\nYEARS ENDED JUNE 30, 2022 AND 2021\nAdditional\nPreferred stock\nCommon stock Paid-in Accumulated\nShares Amount Mezzanine Shares Amount Capital Deficit Total\nBalance at June 30, 2020 - $ - $ - 2,053,410,164 $ 2,053,410 $ 11,664,657 $ (75,550,515 ) $ (61,832,448 )\nIssuance of common stock for cash purchase agreements - - - 576,554,289 576,554 42,746,796 - 43,323,350\nIssuance of common stock for cash purchase of warrants - - - 252,000,000 252,000 18,648,000 - 18,900,000\nIssuance of common stock for conversion of debt and accrued interest - - - 963,537,752 963,538 448,382 - 1,411,920\nIssuance of common stock for services - - - 3,806,290 3,806 114,217 - 118,023\nIssuance of common stock warrants deemed dividends - - - - - 15,928,314 (15,928,314 ) -\nCommon stock and warrants compensation expense - - - - - 259,955 - 259,955\nRedemption of related parties stock options - - - - - (1,250,000 ) - (1,250,000 )\nNet Loss - - - - - - (81,498,123 ) (81,498,123 )\nBalance at June 30, 2021 - - - 3,849,308,495 3,849,308 88,560,321 (172,976,952 ) (80,567,323 )\nIssuance of common stock for cash - - - 40,983,607 40,984 919,016 - 960,000\nIssuance of common stock for conversion of debt and accrued interest - - - 381,457,044 381,457 (19,073 ) - 362,384\nFair value of convertible notes and accrued interest in exchange for Series C Preferred Stock - - - - - 14,340,769 - 14,340,769\nFair value of preferred stock in exchange for convertible note - - 270,000 - - - - -\nRedemption of related parties stock options - - - - - (1,450,000 ) - (1,450,000 )\nStock compensation - - - - - 960,700 - 960,700\nNet Income - - - - - - 90,030,933 90,030,933\nBalance at June 30, 2022 - $ - $ 270,000 4,271,749,146 $ 4,271,749 $ 103,311,733 $ (82,946,019 ) $ 24,637,463\nThe accompanying notes are an integral part of these audited financial statements\nSUNHYDROGEN, INC.\nSTATEMENTS OF CASH FLOWS\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\nYears Ended\nJune 30,\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet Income (loss) $ 90,030,933 $ (81,498,123 )\nAdjustment to reconcile net income (loss) to net cash (used in) provided by operating activities\nDepreciation & amortization expense 42,894 21,973\nStock based compensation expense 960,700 259,955\nStock issued for services -\n118,023\nLoss on settlement of debt and derivative 1,109,761 -\nLoss on settlement of convertible note 1,835 -\nLoss on redemption of marketable securities 76,792 -\nNet (Gain) Loss on change in derivative liability (96,001,226 ) 75,139,584\nAmortization of debt discount recorded as interest expense 442,603 416,472\nGain on sale of van -\n(1,473 )\nChange in assets and liabilities :\nPrepaid expense (17,394 ) 9,378\nAccounts payable (166,131 ) 22,277\nAccrued expenses (11,912 ) 15,234\nAccrued interest on convertible notes 96,107 117,211\nNET CASH USED IN OPERATING ACTIVITIES (3,435,038 ) (5,379,489 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nPurchase of marketable securities (24,400,032 ) -\nProceeds from sale of van -\n46,000\nPurchase of tangible assets -\n(213,866 )\nNET CASH USED IN INVESTING ACTIVITIES: (24,400,032 ) (167,866 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nCash payoff of convertible notes -\n(64,450 )\nRedemption of related parties stock options (1,450,000 ) (1,250,000 )\nProceeds from convertible notes -\n450,000\nNet proceeds from common stock purchase agreements 960,000 62,223,350\nNET CASH (USED IN) PROVIDED BY FINANCING ACTIVITIES (490,000 ) 61,358,900\nNET INCREASE (DECREASE) IN CASH (28,325,070 ) 55,811,545\nCASH, BEGINNING OF PERIOD 56,006,555 195,010\nCASH, END OF PERIOD $ 27,681,485 $ 56,006,555\nSUPPLEMENTAL DISCLOSURES OF CASH FLOW INFORMATION\nInterest paid $ -\n$ 26,843\nTaxes paid $ -\n$ -\nSUPPLEMENTAL DISCLOSURES OF NON CASH TRANSACTIONS\nFair value of common stock upon conversion of convertible notes , and accrued interest $ 362,384 $ 1,411,920\nFair value of common stock issued for services $ -\n$ 118,023\nIssuance of common stock purchase warrants deemed dividends $ -\n$ 15,928,314\nFair value of convertible notes at issuance $ -\n$ 450,000\nFair value of preferred stock in exchange for convertible note $ 14,340,769 $ -\nFair value of derivative liability removed $ 13,231,008 $ -\nPreferred stock issued upon exchange of convertible note $ 268,165 $ -\nThe accompanying notes are an integral part of these audited financial statements\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n1. ORGANIZATION AND LINE OF BUSINESS\nOrganization\nSunHydrogen, Inc. (the Company) was incorporated in the state of Nevada on February 18, 2009. The Company, based in Santa Barbara, California, began operations on February 19, 2009 to develop and market a solar concentrator technology.\nLine of Business\nThe company is currently developing a novel solar-powered nanoparticle system that mimics photosynthesis to separate hydrogen from water. We intend for technology of this system to be used for the production of renewable hydrogen to produce renewable electricity and hydrogen for fuel cells.\nGoing Concern Substantial Doubt Alleviated\nIn connection with the preparation of its financial statements for the years ended June 30, 2022 and 2021, the Companys management evaluated the Companys ability to continue as a going concern in accordance with the ASU 2014-15, Presentation of Financial Statements-Going Concern (Subtopic 205-40), which requires an assessment of relevant conditions or events, considered in the aggregate, that are known or reasonably knowable by management on the issuance dates of the financial statements, which indicated the probable likelihood that the Company will be able to meet its obligations as they become due within one year after the issuance date of the financial statements.\nAs part of its evaluation, management assessed known events, trends, commitments, and uncertainties, which included the amount of capital recently and/or in the process of being raised, and the current level of investment within the green hydrogen industry and the measure of investor confidence.\nFor the year ended June 30, 2022, the Companys operating income increased to approximately $90,030,933, compared to an operating loss of approximately $81,498,123 in the prior year ended June 30, 2021. The increase in operating income consisted primarily of the non-cash change in derivative liability fair value.\nDuring the year ended June 30, 2022, the Company consummated financing transactions for up to $960,000 of proceeds for the purchase of common stock of the Company. The proceeds were used for general and administration expenses, and the cost of research and development. The research and development transaction is further discussed in Note 8 - Commitments and Contingencies.\nBased on its evaluation, coupled with the afore-mentioned financing transactions management believes that it has completely mitigated the circumstance that led to a doubt with respect to the Companys ability to continue as a going concern, which existed at the time of the filing of the Companys prior annual report. The Companys cash and cash equivalents of $27.7 million as of June 30, 2022 will enable it to meet its obligations for twelve months from the date these financial statements are available to be issued.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThis summary of significant accounting policies of SunHydrogen, Inc. is presented to assist in understanding the Companys financial statements. The financial statements and notes are representations of the Companys management, which is responsible for their integrity and objectivity. These accounting policies conform to accounting principles generally accepted in the United States of America and have been consistently applied in the preparation of the financial statements.\nCash and Cash Equivalent\nThe Company considers all highly liquid investments with an original maturity of three months or less to be cash equivalents.\nConcentration risk\nCash includes amounts deposited in financial institutions in excess of insurable Federal Deposit Insurance Company (FDIC) limits. At times throughout the year, the Company may maintain cash balances in certain bank accounts in excess of the FDIC limits. As of June 30, 2022, the cash balance in excess of the FDIC limits was $27,136,224. The Company has not experienced any losses in such accounts and believes it is not exposed to any significant credit risk in these accounts.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nMarketable Securities\nThe Company considers corporate bonds (bonds) as investments due to their ratings. The bonds are rated based on their default probability, health of the corporations debt structure, as well as the overall health of the economy. The bonds fall into the category as investments if they have a rating of AAA and BBB.\nAll investments are considered current, based on to their liquidity. The investments are generally valued using quoted prices and are classified in Level 2 of the fair value hierarchy as prices are not always from active markets. We consider our investments held to maturity and we believe there are no other than temporary declines in fair value. Our investments are recorded at historical cost.\nUse of Estimates\nIn accordance with accounting principles generally accepted in the United States, management utilizes estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements as well as the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. These estimates and assumptions relate to useful lives and impairment of tangible and intangible assets, accruals, income taxes, stock-based compensation expense, Binomial lattice valuation model inputs, derivative liabilities and other factors. Management believes it has exercised reasonable judgment in deriving these estimates. Consequently, a change in conditions could affect these estimates.\nProperty and Equipment\nProperty and equipment are stated at cost and are depreciated using straight line over its estimated useful lives.\nComputers and peripheral equipment 5 Years\nVehicle 5 Years\nThe Company recognized depreciation expense of $35,861 and $14,940 for the years ended June 30, 2022 and 2021, respectively.\nIntangible Assets\nThe Company has patent applications to protect the inventions and processes behind its proprietary bio-based back-sheet, a protective covering for the back of photovoltaic solar modules traditionally made from petroleum-based film. Intangible assets that have finite useful lives continue to be amortized over their useful lives.\nUseful Lives 6/30/2022 6/30/2021\nDomain-gross 15 years $ 5,315 $ 5,315\nLess accumulated amortization\n(4,931 ) (4,577 )\nDomain-net\n$ 384 $ 738\nTrademark-gross 10 years $ 1,143 $ 1,143\nLess accumulated amortization\n(601 ) (486 )\nDomain-net\n$ 542 $ 657\nPatents-gross 15 years $ 101,143 $ 101,143\nLess accumulated amortization\n(29,779 ) (23,215 )\nPatents-net\n$ 71,364 $ 77,928\nThe Company recognized amortization expense of $7,033 and $7,033 for the years ended June 30, 2022 and 2021, respectively.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nNet Earnings (Loss) per Share Calculations\nNet earnings (Loss) per share dictates the calculation of basic earnings (loss) per share and diluted earnings per share. Basic earnings (loss) per share are computed by dividing by the weighted average number of common shares outstanding during the year. Diluted net earnings (loss) per share is computed similar to basic earnings (loss) per share except that the denominator is increased to include the effect of stock options and stock-based awards (Note 4), plus the assumed conversion of convertible debt (Note 5).\nYear Ended June 30, 2022\nThe Company calculated the dilutive impact of the 157,965,711 outstanding stock options of 94,895,239 common stock purchase warrants, and the convertible debt and accrued interest of $1,019,263, which is convertible into shares of common stock. The common stock purchase warrants were not included in the calculation of net earnings per share, because their impact on income per share is antidilutive.\nYear Ended June 30, 2021\nFor the year ended June 30, 2021, the Company calculated the dilutive impact of 182,853,174 outstanding stock options, 94,895,239 outstanding warrants, and convertible debt including accrued interest for an aggregate total of $1,527,575, which is convertible into shares of common stock. The stock options, warrants and convertible debt were not included in the calculation of net earnings per share, because their impact was antidilutive.\nYears Ended\nJune 30,\nIncome (Loss) to common shareholders (Numerator) $ 90,030,933 $ (97,426,437 )\nBasic weighted average number of common shares outstanding (Denominator) 4,103,301,026 2,756,925,374\nDiluted weighted average number of common shares outstanding (Denominator) 5,217,576,101 2,756,925,374\nEquity Incentive Plan and Stock Options\nOn January 27, 2022, the Company adopted the 2022 Equity Incentive Plan, to enable the Company to attract and retain the types of employees, consultants, and directors who will contribute to the Companys long-range success. The maximum number of shares of common stock that may be issued under the 2022 Plan will initially be 400,000,000. The number of shares will automatically be increased on the first day of the Companys fiscal year beginning in 2023 so that the total number of shares issuable will at all times equal fifteen percent (15%) of the Companys fully diluted capitalization on the first day of the Companys fiscal year, unless the Board adopts a resolution providing that the number of shares issuable under the 2022 Plan shall not be so increased.\nEquity Incentive Plan\nOn December 17, 2018, the Board of Directors approved and adopted the 2019 Equity Incentive Plan (the Plan), with 300,000,000 shares reserved for issuance pursuant to the Plan. The purpose of the Plan is to promote the success of the Company and to increase stockholder value by providing an additional means through the grant of awards to attract, motivate, retain and reward selected employees and other eligible persons. The awards are performance-based compensation that are granted under the Plan as incentive stock options (ISO) or nonqualified stock options. The per share exercise price for each option shall not be less than 100% of the fair market value of a share of common stock on the date of grant of the option. The Company periodically issues stock options and warrants to employees and non-employees in non-capital raising transactions for services and for financing cost. The Company accounts for stock option grants issued and vesting to employees and non-employees in accordance with the authoritative guidance of the Financial Accounting Standards Board whereas the value of the stock compensation is based upon the measurement date as determined at either a) the date at which a performance commitment is reached, or b) at the date at which the necessary performance to earn the equity instruments is complete. Non-employee stock-based compensation charges generally are amortized over the vesting period on a straight-line basis. In certain circumstances where there are no future performance requirements by the non-employee, option grants are immediately vested, and the total stock-based compensation charge is recorded in the period of the measurement date. The Company granted options to purchase 170,000,000 shares of common stock options on January 23, 2019. During the years ended June 30, 2022 and 2021, the Company redeemed 24,887,463 and 13,146,826 stock options, respectively, for a total aggregate of 38,034,289.\nAs of June 30, 2022, there were 157,695,711 stock options issued, and a reserve of 43,670,096.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nStock Based Compensation\nThe Company accounts for stock option grants issued and vesting to employees and non-employees in accordance with the authoritative guidance of the Financial Accounting Standards Board whereas the value of the stock compensation is based upon the measurement date as determined at either a) the date at which a performance commitment is reached, or b) at the date at which the necessary performance to earn the equity instruments is complete. Non-employee stock-based compensation charges generally are amortized over the vesting period on a straight-line basis. In certain circumstances where there are no future performance requirements by the non-employee, option grants are immediately vested, and the total stock-based compensation charge is recorded in the period of the measurement date.\nWarrant Accounting\nThe Company accounts for the warrants to purchase shares of common stock using the estimated fair value on the date of issuance as calculated using the Black-Scholes valuation model.\nFair Value of Financial Instruments\nFair value of financial instruments requires disclosure of the fair value information, whether or not recognized on the balance sheet, where it is practicable to estimate that value. As of June 30, 2022, the amounts reported for cash, accrued interest and other expenses, notes payables, convertible notes, and derivative liability approximate the fair value because of their short maturities.\nWe adopted ASC Topic 820 for financial instruments measured as fair value on a recurring basis. ASC Topic 820 defines fair value, established a framework for measuring fair value in accordance with accounting principles generally accepted in the United States and expands disclosures about fair value measurements.\nFair Value of Financial Instruments\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. ASC Topic 820 established a three-tier fair value hierarchy which prioritizes the inputs used in measuring fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurements) and the lowest priority to unobservable inputs (level 3 measurements). These tiers include:\n● Level 1, defined as observable inputs such as quoted prices for identical instruments in active markets.\n● Level 2, defined as inputs other than quoted prices in active markets that are either directly or indirectly observable such as quoted prices for similar instruments in active markets or quoted prices for identical or similar instruments in markets that are not active.\n● Level 3, defined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions, such as valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nWe measure certain financial instruments at fair value on a recurring basis. Assets and liabilities measured at fair value on a recurring basis are as follows on June 30, 2022 and 2021 (See Note 6):\nTotal (Level 1) (Level 2) (Level 3)\nAssets:\nMarketable securities measured at fair value June 30, 2022 $ 43,446,041 $ 19,420,075 $ 24,025,966 $ -\nLiabilities:\nDerivative liabilities measured at fair value June 30, 2022 $ 26,015,069 $ -\n$ -\n$ 26,015,069\nDerivative liabilities measured at fair value June 30, 2021 $ 135,247,303 $ -\n$ -\n$ 135,247,303\nThe following is a reconciliation of the derivative liability for which Level 3 inputs were used in determining the approximate fair value:\nBalance as of June 30, 2021 135,247,303\nFair value of derivative liability removed (13,231,008 )\nGain on change in derivative liability (96,001,226 )\nBalance as of June 30, 2022 $ 26,015,069\nResearch and Development\nResearch and development costs are expensed as incurred. Total research and development costs were $1,792,457 and $1,997,186 for the years ended June 30, 2022 and 2021, respectively.\nAccounting for Derivatives\nThe Company evaluates all of its financial instruments to determine if such instruments are derivatives or contain features that qualify as embedded derivatives. For derivative financial instruments that are accounted for as liabilities, the derivative instrument is initially recorded at its fair value and is then re-valued at each reporting date, with changes in the fair value reported in the statements of operations. For stock-based derivative financial instruments, the Company uses a probability weighted average series Binomial lattice formula pricing models to value the derivative instruments at inception and on subsequent valuation dates.\nThe classification of derivative instruments, including whether such instruments should be recorded as liabilities or as equity, is evaluated at the end of each reporting period. Derivative instrument liabilities are classified in the balance sheet as current or non-current based on whether or not net-cash settlement of the derivative instrument could be required within 12 months of the balance sheet date.\nIncome Taxes\nDeferred income taxes are provided using the liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry-forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of the changes in tax laws and rates of the date of enactment.\nWhen tax returns are filed, it is highly certain that some positions taken would be sustained upon examination by the taxing authorities, while others are subject to uncertainty about the merits of the position taken or the amount of the position that would be ultimately sustained. The benefit of a tax position is recognized in the financial statements in the period during which, based on all available evidence, management believes it is more likely than not that the position will be sustained upon examination, including the resolution of appeals or litigation processes, if any. Tax positions taken are not offset or aggregated with other positions. Tax positions that meet the more-likely-than-not recognition threshold are measured as the largest amount of tax benefit that is more than (50%) fifty percent likely to be realized upon settlement with the applicable taxing authority. The portion of the benefits associated with tax positions taken that exceeds the amount measured as described above is reflected as a liability for unrecognized tax benefits in the accompanying balance sheet along with any associated interest and penalties that would be payable to the taxing authorities upon examination.\nReclassification of Expenses\nCertain amounts in the 2021 financial statements have been reclassified to conform to the presentation used in the 2022 financial statements. There was no material effect on the Companys previously issued financial statements.\nRecently Issued Accounting Pronouncements\nManagement does not believe that any other recently issued, but not yet effective, accounting standards if currently adopted would have a material effect on the accompanying audited financial statements as of June 30, 2022.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n3. CAPITAL STOCK\nSeries A Preferred Stock\nOn January 27, 2022, the Company filed a certificate of designation of Series A Preferred Stock with the Secretary of State of Nevada, designating 1,000 shares of preferred stock as Series A Preferred Stock, and issued 1,000 shares of Series A Preferred Stock to Timothy Young, the Companys chief executive officer as stock-based compensation. The Series A Preferred Stock does not have any dividend rights or liquidation preferences. The Series A preferred shares entitles the holder to 51% of the voting power of the Companys stockholders. The Series A Preferred Stock were to automatically be redeemed by the Company at their par value of $0.001 per share, on the first to occur of the following events: (i) a date sixty days after the effective date of the certificate of designation, (ii) the date that Tim Young ceases to serve as officer, director or consultant of the Company, or (iii) on the date that the Companys shares of common stock first trade on any national securities exchange and such listing is conditioned upon the elimination of the preferential voting rights of the Series A Preferred Stock. The estimated control premium for the voting control of the Series A Preferred Stock was 14.1%. The following assumptions were used: (i) control value of $22,101,999, (ii) control time period of 60 days, (iii) risk equivalent to the WACC of 26.4%. The common stock price was $0.0348, with a market capitalization based on the fully diluted common and preferred shares outstanding. The net fair value of the Series Preferred Stock was $960,700, which was recognized in the financial statements as additional paid in capital and recorded as stock-based compensation expense. The preferred shares expired March 27, 2022, and there were no outstanding shares as of June 30, 2022.\nSeries C Preferred Stock\nOn December 15, 2021, the Company filed a certificate of designation of Series C Preferred Stock with the Secretary of State of Nevada, designating 17,000 shares of preferred stock as Series C Preferred Stock. Each share of Series C Preferred Stock has a stated value of $100 and is convertible into shares of common stock of the Company at a conversion price equal to $0.00095. The Series C Preferred Stock holders are entitled to receive out of any funds and assets of the Company legally available prior and in preference to any declaration or payment of any dividend on the common stock of the Company, cumulative dividends, at an annual rate of 10% of the stated value, payable in cash or shares of common stock. In the event the Company declares or pays a dividend on its shares of common stock (other than dividend payable in shares of common stock), the holders of Series C Preferred Stock will also be entitled to receive payment of such dividend on an as-if-converted basis with respect to the Series C Preferred Stock. The Series C Preferred Stock confers no voting rights on holders, except with respect to matters that materially and adversely affect the voting powers, rights or preferences of the Series C Preferred Stock or as otherwise required by applicable law.\nThe Company entered into a securities purchase agreement on December 15, 2021, with an accredited investor for an exchange of convertible debt to equity. Under the purchase agreement, the Company and investor acknowledged there was $187,800 of principal remaining under the note issued to the investor by the Company on February 3, 2017, plus $80,365 of accrued interest, representing a total aggregate note balance of $268,165. Pursuant to the purchase agreement, the Company sold to investor 2,700 shares of the Companys newly designated Series C Preferred Stock for a total purchase price of $268,165, and a loss on settlement of debt of $1,835. As of June 30, 2022, the Company had a total of 2,700 shares of Series C Preferred Stock outstanding with a fair value of $268,165, and a stated face value of one hundred dollars ($100) (share value) per share and is convertible into shares of fully paid and non-assessable shares of common stock of the Company. The stock was presented as mezzanine equity because it is redeemable at a fixed or determinable amount upon an event that is outside of the issuers control. Upon liquidation, dissolution and winding up of the Corporation either voluntary or involuntary, the holder of each outstanding share of Series C Preferred Stock shall be entitled to receive, out of the assets of the Corporation available for distribution to its shareholders upon such liquidation, before any payments shall be made or any assets distributed to the holders of the common stock, the stated value of the Series C Preferred Shares plus any declared but unpaid dividends. No other current or future equity holders of the Corporation shall have higher priority of liquidation preference than holders of Series C Preferred Stock. The Holder has the right, at any time, at its election, to convert shares of Series C Preferred Stock into common stock at a conversion price of $0.00095.\nPer Valuation\nPreferred shares issued $ 2,700\nStated value of debt and interest $ 268,165\nCalculated fair value of preferred shares $ 14,340,769\nFair value of derivative liability removed $ (13,231,008 )\nLoss on settlement $ (1,109,761 )\nThe Company recognized a loss on settlement of $1,109,761 for the extinguishment of convertible debt, plus derivative liability for the year ended June 30, 2022.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n3. CAPITAL STOCK (Continued)\nCommon Stock\nOn January 27, 2022, the holder of the majority of the voting power of the shareholders of the Company, and the Companys chief executive officer, approved by written consent (i) an amendment to the Companys articles of incorporation to increase the Companys authorized shares of common stock from 5,000,000,000 to 10,000,000,000, (ii) an amendment to the Companys articles of incorporation to effect a reverse stock split of the Companys common stock by a ratio of not less than 1-for-100 and not more than 1-for-500 at any time prior to the one year anniversary of filing the definitive information statement with respect to the reverse split, with the board of directors having the discretion as to whether or not the reverse split is to be effected, and with the exact ratio of any reverse split to be set at a whole number within the above range as determined by the board in its discretion, and (iii) the adoption of the Companys 2022 Equity Incentive Plan. Such shareholder approval for such actions became effective 20 days after the definitive information statement relating to such actions was mailed to shareholders.\nYear ended June 30, 2022\nDuring the years ended June 30, 2022, the Company issued 381,457,044 shares of common stock upon conversion of convertible notes in the amount of $255,900 of principal, plus accrued interest of $106,484 based upon a conversion price of $0.00095 per share. The notes were converted per the terms of their respective agreements and therefore no gain or loss on the conversion was recorded.\nDuring the year ended June 30, 2022, the Company issued 40,983,607 shares of common stock pursuant to a purchase agreement for cash at a price of $0.02745 per share for aggregate net proceeds of $960,000.\nYear ended June 30, 2021\nDuring the year ended June 30, 2021, the Company issued 576,554,289 shares of common stock under purchase agreements for cash at prices ranging from $0.022 - $0.15 per share for aggregate net proceeds of $43,323,350.\nDuring the year ended June 30, 2021, the Company issued 252,000,000 shares of common stock upon exercise of warrants at an exercise price of $0.075 per share for gross proceeds of $18,900,000.\nDuring the year ended June 30, 2021, the Company issued 963,537,752 shares of common stock upon conversion of convertible notes in the amount of $1,144,350 of principal, plus accrued interest of $265,770 and other fees of $1,800 based upon conversion prices ranging from $0.00095 - $0.017995 per share. All note conversions were performed per the terms of their respective agreements and therefore no gain or loss on the conversion was recorded.\nDuring the year ended June 30, 2021, the Company issued 3,806,290 shares of common stock for services rendered at fair value prices of $0.028 - $0.035 per share in the aggregate amount of $118,023.\n4. OPTIONS AND WARRANTS\nOPTIONS\nOn October 2, 2017, the Company granted options to purchase 10,000,000 shares of non-qualified common stock options. Each option expires on the date specified in the option agreement, which date is not later than the fifth (5th) anniversary from the grant date of the options. Of the 10,000,000 non-qualified common stock options, one-third vest immediately, and one-third vest the second and third year, such that the options are fully vested with a maturity date of October 2, 2022 and are exercisable at an exercise price of $0.01 per share.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n4. OPTIONS AND WARRANTS (Continued)\nOn January 23, 2019, the Company issued 170,000,000 stock options. One-third of the options vested immediately, and the remainder vest 1/24 per month over the first twenty-four months following the option grant. The options expire 10 years from the initial grant date. The options fully vested by January 23, 2022.\nOn January 31, 2019, the Company issued 6,000,000 stock options, of which two-third (2/3) vested immediately, and the remaining amount shall vest one-twelfth (1/12) per month from after the date of the option grant. The options expire 10 years from the initial grant date. The options fully vested on January 31, 2020.\nOn July 22, 2019, the Company issued 10,000,000 stock options, of which one-third (1/3) vested immediately, and the remaining shall vest one-twenty fourth (1/24) per month from after the date of the option grant. The options expire 10 years from the initial grant date. The options fully vested on July 22, 2020.\nA summary of the Companys stock option activity and related information follows:\n6/30/2022 6/30/2021\nWeighted\nWeighted\nNumber average Number average\nOf exercise Of exercise\nOptions price Options price\nOutstanding, beginning of period 182,853,174 $ 0.01 196,000,000 $ 0.01\nGranted -\n$ 0.01 -\n-\nExercised -\n-\n-\n-\nRedemption of options (24,887,463 ) $ 0.0099 (13,146,826 ) $ 0.0099\nOutstanding, end of period 157,965,711 $ 0.0089 182,853,174 $ 0.0089\nExercisable at the end of period 157,965,711 $ 0.0089 182,853,174 $ 0.0089\nDuring the year ended June 30, 2022, the Company redeemed a total of 24,887,463 shares of the Companys stock options from related parties for a total of $1,450,000, leaving a balance of 157,965,711 stock options outstanding.\nDuring the year ended June 30, 2021, the Company redeemed a total of 13,146,826 shares of the Companys stock options from related parties for a total of $1,250,000, leaving a balance of 182,853,174 stock options outstanding.\nThe company's reasons for the option redemption action for CEO, Director, and consultant included:\n● Retention of said persons who had been with the company for years with no benefit of stock compensation due to volatility\n● This action allowed for more price stability in the stock.\n● Allowed the company to retain more shares in the equity incentive program established at the time.\nThe weighted average remaining contractual life of options outstanding as of June 30, 2022 and 2021 was as follows:\n6/30/2022 6/30/2021\nExercise\nPrice Stock\nOptions\nOutstanding Stock\nOptions\nExercisable Weighted\nAverage\nRemaining\nContractual\nLife (years) Exercise\nPrice Stock\nOptions\nOutstanding Stock\nOptions\nExercisable Weighted\nAverage\nRemaining\nContractual\nLife (years)\n$ 0.0100 3,071,212 3,071,212 0.26 $ 0.0100 7,369,421 7,368,421 1.26\n$ 0.0097 6,000,000 6,000,000 3.59 0.0097 6,000,000 6,000,000 4.59\n$ 0.0099 138,894,499 138,894,499 3.57 $ 0.0099 159,484,753 159,484,753 4.57\n$ 0.0060 10,000,000 10,000,000 4.06 $ 0.0060 10,000,000 10,000,000 5.06\n157,965,711 157,965,711\n182,853,174 182,853,174\nThe stock-based compensation expense recognized in the statement of operations during the year ended June 30, 2022 and 2021, related to the granting of these options was $0 and $259,955, respectively.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n4. OPTIONS AND WARRANTS (Continued)\nWARRANTS\nAs of June 30, 2022, the Company had an aggregate of 94,895,239 common stock purchase warrants outstanding, with exercise prices ranging from $0.0938 - $0.13125 per share. The warrants were estimated at fair value on the date of issuance as calculated using the Black-Scholes valuation model. The derivative calculated on all warrants outstanding are included in the derivative liability (See Note 6). The warrants can be exercised over periods of three (3) to five (5) years.\nA summary of the Companys warrant activity and related information follows for the year ended June 30, 2022.\n6/30/2022\nWeighted\nNumber average\nof exercise\nWarrants price\nOutstanding, beginning of fiscal year 94,895,239 $ 0.11\nGranted -\n-\nExercised -\n-\nForfeited/Expired -\n-\nOutstanding, end of fiscal year 94,895,239 $ 0.11\nExercisable at the end of fiscal year 94,895,239 $ 0.11\n6/30/2022 Weighted Average\nExercise\nPrice Warrants\nOutstanding Warrants\nExercisable Remaining Contractual\nLife (years)\n$ 0.0938 16,800,000 16,800,000 0.93 - 1.50\n$ 0.13125 6,666,667 6,666,667 3.66\n$ 0.12 71,428,572 71,428,572 3.67\n94,895,239 94,895,239\nAt June 30, 2022, the aggregate intrinsic value of the warrants outstanding was $0.\n5. CONVERTIBLE PROMISSORY NOTES\nAs of June 30, 2022, the outstanding convertible promissory notes are summarized as follows:\nConvertible Promissory Notes $ 827,500\nLess current portion 677,500\nTotal long-term liabilities $ 150,000\nMaturities of long-term debt for the next three years are as follows:\nPeriod Ended June 30, Amount\n$ 677,500\n100,000\n50,000\n$ 827,500\nAt June 30, 2022, the outstanding balance of the convertible promissory notes was $827,500.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n5. CONVERTIBLE PROMISSORY NOTES (Continued)\nThe Company issued a 10% convertible promissory note on February 3, 2017 (the Feb 2017 Note) in the aggregate principal amount of up to $500,000. The Company received tranches for an aggregate principal total of $500,000. The Feb 2017 Note had a maturity date of February 3, 2018, which the investor extended for an additional sixty (60) months from the effective date of the note, to February 3, 2022. The Feb 2017 Note was convertible into shares of common stock of the Company at a variable conversion price of the lesser of $0.01 per share or fifty percent (50%) of the lowest trading price since the original effective date of the note or the lowest effective price per share granted to any person or entity after the effective date to acquire common stock. If the Company failed to deliver shares in accordance with the timeframe of three (3) business days of the receipt of a notice of conversion, the lender, at any time prior to selling all of those shares, could rescind any portion, in whole or in part of that particular conversion attributable to the unsold shares and have the rescinded conversion amount returned to the principal sum with the rescinded conversion shares returned to the Company. In no event was the lender be entitled to convert any portion of the Feb 2017 Note to the extent such conversion would result in beneficial ownership by the lender and its affiliates of more than 4.99% of the outstanding shares of common stock of the Company. In addition, for each conversion, in the event, that shares were not delivered by the fourth business day (inclusive of the day of conversion), a penalty of $1,500 per day would be assessed for each day after the third business day (inclusive of the day of the conversion) until the shares are delivered. During the year ended June 30, 2022, the Company issued 180,480,692 shares of common stock upon conversion of principal in the amount of $120,400, plus accrued interest of $51,057. Also, during the year ended June 30, 2022, the Company exchanged the balance of the convertible note in the amount of $187,800, plus accrued interest of $80,365 for an aggregate total of $268,165, for 2,700 Series C preferred shares with a stated value of $100 per share and a 10% annual dividend (See Note 3). The preferred shares are convertible into common stock at a fixed conversion price of $0.00095. The Company recognized a loss on exchange in the amount of $1,835. The fair value of the convertible note and accrued interest in exchange for Series C preferred shares was $14,340,769. The balance of the Feb 2017 Note as of June 30, 2022 was $0.\nThe Company issued a 10% convertible promissory note on November 9, 2017 (the Nov 2017 Note) in the aggregate principal amount of up to $500,000. The Company received tranches for an aggregate principal total of 500,000. The Nov 2017 Note had a maturity date of November 9, 2018, with an automatic extension of sixty (60) months from the effective date of the note. The Nov 2017 Note is convertible into shares of common stock of the Company at a price equal to a variable conversion price of the lesser of $0.01 per share or fifty percent (50%) of the lowest trading price since the original effective date of the note or the lowest effective price per share granted to any person or entity after the effective date to acquire common stock. If the Company fails to deliver shares in accordance with the timeframe of three (3) business days of the receipt of a notice of conversion, the lender, at any time prior to selling all of those shares, may rescind any portion, in whole or in part of that particular conversion attributable to the unsold shares and have the rescinded conversion amount returned to the principal sum with the rescinded conversion shares returned to the Company. In no event shall the lender be entitled to convert any portion of the Nov 2017 Note to the extent such conversion would result in beneficial ownership by the lender and its affiliates of more than 4.99% of the outstanding shares of common stock of the Company. In addition, for each conversion in the event that shares are not delivered by the fourth business day (inclusive of the day of conversion), a penalty of $1,500 per day shall be assessed for each day after the third business day (inclusive of the day of the conversion) until the shares are delivered. During the year ended June 30, 2022, the Company issued 200,976,352 shares of common stock upon the conversion of principal of $135,500, plus the accrued interest of $55,427. The balance of the Nov 2017 Note as of June 30, 2022 was $177,500.\nThe Company issued a 10% convertible promissory note on June 27, 2018 (the Jun 2018 Note) in the aggregate principal amount of up to $500,000. The Company received tranches for an aggregate principal total of $500,000. The Jun 2018 Note matured on June 27, 2019, which was automatically extended for sixty (60) months from the effective date of the note. The Jun 2018 Note is convertible into shares of common stock of the Company at a price equal to a variable conversion price of the lesser of $0.01 per share or fifty percent (50%) of the lowest trading price since the original effective date of the note or the lowest effective price per share granted to any person or entity after the effective date to acquire common stock. If the Company fails to deliver shares in accordance with the timeframe of three (3) business days of the receipt of a notice of conversion, the lender, at any time prior to selling all of those shares, may rescind any portion, in whole or in part of that particular conversion attributable to the unsold shares and have the rescinded conversion amount returned to the principal sum with the rescinded conversion shares returned to the Company. In no event shall the lender be entitled to convert any portion of the Jun 2018 Note to the extent such conversion would result in beneficial ownership by the lender and its affiliates of more than 4.99% of the outstanding shares of common stock of the Company. In addition, for each conversion, in the event, that shares are not delivered by the fourth business day (inclusive of the day of conversion), a penalty of $1,500 per day shall be assessed for each day after the third business day (inclusive of the day of the conversion) until the shares are delivered. The Company recorded amortization of debt discount, which was recognized as interest expense in the amount of $403,260 during the year ended June 30, 2022.The balance of the Jun 2018 Note as of June 30, 2022 was $500,000.\nThe Company issued a 10% convertible promissory note on August 10, 2018 (the Aug 2018 Note) in the aggregate principal amount of up to $100,000. The Aug 2018 Note had a maturity date of August 10, 2019, with an extension of sixty (60) months from the date of the note. The Aug 2018 Note matures on August 10, 2023. The Aug 2018 Note may be converted into shares of the Companys common stock at a conversion price of the lesser of a) $0.005 per share or b) sixty-one (61%) percent of the lowest trading price per common stock recorded on any trade day after the effective date. The conversion feature of the Aug 2018 Note was considered a derivative in accordance with current accounting guidelines because of the reset conversion features of the Note. The balance of the Aug 2018 Note as of June 30, 2022 was $100,000.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n5. CONVERTIBLE PROMISSORY NOTES (Continued)\nOn April 15, 2020, the Company issued a convertible promissory note (the Apr 2020 Note) to an investor in the aggregate principal amount of $50,000. The Company received tranches for an aggregate principal total of $50,000. The Apr 2020 Note matures twelve (12) months from the effective dates of each respective tranche, such that the Apr 2020 Note matures on April 15, 2021, with an automatic extension of sixty (60) months from the effective date of each tranche. The Apr Note is convertible into shares of common stock of the Company at a variable conversion price of the lesser of $0.01 per share or fifty percent (50%) of the lowest trading price of the common stock recorded on any trade day after the effective date, or (c) the lowest effective price per share granted to any person or entity after the effective date to acquire common stock. If the Company fails to deliver shares in accordance with the timeframe of four (4) business days of the receipt of a notice of conversion, the lender, at any time prior to selling all of those shares, may rescind any portion, in whole or in part of that particular conversion attributable to the unsold shares and have the rescinded conversion amount returned to the principal sum with the rescinded conversion shares returned to the Company. In no event shall the lender be entitled to convert any portion of the Apr 2020 Note to the extent such conversion would result in beneficial ownership by the lender and its affiliates of more than 4.99% of the outstanding shares of common stock of the Company. In addition, for each conversion, in the event that shares are not delivered by the fourth business day (inclusive of the day of conversion), a penalty of $2,000 per day shall be assessed for each day after the fourth business day (inclusive of the day of the conversion) until the shares are delivered. The conversion feature of the April 2020 Note was considered a derivative in accordance with current accounting guidelines because of the reset conversion features of the Apr 2020 Note. The Company recorded amortization of debt discount, which was recognized as interest expense in the amount of $39,343 during the year ended June 30, 2022. The balance of the Apr 2020 Note as of June 30, 2022 was $50,000.\nAll note conversions were performed per the terms of their respective agreements. At June 30, 2022, the Company recognized a loss of $1,109,761 on conversion of a convertible note in exchange for Series C preferred stock.\n6. DERIVATIVE LIABILITIES\nASC Topic 815 provides guidance applicable to convertible debt issued by the Company in instances where the number into which the debt can be converted is not fixed. For example, when a convertible debt converts at a discount to market based on the stock price on the date of conversion, ASC Topic 815 requires that the embedded conversion option of the convertible debt be bifurcated from the host contract and recorded at their fair value. In accounting for derivatives under accounting standards, the Company recorded a liability representing the estimated present value of the conversion feature considering the historic volatility of the Companys stock, and a discount representing the imputed interest associated with the embedded derivative. The discount is amortized over the life of the convertible debt, and the derivative liability is adjusted periodically according to stock price fluctuations.\nThe convertible notes issued do not have fixed settlement provisions because their conversion prices are not fixed. The conversion features have been characterized as derivative liabilities to be re-measured at the end of every reporting period with the change in value reported in the statement of operations.\nDuring the year ended June 30 2022, the Company recorded a net gain in change in derivative of $96,001,226 in the statement of operations due to the change in fair value of the remaining notes, for the year ended June 30, 2022.\nAt June 30, 2022 and 2021, the fair value of the derivative liabilities are as follows:\nDerivative liability, convertible notes $ 24,528,775 $ 128,601,434\nDerivative liability, warrants 1,486,294 6,645,869\nTotal $ 26,015,069 $ 135,247,303\nFor purpose of determining the fair market value of the derivative liability for the embedded conversion, the Company used the Binomial lattice formula. The significant assumptions used in the Binomial lattice formula of the derivatives are as follows:\nRisk free interest rate 2.80% - 2.99%\nStock volatility factor 79.0% - 169.0%\nWeighted average expected option life 1 year - 5 years\nExpected dividend yield None\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n7. DEFERRED TAX BENEFIT\nThe Company files income tax returns in the U.S. Federal jurisdiction, and the state of California. With few exceptions, the Company is no longer subject to U.S. federal, state and local, or non-U.S. income tax examinations by tax authorities for years before 2019.\nDeferred income taxes have been provided by temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for tax purposes. To the extent allowed by GAAP, we provide valuation allowances against the deferred tax assets for amount when the realization is uncertain. Included in the balance at June 30, 2022 and 2021, are no tax positions for which the ultimate deductibility is highly certain, but for which there is uncertainty about the timing of such deductibility. Because of the impact of deferred tax accounting, other than interest and penalties, the disallowance of the shorter deductibility period would not affect the annual effective tax rate but would accelerate the payment of cash to the taxing authority to an earlier period.\nThe Companys policy is to recognize interest accrued related to unrecognized tax benefits in interest expense and penalties in operating expenses. During the periods ended June 30, 2022 and 2021, the Company did not recognize interest or penalties.\nAt June 30, 2022, the Company had net operating loss carry-forward of approximately $16,522,100, which expires in future years. No tax benefit has been reported in the June 30, 2022 and 2021 financial statements, since the potential tax benefit is offset by a valuation allowance of the same amount.\nThe income tax provision differs from the amount of income tax determined by applying the U.S. federal income tax rate to pretax income from continuing operations for the years ended June 30, 2022 and 2021 due to the following:\n6/30/2022\n6/30/2021\nBook income (loss)\n$ 18,906,495\n$ (15,718,840 )\nNon-deductible expenses\n(19,610,010 )\n15,976,835\nDepreciation and amortization\n2,625\n(480 )\nGain on abandoned asset\n-\n1,100\nValuation Allowance\n700,890\n(258,615 )\nIncome tax expense\n$ -\n$ -\nDeferred taxes are provided on a liability method, whereby deferred tax assets are recognized for deductible differences and operating loss and tax credit carry-forward and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the difference between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nDeferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n7. DEFERRED TAX BENEFIT (Continued)\nNet deferred tax liabilities consist of the following components as of June 30, 2022 and 2021:\n6/30/2022 6/30/2021\nDeferred tax assets:\nNOL carryover $ (3,469,640 ) $ 1,385,455\nResearch and development 452,330 351,695\nRelated party accrual 44,470 44,470\nDeferred tax liabilities:\nDepreciation and amortization (4,485 ) (4,885 )\nLess Valuation Allowance $ 2,977,325 $ (1,776,735 )\nIncome tax expense $ -\n$ -\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry-forward for Federal income tax reporting purposes are subject to annual limitations. Should a change in ownership occur, net operating loss carry-forward may be limited as to use in future years.\nThe Companys tax returns for the previous three years remain open for audit by the respective tax jurisdictions.\n8. MARKETABLE SECURITIES\nAs of June 30, 2022, the Company invested in corporate bonds and government bonds, which have been recognized in the financial statements at cost.\nThe Company considers corporate bonds and government bonds (bonds) as investments due to their ratings. The bonds are rated based on their default probability, health of the corporations debt structure, as well as the overall health of the economy. The bonds fall into the category as investments if they have a rating between AAA and BBB.\nAs of June 30, 2022, the components of the Companys short and long-term investments are summarized as follows:\nAdjusted\nCost Unrealized\nGains Unrealized\nLosses Fair\nValue Cash and\nCash\nEquivalents\nShort-Term\nMarketable\nSecurities\nCash 8,261,410 -\n-\n8,261,410 8,261,410 -\nSubtotal 8,261,410 -\n8,261,410 8,261,410 -\nLevel 1\nU.S. Treasury bills 18,644,465 -\n-\n18,644,465 18,644,465 -\nCorporate securities 775,610 -\n-\n775,610 775,610 -\nSubtotal 19,420,075 -\n-\n19,420,075 19,420,075 -\nLevel 2\nU.S. Government 17,501,557 -\n(62,522 ) 17,439,035 -\n17,439,035\nCorporate securities 6,821,683 -\n(234,752 ) 6,586,931 -\n6,586,931\nSubtotal 24,323,240 -\n(297,274 ) 24,025,966 -\n24,025,966\nTotal 52,004,725 -\n(297,274 ) 51,707,451 27,681,485 24,025,966\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n8. MARKETABLE SECURITIES (Continued)\nThe Company has invested in securities maturing from July 5, 2022 through August 16, 2023 that are held to maturity. The current trading prices or fair market value of the securities vary, and we believe any decline in fair value is temporary. All securities are current and not in default.\nThe following table summarizes the amortized cost of the held-to-maturity bonds at June 30, 2022, aggregated by credit quality indicator.\nCredit Quality Indicators for the Securities\nAA/A $ 38,778,037\nBBB $ 4,965,278\nTotal $ 43,743,315\nDuring the year ended June 30, 2022, the Company recognized interest income of $228,001 in the financial statements, which is recorded as part of investment income in the statement of operations.\n9. COMMITMENTS AND CONTINGENCIES\nEffective September 1, 2021, the Company entered into a new research agreement with the University of Iowa. As consideration under the research agreement, the University of Iowa will receive a maximum of $350,000 from the Company. The contract period was from September 1, 2021 through August 31, 2022. As of June 30, 2022, the research agreement was paid in full, and the Company extended its agreement with the University of Iowa through September 30, 2023.\nEffective October 1, 2021, the Company entered into a research agreement with the University of Michigan. As consideration under the research agreement, the University of Michigan will receive a maximum of $296,448, from the Company. The research agreement may be terminated by either party upon ninety (90) day prior written notice or a material breach or default, which is not cured within 90 days of receipt of a written notice of such breach. This agreement was signed by the Company on September 23, 2021. As of June 30, 2022, the research agreement was paid in full, and the Company extended its agreement with the University of Michigan September 30, 2023.\nEffective December 2021, the Company entered into a marketing media campaign in the amount of $350,000. During the year ended June 30, 2022 the Company paid $262,500, and the remaining balance of $87,500 was paid on July 11, 2022.\nThe Company rented lab space with the University of Iowa as of February 2022. The monthly rent is a base of $1,468, and plus an additional $500 for the rental of a lab on a month-to-month basis and is cancellable with a thirty (30) day notice. Due to the rental being month-to-month, ASC 842 lease accounting is not applicable.\nIn the normal course of business, the Company may be involved in legal proceedings, claims and assessments arising in the ordinary course of business. Such matters are subject to many uncertainties, and outcomes are not predictable with assurance. In the opinion of management, the ultimate disposition of these matters will not have a material adverse effect on the Companys consolidated financial position or results of operation.\nSUNHYDROGEN, INC.\nNOTES TO FINANCIAL STATEMENTS - AUDITED\nJUNE 30, 2022 AND 2021\n10. RELATED PARTY\nYear ended June 30, 2022\nAs of June 30, 2022, the Company reported an accrual associated with the CEOs prior years salary in the amount of $211,750 for the current year, which is recorded in related party accrued expenses. The Company began accruing the salary in 2011 and used the funds for operating expenses. The CEO will be paid during the fiscal year ending June 30, 2023.\nDuring the year ended June 30, 2022, the Company redeemed 24,887,463 shares of the Companys stock options from related parties for a total redemption price of $1,450,000.\nYear ended June 30, 2021\nAs of June 30, 2021, the Company reported an accrual associated with the CEOs prior years salary in the amount of $211,750, which is recorded in accrued expenses, related party. The Company began accruing the salary in 2011 and used the funds for operating expenses. The CEO will be paid during the next fiscal year.\nDuring the year ended June 30, 2021, the Company redeemed 13,146,826 stock options for a total redemption price of $1,250,000.\nDuring the year ended June 30, 2021, the Company issued 3,806,290 shares of common stock to a related party for services rendered at fair value prices of $0.028 - $0.035 per share in the aggregate amount of $118,023.\n11. SUBSEQUENT EVENTS\nManagement evaluated subsequent events as of the date of the financial statements pursuant to ASC TOPIC 855, all subsequent events to report were disclosed in Note 9.\nfalse FY\n2021-07-01 2022-06-30\n2021-12-31\n2022-10-07\n2022-06-30\n2021-06-30\nus-gaap:SeriesCPreferredStockMember\n2022-06-30\nus-gaap:SeriesCPreferredStockMember\n2021-06-30\n2020-07-01 2021-06-30\nus-gaap:PreferredStockMember\n2020-06-30\nhysr:MezzanineMember\n2020-06-30\nus-gaap:CommonStockMember\n2020-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2020-06-30\nus-gaap:RetainedEarningsUnappropriatedMember\n2020-06-30\n2020-06-30\nus-gaap:PreferredStockMember\n2020-07-01 2021-06-30\nhysr:MezzanineMember\n2020-07-01 2021-06-30\nus-gaap:CommonStockMember\n2020-07-01 2021-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2020-07-01 2021-06-30\nus-gaap:RetainedEarningsUnappropriatedMember\n2020-07-01 2021-06-30\nus-gaap:PreferredStockMember\n2021-06-30\nhysr:MezzanineMember\n2021-06-30\nus-gaap:CommonStockMember\n2021-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-06-30\nus-gaap:RetainedEarningsUnappropriatedMember\n2021-06-30\nus-gaap:PreferredStockMember\n2021-07-01 2022-06-30\nhysr:MezzanineMember\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2021-07-01 2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-07-01 2022-06-30\nus-gaap:RetainedEarningsUnappropriatedMember\n2021-07-01 2022-06-30\nus-gaap:PreferredStockMember\n2022-06-30\nhysr:MezzanineMember\n2022-06-30\nus-gaap:CommonStockMember\n2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-06-30\nus-gaap:RetainedEarningsUnappropriatedMember\n2022-06-30\nhysr:EquityIncentiveMember\n2021-07-01 2022-06-30\nus-gaap:EmployeeStockOptionMember\n2021-07-01 2022-06-30\nhysr:EquityIncentiveMember\n2018-12-01 2018-12-17\n2018-12-01 2018-12-17\n2019-01-02 2019-01-23\nhysr:ComputersAndPeripheralEquipmentMember\n2021-07-01 2022-06-30\nhysr:VehicleMember\n2021-07-01 2022-06-30\nhysr:DomainMember\n2021-07-01 2022-06-30\nhysr:DomainMember\n2022-06-30\nhysr:DomainMember\n2021-06-30\nus-gaap:TrademarksMember\n2021-07-01 2022-06-30\nus-gaap:TrademarksMember\n2022-06-30\nus-gaap:TrademarksMember\n2021-06-30\nus-gaap:PatentsMember\n2021-07-01 2022-06-30\nus-gaap:PatentsMember\n2022-06-30\nus-gaap:PatentsMember\n2021-06-30\nus-gaap:FairValueInputsLevel1Member\n2022-06-30\nus-gaap:FairValueInputsLevel2Member\n2022-06-30\nus-gaap:FairValueInputsLevel3Member\n2022-06-30\nus-gaap:FairValueInputsLevel1Member\n2021-06-30\nus-gaap:FairValueInputsLevel2Member\n2021-06-30\nus-gaap:FairValueInputsLevel3Member\n2021-06-30\nus-gaap:FairValueInputsLevel3Member\n2021-07-01 2022-06-30\nus-gaap:SeriesAPreferredStockMember\n2022-01-27\nus-gaap:SeriesAPreferredStockMember\n2022-01-01 2022-01-27\nus-gaap:SeriesCPreferredStockMember\n2021-12-15\nus-gaap:SeriesCPreferredStockMember\n2021-12-01 2021-12-15\nsrt:MinimumMember us-gaap:CommonStockMember\n2022-01-27\nsrt:MaximumMember us-gaap:CommonStockMember\n2022-01-27\nus-gaap:CommonStockMember\n2020-07-01 2021-06-30\nsrt:MinimumMember us-gaap:CommonStockMember\n2021-06-30\nsrt:MaximumMember us-gaap:CommonStockMember\n2021-06-30\nus-gaap:CommonStockMember\n2021-06-30\nsrt:MinimumMember\n2021-06-30\nsrt:MaximumMember\n2021-06-30\n2017-10-01 2017-10-02\nhysr:StockOptionPlanMember\n2021-07-01 2022-06-30\nhysr:StockOptionPlanMember\n2019-01-01 2019-01-23\nhysr:StockOptionPlanMember\n2019-01-01 2019-01-31\nhysr:StockOptionPlanMember\n2019-07-01 2019-07-22\nhysr:StockOptionPlanMember\n2022-06-30\nhysr:StockOptionPlanMember\n2020-07-01 2021-06-30\nhysr:StockOptionPlanMember\n2021-06-30\nus-gaap:WarrantMember\n2022-06-30\nsrt:MinimumMember us-gaap:WarrantMember\n2022-06-30\nsrt:MaximumMember us-gaap:WarrantMember\n2022-06-30\nhysr:RangeOneMember\n2022-06-30\nhysr:RangeOneMember\n2021-07-01 2022-06-30\nhysr:RangeOneMember\n2021-06-30\nhysr:RangeOneMember\n2020-07-01 2021-06-30\nhysr:RangeTwoMember\n2022-06-30\nhysr:RangeTwoMember\n2021-07-01 2022-06-30\nhysr:RangeTwoMember\n2021-06-30\nhysr:RangeTwoMember\n2020-07-01 2021-06-30\nhysr:RangeThreeMember\n2022-06-30\nhysr:RangeThreeMember\n2021-07-01 2022-06-30\nhysr:RangeThreeMember\n2021-06-30\nhysr:RangeThreeMember\n2020-07-01 2021-06-30\nhysr:RangeFourMember\n2022-06-30\nhysr:RangeFourMember\n2021-07-01 2022-06-30\nhysr:RangeFourMember\n2021-06-30\nhysr:RangeFourMember\n2020-07-01 2021-06-30\nus-gaap:WarrantMember\n2021-06-30\nus-gaap:WarrantMember\n2021-07-01 2022-06-30\nhysr:ExercisePriceOneMember\n2022-06-30\nsrt:MinimumMember hysr:ExercisePriceOneMember\n2021-07-01 2022-06-30\nsrt:MaximumMember hysr:ExercisePriceOneMember\n2021-07-01 2022-06-30\nhysr:ExercisePriceTwoMember\n2022-06-30\nhysr:ExercisePriceTwoMember\n2021-07-01 2022-06-30\nhysr:ExercisePriceThreeMember\n2022-06-30\nhysr:ExercisePriceThreeMember\n2021-07-01 2022-06-30\nhysr:ConvertiblePromissoryNotesTenMember\n2022-06-30\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Feb2017NoteMember\n2017-02-03\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Feb2017NoteMember\n2017-02-01 2017-02-03\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Feb2017NoteMember\n2022-06-30\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Feb2017NoteMember\n2021-07-01 2022-06-30\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Feb2017NoteMember us-gaap:SeriesCPreferredStockMember\n2021-07-01 2022-06-30\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Feb2017NoteMember us-gaap:SeriesCPreferredStockMember\n2022-06-30\nhysr:Feb2017NoteMember\n2021-07-01 2022-06-30\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Nov2017NoteMember\n2017-11-01 2017-11-09\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Nov2017NoteMember\n2017-11-09\n2018-11-09\n2018-11-01 2018-11-09\nhysr:ConvertiblePromissoryNotesTenPercentMember\n2017-11-09 2017-11-09\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Nov2017NoteMember\n2022-06-30\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Nov2017NoteMember\n2021-07-01 2022-06-30\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Jun2018NoteMember\n2018-06-27\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Jun2018NoteMember\n2018-06-01 2018-06-27\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Jun2018NoteMember\n2021-07-01 2022-06-30\nhysr:ConvertiblePromissoryNotesTenPercentMember hysr:Jun2018NoteMember\n2022-06-30\nhysr:ConvertiblePromissoryNotesNineMember\n2018-08-10\nhysr:UnsecuredConvertibleNotesTenPercentMember hysr:ConvertiblePromissoryNotesNineMember\n2018-08-01 2018-08-10\nhysr:ConvertiblePromissoryNotesNineMember\n2018-08-01 2018-08-10\nhysr:ConvertiblePromissoryNotesNineMember\n2022-06-30\nhysr:April2020NoteMember\n2020-04-15\n2020-04-15\nhysr:April2020NoteMember\n2020-04-15 2020-04-15\nhysr:April2020NoteMember\n2022-06-30\nhysr:April2020NoteMember\n2021-07-01 2022-06-30\n2021-07-01 2022-03-31\nsrt:MinimumMember\n2021-07-01 2022-06-30\nsrt:MaximumMember\n2021-07-01 2022-06-30\nus-gaap:CashMember\n2021-07-01 2022-06-30\nus-gaap:CashMember hysr:SubtotalMember\n2021-07-01 2022-06-30\nus-gaap:FairValueInputsLevel1Member us-gaap:USTreasuryBillSecuritiesMember\n2021-07-01 2022-06-30\nus-gaap:FairValueInputsLevel1Member us-gaap:CorporateNoteSecuritiesMember\n2021-07-01 2022-06-30\nus-gaap:FairValueInputsLevel1Member hysr:SubtotalMember us-gaap:CorporateNoteSecuritiesMember\n2021-07-01 2022-06-30\nus-gaap:FairValueInputsLevel2Member us-gaap:USGovernmentAgenciesShorttermDebtSecuritiesMember\n2021-07-01 2022-06-30\nus-gaap:FairValueInputsLevel2Member us-gaap:CorporateNoteSecuritiesMember\n2021-07-01 2022-06-30\nus-gaap:FairValueInputsLevel2Member hysr:SubtotalMember\n2021-07-01 2022-06-30\nhysr:CorporateBondsOneMember\n2022-06-30\nhysr:CorporateBondsTwoMember\n2022-06-30\n2021-09-01\n2021-10-01 2021-10-01\n2021-12-31 2021-12-31\nus-gaap:SubsequentEventMember\n2022-07-11\nsrt:ChiefExecutiveOfficerMember\n2022-06-30\nsrt:ChiefExecutiveOfficerMember\n2021-07-01 2022-06-30\nsrt:ChiefExecutiveOfficerMember\n2021-06-30\nsrt:ChiefExecutiveOfficerMember\n2020-07-01 2021-06-30\nsrt:MinimumMember srt:ChiefExecutiveOfficerMember\n2020-07-01 2021-06-30\nsrt:MaximumMember srt:ChiefExecutiveOfficerMember\n2020-07-01 2021-06-30\niso4217:USD\nxbrli:shares\nxbrli:pure\niso4217:USD\nxbrli:shares"
}