{
    "cik": "1481504",
    "company": "XERIANT, INC.",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-06-30",
    "sic": "3721",
    "state_of_inc": null,
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1481504/0001477932-22-007622-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1481504/000147793222007622/xeri_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1481504/0001477932-22-007622.txt",
    "filename": "1481504_10K_2022_0001477932-22-007622.htm",
    "content": "Item 1. Business\nXeriant, Inc. (Xeriant or the Company) is dedicated to the acquisition, development and commercialization of (a) transformative technologies, including eco-friendly specialty materials which can be successfully deployed and integrated across multiple industry sectors, and (b) disruptive innovations related to the emerging aviation market called Advanced Air Mobility, which include next-generation aircraft. We seek to partner with and acquire strategic interests in visionary companies that accelerate this mission. Xeriant is located at the Research Park at Florida Atlantic University in Boca Raton, Florida adjacent to the Boca Raton Airport.\nCorporate History\nWe were originally incorporated in Nevada on December 18, 2009 under the name Eastern World Solutions, Inc. The name changed to Banjo & Matilda, Inc. on September 24, 2013. Effective June 22, 2020 the Company changed its name from Banjo & Matilda, Inc. to Xeriant, Inc.\nOn April 16, 2019, the Company entered into a Share Exchange Agreement with American Aviation Technologies, LLC (AAT), an aircraft design and development company focused on the emerging segment of the aviation industry of autonomous and semi-autonomous vertical take-off and landing (VTOL) and unmanned aerial vehicles (UAVs).\nOn June 28, 2019, the Company spun out two wholly owned subsidiaries: Banjo & Matilda (USA), Inc. and Banjo & Matilda Australia Pty LTD.\nOn September 30, 2019, the acquisition of AAT closed, and AAT became a wholly owned subsidiary of the Company. On June 22, 2020, the name was changed from Banjo & Matilda, Inc. to Xeriant, Inc.\nOn May 31, 2021, the Company entered into a Joint Venture Agreement with XTI Aircraft Company (XTI) to form a new company, called Eco-Aero, LLC (the JV), with the purpose of completing the preliminary design of XTIs TriFan 600, a 5-passenger plus pilot, hybrid electric, vertical takeoff, and landing (eVTOL) fixed wing aircraft. Under the Agreement, Xeriant is contributing capital, technology, and strategic business relationships, and XTI is contributing intellectual property licensing rights and know-how. XTI and the Company each own 50 percent of the JV.\nEffective April 2, 2022, the Company entered into a Joint Venture with Movychem s.r.o., a Slovakian limited liability company (Movychem), called Ebenberg, LLC, setting forth the terms for the establishment of a joint venture (the JV) to develop applications and commercialize a series of flame retardant products in the form of polymer gels, powders, liquids and pellets derived from technology developed by Movychem under the name Retacell™. The JV is organized as a Florida limited liability and is owned 50% by each of the Company and Movychem.\nOUR BUSINESS SUMMARY\nIntroduction\nThe Space Race fueled global competition to own the skies, and led to break-neck innovations in aerospace, technology and advanced materials. From the first manned space flight, to the first man on the Moon, aerospace has been at the leading edge of some of the most important technological, design and engineering breakthroughs that have ever impacted global industry. The commercialization of transformative aerospace technologies, including eco-friendly specialty materials, has been successfully deployed and integrated across multiple industry sectors, and has led to a more prosperous and interconnected global economy. Aerospace continues to adapt to ongoing challenges and opportunities with technology-based solutions in design, safety, efficiency, maintenance, and environmental impact. These advancements are producing next generation aircraft and specialized technology and materials creating niche products and solutions for a changing consumer-driven world that demands improved safety, durability and decreased environmental impact in every facet of their lives.\nCompany Overview\nAdvanced Materials\nA primary focus of our Company is the acquisition and commercial exploitation of eco-friendly, advanced materials and chemicals which have applications across a broad range of industries and the potential to generate significant near-term revenue. The Companys commercialization strategy encompasses licensing arrangements and joint ventures with major industry players, which would allow for more rapid access to the market with reduced capital requirements and financial risk. In addition to providing the production and distribution infrastructure, these established partnering companies can streamline testing and certification and add brand recognition value. The advanced materials and chemicals may be sold as standalone products, enhancements to existing products, or used in the development of proprietary products under a new trademarked brand owned by the Company. The Company plans to explore manufacturing and branding opportunities for specific products derived from advanced materials and chemicals acquired or developed, which would involve setting up production facilities, equipment, systems and supply chain. Our plan to source and acquire strategic interests in visionary companies developing, integrating, and commercializing critical breakthrough technologies is underway with our first successful advanced materials transaction executed in the second quarter of 2022.\nEffective April 2, 2022, we entered into a Joint Venture Agreement with Movychem s.r.o, a Slovakian chemical company, setting forth the terms for a joint venture to develop applications and commercialize a series of products which incorporate an internationally patented flame-retardant technology developed by Movychem under the trade name Retacell®. The Joint Venture, owned 50% by Xeriant and 50% by Movychem, has acquired the exclusive worldwide rights to the intellectual property related to Retacell® and will be responsible for developing applications and commercializing products derived from Retacell®. Engineered over two decades, Retacell® is a versatile, biodegradable, non-toxic, high-performance thermal and fire protection chemical agent that is custom formulated for each application, based on the specific properties of the base material and the fire protection requirements. Retacell® can be applied as a coating, treatment, or infused during manufacturing into a variety of materials, including recycled plastics and wood-based fiber. In addition to becoming heat and fire resistant, the resulting Retacell®-enhanced materials are also water resistant.\nOn June 8, 2022, we announced the successful development of a multi-purpose, high-strength fire- and water-resistant composite panel made from a formulation of Retacell® and a cardboard fiber-reinforced polymeric resin, which can be sourced from recycled materials. The panel is fabricated through a compression molding process and may be produced or cut in varying thicknesses and sizes, including standard 48 x 96 sheets. Depending on the application, the panel can have different colors, textures or decorative finishes. Potential interior and exterior construction applications include walls, ceilings, flooring, framing, siding, roofing, and decking.\nOn July 13, 2022, we entered into a Letter of Intent with Next New Concept, Inc. (NNC), an innovator in environmentally friendly, quickly constructed building systems for affordable quality housing. The Letter of Intent to purchase Xeriants Retacell®-based wall panels is anticipated to generate over $100 million in revenue beginning in 2023 based on the volume of homes NNC has projected to construct. The letter of intent is non-binding and contemplates the parties will negotiate in good faith to complete a definitive agreement.\nThe Company is investigating the requirements for the buildout of manufacturing facilities in the United States and Eastern Europe to meet the demand for the Retacell®-infused wallboards. We have identified potential sites, located and priced specialized manufacturing equipment, started to formulate timetables, and hired a managing director with decades of experience to oversee the advanced materials division.\nAerospace\nAnother area of interest for our Company is the emerging aviation market called Advanced Air Mobility (AAM), the transition to more efficient, eco-friendly, automated and convenient flight operations enabled by the convergence of technological advancements in design and engineering, composite materials, propulsion systems, battery energy density and manufacturing processes. Next-generation aircraft being developed for this market offer low-cost, on-demand flight for passengers and cargo, utilizing lower altitude airspace and bypassing the traditional hub and spoke airport network with vertical takeoff and landing (VTOL) capabilities. Many of these lightweight aircraft are electrically powered through either hybrid or pure battery systems, which allows for quieter, low emission flights over urban areas, however with limited speed and range. The adoption and integration of niche aerial services through AAM is expected to provide benefits throughout the economy. We plan to partner with and acquire strategic interests in visionary companies that accelerate our mission of commercializing critical breakthrough AAM technologies which enhance performance, increase safety, and enable and support more efficient, autonomous, and sustainable flight operations, including electric and hybrid-electric passenger and cargo transport aircraft capable of vertical takeoff and landing. Our plan to source and acquire strategic interests in leading aerospace companies developing breakthrough VTOL aircraft began in the second quarter of 2021.\nEffective May 27, 2021, we entered into a joint venture with XTI Aircraft Company (XTI), a privately owned OEM based in Englewood, Colorado for the purpose of completing the preliminary design of XTIs TriFan 600, a 5-passenger plus pilot, hybrid electric vertical takeoff and landing (eVTOL) fixed-wing aircraft.\nThrough our joint venture agreement with XTI, we were involved in the successful completion of the preliminary design of their TriFan 600 eVTOL aircraft. The TriFan 600 is being designed to become the fastest, longest-range VTOL aircraft in the world and the first commercial fixed-wing VTOL airplane, with current pre-orders exceeding $3 billion in gross revenues upon delivery of those aircraft. The joint venture is an important component in Xeriants plan to bolster its position in AAM.\nManagement believes that our holding and operating company structure has several advantages and will enable us to grow rapidly, acquiring assets primarily through acquisitions, joint ventures, strategic investments, and licensing arrangements. As a publicly traded company, we offer our subsidiaries such benefits as improved access to capital, higher valuations and lower risk through the shared ownership of a diversified portfolio, while allowing these entities to maintain independence in their distinct operations to focus on their fields of expertise. Cost savings and efficiencies may be realized from sharing non-operational functions such as finance, legal, tax, sales & marketing, human resources, purchasing power, as well as investor and public relations.\nAdditionally, we are leveraging our relationship with Florida Atlantic University to provide a collaborative research arm for technologies that require additional validation and the backing of a respected research institution for credibility. The university also may provide access to various grants through the SBIR (Small Business Innovation Research), STTR (Small Business Technology Transfer), NSF (National Science Foundation) and other programs, and if warranted, introductions into a number of government agencies, such as DOD (Department of Defense) and DARPA (Defense Advanced Research Projects Agency). We are pursuing strategic alliances with companies that provide complementary technologies and access to new markets.\nThe Company is trading on the OTCQB Venture Market under the stock symbol, XERI.\nIndustry Overview\nAerospace innovation has been at the forefront of many important scientific, technological, design and engineering breakthroughs which have had broad implications across non-aerospace sectors of the economy. Research and development initiatives originally intended for aerospace applications have contributed to advances in health care, transportation, telecommunications, agriculture, manufacturing and materials, and have led to the commercialization of new technologies and products that have positively impacted our daily lives.\nOne of the most recognized areas of research where the aerospace industry has played a major role is polymer chemistry, which includes the development of plastics technologies and fire retardants in plastics, coatings and adhesives. Technical improvements in aircraft design have shifted from a focus on speed and range to efficiency and sustainability, creating the need for advanced materials in aerostructures and engines that are lightweight and resistant to extreme heat. Plastic composites using carbon fiber are increasingly used in the structural components of aircraft, replacing aluminum. Additionally, aircraft interior design incorporates lighter, flame-resistant polymer materials and engineered alloys for panels, seats and various components to reduce weight.\nAdvanced polymer materials with superior performance characteristics, including flame-resistance with non-toxic gases, have wide applicability in the construction industry. Plastic composite boards may be fabricated from a range of polymers, including polypropylene (PP), polystyrene (PS), polyvinyl chloride (PVC) and polyamide (PA), which are inherently water-resistant, and reinforced with a variety of materials, including cardboard fiber, fiberglass, wood or carbon, which provide increased mechanical strength. Additives, surface treatments and decorative finishes can further enhance the properties of the boards, which can be manufactured in standard sizes and become a replacement for gypsum and wood based structural panels such as drywall, plywood, OSB and MDF, and flooring. Plastic composite boards made from recycled plastics and fiber are considered green building products, not only because they decrease the amount of waste materials from landfills, but because they have insulating properties that can cut energy costs. When infused with a non-toxic flame retardant, these eco-friendly composite panels can be an effective passive fire protection system, providing superior safety and minimizing property damage from flame spread and smoke.\nThe construction industry is seeing an accelerating demand for sustainable building practices, which is expected to drive the market growth of green building materials, as well as promote the use of non-toxic chemicals, including flame retardants. Green building materials are an environmentally friendly solution because they are produced from safe, recyclable products, which help in conserving non-renewable resources and mitigating environmental and human health considerations. Moreover, green building materials have become a durable and energy-efficient solution that makes them suitable for various infrastructure applications. As part of a major rebuilding of aging infrastructure across the globe, investments in renovations and retrofit construction, including the replacement of decaying underground materials, often mandate the use of green materials and building methods. New construction of governmental buildings, office complexes, schools and residential structures is increasingly employing eco-friendly alternatives for insulation, concrete, wallboard and rebar, which often have similar or superior performance when compared with conventional materials. Several developing countries are launching programs with subsidies and incentives to spur growth in the market and spread awareness about alternative construction methods with the goal of supplying affordable and sustainable housing. In the U.S., LEED (Leadership in Energy and Environmental Design) is the most widely used rating system for green building practices.\nBelow are some compelling statistics and forecasts in support of the development and commercialization of green building products, including non-toxic flame-retardant chemicals:\n·\nSustainable investments total USD 35.3 trillion, or 36% of all assets in five of the world's biggest markets, according to a report from the Global Sustainable Investment Alliance.\n·\nAccording to Research and Markets, global investments in sustainable and green technologies for smart cities and megaprojects is expected to reach USD 6.96 trillion by 2030, which represents a CAGR of 24.2%, which is expected to result in a rising demand for wood plastic composites and creating opportunities for interior construction manufacturers.\n·\nThe global green building materials market exceeded USD 265 billion in 2021 and is poised for a 12% CAGR from 2022 to 2028, reaching USD 586 billion by 2028, based on a report by Global Market Insights.\n·\nThe global green building materials market from residential applications is set to account for USD 330 billion by 2028, according to Global Market Insights.\n·\nThe global construction market size reached USD 12.6 trillion in 2020 and is expected to reach USD 22.4 trillion by 2028, registering a CAGR of 7.4% during the forecast period, based on a study by Emergen Research.\n·\nThe U.S. Census Bureau values the U.S. construction industry at USD 1.626 trillion as of November 2021.\n·\nThe global building materials market size is estimated to be worth USD 1.121 trillion in 2022 and is forecast to reach USD 1.494 trillion by 2028 with a CAGR of 4.9% during the review period, according to Market Reports World.\n·\nThe global drywall and gypsum board market size is estimated to grow from USD 50.22 billion in 2020 to USD 95.15 billion in 2027, registering a CAGR of 11.24% during the forecast period (2021-2027), based on a report by Market Statsville Group.\n·\nThe global plywood market size is estimated to be valued at USD 80.5 billion in 2022, and is expected to reach a valuation of USD 115 billion by 2028, based on a CAGR of 6.1%, according to Future Market Insights.\n·\nAccording to Allied Market Research, the global OSB market size was valued at USD 25.6 billion in 2020 and is projected to reach USD 44.3 billion by 2030, growing at a CAGR or 5.4% from 2021 - 2030.\n·\nThe global medium-density fiberboard market (MDF) size reached USD 22.4 billion in 2021, and is expected to reach USD 33.3 billion by 2027, exhibiting a CAGR of 6.7% during 2022-2027, based on a study by IMARC Group.\n·\nThe global wood plastic composites market size was estimated at USD 5.76 billion in 2021 and is expected to grow at a CAGR of 11.5% from 2022 to 2030, reaching USD 15.34 billion by 2030, according to Grand View Research.\n·\nEmergen Research estimates the global structural insulated panels (SIPs) market was USD 409.4 million in 2020 and is expected to register a CAGR of 5.2% during the forecast period, reaching 583.8 million in 2027.\n·\nThe global flame retardants market was valued at USD 12.81 billion in 2021 and is expected to reach USD 20.73 billion by 2029, registering a CAGR of 6.20% during the forecast period of 2022-2029, according to Data Bridge Market Research.\n·\nIn April 2022, the European Union unveiled a Restrictions Roadmap, a proposal to eliminate up to 12,000 toxic chemicals, including flame retardants, which have been linked to a number of illnesses.\n·\nApproximately 367 million metric tons of plastic waste are produced globally each year, of which the U.S. generates 42 million metric tons, more than any other country.\n·\n12% of the global waste composition is plastic waste, which partially consists of plastic packaging among other plastic products and materials.\n·\nOver 66 million metric tons of plastic is collected for recycling, according to TheRoundup.org.\n·\nThere are currently 5.25 trillion pieces of plastic in our oceans, according to TheRoundup.org.\n·\nAccording to the World Bank, paper and cardboard make up 17% of the global waste generated, the second-highest amount after food and green waste.\n·\n23.05% of the municipal solid waste generated in the U.S. in 2018 consisted of paper and paperboard, which was the #1 highest amount generated of all materials including glass, metals, wood, textiles, and more, according to the EPA.\n·\nCountries all over the world are facing a housing crisis, with a massive shortage of homes for expanding populations. and 100 million are homeless, according to United Nations statistics.\n·\nIndias drive to bring homes to the countrys 1.3 billion people, rising incomes and the best affordability in two decades will unleash a $1.3 trillion wave of investment in housing over the next seven years, according to CLSA India Pvt.\n·\nThe Indian government has provided initiatives like the Green Rating for Integrated Habitat Assessment (GRIHA) to promote green buildings, as reported by Mordor Intelligence.\n·\nBy 2030, UN-Habitat estimates that 3 billion people, about 40 per cent of the worlds population, will need access to adequate housing, which translates into a demand for 96,000 new affordable and accessible housing units every day.\n·\nAn estimated 1.6 billion people live in substandard housing, 100 million people worldwide are homeless, and one in four people live in harmful conditions that to their health, safety and prosperity, according to United Nations statistics.\n·\nBy 2050, the world population is projected to reach 9.8 billion, according to the United Nations.\nThe aerospace industry continues to evolve and adapt as market conditions change and as technological innovation enables the development of aircraft with new capabilities, applications and business cases. Next-generation aircraft are more efficient, sustainable, reliable, automated and safer through technological improvements in design optimization and modeling, advanced materials, AI, alternative propulsion systems and manufacturing processes. Many of the airframe configurations enabled by these developments are being designed for the emerging aviation market called Advanced Air Mobility (AAM), the integration of new aircraft designs and flight technologies to move people and cargo between places not usually served by existing ground or air transportation. Common technologies in AAM include electric propulsion, short and vertical takeoff/landing techniques, composite materials, and the ability to remotely or autonomously pilot aircraft. In addition to being quieter with less or no carbon emissions, it is anticipated that these new aircraft will have lower operating, maintenance, and repair costs compared with other aircraft, including helicopters.\nBelow are some compelling statistics and forecasts in support of the development and commercialization of aerospace technologies related to Advanced Air Mobility:\n·\nInvestment bank Morgan Stanley forecasts a USD 1 trillion total addressable market for electrically powered autonomous passenger and cargo air transport vehicles by 2040, and USD 9 trillion by 2050.\n·\nNearly half of all flights globally are short-haul routes, less than 500 miles, which presents a significant opportunity for electrically powered aircraft.\n·\nAlmost 3,000 general aviation airports in the U.S. have no scheduled passenger flights but are being maintained by the federal government through funds appropriated by Congress.\nThese airports can be utilized for flights by electrically powered to connect underserved areas, ultimately creating a more distributed air transportation network.\n·\nBetween now and 2040, there will be an estimated global demand for almost 40,000 new passenger and cargo aircraft, 75 percent of which are smaller airliners targeting short-haul routes, according to Airbus.\n·\nOptimization of airframe configurations to improve aerodynamics, including propulsion- airframe integration, can contribute as much as 20-25 percent in fuel consumption reduction.\n·\nIn December 2019, the FAA (Federal Aviation Administration) issued new proposed rules for remote identification of unmanned aircraft, indicating its serious intent to integrate these aircraft systems into the national airspace.\n·\nAgility Prime was recently created by the U.S. Air Force to help accelerate the regulatory process for the integration of commercial advanced air mobility vehicles, like flying cars, into our air transportation system.\n·\nIn June 2020, the FAA in collaboration with NASA (National Aeronautics and Space Administration) and industry organizations published the Concept of Operations for Urban Air Mobility to describe the envisioned operational environment that supports the expected growth of flight operations in urban areas.\n·\nThe United Nations projects that by 2050, 68 percent of the worlds population will live in urban areas, up from 55 percent today, resulting in increased traffic congestion, stress and air pollution.\n·\nAirlines for America (A4A), the industry trade organization representing the leading U.S. airlines, has committed to the recommendations of the International Civil Aviation Organization (ICAO), the United Nations body that sets standards and recommended practices for international aviation, including carbon-neutral growth from 2020 with an aspirational goal of a 50 percent reduction in CO2 by 2050 relative to 2005 levels.\n·\nThe Advisory Council for Aeronautics Research in Europe has set goals of a 75 percent reduction in CO2 emissions per passenger and a 65 percent reduction in perceived noise emissions by 2050.\nThe Research Park at Florida Atlantic University\nIn August 2019, Xeriant was approved by the Florida Atlantic Research and Development Authority to become a member and tenant of the Research Park at Florida Atlantic University (FAU) in Boca Raton, Florida, which is part of the university and adjacent to the Boca Raton Airport. FAU is one of the top engineering schools in the state, and part of the National Science Foundations Industry/University Cooperative Research Center Program called the Center for Advanced Knowledge Enablement (CAKE). The 70-acre Research Park, home to many technology companies and research-based organizations, is the site of Xeriants main office. FAU recently opened a center for Artificial Intelligence and Connected Assured Autonomy through their College of Engineering and Computer Science, which is applicable to advanced aircraft systems. The Company is engaging with FAUs academic team, both faculty and students, to assist in screening and validating various technologies and to work together in a series of joint research initiatives. The relationship with FAU gives Xeriant credibility, since few companies are selected for membership in its research park and may provide access to grant programs and financing opportunities. Universities continue to be an indispensable source for novel discoveries in science and technology, with an impressive history of innovations that changed the world. Research parks have become the intermediaries between these academic institutions and industry, a hybrid of two diverse cultures that fosters a dynamic innovation ecosystem of technology transfer, economic development and the generation of skilled labor. Faculty members often play a direct role in furthering the commercialization of technologies by launching new companies.\nIntellectual Property\nXeriant owns a 64% interest in its subsidiary, American Aviation Technologies, LLC (AAT). AAT owns a patented VTOL drone/aircraft concept called Halo. All intellectual property rights to Halo, including patents and applications for patents, were acquired on October 2, 2018. A Halo utility patent was filed on September 28, 2018, which was a continuation of U.S. Patent Application Serial No. 12/157,180, filed June 5, 2008, which claimed the benefit of and priority to U.S. Patent Application Serial No. 60/941,965, filed June 5, 2007, with both prior applications fully incorporated in their entireties and for all purposes. We received a Notice of Allowance from the U.S. Patent and Trademark Office dated June 10, 2019 on the major claims in the patent application, which indicated the agencys intent to issue a patent. we received an additional Notice of Allowance dated June 22, 2020 covering additional Halo claims. AAT received patent US 2020/0062385 A1 on February 27, 2020 and patent US 10,814,974 B2 on October 27, 2020. Under the Joint Venture Agreement with Movychem, the Company has exclusive worldwide licensing rights to a series of international patents related to the production of Retacell®, which is a trademarked name.\nXeriant has filed trademark applications with the U.S. Patent and Trademark office for the following marks, including names, logos and slogans: Xeriant name, Xeriant logo, Innovation Soaring, Evolution in Flight, Evolution of Flight and NexBoard. The Company is in the process of filing trademark applications for Sustainable Aerospace and EcoFlite.\nMarket Opportunity\nXeriant has identified emerging areas of technology with exceptional market opportunity, which is the basis for potential acquisitions, strategic partnerships or licensing arrangements. We have identified early-stage technology companies, as well as established companies that have been confined to a limited geographical area, have developed breakthrough, high-market-potential technologies, and that are past the concept/seed capital stage. Some companies are already generating revenue while others have a clear path to revenue. Many are acquisition targets or have the potential for a combination or roll-up. In some cases, their technology originated and was developed out of an academic environment. As a strategic partner or acquiror, we provide companies with access to capital, liquidity through an exchange of equity, new market opportunities and synergistic contacts, and university relationships for research and grants, while maintaining partners operational independence. We believe the entrepreneurial spirit, passion, and vision are critical to success, and we provide strategic guidance, access to financial markets, and investor liquidity.\nWe entered a 50-50 joint venture with Movychem s.r.o. for the purpose of developing and commercializing applications and specialty flame protectant products under the name Retacell®. The number of potential applications for Retacell® is almost unlimited, impacting a broad range of industries from transportation and construction to electronics and home furnishings, valued at over $5 Trillion. In the aerospace industry, Retacell® is anticipated to have far reaching implications for improving safety and reducing maintenance in aircraft, with potential uses in airframe structures, cabin interiors, wiring insulation and engine components. Retacell®s exceptional fire protection properties have generated interest from key players in the construction industry and building materials retailers in the U.S., who are looking for more cost-effective and sustainable fire protection solutions. The global green construction materials market, estimated at $318 Billion in 2021, is projected to reach $575 Billion by 2027, based on a report by Emergen Research.\nAccording to Grand View Research, the global building materials market related to gypsum wallboards, plywood, OSB, flooring and siding was valued at USD 838.1 billion in 2021 and is forecasted to reach USD 1.092.4 billion by 2025. The green building materials market was valued at USD 256.5 billion in 2021 and is projected at USD 350.3 billion in 2025, based on a study by Allied Market Research.\nWe entered a 50-50 joint venture with XTI Aircraft Company to complete the preliminary design phase in the development of the TriFan 600, a hybrid-electric fixed-wing VTOL aircraft that uses three ducted fans for vertical lift. The TriFan 600 would be the fastest and longest-range VTOL aircraft in the world, and the first commercial fixed-wing VTOL airplane. The TriFan 600 has a maximum cruise speed of 345 mph and a range of 850 miles with conventional takeoff and landing, and 700 miles when taking off and landing vertically, which is far superior to other leading eVTOL aircraft in development. In comparison, Lilium Jet, Joby Aviations S4, and the Archer Maker have maximum cruise speeds of 175 mph, 200 mph, and 200 mph respectively, with ranges of 150 miles, 150 miles, and 60 miles. The TriFan 600 can be configured with the standard six seats (5 passengers + pilot), nine seats for air taxi routes (8 passengers + pilot), or as an emergency medical aircraft. As a scalable platform, there is also a cargo variant called the TriFan 200 and a 12-15 seat model. XTIs management team includes the former top executives of Aereon Supersonic, Gulfstream, Citation, Skunk Works, Textron, Cessna Aircraft, and AVX Aircraft who, combined, have developed and certified more than 40 new aircraft designs over their careers. There are over 300 presales for the TriFan 600 representing over $3 billion in future revenue.\nA cross-section of Morgan Stanley Researchs equity analysts last year detailed how investment in autonomous flying aircraft is accelerating. The BluePaper described implications for the future of passenger travel, military and defense applications, and freight and package transportation, and projected a total addressable market of $1.5 trillion for autonomous aircraft by 2040.\nXeriant focuses on disruptive technology with broad applications across high value industries. Categories include a broad range of disciplines impacting areas such as advanced materials, artificial intelligence (AI), sensors, communications, navigation and defense. Target companies and technologies should have significant upside potential, unique I/P, roll up or combination potential, have a quality team in place to execute their business plan, and need funding for execution or growth, etc.\nDevelopment Strategy\nXeriant is dedicated to the acquisition, development and commercialization of transformative aerospace technologies, including eco-friendly specialty materials which can be successfully deployed and integrated across multiple industry sectors, and disruptive innovations related to the emerging aviation market called Advanced Air Mobility, which include next-generation aircraft. We seek to partner with and acquire strategic interests in visionary companies that accelerate this mission.\nPursuant to the Joint Venture signed with Movychem s.r.o. on April 2, 2022, the Company is planning to commercialize a slate of Retacell-formulated products, mainly through licensing arrangements with major industry leaders, which would allow for more rapid access to the market with reduced capital requirements and financial risk. Our flagship product is a multi-purpose, high-strength fire- and water-resistant composite panel made from a formulation of Retacell® and a cardboard fiber-reinforced polymeric resin, called NexBoardTM, which can be sourced from recycled materials.\nThe Company is currently investigating the requirements to buildout manufacturing facilities in the United States and Eastern Europe to meet the demand for the Retacell®-infused wallboards. We have identified potential sites, located and priced specialized manufacturing equipment, started to formulate timetables, and hired a managing director with decades of experience to oversee the advanced materials division.\nXeriant continues much of its focus on Advanced Air Mobility (AAM) as it believes the market segment and its related technological advancements will lead to a more sustainable future. Morgan Stanley is forecasting a $1 trillion total addressable global market for eVTOL aircraft and AAM by 2040, which is projected to reach $9 trillion by 2050.\nXeriant seeks to capitalize on breakthroughs in efficiency and sustainability developed for AAM, which will likely have far-reaching applications in global industries that are seeking ways to increase efficiency while reducing their carbon footprints.\nThrough our joint venture agreement with XTI Aircraft, we were involved in the successful completion of the preliminary design of their TriFan 600 eVTOL aircraft. The TriFan 600 is being designed to become the fastest, longest-range VTOL aircraft in the world and the first commercial fixed-wing VTOL airplane, with current pre-orders exceeding $3 billion in gross revenues upon delivery of those aircraft. The joint venture continues to be an important component in Xeriants plan to bolster its position in AAM.\nXeriant continues to work with XTI Aircraft and is exploring relationships with several AAM companies that are working to solve issues related to safety, autonomy, wireless connectivity, electric propulsion, batteries, hydrogen, navigation systems, computer processing, camera systems, stabilization equipment, imaging sensors and analytics software.\nAdditionally, Xeriant is leveraging its relationship with Florida Atlantic University to provide a collaborative research arm for technologies that require additional validation and the backing of a respected research institution for credibility. The university also may provide access to various grants through the SBIR (Small Business Innovation Research), STTR (Small Business Technology Transfer, NSF (National Science Foundation) and other programs, and if warranted, introductions into a number of government agencies, such as DOD (Department of Defense) and DARPA (Defense Advanced Research Projects Agency). Xeriant is pursuing strategic alliances with companies that provide complementary technologies and access to new markets.\nCONSIDERATIONS RELATED TO OUR BUSINESS Item 1A. Risk Factors\nAn investment in our common stock involves a high degree of risk. Before making an investment decision, you should give careful consideration to the following risk factors, in addition to the other information included in this prospectus, including our financial statements and related notes, before deciding whether to invest in shares of our common stock. The occurrence of any of the adverse developments described in the following risk factors could materially and adversely harm our business, financial condition, results of operations or prospects. In that case, the trading price of our common stock could decline, and you may lose all or part of your investment.\nRISKS RELATING TO OUR FINANCIAL POSITION AND CAPITAL NEEDS\nWe are in our development stage and have limited operating history.\nWe are a development-stage enterprise with a limited operating history with no sales, and operating losses since its inception. We will need to continue building our organization and team to competently evaluate and secure business opportunities for the development of sophisticated technologies. As an early-stage business we will likely encounter unforeseen costs, expenses, competition and other problems to which such businesses are often subject. Our likelihood of success will depend on the problems, uncertainties, unexpected costs, difficulties, complications and delays frequently encountered in developing and expanding a new business and the competitive environment in which we plan to operate. If we fail to successfully address these risks, our business, financial condition and results of operations would be materially harmed.\nWe anticipate operating losses to continue into the foreseeable future and substantial additional capital may be required that may not be available on acceptable terms.\nCurrently, there is no revenue being generated and the Company has significant operating losses that are expected to continue into the foreseeable future. There is no assurance that the Company will be able to raise the capital that will be required to sustain operations and execute its business plan, which involves raising capital for acquisitions as well as developing and commercializing technologies. We are especially focused on exploitation of its green advanced chemicals business, namely the Retacell® technology, which may require setting up a manufacturing operation. Additionally, the joint venture agreement with Movychem requires us to fund $25,000 per month through April 2024, and invest $2,000,000 in the joint venture, Ebenberg, LLC, within five business days of the closing of a financing in which Xeriant receives net proceeds of at least $3,000,000, to acquire 50% ownership of the Movychem patents and intellectual property.\nWe expect capital outlays and operating expenditures to increase as we expand our product offerings and marketing activities. Our business or operations may change in a manner that would consume available funds more rapidly than anticipated, and substantial additional funding may be required to maintain operations, fund expansion, develop new or enhanced products or services, acquire complementary products, businesses or technologies or otherwise respond to competitive pressures and opportunities. Furthermore, any equity or debt financings, if available at all, may be on terms which are not favorable to the Company (and therefore its shareholders) and, in the case of a new equity offering by the Company, existing shareholders will be diluted unless they purchase their proportionate share of the equity offering. If adequate capital is not available on economically viable terms and conditions, the Companys business, operating results and financial condition may be materially adversely affected.\nWe will require additional capital to satisfy our commitments in the Ebenberg, LLC joint venture.\nThe joint venture with Movychem, s.r.o., requires Xeriant to fund $2,000,000 by September 30, 2022 or six months from the effective date of the joint venture agreement. Xeriant has a 30-day automatic extension and can pay Movychem a $100,000 fee to extend the Joint Venture Agreement for another 30 days, assuming there are no defaults from Movychem. If Xeriant does not extend the joint venture or otherwise make arrangements with Movychem to extend this provision, Xeriant would risk dissolution of the joint venture by Movychem, which could negatively affect the value of the Company.\nWe will need to meet the obligations required by the Auctus Fund, LLC Senior Secured Note and the Amendment to the Note.\nThe Senior Secured Note and its Amendment have a November 1, 2022 maturity. One of the obligations of the Company is to uplist to a major exchange. If Xeriant does not perform under the Note, the Company could experience substantial dilution if Auctus Fund, LLC converts the note balance owed into common shares.\nNot obtaining sufficient financing will jeopardize our operations and the ability to execute our business plan.\nIn addition to the projected proceeds from this offering, we will continue to attempt to raise additional debt and/or equity financing to fund future operations and to provide additional working capital. However, there is no assurance that such financing will be consummated or obtained in sufficient amounts necessary to meet the Companys needs. If cash resources are insufficient to satisfy the Companys on-going cash requirements, the Company will be required to scale back or discontinue its product development programs or obtain funds if available (although there can be no certainties) through strategic alliances that may require the Company to relinquish rights to its technology, substantially reduce or discontinue its operations entirely. No assurance can be given that any future financing will be available or, if available, that it will be on terms that are satisfactory to the Company. Even if the Company is able to obtain additional financing, it may contain undue restrictions on our operations, in the case of debt financing, or cause substantial dilution for our stockholders, in the case of equity financing. As a result, we can provide no assurance as to whether or if we will ever be profitable. If we are not able to achieve and maintain profitability, the value of our company and our common stock could decline significantly.\nOur recurring operating losses have raised substantial doubt regarding our ability to continue as a going concern.\nOur recurring operating losses raise substantial doubt about our ability to continue as a going concern. This condition is expected to continue for the foreseeable future until we can produce sufficient revenues to cover our costs. as we seek to raise funding and invest in our operations as well as our sales and marketing efforts. Given this financial situation, no assurances can be given that we will be able to raise capital in the future on acceptable terms, or at all. As a result, our independent registered public accounting firm included an explanatory paragraph in its report in our financial statements for the most recent fiscal years with respect to this uncertainty. The perception of our ability to continue as a going concern may make it more difficult for us to obtain financing for the continuation of our operations and could result in the loss of confidence by investors, partners and employees.\nRISKS RELATING TO OUR BUSINESS OPERATIONS AND MANAGEMENT\nThere is no assurance that we or our affiliates will be able to accomplish the design and engineering needed to demonstrate that the technologies that are undertaken, will perform or operate as planned.\nBecause of unanticipated technological hurdles or the inability to assemble a qualified team to address these challenges, we may not be able to meet the technology development and performance objectives that are needed to be competitive in the various targeted markets.\nThe development timeline for the development of certain technologies could expand.\nDue to unexpected challenges, the length of time to develop certain technologies, may become expanded, causing cost overruns and potentially demanding the infusion of large amounts of capital and other financing, which may not be available. Because of the long timeline, there is also uncertainty regarding the uniqueness or advantages of the technologies at the time they are introduced into the market.\nSome technologies are still being developed and specific market applications have not been finalized.\nBecause some of the anticipated technologies will be in an early stage of development, there is no certainty as to which market applications will be prioritized and targeted as well as the associated timelines and costs involved when the Company reaches that point of determination after a technology has been proven. There is no assurance that the required selling price of our technologies will be competitive.\nThe Company will face significant industry competition.\nMost of the targeted technologies will face significant competition from industry leaders or from well-funded entrants in the marketplace. We could face significant competition from companies who have developed or are developing alternative technologies that could render acquired technologies less competitive than planned. Many existing potential competitors are well-established, have or may have longer-standing relationships with customers and potential business partners, have or may have greater name recognition, and have or may have access to substantially greater financial, technical and marketing resources.\nIf we are unable to effectively manage our growth, our ability to implement our business strategy and our operating results will likely be materially adversely affected.\nImplementation of our business plan will likely place a significant strain on our management who must develop administrative, operating and financial infrastructures. To manage our business and planned growth effectively, we must successfully develop, implement, maintain and enhance our financial and accounting systems and controls, identify, hire and integrate new personnel and manage expanded operations. Salary and benefits of additional personnel can be expected to place significant stress on our financial condition, and the availability of such qualified personnel may be limited. There is no assurance that we will be able to manage the operational requirements related to implementing our business strategy\nWe are dependent on key personnel.\nOur success depends on our ability to identify, hire, train and retain highly qualified, specialized and experienced management and technical personnel. In addition, as we enter new areas of technology, we will need to hire additional highly skilled personnel. Competition for personnel with the required knowledge, skill and experience may be significant, and the Company may not be able to attract, assimilate or retain such personnel. The inability to attract and retain the necessary managerial and technical personnel could have a material adverse effect our business, results of operations and financial condition.\nOperations could be adversely affected by interruptions from suppliers of components that are beyond our control.\nOur technology, product development and sales could be adversely affected by interruptions in the supply of necessary components which are sourced from a variety of domestic and international vendors, suppliers and distributors. We are also dependent upon third parties to timely deliver supplies that meet our specifications at competitive prices. Shortages or interruptions in the supply of these items, including raw materials and chemicals could adversely affect the availability, quality and cost of items we sell. If such shortages result in increased cost of our supplies, we and may not be able to pass along all of such increased costs to our customers. Such shortages or disruptions could be caused by transportation issues, inclement weather, natural disasters, increased demand, problems in production or distribution, restrictions on imports or exports, the inability of vendors to obtain credit, political instability in the countries in which suppliers and distributors are located, the financial instability of suppliers and distributors, suppliers or distributors failure to meet our standards, product quality issues, inflation, the price of gasoline, other factors relating to the suppliers and distributors and the countries in which they are located, safety regulations, warnings or advisories or the prospect of such pronouncements, the cancellation of supply or distribution agreements or an inability to renew such arrangements or to find replacements on commercially reasonable terms, or other conditions beyond our control. A shortage or interruption in the availability of certain chemicals, raw materials or supplies could increase costs and limit the availability of products critical to our operations, which in turn could lead to a significant reduction in our revenue.\nChanges in the economy could have a detrimental impact on the Company.\nChanges in the general economic climate could have a detrimental impact on our revenue. It is possible that recessionary pressures and other economic factors (such as declining incomes, future potential rising interest rates, higher unemployment and tax increases) may adversely affect the Company. A worsening economy such as we are currently experiencing due to the Covid-19 pandemic may have a material adverse effect on our financial results and on your investment.\nOur business, results of operations and financial condition may be adversely impacted by the recent COVID-19 or other significant public health conditions.\nThe COVID-19 pandemic negatively affected the U.S. and global economy over the past two years, resulting in significant travel restrictions, including mandated closures and orders to shelter-in-place, and created significant disruption of supply chains and the financial markets. The extent to which our operations may be impacted by the COVID-19 or other public health conditions cannot be accurately predicted, including actions by government authorities to contain an outbreak or treat its impact. We may experience materially adverse impacts to our business due to a number of potential economic conditions. The impact of significant public health conditions may also exacerbate other risks discussed in these risk factors, any of which could have a material effect on us.\nOur success is dependent upon our keeping pace with the advances in technology.\nWe are positioned as a technology company. Some of our initiatives will be dependent on the technology of other companies. Systems and components may be impacted by rapid changes in technology, including the emergence of new industry standards and practices that could require the Company to make modifications to its platform. Our performance will depend, in part, on our ability to continue to enhance our existing technology or develop new technology that addresses the increasingly sophisticated and varied needs of the market, license leading technologies and respond to technological advances and emerging industry standards and practices on a timely and cost-effective basis. The development of our proprietary technology entails significant technical as well as business risks. We may be unsuccessful in using new technologies effectively or adapting its systems or other proprietary technology to the requirements of emerging industry standards. If we are unable to adapt to these changes and demands, our results of operations and financial condition could be materially and adversely affected.\nWe could face liability or disruption from security breaches.\nOur technology and development process involves the storage of critical, secure and proprietary information. Our communications and computer infrastructure is potentially vulnerable to both physical and electronic invasions, such as cyberattacks and security breaches. We may be required to expend significant capital and other resources to defend against and lessen or correct the adverse effects of these invasions. Any such invasion could result in significant damage to the Company. A person who is able to circumvent the security measures employed by the Company could capture proprietary information; alter or destroy the information of the Company; or cause interruptions of the operations of the Company.\nMisappropriation of our intellectual property and proprietary rights could impair our competitive position.\nOur success of will depend to some extent upon our proprietary patented technology. The legal protections available to the Company can afford only limited protection, and these means of protecting the intellectual property of the Company may be inadequate. The Company relies and will continue to rely on patent, trademark, trade secret and copyright laws, confidentiality agreements, employment agreements, work for hire agreements, and technical measures to protect its intellectual property. The Company cannot assure that the steps taken by it will prevent misappropriation of its technology or that the agreements entered into for that purpose will be enforceable. Effective trademark, service mark, copyright and trade secret protection may not be available in every jurisdiction in which the Companys products and services are made available online. The intellectual property of the Company may be subject to even greater risk in foreign jurisdictions, as the laws of many countries do not protect intellectual property to the same extent as the laws of the United States. As part of its confidentiality procedures, the Company generally will enter into agreements with its employees and consultants and limit access to its trade secrets and technology. The Company cannot assure or assume, however, that former employees will not seek to start or enhance other competing products or services to the detriment of the Company, its business, results of operations and financial condition. Nevertheless, management believes that the technical and creative skills of its personnel, continued development of its proprietary systems and technology, as well as brand name recognition and development are more essential in establishing and maintaining a competitive market position.\nDespite efforts to protect its proprietary rights, unauthorized persons may attempt to copy aspects of its products or services or to obtain and use information that the Company regards as proprietary. Policing unauthorized use of its proprietary rights is difficult and requires constant attention. The Company may be required to spend significant resources to monitor and police its intellectual property rights. The Company may not be able to detect infringement and may lose its competitive position in the market before it is able to ascertain any such infringement. In addition, competitors may design around the Companys proprietary technology or develop competing technologies.\nIntellectual property litigation may be necessary in the future to enforce the intellectual property rights of the Company, to protect its trade secrets, to determine the validity and scope of the proprietary rights of others or to defend against claims of infringement by the Company. Other companies, including competitors, may obtain patents or other proprietary rights that would prevent, limit or interfere with the ability of the Company to make, use or sell its products and services. Any such litigation by or against the Company, whether the claims are valid or not, could result in the Company incurring substantial costs and diversion of resources, including the attention of senior management. If the Company is unsuccessful in such legal proceedings, the Company could be subjected to significant damages; be required to license technology that is critical to the operations of the Company, if a license is available at a cost which the Company can pay; or be required to develop replacement technologies at substantial cost to the Company in money and time. Any of these results could materially and adversely affect the business, results of operations and financial condition of the Company.\nThe Company has broad discretion in the use of capital.\nThe Company has broad discretion with respect to the specific application of capital. There can be no assurance that determinations made by the Company relating to the specific allocation of capital will permit the Company to achieve its business objectives.\nMany of the regulations involving Advanced Air Mobility (AAM), including VTOL (Vertical Takeoff and Landing) aircraft and Unmanned Aerial Vehicles (UAV) are still being established\nThe USDOT, FAA (Federal Aviation Administration) and other agencies at the federal, state and local levels are beginning to address some of the numerous certification, regulatory and legal challenges associated with AAM, including VTOL aircraft, UAV and unmanned aerial systems (UAS). A comprehensive set of standards and enforcement procedures for these new transport systems will need to be developed. New aircraft and their operators must undergo rigorous testing and certification, which may require new or modified airworthiness certification standards. These aircraft will also need to comply with existing regulations or be the subject of new regulations to cover their activities. Current regulations govern operating BVLOS (beyond visual line of sight), passenger transport, operating over people and public streets, privacy, transporting commercial cargo across state lines and instrument-based flight. The integration of UAS and UAM into the National Airspace System and air traffic management is a critical factor, requiring a remote identification process for these aircraft. The FAAs Unmanned Aircraft System Integration Pilot Program (IPP) will provide certification necessary to operate UAVs for certain applications. It is uncertain how new or changed laws and regulations will affect the introduction of new aerial platforms into the marketplace. The time and costs involved in obtaining these certifications and regulatory compliance may adversely impact the development process.\nWe do not intend to pay cash dividends on our common stock in the foreseeable future.\nWe currently anticipate that we will retain all future earnings, if any, to finance the growth and development of our business and do not anticipate paying cash dividends on our common stock in the foreseeable future. Any payment of cash dividends will depend upon our financial condition, capital requirements, earnings and other factors deemed relevant by our board of directors.\nOur stock may be subject to certain risks associated with low-priced stocks.\nOur common stock is expected to continue to trade on the over-the-counter (OTC) market in the near future. The Company is a development stage company with no present revenues, so the trading price of our common stock may remain below $5.00. So long as our common stock trades below $5.00 per share, the stock will be treated as a penny stock. Broker-dealers who sell penny stocks to their established customers must deliver a disclosure schedule explaining the penny stock market and the risks associated with investing in penny stocks prior to any transaction. Additional restrictions apply to broker-dealers who sell penny stocks to persons other than established customers and accredited investors (generally defined as an investor with a net worth in excess of $1,000,000 or annual income exceeding $200,000 individually or $300,000 together with a spouse). For these types of transactions, the broker-dealer must make a special suitability determination for the purchaser and have received the purchasers written consent to the transaction prior to the sale. The broker-dealer also must disclose the commissions payable to the broker-dealer, current bid and offer quotations for the penny stock and, if the broker-dealer is the sole market-maker, the broker-dealer must disclose this fact and the broker-dealers presumed control over the market. Such information must be provided by the broker-dealer to the customer orally or in writing before or with the written confirmation of trade sent to the customer. Monthly statements must be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks. Broker-dealers may be discouraged from dealing with our common stock if they have to bear these additional burdens, which could severely limit the market liquidity of the common stock and the ability of our stockholders to sell their shares.\nLitigation may adversely affect our business, financial condition, and results of operations.\nFrom time to time in the normal course of our business operations, we may become subject to litigation that may result in liability material to our financial statements as a whole or may negatively affect our operating results if changes to our business operations are required. The cost to defend such litigation may be significant and may require a diversion of our resources. There also may be adverse publicity associated with litigation that could negatively affect customer perception of our business, regardless of whether the allegations are valid or whether we are ultimately found liable. Insurance may not be available at all or in sufficient amounts to cover any liabilities with respect to these or other matters. A judgment or other liability in excess of our insurance coverage for any claims could adversely affect our business and the results of our operations.\nOur insurance coverage may be inadequate to cover all significant risk exposures.\nWhile we intend to maintain insurance for certain risks, the amount of our insurance coverage may not be adequate to cover all claims or liabilities, and we may be forced to bear substantial costs resulting from risks and uncertainties of our business. It is also not possible to obtain insurance to protect against all operational risks and liabilities. The failure to obtain adequate insurance coverage on terms favorable to us, or at all, could have a material adverse effect on our business, financial condition, and results of operations. We do not have any business interruption insurance. Any business disruption could result in substantial costs and diversion from the Company executing its business plan.\nRISKS RELATED TO OUR DEPENDENCE ON THIRD PARTIES\nWe may fail to retain or recruit necessary personnel, and we may be unable to secure the services of consultants.\nAs of the date of this filing, most of our management team of five people is currently paid as consultants or independent contractors. Keith Duffy, CEO, has an Employment Agreement, but is also paid as a contractor through his entity, Ancient Investments, LLC. We also have engaged and plan to continue to engage outside consultants called Senior Advisors to advise us and have been and will be required to retain additional consultants and employees. Our future performance will depend in part on our ability to successfully integrate newly hired officers into our management team and our ability to develop an effective working relationship among senior management.\nCertain of our directors, officers, advisors, and consultants serve as officers, directors, advisors, or consultants of other companies that might be developing competitive products. Other than corporate opportunities, none of our directors are obligated under any agreement or understanding with us to make any additional products or technologies available to us. Similarly, we can give no assurances, and we do not expect, and stockholders should not expect, that any product or technology identified by any of our directors or affiliates in the future would be made available to us other than corporate opportunities. We can give no assurances that any such other companies will not have interests that are in conflict with its interests.\nLosing key personnel or failing to recruit necessary additional personnel would impede our ability to attain our development objectives. There is intense competition for qualified personnel in the technology field, and we may not be able to attract and retain the qualified personnel we need to develop our business.\nWe rely on independent organizations, advisors and consultants to perform certain services for us, including handling substantially all aspects of regulatory approval, manufacturing, marketing, and sales. We expect that this will continue to be the case. Such services may not always be available to us on a timely basis.\nWe may be subject to claims that our consultants or independent contractors have wrongfully used or disclosed alleged trade secrets of their other clients or former employers to us.\nAs is common in the technology industry, we engage the services of consultants to assist in the development of our products. Many of these consultants were previously employed at or may have previously been or are currently providing consulting services to, other technology companies, including our competitors or potential competitors. We may become subject to claims that we or our consultants have inadvertently or otherwise used or disclosed trade secrets or other proprietary information of our former employers or their former or current customers. Litigation may be necessary to defend against these claims. Even if we are successful in defending against these claims, litigation could result in substantial costs and be a distraction to management.\nRISKS RELATED TO OUR INTELLECTUAL PROPERTY\nWe rely on patents and patent applications and various regulatory exclusivities to protect some of our product candidates, and our ability to compete may be limited or eliminated if we are not able to protect our products.\nThe patent positions of companies such as ours are uncertain and involve complex legal and factual questions. We may incur significant expenses in protecting our intellectual property and defending or assessing claims with respect to intellectual property owned by others. Any patent or other infringement litigation by or against us could cause us to incur significant expenses and divert the attention of our management.\nOthers may file patent applications or obtain patents on similar technologies that compete with our products or those of our joint ventures. We cannot predict how broad the claims in any such patents or applications will be and whether they will be allowed. Once claims have been issued, we cannot predict how they will be construed or enforced. We and/or our joint ventures may infringe upon intellectual property rights of others without being aware of it. If another party claims we are infringing their technology, we could have to defend an expensive and time-consuming lawsuit, pay a large sum if we are found to be infringing, or be prohibited from selling or licensing our products unless we obtain a license or redesign our products, which may not be possible.\nWe and/or our joint ventures also rely on trade secrets and proprietary know-how to develop and maintain our or our joint ventures competitive position. Some of our current or former employees, consultants, scientific advisors, contractors, current or prospective corporate collaborators, may unintentionally or willfully disclose our confidential information to competitors or use our proprietary technology for their own benefits. Furthermore, enforcing a claim alleging the infringement of our trade secrets would be expensive and difficult to prove, making the outcome uncertain. Our competitors may also independently develop similar knowledge, methods, and know-how or gain access to our proprietary information through some other means.\nWe may incur substantial costs as a result of litigation or other proceedings relating to patent and other intellectual property rights, as well as costs associated with lawsuits.\nIf any other person filed patent applications, or is issued patents, claiming technology also claimed by us, we may be required to participate in interference or derivation proceedings in the U.S. Patent and Trademark Office to determine priority and/or ownership of the invention. Our licensors or we may also need to participate in interference proceedings involving issued patents and pending applications of another entity.\nThe intellectual property environment in our industry is particularly complex, constantly evolving and highly fragmented. Other companies and institutions have issued patents and have filed or will file patent applications that may issue into patents that cover or attempt to cover products, processes or technologies similar to us. We have not conducted freedom-to-use patent searches on all aspects of our product candidates or potential product candidates and may be unaware of relevant patents and patent applications of third parties. In addition, the freedom-to-use patent searches that have been conducted may not have identified all relevant issued patents or pending patent applications. We cannot provide assurance that our proposed products in this area will not ultimately be held to infringe one or more valid claims owned by third parties which may exist or come to exist in the future or that in such case we will be able to obtain a license from such parties on acceptable terms.\nWe cannot guarantee that our technologies will not conflict with the rights of others. In some foreign jurisdictions, we could become involved in opposition proceedings, either by opposing the validity of others foreign patents or by persons opposing the validity of our foreign patents.\nWe may also face frivolous litigation or lawsuits from various competitors or from litigious securities attorneys. The cost of any litigation or other proceeding relating to these areas, even if deemed frivolous or resolved in our favor, could be substantial and could distract management from its business. Uncertainties resulting from initiation and continuation of any litigation could have a material adverse effect on our ability to continue our operations.\nIf we infringe the rights of others, we could be prevented from selling products or forced to pay damages.\nIf our products, methods, processes, and other technologies are found to infringe the rights of other parties, we could be required to pay damages, or may be required to cease using the technology or to license rights from the prevailing party. Any prevailing party may be unwilling to offer us a license on commercially acceptable terms.\nWe cannot be certain we will be able to obtain patent protection to protect our product candidates and technology.\nWe cannot be certain that all patents applied for will be issued. If a third party has also filed a patent application relating to an invention claimed by us or one or more of our licensors, we may be required to participate in an interference or derivation proceeding declared or instituted by the United States Patent and Trademark Office, which could result in substantial uncertainties and cost for us, even if the eventual outcome is favorable to us. The degree of future patent protection for our product candidates and technology is uncertain. For example:\n·\nwe or our licensors might not have been the first to make the inventions covered by our issued patents, or pending or future patent applications;\n·\nwe or our licensors might not have been the first to file patent applications for the inventions;\n·\nothers may independently develop duplicative, similar or alternative technologies;\n·\nit is possible that our patent applications will not result in an issued patent or patents, or that the scope of protection granted by any patents arising from our patent applications will be significantly narrower than expected;\n·\nany patents under which we hold ultimate rights may not provide us with a basis for commercially-viable products, may not provide us with any competitive advantages or may be challenged by third parties as not infringed, invalid, or unenforceable under United States or foreign laws;\n·\nany patent issued to us in the future or under which we hold rights may not be valid or enforceable; or\n·\nwe may develop additional technologies that are not patentable and which may not be adequately protected through trade secrets; for example, if a competitor independently develops duplicative, similar, or alternative technologies.\nIf we fail to comply with our obligations in the agreements under which we or our joint venture partners may license intellectual property rights from third parties or otherwise experience disruptions to our business relationships with our licensors, we could lose rights that are important to our business.\nWe have entered and may be required to enter into agreements that are important to our business, including our joint venture agreements with XTI Aircraft Company and Movychem s.r.o. These agreements have imposed various diligence, milestone payment, royalty and other obligations on us. For example, if we enter into exclusive agreements with various third parties (for example, universities and research institutions), we may be required to use commercially reasonable efforts to engage in various development and commercialization activities with respect to licensed products and may need to satisfy specified milestones and royalty payment obligations. If we fail to comply with any obligations under our agreements with any of these licensors, we may be subject to termination of the license agreements in whole or in part; increased financial obligations to our licensors or loss of exclusivity in a particular field or territory, in which case our ability to develop or commercialize products covered by the license agreements will be impaired.\nIn addition, disputes may arise regarding intellectual property subject to a license agreement, including:\n·\nthe scope of rights granted under the license agreement and other interpretation-related issues;\n·\nthe extent to which our technology, products, methods and processes infringe on intellectual property of the licensor that is not subject to the licensing agreement;\n·\nour diligence obligations under the license agreement and what activities satisfy those obligations;\n·\nif a third party expresses interest in an area under a license that we are not pursuing, under the certain terms of our license agreement, we may be required to sublicense rights in that area to the third party, and that sublicense could harm our business; and\n·\nthe ownership of inventions and know-how resulting from the joint creation or use of intellectual property by our licensors and us.\nIf disputes over the intellectual property that we have licensed prevent or impair our ability to maintain our current licensing arrangements on acceptable terms, we may be unable to successfully develop and commercialize the affected product candidates.\nWe may need to obtain licenses from third parties to advance our research to allow commercialization of our product candidates. We may fail to obtain any of these licenses at a reasonable cost or on reasonable terms, if at all. In that event, we would be unable to further develop and commercialize one or more of our product candidates, which could harm our business significantly.\nWe may infringe the intellectual property rights of others, which may prevent or delay our product development efforts and stop us from commercializing or increase the costs of commercializing our product candidates.\nOur success will depend in part on our ability to operate without infringing the proprietary rights of third parties. We cannot guarantee that our products or product candidates, or manufacture or use of our products or product candidates, will not infringe third-party patents. Furthermore, a third party may claim that we are using inventions covered by the third partys patent rights and may go to court to stop us from engaging in our normal operations and activities, including making or selling our product candidates or products. These lawsuits are costly and could affect our results of operations and divert the attention of managerial and scientific personnel. Some of these third parties may be better capitalized and have more resources than us. There is a risk that a court would decide that we are infringing the third partys patents and would order us to stop the activities covered by the patents. In that event, we may not have a viable way to get around the patent and may need to halt commercialization of the relevant product candidate(s) or product(s). In addition, there is a risk that a court will order us to pay the other party damages for having violated the other partys patents. In addition, we may be obligated to indemnify our licensors and collaborators against certain intellectual property infringement claims brought by third parties, which could require us to expend additional resources. The aerospace and technology industries have produced a proliferation of patents, and it is not always clear to industry participants, including us, which patents cover various types of products or methods. The coverage of patents is subject to interpretation by the courts, and the interpretation is not always uniform.\nIf we are sued for patent infringement, we would need to demonstrate that our products or methods either do not infringe the claims of the relevant patent or that the patent claims are invalid or unenforceable, and we may not be able to do this. Proving invalidity is difficult. For example, in the United States, proving invalidity requires a showing of clear and convincing evidence to overcome the presumption of validity enjoyed by issued patents. Even if we are successful in these proceedings, we may incur substantial costs and divert managements time and attention in pursuing these proceedings, which could have a material adverse effect on us. If we are unable to avoid infringing the patent rights of others, we may be required to seek a license, which may not be available, and then we will have to defend an infringement action or challenge the validity of the patent in court. Patent litigation is costly and time consuming. We may not have sufficient resources to bring these actions to a successful conclusion. In addition, if we do not obtain a license, fail to develop or obtain non-infringing technology, fail to defend an infringement action successfully or have infringed patents declared invalid or unenforceable, we may incur substantial monetary damages, encounter significant delays in bringing our product candidates to market and be precluded from manufacturing or selling our product candidates.\nWe cannot be certain that others have not filed patent applications for technology covered by our pending applications, or that we were the first to invent the technology, because:\n·\nsome patent applications in the United States may be maintained in secrecy until the patents are issued;\n·\npatent applications in the United States are typically not published until 18 months after the priority date; and\n·\npublications in the scientific literature often lag behind actual discoveries.\nOur competitors may have filed, and may in the future file, patent applications covering technology similar to ours. Any such patent applications may have priority over our patent applications, which could further require us to obtain rights to issued patents covering such technologies. If another party has filed US patent applications on inventions similar to ours that claims priority to any applications filed prior to the priority dates of our applications, we may have to participate in an interference proceeding declared or a derivation proceed instituted by the USPTO to determine priority of invention in the United States. The costs of these proceedings could be substantial, and it is possible that such efforts would be unsuccessful if, unbeknownst to us, the other party had independently arrived at the same or similar inventions prior to our own inventions, resulting in a loss of our U.S. patent position with respect to such inventions. Other countries have similar laws that permit secrecy of patent applications, and thus the third partys patent or patent application may be entitled to priority over our applications in such jurisdictions.\nSome of our competitors may be able to sustain the costs of complex patent litigation more effectively than we can because they have substantially greater resources. In addition, any uncertainties resulting from the initiation and continuation of any litigation could have a material adverse effect on our ability to raise the funds necessary to continue our operations.\nWe may be subject to claims that our employees, consultants or independent contractors have wrongfully used or disclosed alleged trade secrets.\nAs is common in the aerospace and technology industries, we may employ individuals who were previously employed at aerospace and technology companies, including our competitors or potential competitors. Although we try to ensure that our employees, consultants and independent contractors do not use the proprietary information or know-how of others in their work for us, we may be subject to claims that we or our employees, consultants or independent contractors have inadvertently or otherwise used or disclosed trade secrets or other proprietary information of their former employers. Litigation may be necessary to defend against these claims. If we fail in defending any such claims, in addition to paying monetary damages, we could lose valuable intellectual property rights or personnel, which could adversely impact our business. Even if we are successful in defending against these claims, litigation could result in substantial costs and be a distraction to management.\nOur intellectual property may not be sufficient to protect our products from competition, which may negatively affect our business as well as limit our partnership or acquisition appeal.\nWe may be subject to competition despite the existence of intellectual property we license, or we or our joint ventures own. We can give no assurances that our intellectual property will be sufficient to prevent third parties from designing around the patents we own or license and developing and commercializing competitive products. The existence of competitive products that avoid our intellectual property could materially adversely affect our operating results and financial condition. Furthermore, limitations, or perceived limitations, in our intellectual property may limit the interest of third parties to partner, collaborate or otherwise transact with us, if third parties perceive a higher than acceptable risk to commercialization of our products or future products.\nOur approach involves filing patent applications covering new methods of use and/or new formulations of previously known, studied and/or marketed devices. Although the protection afforded by patents issued from our patent applications may be significant, when looking at our patents ability to block competition, the protection offered by our patents may be, to some extent, more limited than the protection provided by patents claiming the composition of matter previously unknown. If a competitor were able to successfully design around any method of use and formulation patents we may have in the future, our business and competitive advantage could be significantly affected.\nWe may elect to sue a third party, or otherwise make a claim, alleging infringement or other violation of patents, trademarks, trade dress, copyrights, trade secrets, domain names or other intellectual property rights that we either own or license. If we do not prevail in enforcing our intellectual property rights in this type of litigation, we may be subject to:\n·\npaying monetary damages related to the legal expenses of the third party;\n·\nfacing additional competition that may have a significant adverse effect on our product pricing, market share, business operations, financial condition, and the commercial viability of our products; and\n·\nrestructuring our company or delaying or terminating select business opportunities, including, but not limited to, research and development, , and commercialization activities, due to a potential deterioration of our financial condition or market competitiveness.\nA third party may also challenge the validity, enforceability or scope of the intellectual property rights that we license or own; and, the result of these challenges may narrow the claim scope of or invalidate patents that are integral to our product candidates in the future. There can be no assurance that we will be able to successfully defend patents we own or licensed in an action against third parties due to the unpredictability of litigation and the high costs associated with intellectual property litigation, amongst other factors.\nThe laws of some jurisdictions do not protect intellectual property rights to the same extent as the laws or rules and regulations in the United States and Europe, and many companies have encountered significant difficulties in protecting and defending such rights in such jurisdictions. The legal systems of certain countries, particularly certain developing countries, do not favor the enforcement of patents, trade secrets and other intellectual property protection, which could make it difficult for us to stop the infringement of our patents or marketing of competing products in violation of our proprietary rights generally. Proceedings to enforce our patent rights in other jurisdictions, whether or not successful, could result in substantial costs and divert our efforts and attention from other aspects of our business, could put our patents at risk of being invalidated, rendered unenforceable or interpreted narrowly and our patent applications at risk of not issuing, and could provoke third parties to assert claims against us. We may not prevail in any lawsuits that we initiate, and the damages or other remedies awarded, if any, may not be commercially meaningful. Accordingly, our efforts to enforce our intellectual property rights around the world may be inadequate to obtain a significant commercial advantage from the intellectual property that we develop or license. Furthermore, while we intend to protect our intellectual property rights in our expected significant markets, we cannot ensure that we will be able to initiate or maintain similar efforts in all jurisdictions in which we may wish to market our products or product candidates. Accordingly, our efforts to protect our intellectual property rights in such countries may be inadequate, which may have an adverse effect on our ability to successfully commercialize our product candidates in all of our expected significant foreign markets. If we or our licensors encounter difficulties in protecting, or are otherwise precluded from effectively protecting, the intellectual property rights important for our business in such jurisdictions, the value of these rights may be diminished, and we may face additional competition from others in those jurisdictions.\nChanges to patent law, for example the Leahy-Smith America Invests Act, AIA or Leahy-Smith Act, of 2011 and the Patent Reform Act of 2009 and other future article of legislation in the U.S., may substantially change the regulations and procedures surrounding patent applications, issuance of patents, prosecution of patents, challenges to patent validity, and patent enforcement. We can give no assurances that our patents and those of our licensor(s) can be defended or will protect us against future intellectual property challenges, particularly as they pertain to changes in patent law and future patent law interpretations.\nIn addition, enforcing and maintaining our intellectual property protection depends on compliance with various procedural, document submission, fee payment and other requirements imposed by the U.S. Patent and Trademark Office and courts, and foreign government patent agencies and courts, and our patent protection could be reduced or eliminated for non-compliance with these requirements.\nIf we are not able to protect and control our unpatented trade secrets, know-how and other technological innovation, we may suffer competitive harm.\nWe also rely on proprietary trade secrets and unpatented know-how to protect our research and development activities, particularly when we do not believe that patent protection is appropriate or available. However, trade secrets are difficult to protect. We will attempt to protect our trade secrets and unpatented know-how by requiring our employees, consultants, collaborators, and advisors to execute a confidentiality and non-use agreement. We cannot guarantee that these agreements will provide meaningful protection, that these agreements will not be breached, that we will have an adequate remedy for any such breach, or that our trade secrets will not otherwise become known or independently developed by a third party. Our trade secrets, and those of our present or future collaborators that we utilize by agreement, may become known or may be independently discovered by others, which could adversely affect the competitive position of our product candidates.\nWe may incur substantial costs enforcing our patents, defending against third-party patents, invalidating third-party patents or licensing third-party intellectual property, as a result of litigation or other proceedings relating to patent and other intellectual property rights.\nWe may be unaware of or unfamiliar with prior art and/or interpretations of prior art that could potentially impact the validity or scope of our patents, pending patent applications, or patent applications that we will file. We may have elected, or elect now or in the future, not to maintain or pursue intellectual property rights that, at some point in time, may be considered relevant to or enforceable against a competitor.\nWe take efforts and enter into agreements with employees, consultants, collaborators, and advisors to confirm ownership and chain of title in intellectual property rights. However, an inventorship or ownership dispute could arise that may permit one or more third parties to practice or enforce our intellectual property rights, including possible efforts to enforce rights against us.\nWe may not have rights under some patents or patent applications that may cover technologies that we use in our research, product candidates and particular uses thereof that we seek to develop and commercialize, as well as synthesis of our product candidates. Third parties may own or control these patents and patent applications in the United States and elsewhere. These third parties could bring claims against us or our collaborators that would cause us to incur substantial expenses and, if successful against us, could cause us to pay substantial damages. Further, if a patent infringement suit were brought against us or our collaborators, we or they could be forced to stop or delay research, development, manufacturing or sales of the product or product candidate that is the subject of the suit. We or our collaborators therefore may choose to seek, or be required to seek, a license from the third-party and would most likely be required to pay license fees or royalties or both. These licenses may not be available on acceptable terms, or at all. Even if we or our collaborators were able to obtain a license, the rights may be nonexclusive, which would give our competitors access to the same intellectual property. Ultimately, we could be prevented from commercializing a product or product candidate or forced to cease some aspect of our business operations, as a result of patent infringement claims, which could harm our business.\nThere has been substantial litigation and other legal proceedings regarding patent and other intellectual property rights in the broad technology industry. Although we are not currently a party to any patent litigation or any other adversarial proceeding, including any interference or derivation proceeding declared or instituted before the United States Patent and Trademark Office, regarding intellectual property rights with respect to our products, product candidates and technology, it is possible that we may become so in the future. We are not currently aware of any actual or potential third-party infringement claim involving our product candidates. The cost to us of any patent litigation or other proceeding, even if resolved in our favor, could be substantial. The outcome of patent litigation is subject to uncertainties that cannot be adequately quantified in advance, including the demeanor and credibility of witnesses and the identity of the adverse party, especially in the aerospace and technology related patent cases that may turn on the testimony of experts as to technical facts upon which experts may reasonably disagree. Some of our competitors may be able to sustain the costs of such litigation or proceedings more effectively than we can because of their substantially greater financial resources. If a patent or other proceeding is resolved against us, we may be enjoined from researching, developing, manufacturing or commercializing our products or product candidates without a license from the other party and we may be held liable for significant damages. We may not be able to obtain any required license on commercially acceptable terms or at all.\nUncertainties resulting from the initiation and continuation of patent litigation or other proceedings could harm our ability to compete in the marketplace. Patent litigation and other proceedings may also absorb significant management time.\nIf we are unable to protect our intellectual property rights, our competitors may develop and market products with similar features that may reduce demand for our potential products.\nThe following factors are important to our success:\n·\nreceiving patent protection for our product candidates;\n·\npreventing others from infringing our intellectual property rights; and\n·\nmaintaining our patent rights and trade secrets.\nWe will be able to protect our intellectual property rights in patents and trade secrets from unauthorized use by third parties only to the extent that such intellectual property rights are covered by valid and enforceable patents or are effectively maintained as trade secrets.\nBecause issues of patentability involve complex legal and factual questions, the issuance, scope and enforceability of patents cannot be predicted with certainty. Patents may be challenged, invalidated, found unenforceable, or circumvented. United States patents and patent applications may be subject to interference and derivation proceedings, United States patents may also be subject to post grant proceedings, including re-examination, derivation, Inter Partes Review and Post Grant Review, in the United States Patent and Trademark Office and foreign patents may be subject to opposition or comparable proceedings in corresponding foreign patent offices, which could result in either loss of the patent or denial of the patent application or loss or reduction in the scope of one or more of the claims of the patent or patent application. In addition, such interference, derivation, post grant and opposition proceedings may be costly. Thus, any patents that we own or license from others may not provide any protection against competitors. Furthermore, an adverse decision in an interference or derivation proceeding can result in a third-party receiving the patent rights sought by us, which in turn could affect our ability to market a potential product to which that patent filing was directed. Our pending patent applications, those that we may file in the future, or those that we may license from third parties may not result in patents being issued. If issued, they may not provide us with proprietary protection or competitive advantages against competitors with similar technology. Furthermore, others may independently develop similar technologies or duplicate any technology that we have developed. Many countries, including certain countries in Europe, have compulsory licensing laws under which a patent owner may be compelled to grant licenses to third parties. For example, compulsory licenses may be required in cases where the patent owner has failed to work the invention in that country, or the third-party has patented improvements. In addition, many countries limit the enforceability of patents against government agencies or government contractors. In these countries, the patent owner may have limited remedies, which could materially diminish the value of our patents. Moreover, the legal systems of certain countries, particularly certain developing countries, do not favor the enforcement of patents and other intellectual property protection, which makes it difficult to stop infringement.\nIn addition, our ability to enforce our patent rights depends on our ability to detect infringement. It is difficult to detect infringers who do not advertise or otherwise promote the compositions that are used in their products. Any litigation to enforce or defend our patent rights, even if we prevail, could be costly and time-consuming and would divert the attention of management and key personnel from business operations.\nWe will also rely on trade secrets, know-how and technology, which are not protected by patents, to maintain our competitive position. We will seek to protect this information by entering into confidentiality agreements with parties that have access to it, such as strategic partners, collaborators, employees, contractors and consultants. Any of these parties may breach these agreements and disclose our confidential information or our competitors might learn of the information in some other way. If any trade secret, know-how or other technology not protected by a patent were disclosed to, or independently developed by, a competitor, our business, financial condition and results of operations could be materially adversely affected.\nRISKS RELATED TO OWNING OUR COMMON STOCK\nIf we are unable to establish appropriate internal financial reporting controls and procedures, it could cause us to fail to meet our reporting obligations, result in the restatement of our financial statements, harm our operating results, subject us to regulatory scrutiny and sanction, cause investors to lose confidence in our reported financial information and have a negative effect on the market price for shares of our Common Stock.\nEffective internal controls are necessary for us to provide reliable financial reports and to effectively prevent fraud. We maintain a system of internal control over financial reporting, which is defined as a process designed by, or under the supervision of, our principal executive officer and principal financial officer, or persons performing similar functions, and effected by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nAs a public company, we have significant additional requirements for enhanced financial reporting and internal controls. We are required to document and test our internal control procedures in order to satisfy the requirements of Section 404 of the Sarbanes-Oxley Act of 2002, which requires annual management assessments of the effectiveness of our internal controls over financial reporting. The process of designing and implementing effective internal controls is a continuous effort that requires us to anticipate and react to changes in our business and the economic and regulatory environments and to expend significant resources to maintain a system of internal controls that is adequate to satisfy our reporting obligations as a public company.\nWe cannot assure you that we will, in the future, identify areas requiring improvement in our internal control over financial reporting. We cannot assure you that the measures we will take to remediate any areas in need of improvement will be successful or that we will implement and maintain adequate controls over our financial processes and reporting in the future as we continue our growth. If we are unable to establish appropriate internal financial reporting controls and procedures, it could cause us to fail to meet our reporting obligations, result in the restatement of our financial statements, harm our operating results, subject us to regulatory scrutiny and sanction, cause investors to lose confidence in our reported financial information and have a negative effect on the market price for shares of our Common Stock.\nThe market price of our Common Stock may be volatile.\nThe market price of our Common Stock may be highly volatile. Some of the factors that may materially affect the market price of our Common Stock are beyond our control, such as changes in financial estimates by industry and securities analysts, conditions or trends in the industry in which we operate or sales of our Common Stock, as well as other factors, such as investor perceptions of the prospects for the advanced materials and technology industry. These factors may materially adversely affect the market price of our Common Stock, regardless of our performance. In addition, public stock markets have experienced extreme price and trading volume volatility. This volatility has significantly affected the market prices of securities of many companies for reasons frequently unrelated to the operating performance of the specific companies. These broad market fluctuations may adversely affect the market price of our Common Stock.\nOur directors and executive officers can exert significant control over our business and affairs and have actual or potential interests that may depart from those of investors in the subsequent financings.\nThe interests of our directors and officers may differ from the interests of our other stockholders, including purchasers of our securities, in future financings. As a result, based on their board seats and offices, such persons will have significant influence over and control all corporate actions requiring stockholder approval, irrespective of how the Companys other stockholders, may vote, including the following actions:\n·\nto elect or defeat the election of our directors;\n·\nto amend or prevent amendment of our Amended and Restated Certificate of Incorporation or By-laws;\n·\nto effect or prevent a merger, sale of assets or other corporate transaction; and\n·\nto control the outcome of any other matter submitted to our stockholders for vote.\nThis concentration of ownership by itself may have the effect of impeding a merger, consolidation, takeover or other business consolidation, or discouraging a potential acquirer from making a tender offer for the Common Stock which in turn could reduce our stock price or prevent our stockholders from realizing a premium over our stock price.\nWe may issue more shares in a future financing or pursuant to existing agreements which will result in substantial dilution.\nOur Amended and Restated Certificate of Incorporation authorizes the issuance of a maximum of 5,000,000,000 shares of Common Stock and a maximum of 100,000,000 shares of Preferred Stock. Any future merger or acquisition effected by us would result in the issuance of additional securities without stockholder approval and the substantial dilution in the percentage of our Common Stock held by our then existing stockholders. Moreover, the Common Stock issued in any such merger or acquisition transaction may be valued on an arbitrary or non-arms-length basis by our management, resulting in an additional reduction in the percentage of Common Stock held by our then existing stockholders. Additionally, we expect to seek additional financing in order to provide working capital to the operating business. Our Board of Directors has the power to issue any or all of such authorized but unissued shares without stockholder approval. To the extent that additional shares of Common Stock or Preferred Stock are issued in connection with and following a business combination or otherwise, dilution to the interests of our stockholders will occur and the rights of the holders of Common Stock might be materially and adversely affected.\nOur Board of Directors is authorized to issue Preferred Stock without obtaining shareholder approval.\nOur Amended and Restated Certificate of Incorporation authorizes the issuance of up to 100,000,000 shares of Preferred Stock with designations, rights and preferences determined from time to time by the Board of Directors. Accordingly, our Board of Directors is empowered, without stockholder approval, to issue Preferred Stock with dividend, liquidation, conversion, voting, or other rights which could adversely affect the voting power or other rights of the holders of the Common Stock. In the event of issuance, the Preferred Stock could be utilized, under certain circumstances, as a method of discouraging, delaying or preventing a change in control of the Company. Although we have no present intention to issue any shares of Preferred Stock, there can be no assurance that the Company will not do so in the future.\nMarket and economic conditions may negatively impact our business, financial condition and share price.\nConcerns over medical epidemics, energy costs, geopolitical issues, the U.S. mortgage market and a deteriorating real estate market, unstable global credit markets and financial conditions, and volatile oil prices have led to periods of significant economic instability, diminished liquidity and credit availability, declines in consumer confidence and discretionary spending, diminished expectations for the global economy and expectations of slower global economic growth, increased unemployment rates, and increased credit defaults in recent years. Our general business strategy may be adversely affected by any such economic downturns (such as the recent downturn related to the COVID-19 pandemic), volatile business environments and continued unstable or unpredictable economic, market, and geopolitical conditions, such as the current situation in the Ukraine. If these conditions continue to deteriorate or do not improve, it may make any necessary debt or equity financing more difficult to complete, more costly, and more dilutive. Failure to secure any necessary financing in a timely manner and on favorable terms could have a material adverse effect on our growth strategy, financial performance, and share price and could require us to delay or abandon development or commercialization plans.\nFuture sales and issuances of our common stock could result in additional dilution of the percentage ownership of our stockholders and could cause our share price to fall.\nWe expect that significant additional capital will be needed in the future to continue our planned operations, including increased marketing, hiring new personnel, commercializing our product, and continuing activities as an operating public company. To the extent we raise additional capital by issuing equity securities, our stockholders may experience substantial dilution. We may sell common stock, convertible securities or other equity securities in one or more transactions at prices and in a manner, we determine from time to time. If we sell common stock, convertible securities or other equity securities in more than one transaction, investors may be materially diluted by subsequent sales. Such sales may also result in material dilution to our existing stockholders, and new investors could gain rights superior to our existing stockholders.\nWe do not intend to pay cash dividends on our shares of common stock so any returns will be limited to the value of our shares.\nWe currently anticipate that we will retain future earnings for the development, operation and expansion of our business and do not anticipate declaring or paying any cash dividends for the foreseeable future. Any return to stockholders will therefore be limited to the increase, if any, of our share price.\nOur Amended and Restated Certificate of Incorporation and our Amended and Restated Bylaws, and Nevada law may have anti-takeover effects that could discourage, delay or prevent a change in control, which may cause our stock price to decline.\nOur Amended and Restated Certificate of Incorporation and our Amended and Restated Bylaws, and Nevada law could make it more difficult for a third party to acquire us, even if closing such a transaction would be beneficial to our stockholders. We are authorized to issue up to 100,000,000 shares of preferred stock. This preferred stock may be issued in one or more series, the terms of which may be determined at the time of issuance by our Board of Directors without further action by stockholders. The terms of any series of preferred stock may include voting rights (including the right to vote as a series on particular matters), preferences as to dividend, liquidation, conversion and redemption rights and sinking fund provisions. The issuance of any preferred stock could materially adversely affect the rights of the holders of our common stock, and therefore, reduce the value of our common stock. In particular, specific rights granted to future holders of preferred stock could be used to restrict our ability to merge with, or sell our assets to, a third party and thereby preserve control by the present management.\nProvisions of our Certificate of Incorporation and our Amended and Restated Bylaws and Nevada law also could have the effect of discouraging potential acquisition proposals or making a tender offer or delaying or preventing a change in control, including changes a stockholder might consider favorable. Such provisions may also prevent or frustrate attempts by our stockholders to replace or remove our management. In particular, the certificate of incorporation and bylaws and Nevada law, as applicable, among other things:\n·\nprovide the board of directors with the ability to alter the bylaws without stockholder approval;\n·\nplace limitations on the removal of directors;\n·\nestablishing advance notice requirements for nominations for election to the board of directors or for proposing matters that can be acted upon at stockholder meetings; and\n·\nprovide that vacancies on the board of directors may be filled by a majority of directors in office, although less than a quorum.\nFinancial reporting obligations of being a public company in the U.S. are expensive and time-consuming, and our management will be required to devote substantial time to compliance matters.\nAs a publicly traded company we incur significant additional legal, accounting and other expenses. The obligations of being a public company in the U.S. require significant expenditures and will place significant demands on our management and other personnel, including costs resulting from public company reporting obligations under the Exchange Act and the rules and regulations regarding corporate governance practices, including those under the Sarbanes-Oxley Act, the Dodd-Frank Wall Street Reform and Consumer Protection Act, and the listing requirements of the stock exchange on which our securities are listed. These rules require the establishment and maintenance of effective disclosure and financial controls and procedures, internal control over financial reporting and changes in corporate governance practices, among many other complex rules that are often difficult to implement, monitor and maintain compliance with. Moreover, despite recent reforms made possible by the JOBS Act, the reporting requirements, rules, and regulations will make some activities more time-consuming and costly, particularly after we are no longer an emerging growth company. In addition, we expect these rules and regulations to make it more difficult and more expensive for us to obtain director and officer liability insurance. Our management and other personnel will need to devote a substantial amount of time to ensure that we comply with all of these requirements and to keep pace with new regulations, otherwise we may fall out of compliance and risk becoming subject to litigation or being delisted, among other potential problems.\nThere will be a substantial number of common shares eligible for future sale from the conversion of Series A Preferred shares.\nThere were 780,132 shares of our Series A Preferred Stock outstanding as of June 30, 2022. Each preferred share is convertible into 1,000 common shares. Once converted, these shares are eligible for resale under Rule 144. The sale, or availability for sale, for the foregoing shares could adversely affect the market price of our common stock or impair our ability to raise capital through future sales of our common stock. Item 1B. Unresolved Staff Comments\nN/A. Item 2. Properties\nThe Companys headquarters consists of 2,911 square feet of leased office space located in the Research Park at Florida Atlantic University, Innovation Centre 1, 3998 FAU Blvd., Suite 309 Boca Raton, FL 33431. Item 3. Legal Proceedings\nOn September 1, 2021, Xeriant Inc. brought a cause of action in the Southern District of Florida against a former shareholder for claims, including but not limited to, breach of contract, misrepresentation, and asserting claims to recoup monetary and in-kind distributions made to the shareholder by the Company. The defendant submitted an affirmative defense and counterclaim on October 29, 2021.\nThere is no pending litigation against the Company and to our knowledge no litigation is contemplated or threatened. To our knowledge, none of our directors, officers, 5% shareholders or affiliates are party to any legal proceedings that would have a material adverse effect on our business, financial condition, or operating results. Item 4. Mine Safety Disclosures.\nNot Applicable.\nPART II Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities. Market Information\nOur common stock is quoted on OTC Markets under the symbol XERI.\nShares of our common stock have historically been thinly traded, and as a result, our stock price as quoted by OTC Markets may not reflect an actual or perceived value. The following table sets forth the approximate high and low bid prices for our common stock for the last two fiscal years and interim periods. The quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not represent actual transactions.\nPeriod\nHigh Bid\nLow Bid\nJuly 1, 2021 through September 30, 2021\n$ 0.240\n$ 0.143\nOctober 1, 2021 through December 31, 2021\n$ 0.171\n$ 0.061\nJanuary 1, 2022 through March 31, 2022\n$ 0.214\n$ 0.080\nApril 1, 2022 through June 30, 2022\n$ 0.119\n$ 0.065\nPeriod\nHigh Bid\nLow Bid\nJuly 1, 2020 through September 30, 2020\n$ 0.253\n$ 0.035\nOctober 1, 2020 through December 31, 2020\n$ 0.240\n$ 0.033\nJanuary 1, 2021 through March 31, 2021\n$ 0.570\n$ 0.125\nApril 1, 2021 through June 30, 2021\n$ 0.372\n$ 0.130\nOur Transfer Agent\nOlde Monmouth Stock Transfer Company, with offices at 200 Memorial Parkway, Atlantic Highlands, New Jersey 07716, is the transfer agent for our shares of common stock. The transfer agent is responsible for all record-keeping and administrative functions in connection with our shares of common stock.\nHolders\nAs of June 30, 2022, there were 199 holders of record of our common stock.\nDividends\nWe have not declared any cash dividends, nor do we intend to do so in the foreseeable future.\nPenny Stock Regulations\nThe SEC has adopted regulations which generally define so-called penny stocks to be an equity security that has a market price less than $5.00 per share or an exercise price of less than $5.00 per share, subject to certain exemptions. The Registrant's common stock is a penny stock and is subject to Rule 15g-9 under the Exchange Act, or the Penny Stock Rule. This rule imposes additional sales practice requirements on broker-dealers that sell such securities to persons other than established customers and accredited investors (generally, individuals with a net worth in excess of $1,000,000 or annual incomes exceeding $200,000, or $300,000 together with their spouses). For transactions covered by Rule 15g-9, a broker-dealer must make a special suitability determination for the purchaser and have received the purchaser's written consent to the transaction prior to sale. As a result, this rule may affect the ability of broker-dealers to sell our securities and may affect the ability of purchasers to sell any of our securities in the secondary market, thus possibly making it more difficult for us to raise additional capital.\nFor any transaction involving a penny stock, unless exempt, the rules require delivery, prior to any transaction in penny stock, of a disclosure schedule required by the SEC relating to the penny stock market. Disclosure is also required to be made about sales commissions payable to both the broker-dealer and the registered representative and current quotations for the securities. Finally, monthly statements are required to be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stock.\nThere can be no assurance that the Registrant's common stock will qualify for exemption from the Penny Stock Rule. Even if the Registrant's common stock were exempt from the Penny Stock Rule, the Registrant would remain subject to Section 15(b)(6) of the Exchange Act, which gives the SEC the authority to restrict any person from participating in a distribution of penny stock, if the SEC finds that such a restriction would be in the public interest.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Registrant does not have any equity compensation plans and accordingly there are no shares authorized for issuance under an equity compensation plan. Item 6. Selected Financial Data.\nNot applicable because we are a smaller reporting company. Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion of our financial condition and results of operations should be read in conjunction with the audited and unaudited financial statements and the notes to those statements included elsewhere in this Report. This discussion contains forward-looking statements that involve risks and uncertainties. You should specifically consider the various risk factors identified in this Report that could cause actual results to differ materially from those anticipated in these forward-looking statements.\nFinancial Results\nThe following discussion of the results of operations constitutes management's review of the factors that affected the financial and operating performance for the fiscal years ended June 30, 2022 and 2021. This discussion should be read in conjunction with the financial statements and notes thereto contained elsewhere in this report. The Company has a June 30 fiscal year end.\nExecutive Summary\nXeriant, Inc. is dedicated to the acquisition, development and commercialization of transformative aerospace technologies, including eco-friendly specialty materials which can be successfully deployed and integrated across multiple industry sectors, and disruptive innovations related to the emerging aviation market called Advanced Air Mobility, which include next-generation aircraft. We seek to partner with and acquire strategic interests in visionary companies that accelerate this mission. The Company is located at the Research Park at Florida Atlantic University in Boca Raton, Florida.\nJV with XTI Aircraft\nOn May 31, 2021, the Company entered into a Joint Venture Agreement (the Agreement) with XTI Aircraft Company (XTI), a Delaware corporation, to form a new company, called Eco-Aero, LLC (the JV), a Delaware limited liability company, with the purpose of completing the preliminary design of XTIs TriFan 600, a 5-passenger plus pilot, hybrid electric, vertical takeoff, and landing (eVTOL) fixed wing aircraft. Under the Agreement, Xeriant is contributing capital, technology, and strategic business relationships, and XTI is contributing intellectual property licensing rights and know-how. XTI and the Company each own 50 percent of the JV. The JV is managed by a management committee consisting of five members, three appointed by the Company and two by XTI. The Agreement was effective on June 4, 2021, with an initial deposit of $1 million into the JV. Xeriants financial commitment is up to $10 million, contributed as needed based on the aircraft development timeline and budget.\nThe Company analyzed the transaction under ASC 810 Consolidation, to determine if the joint venture classifies as a Variable Interest Entity (VIE). The Joint Venture qualifies as a VIE based on the fact the JV does not have sufficient equity to operate without financial support from Xeriant. According to ASC 810-25-38, a reporting entity shall consolidate a VIE when that reporting entity has a variable interest (or combination of variable interests) that provides the reporting entity with a controlling financial interest on the basis of the provisions in paragraphs 810-10-25-38A through 25-38J. The reporting entity that consolidates a VIE is called the primary beneficiary of that VIE. According to the JV operating agreement, the ownership interests are 50/50. However, the agreement provides for a Management Committee of five members. Three of the five members are from Xeriant. Additionally, Xeriant has the right to invest up to $10,000,000 into the JV. As such, Xeriant has substantial capital at risk. Based on these two factors, the conclusion is that Xeriant is the primary beneficiary of the VIE. Accordingly, Xeriant has consolidated the VIE.\nRecent Developments\nJV with Movychem\nOn April 2, 2022 the Company entered into a Joint Venture Agreement with Movychem s.r.o., a Slovakian limited liability company setting forth the terms for the establishment of a joint venture (the Joint Venture) to develop applications and commercialize a series of flame-retardant products in the form of polymer gels, powders, liquids and pellets derived from technology developed by Movychem under the name Retacell™. The Joint Venture is organized as a Florida limited liability company under the name Ebenberg, LLC and is owned 50% by each of the Company and Movychem.\nFor its capital contribution to the Joint Venture, pursuant to a Patent and Exclusive License and Assignment Agreement (the Patent Agreement), Movychem is transferring to the Joint Venture all of its interest to the know-how and intellectual property relating to Retacell exclusive of all patents, and the Company is contributing the amount of $2,600,000 payable (a) $600,000 at the rate of $25,000 per month over a 24 month period and (b) $2,000,000 within five business days of a closing of a financing in which the Company receives net proceeds of at least $3,000,000 but in no event later than six months from the Effective Date. At such time as the Company makes its $2,000,000 payment (and assuming the Company is current with its then monthly capital contributions), pursuant to the Patent Agreement, Movychem will transfer all of its rights, title and interest to all of the patents related to Retacell for an amount equal to aggregate cash contributions of the Company to the Joint Venture plus 40% of all royalty payments received by the Joint Venture for the licensing of Retacell products. Pending assignment of the patents to the Joint Venture, pursuant to the Patent Agreement, Movychem has granted to the Joint Venture an exclusive worldwide license under the patents.\nConcurrently with the execution of the Joint Venture Agreement, the Joint Venture has entered into a Services Agreement (the Services Agreement) with the Company pursuant to which the Company will provide to the Joint Venture technical services related to the exploitation of the Retacell intellectual property and corporate, marketing. business development, communications and administrative services as requested by the Joint Venture in exchange for 40% of all royalty payments received by the Joint Venture for the licensing of Retacell products.\nUnder the Joint Venture Agreement, the Company has agreed to grant to certain individuals affiliated with Movychem five-year warrants (the Warrants) to purchase an aggregate of 170,000,000 shares of the Companys common stock at an exercise price of $0.01 per share with vesting depending on the satisfaction of various milestones as described therein.\nThe Joint Venture Agreement grants to Movychem the right to dissolve the Joint Venture in the event that the Company fails to make any of its capital contributions in which case the Joint Venture will be required to grant back to Movychem all joint venture intellectual property and the assignment to Movychem of any outstanding licenses. Additionally, the Services Agreement will be amended to provide that the 40% of royalties to be paid by to the Company will be limited to licensees who were first introduced to the Joint Venture or Movychem, as the case may be.\nThe Company analyzed the transaction under ASC 810 Consolidation, to determine if the joint venture classifies as a Variable Interest Entity (VIE). The Joint Venture qualifies as a VIE based on the fact the JV does not have sufficient equity to operate without financial support from both parties. According to ASC 810-25-38, a reporting entity shall consolidate a VIE when that reporting entity has a variable interest (or combination of variable interests) that provides the reporting entity with a controlling financial interest on the basis of the provisions in paragraphs 810-10-25-38A through 25-38J. The reporting entity that consolidates a VIE is called the primary beneficiary of that VIE. According to the JV operating agreement, the ownership interests are 50/50 and the agreement provides for a Management Committee of five members. Two of the five members are from Xeriant and Movychem, respectively and one is appointed by mutual agreement of the parties. Movychem is transferring to the Joint Venture all of its interest to the know-how and intellectual property relating to Retacell exclusive of all patents, and the Company is contributing cash. As such, both parties do not have substantial capital at risk. Based on these two factors, the conclusion is that no one is the primary beneficiary of the VIE. Accordingly, Xeriant has not consolidated the VIE.\nAs of June 30, 2022, the Company paid $115,357 to the joint venture.\nStock Sales\nDuring the year ended June 30, 2022, the Company received $2,207,050 by selling 43,675,266 shares common stock, which includes 4,308,600 shares issued based on the exercise of warrants.\nConvertible Notes Issued\nDuring the year ended June 30, 2022, the Company received $4,958,950 from issuance of convertible debt.\nLitigation\nOn September 1, 2021, Xeriant Inc. brought a cause of action in the Southern District of Florida against a former shareholder for claims, including but not limited to, breach of contract, misrepresentation, and asserting claims to recoup monetary and in-kind distributions made to the shareholder by the Company. The defendant submitted an affirmative defense and counterclaim on October 29, 2021.\nFiscal Year 2022 Results of Operations Compared with Fiscal Year 2021\nFor the years ended\nJune 30, 2022\nJune 30, 2021\n$\nOperating expenses:\nSales and marketing expense\n$ 651,567\n$ 1,047,120\n$ (395,553 )\nGeneral and administrative expenses\n4,216,613\n368,296\n3,848,317\nProfessional fees\n444,012\n190,693\n253,319\nRelated party consulting fees\n432,425\n220,000\n212,425\nResearch and development expense\n5,267,581\n373,112\n4,894,469\nTotal operating expenses\n11,012,198\n2,199,221\n8,812,977\nOperating loss\n(11,012,198 )\n(2,199,221 )\n(8,812,977 )\nOther expenses:\nAmortization of debt discount\n(4,629,089 )\n(303,942 )\n(4,325,147 )\nAmortization of debt discount, related party\n(5,000 )\n5,000\nFinancing fees\n(43,750 )\n-\n(43,750 )\nInterest expense\n(138,944 )\n(7,409 )\n(131,535 )\nInterest expense, related party\n-\n(76 )\nLoss from Ebenberg JV\n(57,678 )\n-\n(57,678 )\nLoss on settlement of debt\n(536 )\n(186,954 )\n186,418\nTotal other (expense)\n(4,869,997 )\n(503,381 )\n(4,366,616 )\nNet loss\n$ (15,882,195 )\n$ (2,702,602 )\n$ (13,179,593 )\nSales and marketing expenses\nTotal sales and marketing expenses were $651,567 and $1,047,120 for the fiscal years ended June 30, 2022 and 2021, respectively. During the fiscal year ended June 30, 2022 the Companys sales and marketing expenses were associated with social media marketing campaigns, events and press releases.\nGeneral and administrative expenses\nTotal general and administrative expenses were $4,216,613 and $368,296 for the fiscal years ended June 30, 2022 and 2021, respectively. The change was primarily due to an increase in stock issuances related to consulting fees and advisory board fees, advisory board fees paid in cash, and an increase in travel, meetings, and conferences.\nProfessional Fees\nTotal professional fees were $444,012 and $190,693 for the fiscal years ended June 30, 2022 and 2021, respectively. The increase was primarily due to legal fees.\nRelated Party Consulting Fees\nTotal related party consulting fees were $432,425 and $220,000 for the fiscal years ended June 30, 2022 and 2021, respectively. The related party consulting fees for fiscal year ended June 30, 2022 consisted of (i) $184,000 to Ancient Investments, LLC, a company owned by Keith Duffy, CEO and Scott Duffy, Executive Director of Operations, (ii) $86,000 for AMP Web Services, LLC, a company owned by Pablo Lavigna, CIO, $122,000 to Edward DeFeudis, Director, and (iii) $40,425 for Keystone Business Development Partners, LLC, a company owned by Brian Carey, CFO. The consulting fees for June 30, 2021 consisted of i) $98,000 to Ancient Investments, LLC, a company owned by Keith Duffy, CEO and Scott Duffy, Executive Director of Operations, (ii) $49,500 for AMP Web Services, LLC, a company owned by Pablo Lavigna, CIO, $40,000 to Edward DeFeudis, Director, and (iii) $20,000 for Keystone Business Development Partners, LLC, a company owned by Brian Carey, CFO.\nResearch and Development Expenses\nTotal research and development expenses were $5,267,581 and $373,112 for the fiscal years ended June 30, 2022 and 2021, respectively. These research and development expenses were in connection with our Eco-Aero, LLC joint venture with XTI Aircraft Company for funding the preliminary design phase in the development of an aircraft, called the TriFan 600.\nOther Income (Expenses)\nTotal other expenses consist of amortization of debt discount related to convertible notes, interest expense related to convertible notes, and a loss on settlement of debt. Total other expenses were $4,869,997 for the year ended June 30, 2022 compared to $503,381 for the year ended June 30, 2021. The increase was primarily due to recording the amortization of debt discount from the convertible note signed for the year ended June 30, 2022 in the amount of $4,629,089.\nNet loss\nTotal net loss was $15,882,195 for the year ended June 30, 2022 compared to $2,702,602 for the year ended June 30, 2021. The increase was primarily due to research and development expense and the cost of financings.\nLiquidity and Capital Resources\nAs of June 30, 2022, we had a cash balance of $1,065,945 and a working deficit of $3,002,259. Our net loss of $15,882,195 in the year ended June 30, 2022 was mostly funded by proceeds raised from financings. We will need to raise working capital (or refinance existing short-term debt to long-term debt) to fund operations. Future equity financings may be dilutive to our stockholders. Alternative forms of future financings may include preferences or rights superior to our common stock. Debt financings may involve a pledge of assets and will rank senior to our common stock. We have historically financed our operations through best- efforts private equity and debt financings. We do not have any credit or equity facilities available with financial institutions, stockholders or third-party investors, and will continue to rely on best efforts financings. The failure to raise sufficient capital will likely cause us to cease operations.\nDuring the fiscal year 2022, our operating activities used $6,927,249 of net cash compared to using $1,012,203 of net cash flow in our operating activities during fiscal year 2021. This difference primarily resulted from the increase of operations such as research and development expense of $5,267,581 and non-cash expense such as stock option expense of $3,248,181 and amortization of debt discount of $4,629,089.\nFunding Strategy\nTo date, our operations have been funded primarily through private investors. Some of these investors have verbally committed additional funding for the Company, as needed. We have had a number of discussions with broker-dealers regarding the funding required to execute the Companys business plan, which is to acquire and develop breakthrough technologies or business interests in those companies that have developed these technologies. We are in the process of issuing an offering document to obtain the funding for certain acquisitions that are in the discussion stages.\nOff Balance Sheet Items\nWe do not have any off-balance sheet arrangements, financings, or other relationships with unconsolidated entities or other persons, also known as special purpose entities (SPEs).\nCritical Accounting Policies\nBasis of Presentation\nThe consolidated financial statements, which include the accounts of the Company and American Aviation Technologies, LLC, its subsidiary, and Eco-Aero, LLC, its joint venture, and are prepared in conformity with generally accepted accounting principles in the United States of America (U.S. GAAP). All significant intercompany balances and transactions have been eliminated. The consolidated financial statements, which include the accounts of the Company and its wholly owned subsidiary, and related disclosures have been prepared pursuant to the rules and regulations of the Securities and Exchange Commission (SEC). The Financial Statements have been prepared using the accrual basis of accounting in accordance with accounting principles generally accepted in the United States of America (GAAP) and presented in US dollars. The fiscal year end is June 30.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of Xeriant, Inc., and American Aviation Technologies, LLC, and Eco-Aero, LLC. All significant intercompany balances and transactions have been eliminated.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. The most significant assumptions and estimates relate to the valuation of beneficial conversion features and warrants associated with convertible debt. Actual results could differ from these estimates.\nStock-based Compensation\nThe Company measures the cost of employee services received in exchange for equity incentive awards based on the grant date fair value of the award. The Company uses the Black-Scholes valuation model to calculate the fair value of stock options granted to employees or consultants. Stock-based compensation expense is recognized over the period during which the employee is required to provide services in exchange for the award, which is usually the vesting period.\nFair Value Measurements and Fair Value of Financial Instruments\nThe Company adopted ASC Topic 820, Fair Value Measurements. ASC Topic 820 clarifies the definition of fair value, prescribes methods for measuring fair value, and establishes a fair value hierarchy to classify the inputs used in measuring fair value as follows:\nLevel 1: Inputs are unadjusted quoted prices in active markets for identical assets or liabilities available at the measurement date.\nLevel 2: Inputs are unadjusted quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, inputs other than quoted prices that are observable, and inputs derived from or corroborated by observable market data.\nLevel 3: Inputs are unobservable inputs which reflect the reporting entity's own assumptions on what assumptions the market participants would use in pricing the asset or liability based on the best available information.\nThe estimated fair value of certain financial instruments, including all current liabilities are carried at historical cost basis, which approximates their fair values because of the short-term nature of these instruments.\nDeferred Taxes\nThe Company follows Accounting Standards Codification subtopic 740-10, Income Taxes (\"ASC 740-10\") for recording the provision for income taxes. Deferred tax assets and liabilities are computed based upon the difference between the financial statement and income tax basis of assets and liabilities using the enacted marginal tax rate applicable when the related asset or liability is expected to be realized or settled. Deferred income tax expenses or benefits are based on the changes in the asset or liability during each period. If available evidence suggests that it is more likely than not that some portion or all of the deferred tax assets will not be realized, a valuation allowance is required to reduce the deferred tax assets to the amount that is more likely than not to be realized. Future changes in such valuation allowance are included in the provision for deferred income taxes in the period of change. Deferred income taxes may arise from temporary differences resulting from income and expense items reported for financial accounting and tax purposes in different periods.\nDeferred taxes are classified as current or non-current, depending on the classification of assets and liabilities to which they relate. Deferred taxes arising from temporary differences that are not related to an asset or liability are classified as current or non-current depending on the periods in which the temporary differences are expected to reverse and are considered immaterial. As of June 30, 2022 there are no deferred tax assets.\nCash and Cash Equivalents\nFor purposes of the Statements of Cash Flows, the Company considers highly liquid investments with an original maturity of three months or less to be cash equivalents. The Company has no cash equivalents.\nAccounts Receivable and Allowance for Doubtful Accounts\nThe Company monitors outstanding receivables based on factors surrounding the credit risk of specific customers, historical trends, and other information. The allowance for doubtful accounts is estimated based on an assessment of the Company's ability to collect on customer accounts receivable. There is judgment involved with estimating the allowance for doubtful accounts and if the financial condition of the Company's customers were to deteriorate, resulting in their inability to make the required payments, the Company may be required to record additional allowances or charges against revenues. The Company writes off accounts receivable against the allowance when it determines a balance is uncollectible and no longer actively pursues its collection. The allowance for doubtful accounts is created by forming a credit balance which is deducted from the total receivables balance in the balance sheet. As of June 30, 2022 and 2021 there are no accounts receivable.\nConvertible Debentures\nIf the conversion features of conventional convertible debt provide for a rate of conversion that is below market value at issuance, this feature is characterized as a beneficial conversion feature (\"BCF\"). A BCF is recorded by the Company as a debt discount pursuant to ASC Topic 470-20 \"Debt with Conversion and Other Options.\" In those circumstances, the convertible debt is recorded net of the discount related to the BCF, and the Company amortizes the discount to interest expense, over the life of the debt. During the year ended June 30, 2022, the Company recorded a BCF in the amount of $2,615,419.\nFair Value of Financial Instruments\nAccounting Standards Codification subtopic 825-10, Financial Instruments (\"ASC 825-10\") requires disclosure of the fair value of certain financial instruments. The carrying value of cash, accounts payable and accrued liabilities as reflected in the balance sheets, approximate fair value because of the short-term maturity of these instruments. All other significant financial assets, financial liabilities and equity instruments of the Company are either recognized or disclosed in the financial statements together with other information relevant for making a reasonable assessment of future cash flows, interest rate risk and credit risk. Where practicable the fair values of financial assets and financial liabilities have been determined and disclosed; otherwise only available information pertinent to fair value has been disclosed.\nThe Company follows Accounting Standards Codification subtopic 820-10, Fair Value Measurements and Disclosures (\"ASC 820-10\") and Accounting Standards Codification subtopic 825-10, Financial Instruments (\"ASC 825-10\"), which permits entities to choose to measure many financial instruments and certain other items at fair value.\nResearch and Development Expenses\nExpenditures for research and development are expensed as incurred. The Company incurred research and development expenses of $5,267,581 and $373,112 for the years ended June 30, 2022 and 2021, respectively.\nAdvertising, Marketing and Public Relations\nThe Company expenses advertising and marketing costs as they are incurred. The Company recorded advertising expenses in the amount of $651,567 and $1,047,120 for the years ended June 30, 2022 and 2021, respectively.\nOffering Costs\nCosts incurred in connection with raising capital by the issuance of common stock are recorded as contra equity and deducted from the capital raised. There were no offering costs for the years ended June 30, 2022 and 2021, respectively.\nIncome Taxes\nThe Company recognizes the effect of income tax positions only if those positions are more likely than not of being sustained. Recognized income tax positions are measured at the largest amount that is greater than 50% likely of being realized. Changes in recognition or measurement are reflected in the period in which the change in judgment occurs. The Company records interest and penalties related to unrecognized tax benefits as a component of general and administrative expenses. Our consolidated federal tax return and any state tax returns are not currently under examination.\nThe Company has adopted FASB ASC 740-10, Accounting for Income Taxes, which requires an asset and liability approach to financial accounting and reporting for income taxes. Deferred income tax assets and liabilities are computed annually from differences between the financial statement and tax basis of assets and liabilities that will result in taxable or deductible amounts in the future based on enacted tax laws and rates applicable to the periods in which the differences are expected to affect taxable income. Valuation allowances are established when necessary to reduce deferred tax assets to the amount expected to be realized.\nRecent Accounting Pronouncements\nThe Company has implemented all new accounting pronouncements that are in effect. These pronouncements did not have any material impact on the consolidated financial statements unless otherwise disclosed, and the Company does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations.  Item 8. Financial Statements and Supplementary Data\nXERIANT, INC.\nCONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 and 2021\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm (PCAOB ID # 5041)\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations for the Year Ended June 30, 2022 and 2021\nConsolidated Statements of Stockholders Deficit for the Year Ended June 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the Year Ended June 30, 2022 and 2021\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Xeriant, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Xeriant, Inc. (the \"Company\") as of June 30, 2022 and 2021 the related statements of operations, stockholders equity (deficit), and cash flows for the years ended June 30, 2022 and 2021, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for the years ended June 30, 2022 and 2021, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 11 to the consolidated financial statements, the Companys significant operating losses raise substantial doubt about its ability to continue as a going concern. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nCreation of Variable Interest Entity\nAs described in Note 3 to the consolidated financial statements, management applied FASB Topic 810, Consolidation (ASC 810) to recognize if a Joint Venture (JV) classifies as a Variable Interest Entity (VIE). Management recognizes a VIE when the Company has a controlling financial interest in the VIE and, thus, is the VIEs primary beneficiary. The Companys assessment includes determining the characteristics of the reporting entitys variable interest(s) and other involvements (including involvement of related parties and de facto agents), if any, in the VIE, as well as the involvement of other variable interest holders. Additionally, the assessment, considers the VIEs purpose and design, including the risks that the VIE was designed to create and pass through to its variable interest holders.\nThe principal considerations for our determination that performing procedures over determination if a VIE relationship exits is a critical audit matter as there are more significant risks associated with no recognition of. This in turn led to significant effort in performing our audit procedures which were designed to evaluate whether the beneficiary has the power, through voting rights or similar right, to direct the activities of an entity that most significantly impact the entitys economic performance, the obligation to absorb the expected losses of the entity and the right to receive the expected residual returns of the entity were appropriately considered by management under ASC 810.\nOur audit procedures included, among others, determining the activities that most significantly affect the VIEs economic performance and the Company retaining the power to most affect those activities, whether the Companys economic interest, including its obligation to absorb losses or receive benefits, is disproportionately greater than its power to direct the activities of the VIE that significantly influence its economic performance and if the JV has sufficient equity to operate without financial support from the Company.\n/s/ BF Borgers CPA PC\nBF Borgers CPA PC\nServed as Auditor since 2019\nLakewood, CO\nOctober 7, 2022\nXERIANT, INC.\nCONSOLIDATED BALANCE SHEETS\nAs of June 30, 2022\nAs of June 30, 2021\nAsset\nCurrent assets\nCash\n$ 1,065,945\n$ 962,540\nDeposits and prepaids\n13,302\n13,780\nInvestment - joint venture\n57,678\nTotal current assets\n1,136,925\n976,320\nProperty & equipment, net\n4,409\nOperating lease right-of-use asset\n128,342\n169,209\nTotal assets\n$ 1,269,676\n$ 1,145,529\nLiabilities & stockholders' deficit\nCurrent liabilities\nAccounts payable and accrued liabilities\n$ 56,836\n$ 73,224\nAccrued liabilities, related party\n22,000\n25,000\nShares to be issued\n75,200\nConvertible notes payable, net of discount\n3,936,185\n158,196\nLease liability, current\n48,963\n42,643\nTotal current liabilities\n4,139,184\n299,063\nLease liability, long-term\n92,197\n141,160\nTotal liabilities\n4,231,381\n440,223\nCommitments and contingencies (Note 9)\nStockholders' deficit\nSeries A Preferred stock, $0.00001 par value; 100,000,000 authorized; 3,500,000 designated; 760,132 and 788,270 shares issued and outstanding at June 30, 2022 and June 30, 2021, respectively\nSeries B Preferred stock, $0.00001 par value; 100,000,000 authorized; 1,000,000 designated; 1,000,000 issued and outstanding at June 30, 2022 and June 30, 2021, respectively\nCommon stock, $0.00001 par value; 5,000,000,000 shares authorized; 365,239,001 and 292,815,960 shares issued and outstanding at June 30, 2022 and June 30, 2021, respectively\n3,637\n2,928\nCommon stock to be issued\n51,950\n51,090\nAdditional paid in capital\n16,351,806\n4,138,191\nAccumulated deficit\n(16,571,505 )\n(3,270,235 )\nTotal Xeriant stockholder's deficit\n(164,094 )\n921,992\nNon-controlling interest\n(2,797,611 )\n(216,686 )\nTotal stockholders' deficit\n(2,961,705 )\n705,306\nTotal liabilities and stockholders' deficit\n$ 1,269,676\n$ 1,145,529\nThe accompanying notes are an integral part of these consolidated financial statements.\nXERIANT, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the year ended\nJune 30, 2022\nJune 30, 2021\nOperating expenses:\nAdvertising and marketing expense\n$ 651,567\n$ 1,047,120\nGeneral and administrative expenses\n4,216,613\n368,296\nProfessional fees\n444,012\n190,693\nRelated party consulting fees\n432,425\n220,000\nResearch and development expense\n5,267,581\n373,112\nTotal operating expenses\n11,012,198\n2,199,221\nLoss from operations\n(11,012,198 )\n(2,199,221 )\nOther expenses:\nAmortization of debt discount\n(4,629,089 )\n(303,942 )\nAmortization of debt discount, related party\n-\n(5,000 )\nFinancing fees\n(43,750 )\n-\nInterest expense\n(138,944 )\n(7,409 )\nInterest expense, related party\n-\n(76 )\nLoss from joint venture\n(57,678 )\n-\nLoss on settlement of debt\n(536 )\n(186,954 )\nTotal other (expense)\n(4,869,997 )\n(503,381 )\nNet loss attributable:\nNon-controlling interest\n(2,580,925 )\n(216,686 )\nCommon stockholders\n(13,301,270 )\n(2,485,916 )\nNet loss\n$ (15,882,195 )\n$ (2,702,602 )\nNet loss per common share - basic and diluted\n$ (0.05 )\n$ (0.01 )\nWeighted average number of common shares outstanding - basic and diluted\n345,160,167\n225,497,197\nThe accompanying notes are an integral part of these consolidated financial statements.\nXERIANT, INC.\nCONSOLIDATED STATEMENT OF CHANGES IN STOCKHOLDERS' DEFICIT\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\nSeries A Preferred Stock\nSeries B Preferred Stock\nCommon Stock\nAdditional\nPaid in\nCommon\nstock\nAccumulated\nNon-Controlling\nShares\nAmount\nShares\nAmount\nShares\nAmount\nCapital\nto be issued\nDeficit\nInterest\nTotal\nBalance June 30, 2020\n3,113,637\n$ 31\n69,584,149\n$ 696\n379,971\n$ 372,397\n$ (784,319 )\n$ -\n$ (31,224 )\nSale of common stock\n-\n-\n16,308,334\n1,599,837\n48,000\n-\n-\n1,648,000\nConversion of convertible notes and accrued interest\n-\n-\n25,168,183\n183,904\n-\n-\n-\n184,156\nConversion of convertible notes and accrued interest\n-\n-\n-\n-\n-\n3,090\n-\n-\n3,090\nConversion of Series A Preferred to Common Stock\n(44,367 )\n-\n44,366,919\n(444 )\n-\n-\n-\n-\nCancellation of Series A Preferred shares issued in AAT merger\n(2,240,000 )\n(22 )\n-\n-\n-\n-\n-\n-\nCancellation of Series A Preferred shares issued for compensation in prior year\n(41,000 )\n(1 )\n-\n-\n-\n-\n-\n-\nStock issued for services\n-\n-\n24,540,909\n1,275,458\n-\n-\n-\n1,275,703\nIssuance of warrants with convertible notes\n-\n-\n-\n-\n117,893\n-\n-\n-\n117,893\nIssuance of warrants for advisory board services\n-\n-\n-\n-\n38,332\n-\n-\n-\n38,332\nFair value of beneficial conversion feature associated with convertible debt\n-\n-\n-\n-\n171,957\n-\n-\n-\n171,957\nShares reclassed from common stock to be issued\n-\n-\n112,847,466\n1,128\n371,270\n(372,397 )\n-\n-\nIssuance of Series B Preferred Stock in connection with CEO's Employment Agreement\n-\n-\n1,000,000\n-\n-\n(10 )\n-\n-\n-\n3,090\nNet Loss\n-\n-\n-\n-\n-\n-\n(2,485,916 )\n(216,686 )\n(2,702,602 )\nBalance June 30, 2021\n788,270\n$ 8\n1,000,000\n292,815,960\n$ 2,928\n4,138,191\n$ 51,090\n$ (3,270,235 )\n$ (216,686 )\n$ 705,306\nSale of common stock\n-\n$ -\n15,700,000\n909,843\n1,168,500\n-\n-\n2,078,500\nIssuance of common stock\n-\n-\n23,666,666\n1,256,211\n(1,256,450 )\n-\n-\nShares issued as equity kicker\n-\n-\n250,000\n43,750\n-\n-\n-\n43,753\nExercise of warrants\n-\n-\n4,308,600\n128,508\n-\n-\n-\n128,550\nConversion of Series A Preferred to Common Stock\n(7,138 )\n-\n7,138,000\n(71 )\n-\n-\n-\n-\nConversion of convertible notes and accrued interest\n-\n-\n14,828,244\n429,761\n(3,090 )\n-\n-\n426,819\nInducement of conversion - interest expense\n-\n-\n845,936\n134,918\n134,927\nStock issued for services\n-\n-\n4,685,615\n670,011\n91,900\n-\n-\n761,954\nStock option compensation\n-\n-\n-\n-\n3,248,181\n-\n-\n-\n3,248,181\nFair value of beneficial conversion feature associated with convertible debt\n-\n-\n-\n-\n2,615,419\n-\n-\n-\n2,615,419\nFair value of warrants associated with convertible debt\n-\n-\n-\n-\n2,777,081\n-\n-\n-\n2,777,081\nNet Loss\n-\n-\n-\n-\n-\n-\n(13,301,270 )\n(2,580,925 )\n(15,882,195 )\nBalance June 30, 2022\n781,132\n$ 8\n1,000,000\n$ 10\n364,239,001\n$ 3,637\n16,351,806\n$ 51,950\n$ (16,571,505 )\n$ (2,797,611 )\n$ (2,961,705 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nXERIANT, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the year ended\nJune 30, 2022\nJune 30, 2021\nCash Flows from Operating Activities\nNet Loss\n$ (15,882,195 )\n$ (2,702,602 )\nAdjustments to reconcile net loss to net\ncash used by operating activities:\nDepreciation and Amortization\n15,581\n-\nStock option expense\n3,248,181\n1,275,703\nStock issued for services\n761,954\n38,332\nFinancing fees\n178,680\n-\nLoss from joint venture\n57,678\n-\nLoss on settlement of debt\n-\n186,954\nAmortization of Debt Discount\n4,629,089\n303,912\nAmortization of Debt Discount, Related Party\n-\n5,000\nShares to be issued\n75,200\n-\nOperating lease right of use asset\n40,867\n(62 )\nLease liabilities\n(42,643 )\n-\nDeposits and prepaids\nAccounts payable and accrued liabilities\n(12,639 )\n(119,553 )\nAccrued liability, related party\n(3,000 )\n-\nAccrued expenses\n5,520\n-\nNet cash used by operating activities\n(6,927,249 )\n(1,012,203 )\nCash Flows from Investing Activities\nInvestment in joint venture\n(115,356 )\nPurchase of property and equipment\n(19,990 )\n-\nNet cash used in financing activities\n(135,346 )\n-\nCash Flows from Financing Activities\nSale of common stock\n2,078,500\n1,648,000\nCash from exercise of warrants\n128,550\nProceeds from convertible notes payable\n4,958,950\n287,850\nNet cash provided by financing activities\n7,166,000\n1,935,850\nIncrease in Cash\n103,405\n923,647\nCash at beginning of period\n962,540\n38,893\nCash at end of period\n$ 1,065,945\n$ 962,540\nSupplemental Cash Flow Information\nCash paid for interest\n$ 0\n$ 0\nCash paid for income taxes\n$ 0\n$ 0\nNon-cash investing and financing activities:\nConversion of convertible notes payable and accrued interest\n$ 440,995\n$ 187,246\nWarrants issued with convertible notes payable\n$ 2,894,974\n$ 117,893\nBeneficial conversion feature arising from convertible notes payable\n$ 2,615,419\n$ 171,597\nThe accompanying notes are an integral part of these consolidated financial statements.\nXERIANT, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION AND NATURE OF BUSINESS\nXeriant, Inc. (Xeriant or the Company) is an aerospace company dedicated to the emerging aviation market called Advanced Air Mobility (AAM), the transition to eco-friendly, on demand flight, making air transportation more accessible and a greater part of our daily lives. Xeriant is focused on the acquisition, development, and proliferation of next generation hybrid-electric and fully electric aircraft with vertical takeoff and landing (eVTOL) capabilities, performance enhancing aerospace technologies and advanced materials, as well as critical support infrastructure. Xeriant is located at the Research Park at Florida Atlantic University in Boca Raton, Florida adjacent to the Boca Raton Airport, and trades on OTC Markets under the stock symbol, XERI.\nThe Company was incorporated in Nevada on December 18, 2009.\nOn April 16, 2019, the Company entered into a Share Exchange Agreement with American Aviation Technologies, LLC (AAT), an aircraft design and development company focused on the emerging segment of the aviation industry of autonomous and semi-autonomous vertical take-off and landing (VTOL) unmanned aerial vehicles (UAVs).\nOn September 30, 2019, the acquisition of AAT closed, and AAT became a subsidiary of the Company.\nOn June 22, 2020, the name of the Company was changed to Xeriant, Inc. in the State of Nevada and subsequently approved by FINRA effective July 30, 2020 for the name and symbol change (XERI).\nOn May 31, 2021, the Company entered into a Joint Venture Agreement with XTI Aircraft Company, to form a new company, called Eco-Aero, LLC, for purpose of completing the preliminary design of XTIs TriFan 600, a 5-passenger plus pilot, hybrid electric, vertical takeoff and landing (eVTOL) fixed wing aircraft.\nEffective April 2, 2022 (the Effective Date), the Company entered into a Joint Venture Agreement (the Joint Venture Agreement) with Movychem s.r.o., a Slovakian limited liability company (Movychem) setting forth the terms for the establishment of a joint venture (the Joint Venture) to develop applications and commercialize a series of flame retardant products in the form of polymer gels, powders, liquids and pellets derived from technology developed by Movychem under the name Retacell™. The Joint Venture is organized as a Florida limited liability company under the name Ebenberg, LLC and is owned 50% by each of the Company and Movychem.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe consolidated financial statements, which include the accounts of the Company, American Aviation Technologies, LLC, and Eco-Aero, LLC, its subsidiaries, are prepared in conformity with generally accepted accounting principles in the United States of America (U.S. GAAP). All significant intercompany balances and transactions have been eliminated. The consolidated financial statements, which include the accounts of the Company and its wholly owned subsidiaries, and related disclosures have been prepared pursuant to the rules and regulations of the Securities and Exchange Commission (SEC). The Financial Statements have been prepared using the accrual basis of accounting in accordance with accounting principles generally accepted in the United States of America (GAAP) and presented in US dollars. The fiscal year end is June 30.\nGoing Concern\nThe Company's financial statements are prepared using the generally accepted accounting principles applicable to a going concern, which contemplates the realization of assets and liquidation of liabilities in the normal course of business. At June 30, 2022 and 2021, the Company had $1,065,945 and $962,540 in cash and $3,002,259 in negative working capital and $677,257 in working capital, respectively. For the year ended June 30, 2022 and 2021, the Company had a net loss of $15,882,195 and $2,702,602, respectively. Continued losses may adversely affect the liquidity of the Company in the future. Therefore, the factors noted above raise substantial doubt about our ability to continue as a going concern. The recoverability of a major portion of the recorded asset amounts shown in the accompanying balance sheets is dependent upon continued operations of the Company, which in turn is dependent upon the Company's ability to raise additional capital, obtain financing and to succeed in its future operations. The financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts or amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern. The Companys existence is dependent upon managements ability to develop profitable operations and resolve its liquidity problems.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of Xeriant, Inc., American Aviation Technologies, LLC, and Eco-Aero, LLC. All significant intercompany balances and transactions have been eliminated.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. The most significant assumptions and estimates relate to the valuation of beneficial conversion features and warrants associated with convertible debt. Actual results could differ from these estimates.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nFair Value Measurements and Fair Value of Financial Instruments\nThe Company adopted ASC Topic 820, Fair Value Measurements. ASC Topic 820 clarifies the definition of fair value, prescribes methods for measuring fair value, and establishes a fair value hierarchy to classify the inputs used in measuring fair value as follows:\nLevel 1: Inputs are unadjusted quoted prices in active markets for identical assets or liabilities available at the measurement date.\nLevel 2: Inputs are unadjusted quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, inputs other than quoted prices that are observable, and inputs derived from or corroborated by observable market data.\nLevel 3: Inputs are unobservable inputs which reflect the reporting entity's own assumptions on what assumptions the market participants would use in pricing the asset or liability based on the best available information.\nThe estimated fair value of certain financial instruments, including all current liabilities are carried at historical cost basis, which approximates their fair values because of the short-term nature of these instruments.\nThe inputs to the valuation methodology of stock options and warrants were under level 3 fair value measurements.\nCash and Cash Equivalents\nFor purposes of the Statements of Cash Flows, the Company considers highly liquid investments with an original maturity of three months or less to be cash equivalents. The Company has no cash equivalents.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nConvertible Debentures\nIf the conversion features of conventional convertible debt provide for a rate of conversion that is below market value at issuance, this feature is characterized as a beneficial conversion feature (\"BCF\"). A BCF is recorded by the Company as a debt discount pursuant to ASC Topic 470-20 \"Debt with Conversion and Other Options.\" In those circumstances, the convertible debt is recorded net of the discount related to the BCF, and the Company amortizes the discount to interest expense, over the life of the debt. During the year ended June 30, 2022, the Company recorded a BCF in the amount of $2,615,419.\nStock-based Compensation\nThe Company measures the cost of employee services received in exchange for equity incentive awards based on the grant date fair value of the award. The Company uses the Black-Scholes valuation model to calculate the fair value of stock options granted to employees or consultants. Stock-based compensation expense is recognized over the period during which the employee is required to provide services in exchange for the award, which is usually the vesting period.\nResearch and Development Expenses\nExpenditures for research and development are expensed as incurred. The Company incurred research and development expenses of $5,267,581 and $373,112 for the years ended June 30, 2022 and 2021, respectively.\nAdvertising and Marketing Expenses\nThe Company expenses advertising and marketing costs as they are incurred. The Company recorded advertising expenses in the amount of $651,567 and $1,047,120 for the years ended June 30, 2022 and 2021, respectively.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nIncome Taxes\nThe Company recognizes the effect of income tax positions only if those positions are more likely than not of being sustained. Recognized income tax positions are measured at the largest amount that is more likely than not of being realized. Changes in recognition or measurement are reflected in the period in which the change in judgment occurs. The Company records interest and penalties related to unrecognized tax benefits as a component of general and administrative expenses. Our consolidated federal tax return and any state tax returns are not currently under examination.\nThe Company follows Accounting Standards Codification subtopic 740-10, Income Taxes (\"ASC 740-10\") for recording the provision for income taxes. Deferred tax assets and liabilities are computed based upon the difference between the financial statement and income tax basis of assets and liabilities using the enacted marginal tax rate applicable when the related asset or liability is expected to be realized or settled. Deferred income tax expenses or benefits are based on the changes in the asset or liability during each period. If available evidence suggests that it is more likely than not that some portion or all of the deferred tax assets will not be realized, a valuation allowance is required to reduce the deferred tax assets to the amount that is more likely than not to be realized. Future changes in such valuation allowance are included in the provision for deferred income taxes in the period of change. Deferred income taxes may arise from temporary differences resulting from income and expense items reported for financial accounting and tax purposes in different periods.\nBasic Income (Loss) Per Share\nUnder the provisions of ASC 260, Earnings per Share, basic loss per common share is computed by dividing net loss available to common shareholders by the weighted average number of shares of common stock outstanding for the periods presented. Diluted net loss per share reflects the potential dilution that could occur if securities or other contracts to issue common stock were exercised or converted into common stock or resulted in the issuance of common stock that would then share in the income of the Company, subject to anti-dilution limitations.\nThe table below presents the computation of basic and diluted earnings per share for the years ended June 30, 2022 and 2021:\nFor the year ended June 30, 2022\nFor the year ended June 30, 2021\nNumerator:\nNet loss\n$ (15,882,195 )\n$ (2,702,602 )\nDenominator:\nWeighted average common shares outstanding-basic\n345,160,167\n225,497,197\nDilutive common stock equivalents\n-\n-\nWeighted average common shares outstanding-diluted\n345,160,167\n225,497,197\nNet loss per share:\nBasic\n$ (0.05 )\n$ (0.01 )\nDiluted\n$ (0.05 )\n$ (0.01 )\nNOTE 3 - JOINT VENTURE\nJV with XTI Aircraft\nOn May 31, 2021, the Company entered into a Joint Venture Agreement (the Agreement) with XTI Aircraft Company (XTI), a Delaware corporation, to form a new company, called Eco-Aero, LLC (the JV), a Delaware limited liability company, with the purpose of completing the preliminary design of XTIs TriFan 600, a 5-passenger plus pilot, hybrid electric, vertical takeoff, and landing (eVTOL) fixed wing aircraft. Under the Agreement, Xeriant is contributing capital, technology, and strategic business relationships, and XTI is contributing intellectual property licensing rights and know-how. XTI and the Company each own 50 percent of the JV. The JV is managed by a management committee consisting of five members, three appointed by the Company and two by XTI. The Agreement was effective on June 4, 2021, with an initial deposit of $1 million into the JV. Xeriants financial commitment is for up to $10 million, contributed as required by the aircraft development timeline and budget.\nThe Company analyzed the transaction under ASC 810 Consolidation, to determine if the joint venture classifies as a Variable Interest Entity (VIE). The Joint Venture qualifies as a VIE based on the fact the JV does not have sufficient equity to operate without financial support from Xeriant. According to ASC 810-25-38, a reporting entity shall consolidate a VIE when that reporting entity has a variable interest (or combination of variable interests) that provides the reporting entity with a controlling financial interest on the basis of the provisions in paragraphs 810-10-25-38A through 25-38J. The reporting entity that consolidates a VIE is called the primary beneficiary of that VIE. According to the JV operating agreement, the ownership interests are 50/50. However, the agreement provides for a Management Committee of five members. Three of the five members are from Xeriant. Additionally, Xeriant has an obligation to invest $10,000,000 into the JV. As such, Xeriant has substantial capital at risk. Based on these two factors, the conclusion is that Xeriant is the primary beneficiary of the VIE. Accordingly, Xeriant has consolidated the VIE.\nJV with Movychem\nOn April 2, 2022 the Company entered into a Joint Venture Agreement with Movychem s.r.o., a Slovakian limited liability company setting forth the terms for the establishment of a joint venture (the Joint Venture) to develop applications and commercialize a series of flame-retardant products in the form of polymer gels, powders, liquids and pellets derived from technology developed by Movychem under the name Retacell™. The Joint Venture is organized as a Florida limited liability company under the name Ebenberg, LLC and is owned 50% by each of the Company and Movychem.\nFor its capital contribution to the Joint Venture, pursuant to a Patent and Exclusive License and Assignment Agreement (the Patent Agreement), Movychem is transferring to the Joint Venture all of its interest to the know-how and intellectual property relating to Retacell exclusive of all patents, and the Company is contributing the amount of $2,600,000 payable (a) $600,000 at the rate of $25,000 per month over a 24 month period and (b) $2,000,000 within five business days of a closing of a financing in which the Company receives net proceeds of at least $3,000,000 but in no event later than six months from the Effective Date. At such time as the Company makes its $2,000,000 payment (and assuming the Company is current with its then monthly capital contributions), pursuant to the Patent Agreement, Movychem will transfer all of its rights, title and interest to all of the patents related to Retacell for an amount equal to aggregate cash contributions of the Company to the Joint Venture plus 40% of all royalty payments received by the Joint Venture for the licensing of Retacell products. Pending assignment of the patents to the Joint Venture, pursuant to the Patent Agreement, Movychem has granted to the Joint Venture an exclusive worldwide license under the patents.\nConcurrently with the execution of the Joint Venture Agreement, the Joint Venture will provide to the Joint Venture technical services related to the exploitation of the Retacell intellectual property and corporate, marketing. business development, communications and administrative services as requested by the Joint Venture in exchange for 40% of all royalty payments received by the Joint Venture for the licensing of Retacell products.\nUnder the Joint Venture Agreement, the Company has agreed to grant to certain individuals affiliated with Movychem five-year warrants (the Warrants) to purchase an aggregate of 170,000,000 shares of the Companys common stock at an exercise price of $0.01 per share with vesting depending on the satisfaction of various milestones as described therein.\nThe Joint Venture Agreement grants to Movychem the right to dissolve the Joint Venture in the event that the Company fails to make any of its capital contributions in which case the Joint Venture will be required to grant back to Movychem all joint venture intellectual property and the assignment to Movychem of any outstanding licenses. Additionally, the Services Agreement will be amended to provide that the 40% of royalties to be paid by to the Company will be limited to licensees who were first introduced to the Joint Venture or Movychem, as the case may be.\nThe Company analyzed the transaction under ASC 810 Consolidation, to determine if the joint venture classifies as a Variable Interest Entity (VIE). The Joint Venture qualifies as a VIE based on the fact the JV does not have sufficient equity to operate without financial support from both parties. According to ASC 810-25-38, a reporting entity shall consolidate a VIE when that reporting entity has a variable interest (or combination of variable interests) that provides the reporting entity with a controlling financial interest on the basis of the provisions in paragraphs 810-10-25-38A through 25-38J. The reporting entity that consolidates a VIE is called the primary beneficiary of that VIE. According to the JV operating agreement, the ownership interests are 50/50 and the agreement provides for a Management Committee of five members. Two of the five members are from Xeriant and Movychem, respectively and one is appointed by mutual agreement of the parties. Movychem is transferring to the Joint Venture all of its interest to the know-how and intellectual property relating to Retacell exclusive of all patents, and the Company is contributing cash. As such, both parties do not have substantial capital at risk. Based on these two factors, the conclusion is that no one is the primary beneficiary of the VIE. Accordingly, Xeriant has not consolidated the VIE.\nAs of June 30, 2022, the Company contributed $115,356 to the joint venture.\nNOTE 4 - CONCENTRATION OF CREDIT RISKS\nThe Company maintains accounts with financial institutions. All cash in checking accounts is non-interest bearing and is fully insured by the Federal Deposit Insurance Corporation (FDIC). At times, cash balances may exceed the maximum coverage provided by the FDIC on insured depositor accounts. The Company believes it mitigates its risk by depositing its cash and cash equivalents with major financial institutions. On June 30, 2022, the Company had $811,429 in excess of FDIC insurance.\nNOTE 5 - OPERATING LEASE RIGHT-OF-USE ASSET AND OPERATING LEASE LIABILITY\nThe Company leases 2,911 square feet of office space located in the Research Park at Florida Atlantic University, Innovation Centre 1, 3998 FAU Boulevard, Suite 309, Boca Raton, Florida. The Company entered into a lease agreement commencing on November 1, 2019 through January 1, 2025 in which the first three months of rent were abated. Due to the COVID-19 pandemic, the company decided to have all employees work from home and intends to build out the office space by the end of 2022 to allow employees to work from the office in January of 2023. The following table illustrates the base rent amounts over the term of the lease:\nBase Rent Periods\nNovember 1, 2019 to October 31, 2020\n$ 4,367\nNovember 1, 2020 to October 31, 2021\n$ 4,498\nNovember 1, 2021 to October 31, 2022\n$ 4,633\nNovember 1, 2022 to October 31, 2023\n$ 4,772\nNovember 1, 2023 to October 31, 2024\n$ 4,915\nNovember 1, 2024 to January 31, 2025\n$ 5,063\nOperating lease right-of-use asset and liability are recognized at the present value of the future lease payments at the lease commencement date. The interest rate used to determine the present value is our incremental borrowing rate, estimated to be 10%, as the interest rate implicit in most of our leases is not readily determinable. Operating lease expense is recognized on a straight-line basis over the lease term. Since the common area maintenance expenses are expenses that do not depend on an index or rate, they are excluded from the measurement of the lease liability and recognized in other general and administrative expenses on the statements of operations. At inception the Company paid prepaid rent in the amount of $4,659, which was netted against the operating lease right-of-use asset balance until it was applied in February 2020.\nRight-of-use asset is summarized below:\nJune 30, 2022\nOffice lease\n$ 220,448\nLess: accumulated amortization\n(92,106 )\nRight -of- use asset, net\n$ 128,342\nOperating lease liability is summarized below:\nJune 30, 2022\nOffice lease\n$ 141,160\nLess: current portion\n(48,963 )\nLong term portion\n92,197\nMaturity of the lease liability is as follows:\nFiscal year ending June 30, 2023\n60,392\nFiscal year ending June 30, 2024\n62,201\nFiscal year ending June 30, 2025\n37,112\n159,705\nPresent value discount\n(18,545 )\nLease liability\n$ 141,160\nNOTE 6 - EXCHANGE AGREEMENT\nOn April 16, 2019, the Company and the members of American Aviation Technologies, LLC (AAT) entered into a Share Exchange Agreement (Agreement). The agreement, which became effective on September 30, 2019, was pursuant to which the Company acquired 100% of the issued and outstanding membership units in exchange for the issuance of shares of the Companys Series A Preferred Stock constituting 86.39% of the total voting power of the Companys capital stock to be outstanding upon closing, after giving effect to the consummation of concurrent debt settlement and other capital stock issuances but before the issuance of shares of capital stock for investor relations purposes. As a result of the Exchange Agreement, AAT became a subsidiary of the Company.\nOn September 30, 2019 just prior to the exchange, the Company issued 170,000 shares of preferred stock as compensation and 193,637 shares of preferred stock in satisfaction of $2,608,224 in liabilities.\nNOTE 7 - CONVERTIBLE NOTES PAYABLE\nThe carrying value of convertible notes payable, net of discount, as of June 30, 2022 and 2021 was $3,936,185 and $158,196, respectively.\nJune 30,\nJune 30,\nConvertible Notes Payable\nConvertible notes payable issued January 5, 2021 (6% interest)\n$ -\n$ 25,000\nConvertible notes payable issued January 11, 2021 (6% interest)\n-\n142,550\nConvertible notes payable issued August 9, 2021 (6% interest)\n-\n-\nConvertible notes payable issued August 10, 2021 (6% interest)\n-\n-\nConvertible notes payable issued October 27, 2021 (0% interest) - Auctus Fund LLC\n6,050,000\n-\nTotal face value\n6,050,000\n167,550\nLess unamortized discount\n(2,113,815 )\n(9,354 )\nCarrying value\n$ 3,936,185\n$ 158,196\nBetween September 27, 2019 and August 10, 2021, the Company issued convertible notes payable with an aggregate face value of $892,300, of which $342,950 were issued by our subsidiary AAT. The notes have a coupon rate of 6% and maturity dates between three and six months. The agreements provided the holder has the option to convert the principal balance and any accrued interest to common stock of the Company. In the event the holder does not elect to convert the note prior to maturity, the note will automatically convert to common stock. Of the $892,300, $342,950 is convertible at $.0033 per share, $87,000 is convertible at $0.025 per share, $180,550 is convertible at $.03 per share, $31,800 is convertible at $0.003 per share, and the remaining $250,000 is convertible at $.06 per share. All these convertible notes payable have been converted as of June 30, 2022 and $167,550 principal balance remaining as of June 30, 2021.\nThe Company evaluated the agreement under ASC 815 Derivatives and Hedging (ASC 815). ASC 815 generally requires the analysis embedded terms and features that have characteristics of derivatives to be evaluated for bifurcation and separate accounting in instances where their economic risks and characteristics are not clearly and closely related to the risks of the host contract. None of the embedded terms required bifurcation and liability classification. However, the Company was required to determine if the debt contained a beneficial conversion feature (BCF), which is based on the intrinsic value on the date of issuance.\nIn connection with the notes, the Company issued warrants indexed to an aggregate 8,848,333 shares of common stock. The warrants have a term of two years and an exercise price of $.025. The Company evaluated the warrants under ASC 815 Derivatives and Hedging (ASC 815) and determined that they did not require liability classification. The warrants were recorded in additional paid-in capital under their aggregate relative fair value of $156,225.\nAuctus Fund, LLC Senior Secured Note\nOn October 27, 2021, the Company issued a convertible note payable with Auctus Fund, LLC (the Auctus Note) with the principal sum of $6,050,000, which amount is the $5,142,500 actual amount of the purchase price, hereof plus an original issue discount in the amount of $907,500 and to pay interest on the unpaid principal amount hereof at the rate of zero percent per annum from the issue date until the note becomes due and payable, and $433,550 for professional fees in completing the transactions. The note has a maturity date of twelve months. The agreement provides the holder has the option to convert the principal balance and any accrued interest to common stock of the Company at a conversion price of lesser of (i) $0.1187 or (ii) 75% of the offering price per share divided by the number of shares of common stock. The Auctus Note is secured by the grant of a first priority security interest in the assets of the Company.\nIn connection with the notes, the Company issued warrants indexed to an aggregate 50,968,828 shares of common stock. The warrants have a term of five years and an exercise price of $0.1187. The warrants were recorded at fair value of $2,777,081 to additional-paid-in-capital in accordance with ASC 815-10 based upon the allocation of the debt proceeds. The Company estimated the fair value of the warrants using a Black-Scholes option-pricing model, which is based, in part, upon subjective assumptions including but not limited to stock price volatility, the expected life of the warrants, the risk-free interest rate and the fair value of the common stock underlying the warrants. The Company estimates the volatility of its stock based on the average of three similar size public companies peer group historical volatility that is in line with the expected remaining life of the warrants. The risk-free interest rate is based on the U.S. Treasury zero-coupon bond for a maturity similar to the expected remaining life of the warrants. The expected remaining life of the warrants is assumed to be equivalent to their remaining contractual term.\nThe Company was required to determine if the debt contained a beneficial conversion feature (BCF), which is based on the intrinsic value on the date of issuance. The Company recorded $2,365,419 conversion feature in additional paid-in capital. The BCF resulted in a debt discount and are amortized over the life of the note.\nThe Company is in communication with Auctus Fund, LLC and is actively working on strategies to extinguish, extend or restructure the Senior Secured Promissory Note. No assurance can be made as to the results of such actions.\nFor the year ended June 30, 2022 and 2021, the Company recorded $4,629,089 and $303,942 in amortization of debt discount related to the notes. For the year ended June 30, 2022 and 2021, the Company recorded $138,943 and $7,409 in interest expense related to the notes, respectively. The balance of this note as of June 30, 2022 was $3,936,185.\nNOTE 8 - RELATED PARTY TRANSACTIONS\nConsulting fees\nDuring the years ended June 30, 2022 and 2021, the Company recorded $184,000 and $98,000 respectively, in consulting fees to Ancient Investments, LLC, a Company owned by the Companys CEO, Keith Duffy and the Companys Executive Director of Corporate Operations, Scott Duffy. As of June 30, 2022 and June 30, 2021, $15,000 and $0 was recorded in accrued liabilities.\nFor the years ended June 30, 2022 and 2021, the Company recorded $122,000 and $40,000 respectively, in consulting fees to Edward DeFeudis, a Director of the Company.\nDuring the years ended June 30, 2022 and 2021, the Company recorded $86,000 and $49,500 respectively, in consulting fees to AMP Web Services, a Company owned by the Companys CTO, Pablo Lavigna. On August 26, 2020, the Company issued 4,090,909 shares of common stock for payment of $13,500 for services performed in May, June and July 2020. As of June 30, 2022 and June 30, 2021, $7,000 and $0 was recorded in accrued liabilities.\nDuring the years ended June 30, 2022 and 2021, the Company recorded $40,425 and $20,000 respectively, in consulting fees to Keystone Business Development Partners, a Company owned by the Companys CFO, Brian Carey. As of June 30, 2022 and June 30, 2021, $0 and $30,000 was recorded in accrued liabilities.\nNOTE 9 - COMMITMENTS AND CONTINGENCIES\nDuring the normal course of business, the Company may be exposed to litigation. When the Company becomes aware of potential litigation, it evaluates the merits of the case in accordance with FASB ASC 450-20-50, Contingencies. The Company evaluates its exposure to the matter, possible legal or settlement strategies and the likelihood of an unfavorable outcome. If the Company determines that an unfavorable outcome is probable and can be reasonably estimated, it establishes the necessary accruals.\nJoint Venture\nIn connection with the Eco-Aero, LLC Joint Venture, discussed in Note 3, the Company has the right to invest up to $10,000,000 into the joint venture.\nFinancial Advisory Agreements\nOn August 10, 2021, the Company entered into an Advisory Agreement with an outside firm to assist the Company with fundraising activities. In connection with the agreement, the Company has the following commitments:\n·\nto issue 500,000 shares payable at the date of the agreement, 500,000 shares payable three months from the date of the agreement, 500,000 shares payable nine months from the date of the agreement.\n·\nPay a financing fee of 1.5% of gross proceeds received by the Company up to $100,000,000; a financing fee of 1.25% of gross proceeds received by the Company from $100,000,000-$200,000,000, and a financing fee of 1% of gross proceeds received by the Company over $200,000,000\n·\nM&A fee of 1.5% of the value of a business or asset sold up to $50,000,000; an M&A fee of 1.25% of value of a business or asset sold from $50,000,000-$100,000,000, an M&A fee of 1% of value of a business or asset sold from $100,000,000-$200,000,000, and an M&A fee of 0.5% of value of a business or asset sold over $200,000,000\nDuring the year ended June 30, 2022, the Company issued all 1,500,000 shares under the agreement.\nOn August 19, 2021, the Company entered into an Advisory Agreement with an outside firm to assist the Company with fundraising activities. In connection with the agreement, the Company has the following commitments:\n·\nIssue 2,225,000 common shares payable at the date of the agreement, and 2,225,000 common shares payable upon an uplisting of the Companys common stock to a national exchange.\n·\nPay a cash fee of seven percent 7% of the amount of capital raised, invested or committed; and deliver a warrant (the Agent Warrant) to purchase shares of the Common Stock equal to seven percent (7%) of the number of shares of Common Stock underlying the securities issued in the Financing.\n·\nPay a cash fee for entering into a transaction including, without limitation, a merger, acquisition or sale of stock or assets equal to one- and one-half percent (1.5%), or in the event a transaction is consummated with a party that was in communication with the Company prior to the date of this contract, then the fee shall equal one half percent (0.5%).\nDuring the year ended June 30, 2022, the Company issued the initial 2,225,000 shares.\nLitigation\nOn September 1, 2021, Xeriant Inc. brought a cause of action in the Southern District of Florida against a former shareholder for claims, including but not limited to, breach of contract, misrepresentation, and asserting claims to recoup monetary and in-kind distributions made to the shareholder by the Company. The defendant submitted an affirmative defense and counterclaim on October 29, 2021.\nBoard of Advisors Agreements\nThe Company has entered into advisor agreements with various advisory board members. The agreements provide for the following:\nOn October 27, 2020, the Company agreed to issue 300,000 common shares immediately, 2-year cashless warrants to purchase 300,000 common shares at the current price, and $2,500 per meeting paid 50% in cash and 50% in common shares.\nOn January 18, 2021, the Company agreed to issue 50,000 common shares, two-year cashless warrants to purchase 25,000 common shares at the current price, and $2,500 per meeting paid in cash, common shares, or a combination.\nOn January 22, 2021, the Company agreed to issue 50,000 common shares, two-year cashless warrants to purchase 25,000 common shares at the current price, and $2,500 per meeting paid in cash, common shares, or a combination.\nOn March 7, 2021 the Company paid an advisor $2,500 and issued 50,000 common shares.\nOn July 1, 2021, the Company agreed to issue 100,000 common shares, and $2,500 per meeting paid in cash, common shares, or a combination, an additional bonus of $25,000 paid in common shares issued at the end of each year of service, an option to purchase 5,000,000 common shares at $0.12 per share, vesting quarterly over 24 months, and for each of the following three years (beginning July 1, 2022), an option to purchase an additional 1,000,000 common shares per year thereafter at a 25% discount to the average market price for the preceding 10 trading days.\nOn July 6, 2021, provided an option to purchase 5,000,000 common shares at $0.12 per share, vesting quarterly over 24 months, a bonus of 250,000 common shares issued upon a strategic partnership with a major airline, $2,500 per formal meeting paid in common shares, and an additional bonus of $25,000 paid in common shares issued at the end of each year of service.\nOn July 28, 2021, the Company agreed to issue 250,000 common shares immediately, an option to purchase 5,000,000 common shares at $0.12 per share, vesting quarterly over 24 months, a bonus of 5,000,000 common shares for bringing in a strategic partner that significantly strengthens the Companys market position, $2,500 per formal meeting paid in cash, common shares or a combination, and an additional bonus of $25,000 paid in common shares issued at the end of each year of service\nOn August 9, 2021, the Company agreed to issue 50,000 common shares, $2,500 per meeting paid in cash, common shares, or a combination, and an additional bonus of $25,000 paid in common shares issued at the end of each year of service.\nOn August 20, 2021, the Company agreed to issue 100,000 common shares, and $2,500 per meeting paid in cash, common shares, or a combination, an additional bonus of $25,000 paid in common shares issued at the end of each year of service, an option to purchase 4,000,000 common shares at $0.12 per share, vesting quarterly over 24 months.\nOn January 20, 2022, the Company agreed to issue 250,000 common shares, and $5,000 paid on a monthly basis, for a period of three months, and an option to purchase 2,250,000 common shares at $0.12 per share, vesting immediately.\nOn March 28, 2022, the Company agreed to issue 150,000 common shares vested monthly over one year, and $2,500 per meeting paid in cash, and additional bonus of $25,000 paid in common shares issued at the end of each year of service.\nNOTE 10 - EQUITY\nCommon Stock\nAs of June 30, 2022 and June 30, 2021, the Company had 5,000,000,000 shares of common stock authorized with a par value of $0.00001. There were 365,239,001 and 292,815,960 shares issued and outstanding as of June 30, 2022 and June 30, 2021, respectively.\nFiscal Year 2021 Issuances\nOn July 30, 2020, the Company issued 16,011,818 shares of common stock related to conversions of debt from the previous fiscal year, which were previously recorded in common stock to be issued.\nOn August 26, 2020, the Company issued 4,090,909 shares of common stock for payment of $13,500 for services performed in May, June and July 2020. The shares were valued at $200,454 or $0.049 per share. As of result the Company recorded a loss on settlement in debt in the amount of $186,954.\nOn September 8, 2020, the Company issued 96,835,648 shares of common stock related to conversions of debt from the previous fiscal year, which were previously recorded in common stock to be issued.\nOn October 30, 2020, the Company issued 300,000 shares of common stock to an advisory board member for services. The shares were valued at $13,200 or $0.044 per share.\nOn November 17, 2020, the Company sold 1,700,000 shares of common for $25,500, or $0.015 per share.\nOn November 24, 2020, the Company sold 1,700,000 shares of common for $25,500, or $0.015 per share.\nOn December 1, 2020, the Company issued 2,000,000 shares of common stock for investment relation services valued at $100,000, or $0.05 per share.\nOn December 1, 2020, the Company issued 18,000,000 shares of common stock for investment relation services valued at $900,000, or $0.05 per share.\nOn January 29, 2021, the Company issued 50,000 shares of common stock to an advisory board member for services. The shares were valued at $25,500 or $0.51 per share.\nOn February 9, 2021, the Company issued 19,595,442 shares of common stock for the conversion of $127,150 in principal and $2,709 in accrued interest.\nIn March of 2021, the Company sold 12,075,001 shares of common for $1,497,000, or $0.12 per share.\nOn March 22, 2021, the Company issued 50,000 shares of common stock to an advisory board member for services. The shares were valued at $13,800 or $0.28 per share.\nOn March 22, 2021, the Company issued 50,000 shares of common stock to an advisory board member for services. The shares were valued at $22,750 or $0.46 per share.\nOn March 22, 2021, the Company issued 4,557,943 shares of common stock for the conversion of $23,000 in principal and $853 in accrued interest.\nOn April 26, 2021, the Company issued 1,014,798 shares of common stock for the conversion of $30,000 in principal and $444 in accrued interest.\nOn May 7, 2021, the Company sold 833,333 shares of common for $100,000, or $0.12 per share.\nDuring the year ended June 30, 2021, certain holders of preferred stock converted 44,367 shares into 44,366,919 shares of common stock.\nFiscal Year 2022 Issuances\nDuring the year ended June 30, 2022 in connection with one of the subscription agreements, the Company issued 250,000 shares as an equity kicker valued at $43,753, which has been expensed as a financing costs.\nDuring the year ended June 30, 2022, the Company issued 4,308,600 shares of common stock as a result of warrant exercises in the aggregate proceeds of $128,550.\nDuring the year ended June 30, 2022, the Company issued 4,685,615 shares of common stock for services, valued at $761,954.\nDuring the year ended June 30, 2022, the Company sold 39,366,666 shares of common stock for aggregate proceeds of $2,078,500.\nDuring the year ended June 30, 2022, the Company issued 7,138,000 shares of common stock in exchange for the conversion of 7,138 shares of Series A Preferred Stock.\nDuring the year ended June 30, 2022, the Company issued 10,598,544 shares of common stock for the conversion of $167,550 in principal and $4,985 in accrued interest. This resulted in a loss on extinguishment of debt in the amount of $535.\nDuring the year ended June 30, 2022, the Company issued 4,229,680 shares of common stock for the conversion of $250,000 principal balance of convertible notes payable and $3,749 accrued interest.\nDuring the year ended June 30, 2022, the Company issued 845,936 shares of common stock in exchange for the inducement to the convertible notes holders to convert at fair value of $134,927.\nCommon Stock to be Issued\nDuring the year ended June 30, 2022, the Company sold 200,000 shares of common stock for aggregate proceeds of $6,000, or $0.03 per share. As of June 30, 2022, these shares are categorized in common stock to be issued.\nDuring the year ended June 30, 2022, the Company agreed to pay a consultant 250,000 shares in exchange to $45,950 in services. As of June 30, 2022, these shares are categorized in common stock to be issued.\nNOTE 10 - EQUITY (CONTINUED)\nSeries A Preferred Stock\nThere are 100,000,000 shares authorized as preferred stock, of which 3,500,000 are designated as Series A Preferred Stock having a par value of $0.00001 per share. The Series A preferred stock has the following rights:\n·\nVoting: The preferred shares shall be entitled to 100 votes to every one share of common stock.\n·\nDividends: The Series A Preferred Stockholders are treated the same as the Common Stock holders except at the dividend on each share of Series A Convertible Preferred Stock is equal to the amount of the dividend declared and paid on each share of Common Stock multiplied by the Conversion Rate.\n·\nConversion: Each share of Series A Preferred Stock is convertible, at the option of the holder thereof, at any time into shares of Common Stock on a 1:1,000 basis.\n·\nThe shares of Series A Preferred Stock are redeemable at the option of the Corporation at any time after September 30, 2022 upon not less than 30 days written notice to the holders. It is not mandatorily redeemable.\nAs of June 30, 2022 and 2021, the Company has 781,132 and 788,270 shares of Series A Preferred Stock issued and outstanding, respectively.\nOn February 15, 2021, in accordance with Florida Law and conversations with counsel, the Board of Directors of the Company rescinded 990,000 Series A Preferred Shares, which represented all preferred shares issued to one of the shareholders in the Share Exchange between American Aviation Technologies, LLC and Xeriant, Inc. entered into on April 19, 2019, due to breach of contract.\nDuring March of 2021, the remaining former members of American Aviation Technologies, LLC agreed to allow the Company to rescind an aggregate of 1,250,001 of their 1,760,000 Series A Preferred Shares issued pursuant to the Share Exchange between American Aviation Technologies, LLC and Xeriant, Inc., as a result of said breach. As a result of the cancellation, the Company reduced the investment in AAT by the value of these preferred shares.\nOn March 27, 2021, Spider Investments, LLC returned 41,000 Series A Preferred Shares to the treasury of the Company.\nSeries B Preferred Stock\nOn March 25, 2021, the Certificate of Designation for the Series B Preferred was recorded by the State of Nevada. There are 100,000,000 shares authorized as preferred stock, of which 1,000,000 are designated as Series B Preferred Stock having a par value of $0.00001 per share. The Series B preferred stock is not convertible, does not have any voting rights and no liquidation preference.\nDuring the year ended June 30, 2021, the Company issued 1,000,000 shares of Series B Preferred Stock to the Companys CEO as part of his employment agreement.\nNOTE 11 - NON-CONTROLLING INTEREST\nAAT membership unit adjustment\nOn May 12, 2021, on further advice of counsel and in good faith, the Company returned 3,600,000 membership units of American Aviation Technologies, LLC to a former shareholder, which was his consideration provided in the Share Exchange between American Aviation Technologies, LLC and Xeriant, Inc. As a result, this former shareholder was restored to his original shareholding position in American Aviation Technologies, LLC.\nAAT Subsidiary\nOn May 12, 2021, the Companys position in American Aviation Technologies, LLC was reduced to 64%, and therefore the subsidiary is now classified as majority owned.\nStock Options\nIn connection with certain advisory board compensation agreements, the Company issued an aggregate 21,250,000 options at an exercise price of $0.12 per share for the year ended June 30, 2022. These options vest quarterly over twenty-four months and have a term of three years. The grant date fair value was $3,964,207. The Company recorded compensation expense in the amount of $3,248,181 for these options for the year ended June 30, 2022. As of June 30, 2022, there was $702,166 of total unrecognized compensation cost related to non-vested portion of options granted.\nAs of June 30, 2022, there are 21,250,000 options outstanding, of which 9,375,000 are exercisable. The weighted average remaining term is 2.1 years.\nA summary of the Companys stock options activity is as follows:\nNumber of Options\nWeighted-\nAverage Exercise Price\nWeighted-\nAverage Contractual Term\n(in years)\nAggregate Intrinsic Value\nOutstanding at June 30, 2021\n-\n$ -\nGranted\n21,250,000\n0.12\nExercised\n-\n-\nCanceled\n-\n-\nOutstanding at June 30, 2022\n21,250,000\n$ 0.12\n2.1\n$ -\nExercisable at June 30, 2022\n9,375,000\n$ 0.12\n2.1\n$ -\nSignificant inputs and results arising from the Black-Scholes process are as follows for the options:\nQuoted market price on valuation date\n$0.169 - $0.23\nExercise prices\n$0.12\nRange of expected term\n1.55 Years - 2.49 Years\nRange of market volatility:\nRange of equivalent volatility\n215.12% - 275.73%\nRange of interest rates\n0.20% - 0.47%\nWarrants\nAs of June 30, 2022 and June 30, 2021, the Company had 55,512,161 and 8,848,333 warrants outstanding, respectively. The warrants were issued in connection with the Convertible Notes (See Note 6). The warrants have a term of two to five years and an exercise price range from $0.1187 to $.025. The Company evaluated the warrants under ASC 815 Derivatives and Hedging (ASC 815) and determined that they did not require liability classification. The warrants were recorded in additional paid-in capital under their aggregate relative fair value of $2,777,081. During the year ended June 30, 2022, holders of warrants exercised warrants for 4,305,000 shares of common stock for aggregate proceeds of $128,550. As of June 30, 2022, the weighted average remaining useful life of the warrants was 4.0.\nA summary of the Companys stock warrants activity is as follows:\nNumber of Warrants\nWeighted-\nAverage Exercise Price\nWeighted-\nAverage Contractual Term\n(in years)\nAggregate Intrinsic Value\nOutstanding at June 30, 2021\n8,848,333\n$ 0.03\n0.94\n-\nGranted\n50,968,828\n0.1187\n4.6\n-\nExercised\n(4,305,000 )\n-\nCanceled\n-\n-\nOutstanding at June 30, 2022\n55,512,161\n$ 0.111\n4.0\n$ -\nVested and expected to vest at June 30, 2022\n55,512,161\n$ 0.111\n4.0\n$ -\nExercisable at June 30, 2022\n55,512,161\n$ 0.111\n4.0\n$ -\nNOTE 12 - INCOME TAXES\nThe Company accounts for income taxes in accordance with the provisions of FASB ASC 740, Accounting for Uncertainty in Income Taxes. Deferred taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nAt June 30, 2022 and 2021, the significant components of the deferred tax assets are summarized below:\nDeferred income tax asset\nNet operating loss carryforwards\n$ 5,860,409\n3,237,960\nBook to tax differences in intangible assets\n-\nTotal deferred income tax asset\n5,860,409\n3,237,960\nLess: valuation allowance\n(5,860,409 )\n(3,237,960 )\nTotal deferred income tax asset\n$ -\n$ -\nThe Company periodically evaluates the likelihood of the realization of deferred tax assets and adjusts the carrying amount of the deferred tax assets by the valuation allowance to the extent the future realization of the deferred tax assets is not judged to be more likely than not. The Company considers many factors when assessing the likelihood of future realization of its deferred tax assets, including its recent cumulative earnings experience by taxing jurisdiction, expectations of future taxable income or loss, the carryforward periods available to the Company for tax reporting purposes, and other relevant factors.\nFuture changes in the unrecognized tax benefit will have no impact on the effective tax rate due to the existence of the valuation allowance. The Company estimates that the unrecognized tax benefit will not change significantly within the next twelve months. The Company will continue to classify income tax penalties and interest as part of general and administrative expense in its consolidated statements of operations. There were no interest or penalties accrued as of June 30, 2022.\nNOTE 13 - SUBSEQUENT EVENTS\nEffective August 1, 2022, the Company entered into an Amendment to Senior Secured Promissory Note (the Amendment) with Auctus Fund, LLC (Auctus) pursuant to which the parties agreed to amend the Companys Senior Secured Convertible Promissory Note in the principal amount of $6,050,000 dated October 27, 2021 (the Note) issued to Auctus. The Amendment (i) extended the maturity date of the Note to November 1, 2022 and (ii) extended the dates for the completion of the acquisition of XTI Aircraft and the uplist of the Companys common stock to a national securities exchange to November 1, 2022. In consideration of the Amendment, the Company agreed to (i) grant to Auctus a new Warrant to purchase 25,000,000 shares of Common Stock dated July 26, 2022 (the Warrant) at an exercise price of $0.09 per share; (ii) make a prepayment of the Note in the amount of $100,000; and (iii) cause a director of the Company to cancel his 10b-5(1) Plan.\nIn July 2022, the Company issued 1,000,000 shares of common stock in exchange for the conversion of 1,000 shares of Series A Preferred Stock.\nIn July 2022, the Company issued 457,143 shares to a consultant for services. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nEffective December 4, 2019, the Company engaged BF Borgers CPA P.C. (BF), as the Companys independent registered public accounting firm. The engagement was approved by the Companys Board of Directors. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nOur management is responsible for maintaining disclosure controls and procedures that are designed to ensure that information required to be disclosed in the reports that the Registrant files or submits under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC's rules and forms. In addition, the disclosure controls and procedures must ensure that such information is accumulated and communicated to the Registrant's management, including its Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required financial and other required disclosures.\nAt June 30, 2022, an evaluation of the effectiveness of our disclosure controls and procedures (as defined in Rules 13(a)-15(e) and 15(d)-15(e) of the Exchange Act) was carried out under the supervision and with the participation of Keith Duffy our Chief Executive Officer and Brian Carey our Chief Financial Officer. Based on his evaluation of our disclosure controls and procedures, he concluded that at June 30, 2022, our disclosure controls and procedures are not effective due to material weaknesses in our internal controls over financial reporting discussed directly below.\nManagement's Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over our financial reporting. Internal control over financial reporting is a process designed to provide reasonable assurance to our management and board of directors regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. GAAP.\nOur internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements; (iii) provide reasonable assurance that receipts and expenditures of company assets are made in accordance with management authorization; and (iv) provide reasonable assurance that unauthorized acquisition, use or disposition of Company assets that could have a material effect on our financial statements would be prevented or detected on a timely basis.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because changes in conditions may occur or the degree of compliance with the policies or procedures may deteriorate.\nOur management has conducted an evaluation, under the supervision and with the participation of Keith Duffy our Chief Executive Officer and Chief Financial Officer of the effectiveness of our internal control over financial reporting as of June 30, 2022. This evaluation was based on criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission, or COSO, Internal Control-Integrated Framework. Based upon such assessment, Keith Duffy concluded that our internal controls over financial reporting are not effective due to material weaknesses in our internal controls over financial reporting. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the Company's annual or interim financial statements will not be prevented or detected on a timely basis. Our material weaknesses relate to the following:\n·\nLack of a full-time Chief Financial Officer. We do not have a dedicated full-time Chief Financial Officer in charge of our financial reporting. Financial reporting is performed by our Chief Executive Officer and Chief Financial Officer, Keith Duffy. Mr. Duffy does not possess accounting expertise.\n·\nLack of formal review process. We do not possess a formal, multi-level process with respect to our financial reporting.\n·\nIneffective oversight. We do not have an audit committee comprised of independent directors to oversee our financial reporting and internal control over financial reporting.\nThese weaknesses are due to the Company's historical lack of working capital to hire a full-time, dedicated Chief Financial Officer. The Company plans to hire a full-time Chief Financial Officer. Further, the Company intends to appoint additional Directors and form an audit committee comprised of independent directors.\nThis Report shall not be deemed to be filed for purposes of Section 18 of the Exchange Act, or otherwise subject to the liabilities of that section, and is not incorporated by reference into any filing of the Registrant, whether made before or after the date hereof, regardless of any general incorporation language in such filing.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. The rules of the Securities and Exchange Commission do not require an attestation of the Management's report by our registered public accounting firm in this annual report.\nChanges in Internal Controls\nThere have been no changes in our internal control over financial reporting that occurred during the fourth quarter of our fiscal year ended June 30, 2022 that have materially affected, or are reasonable likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nDirectors and Executive Officers of Xeriant, Inc.\nThe following sets forth information about our directors and executive officers:\nName\nAge\nPosition\nKeith Duffy\nChairman of the Board and CEO\nScott Duffy\nExecutive Director\nEdward C. DeFeudis\nDirector\nPablo Lavigna\nChief Information Officer\nBrian Carey\nChief Financial Officer\nKeith Duffy, Chairman of the Board and CEO\nMr. Duffy has over thirty years of experience in investment banking, management, finance, strategic planning and operations, and has been a principal in a number of start-up companies. He arranged the merger of American Aviation Technologies with a public company and established the relationship with Florida Atlantic University (FAU), preparing the white paper that was presented to the Research Park at FAU Authority. He was formerly the founder and CEO of a public company and the founder and CEO of two bank holding companies, a software development company and a biotech company now trading on NASDAQ. Mr. Duffy trained to be a private pilot when he was 16 years old and worked at an FBO at the Palm Beach International Airport after college to further his knowledge of the aviation industry. He has held a variety of management, accounting, and finance positions over the years. He has been a licensed securities broker and currently holds a real estate license and a NMLS mortgage brokers license in Florida. He has also served on the Florida Bar Grievance Committee. Mr. Duffy attended Wake Forest University and Rollins College, where he earned a B.A. Degree in Business Administration and Mathematics in 1982.\nScott M. Duffy, Executive Director, Corporate Operations\nScott Duffy has over thirty years of experience in management, operations, strategic planning, information technology, statistical analysis, marketing and promotion, and sales development. He has collaborated with his brother Keith over many years to develop plans and research for a wide range of start-up companies, including American Aviation Technologies and the Halo project. As Senior Vice President, Operations and Administration at Globe Marketing Services, he was responsible for planning and coordinating the activities of internal management and the support staff to meet corporate objectives. As Newsstand Circulation Director at American Media, one of the largest publishers in North America, he was responsible for the $545 million retail sales division, overseeing both international and domestic distribution. Over his career he has been instrumental in increasing profitability though optimizing core competencies. Mr. Duffy was a co-founder and principal in a number of real estate development projects beginning in 2006. Mr. Duffy trained to be a private pilot when he was 16 years old and has always been interested in aviation. He attended Wake Forest University and Rollins College, where he earned a B.A. in Business Administration and Mathematics in 1982.\nEdward C. DeFeudis, Director\nMr. DeFeudis is a venture investor and serial entrepreneur spanning multiple industries. His investments focus on late seed, bridge, and Series A rounds. He understands complex disruptive technology and enjoys finding rare opportunities that create first mover advantage. Mr. DeFeudis is a financial professional who has served on the executive management team and board of directors of several early-stage companies. He has structured and secured multiple financings while serving as point person to investors, funds, and investments banks, which has led to hundreds of millions of dollars in capital formation. He is extremely detail oriented and understands complex legal positioning.\nPablo Lavigna, Chief Information Officer\nPablo Lavigna has over twenty years of experience in the Information Technology and Software Engineering field. He developed extensive experience as Director of Information Technology operations at a private firm. Mr. Lavigna has developed and implemented network security procedures and developed software for multiple industries. He holds several Microsoft and CompTIA certifications including Microsoft Certified System Engineer (MCSE), Microsoft Certified System Administrator (MCSA), and Microsoft Certified Professional (MCP), and CompTIA Security+. Mr. Lavigna attended Florida International University where he earned his degree in Information Technology and Business with Magna Cum Laude Honors.\nBrian Carey, Chief Financial Officer\nBrian Carey is an entrepreneur and business development specialist who built and ran a successful accounting, tax and business management firm for over 30 years. He started a financial management/insurance and investment firm in 1984, then expanded it to add accounting, tax preparation and business planning and management services in 1986 called Carey Associates Accounting and Tax Services. More recently, Mr. Carey was the owner and manager of BCGR Tax and Financial Services. This company also provides business start-up and development services to a limited number of client/partner companies. He holds a Bachelor of Accounting Degree from Penn State University.\nDirector Independence\nWe are not currently a listed company under SEC rules and are therefore not required to have a Board comprised of a majority of independent directors or separate committees comprised of independent directors.\nDirector Independence; Standing Committees\nThe Company had two independent directors, including Michael Harper and Lisa Ruth, as defined under the Nasdaq Stock Markets listing standards, who joined the Board effective May 2021. Both resigned effective May 12, 2022 upon completed their one-year term serving as directors of the Company. Their resignations were anticipated and not as a result of any disagreement with the Company on any matter relating to the Companys operations, policies or practices. The Company anticipates replacing these directors with qualified individuals in the new fiscal year.\nThe Companys common stock is traded on OTCQB under the symbol XERI. The OTCQB trading platform does not maintain any standards regarding the independence of the directors for our Board of Directors, and we are not otherwise subject to the requirements of any national securities exchange or an inter- dealer quotation system with respect to the need to have a majority of our directors be independent.\nThe Companys Board presently has no functioning standing committees.\nBoard Leadership Structure and Role in Risk Oversight\nAlthough we have not adopted a formal policy on whether the Chairman and Chief Executive Officer should be separate or combined, we have traditionally determined that it is in the best interests of the Company and its shareholders to combine these roles due to the small size and early stage of the Company\nFamily Relationships\nKeith Duffy, Chairman and CEO, and Scott Duffy, Executive Director, are brothers.\nBoard Committees\nAudit Committee\nWe do not have a separately designated audit committee of the board. Audit committee functions are performed by our board of directors. None of our directors are deemed independent. Two directors also hold positions as our officers. Our Board of Directors is responsible for: (1) selection and oversight of our independent accountant; (2) establishing procedures for the receipt, retention and treatment of complaints regarding accounting, internal controls and auditing matters; (3) establishing procedures for the confidential, anonymous submission by our employees of concerns regarding accounting and auditing matters; (4) engaging outside advisors; and, (5) funding for the outside auditory and any outside advisors engagement by the audit committee.\nNominees\nThere have been no material changes to the procedures by which security holders may recommend nominees to the Registrant's board.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934 requires our directors, executive officers and beneficial owners of more than 10% of our common stock to file with the SEC reports of their holdings of, and transactions in, our common stock. Based solely upon our review of copies of such reports and written representations from reporting persons that were provided to us, we believe that our officers, directors and 10% stockholders complied with these reporting requirements with respect to our fiscal year ended June 30, 2022.\nCode of Ethics\nThe Registrant has adopted a corporate code of ethics. The Registrant believes its code of ethics is reasonably designed to deter wrongdoing and promote honest and ethical conduct; provide full, fair, accurate, timely and understandable disclosure in public reports; comply with applicable laws; ensure prompt internal reporting of code violations; and provide accountability for adherence to the code. Item 11. Executive Compensation.\nFor the year ended June 30, 2022, no director or executive officer has received compensation from the Registrant pursuant to any compensatory or benefit plan. There is no plan or understanding, express or implied, to pay any compensation to any director or executive officer pursuant to any compensatory or benefit plan, although we anticipate that we will compensate our officers and directors for services to us with stock or options to purchase stock, in lieu of cash.\nExecutive Compensation Policies as They Relate to Risk Management\nManagement have considered whether our compensation policies might encourage inappropriate risk taking by the Company's executive officers and other employees. The Compensation Committee has determined that the current compensation structure aligns the interests of the executive officers with those of the Company without providing rewards for excessive risk taking by awarding a mix of fixed and performance based or discretionary bonuses with the performance- based compensation focused on profits as opposed to revenue growth.\nOption Exercises and Fiscal Year-end Option Value Table\nNone of the named executive officers exercised any stock options during the year ended June 30, 2022 or held any outstanding stock options as of June 30, 2022.\nIncentive Plan\nThe Registrant does not have any equity compensation plans.\nEmployment Agreements\nOn February 19, 2021, the Company executed an employment agreement with Keith Duffy to act as the Chief Executive Officer of the Company and AAT, with an annual base salary of $180,000 (subject to increases at the discretion of the Board of Directors) and the issuance of 1,000,000 Series B Preferred Shares.\nConsulting Agreements\nNone, although some of the officers are currently paid as consultants of the Company. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters. Security Ownership\nThe table below sets forth as of June 30, 2022, information with respect to beneficial ownership of the Companys common stock by:\n·\nEach person known to the Company to own beneficially more than 5% of our outstanding common stock, either before or immediately after the merger.\n·\nEach of the post-Merger directors and executive officers of the Company.\n·\nAll of our post-Merger directors and executive officers as a group.\nBeneficial ownership is determined in accordance with the rules of the Securities and Exchange Commission. Shares of common stock subject to any warrants or options that are presently exercisable or exercisable within 60 days of June 30, 2022, are deemed outstanding for the purpose of computing the percentage ownership of the person holding the warrants or options but are not treated as outstanding for the purpose of computing the percentage ownership of any other person. The numbers reflected in the percentage ownership columns are based on a fully diluted basis of the Companys common stock outstanding after a conversion of the Series A Preferred Stock into Common Shares. The persons named in the table have sole voting and sole investment power with respect to all shares beneficially owned, subject to community property laws where applicable.\nNumber of Shares of Common Stock\nNumber of Series A Preferred Stock\nTotal Fully Diluted Shares\nPercentage Represented on a Fully Diluted Basis\nName of Beneficial Owner\nMicha Holdings, LLC (1)\n1,000,000\n97,000\n98,000,000\n8.56 %\nAncient Investments, LLC (2)\n200,000\n200,000,000\n17.46 %\nBasil Consulting, LLC (3)\n2,632,853\n96,862\n99,494,853\n8.69 %\nChristopher Sawchuk\n21,927,637\n100,000\n121,927,637\n10.65 %\nSpider Investments, LLC (4)\n2,667,130\n77,000\n79,667,130\n6.96 %\nPablo Lavigna (5)\n13,454,545\n13,454,545\n1.17 %\nBrian Carey (6)\n203,025\n203,025\n0.02 %\nAll directors and executive officers as a group (four persons)\n293,657,570\n25.61 %\nTotal shares\n365,239,001\n780,132\n1,145,371,001\n(1)\nAlberto Silva has control and dispositive power over Micha Holdings, LLC and is the beneficial owner of Micha Holdings, LLC.\n(2)\nKeith Duffy is the Chairman and Chief Executive Officer of the Company, and is a beneficial owner of Ancient Investments, LLC.\n(3)\nCameron Cox is the beneficial owner or Basil Consulting, LLC.\n(4)\nEdward C. DeFeudis is a Director of the Company and has control and dispositive power over Spider Investments, LLC and is the beneficial owner of Spider Investments, LLC.\n(5)\nPablo Lavigna is the Chief Information Officer of the Company and the beneficial owner of these shares, which are under his personal name and his company, AMP Web Services, LLC.\n(6)\nBrian Carey is the Chief Financial Officer of the Company. Item 13. Certain Relationships and Related Transactions, and Director Independence\nOn August 25, 2020, the Company issued a convertible note payable with a face value of $5,000 with a coupon rate of 6% to Keystone Business Development Partners, a Company owned by the Companys CFO, Brian Carey. The note has a maturity date of three months. The agreement provides the holder has the option to convert the principal balance and any accrued interest to common stock of the Company at a conversion price of $.025 per share. In the event the holder does not elect to convert the note prior to maturity, the note will automatically convert to common stock at a price of $.025 per share. The note was converted into 203,025 common shares on November 25, 2020, which were issued on February 8, 2021.\nDirector Independence\nWe are not currently a listed company under SEC rules and are therefore not required to have a Board comprised of a majority of independent directors or separate committees comprised of independent directors. We currently do not have any independent directors as the term independent is defined by the rules of the Nasdaq Stock Market. Item 14. Principal Accounting Fees and Services.\nThe following is a summary of the fees billed to us by BF Borgers CPA, PC for professional services rendered for the fiscal year ended June 30, 2022 and 2021:\nFiscal Year Ended\nJune 30, 2022\nJune 30, 2021\nAudit Fees\n$ 64,300\n$ 34,900\nAudit Related Fees\n-\n-\nTax Fees\n-\n-\nAll Other Fees\n-\n-\n$ 64,300\n$ 34,900\nAudit Fees. Consists of fees billed for professional services rendered for the audit of our consolidated financial statements and review of interim consolidated financial statements included in quarterly reports and services that are normally provided in connection with statutory and regulatory filings or engagements.\nAudit Related Fees. Consists of fees billed for assurance and related services that are reasonably related to the performance of the audit or review of our consolidated financial statements and are not reported under Audit Fees.\nTax Fees. Consists of fees billed for professional services for tax compliance, tax advice and tax planning. These services include preparation of federal and state income tax returns.\nAll Other Fees. Consists of fees for product and services other than the services reported above. Board of Directors' Pre-Approval Policies\nOur Board of Directors' policy is to pre-approve all audit and permissible non-audit services provided by the independent auditors. These services may include audit services, audit related services, tax services, and other services. Pre-approval is generally provided for up to one year, and any pre-approval is detailed as to the particular service or category of services and is generally subject to a specific budget. The independent auditors and management are required to periodically report to the Board of Directors regarding the extent of services provided by the independent auditors in accordance with this pre-approval and the fees for the services performed to date. The Board of Directors may also pre-approve particular services on a case-by-case basis.\nOur Board of Directors has reviewed and discussed with BF Borgers CPA P.C. (BF), our audited consolidated financial statements contained in this Annual Report on Form 10-K for the fiscal years ended June 30, 2022 and 2021. The Board of Directors also has discussed with BF the matters required to be discussed pursuant to SAS No. 61 (Codification of Statements on Auditing Standards, AU Section 380), which includes, among other items, matters related to the conduct of the audit of our consolidated financial statements.\nBased on the review and discussions referred to above, the Board of Directors determined that the audited consolidated financial statements be included in our Annual Report on Form 10-K for our fiscal year ended June 30, 2022 for filing with the SEC. Item 15. Exhibits\nExhibit\nNumber\nDocument\n3.1\nArticles of Incorporation for Eastern World Solutions, Inc. dated December 18, 2009 (incorporated by reference to Exhibit 3.1 to Current Report on Form S-1 dated January 25, 2010.\n3.2\nByLaws of Eastern World Solutions, Inc. (incorporated by reference to Exhibit 3.2 to Current Report on Form S-1 dated January 25, 2010.\n3.3\nCertificate of Designation of Series A Preferred shares effective September 30, 2019.\n3.4\nCertificate of Designation of Series B Preferred shares effective February 22. 2021.\n10.1\nExchange Agreement by and among Banjo & Matilda, Inc. American Aviation Technologies, LLC, and the Members of American Aviation Technologies, LLC (incorporated by reference to Exhibit 10.1 to Current Report on Form 8-K filed on April 23, 2019.\n10.2\nEmployment Agreement for Keith Duffy dated February 19, 2021 (incorporated by reference to Exhibit 10.6 to Current Report on Form 10-K/A dated October 15, 2021).\n10.3\nJoint Venture Agreement dated May 31, 2021, by and between Xeriant, Inc. and XTI Aircraft (incorporated by reference to Exhibit 2.1 to Current Report on Form 8-K filed on June 9, 2021, with redactions).\n10.4\nSenior Secured Promissory Note (incorporated by reference to Exhibit 4.1 to Current Report on Form 8-K filed on November 4, 2021).\n10.5\nWarrant (incorporated by reference to Exhibit 4.2 to Current Report on Form 8-K filed on November 4, 2021).\n10.6\nSecurity Agreement (incorporated by reference to Exhibit 10.1 to Current Report on Form 8-K filed on November 4, 2021).\n10.7\nAmendment to Secured Promissory Note (incorporated by reference to Current Report on Form 8-K filed on August 3, 2022).\n10.8\nJoint Venture Agreement dated as of April 2, 2022 between Xeriant Inc. and Movychem S.R.O. (incorporated by reference to Exhibit 10.1 to the Form 10--Q filed on May 16, 2022).\n10.9\nPatent and Exclusive License Agreement between Movychem S.R.O. and (incorporated by reference to Exhibit 10.2 to the Form 10--Q filed on May 16, 2022).\n10.10\nServices Agreement between Ebenberg, LLC and Xeriant, Inc. dated as of April 2, 2022 (incorporated by reference to Exhibit 10.3 to the Form 10-Q filed on May 16, 2022).\n14.1\nCode of Ethics (incorporated by reference to Exhibit 14.1 to the Form 10-K filed on February 15. 2011.\n31.1\nCertification of the principal executive officer pursuant to Rule 13a-14(a) or 15d-14(a) under the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of the principal financial officer pursuant to Rule 13a-14(a) or 15d-14(a) under the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification of the principal executive officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification of the principal financial officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema\n101.CAL\nXBRL Taxonomy Extension Calculation\n101.DEF\nXBRL Taxonomy Extension Definition\n101.LAB\nXBRL Taxonomy Extension Label\n101.PRE\nXBRL Taxonomy Extension Presentation\nSIGNATURES\nIn accordance with the requirements of the Exchange Act, the Company caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nXERIANT, INC.\nDate: October 7, 2022 By: /s/ Keith Duffy\nKeith Duffy\nChief Executive Officer (Principal Executive)\nDate: October 7, 2022\nBy:\n/s/ Brian Carey\nBrian Carey\nChief Financial Officer"
}