{
    "cik": "1482554",
    "company": "Hartford Great Health Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-11-14",
    "period_of_report": "2022-07-31",
    "sic": "7374",
    "state_of_inc": "NV",
    "state_location": "CA",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1482554/0001493152-22-031843-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1482554/000149315222031843/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1482554/0001493152-22-031843.txt",
    "filename": "1482554_10K_2022_0001493152-22-031843.htm",
    "content": "ITEM 1. BUSINESS.\nGeneral\nHartford Great Health Corp. (the Company, Hartford we, us or our) was incorporated in the State of Nevada on April 2, 2008 (Inception) under the name PhotoAmigo, Inc. It changed its name to Hartford Great Health Corp. on August 20, 2018, and since then we have been engaged in activities to formulate and implement our business plan as set forth below.\nOverview\nUp until August 2018, we provided social networking and photo sharing from the website PhotoAmigo.com. We also maintained the domain names PhotoAmigo.net, fotoamigo.com and fotoamigo.net. These domain names all redirect incoming traffic to our main website, PhotoAmigo.com.\nIn August 2018, the Company changed its future plans of operations. Through its wholly owned subsidiary - Hangzhou Hartford Comprehensive Health Management, Ltd (HZHF) and HZHFs 60 percent owned subsidiary - Hangzhou Longjing Qiao Fu Vacation Hotel Co., Ltd. (HZLJ), and through Shanghai Hartford Comprehensive Health Management, Ltd. (HFSH) and its 90 percent owned subsidiary - Shanghai Qiao Garden International Travel Agency (Qiao Garden Intl Travel), the Company engages in hospitality industry in China. Qiao Garden Intl Travel was disposed on December 31, 2020, see note 4 Acquisitions, Joint Ventures and Deconsolidation.\nThe Company started to engage in early childhood education industry at Hartford International Education Technology Co., Ltd (HF Intl Education). HFSH originally held 75.5% ownership of HF Intl Education and maintains control over HF Intl Education. During the board meeting in 2021, SH Jingyu and another noncontrolling shareholders sold a total of 14.5% equity at zero value to HFSH. As a result, HFSH holds 90% of HF Intl Education and a total of 10% equity is held by two individual noncontrolling shareholders. On July 24, 2019 and March 23, 2020, HF Intl Education established two 100% owned subsidiaries, Pudong Haojin Childhood Education Ltd. (PDHJ) and Shanghai Hongkou HaiDeFuDe Childcare Co., Ltd.(HDFD), respectively, to operate the early childhood education service under the brand name of HaiDeFuDe in Shanghai, China. On July 20, 2020, HF Intl Education entered an agreement with two individuals to acquire the whole ownership of Shanghai Gelinke Childcare Education Center (Gelinke). Gelinke temporally ceased its operations by the end of August 2021. On August 31, 2021, PDHJ established one 96% owned subsidiary, Shanghai HDFD Zhongli Education Technology Co., Ltd. (Zhongli), two individual investors hold the remaining 4% ownership, see note 4 Acquisitions, Joint Ventures and Deconsolidation.\nIn March 2021, HF Intl Education entered agreements with Hartford Health Management (Shanghai), Co. Ltd. (HFHM). HFHM purchased seven education & intellectual property copy rights and ten HaiDeFuDe registered trademarks from HF Intl Education for a total amount of RMB1.2M and RMB1.0M, respectively. As a part of the purchase agreement, HFHM was originally agreed to be paid the 90% of gross tuition income from the three childcare centers. Due to impacts from the pandemic and new regulations issued by Chinese government in education industry, HF Intl Education occurred significant loss from operation. Both parties mutually agreed to amend the fee to 20% on July 2022, the amended rate is retrospectively applicable to June 1, 2021.\nThe following business plan is based on research and discussions between the board and third party suppliers and experts. Only preliminary activities relating to the following objectives have been undertaken and therefore, there is no assurance that any of the proposed activities set forth below will be started by the Company or if started will be successful.\nStrategy\nThe initial plan focuses on the development of the Sino-U.S. health industry in the following four areas:\nA. International Anti-Aging Membership Program,\nB. Artificial Intelligence and Medical Equipment Sales,\nC. Mobile Lifestyle Health & Wellness Management Platform,\nD. Integrated Health Management of Metabolic Diseases.\nThe Company has also expanded its strategy into the hospitality industry, focusing on hotels, restaurants, and travel arrangements. The Company plans to integrate hospitality with health management through its membership-based program by arranging travel accommodations for Chinese citizen members to the United States to obtain stem cell beauty treatments.\nThe initial plan in early 2019 that focused on the development of the Sino-U.S. health industry in the areas of International Anti-Aging membership based program; Artificial Intelligence and Medical Equipment Sales; Mobile Lifestyle Management Platform; and Integrated management of metabolic diseases have been put on hold due to economic uncertainties caused by the increasing tension between the US and China international relation.\nNear the end of 2019, the Company has found another opportunity to expand its market reach in the Chinese childhood education industry. The Company plans to formulate a proprietary early childhood education center management model beginning with the opening of several early childhood education centers in the greater Shanghai area with the goal of demonstrating the management model in action in order to attract interest from potential franchisees. Currently, there are three early child education and development center in operation despite the economic slowdown during the pandemic. The recent Three-child policy announced on May 1, 2021, by Chinese government further increases the market opportunities in early childhood education industry. On July 24, 2021, the Chinese government announced a Double-Reduction education policy to be taken effective on August 31, 2021. This new education policy has since impacted the Companys early childhood education business. Due to Chinas zero-Covid policy implementation during the pandemic as well as Covid-19 lockdown for over two months in Greater Shanghai, childcare and childhood education center were forced to halt operations; therefore, the Company decides to divert its plan from childcare and childhood educational development industry. In the near future, the company is looking into wholesale distribution of herbal supplement health products in China.\nThere can be no assurance following consummation of any of the business ventures will develop into a going concern or, if the business is already operating, that it will continue to operate successfully. Many of the potential business opportunities available to the Company may involve new and untested products, processes or market strategies which may not ultimately prove successful.\nThe Companys independent auditors have issued a report raising substantial doubt about the Companys ability to continue as a going concern. At present, the Company has limited operations and the continuation of the Company as a going concern is dependent upon financial support from its stockholders, its ability to obtain necessary equity financing to continue operations and/or to successfully locate and negotiate with a business entity for the combination of that target company with the Company. There is no assurance that the Company will ever be profitable.\nEmployees\nAs of November 14, 2022, we have 14 employees. ITEM 1A. RISK FACTORS\nAs a smaller reporting company as defined by Item 8 of Regulation S-K, the Company is not required to provide information required by this Item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nHartford Great Health Corp. uses the offices of its Chief Executive Officer, at 8832 Glendon Way, Rosemead, CA 91770, for its minimal office facility needs for no consideration.\nEach newly acquired or formed entity maintains its own leased office building and property. We lease spaces in Shanghai and Hangzhou, China under leases that expire at various times between 2023 and 2051 with various term extensions available.\nWe lease all of our facilities and do not own any real property. ITEM 3. LEGAL PROCEEDINGS\nOn March 21, 2022, HF Intl Education filed a civil case against the landlord demanding reductions of office rent due to mandatory business lockdown ordered by Shanghai health officials. The case has been accepted by the court and pending court date.\nWe were not subject to any other legal proceedings during the twelve months ended July 31, 2022, and are not currently subject to any legal proceedings, and to the best of our knowledge, no such proceeding is threatened, the results of which would have a material impact on our results of operation or financial condition. Nor, to the best of our knowledge, are any of our officers or directors involved in any legal proceedings in which we are an adverse party. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable to our Company.\nPART II ITEM 5. MARKET FOR COMMON EQUITY. RELATED STOCKHOLDER MATTERS AND PURCHASES OF EQUITY SECURITIES\nMarket Information\nThere has only been limited trading for the Companys Common Stock since it was quoted on OTC Markets. There is no assurance that an active trading market will ever develop or, if such a market does develop, that it will continue. The Securities and Exchange Commission has adopted Rule 15g-9 which establishes the definition of a penny stock, for purposes relevant to the Company, as any equity security that has a market price of less than $5.00 per share or with an exercise price of less than $5.00 per share, subject to certain exceptions. For any transaction involving a penny stock, unless exempt, the rules require: (i) that a broker or dealer approve a persons account for transactions in penny stocks and (ii) the broker or dealer receive from the investor a written agreement to the transaction, setting forth the identity and quantity of the penny stock to be purchased. In order to approve a persons account for transactions in penny stocks, the broker or dealer must (i) obtain financial information and investment experience and objectives of the person and (ii) make a reasonable determination that the transactions in penny stocks are suitable for that person and that person has sufficient knowledge and experience in financial matters to be capable of evaluating the risks of transactions in penny stocks. The broker or dealer must also deliver, prior to any transaction in a penny stock, a disclosure schedule prepared by the Commission relating to the penny stock market, which, in highlight form, (i) sets forth the basis on which the broker or dealer made the suitability determination and (ii) that the broker or dealer received a signed, written agreement from the investor prior to the transaction. Disclosure also has to be made about the risks of investing in penny stocks in both public offerings and in secondary trading, and about commissions payable to both the broker-dealer and the registered representative, current quotations for the securities and the rights and remedies available to an investor in cases of fraud in penny stock transactions. Finally, monthly statements have to be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks.\nBecause of these regulations, broker-dealers may encounter difficulties in their attempt to buy or sell shares of our common stock, which may affect the ability of our shareholders to sell their shares in the secondary market and have the effect of reducing the level of trading activity in the secondary market. These additional sales practice and disclosure requirements could impede the sale of our common stock in the market place. In addition, the liquidity for our common stock may be decreased, with a corresponding decrease in the price of our common stock. Our shares are likely to be subject to such penny stock rules for the foreseeable future.\nOn November 14, 2022, the closing price of our common stock reported on the OTC Markets was $0.16 per share. The following table sets forth, for each of the quarterly periods indicated, the high and low sales prices of our common stock, as reported on the OTC Markets.\nFiscal Low High\nFirst Quarter $ 0.16 $ 0.95\nSecond Quarter $ 0.16 $ 0.16\nThird Quarter $ 0.03 $ 1.00\nFourth Quarter $ 0.03 $ 0.16\nFiscal Low High\nFirst Quarter $ 0.16 $ 0.16\nHolders\nAs of November 14, 2021, a total of 100,108,000 shares of our common stock were outstanding and there were approximately 52 holders of record.\nPenny Stock Rules\nDue to the price of our common stock, as well as the fact that we are not listed on Nasdaq or a national securities exchange, our stock is characterized as penny stocks under applicable securities regulations. Our stock will therefore be subject to rules adopted by the Securities and Exchange Commission (SEC) regulating broker-dealer practices in connection with transactions in penny stocks. The broker or dealer proposing to affect a transaction in a penny stock must furnish his customer a document containing information prescribed by the SEC and obtain from the customer an executed acknowledgment of receipt of that document. The broker or dealer must also provide the customer with pricing information regarding the security prior to the transaction and with the written confirmation of the transaction. The broker or dealer must also disclose the aggregate amount of any compensation received or receivable by him in connection with such transaction prior to consummating the transaction and with the written confirmation of the trade. The broker or dealer must also send an account statement to each customer for which he has executed a transaction in a penny stock each month in which such security is held for the customers account. The existence of these rules may have an effect on the price of our stock, and the willingness of certain brokers to effect transactions in our stock.\nTransfer Agent\nWe have appointed EQ by Equiniti, as the transfer agent for our common stock. The principal office of EQ is located at 1110 Centre Pointe Curve #101, Mendota Heights, MN 55120 and its telephone number is (612) 209-9006.\nDividend Policy\nWe have never declared or paid dividends on our common stock. Payment of future dividends, if any, will be at the discretion of our Board of Directors after taking into account various factors, including the terms of any credit arrangements, our financial condition, operating results, current and anticipated cash needs and plans for expansion. At the present time, we intend to retain any earning in our business, and therefore do not anticipate paying dividends in the foreseeable future.\nRecent Sales of Unregistered Securities; Use of Proceeds from Unregistered Securities\nNone ITEM 6. SELECTED FINANCIAL DATA\nAs a smaller reporting company as defined by Item 8 of Regulation S-K, the Company is not required to provide information required by this Item. ITEM 7. MANAGEMENTSS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATION\nThe following discussion and analysis were prepared to supplement information contained in the accompanying financial statements and is intended to explain certain items regarding the financial condition as of July 31, 2022, and the results of operations for the years ended July 31, 2022, and 2021. It should be read in conjunction with the audited financial statements and notes thereto contained in this report.\nOverview of the Business\nHartford Great Health Corp. was originally incorporated in the State of Nevada on April 2, 2008, under the name PhotoAmigo, Inc. It changed its name to Hartford Great Health Corp. on August 22, 2018, and since then we have been engaged in activities to formulate and implement our business plan as set forth below.\nAbility to continue as a going concern.\nThe independent registered public accounting firms reports on our financial statements as of July 31, 2022 and 2021, includes a going concern explanatory paragraph that describes substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to the factors prompting the explanatory paragraph are discussed in the financial statements, including footnotes thereto.\nPlan of Operation\nAs of July 31, 2022, the company has issued a total of 100,108,000 shares of common stock. On December 11, 2018, 96,090,000 shares of common stock were issued at the price of $0.02 per share to raise an additional $1,921,800 in capital. On November 24, 2020, the Company issued additional 1,000,000 shares of common stock to a significant shareholder of the Company at $0.02 per share.\nOn December 28, 2018, the Company acquired Hangzhou Hartford Comprehensive Health Management, Ltd (HZHF). On March 22, 2019, the Company acquired 60 percent of Hangzhou Longjing Qiao Fu Vacation Hotel Co., Ltd. (HZLJ). On March 20, 2019, the Company acquired Shanghai Hartford Comprehensive Health Management, Ltd. (HFSH) with 90 percent of Shanghai Qiao Garden International Travel Agency (Qiao Garden Intl Travel), which was disposed on December 31, 2020, and formed a joint venture entity, Hartford International Education Technology Co., Ltd (HF Intl Education).\nThe subsidiary of HFUS in Shanghai (HFSH) advances operating funds from two related party entities, SH Qiao Hong and SH Oversea Chinese Culture Media Ltd. The main purpose of the funding is to invest in Hartford International Education Technology (Shanghai) Co., Ltd. (HF Intl Education). Upon signing of supplemental agreement, HFUS currently holds 75.5% ownership of HF Intl Education and maintains control over HF Intl Education. On July 24, 2019, HF Intl Education established a 100% owned subsidiary, Pudong Haojin Childhood Education Ltd. (PDHJ). On October 28, 2019, PDHJ had its childhood education center opened. On March 23, 2020, HF Intl Education established Shanghai Hongkou HaiDeFuDe Childcare Co., Ltd.(HDFD) and was approved the business license to conduct childcare operations in Shanghai, China. On July 20, 2020, HF Intl Education entered an agreement with two individuals to acquire the whole ownership of Shanghai Gelinke Childcare Education Center (Gelinke). During the board meeting, SH Jingyu and another noncontrolling shareholders also sold a total of 14.5% equity at zero value to HFSH. As a result, HFSH holds 90% of HF Intl Education and a total of 10% equity is held by two individual noncontrolling shareholders.\nHF Intl Education has developed an enhanced model of childcare franchise management program and registered a new brand name, HaiDeFuDe. HF Intl Education has recruited a team of knowledgeable childcare teachers to develop series of independent textbooks designed to targeted age of young children and register for the copyrights for these textbooks in September of 2020. Since then, HF Intl Education has begun marketing and promoting the enhanced model of franchise operation and management packaged program, under HaiDeFuDe brand, to an initial of 50 franchisees throughout different regions of China. To achieve that, HF Intl Education has incorporated existing market resources throughout other major cities and provinces in China. The promotion of HF Intl Education franchise operation and management model was expected to attract other childcare education centers to join the HaiDeFuDe brand, and HF Intl Education expected to generate revenue from franchise and management fees.\nDue to continued market uncertainties during the pandemic, the board of HFSH adopted a new management approach to ease cash flow and reduce operation loss. In March 2021, HF Intl Education entered agreements with Hartford Health Management (Shanghai), Co. Ltd. (HFHM). HFHM purchased seven education & intellectual property copy rights and ten HaiDeFuDe registered trademarks from HF Intl Education for a total amount of RMB1.2M and RMB1.0M, respectively. In June 2021, HF Intl Education and its three subsidiaries entered license agreements with HFHM for the rights to use the intellectual Properties (the IPs) HFHM owns. The IPs cover in the license agreements are four sets of curriculum structure designed and fifteen trademarks including HaiDeFuDe registered trademarks purchased from HF Intl Education. As a return, on a monthly basis, HF Intl Education and its subsidiaries pays 20% of its tuition revenue generated to HFHM as license usage fee.\nHowever, due to Chinas continual of zero-Covid policy implementation this year as well as Covid-19 lockdown for over two months in Greater Shanghai, childcare and childhood education center were forced to halt operations; therefore, the Company decides to divert its plan from childcare and childhood educational development industry. In the near future, the company is looking into wholesale distribution of herbal supplement health products in China.\nLiquidity and Capital Resources\nAs of July 31, 2022, we had negative working capital of $7,652,192 comprised of current assets of $814,727 and current liabilities of $8,466,919. This represents a decrease of $2,103,600 in the working capital balance from the July 31, 2021 negative amount of $5,548,592. During the year-ended July 31, 2022, our working capital deficit increased primarily because additional advances from related parties for business operating.\nWe believe that our funding requirements for the next twelve months will be in excess of $150,000. We are currently seeking for further funding through related parties loan and finance.\nOn December 11, 2018, the Company sold 96,090,000 shares of its common stock (the Shares) to 15 individuals. The selling price was $0.02 per share for an aggregate of $1,921,800. All 15 investors executed subscription agreements. As of April 30, 2019, all proceeds have collected. Twelve of the 15 investors are Chinese citizens and purchased the shares in China. Due to the strict monitoring of Chinas foreign exchange investment policy, funds are not able to be transferred directly to HFUS. As a result, amount of $657,000 were collected in RMB from the Chinese investors. The Shares were sold in a private placement pursuant to an exemption from registration in accordance with Section 4(2) and/or Regulation S under the Securities Act of 1933, as amended. The Shares are all restricted shares and accordingly all stock certificates evidencing the Shares have been affixed with the appropriate legend restricting sales and transfers.\nOn November 24, 2020, the Company issued additional 1,000,000 shares of common stock to a significant shareholder of the Company at $0.02 per share.\nWe will seek additional financing in the form of debt or equity. There is no assurance that we will be able to obtain any needed financing on favorable terms, or at all, or that we will find qualified purchasers for the sale of our stock. Any sales of our securities would dilute the ownership of our existing investors.\nCash Flows - Year Ended July 31, 2022 Compared to Year Ended July 31, 2021\nOperating Activities\nDuring the year ended July 31, 2022, $860,832 used in operating activities compared to $2,381,575 used in the operations during the year ended July 31, 2021.\nDuring the year ended July 31, 2022, we recorded losses including noncontrolling interests of $1,772,582 , incurred non-cash depreciation of $122,065 , prepaid and other current receivables decreased by $225,428 , inventory decreased by $5,327 , other assets decreased by $24,078 , contract liabilities increased by $26,466 , other current payable increased by $102,526 , related party payables net with receivables decreased by $81,013 , other liabilities increased by $27,880 and operating lease liabilities net with operating lease assets increased by $458,993 as a result from the delayed rent payments.\nDuring the year ended July 31, 2021, we recorded losses including noncontrolling interests of $2,842,339, incurred non-cash depreciation of $85,103, Loss absorbed from subsidiary restructure $403,131, gain on disposal of subsidiary of $104,317, including noncontrolling interest, goodwill impairment loss of $70,514, prepaid and other current receivables increased by $87,977, inventory increased by $299,588, other assets decreased by $10,435, contract liabilities increased by $373,413, other current payable increased by $312,902, related party payables net with receivables decreased by $185,693, other liabilities increased by $27,108 and operating lease liabilities net with operating lease assets increased by $17,779 as a result from the adoption of new lease guidance ASU No. 2016-02.\nInvesting activities\nCash used in investing activities was $145,048 for the year ended July 31, 2022 as compared to $185,682 cash used in investing activities for the corresponding period in 2021.\nDuring the year ended July 31, 2022, the Company purchased Property and equipment of $145,048.\nDuring the year ended July 31, 2021, HF Intl Education acquired a new entity, Gelinke with cash net inflow of $12,721, HFSH disposed its 90 percent owned subsidiary - Qiao Garden Intl Travel with cash net outflow of $30,116, and Property and equipment purchases of $168,287.\nFinancing activities\nCash provided by financing activities was $972,267 for the year ended July 31, 2022 as compared to $2,549,984 for the year ended July 31, 2021. The cash flows provided by financing activities for the year ended July 31, 2022 was primarily attributable to $788,673 funding support from related parties, $145,000 notes payable from one related party, $61,750 contribution from noncontrolling interest, offset by $23,156 finance lease principal payment.\nThe cash flows provided by financing activities for the year ended July 31, 2021 was primarily attributable to $2,407,033 funding support from related parties, $145,000 notes payable from one related party, $20,000 proceeds from stock issuance, offset by $22,049 finance lease principal payment.\nEquity and Capital Resources\nWe have incurred losses since inception of our business and, as of July 31, 2022, we had an accumulated deficit of $7,400,620 compared to $5,821,519 at the previous year end. To date, we have funded our operations through short-term debt and equity financing.\nWe expect our expenses will decrease in the foreseeable future because of the decrease in operational expenses and because of closure of the childcare education centers. The two remaining childcare education centers with our Chinese subsidiaries were generating limited revenues during the pandemic and were forced to halt operations due to Covid-19 lockdown since March 2022. The generated revenue is not expected to be sufficient to cover our marketing needs in the foreseeable future due to the uncertainties affected by the Zero-Covid policy in China. Consequently, we are dependent on the proceeds from future debt or equity investments to sustain our operations and implement our business plan. If we are unable to raise sufficient capital, we will be required to delay or forego most of our business plan, which would have a material adverse effect on our anticipated results from operations and financial condition. There is no assurance that we will be able to obtain necessary amounts of additional capital or that our estimates of our capital requirements will prove to be accurate.\nFuture Capital Expenditures\nOn January 2019, HFSH entered an agreement to acquire 100 percent equity interest of Shanghai Luo Sheng International Trade Ltd. (SH Luosheng). As of July 31, 2022, the agreement has not yet taken effective as no consideration has been paid toward those acquisitions. The agreement will be executed when the Company is financially ready to move forward, and the purchase price will be calculated based on the net assets of each entity on execute dates. There was no penalty levied or to be levied due to delayed execution or inexecution of this agreement.\nOff-Balance Sheet Arrangements\nAs of and subsequent to July 31, 2022, we have no off-balance sheet arrangements.\nContractual Commitments\nAs of July 31, 2022, we have no other material contractual commitments except the office building and property leases which are included Note 13 Leases. (see note 7. Commitments and contingencies)\nResults of Operations- Year Ended July 31, 2022 Compared to Year Ended July 31, 2021\nRevenue: We recognized $561,262 and $553,459 revenue in the year ended July 31, 2022 and 2021, respectively. The revenue was mainly generated from two industry segments, the hospitality housing in HZLJ and childhood education care services in HF Intl Education. The other business lines with limited operations have not generated revenue yet.\nOperating Cost and Expenses: Cost of revenue decreased to $677,093 for the year ended July 31, 2022, compared to $722,838 during the comparable period of 2021. The decrease of Cost of revenue was mainly due to the decrease of the revenue and the amendment of the license fees charge rate to HFHM. During the year ended July 31, 2022, selling, general and administrative expenses decreased by $1,055,599 compared to the comparable period in 2021, primarily due to the reduction of payroll and rent cost because the company closed several education centers during the pandemic.\nOther Income (Expense): Other income, net decreased to $101,884 for the year ended July 31, 2022, compared to $174,826 of other income for the corresponding period of 2021. Other income for the year ended July 31, 2022 was mainly resulted from sublease income offset by interest expenses. Other income for the year ended July 31, 2021 was mainly resulted from $108,366 lease payable write-off as a result of the legal settlement (see note 7. Commitments and contingencies), $104,317 gain on disposal of subsidiary, $334,537 income realized from the trademark and copy rights transfer to a related party, offset by $403,131 loss from HF Intl Educations ownership restructure in 2021 (see note 4 Acquisitions, Joint Ventures and Deconsolidation).\nNet Loss Attributable to Noncontrolling Interest: For the year ended July 31, 2022, we recorded a net loss attributable to Noncontrolling interest of $193,481 compared to $589,005 for the corresponding period of 2021. The loss was allocated based on the ownership percentage of noncontrolling interest, which was mainly acquired through the acquisitions and Joint Ventures.\nNet Loss Attributable to Hartford Great Health Corp: We recorded a net loss of $1,579,101 or $ (0.02) per share for the year ended July 31, 2022, compared to a net loss of $2,253,334 or $(0.02) per share for the year ended July 31, 2021, a decrease in losses of $674,233 due to the factors discussed above.\nAccounting Policies and Pronouncements\nCritical Accounting Policies and Estimates\nOur consolidated financial statements are prepared in accordance with GAAP. GAAP requires us to make estimates and assumptions that affect the reported amounts in our consolidated financial statements. Critical accounting estimates are those that management believes are the most important to the portrayal of our financial condition and results and require the most difficult, subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain and that have had, or are reasonably likely to have, a material impact on our financial condition or results of operations. Judgments and uncertainties may result in materially different amounts being reported under different conditions or using different assumptions. See Part II, Item 8 - Financial Statements - Note 1 -Summary of Significant Accounting Policies for a summary of our significant accounting policies.\nThe following summarizes our most significant critical accounting estimates:\nForeign Currency: The accounts of the Companys foreign subsidiaries are translated in accordance with FASB ASC 830. Foreign currency transaction gains and losses are recognized in other expense, net, at the time they occur. Net foreign currency exchange gains or losses resulting from the translation of assets and liabilities of foreign subsidiaries whose functional currency is not the U.S. dollar are recorded as a part of accumulated other comprehensive loss in stockholders equity. The Company does not undertake hedging transactions to cover its foreign currency exposure.\nRevenue Recognition: The Company adopted ASC Topic 606 Revenue from Contracts with Customers (Topic 606) on August 1, 2019, applying the modified retrospective method to all contracts that were not completed as of August 1, 2019. The Company is building up its core business upon the completion of multiple acquisitions in March 2019 and impact of COVID-19 pandemic, limited operations occurred during the years ended July 31, 2022 and 2021. The revenue during the year ended July 31, 2022 and 2021 was mainly generated from HZLJ and HF Intl Education.\nRevenue is recognized when control of promised goods or services is transferred to our customers in an amount of consideration to which we expect to be entitled to in exchange for those goods or services. We follow the five steps approach for revenue recognition under Topic 606: (i) identify the contract(s) with a customer, (ii) identify the performance obligations in the contract, (iii) determine the transaction price, (iv) allocate the transaction price to the performance obligations in the contract, and (v) recognize revenue when (or as) we satisfy a performance obligation. Billings to customers for which services are not rendered are considered deferred revenue. ASC 606 has no material impacts on the Companys financial positions. The Companys revenue is recognized when it satisfies a single performance obligation by transferring control of its products or providing services to a customer. The Companys general payment terms are short-term in duration. The Company does not have significant financing components or payment terms.\na. Early childhood education services: HF Intl Education generates revenue from childhood education classes provided to its customers. The educational services consist of parent-child and bilingual childcare classes. Each contract of educational classes is accounted for as a single performance obligation which is satisfied proportionately over the service period. Tuition fee is generally collected in advance and is initially recorded as deferred revenue and transferred to contract liabilities after trial period. Refunds are provided to parents if they decide within the trial period that they no longer want to take the class. After the trial period, if a parent withdraws from a class, usually only that unearned portion of the fee is available to be returned. For the year ended July 31, 2022 and 2021, $509,920 and $435,149, respectively, of revenue were derived from early childhood education classes provided.\nb. Hospitality services: HZLJ generates revenue primarily from the room rentals, sale of food and beverage and other miscellaneous hospitality services. The Company recognizes room rental and services daily as services are provided. Under ASC 606, the pattern and timing of recognition of income from hotel facility is consistent with the prior accounting model.\nRecent Accounting Pronouncements.\nSee Part II, Item 8 - Financial Statements - Note 1 -Summary of Significant Accounting Policies - Recent Accounting Pronouncements for a full description of recent accounting pronouncements including the respective expected dates of adoption and expected effects on the Companys consolidated financial position, results of operations or liquidity. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nAs a smaller reporting Company as defined by ITEM 8. FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm\nShareholders and Board of Directors\nHartford Great Health Corp.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Hartford Great Health Corp. and subsidiary (the Company) as of July 31, 2022 and 2021, the related consolidated statements of operation and comprehensive income (loss), changes in stockholders equity, and cash flows for each of the two years in the period ended July 31, 2022, and the related notes to the consolidated financial statements. In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2022 and 2021, and the results of its operations and its cash flows for each of the two years in the period ended July 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Uncertainty\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As described in Note 2 to the consolidated financial statements, the Company has suffered recurring losses from operations and has a net capital deficiency that raise substantial doubt about its ability to continue as a going concern. Managements evaluation of the events and conditions and managements plans regarding these matters are also described in Note 2. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue recognition\nAs described in Note 1 to the consolidated financial statements, the Company generates its revenue mainly from early childhood educational classes provided to its customers. The Company evaluates its early childhood education contracts and determines each contract of educational classes is accounted for a single performance obligation which is satisfied proportionately over the service period. Performance obligation is satisfied when a educational class are consumed.\nWe identified the revenue recognition as a critical audit matter. Auditor judgement is involved in performing our audit procedures to evaluate the timing the Company transfers the control of the promised service to its customers in an amount of consideration to which the Company expects to be entitled to in exchange for the services per the contracts.\nThe primary procedures we performed to address this critical audit matter included:\n●\nWe evaluated managements significant accounting policies related to these early childhood educational class contracts executed for reasonableness.\n●\nWe selected a sample of educational class contracts and performed the following procedures:\n► Obtained and read contract for each selection\n► Tested managements identification and the determination of the timing of revenue recognition\n► Traced to the evidence the management uses to apply their accounting policies\n► Evaluated the appropriateness of managements application of their accounting policies, along with their use of estimates, in the determination of revenue recognition conclusions\n► We tested the mathematical accuracy of managements calculations of revenue and the associated timing of revenue recognized in the financial statements\n/s/ Simon & Edward, LLP\nWe have served as the Companys auditor since 2019.\nPCAOB ID: 2485\nRowland Heights, California\nNovember 14, 2022\nHARTFORD GREAT HEALTH CORP.\nCONSOLIDATED BALANCE SHEETS\nJuly 31, 2022 July 31, 2021\nASSETS\nCurrent Assets\nCash and cash equivalents $ 15,227 $ 12,739\nPrepaid and Other current receivables 1,154 1,203\nRelated party receivable 14,233\nCurrent assets held for sale 784,113 975,837\nTotal Current Assets 814,727 990,088\nNon-current Assets\nProperty and equipment, net 8,006 8,357\nNon-current assets held for sale 3,715,623 4,744,153\nTotal Non-current Assets 3,723,629 4,752,510\nTOTAL ASSETS $ 4,538,356 $ 5,742,598\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent Liabilities\nRelated party loan and payables $ 4,481,524 $ 3,711,606\nOther current payable 144,760 145,435\nCurrent liabilities held for sale 3,840,635 2,681,639\nTotal Current Liabilities 8,466,919 6,538,680\nLong-term liabilities held for sale 2,504,086 4,190,368\nTOTAL LIABILITIES 10,971,005 10,729,048\nCommitments and contingencies (Note 7) - -\nStockholders Equity (Deficit)\nPreferred stock - $0.001 par value, 5,000,000 shares authorized, no shares issued and outstanding - -\nCommon stock - $0.001 par value, 300,000,000 shares authorized, 100,108,000 shares outstanding at both of July 31, 2022 and 2021. 100,108 100,108\nAdditional paid-in capital 2,173,521 2,173,521\nAccumulated deficit (7,400,620 ) (5,821,519 )\nAccumulated other comprehensive loss (16,742 ) (233,487 )\nNoncontrolling interest (1,288,916 ) (1,205,073 )\nTotal Stockholders Deficit (6,432,649 ) (4,986,450 )\nTOTAL LIABILITIES AND STOCKHOLDERS DEFICIT $ 4,538,356 $ 5,742,598\nThe accompanying notes are an integral part of these financial statements.\nHARTFORD GREAT HEALTH CORP.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYears ended\nJuly 31,\nTuition revenue $ 509,920 $ 435,149\nService revenue 51,342 118,310\nTotal revenue 561,262 553,459\nOperating cost and expenses\nCost of revenue 677,093 722,838\nDepreciation and amortization 122,065 85,103\nSelling, general and administrative 1,635,770 2,691,369\nGoodwill impairment - 70,514\nTotal operating cost and expenses 2,434,928 3,569,824\nOperating Loss (1,873,666 ) (3,016,365 )\nOther Income (Expense)\nInterest (expense), net (66,587 ) (30,886 )\nGain on disposal of subsidiary - 104,317\nOther income, net 168,471 101,395\nOther income, net 101,884 174,826\nLoss before income taxes (1,771,782 ) (2,841,539 )\nIncome Tax Expense\nNet Loss (1,772,582 ) (2,842,339 )\nLess: net loss attributable to noncontrolling Interest (193,481 ) (589,005 )\nNet Loss Attributable to Hartford Great Health Corp $ (1,579,101 ) $ (2,253,334 )\nNet loss per common share:\nBasic and Diluted $ (0.02 ) $ (0.02 )\nWeighted average shares outstanding:\nBasic and diluted 100,108,000 99,790,192\nThe accompanying notes are an integral part of these financial statements.\nHARTFORD GREAT HEALTH CORP.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE LOSS\nYears ended\nJuly 31,\nNet Loss $ (1,579,101 ) $ (2,253,334 )\nOther Comprehensive income (loss), net of income tax\nForeign currency translation adjustments 267,073 (217,953 )\nTotal other comprehensive loss 267,073 (217,953 )\nLess: total other comprehensive loss attributable to noncontrolling interest 50,328 (39,612 )\nTotal Other Comprehensive Loss Attributable to Hartford Great Health Corp 216,745 (178,341 )\nTotal Comprehensive Loss $ (1,362,356 ) $ (2,431,675 )\nThe accompanying notes are an integral part of these financial statements.\nHARTFORD GREAT HEALTH CORP.\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY (DEFICIT)\nfor the years ended July 31, 2022 and 2021\nAccumulated\nTotal\nAdditional\nOther\nStockholders\nCommon Stock Paid - in Accumulated Comprehensive Noncontrolling Equity\nShares Amount Capital (Deficit) loss Interest (Deficit)\nBalance, July 31, 2020 99,108,000 99,108 2,154,521 (3,568,185 ) (55,146 ) (917,489 ) (2,287,191 )\nNet (loss) - - - (2,253,334 ) - (589,005 ) (2,842,339 )\nIssuance of common stock 1,000,000 1,000 19,000 - - - 20,000\nRestructure of subsidiary - - - - - 403,131 403,131\nDisposal of subsidiary - - - - - (62,098 ) (62,098 )\nForeign currency translation adjustment - - - - (178,341 ) (39,612 ) (217,953 )\nBalance, July 31, 2021 100,108,000 100,108 2,173,521 (5,821,519 ) (233,487 ) (1,205,073 ) (4,986,450 )\nNet (loss) - - - (1,579,101 ) - (193,481 ) (1,772,582 )\nInvestment from noncontrolling interest - - - - - 59,310 59,310\nForeign currency translation adjustment - - - - 216,745 50,328 267,073\nBalance, July 31, 2022 100,108,000 100,108 2,173,521 (7,400,620 ) (16,742 ) (1,288,916 ) (6,432,649 )\nThe accompanying notes are an integral part of these financial statements.\nHARTFORD GREAT HEALTH CORP.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears ended\nJuly 31,\nCash flows from operating activities:\nNet loss including noncontrolling interests $ (1,772,582 ) $ (2,842,339 )\nAdjustments to reconcile net loss including noncontrolling interests to net cash provided by (used in) operating activities:\nDepreciation and amortization 122,065 85,103\nDisposal of subsidiary, including noncontrolling interest - (104,316 )\nDebts forgiveness per court ruling - (162,806 )\nLoss from restructure - 403,131\nLoss on disposal of property and equipment -\nImpairment loss - 70,514\nChanges in operating assets and liabilities:\nPrepaid and Other current receivables 225,428 (87,978 )\nInventory 5,327 (299,588 )\nOther assets 24,078 10,435\nRelated party receivables and payables (81,013 ) (185,693 )\nContract liabilities 26,466 373,413\nOther current payable 102,526 312,902\nOperating lease assets and liabilities 458,993 17,779\nOther liabilities 27,880 27,108\nNet cash used in operating activities (860,832 ) (2,381,575 )\nCash flows from investing activities:\nCash proceeds from Acquisitions - 27,927\nCash used in Acquisitions - (15,206 )\nDisposal of subsidiary - (30,116 )\nPurchases of property and equipment (145,048 ) (168,287 )\nNet cash used in investing activities (145,048 ) (185,682 )\nCash flows from financing activities:\nContribution from noncontrolling interest 61,750 -\nProceeds from issuance of common stock - 20,000\nProceeds of related party notes payable 145,000 145,000\nPrincipal payments on finance lease (23,156 ) (22,049 )\nAdvances from related parties 788,673 2,407,033\nNet cash provided by financing activities 972,267 2,549,984\nEffect of exchange rate changes on cash (400 ) 6,174\nNet change in Cash, cash equivalents and restricted cash (34,013 ) (11,099 )\nCash, cash equivalents and restricted cash at beginning of period 54,178 65,277\nCash, cash equivalents and restricted cash at end of period $ 20,165 $ 54,178\nSupplemental Cash Flow Information\nInterest paid $ - $ -\nIncome taxes paid $ 800 $ 800\nNon-cash investing and financing activities:\nPayable to acquiree $ - $ 10,462\nInvestment return through three-party settlement $ - $ 765,131\nThe accompanying notes are an integral part of these financial statements.\nHARTFORD GREAT HEALTH CORP.\nNotes to Financial Statements\nFor the Years Ended July 31, 2022 and 2021\nNOTE 1. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThis summary of significant accounting policies is presented to assist in understanding the Companys financial statements. The financial statements and notes are the responsibility of the Companys management. These accounting policies conform to accounting principles generally accepted in the United States of America (US GAAP) and have been consistently applied in the preparation of the financial statements.\nOrganization\nHartford Great Health Corp. was originally incorporated in the State of Nevada on April 2, 2008 under the name PhotoAmigo, Inc. It changed its name to Hartford Great Health Corp. on August 22, 2018 and since then we have been engaged in activities to formulate and implement our business plans.\nThrough its wholly owned subsidiary - Hangzhou Hartford Comprehensive Health Management, Ltd (HZHF) and HZHFs 60 percent owned subsidiary - Hangzhou Longjing Qiao Fu Vacation Hotel Co., Ltd. (HZLJ), and through Shanghai Hartford Comprehensive Health Management, Ltd. (HFSH) and its 90 percent owned subsidiary - Shanghai Qiao Garden International Travel Agency (Qiao Garden Intl Travel), the Company engages in hospitality industry in China. Qiao Garden Intl Travel was disposed on December 31, 2020, see note 4 Acquisitions, Joint Ventures and Deconsolidation.\nThe Company started to engage in early childhood education industry at Hartford International Education Technology Co., Ltd (HF Intl Education). On July 24, 2019 and March 23, 2020, HF Intl Education established two 100% owned subsidiaries, Pudong Haojin Childhood Education Ltd. (PDHJ) and Shanghai Hongkou HaiDeFuDe Childcare Co., Ltd.(HDFD), respectively, to operate the early childhood education service under the brand name of HaiDeFuDe in Shanghai, China. On July 20, 2020, HF Intl Education entered an agreement with two individuals to acquire the whole ownership of Shanghai Gelinke Childcare Education Center (Gelinke). Gelinke temporally ceased its operations by the end of August 2021. On August 31, 2021, PDHJ established one 96% owned subsidiary, Shanghai HDFD Zhongli Education Technology Co., Ltd. (Zhongli), two individual investors hold the remaining 4% ownership, see note 4 Acquisitions, Joint Ventures and Deconsolidation.\nImpacted by the government regulation newly implemented in education industry and the restrictions posted by the Chinese government to control the pandemic in China since 2021, to avoid further operation losses, subsequently on August 1, 2022, HFSH entered a contract with a related party, Shanghai Oversea Chinese Culture Media Ltd. (SH Oversea), to sell 90 percent ownership of HF Intl Education and its subsidiaries for $900 (RMB 5,850). On August 1, 2022, HFUS entered a contract with SH Oversea and another individual, to sell 100 percent ownership of HZHF and its subsidiaries for $1,000 (RMB 6,500). As of July 31, 2022, the asset group in Education segment and the asset group in Hospitality segment classified as assets and liabilities held for sale, and it is the Companys intention to complete the sales of these assets within the upcoming year.\nBasis of Presentation: The consolidated financial statements include the accounts of Hartford Great Health Corp, its wholly-owned subsidiaries and subsidiaries in which it has a controlling interest. The Company reports noncontrolling interests of the consolidated entities as a component of equity separate from the Companys equity. All material inter-company transactions between and among the Company and its consolidated subsidiaries have been eliminated in the consolidation. The Companys net income (loss) excludes income (loss) attributable to the noncontrolling interests.\nUse of Estimates: The preparation of financial statements in conformity with US GAAP requires the Companys management to make estimates and assumptions that affect the amounts of assets and liabilities, the identification and disclosure of impaired assets and contingent liabilities at the date of the financial statements, and the reported amounts of expenses during the reporting period. Actual results could differ from those estimates.\nForeign Currency: The accounts of the Companys foreign subsidiaries are translated in accordance with FASB ASC 830. Foreign currency transaction gains and losses are recognized in other expense, net, at the time they occur. Net foreign currency exchange gains or losses resulting from the translation of assets and liabilities of foreign subsidiaries whose functional currency is not the U.S. dollar are recorded as a part of accumulated other comprehensive loss in stockholders equity. The Company does not undertake hedging transactions to cover its foreign currency exposure.\nComprehensive Income (loss): For the year ended July 31, 2022 and 2021, the Company included its foreign currency translation gain or loss as part of its comprehensive income (loss).\nFair value measurement: Fair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value must maximize the use of observable inputs and minimize the use of unobservable inputs. Accounting Standard Codification (ASC) 820, Fair Value Measurements and Disclosures (ASC 820), describes a fair value hierarchy based on three levels of inputs, of which the first two are considered observable and the last unobservable, that may be used to measure fair value, which are the following:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities or funds.\nLevel 2 - Inputs other than Level 1 that are observable, either directly or indirectly, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities.\nThe Companys financial instruments consist of cash and cash equivalents, accounts receivable, related party receivable, prepaid and other current receivable, accounts payable, related party payable and other current payable. The carrying amounts of afore-mentioned accounts approximate fair value because of their short-term nature.\nCash and Cash Equivalents: The Company maintains cash with banks in the USA and China. Should any bank holding cash become insolvent, or if the Company is otherwise unable to withdraw funds, the Company would lose the cash with that bank; however, the Company has not experienced any losses in such accounts and believes it is not exposed to any significant risks on its cash in bank accounts. In China, a depositor has up to RMB500,000 insured by the Peoples Bank of China Financial Stability Bureau (FSD). In the United States, the standard insurance amount is USD250,000 per depositor in a bank insured by the Federal Deposit Insurance Corporation (FDIC). Financial instruments that potentially subject the Company to significant concentrations of credit risk are cash and cash equivalents and accounts receivable. As of July 31, 2022 and 2021, respectively, none of the Companys cash and cash equivalents held by financial institutions was uninsured. With respect to accounts receivable, the Company generally does not require collateral and does not have an allowance for doubtful accounts.\nReceivables: The Company evaluates the collectability of its receivables based on a number of factors. In circumstances where the Company becomes aware of a specific customers or borrowers inability to meet its financial obligations to the Company, a specific reserve for bad debts is estimated and recorded, which reduces the recognized receivable to the estimated amount the Company believes will ultimately be collected. As of July 31, 2022 and 2021, all balances are collectable based on managements assessment.\nProperty and equipment, net: Property and equipment, net, are stated at cost. Depreciation and amortization are computed using the straight-line method over the estimated useful lives of the assets. The estimated useful lives of property and equipment are as follows:\nSCHEDULE OF PROPERTY AND EQUIPMENT USEFUL LIFE\nYears\nLeasehold improvements Lesser of lease term or estimated useful life\nROU assets-Finance lease Lease term\nFurniture and fixtures 3-5\nOffice equipment and vehicles 3-5\nComputer software 3-5\nExpenditures for repairs and maintenance are charged to expense as incurred.\nGoodwill and Long-lived Assets: Goodwill, which represents the excess of the purchase price over the fair value of identifiable net assets acquired, is not amortized, in accordance with Accounting Standards Codification (ASC) 350, Intangibles-Goodwill and Other. ASC 350 requires that goodwill be tested for impairment at the reporting unit level on an annual basis and between annual tests, if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying value. These events or circumstances could include a significant change in the business climate, legal factors, operating performance indicators, competition, or sale or disposition of a significant portion of a reporting unit.\nThe Company has the option to assess goodwill for possible impairment by performing a qualitative analysis to determine whether the existence of events or circumstances leads to a determination that it is more likely than not that the fair value of a reporting unit is less than its carrying amount. A quantitative assessment is performed if the qualitative assessment results in a more-likely-than-not determination or if a qualitative assessment is not performed. The quantitative assessment considers whether the carrying amount of a reporting unit exceeds its fair value, in which case an impairment charge is recorded to the extent that the reporting units carrying value exceeds its fair value. The Companys goodwill was mainly generated from the acquisitions during the year ended July 31, 2019. We currently have two reporting units - Hospitality and Early Childhood Education. Given the impact of COVID-19 pandemic and the unfavorable operation results, an interim goodwill impairment assessment was performed as of January 31, 2020. Based on the assessment result, management determined that the goodwill generated from acquisitions was fully impaired as of July 31, 2021.\nBusiness Combinations: If an acquired set of activities and assets is capable of being operated as a business consisting of inputs and processes from the viewpoint of a market participant, the assets acquired and liabilities assumed are a business. Business combinations are accounted for using the acquisition method of accounting, which requires an acquirer to recognize the assets acquired and the liabilities assumed at the acquisition date measured at their fair values as of that date. Fair value determinations are based on discounted cash flow analyses or other valuation techniques. In determining the fair value of the assets acquired and liabilities assumed in a material acquisition, the Company may utilize appraisals from third party valuation firms to determine fair values of some or all of the assets acquired and liabilities assumed, or may complete some or all of the valuations internally. In either case, the Company takes full responsibility for the determination of the fair value of the assets acquired and liabilities assumed. The value of goodwill reflects the excess of the fair value of the consideration conveyed to the seller over the fair value of the net assets received. Acquisition-related costs that the Company incurs to affect a business combination are expensed in the periods in which the costs are incurred.\nNoncontrolling interest: The Company adopted ASC 810, Noncontrolling Interests in Consolidated Financial Statements-an Amendment of Accounting Research Bulletin No. 51, as of January 1, 2009. ASC 810 establishes accounting and reporting standards for ownership interests in subsidiaries held by parties other than the parent, the amount of consolidated net income attributable to the parent and to the noncontrolling interest, changes in a parents ownership interest and the valuation of retained noncontrolling equity investments when a subsidiary is deconsolidated. ASC 810 also establishes reporting requirements that provide sufficient disclosures that clearly identify and distinguish between the interest of the parent and the interests of the noncontrolling owner.\nAdvertising costs: Advertising costs are expensed as incurred. During the year ended July 31, 2022 and 2021, amount of $10,540 and $65,406 advertising expenses were incurred, respectively.\nIncome Taxes: The Company accounts for income taxes using the asset and liability method in accordance with ASC 740, Accounting for Income Taxes. The asset and liability method provides that deferred tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax bases of assets and liabilities, and for operating loss and tax credit carry forwards. Deferred tax assets and liabilities are measured using the currently enacted tax rates and laws that will be in effect when the differences are expected to reverse. The Company records a valuation allowance to reduce deferred tax assets to the amount that is believed more likely than not to be realized.\nOn December 22, 2017, the President of the United States signed into law the Tax Reform Act. The Tax Reform Act permanently reduces the U.S. corporate income tax rate from a maximum of 35% to a flat 21% rate, effective January 1, 2018. In addition, the 2017 Tax Act also creates a new requirement that certain income (i.e., Global Intangible Low-Taxed Income (GILTI)) earned by controlled foreign corporations (CFCs) must be included in the gross income of the CFCs U.S. shareholder income. The tax law in PRC applies an income tax rate of 25% to all enterprises. The Companys subsidiary does not receive any preferential tax treatment from local government. The Company has been in loss position for years and zero balances of tax provisions, deferred tax assets and liabilities as of the reporting periods ended. The tax reforms have no significant impacts on the Company.\nRevenue Recognition: The Company adopted ASC Topic 606 Revenue from Contracts with Customers (Topic 606) on August 1, 2019, applying the modified retrospective method to all contracts that were not completed as of August 1, 2019. The Company is building up its core business upon the completion of multiple acquisitions in March 2019 and impact of COVID-19 pandemic, limited operations occurred during the years ended July 31, 2022 and 2021. The revenue during the years ended July 31, 2022 and 2021 were mainly generated from HZLJ and HF Intl Education.\nRevenue is recognized when control of promised goods or services is transferred to our customers in an amount of consideration to which we expect to be entitled to in exchange for those goods or services. We follow the five steps approach for revenue recognition under Topic 606: (i) identify the contract(s) with a customer, (ii) identify the performance obligations in the contract, (iii) determine the transaction price, (iv) allocate the transaction price to the performance obligations in the contract, and (v) recognize revenue when (or as) we satisfy a performance obligation. Billings to customers for which services are not rendered are considered deferred revenue. ASC 606 has no material impacts on the Companys financial positions. The Companys revenue is recognized when it satisfies a single performance obligation by transferring control of its products or providing services to a customer. The Companys general payment terms are short-term in duration. The Company does not have significant financing components or payment terms.\na. Early childhood education services: HF Intl Education generates revenue from childhood education classes provided to its customers. The educational services consist of parent-child and bilingual childcare classes. Each contract of educational classes is accounted for as a single performance obligation which is satisfied proportionately over the service period. Tuition fee is generally collected in advance and is initially recorded as deferred revenue and transferred to contract liabilities after trial period. Refunds are provided to parents if they decide within the trial period that they no longer want to take the class. After the trial period, if a parent withdraws from a class, usually only that unearned portion of the fee is available to be returned. For the year ended July 31, 2022 and 2021, $509,920 and $435,149, respectively, of revenue were derived from early childhood education classes provided.\nb. Hospitality services: HZLJ generates revenue primarily from the room rentals, sale of food and beverage and other miscellaneous hospitality services. The Company recognizes room rental and services daily as services are provided. Under ASC 606, the pattern and timing of recognition of income from hotel facility is consistent with the prior accounting model.\nIncome (Loss) Per Share: Basic earnings per share include no dilution and are computed by dividing net income (or loss) by the weighted- average number of shares outstanding during the period. Diluted earnings per share reflect the potential dilution of securities that could share in the earnings of the Company, assuming the issuance of an equivalent number of common shares pursuant to options, warrants, or convertible debt arrangements. Diluted earnings per share are not shown for periods in which the Company incurs a loss because it would be anti-dilutive. Similarly, potential common stock equivalents are not included in the calculation if the effect would be anti-dilutive. No potentially dilutive debt or equity securities were issued or outstanding during the years ended July 31, 2022 or 2021.\nReclassifications\nCertain amounts on the prior-year consolidated balance sheet, consolidated statement of operations and cash flows were reclassified to conform to current-year presentation, with no effect on ending stockholders equity.\nRecent Accounting Pronouncements.\nRecently adopted accounting pronouncements\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes which is intended to simplify various aspects related to accounting for income taxes. The standard is effective for fiscal years, and interim periods within those years, beginning after December 15, 2020, with early adoption permitted. The adoption of ASU 2019-12 had an immaterial impact on the Companys consolidated statement of operation and consolidated statement of cash flows for the year ended July 31, 2022.\nRecently issued accounting pronouncements not yet adopted\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments-Credit Losses. The standard, including subsequently issued amendments (ASU 2018-19, ASU 2019-04, ASU 2019-05, ASU 2019-10 and ASU 2019-11), requires a financial asset measured at amortized cost basis, such as accounts receivable and certain other financial assets, to be presented at the net amount expected to be collected based on relevant information about past events, including historical experience, current conditions, and reasonable and supportable forecasts that affect the collectability of the reported amount. In November 2019, the FASB issued ASU No. 2019-10 to postpone the effective date of ASU No. 2016-13 for public business entities eligible to be smaller reporting companies defined by the SEC to fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. The Company is evaluating the impact of this guidance on its consolidated financial statements.\nNOTE 2. GOING CONCERN\nThe accompanying financial statements were prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of obligations in the normal course of business. However, Hartford Great Health Corp. has incurred losses since inception, resulting in an accumulated deficit of $7,400,620 as of July 31, 2022. These conditions raise substantial doubt about the ability of Hartford Great Health Corp. to continue as a going concern.\nIn view of these matters, continuation as a going concern is dependent upon several factors, including the availability of debt or equity funding upon terms and conditions acceptable to Hartford Great Health Corp., and ultimately achieving profitable operations. Management believes that Hartford Great Health Corp.s business plan provides it with an opportunity to continue as a going concern. However, management cannot provide assurance that Hartford Great Health Corp. will meet its objectives and be able to continue in operation.\nThe financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result from the possible inability of Hartford Great Health Corp. to continue as a going concern.\nNOTE 3. STOCKHOLDERS EQUITY\nPreferred Stock\nThe Company is authorized to issue 5,000,000 shares of preferred stock with a par value of $0.001 per share. No shares of preferred stock have been issued or outstanding since Inception (April 2, 2008).\nCommon Stock\nThe Company is authorized to issue 300,000,000 shares of common stock with a par value of $0.001 per share. On November 24, 2020, the Company issued 1,000,000 shares of common stock to a significant shareholder of the Company at $0.02 per share. The company had a total of 100,108,000 shares of common stock issued and outstanding at both of July 31, 2022 and 2021.\nNOTE 4. ACQUISITIONS, JOINT VENTURES AND DECONSOLIDATION\nJoint Venture - HF Intl Education\nOn March 22, 2019, HFSH entered into a joint venture agreement (the JV agreement) with Shanghai Jingyu Education Tech Ltd. (SH Jingyu) and one individual investor, to form a new entity - HF Intl Education to provide childcare education services. HFSH initially owned 65.0% ownership HF Intl Education, and reduced to 61.0% during the year ended on July 31, 2020 because of equity transactions between noncontrolling shareholders. On June 19, 2020, the board of HF Intl Education decided to increase registered capital to RMB10 million from RMB5 million, and three out of four noncontrolling shareholders gave up the subscription rights. As a result, HFSH held 75.5% of HF Intl Education and a total of 24.5% equity was held by noncontrolling shareholders. Pursuant to the board meeting held on June 1, 2021, the noncontrolling shareholders sold a total 14.5% equity at zero consideration to HFSH. As a result, HFSH holds 90.0% of HF Intl Education and $403,131 noncontrolling loss was absorbed by HFSH as a result of the ownership restructure at HF Intl Education.\nContinuous operation losses caused by the market uncertainties including pandemic and government regulations, HF Intl Education entered agreements to sell the copyrights of seven education textbooks and ten HaiDeFuDe registered trademarks owned for RMB1.2 million and RMB1.0 million, respectively, to Hartford Health Management (Shanghai) Co., Ltd (HFHM) in March 2021 with approval of the board of directors. The CEO of HFHM is a shareholder of the Company who owns more than 5% of the Companys common stocks.\nOperation result of HF Intl Education are included in the Companys consolidated financial statements commencing on the formation date. The Company classifies the ownership interest held by other four parties as Noncontrolling interest on the consolidated balance sheet.\nAcquisition of Gelinke\nOn July 20, 2020, HF Intl Education entered an agreement with two individuals to acquire the whole ownership of Gelinke, who engages at early childhood education services in Changning District, Shanghai. The results of operations of the acquired entities are included in the Companys consolidated financial statements commencing on the acquisition date. The Company has recorded an allocation of purchase price to Gelinkes tangible and identifiable intangible assets acquired and liabilities assumed based on their fair value at the acquisition date. The Company accounted the acquisition transaction in accordance with FASB ASC 805, Business Combinations, under acquisition accounting method. The related transaction costs were immaterial and included in General and administrative expenses in the accompanying consolidated statements of operations. The acquisition was completed on August 31, 2021. The calculation of purchase price and purchase price allocation is as follows:\nSCHEDULE OF RECOGNIZED IDENTIFIED ASSETS ACQUIRED AND LIABILITIES ASSUMED\nAssets Acquired and\nLiabilities Assumed\nCash and cash equivalents 1,809\nRestricted Cash 25,009\nPrepaid and Other current receivables 4,696\nProperty and Equipment, net 4,294\nUnearned revenue (78,696 )\nGoodwill 67,712\nTotal consideration* 24,824\n* $10,462 (RMB70,000) payable to the acquiree plus $14,362 (RMB100,000) cash payment totaled $24,824 consideration for the acquisition.\nGoodwill is mainly attributable to synergies expected from the acquisition of license, list of customers and teacher workforce. Due to unfavorable operation result of Gelinke during the year ended July 31, 2021, management determined that $67,712 goodwill generated from Gelinke Acquisition was fully impaired.\nOther Acquisitions\nIn January and February 2019, HFSH entered agreements to acquire 85 percent ownership of Shanghai Senior Health Consulting Ltd. (SH Senior) and 55 percent ownership of Shanghai Pasadena Ltd. (SH Pasadena). On December 31, 2020, HFSH withdrew from the two acquisition agreements. No penalty results from the withdrawn.\nIn January 2019, HFSH entered agreements to acquire 100 percent equity interest of Shanghai Luo Sheng International Trade Ltd. (SH Luosheng) and the agreement has not yet taken effect. On August 1, 2022, HFSH decided to withdraw from the agreement. There was no penalty levied or to be levied due to delayed execution or inexecution.\nDisposal of subsidiary\nOn December 31, 2020, HFSH disposed its 90 percent owned subsidiary - Qiao Garden Intl Travel to an individual (the Disposal). The individual is a relative of the CEO, Qiao Garden Intl Travel became a related party after deconsolidation. The operation results, assets and liabilities, and cash flows of Qiao Garden Intl Travel were deconsolidated from the Companys consolidated financial statements effective on December 31, 2020. The Disposal of Qiao Garden was consummated through a three-party settlement among HFSH, SH Qiaohong and Qiao Garden Intl Travel (the Three-Party Settlement): the original investment RMB 4.5 million plus RMB 0.5 million investment income were agreed to returned from Qiao Garden Intl Travel as a result of the Disposal and settled with a payable due to SH Qiaohong at SHHF, who was a debtor of Qiao Garden Intl Travel, see Note 14, Related Party Transactions.\nNet assets (liabilities) disposed of:\nSCHEDULE OF NET ASSETS (LIABILITIES) DISPOSED OF SUBSIDIARY\nNet assets (liabilities) disposed of:\nCash and cash equivalents\nRestricted cash 29,944\nRelated party receivable 782,224\nRelated party payable (98,615 )\nOther current payable (3,876 )\nNoncontrolling interest (60,812 )\nNet assets of the subsidiary, excluding noncontrolling interest 649,037\nConsideration 753,354\nGain on disposal of the subsidiary (104,317 )\nGain on disposal of noncontrolling interest (60,812 )\nGain on disposal of the subsidiary, excluding noncontrolling interest (43,505 )\nNet inflow / (outflow) of cash and cash equivalents in respect of the disposal subsidiary:\nSCHEDULE OF NET INFLOW (OUTFLOW) OF CASH AND CASH EQUIVALENTS OF DISPOSAL SUBSIDIARY\nCash and cash equivalents (172 )\nRestricted cash (29,944 )\nCash and cash equivalents deconsolidated (30,116 )\nNOTE 5. DISCONTINUED OPERATION\nImpacted by the government regulation newly implemented in education industry and the restrictions posted by the Chinese government to control the pandemic in China since 2021, the Companys business hasnt been developed as planned and occurred significant loss from the early child education practice. To avoid further operation losses, subsequently on August 1, 2022, HFSH entered a contract with a related party, Shanghai Oversea Chinese Culture Media Ltd. (SH Oversea), to sell 90 percent ownership of HF Intl Education and its subsidiaries for $900 (RMB 5,850). On August 1, 2022, HFUS entered a contract with SH Oversea and another individual, to sell 100 percent ownership of HZHF and its subsidiaries for $1,000 (RMB 6,500).\nAs of July 31, 2022, the assets and liabilities grouped under Education and Hospitality segments classified as assets and/or liabilities held for sale, and it is the Companys intention to complete the sales of these assets within the upcoming year. The transactions meet the criteria to be reported as a discontinued operation as they constitute significant strategic business shifts for the Company. We have reported, for all periods presented, the financial condition, results of operations, and cash flows of the operation segments as discontinued operations in the accompanying consolidated financial statements.\nThe total assets and liabilities of Education and hospitality segments that are classified as held for sale on the Companys consolidated balance sheet as of July 31, 2022, are as follows:\nSCHEDULE OF DISCONTINUED OPERATIONS OF FINANCIAL STATEMENTS\nJuly 31, 2022\nJuly 31, 2021\nAssets\nCurrent Assets\nCash and cash equivalents $ 4,938 $ 14,873\nPrepaid and Other current receivables 45,532 311,594\nRelated party receivable 428,519 325,555\nInventory 305,124 323,815\nProperty and equipment, net 582,707 585,160\nROU assets-operating lease 2,836,698 3,837,187\nOther assets 296,218 321,806\nTotal Assets held for sale $ 4,499,736 $ 5,719,990\nLiabilities\nCurrent Liabilities\nRelated party loan and payables $ 1,321,549 $ 1,332,338\nContract liabilities 547,906 545,346\nLease liabilities, current and noncurrent 3,715,688 4,071,767\nOther current payable 401,782 553,841\nOther liabilities 357,796 368,715\nTotal Liabilities held for sale $ 6,344,721 $ 6,872,007\nFor the years ended July 31, 2022 and 2021, results of operations from HF Intel Education and its subsidiaries, and HZHF and its subsidiary were as follows:\nFor the years ended July 31,\nNet sales $ 561,262 $ 553,459\nCost of sales 677,093 722,838\nGross profit (115,831 ) (169,379 )\nOperating expenses:\nSelling, general, and administrative expenses 1,579,922 2,520,817\nImpairment - 70,514\nTotal operating expenses 1,579,922 2,591,331\nIncome (Loss) from discontinued operations before income taxes (1,695,753 ) (2,760,710 )\nIncome tax benefit (expense) - -\nIncome (loss) from discontinued operations, net of taxes before gain from sale of discontinued operations (1,695,753 ) (2,760,710 )\nLoss from sale of discontinued operations, net of taxes - -\nIncome from discontinued operations, net of taxes $ (1,695,753 ) $ (2,760,710 )\nFor the years ended July 31, 2022 and 2021, net cash used in discontinued operations - HF Intel Education and its subsidiaries, and HZHF and its subsidiary were as follows:\nYears ended July 31,\nCash flow of discontinued operations:\nOperating cash flows $ (656,663 ) $ (4,695,107 )\nInvesting cash flows (145,048 ) (155,566 )\nNet cash used in discontinued operations $ (801,711 ) $ (4,850,673 )\nNOTE 6. RELATED PARTY TRANSACTIONS\nRelated Party Receivables\nAs of July 31, 2022, $ 428,519 and $325,555 related party receivables were allocated to current assets held for sales, see Note 5, under Assets and liabilities held for sale.\nRelated Party Payables\nAs of July 31, 2022 and 2021, amounts of $620,876 and $616,159, are payable to SH Qiaohong, respectively. The balances were mainly funding support from SH Qiaohong for operation. The funding support bears no interest and due on demand.\nHFSH had payable balances to Shanghai Oversea Chinese Culture Media Ltd. (SH Oversea), an entity managed by the same management team, in the amounts of $3,531,064 and $2,926,782 as of July 31, 2022 and 2021, respectively. The payable is funding support from SH Oversea for operation, bears no interest and due on demand.\nAs of July 31, 2022 and 2021, amount of $290,000 and $145,000, respectively, borrowed in form of a short-term loan at 5% per annum from a related party, Hartford Hotel Investment Inc., an entity managed by the same management team. $11,857 and $3,856 of interest expenses were recorded during the year ended July 31, 2022 and 2021, respectively. The unpaid principal and interest will be due on demand.\nThe remaining related party payable of $39,583 and $80,477 as of July 31, 2022 and 2021, respectively, represents the unpaid portion of operating advances made to the Company by affiliates which are managed by the same management team. These advances do not bear interest and are considered due on demand.\nAs of July 31, 2022, $1,317,690 and $1,332,338 related party payables were allocated to current liabilities held for sales, see Note 5, under Assets and liabilities held for sale.\nOther Related Party Transactions\nOffice space at Rosemead, CA is provided to Hartford Great Health Corp. at no cost by the sole executive officer. No provision for these costs has been included in these financial statements as the amounts are not material.\nNOTE 7. COMMITMENTS AND CONTINGENCIES\nThere has been below material contractual obligations and other commitments except the lease commitments disclosed in Note 12 Leases.\nLicense agreements\nIn June 2021, HF Intl Education and its three subsidiaries: PDHJ, HDFD and Gelinke entered license agreements with HFHM for the rights to use the intellectual Properties (the IPs) HFHM owns. The IPs cover in the license agreements are four set of curriculum structure designed and fifteen trademarks including HaiDeFuDe registered trademarks purchased from HF Intl Education. As a return, on a monthly basis, HF Intl Education and its subsidiaries pays 90% of its tuition revenue generated to HFHM as license usage fee. Due to impacts from the pandemic and new regulations issued by Chinese government in education industry, HF Intl Education occurred significant loss from operation. On July 2022, both parties mutually agreed to amend the fee to 20%, the amended rate is retrospectively applicable since June 1, 2021 and recaptured in 2022. As a result, the Company incurred $6,664 and $161,783 license fees to HFHM for the year ended July 31, 2022 and 2021 reported under discontinued operation, respectively.\nNOTE 8. INCOME TAXES\nWe recorded income tax expense of $800 for both of the years ended July 31, 2022 and 2021, due to the loss position for the years since inception.\nHartford Great Health Corp.s deferred tax assets, valuation allowance, and change in valuation allowance are as follows:\nSCHEDULE OF INCOME TAX VALUATION\nEstimated tax\nNet NOL\nbenefit from NOL\nChange in Net\ncarry- NOL and other tax Valuation valuation deferred\nPeriod Ending forward expires benefits (21%) allowance allowance tax asset\n31-Jul-21 $ 6,634,644 $ 1,990,393 $ (1,990,393 ) $ (919,938 ) $ -\n31-Jul-22 $ 7,400,620 $ 2,220,186 $ (2,220,186 ) $ (229,793 ) $ -\nIncome taxes at the statutory rate are reconciled to reported income tax expense (benefit) as follows:\nSCHEDULE OF EFFECTIVE INCOME TAX RATE RECONCILIATION\nFederal income tax rate 21.0 % 21.0 %\nState income tax rate 8.8 % 8.8 %\nForeign tax difference (4.8 )% (4.1 )%\nNon-taxable item adjustment - % (3.2 )%\nGILTI - % - %\nValuation allowance (25.0 )% (22.5 )%\nOthers - % - %\nEffective tax rate 0.0 % 0.0 %\nAt this time, the Company is unable to determine if it will be able to benefit from its deferred tax asset. There are limitations on the utilization of net operating loss carry-forwards, including a requirement that losses be offset against future taxable income, if any. In addition, there are limitations imposed by certain transactions which are deemed to be ownership changes. Accordingly, a full valuation allowance has been established for the entire deferred tax asset. Other temporary differences and estimated permanent differences are considered immaterial. Open tax years subject to examination by the IRS range from August 1, 2017 to the present. The Company has no uncertain tax positions.\nThe Company has been in loss position for years since inception and zero balances of deferred tax assets and liabilities as of the reporting periods ended. There was no GILTI tax for the Company for the years ended July 31, 2022 and 2021 due to the operation losses incurred.\nNOTE 9. SEGMENT INFORMATION\nThe Company currently operates in following industry segments: hospitality (hotel and travel agency) and early childhood education industry in China.\nSegment information on assets as of July 31, 2022 and revenue generated during the year ended July 31, 2022, as follows:\nSCHEDULE OF SEGMENT INFORMATION\nHospitality\n(Discontinued Operation)\nEducation\n(Discontinued Operation)\nCorporate and unallocated Total\nRevenue $ 51,342 $ 509,920 $ - $ 561,262\nOperating loss (129,352 ) (1,566,401 ) (177,913 ) (1,873,666 )\nLoss before tax (182,979 ) (1,399,172 ) (189,631 ) (1,771,782 )\nNet Loss Attributable to Hartford Great Health Corp (129,422 ) (1,259,249 ) (190,430 ) (1,579,101 )\nTotal assets (excluding Intercompany balances) 303,703 4,196,033 38,620 4,538,356\nAssets allocated to held for sale (303,703 ) (4,196,033 ) - (4,499,736 )\nSegment information on assets as of July 31, 2021 and revenue generated during the year ended July 31, 2021, as follows:\nHospitality\n(Discontinued Operation)\nEducation\n(Discontinued Operation)\nCorporate and\nunallocated\nTotal\nRevenue $ 118,309 $ 435,150 $ - $ 553,459\nOperating loss (275,417 ) (2,588,174 ) (152,774 ) (3,016,365 )\nLoss before tax 81,520 (2,764,798 ) (158,261 ) (2,841,539 )\nNet Loss Attributable to Hartford Great Health Corp 121,966 (2,216,239 ) (159,061 ) (2,253,334 )\nTotal assets (excluding Intercompany balances) 388,688 5,441,654 (87,744 ) 5,742,598\nNOTE 10. SUBSEQUENT EVENTS\nIn accordance with ASC 855, Subsequent Events, the Company has evaluated subsequent events through the date of issuance of these financial statements and has noted the following subsequent events to be disclosed.\nOn August 1, 2022, see note 5, under section Assets and liabilities held for sale, HFSH entered a contract with a related party, SH Oversea, to sell 90 percent ownership of HF Intl Education and its subsidiaries for $900 (RMB 5,850). On August 1, 2022, HFUS entered a contract with SH Oversea and another individual, to sell 100 percent ownership of HZHF and its subsidiaries for $1,000 (RMB 6,500).\nOn August 1, 2022, HFSH decided to withdraw from the agreement entered in January 2019 to acquire 100 percent equity interest of Shanghai Luo Sheng International Trade Ltd. (SH Luosheng). There was no penalty levied or to be levied due to delayed execution or inexecution.\nOn August 17, 2022, the Company borrowed a note in a total amount of $30,000, in form of a short-term loan at 5% per annum from a related party. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot Applicable. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nAn evaluation was performed under the supervision of our management, including our Chief Executive Officer and Chief Financial Officer (principal financial officer), of the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act) as of the end of the period covered by this Annual Report. Based on that evaluation, our management, including our Chief Executive Officer and Chief Financial Officer, concluded that, as of July 31, 2022, our disclosure controls and procedures were not effective to ensure that information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms due to material weaknesses in our internal controls described below.\nManagements Annual Report on Internal Control Over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Exchange Act Rule 13a-15(f). Our internal control system is intended to provide reasonable assurance to our management and board of directors regarding the preparation and fair presentation of published financial statements and that we have controls and procedures designed to ensure that the information required to be disclosed by us in our reports that we will be required to file under the Exchange Act is accumulated and communicated to our management as appropriate to allow timely and informed decisions regarding financial disclosure.\nOur management assessed the effectiveness of our internal control over financial reporting as of July 31, 2022. Based on this assessment, management believes that as of July 31, 2022, our internal control over financial reporting was not effective based on those criteria.\nManagements assessment identified several material weaknesses in our internal control over financial reporting. These material weaknesses include the following:\n● Lack of proper authorization and approval procedures on significant business transactions.\n● Lack of competence accounting personnel at entity level and proper segregation of duties implemented.\nInherent Limitations Over Internal Controls\nOur management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal controls will prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Our control systems are designed to provide such reasonable assurance of achieving their objectives. Further, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our Company have been detected. These inherent limitations include, but are not limited to, the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the control. The design of any system of controls also is based in part upon certain assumptions about the likelihood of future events and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Over time, controls may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\nChanges in Internal Control Over Financial Reporting.\nWe have made no change in our internal control over financial reporting during the last fiscal year that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nAttestation Report of the Registered Public Accounting Firm.\nThis annual report does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our independent registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only managements report in this annual report on Form 10-K. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe following individual presently serves as our officers and directors:\nBoard\nName and\nPosition\nMunicipality of Residence\nAge\nPositions With the Company\nHeld Since\nPresident, Chief Executive Officer\nRose Hong Wang Los Angeles, CA\nand Director\nChief Financial Officer, Secretary and\nSheng-Yih Chang Los Angeles, CA\nDirector\nYuan Lu Shanghai, CHINA\nDirector\nXin Dong Los Angeles, CA\nDirector\nEach of the directors will serve until the next annual meeting of stockholders of the Company and until such directors successor is elected and qualified or until such directors earlier death, resignation or removal. The following is information concerning the business backgrounds of each member of the board of directors:\nRose Hong Wang. From March 2018 to the present Ms. Wang has been Chief Financial Officer and Director of Hartford Hotel Investment Inc., Rosemead, CA, USA. In addition, since June 2010 to the present she has been Vice President and Director of Shanghai Qiao Garden Group Overseas Branch, CA, USA. From September 2006 to May 2010 she was the Assistant General Manager of Qiao Garden Group Investment Inc., CA, USA, In December 1998 Ms. Wang immigrated to the USA. From December 1996 to September 1998, she was the Assistant General Manager of Shanghai Watanabe Asset Management Co., Ltd., China. From September 1993 thru July 1995, she Studied Language and Literature at Shanghai International Studies University, China. In July 1990, Ms. Wang received her Bachelors Degree with Music Major from Xinjiang Normal University, China.\nSheng Yih Chang. Mr. Chang has served as the General Manager at Hartford Hotel, a commercial hotel in Rosemead California since March 2018. Mr. Chang served as a Product Manager at Jowett Group, a textile manufacturing company in the USA, from November 2015 through September 2017, as an Operational Manager and General Manager at A-Concepts Designs, a houseware supplier company in the USA, from January 2004 through October 2015, as a General Manager at Long Arch International, a carving crafts supplier in the USA, from December 2000 through December 2003, as a Sales Manager at EZ Wholesale, a general merchandise wholesaler in the USA, from July 1998 through November 2000, and as a technician at Richcom Computer Corporation, a computer service provider in China, from July 1996 through November 1997. Mr. Chang studied electrical engineering at the University of British Columbia and holds a Bachelor of Science in Electrical Engineering from California State University, Northridge.\nYuan Lu. Ms. Lu graduated in 2008 with a Bachelors Degree from Anhui University of Technology in China majoring in International Trade and Economics. In 2013, Ms. Lu earned a Masters Degree in International Language Arts from Shanghai University of Finance and Economics in China. From 2008-2009, Ms. Lu was an Assistant Teacher at New Channel International Educated Group, Ltd. From 2009-2010, Ms. Lu was a Customs Broker and Procurement Buyer at Shanghai Pan-Resources Imp&Exp Co., Ltd. From 2010 through the present, Ms. Lu has served as the Assistant CEO at Shanghai Overseas Chinese Culture Media Co., Ltd.\nXin Dong. Mr. Dong has served as the Executive Director and General Manager of Shanghai Huitong Health Management Company, a senior care and traditional health management company, in China since September 2017. From July 2016 through August 2017, Mr. Dong acted as the Vice President and General Manager of Shanghai Huicai Financial Information Service Co., Ltd., a financial service and small loan company, in China. Mr. Dong has also served as the General Manager of Shenzhen Maoli International Trading Co., Ltd., an international trading company in Shenzhen, China, from April 2012 through June 2016, and as a Project Manager and Market Representative at Nanjing Hongyuan Electronic Technology Company, an electronics manufacturing company, from July 2007 through March 2012. Mr. Dong holds a Masters in International Finance and Trade from Shanghai Jiaotong University and a degree in Computer Science from Jiangsu University.\nTerm of office\nAll officers and directors listed above will remain in office until the next annual meeting of our stockholders, and until their successors have been duly elected and qualified or until removed from office in accordance with our bylaws. There are no agreements with respect to the election of Directors. We have not compensated our Directors for service on our Board of Directors, any committee thereof, or reimbursed for expenses incurred for attendance at meetings of our Board of Directors and/or any committee of our Board of Directors. Officers are appointed annually by our Board of Directors and each Executive Officer serves at the discretion of our Board of Directors. We do not have any standing committees. Our Board of Directors may in the future determine to pay Directors fees and reimburse Directors for expenses related to their activities.\nNone of our Officers and/or Directors have filed any bankruptcy petition, been convicted of or been the subject of any criminal proceedings or the subject of any order, judgment or decree involving the violation of any state or federal securities laws within the past five (5) years.\nDirector Independence\nThe Board consists of four members, of which Yuan Lu and Xin Dong meet the independence requirements of the Nasdaq Stock Market as currently in effect.\nCommittees and Terms\nThe Board of Directors (the Board) has not established any committees. The Company will notify its shareholders for an annual shareholder meeting and that they may present proposals for inclusion in the Companys proxy statement to be mailed in connection with any such annual meeting; such proposals must be received by the Company at least 90 days prior to the meeting. No other specific policy has been adopted in regard to the inclusion of shareholder nominations to the Board of Directors.\nCode of Ethics\nTo date, we have not adopted a Code of Ethics applicable to our principal executive officer and principal financial officer because the Company has no meaningful operations within the United States of America. The Company does not believe that a formal written code of ethics is necessary at this time. We expect that the Company will adopt a code of ethics if and when the Company successfully completes a business combination that results in the acquisition of an on-going business and thereby commences operations within the United States. ITEM 11. EXECUTIVE COMPENSATION\nBeginning January 1, 2019, a monthly payroll salary of $3,000 has been offered to Sheng-Yih Chang, the Companys CFO. No other officer or director has received annual compensation. There has been no compensation awarded to, earned by, or paid to the named executive officer or director other than the CFOs wage. There is no compensation to the executive officers planned for the next year. Such compensations will be brought to discussion in next board meeting.\nEmployment Agreements\nAs of July 31, 2022, all employees and officers in China have entered into employment agreements with the Companys subsidiaries. However, the Company has not entered into employment agreements with any of its executive officers in the US as of July 31, 2022.\nAnticipated Officer and Director Remuneration\nExcept for the monthly wage paid to the CFO, the Company has not to date paid any other compensation owed to any officer or director as of date hereto. The Company intends to begin to pay annual salaries to all its officers and will pay an annual stipend to its directors when, and if, it completes a primary public offering for the sale of securities and/or the Company reaches profitability, experiences positive cash flow and/or obtains additional funding. At such time, the Company anticipates offering cash and non-cash compensation to officers and directors. In addition, although not presently offered, the Company anticipates that its officers and directors will be provided with a group health, vision and dental insurance program at subsidizes rates, or at the sole expense of the Company, as may be determined on a case-by-case basis by the Company in its sole discretion.\nStock Option Plan\nWe do not have a stock option plan and we have not issued any warrants, options or other rights to acquire our securities. However, we may adopt an incentive and non-statutory stock option plan in the future.\nEmployee Pension, Profit Sharing or other Retirement Plans\nWe do not have a defined benefit, pension plan, profit sharing or other retirement plan, although we may adopt one or more of such plans in the future.\nSection 16(a) Beneficial Ownership Reporting Compliance\nWe are not registered under the Securities Exchange Act of 1934, as amended, and are not subject to the reporting requirements of Section 16(a). ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nAs of November 14, 202, there are a total of 100,108,000 shares of our common stock outstanding, our only class of voting securities currently outstanding. The following table describes the ownership of our voting securities by: (i) each of our officers and directors; (ii) all of our officers and directors as a group; and (iii) each shareholder known to us to own beneficially more than 5% of our common stock. All ownership is direct, unless otherwise stated.\nShares\nBeneficially Percentage\nName of Beneficial Owner Address of Beneficial Owner Owned Number (%)\nRM 3806 218 WUSONG RD, HONGKOU DISTRICT\nYUAN LU SHANGHAI, CHINA 32,440,000 32.4 %\nROSE HONG WANG CARRIAGE HOUSE DRIVE, ARCADIA, CA 91006 11,000,000 11.0 %\nXIN DONG GLENDON WAY, ROSEMEAD, CA 91770 2,400,000 2.4 %\nSHENG-YIH CHANG GLENDON WAY, ROSEMEAD, CA 91770 1,000,000 1.0 %\nTotal Officers and Directors (4) 46,840,000 46.8 %\nEach shareholder known to us to own beneficially more than 5% of our common stock:\nShares Beneficially Percentage\nName of Beneficial Owner Address of Beneficial Owner Owned Number (%)\nLIANYUE SONG GLENDON WAY, ROSEMEAD, CA 91770 20,000,000.00 20.0 %\nRM 218 WUSONG ROAD, HONGKOU DISTRICT,\nDANFENG GU SHANGHAI, CHINA 8,300,000.00 8.3 %\n1F QIAO GARDEN 73 WUHUA RD, HONGKOU\nJIAMIN ZHU DISTRICT, SHANGHAI, CHINA 8,000,000.00 8.0 % ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nUS office space is provided to Hartford Great Health Corp. at no additional cost by the sole executive officer. No provision for these costs has been included in these financial statements as the amounts are not material. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table sets forth fees billed by our principal accounting firms of Simon & Edward, LLP and Haynie & Company in the last two years ended July 31, 2022:\nAudit Fees $ 26,000 $ 26,000\nAudit Related Fees 13,500 13,500\nAll other fees - 2,000\nTotal Fees $ 39,500 $ 41,500\nIt is the policy of our Board of Directors to engage the principal accounting firm selected to conduct the financial audit for our company and to confirm, prior to such engagement, that such principal accounting firm is independent of our company. All services of the principal accounting firm reflected above were approved by the Board of Directors.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENTS SCHEDULES\nThe following documents are filed as part of this Annual Report:\n1. Consolidated Financial Statements\nOur consolidated financial statements are listed under Part II, Item 8, of this Annual Report.\n2. Financial Statement Schedules\nAll financial statement schedules have been omitted because they are not required or are not applicable, or the required information is shown in our Consolidated Financial Statements or the notes thereto.\n3. Exhibits\nThe following exhibits are filed with or incorporated by referenced in this report:\n21.1* Subsidiaries of the Company\n31.1* Certification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 for Rose Hong Wang.\n31.2* Certification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 for Sheng-Yih Chang\n32* Certification pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 for Rose Hong Wang and Sheng-Yih Chang\n101.INS* Inline XBRL Instance Document\n101.SCH* Inline XBRL Taxonomy Extension Schema Document\n101.CAL* Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF* Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB* Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE* Inline XBRL Taxonomy Extension Presentation Linkbase Document\n104* Cover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed herewith\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nHARTFORD GREAT HEALTH CORP.\nDate: November 14, 2022 By: /s/ ROSE HONG WANG\nRose Hong Wang\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934 this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ Rose Hong Wang\nChief Executive Officer, President, Dir. November 14, 2022\nRose Hong Wang\n(Principal Executive Officer)\n/s/ Sheng-Yih Chang\nChief Financial Officer November 14, 2022\nSheng-Yih Chang\n(Principal Accounting Officer)\n/s/ Yuan Lu\nDirector November 14, 2022\nYuan Lu\n/s/ Xin Dong\nDirector November 14, 2022\nXin Dong"
}