{
    "cik": "1492617",
    "company": "FLYWHEEL ADVANCED TECHNOLOGY, INC.",
    "filing_type": "10-K",
    "filing_date": "2022-12-28",
    "period_of_report": "2022-09-30",
    "sic": "7380",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1492617/0001493152-22-036631-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1492617/000149315222036631/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1492617/0001493152-22-036631.txt",
    "filename": "1492617_10K_2022_0001493152-22-036631.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\nAs used in this annual report, the terms we, us, our, the Company, mean Flywheel Advanced Technology, Inc. unless otherwise indicated.\nCautionary Note Regarding Forward Looking Statements\nThis report contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding our ability to locate and acquire an operating business and the resources and efforts we intend to dedicate to such an endeavor, our development of a viable business plan and commencement of operations, and our ability to locate sources of capital necessary to commence operations or otherwise meet our business needs and objectives. All statements other than statements of historical facts contained in this report, including statements regarding our future financial position, liquidity, business strategy and plans and objectives of management for future operations, are forward-looking statements. The words believe, may, estimate, continue, anticipate, intend, should, plan, could, target, potential, is likely, will, expect and similar expressions, as they relate to us, are intended to identify forward-looking statements. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe may affect our financial condition, results of operations, business strategy and financial needs.\nCorporate History\nFlywheel Advanced Technology, Inc. (formerly known as Pan Global Corp.) (the Company) was incorporated in the state of Nevada on April 30, 2010, under the name of Savvy Business Support, Inc. (Savvy). Savvys business was offering general business services/support to start-up companies, small and medium business planning to expand, individuals, and other business and organizations. Savvy was considered to be a shell company.\nOn April 25, 2013, Savvy entered into a Stock Exchange Agreement (the Pan Asia Exchange Agreement) with Pan Asia Infratech Corp. a Nevada corporation (Pan Asia). Pan Asia was incorporated in Nevada on July 13, 2012.\nPursuant to the Pan Asia Exchange Agreement, consummated on April 26, 2013, the stockholders of Pan Asia transferred to Savvy 100% of the outstanding capital stock of Pan Asia (consisting of 15,000 shares of common stock, no par value) in exchange for, on a pro rata basis, an aggregate of 90,000,000 shares of Savvys common stock (the Pan Asia Exchange). As a result of the Pan Asia Exchange, Pan Asia became a wholly owned subsidiary of Savvy, and the business of Pan Asia became the business of the Company.\nOn April 26, 2013, Savvy amended its Articles of Incorporation with the Secretary of State of Nevada thereby changing its name from Savvy Business Support, Inc. to Pan Global, Corp. On May 2, 2013, the OTCQB symbol of the Companys common stock was changed from SVYB to PGLO.\nOn July 16, 2020, as a result of a custodianship in Clark County, Nevada, Case Number: A-20-816264-B, Custodian Ventures LLC (the Custodian) was appointed custodian of Pan Global Corp.\nOn July 16, 2020, the Custodian appointed David Lazar as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer and Chairman of the Board of Directors.\nOn October 8, 2020, the Companys outstanding 7,100,000 shares Preferred A, Preferred C and Preferred D shares were converted on a one for one basis into 7,100,000 common shares. Concurrently these Preferred Shares were cancelled.\nIn November 2020 the Company designated 25,000,000 new Preferred Shares and 10,000,000 Par Value $0.0001 Preferred A-1 Shares were designated and awarded to Custodian Ventures for services performed and for loans extended to the Company. Each preferred share is convertible to 162 shares of common stock.\nOn May 5, 2021, an Order was entered in the Eighth Judicial District Court, Clark County, Nevada, Barring Unasserted Claims and Terminating Custodianship in Case No. A-20-816264-B, releasing the Company from all unasserted claims and debt which arose on or before the date of the order.\nOn July 13, 2021, a Stock Purchase Agreement was entered into between NYJJ Hong Kong Limited (the NYJJ) and Sparta Universal Industrial Ltd. (Sparta), wherein Sparta purchased 10,000,000 shares of Series A-1 Preferred Stock, par value $0.0001 per share (the A-1 Preferred Shares) of Company. As a result, Sparta became an approximately 90% holder of the voting rights of the issued and outstanding shares of the Company, on a fully diluted basis, and became the controlling shareholder. Sparta is controlled by Tang Siu Fung.\nAt the effective date of transfer, David Lazar ceased to be the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer and Chairman of the Board of as Directors, and the Company appointed:\n● Tang Siu Fung as President, Chief Executive Officer, and Chairman of the Board of Directors;\n● Cheng Sin Yi as Secretary, and Treasurer;\n● Tin Sze Wai as Director;\n● Ip Tsz Ying as Director;\n● Ho Yiu Chung as Director; and\n● Lai Chi Chuen as Director.\nOn November 21, 2021, the Board of Directors and majority shareholder approved the change of the Companys name to Flywheel Advanced Technology, Inc., and the change of the Companys trading symbol became effective on August 3, 2022.\nOn November 22, 2021, the Board of Directors of the Company approved a reverse split of the issued and outstanding shares of its common stock on a 1:100 basis.\nOn July 13, 2022, the Company was advised by the Financial Industry Regulatory Authority (FINRA) that the 1:100 reverse stock split of the Companys common stock would become effective on July 14, 2022. The 1:100 reverse stock split of the Companys common stock became effective on July 14, 2022.\nFollowing the effectiveness of the reverse stock split, there are currently 1,551,550 shares of common stock issued and outstanding as compared to 155,155,000 shares of the Companys common stock issued and outstanding prior to the reverse stock split. The new CUSIP of the Companys common stock is 69806B205.\nThe Certificate of Amendment to the Articles of Incorporation effectuating the name change was filed with the Secretary of State of the State of Nevada. On August 5, 2022, the Company was informed by FINRA that the new ticker symbol of the Company is FWFW.\nOn September 15, 2022, the Company filed with the Secretary of State of the State of Nevada an Amendment (the Preferred Stock Amendment) to the Certificate of Designation for its Preferred Stock. The Preferred Stock Amendment was approved by the Board of Directors of the Company and Sparta, the sole holder of all the 10,000,000 issued and outstanding shares of Preferred Stock.\nPursuant to the Preferred Stock Amendment, the conversion rate of the Preferred Stock was changed to provide that each share of Preferred Stock shall be convertible, at the option of the holder, into 1.62 fully paid and nonassessable shares of the Companys common stock. The Preferred Stock Amendment was necessary as the terms of the Certificate of Designation for the Preferred Stock expressly provided that the conversion ratio of 162 shares of common stock for each share of Preferred Stock would not be reduced in the event of a stock split or other capitalization of the Company.\nAlso on September 15, 2022, Sparta provided notice to the Company to convert all of the issued and outstanding Preferred Stock into 16,200,000 shares of common stock. The Board of Directors of the Company approved the conversion and agreed that the Company would not charge any fee or expense for such conversion. Accordingly, as of the date of this Annual Report on Form 10-K, Sparta is currently the holder of 16,200,000 of the 17,751,564 shares of common stock issued and outstanding, or approximately 91.3%.\nBlue Print Agreement\nOn November 30, 2022, the Company incorporated Blue Print Global, Inc. (Blue Print) in the British Virgin Islands to establish an operation to source the supply and sale of warehouse patrol robots. The Company holds 70% of Blue Print, and the balance is held by So Ha Tsang and Sau Ping Leung (the Blue Print Shareholders), two individuals unrelated to the Company, with each party holding 15%.\nThe Company and the Blue Print Shareholders executed a Shareholder Agreement on December 7, 2022 (the Blue Print Shareholder Agreement), regarding the governance and other matters relating to Blue Print. According to the Shareholder Agreement, where an act is to be effected by the board, the requirement will be read as requiring the shareholders to do everything in their power to bring about that act and not as requiring the board to do so.\nIf all of the shareholders determine that Blue Print requires additional funds, the Company agreed that it will provide Blue Print with an interest-bearing shareholder loan at an annual interest rate equating to the Hong Kong interbank offered rate, quoted as an annual rate for a one (1) month period, prevailing at close of business on the next business day immediately after the loan is granted plus 3%.\nThe shareholders have a preemptive right on any shares to be issued by Blue Print. The shareholders also agreed not to directly or indirectly sell, assign, transfer, pledge, hypothecate or otherwise dispose of or in any other way encumber their shares in Blue Print except with the prior written approval of all of the shareholders. Each shareholder was granted a right of first offer to purchase any shares in Blue Print that a shareholder desires to transfer.\nBlue Print appointed Yiu Chung Ho as its sole director. Mr. Ho graduated with a Bachelor of Engineering in Mechanical Engineering from the Hong Kong University of Science and Technology. He has broad experience as a senior mechanical engineer in a wide range of areas, including making automotive components design, creating automatics processes, and designing facilities for mass production. He also acted as a director of Goldman Technology and had registered two lighting technology patents. Mr. Ho is fully responsible for the development and execution of Blue Prints business plan. Under his leadership, the Company expects Blue Print will build up a technical team to manage its robot supply sources, a sales and marketing team to provide support to its present and future sales agents, and a customer service team to give post-sales support to robot buyers.\nOn December 7, 2022, Blue Print entered into an Agency Agreement (the Agency Agreement) with International Supply Chain Alliance Co., Ltd. of Hong Kong (ISCA). Pursuant to the Agency Agreement, Blue Print appointed ISCA as its authorized agent to distribute warehouse patrol robots in the Peoples Republic of China (China). The Agency Agreement is valid for five years and will be automatically renewed for another five years unless a written non-renewal notice is provided by either party at least 30 days before the expiration date. However, there is no early termination option in the Agency Agreement.\nThe Agency Agreement provides that ISCA will use its best efforts to fulfill its obligations to inform Blue Print of market conditions and the market position affecting Blue Print in China, and Blue Print agrees to support ISCA in fulfilling its obligations by making available all product information, providing general sales terms and conditions, a valid pricelist, and all necessary information and direction.\nDuring and for a period of one year after termination of the Agency Agreement, ISCA agrees to not directly or indirectly engage in the sale or trade of any product that is comparable to and/or competitive and/or could serve as a substitute for the product.\nBlue Print agrees to pay ISCA a 10% commission based on all delivered and invoiced direct orders, provided that a purchaser fulfilled all its obligations of the sales agreement to Blue Print. A purchaser is deemed to have fulfilled its obligations at the moment Blue Print has received its payment for the products.\nBlue Prints minority shareholder, Sau Ping Leung, and one of ISCAs working partners, Kai Shun Kwong, are husband and wife.\nQBS System Agreement\nOn December 15, 2022, the Company, entered into a share exchange agreement (the QBS Share Exchange Agreement) with QBS System Limited, a limited company incorporated under the laws of Hong Kong (QBS System), and QBS Flywheel Limited, a company incorporated under the laws of Australia (the QBSFL). Subject to the closing conditions set forth in the Share Exchange Agreement, at the closing QBSFL will transfer and assign to the Company all of the issued and outstanding shares of QBS System in exchange for 8,939,600 newly issued shares of the Companys common stock, par value $0.0001 per share (the Common Stock). Following the closing of the share exchange, there will be no change in the officers and directors of the Company, and QBS System will continue its business as a wholly owned subsidiary of the Company.\nBusiness\nBusiness Objectives of the Company\nWe do not currently engage in any business activities that provide revenue or cash flow. Our management is actively exploring an acquisition of an operating company, with revenue and the potential for growth, through a business combination with an entity which has recently commenced operations, is a developing company or is otherwise in need of additional funds for the development of new products or services or expansion into new markets or is an established business experiencing financial or operating difficulties and is in need of additional capital. Alternatively, a business combination may involve the acquisition of, or merger with, an entity which desires access to the U.S. capital markets.\nOn November 30, 2022, the Company incorporated Blue Print in the British Virgin Islands to establish an operation to source the supply and sale of warehouse patrol robots. The Company holds 70% of Blue Print, and the balance is held by the Blue Print Shareholders, with each party holding 15%. The Company expects Blue Print will build up a technical team to manage its robot supply sources, a sales and marketing team to provide support to its present and future sales agents, and a customer service team to give post-sales support to robot buyers.\nOn December 15, 2022, the Company, entered into the QBS Share Exchange Agreement with QBS System, and QBSFL. Subject to the closing conditions set forth in the Share Exchange Agreement, at the closing QBSFL will transfer and assign to the Company all of the issued and outstanding shares of QBS System in exchange for 8,939,600 newly issued shares of the Companys common stock. Following the closing of the QBS Share Exchange Agreement, there will be no change in the officers and directors of the Company, and QBS System will continue its business as a wholly owned subsidiary of the Company.\nBased on information provided to the Company, QBS System provides IoT solutions and services to assist its clients build applications using available IoT devices, sensors, frameworks, and platforms, to integrate hardware and software solutions with clients existing landscape or implement new IoT solutions for enterprises. QBS system, which was founded in 2011, provides full-range IoT services comprising consulting, development and implementation, analytics, support, and evolution. It has a business portfolio providing IoT integration solution services, IoT maintenance, support services, IoT projects and ventures BPO services, and approximately nine years of experience in Hong Kong providing IoT software and hardware engineering services. Clients range across various industries, such as logistics and supply chain management, food & beverage, automation and smart building.\nThe closing of the share exchange will not occur until QBS System delivers to the Company (i) audited consolidated balance sheets of QBS System and its subsidiaries as of March 31, 2021, and 2022, and the related audited consolidated statements of operations, comprehensive income (loss), stockholders equity and cash flows for the fiscal year ended March 31, 2021 and 2022, together with the notes to such statements and the opinion of Paris Kreit & Chui CPA LLP, and (ii) unaudited consolidated balance sheets of QBS System and its subsidiaries as of October 31, 2022, and the related unaudited consolidated statements of operations, comprehensive income (loss), stockholders equity and cash flows for the period from April 1, 2022, to October 31, 2022. In addition to the delivery of the financial statements required by the Securities and Exchange Commission, the consummation of the share exchange is subject to other closing conditions, including, among other matters the accuracy of the parties respective representations and warranties in the Share Exchange Agreement, subject to specified materiality qualifications and the absence of any material adverse conditions of QBS System. The Share Exchange Agreement is set forth as Exhibit 10.3 in the Companys Form 8-K, which it filed on December 16, 2022.\nWe have also had discussions with other businesses that are interested in exploring a transaction with us and we will continue to pursue those and other opportunities. We cannot assure you that we will be successful in completing any acquisition.\nCompetition and Market Conditions\nUntil we successfully close the QBS transaction, or another transaction, we will continue to face substantial competition to identify and pursue a business venture. The primary source of competition is expected to be from other companies organized and funded for similar purposes, including small venture capital firms, blank check companies, and wealthy investors, many of which may have substantially greater financial and other resources than we do. In light of our limited financial and human resources, we are at a competitive disadvantage compared to many of our competitors in our efforts to obtain an operating business or assets necessary to commence our operations in a new field. Additionally, with the economic downturn caused by the coronavirus pandemic, many venture capital firms and similar firms and individuals have been seeking to acquire businesses at discounted rates, and we therefore currently face additional competition and resultant difficulty obtaining a business. We expect these conditions to persist at least until such time as the economy recovers. Further, even if we are successful in obtaining a business or assets for new operations, we expect there to be enhanced barriers to entry in the marketplace in which we decide to operate as a result of reduced demand and/or increased raw material costs caused by the pandemic and other economic forces that are beyond our control.\nRegulations\nDepending on the business or businesses we may acquire in the future, we may become subject to other laws or regulations that require us to make material expenditures on compliance including the increasing state level regulation of privacy. Any such requirements could require us to divert significant human and capital resources on compliance, which could have an adverse effect on our future operating results.\nEmployees\nAs of the date of this Report, we do not have employees. However, an entity controlled by our Chief Executive Officer provides part-time consulting services to us without compensation.\nAvailable Information\nWe do not currently have a website. You may access our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports, as well as other reports relating to us that are filed with, or furnished to, the Securities and Exchange Commission (SEC) free of charge on the SECs website (www.sec.gov) as soon as reasonably practicable after such material is electronically filed with, or furnished to, the SEC. ITEM 1A. RISK FACTORS\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide information required by this Item. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone ITEM 2. PROPERTIES\nThe Companys principal business and corporate address is 1185 Avenue of the Americas, 3rd Floor, New York, New York 10036. We are operating in space provided at no expense by our officers and directors. ITEM 3. LEGAL PROCEEDINGS\nWe are not currently involved in any legal proceedings, and we are not aware of any pending or potential legal actions. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS\nMarket Information\nOur common stock is not listed on any securities exchange and is quoted on the OTC Pink Market under the symbol FWFW Because our common stock is not listed on a securities exchange and its quotations on OTC Pink are limited and sporadic, there is currently no established public trading market for our common stock.\nHolders\nAs of December 28, 2022, there were 35 shareholders of record of the Companys common stock based upon the records of the shareholders provided by the Companys transfer agent. The Companys transfer agent is Vstock Transfer, 18 Lafayette Place, Woodmere, New York 11598, Telephone # 212-828-8436.\nDividends\nWe have never paid or declared any dividends on our common stock and do not anticipate paying cash dividends in the foreseeable future.\nOptions and Warrants\nWe do not have any outstanding options or warrants.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nWe currently do not have any equity compensation plans.\nUnregistered Sales of Equity Securities\nWe have previously disclosed all sales of securities without registration under the Securities Act of 1933. ITEM 6. SELECTED FINANCIAL DATA\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide information required by this Item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULT OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read together with our financial statements and the related notes and other financial information included elsewhere in this Annual Report. Some of the information contained in this discussion and analysis or set forth elsewhere in this Annual Report, including information with respect to our plans and strategy for our business, includes forward-looking statements that involve risks and uncertainties. See Cautionary Note Regarding Forward-Looking Statements.\nCautionary Note Concerning Factors That May Affect Future Results\nThis Annual Report, including Managements Discussion and Analysis of Financial Condition and Results of Operations contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. The Company may also make forward-looking statements in other reports filed with the Securities and Exchange Commission, in materials delivered to shareholders and in press releases. In addition, the Companys representatives may from time to time make oral forward-looking statements.\nForward-looking statements relate to future events and typically address the Companys expected future business and financial performance. Words such as plan, expect, aim, believe, project, target, anticipate, intend, estimate, should, could, forecast and other words and terms of similar meaning, typically identify such forward-looking statements. In particular, these include, among others, statements relating to:\n● the Companys strategy for growth, future revenues, earnings, cash flow, uses of cash and other measures of financial performance, and market position,\n● worldwide economic, political, and capital markets conditions, such as interest rates, foreign currency exchange rates, financial conditions of our suppliers and customers, and natural and other disasters or climate change affecting the operations of the Company or our suppliers and customers,\n● new business opportunities, product development, and future performance or results of current or anticipated products,\n● the scope, nature or impact of acquisition, strategic alliance and divestiture activities,\n● the outcome of contingencies, such as legal and regulatory proceedings,\n● future levels of indebtedness, common stock repurchases and capital spending,\n● future availability of and access to credit markets,\n● asset impairments,\n● tax liabilities,\n● information technology security, and\n● the effects of changes in tax (including the newly enacted Tax Cuts and Jobs Act), environmental and other laws and regulations in the United States and other countries in which we operate.\nOverview\nThe Company has no operations or revenue as of the date of this Report. We are currently in the process of developing a business plan. Management intends to explore and identify viable business opportunities within the U.S. including seeking to acquire a business in a reverse merger. Our ability to effectively identify, develop and implement a viable plan for our business may be hindered by risks and uncertainties which are beyond our control, including without limitation, the continued negative effects of the coronavirus pandemic on the U.S. and global economies.\nWe do not expect to generate any revenues over the next 12 months, unless we are able to enter into a business combination with an operating company. Our principal business objective for the next 12 months will be to seek, investigate and, if such investigation warrants, engage in a business combination with a private entity whose business presents an opportunity for our shareholders. During the next 12 months we anticipate incurring costs related to filing of Exchange Act reports, and possible costs relating to consummating an acquisition or combination. We believe we will be able to meet these costs through use of funds in our treasury and additional amounts, as necessary, to be loaned by or invested in us by our stockholders, management or other investors.\nWe intend to contract out certain technical and administrative functions on an as-needed basis in order to conduct our operating activities. Our management team will select and hire these contractors and manage and evaluate their work performance.\nResults of Operations\nYear Ended September 30, 2022, Compared to Year Ended September 30, 2021\nRevenues. During the years ended September 30, 2022, and 2021, we did not realize any revenues from operations.\nOperating expenses. For the year ended September 30, 2022, our total operating expenses was $204,130 resulting from general and administration expenses in the amount of $23,657, and professional fees in the amount of $180,473. For corresponding period ended September 30, 2021, operating expenses were $2,392,307, primarily due to stock-based compensation to a related party in the amount $2,369,070. General and administration expenses and professional fees were $4,159 and $19,078, respectively.\nLoss from operations. As a result of the foregoing, our loss from operations was $204,130 for the year ended September 30, 2022, compared to $2,392,307 for the year ended September 30, 2021.\nIncome taxes. Our income tax expenses incurred for the years ended September 30, 2022, and 2021 was $0.\nNet loss. For the year ended September 30, 2022, our net loss was $204,130 compared to $2,392,307 for the year ended September 30, 2021. The decrease was primarily due to the decrease operating expenses.\nLiquidity and Capital Resources\nAs of September 31, 2022, we had current assets of $0, we had liabilities of $204,130, and our cumulative working capital deficit was $2,740,458. We anticipate that our current liquidity is not sufficient to meet the obligations associated with being a company that is fully reporting with the SEC.\nTo date, we have managed to keep our monthly cash flow requirement low for two reasons. First, our officers do not draw a salary at this time. Second, we have been able to keep our operating expenses to a minimum by operating in space provided at no expense by our officers and directors.\nWe currently have no external sources of liquidity such as arrangements with credit institutions or off-balance sheet arrangements that will have or are reasonably likely to have a current or future effect on our financial condition or immediate access to capital.\nOur financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America (GAAP), which contemplates our continuation as a going concern. We have not yet generated any revenue and have incurred losses to date of approximately $2,740,458. In addition, our current liabilities are $204,130 and we have no current assets. These factors raise substantial doubt about our ability to continue operating as a going concern. Our ability to continue our operations as a going concern, realize the carrying value of our assets, and discharge our liabilities in the normal course of business is dependent upon our ability to raise capital sufficient to fund our commitments and ongoing losses, and ultimately generate profitable operations.\nCash Flows\nOperating Activities\nFor the year ended September 30, 2022, net cash used in operating activities was $181,210, related to our net loss of from continuing operation of $204,130.\nFor the year ended September 30, 2021, net cash used in operating activities was $23,236, related to our net loss from continuing operations of $2,392,307\nInvesting Activities\nNet cash provided by investing activities for the years ended September 30, 2022, and September 30, 2021, was $0.\nFinancing Activities\nNet cash provided by financing activities for the year ended September 30, 2022, was $181,210 as compared to the corresponding period September 30, 2021, was $23,236. The Companys financing was from our related company, which has advanced $181,210 by paying for operation expenses on behalf of the Company. As of September 30, 2022, the Company was obliged to the related party, for an unsecured, non-interest -bearing demand loan with balance of $181,210.\nFuture Capital Requirements\nOur current available cash and equivalents are not sufficient to satisfy our liquidity requirements. Our capital requirements for the fiscal year ending September 30, 2023, will depend on numerous factors, including managements evaluation of the timing of projects to pursue. Subject to our ability to generate revenues and cash flow from operations and our ability to raise capital (including through possible joint ventures and/or partnerships), we expect to incur substantial expenditures to carry out our business plan, as well as costs associated with our capital raising efforts and being a public company.\nOur plans to finance our operations include seeking equity and debt financing, alliances or other partnership agreements, or other business transactions, that would generate sufficient resources to ensure continuation of our operations.\nThe sale of equity or debt securities may result in additional dilution to our shareholders. If we raise additional funds through the issuance of debt securities or preferred stock, these securities could have rights senior to those of our common stock and could contain covenants that would restrict our operations. Any such required additional capital may not be available on reasonable terms, if at all. If we were unable to obtain additional financing, we may be required to reduce the scope of, delay or eliminate some or all of our planned activities and limit our operations which could have a material adverse effect on our business, financial condition and results of operations.\nInflation\nThe amounts presented in our financial statements do not provide for the effect of inflation on our operations or financial position. The net operating losses shown would be greater than reported if the effects of inflation were reflected either by charging operations with amounts that represent replacement costs or by using other inflation adjustments.\nGoing Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business for the twelve months following the date of these financial statements. As of September 30, 2022, the Company had no cash and an accumulated deficit of $2,740,458.\nBecause the Company does not expect that existing operational cash flow will be sufficient to fund presently anticipated operations, this raises substantial doubt about the Companys ability to continue as a going concern. Therefore, the Company will need to raise additional funds and is currently exploring alternative sources of financing. Recently the Company being funded by our related company, Flywheel Financial Strategy (Hong Kong) Company Limited, who has extended interest-free demand loans to the Company. There can be no assurances that our related company will continue to fund the Company, or that the Company can obtain any other sources of financing.\nOff Balance Sheet Arrangements\nAs of the date of this Report, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nSeasonality\nOur operating results are not affected by seasonality.\nInflation\nOur business and operating results as reported have not been affected in any material way by inflation. However, the Company is aware that global inflation is increasing, and it expects that inflation will affect the Company during fiscal year ending June 2023, though it cannot predict at this point in what ways.\nCritical Accounting Policies\nThe SEC issued Financial Reporting Release No. 60, Cautionary Advice Regarding Disclosure About Critical Accounting Policies suggesting that companies provide additional disclosure and commentary on their most critical accounting policies. In Financial Reporting Release No. 60, the SEC has defined the most critical accounting policies as the ones that are most important to the portrayal of a companys financial condition and operating results and require management to make its most difficult and subjective judgments, often as a result of the need to make estimates of matters that are inherently uncertain. The nature of our business generally does not call for the preparation or use of estimates. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide information required by this Item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nFLYWHEEL ADVANCED TECHNOLOGY, INC.\nCONTENTS\nReport of Independent Registered Public Accounting Firm\nBalance Sheet as of September 30, 2022 and 2021\nStatements of Operations for the Years Ended September 30, 2022 and 2021\nStatement of Changes in Stockholders Equity for the Years Ended September 30, 2022 and 2021\nStatements of Cash Flows for the Years Ended September 30, 2022 and 2021\nNotes to the Financial Statements for the years ended June 30, 2022 and 2021\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders of Flywheel Advanced Technology, Inc.:\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Flywheel Advanced Technology, Inc. (the Company) as of September 30, 2022 and 2021 and the related statements of operations, shareholders equity, and cash flows for the two years in the period ended September 30, 2022, and the related notes and schedules (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for the two years in the period ended September 30, 2022 and 2021, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations that raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provide a reasonable basis for our opinion.\nCritical Audit Matter\nCritical audit matters are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments.\nWe determined that there are no critical audit matters.\n/S/ BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Companys auditor since 2021\nLakewood, CO\nDecember 27, 2022\nFLYWHEEL ADVANCED TECHNOLOGY, INC.\nBalance Sheet\nSeptember 30, September 30,\nASSETS\nTOTAL ASSETS $ - $ -\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCURRENT LIABILITIES\nAccrued Expenses $ 22,920 $ -\nDue to Related Party 181,210\nTotal current liabilities 204,130 -\nTotal Liabilities 204,130 -\nCommitments and contingencies - -\nSTOCKHOLDERS EQUITY\nSeries A-1 Convertible Preferred Stock, $0.0001 par value,25,000,000 shares authorized, 0 share and 10,000,000 shares issued and outstanding as of September 30, 2022 and September 30, 2021, respectively - 1,000\nCommon stock, $0.0001 par value 550,000,000, shares authorized,17,822,564 shares and 1,622,550 shares issued and outstanding as of September 30, 2022 and September 30, 2021, respectively 1,782\nPaid in Capital 2,534,546 2,535,166\nAccumulated deficit (2,740,458 ) (2,536,328 )\nTotal Stockholders (Deficit) (204,130 ) -\nTOTAL LIABILITIES AND STOCKHOLDERS (DEFICIT) $ - $ -\nThe accompanying notes are an integral part of these financial statements\nFLYWHEEL ADVANCED TECHNOLOGY, INC.\nSTATEMENTS OF OPERATIONS\nSeptember 30, September 30,\nREVENUE $ - $ -\nOPERATING EXPENSES\nGeneral and administration 23,657 4,159\nProfessional fees 180,473 19,078\nStock based compensation -related party - 2,369,070\nTotal Operating Expenses 204,130 2,392,307\nLOSS FROM OPERATION (204,130 ) (2,392,307 )\nOTHER EXPENSE\nTotal Other Expenses - -\nINCOME BEFORE INCOME TAXES (204,130 ) (2,392,307 )\nIncome taxes expenses - -\nNET LOSS $ (204,130 ) $ (2,392,307 )\nNet loss per share - basic and diluted $ (0.03 ) $ (1.47 )\nWeighted average number of shares outstanding 5,874,306 1,622,550\nThe accompanying notes are an integral part of these financial statements\nFLYWHEEL ADVANCED TECHNOLOGY, INC.\nSTATEMENTS OF CHANGE IN STOCKHOLDERS EQUITY\nShares Value Shares Value Shares Value Shares Value Shares Value Capital\nDeficit\nTotal\nSeries A-1 Convertible Series A Convertible Series C Convertible Series D Convertible\nPreferred Stock Preferred Stock Preferred Stock Preferred Stock Common Stock Paid in Accumulated\nShares Value Shares Value Shares Value Shares Value Shares Value Capital\nDeficit\nTotal\nBalance at September 30, 2021 10,000,000 $ 1,000 - $ - - $ - - $ - 1,622,550 $ 162 $ 2,535,166 $ (2,536,328 ) $ -\nConversion of Series A-1 Convertible Preferred Stock to Common Stock (10,000,000 ) $ (1,000 ) - $ - - $ - - $ - 16,200,000 $ 1,620 $ (620 ) $ - $ -\nIssuance of Common Stock for reverse stock split - $ - - $ - - $ - - $ - $ - $ - $ - $ -\nNet loss - - - - - - - - - - - (204,130 ) (204,130 )\nBalance at September 30, 2022 - $ - - $ - - $ - - $ - 17,822,564 $ 1,782 $ 2,534,546 $ (2,740,458 ) $ (204,130 )\nThe accompanying notes are an integral part of these financial statements\nPrior period results have been adjusted to reflect the Reverse Stock Split.\nFLYWHEEL ADVANCED TECHNOLOGY, INC.\nSTATEMENTS OF CHANGE IN STOCKHOLDERS EQUITY\nSeries A-1 Convertible Series A Convertible Series C Convertible Series D Convertible\nPreferred Stock Preferred Stock Preferred Stock Preferred Stock Common Stock Paid in Accumulated\nShares Value Shares Value Shares Value Shares Value Shares Value Capital Deficit Total\nBalance at September 30, 2020 - $ - 2,250,000 $ 225 4,800,000 $ 480 50,000 $ 5 1,551,550 $ 155 $ 120,487 $ (144,021 ) $ (22,669 )\nConversion of preferred stock to common stock - - (2,250,000 ) (225 ) (4,800,000 ) (480 ) (50,000 ) (5 ) 71,000 - -\nIssuance of preferred stock to related party 10,000,000 1,000 - - - - - - - - 2,368,070 - 2,369,070\nCapital contribution by former related party - - - - - - - - - - 45,906\n45,906\nNet loss - - - - - - - - - - - (2,392,307 ) (2,392,307 )\nBalance at September 30, 2021 10,000,000 $ 1,000 - $ - - $ - - $ - 1,622,550 $ 162 $ 2,535,166 $ (2,536,328 ) $ -\nThe accompanying notes are an integral part of these financial statements\nPrior period results have been adjusted to reflect the Reverse Stock Split.\nFLYWHEEL ADVANCED TECHNOLOGY, INC.\nSTATEMENTS OF CASH FLOWS\nSeptember 30, September 30,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss before income taxes $ (204,130 ) $ (2,392,307 )\nAdjusted to reconcile net loss to cash provided by operating activities:\nStock based compensation to related party - 2,369,070\nChanges in operating assets and liabilities\nIncrease/(decrease) in:\nAccrued expenses 22,920 -\nNet cash used in operating activities (181,210 ) (23,237 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nNet cash provided by investing activities - -\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from related party loans 181,210 23,237\nNet cash provided by financing activities 181,210 23,237\nNET INCREASE IN CASH AND\nCASH EQUIVALENTS - -\nCASH AND CASH EQUIVALENTS AT BEGINNING OF PERIOD - -\nCASH AND CASH EQUIVALENTS AT END OF PERIOD - -\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION\n1) Cash paid for interest $ - $ -\n2) Cash paid for taxes $ - $ -\n3) Contribution from former related party $ - $ 45,906\nThe accompanying notes are an integral part of these financial statements\nFLYWHEEL ADVANCED TECHNOLOGY, INC.\nNOTES TO FINANCIAL STATEMENTS\nAS OF SEPTEMBER 30, 2022 AND 2021\nNOTE- 1 ORGANIZATION AND BUSINESS BACKGROUND\nFlywheel Advanced Technology, Inc. (formerly known as Pan Global Corp.) (the Company) was incorporated in the state of Nevada on April 30, 2010 under the name of Savvy Business Support, Inc. (Savvy). Savvy offered general business services/support to start-up companies, small and medium business planning to expand, individuals, and other business and organizations. It was considered to be a shell company. On April 25, 2013, Savvy entered into a Stock Exchange Agreement (the Exchange Agreement) with Pan Asia Infratech Corp. a Nevada corporation (Pan Asia). Pan Asia was incorporated in Nevada on July 13, 2012.\nPursuant to the Exchange Agreement, consummated on April 26, 2013, the stockholders of Pan Asia transferred to Savvy 100% of the outstanding capital stock of Pan Asia (consisting of 15,000 shares of Common Stock, no par value) in exchange for, on a pro rata basis, an aggregate of 90,000,000 shares of Savvys Common Stock (the Share Exchange). As a result of the Share Exchange, Pan Asia became a wholly-owned subsidiary of Savvy and the business of Pan Asia became the business of the Company.\nOn April 26, 2013, Savvy amended its Articles of Incorporation with the Secretary of State of Nevada thereby changing its name from Savvy Business Support, Inc. to Pan Global, Corp. On May 2, 2013, the OTCQB symbol of the Companys Common Stock was changed from SVYB to PGLO.\nThe Company has been dormant since September, 2014.\nOn July 16, 2020, as a result of a custodianship in Clark County, Nevada, Case Number: A-20-816264-B, Custodian Ventures LLC (Custodian) was appointed custodian of the Company.\nOn July 16, 2020, Custodian appointed David Lazar as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer and Chairman of the Board of Directors.\nOn October 8, 2020, the Companys outstanding 7,100,000 shares Preferred A, Preferred C and Preferred D shares were converted on a one for one basis into 7,100,000 common shares. Concurrently these Preferred Shares were cancelled.\nIn November 2020 the Company designated 25,000,000 new Preferred Shares and 10,000,000 Par Value $0.0001 Preferred A-1 Shares were designated and awarded to Custodian for services performed and for loans extended to the Company. Each preferred share is convertible to 162 shares of common stock.\nOn July 13, 2021, a Stock Purchase Agreement was entered into between NYJJ Hong Kong Limited (Seller) and Sparta Universal Industrial Ltd. (Purchaser), wherein the Purchaser purchased 10,000,000 shares of Series A-1 Preferred Stock, par value $0.0001 per share (the Shares) of the Company. As a result, the Purchaser became an approximately 90% holder of the voting rights of the issued and outstanding shares of the Company, on a fully-diluted basis, and became the controlling shareholder.\nAt the effective date of transfer, David Lazar ceased to be the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer and Chairman of the Board of as Directors, and the Company appointed Tang Siu Fung as President, Chief Executive Officer, and Chairman of the Board of Directors; Cheng Sin Yi as Secretary, and Treasurer; Tin Sze Wai as Director; Ip Tsz Ying as Director; Ho Yiu Chung as Director; and Lai Chi Chuen as Director.\nOn November 21, 2021, Board of directors and majority shareholder approved the change of the Companys name to Flywheel Advanced Technology, Inc..\nOn July 13, 2022, the Company was advised by Financial Industry Regulatory Authority (FINRA) that a 1:100 reverse stock split of the Companys common stock would become effective on July 14, 2022. As of July 14, 2022, the 1:100 reverse stock split of the Companys common stock became effective. Following the effectiveness of the reverse stock split, there are currently 1,551,550 shares of common stock issued and outstanding as compared to 155,155,000 shares of the Companys common stock issued and outstanding prior to the reverse stock split.\nOn August 5, 2022, the Company was informed by the FINRA that the new ticker symbol of the Company is FWFW.\nOn September 15, 2022, the Company filed with the Secretary of State of the State of Nevada an Amendment (the Amendment) to the Certificate of Designation for the Series A-1 Preferred Stock (the Preferred Stock). The Amendment was approved by the Board of Directors of the Company and Sparta Universal Industrial Ltd. (Sparta), the sole holder of all the 10,000,000 issued and outstanding shares of Preferred Stock.\nPursuant to the Amendment, the conversion rate of the Preferred Stock was changed to provide that each share of Preferred Stock shall be convertible, at the option of the holder, into 1.62 fully paid and nonassessable shares of the Companys common stock. The Amendment was necessary as the terms of the Certificate of Designation for the Preferred Stock expressly provided that the conversion ratio of 162 shares of common stock for each share of Preferred Stock would not be reduced in the event of a stock split or other capitalization of the Company.\nOn September 15, 2022, the Companys outstanding 10,000,000 shares of Preferred Stock were converted on a one for 1.62 basis into 16,200,000 common shares. Concurrently these Preferred Stock were cancelled.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying financial statements have been prepared in accordance with the Financial Accounting Standards Board (FASB) FASB Accounting Standard Codification™ (the Codification) which is the source of authoritative accounting principles recognized by the FASB to be applied by nongovernmental entities in the preparation of financial statements in conformity with generally accepted accounting principles (GAAP) in the United States.\nAs of July 14, 2022, the 1:100 reverse stock split of the Companys common stock became effective. Prior period results have been adjusted to reflect the Reverse Stock Split in 2021. The split did not change the Companys Common Stock Par value but changed opening Common Stock and Additional Paid in Capital balances by offsetting amounts.\nGoing Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business for the twelve months following the date of these financial statements. As of September 30, 2022, the Company had no cash and an accumulated deficit of $2,740,458.\nBecause the Company does not expect that existing operational cash flow will be sufficient to fund presently anticipated operations, this raises substantial doubt about the Companys ability to continue as a going concern. Therefore, the Company will need to raise additional funds and is currently exploring alternative sources of financing. Recently the Company being funded by our related company, Flywheel Financial Strategy (Hong Kong) Company Limited, who has extended interest-free demand loans to the Company. There can be no assurances that our related company will continue to fund the Company, or that the Company can obtain any other sources of financing.\nUse of Estimates\nThe preparation of financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. The most significant estimates relate to income taxes and contingencies. The Company bases its estimates on historical experience, known or expected trends, and various other assumptions that are believed to be reasonable given the quality of information available as of the date of these financial statements. The results of these assumptions provide the basis for making estimates about the carrying amounts of assets and liabilities that are not readily apparent from other sources. Actual results could differ from these estimates.\nCash and cash equivalents\nThe Company considers all highly liquid temporary cash investments with an original maturity of three months or less to be cash equivalents on September 30, 2022.\nIncome taxes\nThe Company accounts for income taxes under FASB ASC 740, Accounting for Income Taxes. Under FASB ASC 740, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Under FASB ASC 740, the effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. FASB ASC 740-10-05, Accounting for Uncertainty in Income Taxes prescribes a recognition threshold and a measurement attribute for the financial statement recognition and measurement of tax positions taken or expected to be taken in a tax return. For those benefits to be recognized, a tax position must be more-likely-than-not to be sustained upon examination by taxing authorities.\nThe amount recognized is measured as the largest amount of benefit that is greater than 50 percent likely of being realized upon ultimate settlement. The Company assesses the validity of its conclusions regarding uncertain tax positions quarterly to determine if facts or circumstances have arisen that might cause it to change its judgment regarding the likelihood of a tax positions sustainability under audit.\nNet Loss per Share\nNet loss per common share is computed by dividing net loss by the weighted average common shares outstanding during the period as defined by Financial Accounting Standards, ASC Topic 260, Earnings per Share. Basic earnings per common share (EPS) calculations are determined by dividing net income by the weighted average number of shares of common stock outstanding during the year. Diluted earnings per common share calculations are determined by dividing net income by the weighted average number of common shares and dilutive common share equivalents outstanding.\nRecent Accounting Pronouncements\nThere are no recent accounting pronouncements that impact the Companys operations.\nNOTE 3 - EQUITY\nCommon Stock\nThe Company has authorized 550,000,000 shares of $0.0001 par value, common stock. As of September 30, 2022, there were 17,822,564 shares of Common Stock issued and outstanding, respectively.\nAs of July 14, 2022, the 1:100 reverse stock split of the Companys common stock became effective. All share and per share data for all periods presented in the accompanying financial statements and the related disclosures have been adjusted retrospectively to reflect the Reverse Stock Split. The number of authorized shares of common stock and the par value per share remains unchanged.\nPreferred Stock\nOn September 15, 2022, the Company filed with the Amendment to the Certificate of Designation for the Preferred Stock. The Amendment was approved by the Board of Directors of the Company and Sparta, the sole holder of all the 10,000,000 issued and outstanding shares of Preferred Stock.\nPursuant to the Amendment, the conversion rate of the Preferred Stock was changed to provide that each share of Preferred Stock shall be convertible, at the option of the holder, into 1.62 fully paid and nonassessable shares of the Companys common stock. The Amendment was necessary as the terms of the Certificate of Designation for the Preferred Stock expressly provided that the conversion ratio of 162 shares of common stock for each share of Preferred Stock would not be reduced in the event of a stock split or other capitalization of the Company.\nOn September 15, 2022, the Companys outstanding 10,000,000 shares of Preferred Stock were converted on a one for 1.62 basis into 16,200,000 common shares. Concurrently these Preferred Stock were cancelled.\nNOTE 4 - RELATED PARTY NOTES PAYABLE\nThe Companys financing was from our related company, who has advanced $181,210 by paying for operation expenses on behalf of the Company. As of September 30, 2022, the Company was obliged to the related party, for an unsecured, non-interest -bearing demand loan with balance of $181,210.\nNOTE 5 - COMMITMENTS AND CONTINGENCIES\nThe Company did not have any contractual commitments as of September 30, 2022.\nNOTE 6 - SUBSEQUENT EVENTS\nOn November 30, 2022, the Company incorporated Blue Print Global, Inc. (Blue Print) in the British Virgin Islands to establish an operation to source the supply and sale of warehouse patrol robots. The Company holds 70% of Blue Print, and the balance is held by two individuals unrelated to the Company, with each party holding 15%.\nOn December 7, 2022, Blue Print entered into an Agency Agreement (the Agency Agreement) with International Supply Chain Alliance Co., Ltd. of Hong Kong (ISCA). Pursuant to the Agency Agreement, Blue Print appointed ISCA as its authorized agent to distribute warehouse patrol robots in the Peoples Republic of China (China). The Agency Agreement is valid for five years and will be automatically renewed for another five years unless a written non-renewal notice is provided by either party at least 30 days before the expiration date. However, there is no early termination option in the Agency Agreement.\nOn December 15, 2022, the Company entered into a share exchange agreement (the Share Exchange Agreement) with QBS System Limited, a limited company incorporated under the laws of Hong Kong (QBS System), and QBS Flywheel Limited, a company incorporated under the laws of Australia (the Shareholder). Subject to the closing conditions set forth in the Share Exchange Agreement, at the closing the Shareholder will transfer and assign to the Company all of the issued and outstanding shares of QBS System in exchange for 8,939,600 newly issued shares of the Companys common stock, par value $0.0001 per share (the Common Stock). Following the closing of the share exchange, there will be no change in the officers and directors of the Company, and QBS System will continue its business as a wholly owned subsidiary of the Company. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures.\nOur management is responsible for establishing and maintaining a system of disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act) that is designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported, within the time periods specified in the Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to the issuers management, including its principal executive officer or officers and principal financial officer or officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that:\n● pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n● provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n● provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting based on the parameters set forth above and has concluded that as of September 30, 2022, our internal control over financial reporting was not effective to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles as a result of the following material weaknesses:\n● The Company does not have sufficient segregation of duties within accounting functions due to only having one officer and limited resources.\n● The Company does not have an independent board of directors or an audit committee.\n● The Company does not have written documentation of our internal control policies and procedures.\n● All of the Companys financial reporting is carried out by a financial consultant.\nWe plan to rectify these weaknesses by implementing an independent board of directors, establishing written policies and procedures for our internal control of financial reporting, and hiring additional accounting personnel at such time as we complete a reverse merger or similar business acquisition.\nChanges in Internal Control over Financial Reporting.\nThere have been no changes in our internal control over financial reporting during the year September 30, 2022, that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION.\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table sets forth the names and positions of our executive officers and directors. Directors will be elected at our annual meeting of stockholders and serve for one year or until their successors are elected and qualify. Officers are elected by the Board and their terms of office are, except to the extent governed by employment contract, at the discretion of the Board.\nName\nAge\nPositions\nTang Siu Fung\nPresident, Chief Executive Officer, and Chairman of the Board of Directors\nCheng Sin Yi\nSecretary and Treasurer\nTin Sze Wai\nDirector\nIp Tsz Ying\nDirector\nHo Yiu Chung\nDirector\nLai Chi Chuen\nDirector\nTang Siu Fung, President, Chief Executive Officer and Chairman of the Board of Directors.\nTang Siu Fung has served as our President and Chief Executive Officer of our company and as our Chairman since the Share Exchange in September 2021. Mr. Tang has over 20-years of experience in the banking and financial services industry and has gained well-rounded experience and knowledge throughout the years serving in both international and local financial institutions in Hong Kong, including The Hong Kong and Shanghai Banking Corporation Limited, Standard Chartered Bank (Hong Kong) Limited and the subsidiary of Bank of China Limited). By setting out clear aims and objectives, Mr. Tang directs and oversees the businesss overall strategic direction, developing high-quality business strategies and leading the company to achieve short term, as well as long term, goals.\nCheng Sin Yi, Secretary and Treasurer\nCheng Sin Yi has served as our head of the Merger and Acquisition Department and as Secretary and Treasurer since the Share Exchange in September 2021. Ms. Cheng was an Executive Officer in Cherry Body Fashions Mfy. Limited since 2012, responsible for all operational matters and external affairs of the organization. Ms. Cheng has extensive business management experience and excellent business negotiation skills. In 2017, Ms Cheng has co-founded Road to Greatness Consultancy Company Ltd. Ms. Cheng graduated in 2008 as a Master of Business Administration from Kurt Bosch University in Switzerland.\nTin Sze Wai, Director\nTin Sze Wai served as our Executive Vice President of our company since the Share exchange in September 2021. She currently serves as a director. Ms. Tin served as International Relationship Manager in Standard Chartered Bank (Hong Kong) Limited and served as Wealth Management Manager in AIA Group Limited since 2015. Ms. Tin has over than 18 years of wealth management experience specializing in portfolio management for the high-net-worth investors. Ms. Tin was graduated from the Hong Kong University of Science and Technology.\nIp Tsz Ying, Director\nIp Tsz Ying has served as our Head of Distribution and director of our company and as a director since the Share Exchange in September 2021. Ms. Ip has served as Senior Wealth Planning Manager in the Standard Chartered Bank (Hong Kong) Limited since 2015 and served as Branch Manager in a subsidiary of Bank of China Limited until co-foundering our company. Ms. Ip has professional wealth management knowledge and 15 years experience of portfolio management. Ms. Ip graduated in 2010 as a Master in Accounting and Finance from Hong Kong Baptist University.\nHo Yiu Chung, Director\nHo Yiu Chung has served as our director of our company since the Share Exchange in September 2021. Prior to co-founding our company, Mr. Ho was a senior project engineer and served as senior management role in Alien Technology Ltd since 2008 and served as Senior Project Engineer in Aceway Industries Ltd. He has over 15 years top project management experience and risk assessment capabilities. In 2017, Mr. Ho co-founded and served as General Manager of Road to Greatness Consultancy Company Ltd. Mr. Ho leads the team to provide a full range of high-quality services and share investment and financial knowledge with customers and assist in business planning and decision making. Mr. Ho was graduated from the Hong Kong University of Science and Technology as Bachelor of Engineering in Mechanical Engineering.\nLai Chi Chuen, Director.\nLai Chi Chuen has served as our Head of Investment and as a director since the Share Exchange in September 2021. Mr. Lai has served the Assistant General Manager in Winnitex Co Ltd since 1996. In 2010, Mr. Lai served as an Executive Director in Tat Fung Textile Co Ltd. Since 2017, Mr. Lai has served as General Manager in Panther Textile Holding, which is the immediate holding company of Tat Fung Textile Co Ltd. Mr. Lai has extensive corporate management and strategic planning experience. Besides that, Mr. Lai also has more than 20 years of wealth management experience. He can often bring opportunities for investors and turn crises into opportunities during the volatile economic situation. Mr. Lai was graduated in 1996 from Hong Kong Polytechnic University in Textile Chemistry.\nElection of Directors and Officers\nDirectors are elected to serve until the next annual meeting of stockholders and until their successors have been elected and qualified. Officers are appointed to serve until the meeting of the Board following the next annual meeting of stockholders and until their successors have been elected and qualified.\nDirector Independence\nWe do not currently have any independent directors. We evaluate independence by the standards for director independence established by Marketplace Rule 5605(a)(2) of the Nasdaq Stock Market, Inc.\nAudit Committee\nWe do not have any committees of the Board.\nCompensation Committee\nWe do not presently have a compensation committee. Our Board of Directors currently acts as our compensation committee.\nNominating Committee\nWe do not presently have a nominating committee. Our Board of Directors currently acts as our nominating committee.\nCode of Ethics\nOur Board has not adopted a Code of Ethics due to the Companys size and lack of employees.\nBoard Leadership Structure\nWe have chosen to combine the Chief Executive Officer and Board Chairman positions.\nDelinquent Section 16(a) Reports\nNot Applicable ITEM 11. EXECUTIVE COMPENSATION\nThe following information is related to the compensation paid, distributed, or accrued by us for the fiscal years ended September 30, 2022, and September 30, 2021, to our Chief Executive Officer (principal executive officer) during the last fiscal year and the two other most highly compensated executive officers serving as of the end of the last fiscal year whose compensation exceeded $100,000 (the Named Executive Officers):\nWe have not paid any compensation to our Named Executive Officers during the last two fiscal years.\nNamed Executive Officer Employment Agreements\nNone.\nTermination Provisions\nAs of the date of this Report, we have no contract, agreement, plan, or arrangement, whether written or unwritten, that provides for payments to a Named Executive Officer at, following, or in connection with any termination, including without limitation resignation, severance, retirement or a constructive termination of a Named Executive Officer, or a change in control of the Company or a change in the Named Executive Officers responsibilities, with respect to each Named Executive Officer.\nOutstanding Equity Awards at Fiscal Year End\nAs of September 30, 2022, none of our Named Executive Officers held any unexercised options, stock that have not vested, or other equity incentive plan awards.\nDirector Compensation\nTo date, we have not paid our directors any compensation for services on our Board.\nEquity Compensation Plan Information\nThe Company does not have any securities authorized for issuance or outstanding under an equity compensation plan or equity compensation grants made outside of such a plan. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information regarding beneficial ownership of the Companys common stock as of December 28, 2022, by (i) each person who is known by the Company to own beneficially more than 5% of any classes of outstanding common stock, (ii) each director of the Company, (iii) each of the Chief Executive Officers and the executive officers (collectively, the Named Executive Officers) and (iv) all directors and executive officers of the Company as a group based upon 17,751,564 shares outstanding as of December 28, 2022.\nName and Address of Beneficial Owners of common stock1 Title of Class Amount and Nature of Beneficial Ownership % of Common Stock\nTang Siu Fung2 common stock 16,200,000 91.3 %\nCheng Sin Yi - - *\nTin Sze Wai - - *\nIp Tsz Ying - - *\nHo Yiu Chung - - *\nLai Chi Chuen - - *\nDIRECTORS AND OFFICERS - TOTAL (6 persons)\n5% SHAREHOLDERS\nSparta Universal Industrial Ltd. 2 common stock 16,200,000 91.3 %\n* Less than 1%.\nUnless otherwise indicated, the business address of each individual or entity listed in the table is c/o: Flywheel Advanced Technology, Inc., 1185 Avenue of the Americas, 3rd Floor, New York, New York 10036.\nOur President, Chief Executive Officer and Chairman of the Board, Mr. Tang, is the controlling shareholder of Sparta Universal Industrial Ltd., which holds 16,200,000 shares of the Companys common stock. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nOn July 13, 2021, pursuant to a Stock Purchase Agreement between NYJJ and Sparta, wherein Sparta purchased the A-1 Preferred Shares of the Company. As a result, Sparta became an approximately 90% holder of the voting rights of the issued and outstanding shares of the Company, on a fully diluted basis, and became the controlling shareholder. Sparta is controlled by Tang Siu Fung, our chief executive officer and chairman of the board of directors.\nOn September 15, 2022, Sparta provided notice to the Company to convert all of the issued and outstanding A-1 Preferred Shares into 16,200,000 shares of common stock. The board of directors of the Company approved the conversion and agreed that the Company would not charge any fee or expense for such conversion. Accordingly, as of the date of this Annual Report on Form 10-K, Sparta is currently the holder of 16,200,000 of the 17,751,564 shares of common stock issued and outstanding, or approximately 91.3%. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe following table shows the fees paid or accrued for the audit and other services provided by our independent auditors for the years ended:\nSeptember 30, 2022 September 30, 2021\nAudit Fee $ 38,200 $ 15,000\nTotal fees paid or accrued to our principal accountant $ 38,200 $ 15,000\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nExhibit Number\nDescription\n3.1.1\nArticles of Incorporation, filed as Exhibit 3.1 to Registration Statement on Form S-1, filed with the Securities and Exchange Commission on May 27, 2010.\n3.1.2\nCertificate of Amendment, effective April 26, 2013, filed as Exhibit 3.1 to Current Report on Form 8-K, filed with the Securities and Exchange Commission on May 1, 2013.\n3.1.3\nCertificate of Amendment to the Articles of Incorporation filed with the Secretary of State of Nevada, filed as Exhibit 3.10 to Quarterly Report on Form 10-Q, for the period ended March 31, 2022, filed with the Securities and Exchange Commission on May 13, 2022.\n3.2\nBylaws, filed as Exhibit 3.2 to Registration Statement on Form S-1, filed with the Securities and Exchange Commission on May 27, 2010.\n3.4.1\nSeries A Convertible Preferred Stock Certificate of Designations, effective September 24, 2012, filed as Exhibit 3.1 to Registration Statement on Form S-1, filed with the Securities and Exchange Commission on September 26, 2012.\n3.4.2\nAmendment to the Certificate of Designation of the Series A-1 Preferred Stock as filed with the Secretary of State of the State of Nevada on September 15, 2022, filed as Exhibit 3.1 to Current Report on Form 8-K, filed with the Securities and Exchange Commission on September 22, 2022.\n3.4.3\nSeries B Non-Convertible Preferred Stock Certificate of Designations, effective November 8, 2012, filed as Exhibit 3.1 to Current Report on Form 8-K, filed with the Securities and Exchange Commission on November 9, 2012.\n3.4.4\nAmended and Restated Series C Preferred Stock Certificate of Designation, effective October 18, 2013, filed as Exhibit 3.1 to Current Report on Form 8-K, filed with the Securities and Exchange Commission on October 18, 2013.\n3.4.5\nSeries D Convertible Preferred Stock Certificate of Designations, filed on October 16, 2012, filed as Exhibit 3.1 to Current Report on Form 8-K, filed with the Securities and Exchange Commission on October 17, 2013.\n10.1\nShareholder Agreement dated December 7, 2022, by and among Flywheel Advance Technology, Inc., So Ha Tsang, and Sau Ping Leung, filed as Exhibit 10.1 to Current Report on Form 8-K, filed with the Securities and Exchange Commission on December 12, 2022.\n10.2\nAgency Agreement, dated December 7, 2022, by and between International Supply Chain Alliance Co., Ltd. and Blue Print Global, Inc., filed as Exhibit 10.2 to Current Report on Form 8-K, filed with the Securities and Exchange Commission on December 12, 2022.\n99.1\nNotice of Entry of Order Barring Claims and Terminating Custodianship, filed as Exhibit 99.1 to Current Report on Form 8-K, filed with the Securities and Exchange Commission on July 16, 2020.\n31.1\nCertification of Principal Executive Officer and Principal Financial Officer Pursuant to Section 302(a) of the Sarbanes-Oxley Act.\n32.1\nCertification of Chief Executive Officer and Chief Financial Officer Under Section 1350 as Adopted Pursuant Section 906 of the Sarbanes-Oxley Act\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nSIGNATURES\nIn accordance with the requirements of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nFLYWHEEL ADVANCED TECHNOLOGY, INC.\nDated: December 28, 2022 By:\n/s/ Tang Siu Fung\nTang Siu Fung\nChief Executive Officer\n(Principal Executive Officer and Principal Financial Officer)"
}