{
    "cik": "1500375",
    "company": "Home Federal Bancorp, Inc. of Louisiana",
    "filing_type": "10-K",
    "filing_date": "2023-10-02",
    "period_of_report": "2023-06-30",
    "sic": "6035",
    "state_of_inc": "LA",
    "state_location": "LA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1500375/0001140361-23-046338-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1500375/000114036123046338/brhc20058684_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1500375/0001140361-23-046338.txt",
    "filename": "1500375_10K_2023_0001140361-23-046338.htm",
    "content": "Item 1. Business\nHome Federal Bancorp, Inc. of Louisiana, a Louisiana chartered corporation (Home Federal Bancorp or the Company), is the holding company for Home Federal Bank (Home Federal Bank or the Bank). Home Federal Bank is a federally chartered stock savings bank originally organized in 1924 as Home Building and Loan Association. The Bank reorganized into the mutual holding company structure in January 2005 and changed its name to Home Federal Bank in 2009 as part of its business strategy to be recognized as a community bank. Home Federal Banks home office and ten full service branch offices are located in Caddo, Bossier and Webster Parishes, Louisiana and serve the Shreveport-Bossier City-Minden combined statistical area. In February 2023, the Bank acquired First National Bank of Benton and its full service branch office in Benton, Louisiana. Home Federal Banks business primarily consists of attracting deposits from the general public and using those funds to originate loans.\nAs of June 30, 2023, Home Federal Bancorps only business activities are to hold all of the outstanding common stock of Home Federal Bank. Home Federal Bancorp is authorized to pursue other business activities permitted by applicable laws and regulations for savings and loan holding companies, which may include the issuance of additional shares of common stock to raise capital or to support mergers or acquisitions and borrowing funds for reinvestment in Home Federal Bank.\nHome Federal Bancorp does not own or lease any property but instead uses the premises, equipment, and furniture of Home Federal Bank. At the present time, Home Federal Bancorp employs only persons who are officers of Home Federal Bank to serve as officers of Home Federal Bancorp and may also use the support staff of Home Federal Bank from time to time. These other persons are not separately compensated by Home Federal Bancorp.\nPursuant to the regulations under Sections 23A and 23B of the Federal Reserve Act, Home Federal Bank and Home Federal Bancorp have entered into an expense sharing agreement. Under this agreement, Home Federal Bancorp will reimburse Home Federal Bank for the time that employees of Home Federal Bank devote to activities of Home Federal Bancorp, the portion of the expense of the annual independent audit attributable to Home Federal Bancorp, and all expenses attributable to Home Federal Bancorps public filing obligations under the Securities Exchange Act of 1934.\nMarket Area\nOur primary market area for loans and deposits is in northwest Louisiana, particularly Caddo Parish and neighboring communities in Bossier and Webster Parishes, which are located in the Shreveport-Bossier City-Minden combined statistical area.\nOur primary market area in northern Louisiana has a diversified economy with employment in services, government, and wholesale/retail trade constituting the basis of the local economy, with service jobs being the largest component. The majority of the services are health care related as Shreveport has become a regional hub for health care. The casino gaming industry also supports a significant number of the service jobs. The energy sector has a prominent role in the regional economy, resulting from oil and gas exploration and drilling.\nCompetition. We face significant competition both in attracting deposits and in making loans. Our most direct competition for deposits has come historically from commercial banks, credit unions, and other savings institutions located in our primary market area, including many large financial institutions which have greater financial and marketing resources available to them. In addition, we face significant competition for investors funds from short-term money market securities, mutual funds, and other corporate and government securities. We do not rely upon any individual group or entity for a material portion of our deposits. Our ability to attract and retain deposits depends on our ability to generally provide a rate of return, liquidity, and risk comparable to that offered by competing investment opportunities.\nOur competition for real estate loans comes principally from mortgage banking companies, commercial banks, other savings institutions, and credit unions. We compete for loan originations primarily through the interest rates and loan fees we charge and the efficiency and quality of services we provide borrowers. Factors which affect competition include general and local economic conditions, current interest rate levels, and volatility in the mortgage markets. Competition may increase as a result of the continuing reduction of restrictions on the interstate operations of financial institutions.\nLending Activities\nGeneral. At June 30, 2023, our net loan portfolio amounted to $489.5 million, representing approximately 74.1% of total assets at that date. Historically, our principal lending activity was the origination of one-to-four family residential loans. At June 30, 2023, one-to-four family residential loans amounted to $179.6 million, or 36.7% of the total loan portfolio. In recent periods, we have sold a substantial amount of our fixed-rate conforming one-to-four family residential loans to correspondent banks. Commercial real estate loans amounted to $148.4 million, or 30.3% of the total loan portfolio, at June 30, 2023.\nThe types of loans that we may originate are subject to federal and state laws and regulations. Interest rates charged on loans are affected principally by the demand for such loans, the supply of money available for lending purposes, and the rates offered by our competitors. These factors are, in turn, affected by general and economic conditions, the monetary policy of the federal government, including the Federal Reserve Board, legislative and tax policies, and governmental budgetary matters.\nA savings institution generally may not make loans to one borrower and related entities in an amount which exceeds 15% of its unimpaired capital and surplus, although loans in an amount equal to an additional 10% of unimpaired capital and surplus may be made to a borrower, if the loans are fully secured by readily marketable securities. In addition, upon application, the Office of the Comptroller of the Currency permits a savings institution to lend up to an additional 15% of unimpaired capital and surplus to one borrower to develop domestic residential housing units. At June 30, 2023, our regulatory limit on loans to one borrower was $7.6 million, and the five largest loans or groups of loans to one borrower, including related entities, aggregated $7.4 million, $5.8 million, $4.6 million, $4.4 million, and $4.4 million. Each of our five largest loans or groups of loans was originated with strong guarantor support to known borrowers in our market area and was performing in accordance with its terms at June 30, 2023.\nLoans to or guaranteed by general obligations of a state or political subdivision are not subject to the foregoing lending limits.\nLoan Portfolio Composition. The following table shows the composition of our loan portfolio by type of loan at the dates indicated.\nJune 30,\nPercent\nPercent\nof Total\nof Total\nAmount\nLoans\nAmount\nLoans\nReal estate loans:\n(Dollars in thousands)\nOne-to-four family residential(1)\n$\n179,579\n36.29\n%\n$\n120,014\n30.57\n%\nCommercial - real estate secured:\nOwner occupied\n104,974\n21.22\n71,871\n18.30\nNon-owner occupied\n43,467\n8.78\n55,718\n14.19\nTotal commercial-real estate secured\n148,441\n30.00\n127,589\n32.49\nMulti-family residential\n28,849\n5.83\n30,411\n7.75\nLand\n26,841\n5.42\n22,127\n5.64\nConstruction\n28,035\n5.67\n27,884\n7.10\nHome equity loans and second mortgage loans\n2,450\n0.50\n1,587\n0.40\nEquity lines of credit\n23,817\n4.81\n17,831\n4.54\nTotal real estate loans\n438,012\n88.52\n347,443\n88.49\nCommercial business\n55,364\n11.19\n44,487\n11.33\nConsumer non-real estate loans:\nSavings accounts\n0.07\n0.07\nConsumer loans\n1,082\n0.22\n0.11\nTotal non-real estate loans\n56,818\n11.48\n45,192\n11.51\nTotal loans\n494,830\n100.00\n%\n392,635\n100.00\n%\nLess:\nAllowance for loan losses\n(5,173\n)\n(4,451\n)\nDeferred loan fees\n(164\n)\n(311\n)\nNet loans receivable (1)\n$\n489,493\n$\n387,873\n(1)\nDoes not include loans held-for-sale amounting to $4,000 and $4.0 million at June 30, 2023 and 2022, respectively.\nOrigination of Loans. Our lending activities are subject to written underwriting standards and loan origination procedures established by the board of directors and management. When applicable, loans originated are also subject to the underwriting standards of Fannie Mae, Freddie Mac, HUD, VA, USDA, and correspondent banks that purchase loans we originate. Loan originations are obtained through a variety of sources, primarily from existing customers, local realtors, and builders. Written loan applications are taken by one of our loan officers. The loan officer also supervises the procurement of credit reports, income and asset documentation, and other documentation involved with a loan. All appraisals are ordered through an approved appraisal management company in compliance with the Dodd-Frank Consumer Protection Act. Under our lending policy, a title insurance policy is required on most mortgage loans, with the exception of certain smaller loan amounts where our policy requires a title opinion only. We also require fire and extended coverage casualty insurance in order to protect the properties securing the real estate loans. Borrowers must also obtain flood insurance policies when the property is in a flood hazard area.\nOur loan approval process is intended to assess the borrowers ability to repay the loan, the viability of the loan, and the value of the property that will secure the loan. All residential loans originated for sale to FNMA or other investor banks that receive an Approve-Eligible recommendation on the automated underwriting feedback certificate that is applicable for each loan type must be approved by a Bank mortgage underwriter. Loans that do not receive an Approve-Eligible recommendation must be approved by a Bank mortgage underwriter and the Senior Vice President of Mortgage. In addition, all loans originated to be held on the Banks portfolio must be approved by a Bank mortgage underwriter and the Senior Vice President of Mortgage for loans up to $500,000, and for loans up to $1.0 million by the Senior Credit Officer. Commercial real estate secured loans and lines of credit and commercial business loans up to $1.0 million must be approved by the Senior Credit Officer or the Chairman of the Board, President and Chief Executive Officer, up to $2.0 million by the Senior Credit Officer and the Chairman of the Board, President and Chief Executive Officer, and in excess of $2.0 million by the Executive Committee. In accordance with past practice, all loans are ratified by our board of directors.\nIn recent periods, we have originated and sold a substantial amount of our fixed-rate conforming mortgages to correspondent banks. For the year ended June 30, 2023, we originated $59.3 million of one-to-four family residential loans and sold $28.2 million of such loans. Our residential loan originations primarily consist of conventional, rural development, FHA, and VA loans.\nThe following table shows total loans originated, sold, and repaid during the periods indicated.\nYear Ended June 30,\n(In thousands)\nLoan originations:\nOne-to-four family residential\n$\n59,319\n$\n148,081\nCommercial - real estate secured:\nOwner occupied\n33,562\n31,649\nNon-owner occupied\n19,289\n33,216\nMulti-family residential\n21,233\n4,951\nCommercial business\n51,314\n48,253\nLand\n12,514\n21,793\nConstruction\n25,300\n35,916\nHome equity loans and lines of credit and other consumer\n21,493\n15,750\nTotal loan originations\n244,024\n339,609\nLoans purchased\n54,949\n--\nTotal loan originations and loans purchased\n298,973\n339,609\nLoans Sold\n(24,865\n)\n( 87,238\n)\nLoan principal repayments\n(171,869\n)\n(199,431\n)\nTotal loans sold and principal repayments\n102,239\n52,940\nIncrease (decrease) due to other items, net(1)\n$\n(11,910\n)\nNet (decrease) increase in loan portfolio\n$\n102,342\n$\n(41,030\n)\n(1)\nOther items consist of deferred loan fees, the allowance for loan losses, and loans held-for-sale at year end.\nAlthough federal laws and regulations permit savings institutions to originate and purchase loans secured by real estate located throughout the United States, we concentrate our lending activity in our primary market area in Caddo, Bossier and Webster Parishes, Louisiana and the surrounding area. Subject to our loans-to-one borrower limitation, we are permitted to invest without limitation in residential mortgage loans and up to 400% of our capital in loans secured by non-residential or commercial real estate. We also may invest in secured and unsecured consumer loans in an amount not exceeding 35% of total assets. This 35% limitation may be exceeded for certain types of consumer loans, such as home equity and property improvement loans secured by residential real property. In addition, we may invest up to 10% of our total assets in secured and unsecured loans for commercial, corporate, business, or agricultural purposes. At June 30, 2023, we were within each of the above lending limits.\nDuring fiscal 2023 and 2022, we sold $24.9 million and $87.2 million of loans, respectively. We recognized gain on sale of loans of $466,000 and $2.0 million during fiscal 2023 and 2022, respectively. Loans were sold during these periods primarily to other financial institutions. Such loans were sold against forward sales commitments with servicing released and without recourse after a certain period of time, typically 90 days. The loans sold primarily consisted of long-term, fixed rate residential real estate loans. These loans were originated during this period of historically low interest rates and were sold to reduce our interest rate risk. We will continue to sell loans in the future to the extent we believe the interest rate environment is unfavorable and interest rate risk is unacceptable.\nContractual Terms to Final Maturities. The following table shows the scheduled contractual maturities of our loans as of June 30, 2023, before giving effect to net items. Demand loans, loans having no stated schedule of repayments and no stated maturity, and overdrafts are reported as due in one year or less. The amounts shown below do not take into account loan prepayments.\nOne-to-\nFour\nFamily\nResidential\nCommercial\nReal Estate\nSecured\nMulti\nFamily\nResidential\nCommercial\nBusiness\nLand\nConstruction\nHome\nEquity Loans\nand Lines\nof Credit\nand Other\nConsumer\nTotal\n(In thousands)\nAmounts due after June 30, 2023 in:\nOne year or less\n$\n15,344\n$\n19,461\n$\n1,223\n$\n14,437\n$\n9,993\n$\n21,248\n$\n9,542\n$\n91,248\nAfter one year through two years\n9,798\n10,007\n2,107\n5,159\n2,820\n5,187\n1,911\n36,989\nAfter two years through three years\n14,495\n9,259\n4,526\n5,640\n4,050\n--\n38,804\nAfter three years through five years\n60,487\n56,569\n7,467\n17,154\n6,780\n--\n5,442\n153,899\nAfter five years through ten years\n17,072\n50,964\n3,246\n10,115\n2,626\n--\n1.982\n86,005\nAfter ten years through fifteen years\n9,525\n1,701\n9,288\n2,859\n1,316\n7,455\n32,327\nAfter fifteen years\n52,858\n--\n55,558\nTotal\n$\n179,579\n$\n148,441\n$\n28,849\n$\n55,364\n$\n26,841\n$\n28,035\n$\n27,721\n$\n494,830\nThe following table sets forth the dollar amount of all loans at June 30, 2023, before net items, due after June 30, 2024, which have fixed interest rates or which have floating or adjustable interest rates.\nFloating or\nFixed-Rate\nAdjustable-Rate\nTotal\n(In thousands)\nOne-to-four family residential\n$\n127,766\n$\n36,466\n$\n164,232\nCommercial - real estate secured\n126,267\n2,713\n128,980\nMulti-family residential\n27,626\n--\n27,626\nCommercial business\n36,567\n4,360\n40,927\nLand\n16,069\n16,849\nConstruction\n4,243\n2,545\n6,788\nHome equity loans and lines of credit and other consumer\n8,502\n9,678\n18,180\nTotal\n$\n347,040\n$\n56,542\n$\n403,582\nScheduled contractual maturities of loans do not necessarily reflect the actual expected term of the loan portfolio. The average life of mortgage loans is substantially less than their average contractual terms because of prepayments. The average life of mortgage loans tends to increase when current mortgage loan rates are higher than rates on existing mortgage loans and, conversely, decrease when rates on current mortgage loans are lower than existing mortgage loan rates (due to refinancing of adjustable-rate and fixed-rate loans at lower rates). Under the latter circumstance, the weighted average yield on loans decreases as higher yielding loans are repaid or refinanced at lower rates.\nOne-to-Four Family Residential Real Estate Loans. At June 30, 2023, $179.6 million, or 30.3%, of the total loan portfolio, before net items, consisted of one-to-four family residential loans.\nThe loan-to-value ratios, maturities, and other provisions of the loans made by us generally have reflected the policy of making less than the maximum loan permissible under applicable regulations, in accordance with sound lending practices, market conditions, and underwriting standards established by us. Our current lending policy on one-to-four family residential loans generally limits the maximum loan-to-value ratio to 90% or less of the appraised value of the property, although we will lend up to a 100% loan-to-value ratio with private mortgage insurance. These loans are amortized on a monthly basis with principal and interest due each month, terms not in excess of 30 years, and generally include due-on-sale clauses.\nAt June 30, 2023, $142.5 million, or 79.3%, of our one-to-four family residential mortgage loans were fixed-rate loans. Fixed-rate loans generally have maturities ranging from 15 to 30 years and are fully amortizing with monthly loan payments sufficient to repay the total amount of the loan with interest by the end of the loan term. Our fixed-rate loans generally are originated under terms, conditions, and documentation which permit them to be sold to U.S. Government-sponsored agencies, such as the Federal Home Loan Mortgage Corporation and other investors in the secondary mortgage market. Consistent with our asset/liability management, we have sold a significant portion of our long-term, fixed rate loans. Servicing is released on all loans sold except those loans sold to FNMA.\nAlthough we offer adjustable rate loans, substantially all of the single-family loan originations over the last few years have consisted of fixed-rate loans due to the low interest rate environment. The adjustable-rate loans held in portfolio typically have interest rates which adjust on an annual basis. These loans generally have an annual cap of 1% on any increase or decrease and a cap of 6% above or below the initial rate over the life of the loan. Such loans are underwritten based on the initial rate plus 2%. At June 30, 2023, $37.1 million, or 20.7%, of our one-to-four family residential mortgage loans were adjustable rate loans.\nCommercial Real Estate Secured Loans. As of June 30, 2023, Home Federal Bank had outstanding $148.4 million of loans secured by commercial real estate, $105.0 million, or 70.7%, of which were owner occupied. It is the current policy of Home Federal Bank to lend in a first lien position on real property occupied as a commercial business property. Home Federal Bank offers fixed and variable rate commercial real estate loans. Home Federal Banks commercial real estate loans are limited to a maximum of 85% of the appraised value and have terms up to 15 years, however, the terms are generally no more than five years with amortization periods of 20 years or less. It is our policy that commercial real estate secured lines of credit are limited to a maximum of 85% of the appraised value of the property and shall not exceed three to five year amortizations.\nMulti-Family Residential Loans. At June 30, 2023, we had outstanding approximately $28.8 million of multi-family residential loans. Our multi-family residential loan portfolio includes income producing properties of five or more units and low income housing developments. We obtain personal guarantees on all properties other than those of the public housing authority for which they are not permitted.\nCommercial Business Loans. At June 30, 2023, we had outstanding approximately $55.4 million of non-real estate secured commercial loans. The business lending products we offer include lines of credit, inventory financing, and equipment loans. Commercial business loans and lines of credit carry more credit risk than other types of commercial loans. We attempt to limit such risk by making loans predominantly to small- and mid-sized businesses located within our market area and having the loans personally guaranteed by the principals involved. We have established underwriting standards in regard to business loans which set forth the criteria for sources of repayment, borrowers capacity to repay, specific financial and collateral margins, and financial enhancements such as guarantees. The primary source of repayment is cash flow from the business and the general financial strength of the borrower.\nLand Loans. As of June 30, 2023, land loans were $26.8 million, or 5.4%, of the total loan portfolio, before net items. Land loans include land which has been acquired for the purpose of development and unimproved land. Our loan policy provides for loan-to-value ratios of 50% for unimproved land loans. Land loans are originated with fixed rates and terms up to five years with longer amortizations. Although land loans generally are considered to have greater credit risk than certain other types of loans, we expect to mitigate such risk by requiring personal guarantees and identifying other secondary sources of repayment for the land loan other than the sale of the collateral. It is our practice to only originate a limited amount of loans for speculative development to borrowers with whom our lenders have a prior relationship.\nConstruction Loans. At June 30, 2023, we had outstanding approximately $28.0 million, or 5.7%, of construction loans which included loans for the construction of residential and commercial property. Our residential construction loans typically have terms of six to twelve months with a takeout letter from Home Federal for the permanent mortgage. Our commercial construction loans include owner occupied commercial properties, pre-sold property, and speculative office property. As of June 30, 2023, we held $315,000 of speculative construction loans.\nHome Equity and Second Mortgage Loans. At June 30, 2023, we held $2.5 million of home equity and second mortgage loans. These loans are secured by the underlying equity in the borrowers residence. We do not require that we hold the first mortgage on the properties that secure the second mortgage loans. The amount of our second mortgage loans generally cannot exceed a loan-to-value ratio of 90% after taking into consideration the first mortgage loan. These loans are typically three-to-five year balloon loans with fixed rates and terms that will not exceed 10 years and contain an on-demand clause that allows us to call the loan in at any time.\nEquity Lines of Credit. We offer lines of credit secured by a borrowers equity in real estate. These loans amounted to $23.8 million, or 4.8% of the total loan portfolio, before net items, at June 30, 2023. The unused portion of equity lines was $13.2 million at June 30, 2023. The rates and terms of such lines of credit depend on the history and income of the borrower, purpose of the loan, and collateral. Lines of credit will not exceed 90% of the value of the equity in the collateral.\nConsumer Non-Real Estate Loans. We are authorized to make loans for a wide variety of personal or consumer purposes. We originate consumer loans primarily in order to accommodate our customers. The consumer loans at June 30, 2023 consist of loans secured by deposit accounts with us, automobile loans, overdraft, and other unsecured loans.\nConsumer non-real estate loans generally have shorter terms and higher interest rates than residential mortgage loans and generally entail greater credit risk than residential mortgage loans, particularly those loans secured by assets that depreciate rapidly, such as automobiles, boats, and recreational vehicles. In such cases, repossessed collateral for a defaulted consumer loan may not provide an adequate source of repayment for the outstanding loan, and the remaining deficiency often does not warrant further substantial collection efforts against the borrower. In particular, amounts realizable on the sale of repossessed automobiles may be significantly reduced based upon the condition of the automobiles and the fluctuating demand for used automobiles.\nWe offer loans secured by deposit accounts held with us. These loans amounted to $372,000, or 0.07% of the total loan portfolio, before net items, at June 30, 2023. Such loans are originated for up to 100% of the account balance, with a hold placed on the account restricting the withdrawal of the account balance. The interest rate on the loan is equal to the interest rate paid on the account plus 2%. These loans typically are payable on demand with a maturity date of one year.\nLoan Origination and Other Fees. In addition to interest earned on loans, we generally receive loan origination fees or points for originating loans. Loan points are a percentage of the principal amount of the mortgage loan and are charged to the borrower in connection with the origination of the loan. In accordance with accounting guidance, loan origination fees and points are deferred and amortized into income as an adjustment of yield over the life of the loan.\nAsset Quality\nGeneral. During fiscal 2023 our annual review commenced in August 2023 and is expected to be completed in October 2023. The scope of the services provided included testing of credit underwriting, adherence to our loan policies, as well as regulatory policies, and recommendations regarding reserve allocations. We expect these reviews will be done roughly every twelve to eighteen months.\nOur collection procedures provide that when a loan is 10 days past due personal contact efforts are attempted, either in person or by telephone. At 15 days past due, a late charge notice is sent to the borrower requesting payment. If the loan is still past due at 30 days, a formal letter is sent to the borrower stating that the loan is past due and that legal action, including foreclosure proceedings, may be necessary. If a loan becomes 60 days past due and no progress has been made in resolving the delinquency, a collection letter from legal counsel is sent and personal contact is attempted. When a loan continues in a delinquent status for 90 days or more, and a repayment schedule has not been made or kept by the borrower, generally a notice of intent to foreclose is sent to the borrower. If the delinquency is not cured, foreclosure proceedings are initiated. In most cases, deficiencies are cured promptly. While we generally prefer to work with borrowers to resolve such problems, we will institute foreclosure or other collection proceedings, when necessary, to minimize any potential loss.\nLoans are placed on non-accrual status when management believes the probability of collection of interest is doubtful. When a loan is placed on non-accrual status, previously accrued but unpaid interest is deducted from interest income. We generally discontinue the accrual of interest income when the loan becomes 90 days past due, as to principal or interest, unless the credit is well secured and we believe we will fully collect.\nReal estate and other assets we acquire as a result of foreclosure or by deed-in-lieu of foreclosure are classified as real estate owned until sold. At June 30, 2023, we had $368,000 in other real estate owned consisting of two single family residences compared to none at June 30, 2022.\nDelinquent Loans. The following table shows the delinquencies in our loan portfolio as of the dates indicated.\nJune 30,\n30 - 89 Days Overdue\n90 or More Days\nOverdue\n30 - 89 Days Overdue\n90 or More Days\nOverdue\nNumber\nPrincipal\nNumber\nPrincipal\nNumber\nPrincipal\nNumber\nPrincipal\nof Loans\nBalance\nof Loans\nBalance\nof Loans\nBalance\nof Loans\nBalance\n(Dollars in thousands)\nOne-to-four family residential\n$\n$\n$1,17 5\n$\n1,923\n$\nCommercial - real estate secured\n--\n--\n--\n--\n--\n--\n--\n--\nMulti-family residential\n--\n--\n--\n--\n--\n--\n--\n--\nCommercial business\n--\n--\n--\n--\n--\n--\nLand\n--\n--\n--\n--\n--\n--\nConstruction\n--\n--\n--\n--\n--\n--\n--\n--\nHome equity loans and lines of credit and other consumer\n--\n--\n--\n--\nTotal delinquent loans\n1,080\n$\n1,175\n$\n$\n1,947\n$\nDelinquent loans to total net loans\n0.22\n%\n0.24\n%\n0.50\n%\n0.30\n%\nDelinquent loans to total loans\n0.22\n%\n0.24\n%\n0.50\n%\n0.30\n%\nNon-Performing Assets. The following table shows the amounts of our non-performing assets (defined as non-accruing loans, accruing loans 90 days or more past due, and real estate owned) at the dates indicated.\nJune 30,\n(Dollars in thousands)\nNon-accruing loans:\nOne-to-four family residential\n$\n1,164\n$\n2,157\nCommercial - real estate secured\n--\n--\nMulti-family residential\n--\n--\nCommercial business\n--\nLand\n--\n--\nConstruction\n--\n--\nHome equity loans and lines of credit and other consumer\n--\n--\nTotal non-accruing loans\n1,228\n2,157\nAccruing loans 90 days or more past due:\nOne-to-four family residential\n--\nCommercial - real estate secured\n--\n--\nMulti-family residential\n--\n--\nCommercial business\n--\n--\nLand\n--\n--\nConstruction\n--\n--\nHome equity loans and lines of credit and other consumer\n--\n--\nTotal non-performing loans(1)\n1,228\n2,183\nReal estate owned, net\n--\nTotal non-performing assets\n$\n$\n2,183\nTroubled debt restructurings (2)\nTotal non-performing assets and troubled debt restructurings\n$ 1,606\n$\n2,395\nTotal non-performing loans as a percent of loans, net\n0.25\n%\n0.56\n%\nTotal non-performing assets as a percent of total assets\n0.06\n%\n0.37\n%\nTotal non-performing assets and troubled debt restructurings as a percentage of total assets\n0.24\n%\n0.41\n%\n(1)\nNon-performing loans consist of non-accruing loans plus accruing loans 90 days or more past due.\n(2)\nTroubled debt restructurings not included in non-accruing loans and accruing loans 90 days or more past due.\nAt June 30, 2023, the Company had $1.6 million of non-performing assets (defined as non-accruing loans, accruing loans 90 days or more past due, and other real estate owned) compared to $2.2 million of non-performing assets at June 30, 2022, consisting of seven single family residential loans, two commercial non-real estate loans, one consumer loan, and two single family residences in other real estate owned at June 30, 2023, compared to nine single family residential loans and one line of credit loan at June 30, 2022. The decrease in non-performing assets from $2.5 million at June 30, 2022 to $1.6 million at June 30, 2023 was primarily due to an improvement in loan credit quality at June 30, 2023. At June 30, 2023, the Company had ten single family residential loans, three commercial non-real estate loans, two commercial real estate loans, and three home equity line-of credit loans classified as substandard compared to five single family residential loans and two commercial real estate loans classified as substandard at June 30, 2022. There were no loans classified as doubtful at June 30, 2023 or 2022.\nClassified Assets. Federal regulations require that each insured savings institution classify its assets on a regular basis and the amount of its valuation allowance is subject to review by Federal bank regulators. There are three classifications for problem assets: substandard, doubtful, and loss. Substandard assets have one or more defined weaknesses and are characterized by the distinct possibility that the insured institution will sustain some loss, if the deficiencies are not corrected. Doubtful assets have the weaknesses of substandard assets with the additional characteristic that the weaknesses make collection or liquidation in full on the basis of currently existing facts, conditions, and values questionable, and there is a higher possibility of loss. An asset classified as loss is considered uncollectible and of such little value that continuance as an asset of the institution is not warranted. Another category designated special mention also must be established and maintained for assets which do not currently expose an insured institution to a sufficient degree of risk to warrant classification as substandard, doubtful, or loss. Assets classified as substandard or doubtful require the institution to establish general allowances for loan losses. If an asset, or portion thereof, is classified as loss, the insured institution must either establish specific allowances for loan losses in the amount of 100% of the portion of the asset classified loss, or charge-off such amount. General loss allowances established to cover possible losses related to assets classified substandard or doubtful may be included in determining an institutions regulatory capital, while specific valuation allowances for loan losses do not qualify as regulatory capital. Federal examiners may disagree with an insured institutions classifications and amounts reserved. At June 30, 2023, we had $7.1 million in classified assets. There were six residential mortgage loans designated as special mention for $810,000, six commercial non-real estate loans for $2.3 million and one auto loan for $1,000. There were seven residential mortgage loans totaling $2.2 million, five commercial real estate loans for $1.7 million, three home equity line-of-credit loans for $69,000, and one auto loan for $21,000 classified as substandard. There were no loans classified as doubtful or loss at June 30, 2023.\nAllowance for Loan Losses. At June 30, 2023, our allowance for loan losses amounted to $5.2 million. The allowance for loan losses is maintained at a level believed, to the best of our knowledge, to cover all known and inherent losses in the portfolio, both probable and reasonable, to be estimated at each reporting date. The level of allowance for loan losses is based on our periodic review of the collectability of the loans in light of historical experience, the nature and volume of the loan portfolio, adverse situations that may affect the borrowers ability to repay, estimated value of any underlying collateral, and prevailing conditions. Historically, we have primarily engaged in originating single-family residential loans. Our management considers the deficiencies of all classified loans in determining the amount of allowance for loan losses required at each reporting date. Our management analyzes the probability of the correction of the substandard loans weaknesses and the extent of any known or inherent losses that we might sustain on them. During the fiscal year 2023, we recorded a provision for loan losses of $868,000, as compared to $336,000 recorded for fiscal year 2022.\nThe increase in the provision for fiscal year 2023 primarily reflects an overall growth in our loan portfolio. Total non-performing loans decreased by approximately $0.8 million as of June 30, 2023 compared to June 30, 2022.\nWhile management believes that it determines the size of the allowance based on the best information available at the time, the allowance will need to be adjusted as circumstances change and assumptions are updated. Future adjustments to the allowance could significantly affect net income.\nThe following table shows changes in our allowance for loan losses during the periods presented. We had $237,000 and $31,000 of loan charge-offs during fiscal 2023 and 2022, respectively. Bad debt recoveries amounted to $91,000 and $24,000 during fiscal 2023 and 2022, respectively.\nJune 30,\n(Dollars in thousands)\nTotal loans outstanding at end of period\n$\n494,830\n$\n392,635\nAverage loans outstanding\n442,469\n360,774\nAllowance for loan losses, beginning of period\n4,451\n4,122\nProvision for loan losses\nRecoveries\nCharge-offs\n(237\n)\n(31\n)\nAllowance for loan losses, end of period\n$\n5,173\n$\n4,451\nAllowance for loan losses as a percent of non-performing loans\n417.85\n%\n202.91\n%\nAllowance for loan losses as a percent of loans outstanding\n1.05\n%\n1.13\n%\nThe following table shows how our allowance for loan losses is allocated by type of loan at each of the dates indicated.\nAmount of\nAllowance\nLoan\nCategory\nas a %\nof Total\nLoans\nAmount of\nAllowance\nLoan\nCategory\nas a %\nof Total\nLoans\n(Dollars in thousands)\nOne-to-four family residential\n$\n1,900\n36.72\n%\n$\n1,367\n30.71\n%\nCommercial - real estate secured\n1,673\n32.34\n1,295\n29.10\nMulti-family residential\n4.41\n8.02\nCommercial business\n11.37\n14.51\nLand\n5.30\n6.85\nConstruction\n4.91\n6.34\nHome equity loans and lines of credit and other consumer\n4.95\n4.47\nTotal\n$ 5,173\n100.00\n%\n$\n4,451\n100.00\n%\nInvestment Securities\nWe have authority to invest in various types of securities, including mortgage-backed securities, U.S. Treasury obligations, securities of various federal agencies and of state and municipal governments, certificates of deposit at federally insured banks and savings institutions, certain bankers acceptances, and federal funds. Our investment strategy is established by the board of directors.\nThe following table sets forth certain information relating to our investment securities portfolio at the dates indicated.\nJune 30,\nAmortized\nCost\nFair\nValue\nAmortized\nCost\nFair\nValue\n(In thousands)\nSecurities Held-to-Maturity:\nMortgage-backed securities\n$\n71,568\n$\n58,447\n$\n78,072\n$\n67,737\nMunicipals\n1,311\n1,231\n1,336\n1,234\nFNBB stock\nFHLB stock\n1,294\n1,294\nTotal Securities Held-to-Maturity\n74,423\n61,222\n79,950\n69,513\nSecurities Available-for-Sale:\nMortgage-backed securities\n32,063\n28,634\n30,250\n28,099\nMunicipals\n1,068\n1,076\n--\n--\nUS Treasury Securities\n9,779\n9,841\n--\n--\nTotal Securities Available for sale\n42,910\n39,551\n30,250\n28,099\nTotal Investment Securities\n$\n117,333\n$\n100,773\n$\n110,200\n$\n97,612\nThe following table sets forth the amount of investment securities which contractually mature during each of the periods indicated and the weighted average yields for each range of maturities at June 30, 2023. The amounts reflect the fair value of our securities at June 30, 2023.\nAmounts at June 30, 2023 which Mature in\nOne Year\nor Less\nWeighted\nAverage Yield\nOver One\nYear\nThrough\nFive\nYears\nWeighted\nAverage\nYield\nOver\nFive\nThrough\nTen\nYears\nWeighted\nAverage\nYield\nOver\nTen\nYears\nWeighted\nAverage\nYield\n(Dollars in thousands)\nBonds and other debt securities:\nMortgage-backed securities\n$\n--\n--\n%\n$\n3.14\n%\n$\n1,771\n2.85\n%\n$\n8 5, 309\n1.88\n%\nMunicipals\n--\n--\n1.05\n--\n--\n2,097\n3.19\nUS Treasury securities\n7,847\n2.15\n1,994\n2.01\n--\n--\n--\n--\nEquity securities(1):\nFNBB stock\n--\n--\n--\n--\n--\n--\n1.25\n%\nFHLB stock\n--\n--\n--\n--\n--\n--\n1,294\n4.60\n%\nTotal investment securities and bank stock\n$\n7,847\n2.15\n%\n$\n2,205\n1.92\n%\n$\n1, 771\n2.85\n%\n$\n88, 950\n1.95\n%\n(1)\nNone of the listed equity securities has a stated maturity.\nOur investment in equity securities consists primarily of FHLB stock and shares of First National Bankers Bankshares, Inc. (FNBB). Management monitors its investment portfolio to determine whether any investment securities which have unrealized losses should be considered other than temporarily impaired.\nMortgage-backed securities represent a participation interest in a pool of one-to-four family or multi-family mortgages. The mortgage originators use intermediaries (generally U.S. Government agencies and government-sponsored enterprises) to pool and repackage the participation interests in the form of securities, with investors receiving the principal and interest payments on the mortgages. Such U.S. Government agencies and government-sponsored enterprises guarantee the payment of principal and interest to investors.\nMortgage-backed securities are typically issued with stated principal amounts, and the securities are backed by pools of mortgages that have loans with interest rates that are within a range and have varying maturities. The underlying pool of mortgages, i.e., fixed-rate or adjustable-rate, as well as prepayment risk, are passed on to the certificate holder. The life of a mortgage-backed pass-through security approximates the life of the underlying mortgages.\nOur mortgage-backed securities consist of Ginnie Mae securities (GNMA), Freddie Mac securities (FHLMC), and Fannie Mae securities (FNMA). Ginnie Mae is a government agency within the Department of Housing and Urban Development, which is intended to help finance government-assisted housing programs. Ginnie Mae securities are backed by loans insured by the Federal Housing Administration or guaranteed by the Veterans Administration. The timely payment of principal and interest on Ginnie Mae securities is guaranteed by Ginnie Mae and backed by the full faith and credit of the U.S. Government. Freddie Mac is a private corporation chartered by the U.S. Government. Freddie Mac issues participation certificates backed principally by conventional mortgage loans. Freddie Mac guarantees the timely payment of interest and the ultimate return of principal on participation certificates. Fannie Mae is a private corporation chartered by the U.S. Congress with a mandate to establish a secondary market for mortgage loans. Fannie Mae guarantees the timely payment of principal and interest on Fannie Mae securities. Freddie Mac and Fannie Mae securities are not backed by the full faith and credit of the U.S. Government. In September 2008, the Federal Housing Finance Agency was appointed as conservator of Fannie Mae and Freddie Mac. The U.S. Department of the Treasury agreed to provide capital, as needed, to ensure that Fannie Mae and Freddie Mac continue to provide liquidity to the housing and mortgage markets.\nMortgage-backed securities generally yield less than the loans which underlie such securities because of their payment guarantees or credit enhancements, which offer nominal credit risk. In addition, mortgage-backed securities are more liquid than individual mortgage loans and may be used to collateralize our borrowings or other obligations.\nThe following table sets forth the composition of our mortgage-backed securities portfolio at fair value at each of the dates indicated. The amounts reflect the fair value of our mortgage-backed securities at June 30, 2023 and 2022.\nJune 30,\n(In thousands)\nFixed rate:\nGNMA\n$\n4,114\n$\n3,831\nFHLMC\n35,291\n34,906\nFNMA\n47,461\n55,940\nTotal fixed rate\n86,866\n94,677\nAdjustable rate:\nGNMA\n1,150\nFHLMC\nFNMA\n--\n--\nTotal adjustable-rate\n1,159\nTotal mortgage-backed securities\n$\n87,081\n$\n95,836\nInformation regarding the contractual maturities and weighted average yield of our mortgage-backed securities portfolio at June 30, 2023 is presented below. Due to repayments of the underlying loans, the actual maturities of mortgage-backed securities generally are substantially less than the scheduled maturities. The amounts reflect the fair value of our mortgage-backed securities at June 30, 2023.\nAmounts at June 30, 2023 Which Mature in\nOne Year\nor Less\nWeighted\nAverage\nYield\nOver One\nthrough\nFive Years\nWeighted\nAverage\nYield\nOver\nFive Years\nWeighted\nAverage\nYield\n(In thousands)\nFixed rate:\nGNMA\n$\n--\n--\n%\n$\n--\n--\n%\n$\n4,114\n1.53\n%\nFHLMC\n--\n--\n--\n--\n35,291\n1.90\nFNMA\n--\n--\n--\n--\n47,460\n1.88\nTotal fixed-rate\n--\n--\n%\n--\n--\n%\n$\n86,865\n1.87\n%\nAdjustable rate:\nGNMA\n$\n--\n--\n%\n$\n3.15\n%\n$\n2.71\n%\nFHLMC\n--\n--\n--\n--\n4.00\nFNMA\n--\n--\n--\n--\n--\n--\nTotal adjustable rate\n--\n--\n%\n$\n3.15\n%\n$\n2.74\n%\nTotal\n$\n--\n--\n%\n$\n3.15\n%\n$\n87,080\n1.87\n%\nThe following table sets forth the purchases, sales, and principal repayments of our mortgage-backed securities during the periods indicated.\nAt or For the\nYear Ended June 30,\n(Dollars in thousands)\nMortgage-backed securities at beginning of period\n$\n108,322\n$\n82,019\nPurchases\n6,278\n44,103\nRepayments\n(11,029\n)\n(17,716\n)\nSales\n--\n--\nAmortizations of premiums and discounts, net\n(84\n)\nMortgage-backed securities at end of period\n$\n103,631\n$\n108,322\nWeighted average yield at end of period\n1.84\n%\n1.68\n%\nSources of Funds\nGeneral. Deposits are our primary source of funds for lending and other investment purposes. In addition to deposits, principal and interest payments on loans and investment securities are a source of funds. Loan repayments are a relatively stable source of funds, while deposit inflows and outflows are significantly influenced by general interest rates and money market conditions. Borrowings may also be used on a short-term basis to compensate for reductions in the availability of funds from other sources and on a longer-term basis for general business purposes.\nDeposits. We attract deposits principally from residents of Louisiana and particularly from Caddo, Webster, and Bossier Parishes. Deposit account terms vary, with the principal differences being the minimum balance required, the time periods the funds must remain on deposit, and the interest rate. We utilize brokered certificates of deposit as a component of our strategy for lowering the overall cost of funds. The brokered certificates of deposit are callable by Home Federal Bank after twelve months. At June 30, 2023 and 2022, we had $3.0 million and $6.0 million, respectively, in brokered certificates of deposit.\nWe establish interest rates paid, maturity terms, service fees, and withdrawal penalties on a periodic basis. Management determines the rates and terms based on rates paid by competitors, the need for funds or liquidity, growth goals, and federal regulations. We attempt to control the flow of deposits by pricing our accounts to remain generally competitive with other financial institutions in the market area.\nThe following table shows the distribution of, and certain other information relating to, our deposits by type of deposit, as of the dates indicated.\nJune 30,\nAmount\nPercent of\nTotal\nDeposits\nAmount\nPercent of\nTotal\nDeposits\n(Dollars in thousands)\nCertificate accounts:\n0.00%- 0.99%\n$\n19,248\n3.22\n%\n$\n36,150\n$\n6.80\n%\n1.00%- 1.99%\n11,630\n1.95\n28,559\n5.37\n2.00%- 2.99%\n14,647\n2.45\n14,323\n2.69\n3.00%- 3.99%\n50,365\n8.43\n1,252\n0.23\n4.00%- 4.99%\n93,037\n15.57\n--\n--\n5.00%- 5.99%\n1,456\n0.24\n--\n--\nTotal certificate accounts\n190,383\n31 .87\n80,284\n15.09\nTransaction accounts:\nPassbook savings\n81,895\n13.71\n132,981\n25.00\nNon-interest-bearing demand accounts\n145,553\n24.37\n161,142\n30.29\nNOW accounts\n65,335\n10.94\n58,957\n11.08\nMoney market\n114,195\n19.12\n98,627\n18.54\nTotal transaction accounts\n406,978\n68.14\n451,707\n84.91\nTotal deposits\n$\n597,361\n100.00\n%\n$\n531,991\n100.00\n%\nThe following table shows the average balance of each type of deposit and the average rate paid on each type of deposit for the periods indicated.\nYear Ended June 30,\nAverage\nAverage\nAverage\nInterest\nRate\nAverage\nInterest\nRate\nBalance\nExpense\nPaid\nBalance\nExpense\nPaid\n(Dollars in thousands)\nPassbook savings\n$\n105,850\n$\n0.29\n%\n$\n136,139\n$\n0.29\n%\nNOW accounts\n63,074\n0.26\n%\n51,412\n0.11\nMoney market\n106,146\n1,078\n1.02\n%\n91,862\n0.12\nCertificates of deposit\n126,156\n2,952\n2.34\n%\n88,450\n1,212\n1.37\nTotal interest-bearing deposits\n401,226\n4,506\n1.12\n%\n367,863\n1,770\n0.51\nNon-Interest bearing demand accounts\n$\n168,169\n$\n--\n--\n%\n$\n145,522\n$\n--\n--\n%\nTotal deposits\n$\n569,395\n$\n4,506\n1.12\n%\n$\n513,385\n$\n1,770\n0.51\n%\nThe following table shows our deposit flows during the periods indicated.\nYear Ended June 30,\n(In thousands)\nNet deposits (withdrawals)\n$\n60,288\n$\n24,351\nInterest credited\n5,082\n1,044\nTotal increase in deposits\n$\n65,370\n$\n25,395\nThe following table presents, by various interest rate categories and maturities, the amount of certificates of deposit at June 30, 2023.\nBalance at June 30, 2023\nMaturing in the 12 Months Ending June 30,\nThereafter\nTotal\n(In thousands)\nCertificates of Deposit\n0.00%- 0.99%\n$\n11,380\n$\n2,764\n$\n2,584\n$\n2,525\n$\n19,253\n1.00%- 1.99%\n9,647\n1,673\n11,631\n2.00%- 2.99%\n14,436\n--\n--\n14,646\n3.00%- 3.99%\n50,366\n--\n--\n--\n50,366\n4.00%- 4.99%\n81,078\n8,200\n3,575\n93,031\n5.00%- 5.99%\n1,269\n--\n--\n1,456\nTotal certificate accounts\n$\n168,176\n$\n13,034\n$\n6,463\n$\n2,710\n$\n190,383\nThe following table shows the maturities of our certificates of deposit in excess of the FDIC insurance limit (generally, $250,000) at June 30, 2023 by time remaining to maturity.\nWeighted\nAmount\nAverage Rate\n(Dollars in thousands)\nSeptember 30, 2023\n$\n13,436\n3.64\n%\nDecember 31, 2023\n17,761\n3.56\nMarch 31, 2024\n17,162\n3.32\nJune 30, 2024\n8,190\n3.75\nAfter June 30, 2024\n2,519\n1.38\nTotal certificates of deposit with balances of $250,000 or more\n$\n59, 068\n3. 44\n%\nBorrowings. We may obtain advances from the Federal Home Loan Bank of Dallas upon the security of the common stock we own in that bank and certain of our residential mortgage loans and mortgage-backed and other investment securities, provided certain standards related to creditworthiness have been met. These advances are made pursuant to several credit programs, each of which has its own interest rate and range of maturities. Federal Home Loan Bank advances are generally available to meet seasonal and other withdrawals of deposit accounts and to permit increased lending.\nAs of June 30, 2023, we were permitted to borrow up to an aggregate total of $212.2 million from the Federal Home Loan Bank of Dallas. We had no Federal Home Loan Bank advances outstanding at June 30, 2023 and $832,000 of advances at June 30, 2022. Additionally, at June 30, 2023, Home Federal Bank was a party to a Master Purchase Agreement with First National Bankers Bank whereby Home Federal Bank may purchase Federal Funds from First National Bankers Bank in an amount not to exceed $20.4 million. There were no amounts purchased under this agreement as of June 30, 2023. At June 30, 2023, Home Federal Bancorp had available an $10.0 million line of credit agreement with First National Bankers Bank, maturing July 3, 2023. The credit agreement maturing July 3, 2023 was renewed with a scheduled maturity of August 29, 2023. A new credit agreement was executed on August 29, 2023, maturing on August 29, 2024. The line is secured by Home Federal Banks common stock and bears interest at the Prime Rate, which is subject to change when adjustments are made to Wall Street Journal Prime. At June 30, 2023, the line had an outstanding balance of $8.6 million.\nThe following table shows certain information regarding our borrowings at or for the dates indicated:\nAt or For the Year\nEnded June 30,\nFHLB advances:\n(Dollars in thousands)\nAverage balance outstanding\n$ 1,919\n$\nMaximum amount outstanding at any month-end during the period\n10,000\nBalance outstanding at end of period\n--\nAverage interest rate during the period\n5.20\n%\n4.83\n%\nWeighted average interest rate at end of period\n0.00\n%\n4.84\n%\nAt June 30, 2023, we had no outstanding advances from the Federal Home Bank of Dallas.\nSubsidiaries\nAt June 30, 2023, the Company had one subsidiary, Home Federal Bank. The Banks only subsidiary at such date was Metro Financial Services, Inc., which previously engaged in the sale of annuity contracts and does not currently engage in a meaningful amount of business.\nEmployees\nHome Federal Bank had 74 full-time employees and five part-time employees at June 30, 2023. None of these employees are covered by a collective bargaining agreement, and we believe that we enjoy good relations with our personnel.\nREGULATION\nGeneral\nHome Federal Bank, as a federally chartered savings bank, is subject to federal regulation and oversight by the Office of the Comptroller of the Currency extending to all aspects of its operations. Home Federal Bank also is subject to regulation and examination by the Federal Deposit Insurance Corporation, which insures the deposits of Home Federal Bank to the maximum extent permitted by law, and requirements established by the Federal Reserve Board. Federally chartered savings institutions are required to file periodic reports with the Office of the Comptroller of the Currency and are subject to periodic examinations by the Office of the Comptroller of the Currency and the Federal Deposit Insurance Corporation. The investment and lending authority of savings institutions is prescribed by federal laws and regulations, and such institutions are prohibited from engaging in any activities not permitted by such laws and regulations. Such regulation and supervision primarily are intended for the protection of depositors and not for the purpose of protecting shareholders.\nFederal law provides the federal banking regulators, including the Office of the Comptroller of the Currency and Federal Deposit Insurance Corporation, with substantial enforcement powers. The Office of the Comptroller of the Currencys enforcement authority over all savings institutions includes, among other things, the ability to assess civil money penalties, to issue cease and desist or removal orders, and to initiate injunctive actions. In general, these enforcement actions may be initiated for violations of laws and regulations and unsafe or unsound practices. Other actions or inactions may provide the basis for enforcement action, including misleading or untimely reports filed with the Office of the Comptroller of the Currency. Any change in these laws and regulations, whether by the Federal Deposit Insurance Corporation, Office of the Comptroller of the Currency, or Congress, could have a material adverse impact on Home Federal Bancorp and Home Federal Bank and our operations.\n2018 Regulatory Reform\nIn May 2018 the Economic Growth, Regulatory Relief and Consumer Protection Act (the Act), was enacted to modify or remove certain financial reform rules and regulations, including some of those implemented under the Dodd-Frank Wall Street Reform and Consumer Protection Act enacted in 2010 (the Dodd-Frank Act). While the Act maintains most of the regulatory structure established by the Dodd-Frank Act, it amends certain aspects of the regulatory framework for small depository institutions with assets of less than $10 billion and for large banks with assets of more than $50 billion. Many of these changes could result in meaningful regulatory relief for community banks such as Home Federal Bank.\nThe Act, among other matters, expands the definition of qualified mortgages which may be held by a financial institution and simplifies the regulatory capital rules for financial institutions and their holding companies with total consolidated assets of less than $10 billion by instructing the federal banking regulators to establish a single Community Bank Leverage Ratio of between 8 and 10 percent to replace the leverage and risk-based regulatory capital ratios. This expansion also excludes such holding companies from the minimum capital requirements of the Dodd-Frank Act. In addition, the Act includes regulatory relief for community banks regarding regulatory examination cycles, call reports, the Volcker Rule (proprietary trading prohibitions), mortgage disclosures and risk weights for certain high-risk commercial real estate loans.\nRegulation of Home Federal Bancorp\nHome Federal Bancorp, a Louisiana corporation, is a registered savings and loan holding company within the meaning of Section 10 of the Home Owners Loan Act and is subject to examination and supervision by the Federal Reserve Board, as well as certain reporting requirements. While new capital requirements began to phase in for savings and loan holding companies on January 1, 2015, Home Federal Bancorp is currently exempt from those requirements. In addition, because Home Federal Bank is a subsidiary of a savings and loan holding company, it is subject to certain restrictions in dealing with us and with other persons affiliated with the Bank.\nHolding Company Acquisitions. Home Federal Bancorp is a savings and loan holding company under the Home Owners Loan Act, as amended. Federal law generally prohibits a savings and loan holding company, without prior approval of the Federal Reserve Board, from acquiring the ownership or control of any other savings institution or savings and loan holding company, or all, or substantially all, of the assets, or more than 5% of the voting shares of the savings institution or savings and loan holding company. These provisions also prohibit, among other things, any director or officer of a savings and loan holding company, or any individual who owns or controls more than 25% of the voting shares of such holding company, from acquiring control of any savings institution not a subsidiary of such savings and loan holding company, unless the acquisition is approved by the Federal Reserve Board.\nThe Federal Reserve Board may not approve any acquisition that would result in a multiple savings and loan holding company controlling savings institutions in more than one state, subject to two exceptions: (i) the approval of interstate supervisory acquisitions by savings and loan holding companies and (ii) the acquisition of a savings institution in another state, if the laws of the state of the target savings institution specifically permit such acquisitions. The states vary in the extent to which they permit interstate savings and loan holding company acquisitions.\nHolding Company Activities. Home Federal Bancorp operates as a unitary savings and loan holding company and is permitted to engage only in the activities permitted for financial institution holding companies or for multiple savings and loan holding companies. Multiple savings and loan holding companies are permitted to engage in the following activities: (i) activities permitted for a bank holding company under section 4(c) of the Bank Holding Company Act (unless the Federal Reserve Board prohibits or limits such 4(c) activities); (ii) furnishing or performing management services for a subsidiary savings association; (iii) conducting any insurance agency or escrow business; (iv) holding, managing, or liquidating assets owned by or acquired from a subsidiary savings association; (v) holding or managing properties used or occupied by a subsidiary savings association; (vi) acting as trustee under deeds of trust; or (vii) activities authorized by regulation as of March 5, 1987 to be engaged in by multiple savings and loan holding companies. Under the Dodd-Frank Act, savings and loan holding companies became subject to statutory capital requirements. However, in May 2015, amendments to the Small Bank Holding Company (SBHC) Policy became effective. The amendments made the SBHC Policy applicable to savings and loan holding companies, such as Home Federal Bancorp, and increased the asset threshold to qualify to be subject to the provisions of the SBHC Policy from $500 million to $1.0 billion. The 2018 regulatory reform increased the asset threshold to $3.0 billion. Savings and loan holding companies that have total assets of $3.0 billion or less are subject to the SBHC Policy and are not required to comply with the regulatory capital requirements set forth in the table below. Such treatment continues until Home Federal Bancorps total assets exceed $3.0 billion or the Federal Reserve Board deems it to no longer be a small savings and loan holding company.\nWhile there are no specific restrictions on the payment of dividends or other capital distributions for savings and loan holding companies, federal regulations do prescribe such restrictions on subsidiary savings institutions, as described below. Home Federal Bank is required to notify the Federal Reserve Board 30 days before declaring any dividend. In addition, the financial impact of a holding company on its subsidiary institution is a matter that is evaluated by the Federal Reserve Board, and the agency has authority to order cessation of activities or divestiture of subsidiaries deemed to pose a threat to the safety and soundness of the institution.\nAll savings associations subsidiaries of savings and loan holding companies are required to meet a qualified thrift lender, or QTL, test to avoid certain restrictions on their operations. If the subsidiary savings institution fails to meet the QTL, as discussed below, then the savings and loan holding company must register with the Federal Reserve Board as a bank holding company, unless the savings institution requalifies as a QTL within one year thereafter.\nFederal Securities Laws. Home Federal Bancorp registered its common stock with the Securities and Exchange Commission under Section 12(b) of the Securities Exchange Act of 1934. Home Federal Bancorp is subject to the proxy and tender offer rules, insider trading reporting requirements and restrictions, and certain other requirements under the Securities Exchange Act of 1934.\nThe Sarbanes-Oxley Act. As a public company, Home Federal Bancorp is subject to the Sarbanes-Oxley Act of 2002 which addresses, among other issues, corporate governance, auditing and accounting, executive compensation, and enhanced and timely disclosure of corporate information. As directed by the Sarbanes-Oxley Act, our principal executive officer and principal financial officer are required to certify that our quarterly and annual reports do not contain any untrue statement of a material fact. The rules adopted by the Securities and Exchange Commission under the Sarbanes-Oxley Act have several requirements, including having these officers certify that: (i) they are responsible for establishing, maintaining, and regularly evaluating the effectiveness of our internal control over financial reporting; (ii) they have made certain disclosures to our auditors and the audit committee of the Board of Directors about our internal control over financial reporting; and they have included information in our quarterly and annual reports about their evaluation and (iii) whether there have been changes in our internal control over financial reporting or in other factors that could materially affect internal control over financial reporting.\nVolcker Rule Regulations\nRegulations have been adopted by the federal banking agencies to implement the provisions of the Dodd-Frank Act, commonly referred to as the Volcker Rule. The regulations contain prohibitions and restrictions on the ability of financial institutions holding companies and their affiliates to engage in proprietary trading and to hold certain interests in, or to have certain relationships with, various types of investment funds, including hedge funds and private equity funds. However, federal regulations exclude from the Volcker Rule restrictions community banks with $10 billion or less in total consolidated assets and total trading assets and liabilities of five percent or less of total consolidated assets. Home Federal Bancorp qualifies for the exclusion from the Volcker Rule restrictions.\nRegulation of Home Federal Bank\nGeneral. Home Federal Bank is subject to the regulation of the Office of the Comptroller of the Currency, as its primary federal regulator, the Federal Deposit Insurance Corporation, as the insurer of its deposit accounts, and, to a limited extent, the Federal Reserve Board.\nInsurance of Accounts. The deposits of Home Federal Bank are insured up to $250,000 per separately insured deposit ownership right or category by the Deposit Insurance Fund (DIF) of the Federal Deposit Insurance Corporation and are backed by the full faith and credit of the U.S. Government. As insurer, the Federal Deposit Insurance Corporation is authorized to conduct examinations of and to require reporting by insured institutions. It also may prohibit any insured institution from engaging in any activity determined by regulation or order to pose a serious threat to the Federal Deposit Insurance Corporation. The Federal Deposit Insurance Corporation also has the authority to initiate enforcement actions against savings institutions after giving the Office of the Comptroller of the Currency an opportunity to take such action.\nThe Federal Deposit Insurance Corporation assesses deposit insurance premiums quarterly on each insured institution applied to its deposit base, which is their average consolidated total assets minus its Tier 1 capital. No institution may pay a dividend if it is in default on its federal deposit insurance assessment. Total base assessment rates currently range from 3 to 30 basis points subject to certain adjustments.\nExtraordinary growth in insured deposits during the first and second quarters of 2020 caused the DIF reserve ratio to decline below the statutory minimum of 1.35 percent as of June 30, 2020. In September 2020, the Federal Deposit Insurance Corporation Board of Directors adopted a Restoration Plan to restore the reserve ratio to at least 1.35 percent within eight years, absent extraordinary circumstances, as required by the Federal Deposit Insurance Act. The Restoration Plan maintained the assessment rate schedules in place at the time and required the Federal Deposit Insurance Corporation to update its analysis and projections for the deposit insurance fund balance and reserve ratio at least semiannually.\nIn the semiannual update for the Restoration Plan in June 2022, the Federal Deposit Insurance Corporation projected that the reserve ratio was at risk of not reaching the statutory minimum of 1.35 percent by September 30, 2028, the statutory deadline to restore the reserve ratio. Based on this update, the Federal Deposit Insurance Corporation Board approved an Amended Restoration Plan, and concurrently proposed an increase in initial base deposit insurance assessment rate schedules uniformly by 2 basis points, applicable to all insured depository institutions.\nIn October 2022, the Federal Deposit Insurance Corporation Board finalized the increase with an effective date of January 1, 2023, applicable to the first quarterly assessment period of 2023. The revised assessment rate schedules are intended to increase the likelihood that the reserve ratio of the DIF reaches the statutory minimum level of 1.35 percent by September 30, 2028. Revised assessment rate schedules will remain in effect unless and until the reserve ratio meets or exceeds two percent, absent further action by the Federal Deposit Insurance Corporation Board. A significant increase in insurance premiums or a special assessment levied by the Federal Deposit Insurance Corporation could likely have an adverse effect on the operating expenses and results of operations of Home Federal Bank. There can be no prediction as to what changes in insurance assessment rates may be made in the future.\nThe Federal Deposit Insurance Corporation may terminate the deposit insurance of any insured depository institution, including Home Federal Bank, if it determines after a hearing that the institution has engaged or is engaging in unsafe or unsound practices, is in an unsafe or unsound condition to continue operations, or has violated any applicable law, regulation, order, or any condition imposed by an agreement with the Federal Deposit Insurance Corporation. It also may suspend deposit insurance temporarily during the hearing process for the permanent termination of insurance, if the institution has no tangible capital. If insurance of accounts is terminated, the accounts at the institution at the time of the termination, less subsequent withdrawals, shall continue to be insured for a period of six months to two years, as determined by the Federal Deposit Insurance Corporation. Management is aware of no existing circumstances which would result in termination of Home Federal Banks deposit insurance.\nRegulatory Capital Regulations\nIn July of 2013, the respective U.S. federal banking agencies issued final rules implementing Basel III and the Dodd-Frank Act capital requirements to be fully-phased in on a global basis on January 1, 2019. The 2013 regulations establish a tangible common equity capital requirement, increase the minimum requirement for the current Tier 1 risk-weighted asset (RWA) ratio, phase out certain kinds of intangibles treated as capital and certain types of instruments, and change the risk weightings of certain assets used to determine required capital ratios. Provisions of the Dodd-Frank Act generally require these capital rules to apply to savings and loan holding companies and their savings association subsidiaries. The common equity Tier 1 capital component requires capital of the highest quality - predominantly composed of retained earnings and common stock instruments. For community banks, such as Home Federal Bank, the new capital rules require a common equity Tier 1 capital ratio of 4.5% and also increased the minimum Tier 1 capital ratio from 4.0% to 6.0%. In addition, in order to make capital distributions and pay discretionary bonuses to executive officers without restriction, an institution must also maintain greater than 2.5% in common equity attributable to a capital conservation buffer. The rules also increase the risk weights for several categories of assets, including an increase from 100% to 150% for certain acquisition, development, and construction loans and more than 90-day past due exposures. The capital rules maintain the general structure of the prompt corrective action rules but incorporate the new common equity Tier 1 capital requirement and the increase Tier 1 RWA requirement into the prompt corrective action framework.\nEffective January 1, 2020, qualifying community banking organizations may elect to comply with a greater than 9% community bank leverage ratio (the CBLR) requirement in lieu of the currently applicable requirements for calculating and reporting risk-based capital ratios. The CBLR is equal to Tier 1 capital divided by average total consolidated assets. In order to qualify for the CBLR election, a community bank must (i) have a leverage capital ratio greater than 9 percent, (2) have less than $10 billion in average total consolidated assets, (3) not exceed certain levels of off-balance sheet exposure and trading assets plus trading liabilities and (4) not be an advanced approaches banking organization. A community bank that meets the above qualifications and elects to utilize the CBLR is considered to have satisfied the risk-based and leverage capital requirements in the generally applicable capital rules and is also considered to be well capitalized under the prompt corrective action rules. As of June 30, 2022, Home Federal Bank has not made the CBLR election.\nUnless a community bank qualifies for and elects to comply with the CBLR beginning on January 1, 2020, federally insured savings institutions are required to maintain the minimum levels of regulatory capital described below. Current Office of the Comptroller of the Currency capital standards require savings institutions to satisfy a tangible capital requirement, a common equity Tier 1 capital requirement, a leverage capital requirement and a risk-based capital requirement. The tangible capital must equal at least 1.5% of adjusted total assets. The common equity Tier 1 capital component generally consists of retained earnings and common stock instruments and must equal at least 4.5% of risk-weighted assets. Leverage capital, also known as core capital, must equal at least 3.0% of adjusted total assets for the most highly rated savings associations. An additional cushion of at least 100 basis points is required for all other savings associations, which effectively increases their minimum Tier 1 leverage ratio to 4.0% or more. Under the Office of the Comptroller of the Currencys regulation, the most highly-rated banks are those that the Office of the Comptroller of the Currency determines are strong associations that are not anticipating or experiencing significant growth and have well-diversified risk, including no undue interest rate risk exposure, excellent asset quality, high liquidity, and good earnings. Under the risk-based capital requested, Total capital (a combination of core and supplementary capital) must equal at least 8.0% of risk-weighted assets. The Office of the Comptroller of the Currency also is authorized to impose capital requirements in excess of these standards on individual institutions on a case-by-case basis.\nCore capital generally consists of common stockholders equity (including retained earnings). Tangible capital generally equals core capital minus intangible assets, with only a limited exception for purchased mortgage servicing rights. Home Federal Bank had no intangible assets at June 30, 2022. Both core and tangible capital are further reduced by an amount equal to a savings institutions debt and equity investments in subsidiaries engaged in activities not permissible to national banks (other than subsidiaries engaged in activities undertaken as agent for customers or in mortgage banking activities and subsidiary depository institutions or their holding companies). These adjustments do not affect Home Federal Banks regulatory capital.\nIn determining compliance with the risk-based capital requirement, a savings institution is allowed to include both core capital and supplementary capital in its total capital, provided that the amount of supplementary capital included does not exceed the savings institutions core capital. Supplementary capital generally consists of general allowances for loan losses up to a maximum of 1.25% of risk-weighted assets together with certain other items. In determining the required amount of risk-based capital, total assets, including certain off-balance sheet items, are multiplied by a risk weight based on the risks inherent in the type of assets. The risk weights range from 0% for cash and securities issued by the U.S. Government, or unconditionally backed by the full faith and credit of the U.S. Government, to 100% for loans (other than qualifying residential loans weighted at 80%) and repossessed assets.\nSavings institutions must value securities available for sale at amortized cost for regulatory capital purposes. This means that in computing regulatory capital, savings institutions should add back any unrealized losses and deduct any unrealized gains, net of income taxes, on debt securities reported as a separate component of capital as defined by generally accepted accounting principles.\nAt June 30, 2023, Home Federal Bank exceeded all of its regulatory capital requirements with tangible, common equity Tier 1, core, and risk-based capital ratios of 8.69%, 12.79%, 8.69% and 13.95%, respectively.\nAny savings institution that fails any of the capital requirements is subject to possible enforcement actions by the Office of the Comptroller of the Currency or the Federal Deposit Insurance Corporation. Such actions could include a capital directive, a cease and desist order, civil money penalties, establishment of restrictions on the institutions operations, termination of federal deposit insurance, and the appointment of a conservator or receiver. The Office of the Comptroller of the Currencys capital regulation provides that such actions, through enforcement proceedings or otherwise, could require one or more of a variety of corrective actions.\nPrompt Corrective Action. The following table shows the amount of capital associated with the different capital categories set forth in the prompt corrective action regulations.\nTotal Risk-\nTier 1 Risk-\nCommon\nTier 1\nBased\nBased\nEquity Tier 1\nLeverage\nCapital Category\nCapital\nCapital\nCapital\nCapital\nWell capitalized\n10% or more\n8% or more\n6.5% or more\n5% or more\nAdequately capitalized\n8% or more\n6% or more\n4.5% or more\n4% or more\nUndercapitalized\nLess than 8%\nLess than 6%\nLess than 4.5%\nLess than 4%\nSignificantly undercapitalized\nLess than 6%\nLess than 4%\nLess than 3%\nLess than 3%\nIn addition, an institution is critically undercapitalized if it has a ratio of tangible equity to total assets that is equal to or less than 2.0%. Under specified circumstances, a federal banking agency may reclassify a well-capitalized institution as adequately capitalized and may require an adequately capitalized institution or an undercapitalized institution to comply with supervisory actions as if it were in the next lower category (except that the Office of the Comptroller of the Currency may not reclassify a significantly undercapitalized institution as critically undercapitalized).\nAn institution, generally, must file a written capital restoration plan which meets specified requirements within 45 days of the date that the institution receives notice or is deemed to have notice that it is undercapitalized, significantly undercapitalized, or critically undercapitalized. A federal banking agency must provide the institution with written notice of approval or disapproval within 60 days after receiving a capital restoration plan, subject to extensions by the agency. An institution which is required to submit a capital restoration plan must concurrently submit a performance guaranty by each company that controls the institution. In addition, undercapitalized institutions are subject to various regulatory restrictions, and the appropriate federal banking agency also may take any number of discretionary supervisory actions.\nAt June 30, 2023, Home Federal Bank was deemed a well-capitalized institution for purposes of the prompt corrective action regulations and as such is not subject to the above mentioned restrictions.\nCapital Distributions. Office of the Comptroller of the Currency regulations govern capital distributions by savings institutions, which include cash dividends, stock repurchases, and other transactions charged to the capital account of a savings institution to make capital distributions. A savings institution must file an application for Office of the Comptroller of the Currency approval of the capital distribution if either (i) the total capital distributions for the applicable calendar year exceed the sum of the institutions net income for that year to date plus the institutions retained net income for the preceding two years, (ii) the institution would not be at least adequately capitalized following the distribution, (iii) the distribution would violate any applicable statute, regulation, agreement, or Office of the Comptroller of the Currency-imposed condition, or (iv) the institution is not eligible for expedited treatment of its filings. If an application is not required to be filed, savings institutions must still file a notice with the Office of the Comptroller of the Currency at least 30 days before the board of directors declares a dividend or approves a capital distribution if either (i) the institution would not be well-capitalized following the distribution; (ii) the proposed distribution would reduce the amount or retire any part of our common or preferred stock or retire any part of a debt instrument included in our regulatory capital, or (iii) the savings institution is a subsidiary of a savings and loan holding company, and the proposed capital distribution is not a cash dividend. If a savings institution, such as Home Federal Bank, that is the subsidiary of a savings and loan holding company has filed a notice with the Federal Reserve Board for a cash dividend and is not required to file an application or notice with the Office of the Comptroller of the Currency for any of the reasons described above, then the savings institution is only required to provide an informational copy to the Office of the Comptroller of the Currency of the notice filed with the Federal Reserve Board at the same time that it is filed with the Federal Reserve Board.\nAn institution that either before or after a proposed capital distribution fails to meet its then applicable minimum capital requirement or that has been notified that it needs more than normal supervision may not make any capital distributions without the prior written approval of the Office of the Comptroller of the Currency. In addition, the Office of the Comptroller of the Currency may prohibit a proposed capital distribution, which would otherwise be permitted by Office of the Comptroller of the Currency regulations, if the Office of the Comptroller of the Currency determines that such distribution would constitute an unsafe or unsound practice.\nUnder federal rules, an insured depository institution may not pay any dividend, if payment would cause it to become undercapitalized, or if it is already undercapitalized. In addition, federal regulators have the authority to restrict or prohibit the payment of dividends for safety and soundness reasons. The Federal Deposit Insurance Corporation also prohibits an insured depository institution from paying dividends on its capital stock or interest on its capital notes or debentures (if such interest is required to be paid only out of net profits) or distributing any of its capital assets while it remains in default in the payment of any assessment due the Federal Deposit Insurance Corporation. Home Federal Bank is currently not in default in any assessment payment to the Federal Deposit Insurance Corporation.\nQualified Thrift Lender Test. All savings institution subsidiaries of savings and loan holding companies are required to meet a qualified thrift lender, or QTL, test to avoid certain restrictions on their operations. A savings institution can comply with the QTL test by either qualifying as a domestic building and loan association as defined in the Internal Revenue Code or meeting the Office of the Comptroller of the Currency QTL test. Currently, the Office of the Comptroller of the Currency QTL test requires that 65% of an institutions portfolio assets (as defined) consist of certain housing and consumer-related assets on a monthly average basis in nine out of every 12 months. To be a qualified thrift lender under the IRS test, the savings institution must meet a business operations test and a 60 percent assets test, each defined in the Internal Revenue Code.\nIf a savings association fails to remain a QTL, it is immediately prohibited from the following:\n●\nMaking any new investments or engaging in any new activity not allowed for both a national bank and a savings association;\n●\nEstablishing any new branch office unless allowable for a national bank; and\n●\nPaying dividends unless allowable for a national bank and necessary to meet the obligations of its holding company.\nAny company that controls a savings institution that is not a qualified thrift lender must register as a bank holding company within one year of the savings institutions failure to meet the QTL test. Three years from the date a savings association should have become or ceases to be a QTL, the institution must dispose of any investment or not engage in any activity unless the investment or activity is allowed for both a national bank and a savings association. A savings institution not in compliance with the QTL test is also subject to an enforcement action for violation of the Home Owners Loan Act, as amended.\nAt June 30, 2023, Home Federal Bank believes that it meets the requirements of the QTL test.\nCommunity Reinvestment Act. Home Federal Bank is subject to the provisions of the Community Reinvestment Act of 1977 (CRA), which require the appropriate federal bank regulatory agency to assess a banks performance under the CRA in meeting the credit needs of the community serviced by Home Federal Bank, including low and moderate income neighborhoods. The regulatory agencys assessment of Home Federal Banks record is made available to the public. Further, a banks CRA performance must be considered in connection with a banks application, to among other things, establish a new branch office that will accept deposits, relocate an existing office or merge or consolidate with, or acquire the assets or assume the liabilities of, a federally regulated financial institution. An unsatisfactory rating may be the basis for denial of certain applications. Home Federal Bank received a satisfactory rating during its most recent CRA examination.\nOn May 5, 2022, the federal bank regulatory agencies overhauled the CRA and jointly issued a proposal to strengthen and modernize regulations implementing the CRA. The proposed regulations included major changes from the current regulation and will be effective on the first day of the first calendar quarter that begins at least 60 days after the publication date of the final rules. The new rules as proposed are intended to, (1) provide expanded access to credit, investment, and basic banking services in low- and moderate-income communities, (2) address changes in the banking industry, including internet and mobile banking, (3) yield greater clarity, consistency, and transparency, (4) tailor CRA evaluations and data collection to bank size and type and (4) maintain a unified approach amongst the regulating agencies.\nLimitations on Transactions with Affiliates. Transactions between a savings association and any affiliate are governed by Sections 23A and 23B of the Federal Reserve Act as made applicable to savings associations by Section 11 of the Home Owners Loan Act. An affiliate of a savings association is any company or entity which controls the savings association or that is controlled by a company that controls the savings association. In a holding company context, the holding company of a savings association (such as Home Federal Bancorp) and any companies which are controlled by such holding company are affiliates of the savings association. Generally, Section 23A limits the extent to which the savings association or its subsidiaries may engage in covered transactions with any one affiliate to an amount equal to 10% of such associations capital stock and surplus and contains an aggregate limit on all such transactions with all affiliates to an amount equal to 20% of such capital stock and surplus. Section 23B applies to covered transactions as well as certain other transactions and requires that all transactions be on terms substantially the same, or at least as favorable, to the savings association as those provided to a non-affiliate. The term covered transaction includes the making of loans to, purchase of assets from, and issuance of a guarantee to an affiliate and similar transactions. Section 23B transactions also include the provision of services and the sale of assets by a savings association to an affiliate. In addition to the restrictions imposed by Sections 23A and 23B, a savings association is prohibited from (i) making a loan or other extension of credit to an affiliate, except for any affiliate which engages only in certain activities which are permissible for bank holding companies, or (ii) purchasing or investing in any stocks, bonds, debentures, notes, or similar obligations of any affiliate, except for affiliates which are subsidiaries of the savings association.\nIn addition, Sections 22(g) and (h) of the Federal Reserve Act as made applicable to savings associations by Section 11 of the Home Owners Loan Act place restrictions on loans to executive officers, directors, and principal shareholders of the savings association and its affiliates. Under Section 22(h), loans to a director, an executive officer, and to a greater than 10% shareholder of a savings association, and certain affiliated interests of either, may not exceed, together with all other outstanding loans to such person and affiliated interests, the savings associations loans to one borrower limit (generally equal to 15% of the associations unimpaired capital and surplus). Section 22(h) also requires that loans to directors, executive officers, and principal shareholders be made on terms substantially the same as offered in comparable transactions to other persons unless the loans are made pursuant to a benefit or compensation program that (i) is widely available to employees of the savings association and (ii) does not give preference to any director, executive officer, or principal shareholder, or certain affiliated interests of either, over other employees of the savings association. Section 22(h) also requires prior board approval for certain loans. In addition, the aggregate amount of extensions of credit by a savings association to all insiders cannot exceed the savings associations unimpaired capital and surplus. Furthermore, Section 22(g) places additional restrictions on loans to executive officers. Home Federal Bank currently is subject to Section 22(g) and (h) of the Federal Reserve Act and at June 30, 2023, was in compliance with the above restrictions.\nIncentive Compensation. Guidelines adopted by the federal banking agencies pursuant to the FDIA prohibit excessive compensation as an unsafe and unsound practice and describe compensation as excessive when the amounts paid are unreasonable or disproportionate to the services performed by an executive officer, employee, director, or principal stockholder.\nIn June 2010, the federal banking agencies issued comprehensive guidance on incentive compensation policies (the Incentive Compensation Guidance) intended to ensure that the incentive compensation policies of banking organizations do not undermine the safety and soundness of such organizations by encouraging excessive risk-taking. The Incentive Compensation Guidance, which covers all employees that have the ability to materially affect the risk profile of an organization, either individually or as part of a group, is based upon the key principles that a banking organizations incentive compensation arrangements should (i) provide incentives that do not encourage risk-taking beyond the organizations ability to effectively identify and manage risks, (ii) be compatible with effective internal controls and risk management, and (iii) be supported by strong corporate governance, including active and effective oversight by the organizations board of directors. Any deficiencies in compensation practices that are identified may be incorporated into the organizations supervisory ratings, which can affect its ability to make acquisitions or perform other actions. The Incentive Compensation Guidance provides that enforcement actions may be taken against a banking organization if its incentive compensation arrangements or related risk-management control or governance processes pose a risk to the organizations safety and soundness and the organization is not taking prompt and effective measures to correct the deficiencies.\nRegulation of Residential Mortgage Loan Originators. Under the final rule adopted by the federal bank regulatory authorities pursuant to the Secure and Fair Enforcement for Mortgage Licensing Act of 2008, residential mortgage loan originators employed by financial institutions, such as Home Federal Bank, must register with the Nationwide Mortgage Licensing System and Registry, obtain a unique identifier from the registry, and maintain their registration. Any residential mortgage loan originator who fails to satisfy these requirements will not be permitted to originate residential mortgage loans.\nAnti-Money Laundering. All financial institutions, including savings associations, are subject to federal laws that are designed to prevent the use of the U.S. financial system to fund terrorist activities. Financial institutions operating in the United States must develop anti-money laundering compliance programs, due diligence policies, and controls to ensure the detection and reporting of money laundering. Such compliance programs are intended to supplement compliance requirements, also applicable to financial institutions, under the Bank Secrecy Act and the Office of Foreign Assets Control Regulations. Home Federal Bank has established policies and procedures to ensure compliance with these provisions.\nPrivacy Standards and Cybersecurity. The Gramm-Leach-Bliley Financial Services Modernization Act of 1999 modernized the financial services industry by establishing a comprehensive framework to permit affiliations among commercial banks, insurance companies, securities firms and other financial service providers. Federal banking agencies, including the FDIC, have adopted guidelines for establishing information security standards and cybersecurity programs for implementing safeguards under the supervision of the board of directors. These guidelines, along with related regulatory materials, increasingly focus on risk management and processes related to information technology and the use of third parties in the provision of financial services. These regulations require Home Federal Bank to disclose its privacy policy, including informing consumers of its information sharing practices and informing consumers of their rights to opt out of certain practices. In addition, Louisiana State and other federal and state cybersecurity and data privacy laws and regulations may expose Home Federal Bank to risk and result in certain risk management costs. In addition, on November 18, 2021, the federal banking agencies announced the adoption of a final rule providing for new notification requirements for banking organizations and their service providers for significant cybersecurity incidents. Specifically, the new rule requires a banking organization to notify its primary federal regulator as soon as possible, and no later than 36 hours after, the banking organization determines that a computer-security incident rising to the level of a notification incident has occurred. Notification is required for incidents that have materially affected or are reasonably likely to materially affect the viability of a banking organizations operations, its ability to deliver banking products and services, or the stability of the financial sector. Service providers are required under the rule to notify affected banking organization customers as soon as possible when the provider determines that it has experienced a computer-security incident that has materially affected or is reasonably likely to materially affect the banking organizations customers for four or more hours. Compliance with the new rule was required by May 1, 2022. Non-compliance with federal or similar state privacy and cybersecurity laws and regulations could lead to substantial regulatory imposed fines and penalties, damages from private causes of action and/or reputational harm.\nFederal Home Loan Bank System. Home Federal Bank is a member of the Federal Home Loan Bank of Dallas, which is one of 11 regional Federal Home Loan Banks that administer a home financing credit function primarily for its members. Each Federal Home Loan Bank serves as a reserve or central bank for its members within its assigned region. The Federal Home Loan Bank of Dallas is funded primarily from proceeds derived from the sale of consolidated obligations of the Federal Home Loan Bank System. It makes loans to members (i.e., advances) in accordance with policies and procedures established by the board of directors of the Federal Home Loan Bank. At June 30, 2023, Home Federal Bank had no advances from the Federal Home Loan Bank and $212.2 million available on its credit line with the Federal Home Loan Bank.\nAs a member, Home Federal Bank is required to purchase and maintain stock in the Federal Home Loan Bank of Dallas. At June 30, 2023, Home Federal Bank had $1.3 million in Federal Home Loan Bank stock, which was in compliance with the applicable requirement.\nThe Federal Home Loan Banks are required to provide funds for the resolution of troubled savings institutions and to contribute to affordable housing programs through direct loans or interest subsidies on advances targeted for community investment and low- and moderate-income housing projects. These contributions have adversely affected the level of Federal Home Loan Bank dividends paid in the past and could do so in the future. These contributions also could have an adverse effect on the value of Federal Home Loan Bank stock in the future.\nFederal Reserve System. The Federal Reserve Board requires all depository institutions to maintain reserves against their transaction accounts (primarily NOW and Super NOW checking accounts) and non-personal time deposits. In response to the COVID-19 pandemic, the Federal Reserve reduced reserve requirement ratios to zero percent effective May 26, 2020 to support lending to households and businesses The required reserves must be maintained in the form of vault cash or an account at a Federal Reserve Bank. At June 30, 2023, Home Federal Bank was not required to maintain any reserve balances.\nTAXATION\nFederal Taxation\nGeneral. Home Federal Bancorp and Home Federal Bank are subject to federal income taxation in the same general manner as other corporations with some exceptions listed below. The following discussion of federal and state income taxation is only intended to summarize certain pertinent income tax matters and is not a comprehensive description of the applicable tax rules. Home Federal Banks tax returns have not been audited during the past five years.\nMethod of Accounting. For federal income tax purposes, Home Federal Bank reports income and expenses on the accrual method of accounting and used a June 30 tax year in 2023 for filing its federal income tax return.\nBad Debt Reserves. The Small Business Job Protection Act of 1996 eliminated the use of the reserve method of accounting for bad debt reserves by savings associations, effective for taxable years beginning after 1995. Prior to that time, Home Federal Bank was permitted to establish a reserve for bad debts and to make additions to the reserve. These additions could, within specified formula limits, be deducted in arriving at taxable income. In addition, federal legislation required the recapture over a six year period of the excess of tax bad debt reserves at December 31, 1995 over those established as of December 31, 1987.\nTaxable Distributions and Recapture. Prior to the Small Business Job Protection Act of 1996, bad debt reserves created prior to January 1, 1988 were subject to recapture into taxable income if Home Federal Bank failed to meet certain thrift asset and definitional tests. New federal legislation eliminated these savings association related recapture rules. However, under current law, pre-1988 reserves remain subject to recapture should Home Federal Bank make certain non-dividend distributions or cease to maintain a bank charter.\nAt June 30, 2023, the total federal pre-1988 reserve was approximately $3.3 million. The reserve reflects the cumulative effects of federal tax deductions by Home Federal Bank for which no federal income tax provisions have been made.\nCorporate Dividends-Received Deduction. Home Federal Bancorp may exclude from its income 100% of dividends received from Home Federal Bank as a member of the same affiliated group of corporations. The corporate dividends received deduction is 65% in the case of dividends received from corporations which a corporate recipient owns less than 80% but at least 20% of the distribution corporation. Corporations which own less than 20% of the stock of a corporation distributing a dividend may deduct only 50 % of dividends received.\nState and Local Taxation\nHome Federal Bancorp is subject to the Louisiana Corporation Income Tax based on our Louisiana taxable income. The Corporation Income Tax applies at graduated rates from 4% upon the first $25,000 of Louisiana taxable income to 8% on all Louisiana taxable income in excess of $200,000. For these purposes, Louisiana taxable income means net income which is earned by us within or derived from sources within the State of Louisiana, after adjustments permitted under Louisiana law, including a federal income tax deduction. In addition, Home Federal Bank is subject to the Louisiana Shares Tax which is imposed on the assessed value of a companys stock. The formula for deriving the assessed value is to calculate 15% of the sum of:\n(a)\n20% of our capitalized earnings, plus\n(b)\n80% of our taxable stockholders equity, minus\n(c)\n50% of our real and personal property assessment.\nVarious items may also be subtracted in calculating a companys capitalized earnings. Item 1A. Risk Factors\nNot applicable. Item 1B. Unresolved Staff Comments\nNot applicable. Item 2. Properties\nWe currently conduct business from six full-service banking offices located in Shreveport, Louisiana, two full-service banking offices located in Bossier City, Louisiana, one full-service banking office located in Minden, Louisiana and one full-service banking office located in Benton, Louisiana. The following table sets forth certain information, as of June 30, 2023, relating to Home Federal Banks offices, one property acquired for a future branch office and one property acquired for potential future administrative offices which is presently vacant.\nDescription/Address\nLeased/Owned\nNet Book\nValue\nof Property\nAmount of\nDeposits\n(Dollars in thousands)\nBuilding (Home Office)\n222 Florida Street, Shreveport, LA\nOwned\n$\n1,713\n$\n--\nBuilding/ATM (Market Street Branch)\n624 Market Street, Shreveport, LA\nOwned\n81,216\nBuilding/ATM (Youree Drive Branch)\n6363 Youree Drive, Shreveport, LA\nOwned\n(1)\n157,945\nBuilding/ATM (Southern Hills Branch)\n9449 Mansfield Road, Shreveport, LA\nOwned\n1,852\n68,019\nBuilding/ATM (Viking Drive Branch)\n2555 Viking Drive, Bossier City, LA\nOwned\n1,657\n52,533\nBuilding/ATM (Stockwell Branch)\n7964 E. Texas Street, Bossier City, LA\nOwned\n1,526\n43,443\nBuilding/ATM (Northwood Branch)\n5841 North Market Street, Shreveport, LA\nOwned\n1,498\n26,838\nBuilding/ATM (Pierremont Road Branch)\n925 Pierremont Road, Shreveport, LA\nOwned\n2,064\n66,378\nBuilding (2)\n614 Market Street, Shreveport, LA\nOwned\n(2)\n--\nBuilding/ATM (Huntington Branch)\n6903 Pines Road, Shreveport, LA\nOwned\n1,908\n9,831\nBuilding/ATM (Minden Branch)\n306 Homer Road, Minden, LA\nLeased\n(3)\n20,926\nBuilding/ATM (Benton Branch)\n104 Sibley Street, Benton, LA\nOwned\n$\n$\n70,232\n(1)\nThe building is owned but the land is subject to an operating lease with a ten-year term expiring March 15, 2028.\n(2)\nThe building is vacant and available to serve as potential future administrative offices and storage.\n(3)\nThe building is subject to an operating lease with a five year term expiring August 21, 2026. Item 3. Legal Proceedings\nHome Federal Bancorp and Home Federal Bank are not involved in any pending legal proceedings other than nonmaterial legal proceedings occurring in the ordinary course of business. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\n(a)\nHome Federal Bancorps common stock is traded on the Nasdaq Capital Market under the symbol HFBL. At September 19, 2023, Home Federal Bancorp had [183] shareholders of record. The number of shareholders does not reflect the number of persons or entities who may hold stock in nominee or street name through brokerage firms or others.\n(b)\nNot applicable.\n(c)\nPurchases of Equity Securities.\nThe Company did not repurchase any of its common stock during the quarter ended June 30, 2023 including stock -for-stock option exercises:\nPeriod\nTotal Number\nof Shares\nPurchased\nAverage\nPrice\nPaid per\nShare\nTotal Number of\nShares Purchased\nas Part of Publicly\nAnnounced Plans\nor Programs\nMaximum\nNumber of Shares\nthat May Yet Be\nPurchased Under\nthe Plans or\nPrograms (a)\nApril 1, 2023 - April 30, 2023\n--\n$\n--\n--\n--\nMay 1, 2023 - May 31, 2023\n--\n--\n--\n--\nJune 1, 2023 - June 30, 2023\n--\n--\n--\n--\nTotal\n--\n$\n--\n--\n-- Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nGeneral\nOur profitability depends primarily on our net interest income, which is the difference between interest and dividend income on interest-earning assets, principally loans, investment securities, and interest-earning deposits in other institutions, and interest expense on interest-bearing deposits and borrowings from the Federal Home Loan Bank of Dallas. Net interest income is dependent upon the level of interest rates and the extent to which such rates are changing. Our profitability also depends, to a lesser extent, on non-interest income, provision for loan losses, non-interest expenses, and federal income taxes. Home Federal Bancorp, Inc. of Louisiana had net income of $5.7 million in fiscal 2023 compared to net income of $4.9 million in fiscal 2022.\nOur business consists primarily of originating single-family real estate loans secured by property in our market area and to a lesser extent, commercial real estate loans, commercial business loans, and real estate secured lines of credit which typically have higher rates and shorter terms than single-family loans. Although our loans are primarily funded by the acquisition of deposits and it is our policy to require commercial customers to have a deposit relationship with us, which primarily consists of NOW accounts or non-interest checking accounts. Due to the continued low interest rate environment, we have sold a substantial amount of our fixed rate single-family residential loan originations in recent periods. Because of an increase in our average rate on our interest-bearing assets, partially offset by an increase in our rate on total interest bearing liabilities, our net interest margin increased from 3.27% to 3.73% during fiscal 2023 compared to 2022, and our net interest income increased $4.2 million to $21.6 million for fiscal 2023 as compared to $17.4 million for fiscal 2022. We expect to continue to emphasize commercial lending in the future in order to improve the yield on our portfolio.\nHome Federal Bancorps operations and profitability are subject to changes in interest rates, applicable statutes and regulations, and general economic conditions, as well as other factors beyond our control.\nBusiness Strategy\nOur business strategy is focused on operating a growing and profitable community-oriented financial institution. Our current business strategy includes:\n●\nContinuing to Grow and Diversify Our Loan Portfolio. We intend to grow and continue to diversify our loan portfolio by, among other things, emphasizing the origination of commercial real estate and business loans. At June 30, 2023, our commercial real estate loans amounted to $148.4 million, or 30.0% of the total loan portfolio. Our commercial business loans amounted to $55.4 million, or 11.2% of the total loan portfolio. Commercial real estate, commercial business, construction and development, and consumer loans all typically have higher yields and are more interest sensitive than long-term single-family residential mortgage loans.\n●\nDiversify Our Products and Services. We intend to continue to emphasize our commercial business products to provide a full-service banking relationship to our commercial customers. We have introduced mobile and Internet banking and remote deposit capture, to better serve our commercial clients. Additionally, we have developed new deposit products focused on expanding our deposit base to new types of customers.\n●\nManaging Our Expenses. We have incurred significant additional expenses related to personnel and infrastructure in recent periods as we implemented our business strategy. The $1.5 million increase in non-interest expense for the year ended June 30, 2023, compared to the year ended June 30, 2022, is primarily attributable to increases of $875,000 in professional fees which were primarily due to FNBB acquisition costs. Our efficiency ratio, non-interest expense divided by net interest income plus non-interest income, for 2023 was 67.71% compared to 69.59% for fiscal 2022.\n●\nEnhancing Core Earnings. We expect to continue to emphasize commercial real estate and business loans, which generally bear interest rates higher than residential real estate loans, and sell a substantial part of our fixed rate residential mortgage loan originations.\n●\nExpanding Our Franchise in our Market Area and Contiguous Communities. We intend to continue to pursue opportunities to expand our market area by opening additional de novo banking offices and possibly through acquisitions of other financial institutions and banking related businesses. We expect to focus on contiguous areas to our current locations in Caddo, Bossier and Webster Parishes. In February 2023, we completed our acquisition of Northwest Bancshares Corporation and its wholly owned subsidiary, First National Bank of Benton, with one full-service branch location in Benton, Louisiana.\n●\nMaintain Our Asset Quality. At June 30, 2023, our non-performing assets totaled $1.6 million, or 0.26% of total assets. We had $368,000 in other real estate owned at June 30, 2023. We intend to continue to stress maintaining high asset quality, even as we continue to grow our institution and diversify our loan portfolio.\n●\nCross-Selling Products and Services and Emphasizing Local Decision Making. We have promoted cross-selling products and services in our branch offices and emphasized our local decision making and streamlined loan approval process.\nCritical Accounting Policies\nIn reviewing and understanding financial information for Home Federal Bancorp, you are encouraged to read and understand the significant accounting policies used in preparing our consolidated financial statements. These policies are described in Note 1 of the notes to our consolidated financial statements included in Item 8 of this document. Our accounting and financial reporting policies conform to accounting principles generally accepted in the United States of America and to general practices within the banking industry. Accordingly, the consolidated financial statements require certain estimates, judgments, and assumptions, which are believed to be reasonable based upon the information available. These estimates and assumptions affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of income and expenses during the periods presented. The following accounting policies comprise those that management believes are the most critical to aid in fully understanding and evaluating our reported financial results. These policies require numerous estimates or economic assumptions that may prove inaccurate or may be subject to variations which may significantly affect our reported results and financial condition for the period or in future periods.\nAllowance for Loan Losses. We have identified the evaluation of the allowance for loan losses as a critical accounting policy and a critical accounting estimate where amounts are sensitive to material variation. The allowance for loan losses represents managements estimate for probable losses that are inherent in our loan portfolio but which have not yet been realized as of the date of our consolidated balance sheet. It is established through a provision for loan losses charged to earnings. Loans are charged against the allowance for loan losses when management believes that the collectibility of the principal is unlikely. Subsequent recoveries are added to the allowance. The allowance is an amount that management believes will cover known and inherent losses in the loan portfolio based on evaluations of the collectibility of loans. The evaluations take into consideration such factors as changes in the types and amount of loans in the loan portfolio, historical loss experience, adverse situations that may affect the borrowers ability to repay, estimated value of any underlying collateral, estimated losses relating to specifically identified loans, and current economic conditions. This evaluation is inherently subjective as it requires material estimates including, among others, exposure at default, the amount and timing of expected future cash flows on impacted loans, value of collateral, estimated losses on our commercial and residential loan portfolios, and general amounts for historical loss experience. All of these estimates may be susceptible to significant changes as more information becomes available.\nWhile management uses the best information available to make loan loss allowance evaluations, adjustments to the allowance may be necessary based on changes in economic and other conditions or changes in accounting guidance. Historically, our estimates of the allowance for loan loss have not required significant adjustments from managements initial estimates. In addition, the Office of the Comptroller of the Currency as an integral part of their examination processes periodically reviews our allowance for loan losses. The Office of the Comptroller of the Currency may require the recognition of adjustments to the allowance for loan losses based on their judgment of information available to them at the time of their examinations. To the extent that actual outcomes differ from managements estimates, additional provisions to the allowance for loan losses may be required that would adversely impact earnings in future periods.\nThe allowance for loan losses is comprised of (i) specific reserves determined in accordance with current authoritative accounting guidance based on probable specific losses (ii) general reserve determined in accordance with current authoritative accounting guidance that consider historical loss experience, and (iii) qualitative reserves determined in accordance with current authoritative accounting guidance based upon qualitive factors, which include: 1) changes in lending policies, procedures, and practices; 2) changes in national and local economic trends and conditions; 3) changes in the nature and volume of the portfolio; 4) changes in the experience, ability, and depth of lending management and staff; 5) changes in the volume and loss severity of past due loans, the volume of non-accrual loans, and the volume and loss severity of adversely classified or graded loans; 6) changes in the quality of the Companys loan review system; 7) changes in the value of underlying collateral for collateral-dependent loans; 8) the existence and effect of any concentrations of credit, and changes in the level of such concentrations.\nBusiness Combinations\nAcquisition Accounting. Acquisitions are accounted for under the acquisition method of accounting. The acquisition method of accounting requires the Company as the acquirer to recognize the fair value of assets acquired and liabilities assumed at the acquisition date, as well as recognize goodwill. If the purchase price over the sum of the estimated fair values of the tangible and identifiable intangible assets acquired less the estimated fair value of the liabilities assumed in an acquisition, goodwill is recognized. The Company records provisional amounts of fair value at the time of acquisition. The provisional fair values are subject to modification for up to one year after the acquisition.\nAcquired Loans. Purchased loans acquired are recorded at their fair value. Discounts are included in the determination of the fair value. As such, an allowance for loan loss is not recorded at the acquisition date. Acquired loans are evaluated at acquisition and classified as either purchased credit impaired or purchased performing loans. Purchased credit impaired loans reflect credit deterioration since origination and as such at the date of acquisition the Company will not be able to collect all contractually required payments. The Company accounts for acquired impaired loans in accordance with ASC 310-30, Loans and Debt Securities Acquired with Deteriorated Credit Quality (ASC 310-30). Purchased credit impaired loans are accounted for individually. The Company estimates the amount and timing of undiscounted expected cash flows for each loan. The excess of the cash flows expected to be collected over a loans carrying value is considered to be the accretable yield, which is recognized as interest income over the estimated life of the loan. The excess of the undiscounted contractual balances due over the cash flows expected to be collected is considered to be the nonaccretable difference. Over the life of the loan, expected cash flows continue to be estimated. If the expected cash flows decrease, a provision for loan loss is recorded.\nIf the expected cash flows increase, it is recognized as part of future income. Purchased performing loans are accounted for under ASC 310-20, Nonrefundable Fees and Other Costs (ASC 310-20), with the related discount or premium being recognized as an adjustment to yield over the life of the loan.\nGoodwill. Goodwill represents the excess of the purchase price over the fair value of the net identifiable assets acquired. Goodwill has an indefinite useful life and is evaluated for impairment annually, or more frequently if events and circumstances indicate that the asset might be impaired.\nCore Deposit Intangible. Core deposit intangibles represent the estimated value of long-term deposit relationships acquired in business combinations. The Companys policy is to amortize these intangibles on a straight-line basis over their estimated useful life, which the estimated useful lives are periodically reviewed for reasonableness. Core deposit intangibles are tested for impairment if events and circumstances indicate the carrying amount of the asset may not be recoverable from future cash flows.\nSelected Financial and Other Data\nSet forth below is selected consolidated financial and other data of Home Federal Bancorp. The information at or for the years ended June 30, 2023 and 2022 is derived in part from the audited financial statements that appear in this Form 10-K.\nAt June 30,\n(In thousands)\nSelected Financial and Other Data:\nTotal assets\n$\n660,915\n$\n590,480\nCash and cash equivalents\n24,765\n64,078\nSecurities available for sale\n39,551\n28,099\nSecurities held to maturity\n74,423\n79,950\nLoans held-for-sale\n3,978\nLoans receivable, net\n489,493\n387,873\nDeposits\n597,361\n531,991\nFederal Home Loan Bank advances\n--\nOther Borrowings\n8,550\n2,350\nTotal Stockholders equity\n50,542\n52,347\nAs of or for the Year\nEnded June 30,\n(Dollars in thousands, except per share amounts)\nSelected Operating Data:\nTotal interest income\n$\n26,631\n$\n19,234\nTotal interest expense\n5,079\n1,877\nNet interest income\n21,552\n17,357\nProvision for loan losses\nNet interest income after provision for loan losses\n20,684\n17,021\nTotal non-interest income\n2,099\n3,476\nTotal non-interest expense\n16,013\n14,497\nIncome before income tax expense\n6,770\n6,000\nIncome tax expense\n1,066\n1,127\nNet income\n$\n5,704\n$\n4,873\nEarnings per share of common stock:\nBasic\n$\n1.89\n$\n1.50\nDiluted\n$\n1.8 1\n$\n1.41\nAs of or for the Year\nEnded June 30,\nSelected Operating Ratios(1):\nAverage yield on interest-earning assets\n4.61\n%\n3.62\n%\nAverage rate on interest-bearing liabilities\n1.24\n0.51\nAverage interest rate spread(2)\n3.37\n3.11\nNet interest margin(2)\n3.73\n3.27\nAverage interest-earning assets to average interest-bearing liabilities\n141.05\n143.32\nNet interest income after provision for loan losses to non-interest expense\n129.17\n117.41\nTotal non-interest expense to average assets\n2.59\n2.54\nEfficiency ratio(3)\n67 .71\n69.59\nReturn on average assets\n0.92\n0.85\nReturn on average equity\n11.57\n9.24\nAverage equity to average assets\n7.98\n9.22\nDividend payout ratio\n27.00\n28.37\nSelected Financial and Other Data (Continued)\nSelected Quality Ratios(4):\nNon-performing loans as a percent of loans receivable, net\n0.25\n%\n0.56\n%\nNon-performing assets as a percent of total assets\n0.24\n0.37\nAllowance for loan losses as a percent of total loans receivable\n1.05\n1.13\nNet charge-offs to average loans receivable\n0.03\n0.00\nAllowance for loan losses as a percent of non-performing loans\n417.85\n174.96\nBank Capital Ratios(4):\nTangible capital ratio\n8.69\n%\n9.65\n%\nCore capital ratio\n8.69\n9.65\nTotal capital ratio\n13.95\n15.62\nOther Data:\nOffices (branch and home)\nEmployees (full-time)\n(1)\nWith the exception of end of period ratios, all ratios are based on average monthly balances during the indicated periods.\n(2)\nAverage interest rate spread represents the difference between the average yield on interest-earning assets and the average rate paid on interest-bearing liabilities, and net interest margin represents net interest income as a percentage of average interest-earning assets.\n(3)\nNon-GAAP: The efficiency ratio represents the ratio of non-interest expense divided by the sum of net interest income and non-interest income.\n(4)\nAsset quality ratios and capital ratios are end of period ratios, except for net charge-offs to average loans receivable.\nChanges in Financial Condition\nAt June 30, 2023, the Company reported total assets of $660.9 million, an increase of $70.4 million, or 11.9%, compared to total assets of $590.5 million at June 30, 2022. The increase in assets was comprised primarily of increases in loans receivable, net of $101.6 million, or 26.2%, from $387.9 million at June 30, 2022 to $489.5 million at June 30, 2023, investment securities of $5.9 million, or 5.5%, from $108.0 million at June 30, 2022 to $114.0 million at June 30, 2023, goodwill of $3.0 million from none at June 30, 2022 to $3.0 million at June 30, 2023, core deposit intangible of $1.5 million from none at June 30, 2022 to $1.5 million at June 30, 2023, accrued interest receivable of $665,000, or 59.2%, from $1.1 million at June 30, 2022 to $1.8 million at June 30, 2023, real estate owned of $368,000 from none at June 30, 2022 to $368,000 at June 30, 2023, premises and equipment of $313,000, or 1.9%, from $16.2 million at June 30, 2022 to $16.6 million at June 30, 2023, deferred tax assets of $170,000, or 14.9%, from $1.1 million at June 30, 2022 to $1.3 million at June 30, 2023, bank owned life insurance Of $103,000, or 1.6%, from $6.6 million at June 30,2022 to $6.7 million at June 30,2023, and other assets of $34,000, or 2.5%, from $1.3 million at June 30,2022 to $1.4 million at June 30,2023.. These increases were partially offset by decreases in cash and cash equivalents of $39.3 million, or 61.4%, from $64.1 million at June 30, 2022 to $24.8 million at June 30, 2023, loans held-for-sale of $4.0 million, or 99.7%, from $4.0 million at June 30, 2022 to $4,000 at June 30, 2023.\nLoans receivable, net increased $101.6 million, or 26.2%, from $387.9 million at June 30, 2022 to $489.5 million at June 30, 2023. The increase in loans receivable, net was attributable primarily to increases related to the acquisition of $54.9 million in loans from First National Bank of Benton. With rising interest rates, management is reluctant to invest in long-term, fixed rate mortgage loans for the portfolio and instead sells the majority of the long-term, fixed rate mortgage loan production.\nIn recent periods we diversified the loan products we offer and increased our efforts to originate higher yielding commercial real estate loans and lines of credit and commercial business loans which were deemed attractive due to their generally higher yields and shorter anticipated lives compared to single-family residential mortgage loans. As of June 30, 2023, Home Federal Bank had $148.4 million of commercial real estate loans, 30.0% of the total loan portfolio, and $55.4 million of commercial business loans, 11.2% of the total loan portfolio. Although commercial loans are generally considered to have greater credit risk than other certain types of loans, we attempt to mitigate such risk by originating such loans in our market area to known borrowers.\nSecurities available-for-sale increased $11.5 million, or 40.8%, from $28.1 million at June 30, 2022 to $39.6 million at June 30, 2023. This increase resulted primarily from the acquisition of FNBB securities with balances of $10.0 million at June 30, 2023, purchases of $7.4 million in securities, partially offset by principal repayments of $4.7 million and a decrease in market values of securities of $1.3 million.\nSecurities held-to-maturity decreased $5.5 million, from $79.9 million at June 30, 2022 to $74.4 million at June 30, 2023. This decrease was primarily due to principal repayments of $6.5 million offset by purchases of $1.0 million in FHLB stock.\nCash and cash equivalents decreased $39.3 million, or 61.4%, from $64.1 million at June 30, 2022 to $24.8 million at June 30, 2023. The decrease in cash and cash equivalents was primarily due to the funding of additional loan growth and purchases of securities with excess liquidity.\nTotal liabilities increased $72.2 million, or 13.4%, from $538.1 million at June 30, 2022 to $610.4 million at June 30, 2023 primarily due to increases in total deposits of $65.4 million (deposits acquired in the acquisition of First National Bank of Benton totaled $77.4 million), or 12.3%, to $597.4 million at June 30, 2023 compared to $532.0 million at June 30, 2022, other borrowings of $6.2 million, or 263.8%, to $8.6 million at June 30, 2023 compared to $2.4 million at June 30, 2022, other accrued expenses and liabilities of $1.3 million, or 49.9%, to $3.9 million at June 30, 2023 compared to $2.6 million at June 30, 2022, and an increase in advances from borrowers for taxes and insurance of $200,000, or 56.5%, to $554,000 at June 30,2023 compared to $354,000 at June 30, 2022 partially offset by a decrease in advances from FHLB of $832,000, or 100.0%, to none at June 30,2023 compared to $832,000 at June 30, 2022. The increase in deposits was primarily due to a $110.1 million, or 137.1%, increase in certificates of deposit from $80.3 million at June 30, 2022 to $190.4 million at June 30, 2023, a $15.6 million, or 15.8%, increase in money market deposits from $98.6 million at June 30, 2022 to $114.2 million at June 30, 2023,and a $6.4 million, or 10.8%, increase in NOW accounts from $59.0 million at June 30, 2022 to $65.3 million at June 30, 2023, partially offset by a decrease of $51.1 million, or 38.4%, in savings deposits from $133.0 million at June 30, 2022 to $81.9 million at June 30, 2023, and a decrease of $15.6 million, or 9.7%, in non-interest deposits from $161.4 million at June 30, 2022 to $145.6 million at June 30, 2023. The Company had $3.0 million in brokered deposits at June 30, 2023 compared to $6.0 million at June 30, 2022. The decrease in advances from the Federal Home Loan Bank was primarily due to principal paydowns on amortizing advances.\nStockholders equity decreased $1.8 million, or 3.4%, to $50.5 million at June 30, 2023 from $52.3 million at June 30, 2022. The primary reasons for the changes in stockholders equity from June 30, 2022 were the repurchase of Company stock of $6.0 million, dividends paid totaling $1.5 million, and a decrease in the Companys accumulated other comprehensive income of $1.0 million, partially offset by net income of $5.7 million, the vesting of restricted stock awards, stock options, and the release of employee stock ownership plan shares totaling $620,000, and the proceeds from the issuance of common stock from the exercise of stock options of $328,000.\nAverage Balances, Net Interest Income Yields Earned and Rates Paid. The following table shows for the periods indicated the total dollar amount of interest from average interest-earning assets and the resulting yields, as well as the interest expense on average interest-bearing liabilities, expressed both in dollars and rates, and the net interest margin. Tax-exempt income and yields have not been adjusted to a tax-equivalent basis. All average balances are based on monthly balances. Management does not believe that the monthly averages differ significantly from what the daily averages would be.\nJune 30,\nAverage\nAverage\nAverage\nYield/\nAverage\nYield/\nBalance\nInterest\nRate\nBalance\nInterest\nRate\n(Dollars in thousands)\nInterest-earning assets:\nLoans receivable(1)\n$\n442,469\n$\n23,452\n5.30\n%\n$\n360,774\n$\n17,501\n4.85\n%\nInvestment securities\n113,332\n2,205\n1.95\n98,229\n1,509\n1.53\nInterest-earning deposits\n22,001\n4.43\n72,189\n0.32\nTotal interest-earning assets\n577,802\n26,631\n4.61\n%\n531,192\n19,234\n3.62\n%\nNon-interest-earning assets\n40,255\n40,426\nTotal assets\n$\n618,057\n$\n571,618\nInterest-bearing liabilities:\nSavings accounts\n105,850\n0.29\n%\n136,139\n0.29\n%\nNOW accounts\n63,074\n0.26\n51,412\n0.11\nMoney market accounts\n106,146\n1,078\n1.02\n91,862\n0.12\nCertificates of deposit accounts\n126,156\n2,952\n2.34\n88,450\n1,212\n1.37\nTotal interest-bearing deposits\n401,226\n4,506\n1.12\n367,863\n1,770\n0.48\nFHLB advances\n1,623\n4.87\n4.83\nOther bank borrowings\n6,784\n7.28\n1,921\n3.44\nTotal interest-bearing liabilities\n409,633\n5,079\n1.24\n%\n370,632\n1,877\n0.51\n%\nNon-interest-bearing liabilities:\nNon-interest-bearing demand accounts\n155,885\n145,522\nOther liabilities\n3,224\n2,741\nTotal liabilities\n568,742\n518,895\nTotal stockholders equity(2)\n49,315\n52,723\nTotal liabilities and equity\n$\n618,057\n$\n571,618\nNet interest-earning assets\n$\n168,169\n$\n160,560\nNet interest income; average interest rate spread(3)\n$\n21,552\n3.37\n%\n$\n17,357\n3.11\n%\nNet interest margin(4)\n3.73\n%\n3.27\n%\nAverage interest-earning assets to average interest-bearing liabilities\n141.05\n%\n143.32\n%\n(1)\nIncludes loans held for sale.\n(2)\nIncludes retained earnings and accumulated other comprehensive loss.\n(3)\nInterest rate spread represents the difference between the weighted-average yield on interest-earning assets and the weighted-average rate on interest-bearing liabilities.\n(4)\nNet interest margin is net interest income divided by net average interest-earning assets.\nRate/Volume Analysis. The following table describes the extent to which changes in interest rates and changes in volume of interest-related assets and liabilities have affected Home Federal Bancorps interest income and interest expense during the periods indicated. For each category of interest-earning assets and interest-bearing liabilities, information is provided on changes attributable to (i) changes in volume (change in volume multiplied by prior year rate), (ii) changes in rate (change in rate multiplied by current year volume), and (iii) total change in rate and volume. The combined effect of changes in both rate and volume has been allocated proportionately to the change due to rate and the change due to volume.\n2023 vs. 2022\n2022 vs. 2021\nIncrease (Decrease)\nTotal\nIncrease (Decrease)\nTotal\nDue to\nIncrease\nDue to\nIncrease\nRate\nVolume\n(Decrease)\nRate\nVolume\n(Decrease)\n(In thousands)\nInterest income:\nInvestment securities\n$\n$\n$\n$\n(327\n)\n$\n$\nLoans receivable, net\n1,988\n3,963\n5,951\n(1,114\n)\n(298\n)\n(1,412\n)\nInterest-earning deposits\n(156\n)\n(9\n)\nTotal interest-earning assets\n3,358\n4,039\n7,397\n(1,312\n)\n(1,011\n)\nInterest expense:\nSavings accounts\n(88\n)\n(81\n)\n(315\n)\n(172\n)\nNOW accounts\n(48\n)\n(34\n)\nMoney market accounts\n(148\n)\n(107\n)\nCertificate accounts\n1,223\n1,740\n(271\n)\n(841\n)\n(1,112\n)\nTotal deposits\n2,278\n2,736\n(782\n)\n(643\n)\n(1,425\n)\nFHLB advances and other borrowings\n(5\n)\n(2\n)\nTotal interest-bearing liabilities\n2,539\n3,202\n(779\n)\n(648\n)\n(1,427\n)\nIncrease (Decrease) in net interest income\n$\n$\n3,376\n$\n4,195\n$\n(533\n)\n$\n$\nComparison of Operating Results for the Years Ended June 30, 2023 and 2022\nGeneral. The increase in net income for the year ended June 30, 2023 resulted primarily from a $4.2 million, or 24.2%, increase in net interest income, and a decrease of $61,000, or 5.4%, in provision for income taxes, partially offset by an increase of $1.5 million, or 10.5%, in non-interest expense, a decrease of $1.4 million, or 39.6%, in non-interest income, and an increase of $532,000, or 158.3% in provision for loan losses. The increase in the provision for loan losses is mainly due to growth in the overall loan portfolio. The increase in net interest income was primarily due to a $7.4 million, or 38.5%, increase in total interest income, partially offset by a $3.2 million, or 170.6%, increase in total interest expense. The Companys average interest rate spread was 3.37% for the year ended June 30, 2023 compared to 3.11% for the year ended June 30, 2022. The Companys net interest margin was 3.73% for the year ended June 30, 2023 compared to 3.27% for the year ended June 30, 2022.\nNet Interest Income. Net interest income amounted to $21.6 million for fiscal year 2023, an increase of $4.2 million, or 24.2%, compared to $17.4 million for fiscal year 2022. The increase was due primarily to an increase of $7.4 million in total interest income, partially offset by a $3.2 million increase in total interest expense.\nThe average interest rate spread increased from 3.11% for fiscal 2022 to 3.37% for fiscal 2023, while the average balance of interest-earning assets increased from $531.2 million to $577.8 million during the same periods. The percentage of average interest-earning assets to average interest-bearing liabilities decreased to 141.05% for fiscal 2023 compared to 143.32% for fiscal 2022. The average rate paid on certificates of deposit increased from 1.37% for fiscal 2022 to 2.34% for fiscal 2023. Net interest margin increased to 3.73% for fiscal 2023 compared to 3.27% for fiscal 2022.\nInterest income increased $7.4 million, or 38.5%, to $26.6 million for fiscal 2023 compared to $19.2 million for fiscal 2022, primarily due to an increase in interest income from loans of $6.0 million, an increase in interest income on other earning assets of $750,000 and an increase of$696,000 in interest income from investment and mortgage-backed securities. The increase in the average balance of loans receivable was primarily due to new loans originated by our commercial lending division and loans acquired in the acquisition of First National Bank of Benton. The average yield of the loan portfolio increased by 57 basis points during fiscal 2023 mainly due to a higher interest rate environment.\nInterest expense increased $3.2 million, or 170.6%, to $5.1 million for fiscal 2023 compared to $1.9 million for fiscal 2022, primarily as a result of decreases in the average rate paid on interest-bearing deposits.\nProvision for Loan Losses. The allowance for loan losses is established through a provision for loan losses charged to earnings as losses are estimated to have occurred in our loan portfolio. Loan losses are charged against the allowance when management believes the collectability of a loan balance is confirmed. Subsequent recoveries, if any, are credited to the allowance.\nThe allowance for loan losses is evaluated on a regular basis by management and is based upon managements periodic review of the collectability of the loans in light of historical experience, the nature and volume of the loan portfolio, adverse situations that may affect the borrowers ability to repay, estimated value of the underlying collateral, and prevailing economic conditions. The evaluation is inherently subjective as it requires estimates that are susceptible to significant revision as more information becomes available.\nA loan is considered impaired when, based on current information or events, it is probable that we will be unable to collect the scheduled payments of principal and interest when due according to the contractual terms of the loan agreement. When a loan is impaired, the measurement of such impairment is based upon the fair value of the collateral of the loan. If the fair value of the collateral is less than the recorded investment in the loan, we will recognize the impairment by creating a valuation allowance with a corresponding charge against earnings.\nAn allowance is also established for uncollectible interest on loans classified as substandard. The allowance is established by a charge to interest income equal to all interest previously accrued, and income is subsequently recognized only to the extent that cash payments are received. When, in managements judgment, the borrowers ability to make interest and principal payments is back to normal, the loan is returned to accrual status.\nA provision of $868,000 was made to the allowance during fiscal 2023, compared to a provision of $336,000 in fiscal 2022. At June 30, 2023, the Company had $1.6 million of non-performing assets (defined as non-accruing loans, accruing loans 90 days or more past due, and other real estate owned) compared to $2.2 million of non-performing assets at June 30, 2022, consisting of seven single family residential loans two non-real estate commercial loans, one consumer loan, and two single-family residences at June 30, 2023, compared to seven single-family residential loans at June 30, 2022. The decrease in non-performing assets from $2.2 million at June 30, 2022 to $1.7 million at June 30, 2023 was primarily due to improved loan credit quality. At June 30, 2023, the Company had ten single family residential loans, three commercial non-real-estate loans, two commercial real estate loans, and three home equity line-of-credit loans classified as substandard compared to five single family residential loans and two commercial real estate loans classified as substandard at June 30, 2022. There were no loans classified as doubtful at June 30, 2023 or 2022.\nNon-Interest Income. Non-interest income amounted to $2.1 million for the year ended June 30, 2023, a decrease of $1.4 million, or 39.6%, compared to non-interest income of $3.5 million for the year ended June 30, 2022. The $1.4 million decrease in non-interest income for the year ended June 30, 2023 compared to the prior year period was primarily due to a decrease of $1.5 million in gain on sale of loans, a $232,000 decrease in other non-interest income, and a $10,000 decrease in income from bank owned life insurance, partially offset by an increase of $329,000 in service charges on deposit accounts, and a $52,000 decrease in loss on sale of fixed assets and real estate owned . The decrease in gain on sale of loans for the year ended June 30, 2023 was primarily due to a decrease in refinance activity causing a decrease in mortgage loan originations. The Company sells most of its long-term fixed rate residential mortgage loan originations primarily in order to manage interest rate risk.\nNon-Interest Expense. Non-interest expense increased $1.5 million, or 10.5%, in fiscal 2023 compared to the prior year period. The $1.5 million increase in non-interest expense for the year ended June 30, 2023, compared to the prior year period, is primarily attributable to increases of $875,000 in professional fees which were primarily due to FNBB acquisition costs, $267,000 in occupancy and equipment expense, $174,000 in amortization of core deposit intangible expense, $143,000 in deposit insurance premium expense, $69,000 in compensation and benefits expense, $22,000 in data processing expense, and $11,000 in advertising expense, partially offset by decreases of $22,000 in loan and collection expense, $14,000 in audit and examination fees, $5,000 in other non-interest income, and $4,000 in franchise and bank shares tax expense.\nProvision for Income Tax Expense. The provision for income taxes amounted to $1.1 million for both the fiscal years ended June 30, 2023 and 2022. Our effective tax rate was 15.7% for fiscal 2023 and 18.8% for fiscal 2022.\nExposure to Changes in Interest Rates\nOur ability to maintain net interest income depends upon our ability to earn a higher yield on interest-earning assets than the rates we pay on deposits and borrowings. Our interest-earning assets consist primarily of securities available-for-sale and long-term residential and commercial mortgage loans, which have fixed rates of interest. Consequently, our ability to maintain a positive spread between the interest earned on assets and the interest paid on deposits and borrowings can be adversely affected when market rates of interest rise.\nAlthough long-term, fixed-rate mortgage loans made up a significant portion of our interest-earning assets at June 30, 2023, we sold a substantial amount of our one-to-four family residential loans we originated and maintained a significant portfolio of available-for-sale securities during the past few years in order to better position the Company for a rising interest rate environment in the long term. At June 30, 2023 and 2022, securities available-for-sale amounted to $39.6 million and $28.1 million, respectively, or 6.04% and 4.8%, respectively, of total assets at such dates.\nQuantitative Analysis. The Office of the Comptroller of the Currency provides a quarterly report on the potential impact of interest rate changes upon the market value of portfolio equity. Management reviews the quarterly reports from the Office of the Comptroller of the Currency, which show the impact of changing interest rates on net portfolio value. Net portfolio value is the difference between incoming and outgoing discounted cash flows from assets, liabilities, and off-balance sheet contracts.\nNet Portfolio Value. Our interest rate sensitivity is monitored by management through the use of a model which internally generates estimates of the change in our net portfolio value (NPV) over a range of interest rate scenarios. NPV is the present value of expected cash flows from assets, liabilities, and off-balance sheet contracts. The NPV ratio, under any interest rate scenario, is defined as the NPV in that scenario divided by the market value of assets in the same scenario. The following table sets forth our NPV as of June 30, 2023:\nChange in Interest Rates in\nNet Portfolio Value\nNPV as % of Portfolio\nValue of Assets\nBasis Points (Rate Shock)\nAmount\n$ Change\n% Change\nNPV Ratio\nChange\n(Dollars in thousands)\n$\n67,744\n$\n(5,003\n)\n(6.37\n)%\n12.45\n%\n(0.71\n)%\n72,747\n(2,032\n)\n(2.59\n)\n12.94\n(0.22\n)\n74,779\n(3,714\n)\n(4.73\n)\n12.87\n(0.29\n)\nStatic\n78,493\n--\n--\n13.16\n--\n(100)\n87,788\n9,295\n11.84\n14.51\n1.35\n(200)\n92,848\n5,060\n6.45\n15.03\n1.87\nQualitative Analysis. Our ability to maintain a positive spread between the interest earned on assets and the interest paid on deposits and borrowings is affected by changes in interest rates. Our fixed-rate loans generally are profitable, if interest rates are stable or declining since these loans have yields that exceed our cost of funds. If interest rates increase, however, we would have to pay more on our deposits and new borrowings, which would adversely affect our interest rate spread. In order to counter the potential effects of dramatic increases in market rates of interest, we have underwritten our mortgage loans to allow for their sale in the secondary market. Total loan originations amounted to $244.0 million for fiscal 2023 and $339.6 million for fiscal 2022, while loans sold amounted to $24.9 million and $87.2 million during the same respective periods. We have invested excess funds from loan payments and prepayments and loan sales in investment securities classified as available-for-sale. As a result, Home Federal Bancorp is not as susceptible to rising interest rates as it would be if its interest-earning assets were primarily comprised of long-term fixed rate mortgage loans. With respect to its floating or adjustable rate loans, Home Federal Bancorp writes interest rate floors and caps into such loan documents. Interest rate floors limit our interest rate risk by limiting potential decreases in the interest yield on an adjustable rate loan to a certain level. As a result, we receive a minimum yield even if rates decline farther, and the interest rate on the particular loan would otherwise adjust to a lower amount. Conversely, interest rate ceilings limit the amount by which the yield on an adjustable rate loan may increase to no more than six percentage points over the rate at the time of origination. Finally, we intend to place a greater emphasis on shorter-term consumer loans and commercial business loans in the future.\nLiquidity and Capital Resources\nHome Federal Bancorp maintains levels of liquid assets deemed adequate by management. Our liquidity ratio averaged 21.42% for the quarter ended June 30, 2023. We adjust our liquidity levels to fund deposit outflows, repay our borrowings, and to fund loan commitments. We also adjust liquidity, as appropriate, to meet asset and liability management objectives.\nOur primary sources of funds are deposits, amortization and prepayment of loans and mortgage-backed securities, maturities of investment securities and other short-term investments, loan sales and earnings, and funds provided from operations. While scheduled principal repayments on loans and mortgage-backed securities are a relatively predictable source of funds, deposit flows and loan prepayments are greatly influenced by general interest rates, economic conditions, and competition. We set the interest rates on our deposits to maintain a desired level of total deposits. In addition, we invest excess funds in short-term interest-earning accounts and other assets, which provide liquidity to meet lending requirements. Our deposit accounts with the Federal Home Loan Bank of Dallas amounted to $5.0 million and $11.9 million at June 30, 2023 and 2022, respectively.\nA significant portion of our liquidity consists of securities classified as available-for-sale and cash and cash equivalents. Our primary sources of cash are net income, principal repayments on loans and mortgage-backed securities, and increases in deposit accounts. If we require funds beyond our ability to generate them internally, we have borrowing agreements with the Federal Home Loan Bank of Dallas, which provide an additional source of funds. At June 30, 2023, we had no advances from the Federal Home Loan Bank of Dallas and had $212.2 million in additional borrowing capacity. Additionally, at June 30, 2023, Home Federal Bank was a party to a Master Purchase Agreement with First National Bankers Bank, whereby Home Federal Bank may purchase Federal Funds from First National Bankers Bank in an amount not to exceed $20.4 million. There were no amounts purchased under this agreement as of June 30, 2023. In addition, Home Federal Bancorp had available an $10.0 million line of credit agreement at June 30, 2023 with First National Bankers Bank. At June 30, 2023 there was an $8.6 million balance in the credit line.\nAt June 30, 2023, the Company had outstanding loan commitments of $53.4 million to originate loans and commitments under unused lines of credit of $15.0 million. At June 30, 2023, certificates of deposit scheduled to mature in one year or less totaled $168.2 million, or 88.3% of total certificates of deposit. Based on prior experience, management believes that a significant portion of such deposits will remain with us, although there can be no assurance that this will be the case. In addition, the cost of such deposits could be significantly higher upon renewal in a rising interest rate environment. We intend to utilize our high levels of liquidity to fund our lending activities. If additional funds are required to fund lending activities, we intend to sell our securities classified as available-for-sale, as needed.\nAt June 30, 2023, Home Federal Bank exceeded each of its capital requirements with tangible equity, common equity Tier 1, core, and total risk-based capital ratios of 8.69%, 12.79%, 8.69%, and 13.95%, respectively.\nIn the first quarter of 2023, the Company will transition to CECL from the current incurred loss method and recognized a one-time, after-tax cumulative effect adjustment. The Company has been evaluating the impact. At this time, the Company estimates the allowance for credit losses will increase between 4% to 9%. The amount determined from adoption will be recognized as a cumulative effective to the July 1, 2023 retained earnings. Regulations of the federal banking agencies provide an optional CECL transition provision that allows a banking organization that experiences a reduction in retained earnings as of its CECL adoption date to elect to phase in the regulatory capital impact of that reduction over a three-year period. Under the regulations, the Company is required to begin the three-year transition in the first fiscal year it has adopted CECL, which for The Company is fiscal year 2024. As a result, the regulatory capital impact of The Company adoption of CECL is being phased in from July 1, 2023 through June 30, 2026.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements, as defined by Securities and Exchange Commission rules, and have not had any such arrangements during the two years ended June 30, 2023. See Notes 9 and 14 to the Notes to Consolidated Financial Statements contained in Item 8 of this Form 10-K.\nImpact of Inflation and Changing Prices\nThe consolidated financial statements and related financial data presented herein regarding Home Federal Bancorp have been prepared in accordance with accounting principles generally accepted in the United States of America, which generally require the measurement of financial position and operating results in terms of historical dollars, without considering changes in relative purchasing power over time due to inflation. Unlike most industrial companies, virtually all of our assets and liabilities are monetary in nature. As a result, interest rates generally have a more significant impact on Home Federal Bancorps performance than does the effect of inflation. Interest rates do not necessarily move in the same direction or in the same magnitude as the prices of goods and services, since such prices are affected by inflation to a larger extent than interest rates.\nForward-Looking Statements\nThis Annual Report on Form 10-K contains certain forward-looking statements (as defined in the Securities Exchange Act of 1934 and the regulations thereunder). Forward-looking statements are not historical facts but instead represent only the beliefs, expectations or opinions of Home Federal Bancorp and its management regarding future events, many of which, by their nature, are inherently uncertain. Forward-looking statements may be identified by the use of such words as: believe, expect, anticipate, intend, plan, estimate, or words of similar meaning, or future or conditional terms such as will, would, should, could, may, likely, probably, or possibly. Forward-looking statements include, but are not limited to, financial projections and estimates and their underlying assumptions; statements regarding plans, objectives and expectations with respect to future operations, products and services; and statements regarding future performance. Such statements are subject to certain risks, uncertainties and assumption, many of which are difficult to predict and generally are beyond the control of Home Federal Bancorp and its management, that could cause actual results to differ materially from those expressed in, or implied or projected by, forward-looking statements. The following factors, among others, could cause actual results to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: (1) economic and competitive conditions which could affect the volume of loan originations, deposit flows and real estate values; (2) the levels of non-interest income and expense and the amount of loan losses; (3) competitive pressure among depository institutions increasing significantly; (4) changes in the interest rate environment causing reduced interest margins; (5) general economic conditions, either nationally or in the markets in which Home Federal Bancorp is or will be doing business, being less favorable than expected (6) political and social unrest including acts of war or terrorism; or (7) legislation or changes in regulatory requirements adversely affecting the business in which Home Federal Bancorp will be engaged. Home Federal Bancorp undertakes no obligation to update these forward-looking statements to reflect events or circumstances that occur after the date on which such statements were made. Item 7A. Quantitative and Qualitative Disclosure About Market Risk\nNot applicable. Item 8. Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firm\nStockholders and the Board of Directors\nHome Federal Bancorp, Inc. of Louisiana\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Home Federal Bancorp, Inc. of Louisiana (the Company) as of June 30, 2023 and 2022 and the related consolidated statements of operations, comprehensive income, changes in stockholders equity, and cash flows for each of the years in the two-year period ended June 30, 2023 and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and 2022 and the results of its operations and its cash flows for each of the years in the two-year period ended June 30, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits.\nWe are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures include examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nAllowance for Loan Losses - Qualitative Factors\nAs described in Note 1 and Note 3 to the financial statements, the Companys allowance for loan losses is established as losses are estimated to have occurred through a provision for loan losses charged to earnings. The allowance for loan losses was $5.173 million at June 30, 2023, which is comprised of (i) specific reserves determined in accordance with current authoritative accounting guidance based on probable losses on specific loans (ii) general reserves determined in accordance with current authoritative accounting guidance that consider historical loss experience, and (iii) qualitative reserves. The qualitative reserve is based upon general economic conditions as well as other qualitative risk factors both internal and external to the Company and requires management to make judgments regarding the impact of qualitative factors on probable inherent losses.\nWe identified the allowance for loan losses as a critical audit matter. The principal considerations for that determination included the high degree of judgment and subjectivity relating to managements identification and measurement of the qualitative factors. This required a high degree of auditor effort and significant auditor judgment in evaluating the estimated allowance for loan losses.\nThe primary procedures we performed to address this critical audit matter included:\nWe obtained an understanding of the Companys process for establishing the allowance for loan losses, including the identification, basis for development and related adjustments of the qualitative factor components of the allowance for loan losses.\nWe performed substantive testing over managements qualitative factors by evaluating the relevancy and reliability of the underlying data used to derive the qualitative factors, including comparison to internal, external and/or peer data to ensure movement in a directionally consistent manner.\nBased on the underlying data and our evidence gathered, we evaluated the reasonableness of managements conclusion on the adjustment to the factors.\nWe tested the accuracy of the mathematical application of the qualitative factors to adjust the historical loss experience.\nAcquisition of Northwest Bancshares Corporation. - Fair Value of Acquired Loans and CDI\nAs described further in Note 1 and Note 22 to the financial statements, the Company completed the acquisition of Northwest Bancshares Corporation (NWB) on February 1, 2023. The Company accounted for this acquisition under the purchase method of accounting. Purchased assets and assumed liabilities are recorded at their respective acquisition date fair values, and identifiable intangible assets are recorded at fair value. Determination of the acquisition date fair value required management to make significant estimates and assumptions. The fair value of the acquired loans and CDI was $54.12 million and $1.41 million, respectively, as of February 1, 2023.\nWe identified the determination of the acquisition date fair value of acquired loans and the core deposit intangible (CDI) as a critical audit matter. The principal considerations for our determination included the high degree of judgment and subjectivity involved in auditing managements selection of assumptions used to determine fair value. This required a high degree of auditor effort, specialized skills and knowledge, and significant auditor judgment.\nOur primary audit procedures performed to address this critical audit matter included:\nWe obtained an understanding of the Companys process for determining the fair value of the acquired loan portfolio and the CDI resulting from the merger.\nWe evaluated the completeness and accuracy of data inputs used as a basis for the valuation of the loan portfolio and CDI.\nWe evaluated, with the assistance of professionals with the appropriate skills and knowledge, the reasonableness of managements assumptions used in:\no\nThe estimate of the fair value of the acquired loans, including, for a selected sample of loans, developing an independent expectation for comparison to managements fair value.\no\nThe estimate of the fair value of the CDI, including, reperformance.\nWe tested the mathematical accuracy of the estimated fair values, including the application of the assumptions used in the calculation.\n/s/ FORVIS, LLP\nWe have served as the Companys auditor since 2021.\nFort Worth, Texas\nOctober 2, 2023\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nConsolidated Balance Sheets\nJune 30, 2023 and 2022\nJune 30,\n(In Thousands)\nASSETS\nCash and Cash Equivalents (Includes Interest-Bearing Deposits with Other Banks of $22,215 and $42,531 June 30, 2023 and 2022, Respectively)\n$\n24,765\n$\n64,078\nSecurities Available-for-Sale\n39,551\n28,099\nSecurities Held-to-Maturity (fair value June 30, 2023: $61,222; June 30, 2022: $69,513, Respectively)\n74,423\n79,950\nLoans Held-for-Sale\n3,978\nLoans Receivable, Net of Allowance for Loan Losses (June 30, 2023: $5,173; June 30, 2022: $4,451, Respectively)\n489,493\n387,873\nAccrued Interest Receivable\n1,790\n1,124\nPremises and Equipment, Net\n16,561\n16,249\nBank Owned Life Insurance\n6,700\n6,597\nGoodwill\n2,990\n-\nCore Deposit Intangible\n1,533\n-\nDeferred Tax Asset\n1,313\n1,143\nReal Estate Owned\n-\nOther Assets\n1,424\n1,389\nTotal Assets\n$\n660,915\n$\n590,480\nLIABILITIES AND STOCKHOLDERS EQUITY\nLIABILITIES\nDeposits:\nNon-interest bearing\n$\n145,553\n$ 161,142\nInterest-bearing\n451,808\n370,849\nTotal Deposits\n597,361\n531,991\nAdvances from Borrowers for Taxes and Insurance\nShort-term Federal Home Loan Bank Advances\n-\nOther Borrowings\n8,550\n2,350\nOther Accrued Expenses and Liabilities\n3,908\n2,606\nTotal Liabilities\n610,373\n538,133\nSTOCKHOLDERS EQUITY\nPreferred Stock - $0.01 Par Value; 10,000,000 Shares Authorized; None Issued and Outstanding\n-\n-\nCommon Stock - $0.01 Par Value; 40,000,000 Shares Authorized: 3,133,351 and 3,387,839 Shares Issued\nand Outstanding at June 30, 2023 and 2022, Respectively\nAdditional Paid-in Capital\n40,981\n40,145\nUnearned ESOP Stock\n(523\n)\n(639 )\nRetained Earnings\n12,707\n14,506\nAccumulated Other Comprehensive Loss\n(2,654\n)\n(1,699 )\nTotal Stockholders Equity\n50,542\n52,347\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY\n$\n660,915\n$\n590,480\nThe accompanying notes are an integral part of these consolidated financial statements.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nConsolidated Statements of Operations\nFor the Years Ended June 30, 2023 and 2022\nFor the Years Ended June 30,\n(In Thousands, Except Per Share Data)\nINTEREST INCOME\nLoans, including fees\n$\n23,452\n$\n17,501\nInvestment securities\nMortgage-backed securities\n1,954\n1,505\nOther interest-earning assets\nTotal interest income\n26,631\n19,234\nINTEREST EXPENSE\nDeposits\n4,506\n1,770\nFederal Home Loan Bank borrowings\nOther bank borrowings\nTotal Interest Expense\n5,079\n1,877\nNet Interest Income\n21,552\n17,357\nPROVISION FOR LOAN LOSSES\nNet Interest Income After Provision For Loan Losses\n20,684\n17,021\nNON-INTEREST INCOME\nService charges on deposit accounts\n1,476\n1,147\nGain (loss) on sale of real estate and fixed assets\n(48\n)\nIncome on Bank-Owned Life Insurance\nGain on sale of loans\n1,982\nOther income\nTotal Non-Interest Income\n2,099\n3,476\nNON-INTEREST EXPENSE\nCompensation and benefits\n9,088\n9,019\nOccupancy and equipment\n2,080\n1,813\nData processing\nAudit and examination fees\nFranchise and bank shares tax\nAdvertising\nLegal fees\n1,233\nLoan and collection\nAmortization Core Deposit Intangible\n-\nDeposit insurance premium\nOther expenses\nTotal Non-Interest Expense\n16,013\n14,497\nIncome Before Income Taxes\n6,770\n6,000\nPROVISION FOR INCOME TAX EXPENSE\n1,066\n1,127\nNet Income\n$ 5,704\n$ 4,873\nEARNINGS PER SHARE\nBasic\n$\n1.89\n$\n1.50\nDiluted\n$\n1.81\n$\n1.41\nThe accompanying notes are an integral part of these consolidated financial statements.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nConsolidated Statements of Comprehensive Income\nFor the Years Ended June 30, 2023 and 2022\nFor the Years Ended June 30,\n(In Thousands)\nNet Income\n$ 5,704\n$ 4,873\nOther Comprehensive (Loss) Income, Net of Tax\nInvestment securities available-for-sale:\nNet unrealized (losses) gains\n(1,208\n)\n(2,500\n)\nIncome Tax Effect\nOther Comprehensive (Loss) Income\n(955\n)\n(1,974\n)\nTotal Comprehensive Income\n$\n4,749\n$\n2,899\nThe accompanying notes are an integral part of these consolidated financial statements.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nConsolidated Statements of Changes in Stockholders Equity\nFor the Years Ended June 30, 2023 and 2022\nCommon\nStock\nAdditional\nPaid-In\nCapital\nUnearned\nESOP\nStock\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nTotal\nStockholders\nEquity\n(In Thousands)\nBALANCE - June 30, 2021\n$\n$\n37,701\n$\n(754\n)\n$\n15,469\n$\n$\n52,725\nShare Awards Earned\n-\n-\n-\n-\nESOP Compensation Earned\n-\n-\n-\nStock Options Exercised\n-\n1,889\n-\n-\n-\n1,889\nDividends Paid\n-\n-\n-\n(1,353\n)\n-\n(1,353\n)\nStock Options Vested\n-\n-\n-\n-\nCompany Stock Purchased\n-\n-\n-\n(4,484\n)\n-\n(4,484\n)\nNet Income\n-\n-\n-\n4,873\n-\n4,873\nOther Comprehensive Loss, Unrealized Loss on Debt Securities, Net of Tax\n-\n-\n-\n-\n(1,974\n)\n(1,974\n)\nBALANCE - June 30, 2022\n$\n$\n40,145\n$\n(639\n)\n$\n14,506\n$\n(1,699\n)\n$\n52,347\nShare Awards Earned\n-\n-\n-\n-\nESOP Compensation Earned\n-\n-\n-\nStock Options Exercised\n(3\n)\n-\n-\n-\nDividends Paid\n-\n-\n-\n(1,540\n)\n-\n(1,540\n)\nStock Options Vested\n-\n-\n-\n-\nCompany Stock Purchased\n-\n-\n-\n(5,963\n)\n-\n(5,963\n)\nNet Income\n-\n-\n-\n5,704\n-\n5,704\nOther Comprehensive Income, Unrealized Gain on Debt Securities, Net of Tax\n-\n-\n-\n-\n(955\n)\n(955\n)\nBALANCE - June 30, 2023\n$\n$\n40,981\n$\n(523\n)\n$\n12,707\n$\n(2,654\n)\n$\n50,542\nThe accompanying notes are an integral part of these consolidated financial statements.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nConsolidated Statements of Cash Flows\nFor the Years Ended June 30, 2023 and 2022\nFor the Years Ended June 30,\n(In Thousands)\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet Income\n$ 5,704\n$ 4,873\nAdjustments to Reconcile Net Income to Net\nCash Provided By Operating Activities\nGain on Sale of Loans\n(466\n)\n(1,982\n)\nNet Amortization and Accretion on Securities\n(27\n)\nAmortization of Deferred Loan Fees\n(300\n)\n(805\n)\nProvision for Loan Losses\nDepreciation of Premises and Equipment\n(Gain) Loss on Sale of Real Estate and Fixed Assets\n(4\n)\nESOP Compensation Expense\nStock Option Expense\nDeferred Income Tax (Benefit) Expense\n(174\n)\n(324\n)\nFederal Home Loan Bank Stock Dividend\n(13\n)\n-\nShare Awards Expense\n(Increase) Decrease in Cash Surrender Value on Bank Owned Life Insurance\n(103\n)\nBad Debt Recovery\nChanges in Assets and Liabilities:\nOrigination and Purchase of Loans Held-for-Sale\n(24,865\n)\n(87,238\n)\nSale and Principal Repayments on Loans Held-for-Sale\n29,305\n99,669\nAccrued Interest Receivable\n(666\n)\nOther Operating Assets\n(35\n)\nOther Operating Liabilities\n1,302\n(111\n)\nNet Cash Provided By Operating Activities\n12,105\n17,059\nCASH FLOWS FROM INVESTING ACTIVITIES\nLoan Originations and Principal Collections, Net\n(97,033\n)\n(51,004\n)\nDeferred Loan Fees Collected\nAcquisition of Premises and Equipment\n(1,181\n)\n(2,574\n)\nNet Cash Paid in Acquisition\n(10,244 )\n-\nProceeds from Sale of Real Estate and Fixed Assets\nImprovements to Real Estate Owned Prior to Disposition\n(90\n)\n-\nActivity in Available-for-Sale Securities:\nPrincipal Payments\n9,737\n8,400\nPurchase of Municipals\n(1,075\n)\n-\nPurchase of Mortgage-Backed Securities\n(6,493 )\n(9,484 )\nPurchase of US Treasury Notes\n(14,611 )\n-\nActivity in Held-to-Maturity Securities:\nPurchase of Securities\n-\n(34,619\n)\nPurchases of FHLB Stock\n(989 )\n(15 )\nPrincipal Payments on Mortgage-Backed Securities\n6,510\n9,317\nSale/Redemptions of Securities\n-\n-\nNet Cash Used in Investing Activities\n(115,314\n)\n(78,793\n)\nThe accompanying notes are an integral part of these consolidated financial statements.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nConsolidated Statements of Cash Flows (Continued)\nFor the Years Ended June 30, 2023 and 2022\nFor the Years Ended June 30,\n(In Thousands)\nCASH FLOWS FROM FINANCING ACTIVITIES\nNet Increase in Deposits\n$\n65,370\n$\n25,395\nProceeds from Advances from Federal Home Loan Bank\n184,001\n-\nRepayments of Advances from Federal Home Loan Bank\n(184,833\n)\n(35\n)\nDividends Paid\n(1,530\n)\n(1,353\n)\nCompany Stock Purchased\n(5,963\n)\n(4,484\n)\nNet Increase (Decrease) in Advances from Borrowers for Taxes and Insurance\n(72\n)\nProceeds from Other Bank Borrowings\n6,200\n3,150\nRepayment of Other Bank Borrowings\n-\n(3,200\n)\nProceeds from Stock Options Exercised\n1,889\nRecognition and Retention Plan Share Distributions\nNet Cash Provided by Financing Activities\n63,896\n21,407\nNET (DECREASE) INCREASE IN CASH AND CASH EQUIVALENTS\n(39,313 )\n(40,327\n)\nCASH AND CASH EQUIVALENTS, BEGINNING OF YEAR\n64,078\n104,405\nCASH AND CASH EQUIVALENTS, END OF YEAR\n$\n24,765\n$\n64,078\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION\nInterest Paid on Deposits and Borrowed Funds\n5,079\n1,892\nIncome Taxes Paid\n1,115\nMarket Value Adjustment for Unrealized Gain on Debt Securities Available For Sale\n1,208\n2,500\nTransfer from Loans to Other Real Estate\n-\nAcquisitions:\nFair Value of Tangible Assets Acquired\n82,889\n-\nOther Intangible Assets Acquired\n1,510\n-\nLiabilities Assumed\n(77,145 )\n-\nNet Identifiable Assets Acquired Over Liabilities Assumed\n7,254\n-\nThe accompanying notes are an integral part of these consolidated financial statements.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 1.\nSummary of Significant Accounting Policies\nNature of Operations\nThe consolidated financial statements include the accounts of Home Federal Bancorp, Inc. of Louisiana, a Louisiana chartered corporation (the Company or Home Federal Bancorp) and its wholly owned subsidiary, Home Federal Bank, a federally chartered stock savings bank (the Bank), along with its wholly owned subsidiary, Metro Financial Services, Inc.\nThe Bank is a federally chartered, stock savings and loan association and is subject to federal regulation by the Federal Deposit Insurance Corporation and the Office of the Comptroller of the Currency (the OCC). The Bank provides financial services to individuals, corporate entities, and other organizations through the origination of loans and the acceptance of deposits in the form of passbook savings, certificates of deposit, and demand deposit accounts. Services are provided by ten branch offices, six of which are located in Shreveport, Louisiana, two in Bossier City, one in Minden, Louisiana and one in Benton, Louisiana. The Banks home office is located in Shreveport, Louisiana.\nThe Bank is subject to competition from other financial institutions and to the regulations of certain federal and state agencies and undergoes periodic examinations by those regulatory authorities.\nBasis of Presentation and Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly-owned subsidiary, Home Federal Bank. All significant intercompany balances and transactions have been eliminated.\nUse of Estimates\nIn preparing consolidated financial statements in conformity with accounting principles generally accepted in the United States of America (GAAP), management is required to make estimates and assumptions that affect the reported amounts of assets and liabilities as of the date of the consolidated balance sheets and reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates. Material estimates that are particularly susceptible to significant change in the near term relate to the allowance for loan losses, deferred taxes, and those related to acquisition accounting.\nSignificant Group Concentrations of Credit Risk\nMost of the Companys activities are provided to customers of the Bank by ten branch offices, six of which are located in the city of Shreveport, Louisiana, two in Bossier City, Louisiana, one in Minden, Louisiana and one in Benton, Louisiana. The area served by the Bank is primarily the Shreveport-Bossier City-Minden combined statistical area; however, loan and deposit customers are found dispersed in a wider geographical area covering much of northwest Louisiana.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 1.\nSummary of Significant Accounting Policies (Continued)\nCash and Cash Equivalents\nFor purposes of the Consolidated Statements of Cash Flows, cash and cash equivalents include cash on hand, balances due from banks, and federal funds sold, all of which have an original maturity date of ninety days or less.\nAt June 30, 2023 and 2022, cash and cash equivalents consisted of the following:\n(In Thousands)\nCash on Hand\n$\n1,825\n$\n1,495\nDemand Deposits at Other Institutions\n17,965\n40,758\nFederal Funds Sold\n4,975\n21,825\nTotal\n$\n24,765\n$\n64,078\nSecurities\nSecurities are being accounted for in accordance with Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 320s, Investments which requires the classification of securities into one of three categories: Trading, Available-for-Sale, or Held-to-Maturity. Management determines the appropriate classification of debt securities at the time of purchase and re-evaluates this classification periodically.\nInvestments in non-marketable equity securities and debt securities, in which the Company has the positive intent and ability to hold to maturity, are classified as held-to-maturity and carried at cost, adjusted for amortization of the related premiums, and accretion of discounts, using the interest method. Investments in debt securities that are not classified as held-to-maturity and marketable equity securities that have readily determinable fair values are classified as either trading or available-for-sale securities.\nSecurities that are acquired and held principally for the purpose of selling in the near term are classified as trading securities. Investments in securities not classified as trading or held-to-maturity are classified as available-for-sale. Trading account and available-for-sale securities are carried at fair value. Unrealized holding gains and losses on trading securities are included in earnings, while net unrealized holding gains and losses on available-for-sale debt securities are excluded from earnings and reported in other comprehensive income.\nThe Company held no trading securities as of June 30, 2023 and 2022.\nPurchase premiums and discounts are recognized in interest income using the interest method over the term of the securities. Securities are periodically reviewed for other-than-temporary impairment. For debt securities, management considers whether the present value of future cash flows expected to be collected are less than the securitys amortized cost basis (the difference defined as the credit loss), the magnitude and duration of the decline, the reasons underlying the decline and the Companys intent to sell the security or whether it is more likely than not that the Company would be required to sell the security before its anticipated recovery in market value, to determine whether the loss in value is other than temporary. If a decline in value is determined to be other than temporary, if the Company does not intend to sell the security, and it is more-likely-than-not that it will not be required to sell the security before recovery of the securitys amortized cost basis, the charge to earnings is limited to the amount of credit loss. Any remaining difference between fair value and amortized cost (the difference defined as the non-credit portion) is recognized in other comprehensive loss, net of applicable taxes. A decline in value that is considered to be other-than-temporary is recorded as a loss within noninterest income in the consolidated statements of income.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 1.\nSummary of Significant Accounting Policies (Continued)\nThe Bank has invested in Federal Home Loan Bank (FHLB) stock, and other similar correspondent banks, which is reflected at cost in these consolidated financial statements. As a member of the FHLB System, the Bank is required to purchase and maintain stock in an amount determined by the FHLB. The FHLB stock is redeemable at par value at the discretion of the FHLB.\nAcquisition Accounting\nAcquisitions are accounted for under the purchase method of accounting. The acquisition method of accounting requires the Company as the acquirer to recognize the fair value of assets acquired and liabilities assumed at the acquisition date, as well as recognize goodwill. If the purchase price over the sum of the estimated fair values of the tangible and identifiable intangible assets acquired less the estimated fair value of the liabilities assumed in an acquisition, goodwill is recognized. The Company records provisional amounts of fair value at the time of acquisition. The provisional fair values are subject to modification for up to one year after the acquisition.\nLoans Held-for-Sale\nLoans originated and intended for sale in the secondary market are carried at the lower of cost or estimated fair value in the aggregate. Net unrealized losses, if any, are recognized through a valuation allowance by charges to income.\nLoans Receivable\nLoans receivable are stated at unpaid principal balances, less allowances for loan losses and unamortized deferred loan fees. Net non-refundable fees (loan origination fees, commitment fees, discount points) and costs associated with lending activities are being deferred and subsequently amortized into income as an adjustment of yield on the related interest earning assets using the interest method. Interest income on contractual loans receivable is recognized on the accrual method. Unearned discounts are deferred and amortized on the interest method over the life of the loan.\nAcquired Loans\nPurchased loans acquired are recorded at their fair value. Discounts are included in the determination of the fair value. As such, an allowance for loan loss is not recorded at the acquisition date. Acquired loans are evaluated at acquisition and classified as either purchased credit impaired or purchased performing loans. Purchased credit impaired loans reflect credit deterioration since origination and as such at the date of acquisition the Company will not be able to collect all contractually required payments. The Company accounts for acquired impaired loans in accordance with ASC 310-30, Loans and Debt Securities Acquired with Deteriorated Credit Quality (ASC 310-30). Purchased credit impaired loans are accounted for individually. The Company estimates the amount and timing of undiscounted expected cash flows for each loan. The excess of the cash flows expected to be collected over a loans carrying value is considered to be the accretable yield, which is recognized as interest income over the estimated life of the loan. The excess of the undiscounted contractual balances due over the cash flows expected to be collected is considered to be the nonaccretable difference. Over the life of the loan, expected cash flows continue to be estimated. If the expected cash flows decrease, a provision for loan loss is recorded.\nIf the expected cash flows increase, it is recognized as part of future income. Purchased performing loans are accounted for under ASC 310-20, Nonrefundable Fees and Other Costs (ASC 310-20), with the related discount or premium being recognized as an adjustment to yield over the life of the loan.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 1.\nSummary of Significant Accounting Policies (Continued)\nAllowance for Loan Losses\nThe allowance for loan losses is established as losses are estimated to have occurred through a provision for loan losses charged to earnings. Loan losses are charged against the allowance when management believes the uncollectibility of a loan balance is confirmed. Subsequent recoveries, if any, are credited to the allowance.\nThe allowance for loan losses is evaluated on a regular basis by management and is based upon managements periodic review of the collectability of the loans in light of historical experience, the nature and volume of the loan portfolio, adverse situations that may affect the borrowers ability to repay, estimated value of the underlying collateral, and prevailing economic conditions. The evaluation is inherently subjective, as it requires estimates that are susceptible to significant revision as more information becomes available.\nThe allowance for loan losses is comprised of (i) specific reserves determined in accordance with current authoritative accounting guidance based on probable specific losses (ii) general reserve determined in accordance with current authoritative accounting guidance that consider historical loss experience, and (iii) qualitative reserves determined in accordance with current authoritative accounting guidance based upon qualitive factors, which include: 1) changes in lending policies, procedures, and practices; 2) changes in national and local economic trends and conditions; 3) changes in the nature and volume of the portfolio; 4) changes in the experience, ability, and depth of lending management and staff; 5) changes in the volume and loss severity of past due loans, the volume of non-accrual loans, and the volume and loss severity of adversely classified or graded loans; 6) changes in the quality of the Companys loan review system; 7) changes in the value of underlying collateral for collateral-dependent loans; 8) the existence and effect of any concentrations of credit, and changes in the level of such concentrations.\nA loan is considered impaired when, based on current information or events, it is probable that the Bank will be unable to collect the scheduled payments of principal and interest when due according to the contractual terms of the loan agreement. When a loan is impaired, the measurement of such impairment is based upon the fair value of the collateral of the loan. If the fair value of the collateral is less than the recorded investment in the loan, the Bank will recognize the impairment by creating a valuation allowance with a corresponding charge against earnings. A loan is considered a troubled debt restructuring (TDR) if the Company, for economic or legal reasons related to a debtors financial difficulties, grants a concession to the debtor that it would not otherwise consider. Concessions granted under a TDR typically involve a temporary or permanent reduction in payments or interest rate or an extension of a loans stated maturity date at less than a current market rate of interest. Loans identified as TDRs are designated as impaired.\nAn allowance is also established for uncollectible interest on loans classified as substandard. The allowance is established by a charge to interest income equal to all interest previously accrued, and income is subsequently recognized only to the extent that cash payments are received. When, in managements judgment, the borrowers ability to make periodic interest and principal payments is back to normal, the loan is returned to accrual status.\nIt should be understood that estimates of future loan losses involve an exercise of judgment. While it is possible that in particular periods the Company may sustain losses, which are substantial relative to the allowance for loan losses, it is the judgment of management that the allowance for loan losses reflected in the accompanying statements of condition is adequate to absorb known and inherent losses in the existing loan portfolio both probable and reasonable to estimate.\nOff-Balance Sheet Credit Related Financial Instruments\nIn the ordinary course of business, the Bank has entered into commitments to extend credit. Such financial instruments are recorded when they are funded.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 1.\nSummary of Significant Accounting Policies (Continued)\nReal Estate Owned\nAssets acquired through, or in lieu of, loan foreclosure are held-for-sale and are carried at the lower of cost or current fair value minus estimated cost to sell as of the date of foreclosure. Cost is defined as the lower of the fair value of the property or the recorded investment in the loan. Subsequent to foreclosure, valuations are periodically performed by management, and the assets are carried at the lower of carrying amount or fair value less cost to sell.\nPremises and Equipment\nLand is carried at cost. Buildings and equipment are carried at cost less accumulated depreciation computed on the straight-line method over the estimated useful lives of the assets. Estimated useful lives are as follows:\nBuildings and Improvements\n10 - 40 Years\nFurniture and Equipment\n3 - 10 Years\nGoodwill\nGoodwill represents the excess of the purchase price over the fair value of the net identifiable assets acquired. Goodwill has an indefinite useful life and is evaluated for impairment annually, or more frequently if events and circumstances indicate that the asset might be impaired.\nCore Deposit Intangible\nCore deposit intangibles represent the estimated value of long-term deposit relationships acquired in business combinations. The accumulated amortization of the Core deposit intangible is $0.174 million, and the carrying value as of June 30, 2023 was $1.533 million, to be expensed over 115 months. The Companys policy is to amortize these intangibles on a straight-line basis over their estimated useful life, which the estimated useful lives are periodically reviewed for reasonableness. Core deposit intangibles are tested for impairment if events and circumstances indicate the carrying amount of the asset may not be recoverable from future cash flows.\nBank Owned Life Insurance\nThe Company has purchased life insurance contracts on the lives of certain key employees. The Bank is the beneficiary of these policies. These contracts are reported at their cash surrender value and changes in the cash surrender value are included in non-interest income.\nIncome Taxes\nThe Company and its wholly-owned subsidiary file a consolidated federal income tax return on a fiscal year basis. Each entity will pay its pro-rata share of income taxes in accordance with a written tax-sharing agreement.\nThe Company accounts for income taxes on the asset and liability method. Deferred tax assets and liabilities are recorded based on the difference between the tax bases of assets and liabilities and their carrying amounts for financial reporting purposes, computed using enacted tax rates. A valuation allowance, if needed, reduces deferred tax assets to the expected amount most likely to be realized. Realization of deferred tax assets is dependent upon the generation of a sufficient level of future taxable income and recoverable taxes paid in prior years. Current taxes are measured by applying the provisions of enacted tax laws to taxable income to determine the amount of taxes receivable or payable.\nThe Company follows the provisions of the Income Taxes Topic of the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 740. ASC 740 prescribes a recognition threshold and measurement attribute for financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return and also provides guidance on various related matters such as derecognition, interest, penalties, and disclosures required. The Company recognizes interest and penalties, if any, related to unrecognized tax benefits in income tax expense.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 1.\nSummary of Significant Accounting Policies (Continued)\nWhile the Bank is exempt from Louisiana income tax, it is subject to the Louisiana Ad Valorem Tax, commonly referred to as the Louisiana Shares Tax, which is based on stockholders equity and net income.\nEarnings per Share\nEarnings per share are computed based upon the weighted average number of common shares outstanding during the year.\nNon-Direct Response Advertising\nThe Company expenses all advertising costs, except for direct-response advertising, as incurred. Non-direct response advertising costs were $340,000 and $329,000 for the years ended June 30, 2023 and 2022, respectively.\nIn the event the Company incurs expense for material direct-response advertising, it will be amortized over the estimated benefit period. Direct-response advertising consists of advertising whose primary purpose is to elicit sales to customers who could be shown to have responded specifically to the advertising and results in probable future benefits. For the years ended June 30, 2023 and 2022, the Company did not incur any amount of direct-response advertising.\nStock-Based Compensation\nGAAP requires all share-based payments to employees, including grants of employee stock options and recognition and retention share awards, to be recognized as expense in the statement of operations based on their fair values. The amount of compensation is measured at the fair value of the options or recognition and retention share awards when granted, and this cost is expensed over the required service period, which is normally the vesting period of the options or recognition and retention awards. This guidance applies to awards granted or modified after January 1, 2006, or any unvested awards outstanding prior to that date.\nReclassification\nCertain financial statement balances included in the prior year consolidated financial statements have been reclassified to conform to the current year presentation.\nComprehensive Income (Loss)\nAccounting principles generally require that recognized revenue, expenses, gains, and losses be included in net income. Although certain changes in assets and liabilities, such as unrealized gains and losses on available-for-sale debt securities, are reported as a separate component of the equity section of the consolidated balance sheets, such items, along with net income, are components of comprehensive income (loss).\nThe components of accumulated other comprehensive income (loss), included in stockholders equity, are as follows:\n(In Thousands)\nNet Unrealized Loss on Debt Securities Available-for-Sale\n$\n(3,359\n)\n$\n(2,151\n)\nTax Effect\nNet-of-Tax Amount\n$\n(2,654\n)\n$\n(1,699\n)\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 1.\nSummary of Significant Accounting Policies (Continued)\nRecent Accounting Pronouncements\nASU 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments. In June 2016, the FASB issued ASU 2016-13 which requires earlier measurement of credit losses and enhances disclosures. The main objective of ASU 2016-13 is to provide financial statement users with more decision-useful information about the expected credit losses on financial instruments and other commitments to extend credit held by a reporting entity at each reporting date. The Company formed a cross-functional working group, who have worked through an implementation plan which includes assessment, review and documentation of various aspects of the implementation plan. After significant evaluation of approved methodologies, the Company determined to utilize a third-party vendor model, in which a weighted average remaining maturity methodology was appropriate for the size and complexity of the Company. ASU 2016-13 is effective for the Company for annual and interim periods beginning on July 1, 2023. The Company will adopt ASU 2016-13 in the first quarter of fiscal 2024. At this time, the Company estimates the allowance for credit losses will increase between 4% to 9%. The adoption of the ASU 2016-13 is expected to result in an increase in the allowance for loan losses as a result of changing from an incurred loss model, which encompasses allowances for current known and inherent losses within the portfolio, to an expected loss model, which encompasses allowances for losses expected to be incurred over the life of the portfolio. The Company is evaluating the final considerations of the qualitative adjustments utilized in the model. The amount determined from adoption will be recognized as a cumulative effective to the July 1, 2023 retained earnings.\nAccounting Standards Update 2022-02 (ASU 2022-02), Financial Instruments - Credit Losses (Topic 326): Troubled Debt Restructurings and Vintage Disclosures. In March 2022, the FASB issued ASU 2022-02 which eliminates the TDR recognition and measurement guidance and instead requires that an entity evaluate whether the modification represents a new loan or a continuation of an existing loan. ASU 2022-02 also enhances existing disclosure requirements and introduces new requirements related to certain modifications of receivables made to borrowers experiencing financial difficulty. For public business entities, these amendments require that an entity disclose current period gross write-offs by year of origination for financing receivables and net investment in leases within the scope of Subtopic 326-20. Gross write-off information must be included in the vintage disclosures required for public business entities in accordance with paragraph 326-20-50-6, which requires that an entity disclose the amortized cost basis of financing receivables by credit quality indicator and class of financing receivable by year of origination. ASU 2022-02 is effective for the Company for annual and interim periods beginning on July 1, 2023. The adoption of ASU 2022-02 is not expected to have a significant impact on the Companys consolidated financial statements other than the required disclosures.\nAccounting Standards Update 2020-04 (ASU 2020-04), Reference Rate Reform - Topic 848. In March 2020, the FASB issued ASU 2020-04 which provides temporary optional expedients and exceptions to the Generally Accepted Accounting Principles (GAAP) guidance on contract modifications, hedge accounting, and other transactions affected that reference the London Inter-Bank Offered Rate (LIBOR) or another reference rate expected to be discontinued. ASU 2020-04 is effective upon issuance and can be applied through December 31, 2022. The Company is still evaluating the impact of ASU 2020-04, but does not expect it to have a material impact on the Companys consolidated financial statements.\nAccounting Standards Update 2022-06 (ASU 2022-06), Reference Rate Reform (Topic 848) - Deferral of the Sunset Date of Topic 848. AASU 2022-06 extends the period of time preparers can utilize the reference rate reform relief guidance provided by ASU 2020-04, which is discussed above. ASU 2022-06, which was effective upon issuance, defers the sunset date of this prior guidance from December 31, 2022 to December 31, 2024, after which entities will no longer be permitted to apply the relief guidance in Topic 848. The adoption of ASU 2022-06 did not significantly impact the Companys consolidated financial statements.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 2.\nSecurities\nThe amortized cost and fair value of securities, with gross unrealized gains and losses, follows:\nJune 30, 2023\nGross\nGross\nAmortized\nUnrealized\nUnrealized\nFair\nSecurities Available-for-Sale\nCost\nGains\nLosses\nValue\n(In Thousands)\nDebt Securities\nFHLMC Mortgage-Backed Certificates\n$\n12,167\n$\n$\n1,012\n$\n11,156\nFNMA Mortgage-Backed Certificates\n15,318\n-\n1,604\n13,714\nGNMA Mortgage-Backed Certificates\n4,578\n-\n3,764\nTotal Debt Securities\n32,063\n3,430\n28,634\nUS Treasury Securities\n9,779\n9,841\nMunicipal Bonds\n1,068\n1,076\nTotal Securities Available-for-Sale\n$\n42,910\n$\n$\n3,439\n$\n39,551\nSecurities Held-to-Maturity\nDebt Securities\nGNMA Mortgage-Backed Certificates\n$\n$\n-\n$\n$\nFHLMC Mortgage-Backed Certificates\n29,921\n-\n5,781\n24,140\nFNMA Mortgage-Backed Certificates\n41,024\n-\n7,277\n33,747\nTotal Debt Securities\n71,568\n-\n13,121\n58,447\nMunicipals\n1,311\n-\n1,231\nEquity Securities (Non-Marketable)\n12,935 Shares - Federal Home Loan Bank\n1,294\n-\n-\n1,294\n630 Shares - First National Bankers Bankshares, Inc.\n-\n-\nTotal Equity Securities\n1,544\n-\n-\n1,544\nTotal Securities Held-to-Maturity\n$\n74,423\n$\n-\n$\n13,201\n$\n61,222\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 2.\nSecurities (Continued)\nThe amortized cost and fair value of securities by contractual maturity at June 30, 2023, follows:\nAvailable-for-Sale\nHeld-to-Maturity\nAmortized\nFair\nAmortized\nFair\nCost\nValue\nCost\nValue\n(In Thousands)\nDebt Securities\nWithin One Year or Less\n$\n-\n$\n-\n$\n-\n$\n-\nOne through Five Years\n-\n-\nAfter Five through Ten Years\n1,861\n1,771\n-\n-\nOver Ten Years\n30,201\n26,862\n71,568\n58,447\n32,063\n28,634\n71,568\n58,447\nUS Treasury Securities\nWithin One Year or Less\n7,780\n7,847\n-\n-\nOne through Five Years\n1,999\n1,994\n-\n-\n9,779\n9,841\n-\n-\nMunicipals\nWithin One Year or Less\n-\n-\nOver Ten Years\n1,068\n1,076\n1,090\n1,021\n1,068\n1,076\n1,311\n1,231\nOther Equity Securities\n-\n-\n1,544\n1,544\nTotal\n$\n42,910\n$\n39,551\n$\n74,423\n$\n61,222\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 2.\nSecurities (Continued)\nThe amortized cost and fair value of securities, with gross unrealized gains and losses, follows:\nJune 30, 2022\nGross\nGross\nAmortized\nUnrealized\nUnrealized\nFair\nSecurities Available-for-Sale\nCost\nGains\nLosses\nValue\n(In Thousands)\nDebt Securities\nFHLMC Mortgage-Backed Certificates\n$\n7,513\n$\n$\n$\n7,032\nFNMA Mortgage-Backed Certificates\n17,753\n-\n1,067\n16,686\nGNMA Mortgage-Backed Certificates\n4,984\n-\n4,381\nTotal Debt Securities\n30,250\n2,152\n28,099\nTotal Securities Available-for-Sale\n$\n30,250\n$\n$\n2,152\n$\n28,099\nSecurities Held-to-Maturity\nDebt Securities\nGNMA Mortgage-Backed Certificates\n$\n$\n-\n$\n$\nFHLMC Mortgage-Backed Certificates\n32,485\n-\n4,602\n27,883\nFNMA Mortgage-Backed Certificates\n44,947\n-\n5,693\n39,254\nTotal Debt Securities\n78,072\n-\n10,335\n67,737\nMunicipals\n1,336\n-\n1,234\nEquity Securities (Non-Marketable)\n2,919 Shares - Federal Home Loan Bank\n-\n-\n630 Shares - First National Bankers Bankshares, Inc.\n-\n-\nTotal Equity Securities\n-\n-\nTotal Securities Held-to-Maturity\n$\n79,950\n$\n-\n$\n10,437\n$\n69,513\nThe amortized cost and fair value of securities by contractual maturity at June 30, 2022, follows:\nAvailable-for-Sale\nHeld-to-Maturity\nAmortized\nFair\nAmortized\nFair\nCost\nValue\nCost\nValue\n(In Thousands)\nDebt Securities\nWithin One Year or Less\n$\n-\n$\n-\n$\n-\n$\n-\nOne through Five Years\n-\n-\nAfter Five through Ten Years\n1,389\n1,334\n-\n-\nOver Ten Years\n28,856\n26,760\n78,072\n67,737\n30,250\n28,099\n78,072\n67,737\nMunicipals\nWithin One Year or Less\n$ -\n$ -\n$ -\n$ -\nOne through Five Years\n-\n-\nAfter Five through Ten Years\n-\n-\n-\n-\nOver Ten Years\n-\n-\n1,108\n1,016\n-\n-\n1,336\n1,234\nOther Equity Securities\n-\n-\nTotal\n$\n30,250\n$\n28,099\n$\n79,950\n$\n69,513\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 2.\nSecurities (Continued)\nInformation pertaining to securities with gross unrealized losses at June 30, 2023 and 2022, aggregated by investment category and length of time that individual securities have been in a continuous loss position, follows:\nJune 30, 2023\nLess Than Twelve Months\nOver Twelve Months\nGross\nGross\nUnrealized\nFair\nUnrealized\nFair\nLosses\nValue\nLosses\nValue\n(In Thousands)\nSecurities Available-for-Sale\nMortgage-Backed Securities\n$\n$\n9,109\n$\n2,811\n$\n18,892\nMunicipals\n-\n-\nUS Treasury Securities\n2,186\n-\n-\nTotal Securities Available-for-Sale\n$\n$\n11,856\n$\n2,811\n$\n18,892\nJune 30, 2023\nLess Than Twelve Months\nOver Twelve Months\nGross\nGross\nUnrealized\nFair\nUnrealized\nFair\nLosses\nValue\nLosses\nValue\n(In Thousands)\nSecurities Held-to-Maturity\nMortgage-Backed Securities\n$\n$\n1,859\n$\n12,907\n$\n56,587\nMunicipals\n-\n-\n1,231\nTotal Securities Held-to-Maturity\n$\n$\n1,859\n$\n12,987\n$\n57,818\nJune 30, 2022\nLess Than Twelve Months\nOver Twelve Months\nGross\nGross\nUnrealized\nFair\nUnrealized\nFair\nLosses\nValue\nLosses\nValue\n(In Thousands)\nSecurities Available-for-Sale\nMortgage-Backed Securities\n$\n1,335\n$\n21,813\n$\n$\n6,286\nTotal Securities Available-for-Sale\n$\n1,335\n$\n21,813\n$\n$\n6,286\nJune 30, 2022\nLess Than Twelve Months\nOver Twelve Months\nGross\nGross\nUnrealized\nFair\nUnrealized\nFair\nLosses\nValue\nLosses\nValue\n(In Thousands)\nSecurities Held-to-Maturity\nMortgage-Backed Securities\n$\n4,591\n$\n35,930\n$\n5,744\n$\n31,807\nMunicipals\n1,234\n-\n-\nTotal Securities Held-to-Maturity\n$\n4,693\n$\n37,164\n$\n5,744\n$\n31,807\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 2.\nSecurities (Continued)\nThe unrealized losses on the Companys investment in mortgage-backed securities at June 30, 2023 and 2022 were caused by interest rate changes. The contractual cash flows of these investments are guaranteed by agencies of the U.S. government. Accordingly, it is expected that these securities would not be settled at a price less than the amortized cost of the Companys investment. Because the decline in market value is attributable to changes in interest rates and not credit quality and because the Company has the ability and intent to hold these investments until a recovery of fair value, which may be maturity, the Company does not consider these investments to be other-than-temporarily impaired at June 30, 2023.\nAt June 30, 2023 and 2022, securities with a carrying value of $10.7 million and $0.581 million, respectively, were pledged to secure public deposits, and securities and mortgage loans with a carrying value of $212.2 million and $176.7 million, respectively, were pledged to secure FHLB advances.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 3.\nLoans Receivable\nLoans receivable at June 30, 2023 and 2022, are summarized as follows:\n(In Thousands)\nLoans Secured by Mortgages on Real Estate\nOne-to-Four Family Residential\n$\n179,579\n$\n120,014\nCommercial\n148,441\n127,589\nMulti-Family Residential\n28,849\n30,411\nLand\n26,841\n22,127\nConstruction\n28,035\n27,884\nEquity and Second Mortgage\n2,450\n1,587\nEquity Lines of Credit\n23,817\n17,831\nTotal Mortgage Loans\n438,012\n347,443\nCommercial Loans\n55,364\n44,487\nConsumer Loans\nLoans on Savings Accounts\nOther Consumer Loans\n1,082\nTotal Consumer Other Loans\n1,454\nTotal Loans\n494,830\n392,635\nLess: Allowance for Loan Losses\n(5,173\n)\n(4,451\n)\nUnamortized Loan Fees\n(164\n)\n(311\n)\nNet Loans Receivable\n$\n489,493\n$\n387,873\nAn analysis of the allowance for loan losses follows:\n(In Thousands)\nBalance - Beginning of Year\n$\n4,451\n$\n4,122\nProvision for Loan Losses\nRecoveries\nLoan Charge-Offs\n(237\n)\n(31\n)\nBalance - End of Year\n$\n5,173\n$\n4,451\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 3.\nLoans Receivable (Continued)\nFixed rate loans receivable, as of June 30, 2023, are scheduled to mature and adjustable rate loans are scheduled to re-price as follows (in thousands):\nUnder\nOver One\nOver Five\nOver\nOne\nto Five\nto Ten\nTen\nYear\nYears\nYears\nYears\nTotal\nLoans Secured by One-to-Four\n(In Thousands)\nFamily Residential\nFixed Rate\n$\n14,694\n$\n84,704\n$\n15,845\n$\n27,217\n$\n142,460\nAdjustable Rate\n3,211\n19,510\n11,063\n3,334\n37,118\nOther Loans Secured by Real Estate\nFixed Rate\n44,514\n108,402\n56,926\n16,236\n226,078\nAdjustable Rate\n31,742\n-\n-\n32,356\nAll Other Loans\nFixed Rate\n5,638\n24,607\n10,183\n2,859\n43,287\nAdjustable Rate\n13,531\n-\n-\n-\n13,531\nTotal\n$\n113,331\n$\n237,837\n$\n94,016\n$\n49,646\n$\n494,830\nCredit Quality Indicators\nThe Company segregates loans into risk categories based on the pertinent information about the ability of borrowers to service their debt such as: current financial information, historical payment experience, credit documentation, public information, and current economic trends, among other factors. The Company analyzes loans individually by classifying the loans according to credit risk. Loans classified as substandard or identified as special mention are reviewed quarterly by management to evaluate the level of deterioration, improvement, and impairment, if any, as well as assign the appropriate risk category.\nLoans excluded from the scope of the quarterly review process above are generally identified as pass credits until: (a) they become past due; (b) management becomes aware of a deterioration in the credit worthiness of the borrower; or (c) the customer contacts the Company for a modification. In these circumstances, the loan is specifically evaluated for potential classification and the need to allocate reserves or charge-off.\nThe Company uses the following definitions for risk ratings:\nPass - Loans classified as pass are well protected by the current net worth or paying capacity of the obligor or by the fair value, less cost to acquire and sell the underlying collateral in a timely manner.\nPass Watch - Loans are considered marginal, meaning some weakness has been identified which could cause future impairment of repayment. However, these relationships are currently protected from any apparent loss by collateral.\nSpecial Mention - Loans identified as special mention have a potential weakness that deserves managements close attention. If left uncorrected, these potential weaknesses may result in deterioration of the repayment prospects for the loan or of the institutions credit position at some future date.\nSubstandard - Loans classified as substandard are inadequately protected by the current net worth and payment capacity of the obligor or of the collateral pledged, if any. Loans so classified have a well-defined weakness or weaknesses that jeopardize the liquidation of the debt. They are characterized by the distinct possibility that the institution will sustain some loss if the deficiencies are not corrected.\nDoubtful - Loans classified as doubtful have all the weaknesses inherent in those classified as substandard, with the added characteristic that the weaknesses make collection or liquidation in full, on the basis of currently existing facts, conditions, and values, highly questionable and improbable.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 3.\nLoans Receivable (Continued)\nCredit Quality Indicators (Continued)\nLoss - This classification includes those loans which are considered uncollectible and of such little value that their continuance as loans is not warranted. Even though partial recovery may be possible in the future, it is not practical or desirable to defer writing off these basically worthless loans. Accordingly, these loans are charged-off before period end.\nThe following tables present the grading of loans, segregated by class of loans, as of June 30, 2023 and 2022:\nJune 30, 2023\nPass and\nPass Watch\nSpecial\nMention\nSubstandard\nDoubtful\nTotal\n(In Thousands)\nReal Estate Loans:\nOne-to-Four Family Residential\n$\n176,536\n$\n$\n2,233\n$\n-\n$\n179,579\nCommercial\n146,787\n-\n1,654\n-\n148,441\nMulti-Family Residential\n28,849\n-\n-\n-\n28,849\nLand\n26,841\n-\n-\n-\n26,841\nConstruction\n28,035\n-\n-\n-\n28,035\nEquity and Second Mortgage\n2,381\n-\n-\n2,450\nEquity Lines of Credit\n23,817\n-\n-\n-\n23,817\nCommercial Loans\n53,025\n2,339\n-\n-\n55,364\nConsumer Loans\n1,432\n-\n1,454\nTotal\n$\n487,703\n$\n3,150\n$\n3,977\n$\n-\n$\n494,830\nJune 30, 2022\nPass and\nPass Watch\nSpecial\nMention\nSubstandard\nDoubtful\nTotal\n(In Thousands)\nReal Estate Loans:\nOne-to-Four Family Residential\n$\n117,464\n$\n$\n2,198\n$\n-\n$\n120,014\nCommercial\n123,292\n2,548\n1,749\n-\n127,589\nMulti-Family Residential\n30,411\n-\n-\n-\n30,411\nLand\n22,127\n-\n-\n-\n22,127\nConstruction\n27,884\n-\n-\n-\n27,884\nEquity and Second Mortgage\n1,587\n-\n-\n-\n1,587\nEquity Lines of Credit\n17,831\n-\n-\n-\n17,831\nCommercial Loans\n44,275\n-\n-\n44,487\nConsumer Loans\n-\n-\n-\nTotal\n$\n385,576\n$\n3,112\n$\n3,947\n$\n-\n$\n392,635\nFactors considered by management in determining impairment include payment status, collateral value, and the probability of collecting scheduled principal and interest payments when contractually due. Loans that experience insignificant payment delays or payment shortfalls are generally not classified as impaired. On a case-by-case basis, management determines the significance of payment delays and payment shortfalls, taking into consideration all of the circumstances related to the loan, including: the length of the payment delay, the reasons for the delay, the borrowers prior payment record, and the amount of the shortfall in relation to the principal and interest owed.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 3.\nLoans Receivable (Continued)\nCredit Quality Indicators (Continued)\nAn aging analysis of past due loans, segregated by class of loans, as of June 30, 2023 and 2022, is as follows:\nJune 30, 2023\n30-59 Days\nPast Due\n60-89 Days\nPast Due\n90 Days or\nMore\nTotal\nPast Due\nCurrent\nTotal Loans\nReceivable\nRecorded\nInvestment\n> 90 Days\nand Accruing\n(In Thousands)\nReal Estate Loans:\nOne-to-Four Family\nResidential\n$\n$\n$\n1,174\n$\n2,101\n$\n177,478\n$\n179,579\n$\n-\nCommercial\n-\n-\n-\n-\n148,441\n148,441\n-\nMulti-Family Residential\n-\n-\n-\n-\n28,849\n28,849\n-\nLand\n-\n-\n26,805\n26,841\n-\nConstruction\n-\n-\n-\n-\n28,035\n28,035\n-\nEquity and Second Mortgage\n-\n-\n2,396\n2,450\n-\nEquity Lines of Credit\n-\n-\n-\n-\n23,817\n23,817\n-\nCommercial Loans\n-\n-\n55,301\n55,364\n-\nConsumer Loans\n-\n-\n-\n-\n1,454\n1,454\n-\nTotal\n$\n$\n$\n1,174\n$\n2,254\n$\n492,576\n$\n494,830\n$\n-\nJune 30, 2022\n30-59 Days\nPast Due\n60-89 Days\nPast Due\n90 Days or\nMore\nTotal\nPast Due\nCurrent\nTotal\nLoans\nReceivable\nRecorded\nInvestment\n> 90 Days\nand Accruing\n(In Thousands)\nReal Estate Loans:\nOne-to-Four Family\nResidential\n$\n-\n$\n1,923\n$\n$\n2,310\n$\n117,704\n$\n120,014\n$\nCommercial\n-\n-\n-\n-\n127,589\n127,589\n-\nMulti-Family Residential\n-\n-\n-\n-\n30,411\n30,411\n-\nLand\n-\n-\n-\n-\n22,127\n22,127\n-\nConstruction\n-\n-\n-\n-\n27,884\n27,884\n-\nEquity and Second Mortgage\n-\n-\n-\n-\n1,587\n1,587\n-\nEquity Lines of Credit\n-\n-\n17,807\n17,831\n-\nCommercial Loans\n-\n-\n-\n-\n44,487\n44,487\n-\nConsumer Loans\n-\n-\n-\n-\n-\nTotal\n$\n$\n1,923\n$\n$\n2,334\n$\n390,301\n$\n392,635\n$\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 3.\nLoans Receivable (Continued)\nCredit Quality Indicators (Continued)\nThe allowance for loan losses and recorded investment in loans for the year ended June 30, 2023 and 2022 was as follows:\nReal Estate Loans\nJune 30, 2023\nResidential\nCommercial\nMulti-\nFamily\nLand\nConstruction\nOther\nCommercial\nLoans\nConsumer\nLoans\nTotal\n(In Thousands)\nAllowance for loan losses:\nBeginning Balances\n$\n1,367\n$\n1,295\n$\n$\n$\n$\n$\n$\n$\n4,451\nCharge-Offs\n(41\n)\n-\n-\n-\n-\n(26\n)\n(170\n)\n-\n(237\n)\nRecoveries\n-\n-\n-\n-\n-\nCurrent Provision\n(129\n)\n(31\n)\n(28\n)\nEnding Balances\n$\n1,900\n$\n1,673\n$\n$\n$\n$\n$\n$\n$\n5,173\nEvaluated for Impairment:\nIndividually\n-\n-\n-\n-\nCollectively\n1,405\n1,573\n4,545\nLoans Receivable:\nEnding Balances - Total\n$\n179,579\n$\n148,441\n$\n28,849\n$\n26,841\n$\n28,035\n$\n26,267\n$\n55,364\n$\n1,454\n$\n494,830\nEnding Balances:\nEvaluated for Impairment:\nIndividually\n3,043\n1,654\n-\n-\n-\n2,339\n7,127\nCollectively\n$\n176,536\n$\n146,787\n$\n28,849\n$\n26,841\n$\n28,035\n$\n26,198\n$\n53,025\n$\n1,432\n$\n487,703\nReal Estate Loans\nJune 30, 2022\nResidential\nCommercial\nMulti-\nFamily\nLand\nConstruction\nOther\nCommercial\nLoans\nConsumer\nLoans\nTotal\n(In Thousands)\nAllowance for loan losses:\nBeginning Balances\n$\n$\n1,630\n$\n$\n$\n$\n$\n$\n$\n4,122\nCharge-Offs\n(8\n)\n(6\n)\n-\n-\n-\n(17\n)\n-\n-\n(31\n)\nRecoveries\n-\n-\n-\n-\n-\n-\nCurrent Provision\n(329\n)\n(102\n)\n(1\n)\nEnding Balances\n$\n1,367\n$\n1,295\n$\n$\n$\n$\n$\n$\n$\n4,451\nEvaluated for Impairment:\nIndividually\n-\n-\n-\n-\n-\nCollectively\n1,261\n1,166\n4,178\nLoans Receivable:\nEnding Balances - Total\n$\n120,014\n$\n127,589\n$\n30,411\n$\n22,127\n$\n27,884\n$\n19,418\n$\n44,487\n$\n$\n392,635\nEnding Balances:\nEvaluated for Impairment:\nIndividually\n2,550\n1,654\n-\n-\n-\n-\n2,760\n-\n7,059\nCollectively\n$\n117,464\n$\n125,840\n$\n30,411\n$\n22,127\n$\n27,884\n$\n19,418\n$\n41,727\n$\n$\n385,576\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 3.\nLoans Receivable (Continued)\nCredit Quality Indicators (Continued)\nThe following tables present loans individually evaluated for impairment, segregated by class of loans, as of June 30, 2023 and 2022:\nJune 30, 2023\nUnpaid\nPrincipal\nBalance\nRecorded\nInvestment\nWith No\nAllowance\nRecorded\nInvestment\nWith\nAllowance\nTotal\nRecorded\nInvestment\nRelated\nAllowance\nAverage\nRecorded\nInvestment\n(In Thousands)\nReal Estate Loans:\nOne-to-Four Family Residential\n$\n2,559\n$\n$\n2,403\n$\n2,559\n$\n$\n3,644\nCommercial\n1,617\n-\n1,617\n1,617\n1,675\nMulti-Family Residential\n-\n-\n-\n-\n-\n-\nLand\n-\n-\n-\n-\n-\n-\nConstruction\n-\n-\n-\n-\n-\n-\nEquity and Second Mortgage\n-\n-\n-\n-\n-\nEquity Lines of Credit\n-\n-\n-\n-\n-\n-\nCommercial Loans\n2,197\n2,160\n2,197\n2,659\nConsumer Loans\n-\n-\n-\n-\n-\nPurchased Credit Impaired\nTotal\n$\n7,127\n$\n$\n6,249\n$\n7,127\n$\n$\n8,818\nJune 30, 2022\nUnpaid\nPrincipal\nBalance\nRecorded\nInvestment\nWith No\nAllowance\nRecorded\nInvestment\nWith\nAllowance\nTotal\nRecorded\nInvestment\nRelated\nAllowance\nAverage\nRecorded\nInvestment\n(In Thousands)\nReal Estate Loans:\nOne-to-Four Family Residential\n$\n2,550\n$\n$\n2,387\n$\n2,550\n$\n$\n3,032\nCommercial\n1,749\n-\n1,749\n1,749\n1,811\nMulti-Family Residential\n-\n-\n-\n-\n-\n-\nLand\n-\n-\n-\n-\n-\n-\nConstruction\n-\n-\n-\n-\n-\n-\nEquity and Second Mortgage\n-\n-\n-\n-\n-\n-\nEquity Lines of Credit\n-\n-\n-\n-\n-\n-\nCommercial Loans\n2,760\n2,548\n2,760\n2,880\nConsumer Loans\n-\n-\n-\n-\n-\n-\nTotal\n$\n7,059\n$\n$\n6,684\n$\n7,059\n$\n$\n7,723\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 3.\nLoans Receivable (Continued)\nCredit Quality Indicators (Continued)\nA troubled debt restructuring (TDR) is a restructuring of a debt made by the Company to a debtor for economic or legal reasons related to the debtors financial difficulties that it would not otherwise consider. The Company grants the concession in an attempt to protect as much of its investment as possible.\nInformation about the Companys TDRs is as follows (in thousands):\nJune 30, 2023\nCurrent\nPast Due Greater\nThan 30 Days\nNonaccrual TDRs\nTotal TDRs\nOne-to-Four Family\n$\n-\n$\n$\n$\nCommercial Loans\n$\n-\n$\n-\n$\n-\n$\n-\nJune 30, 2022\nCurrent\nPast Due Greater\nThan 30 Days\nNonaccrual TDRs\nTotal TDRs\nOne-to-Four Family\n$\n-\n$\n1,818\n$\n1,818\n$\n1,818\nCommercial Loans\n$\n$\n-\n$\n$\nFor purposes of the determination of an allowance for loan losses on these TDRs, as an identified TDR, the Company considers a loss probable on the loan and, as a result, the loan is reviewed for specific impairment in accordance with the Companys allowance for loan loss methodology. If it is determined losses are probable on such TDRs, either because of delinquency or other credit quality indicator, the Company establishes specific reserves for these loans. As of June 30, 2023, there were no commitments to lend additional funds to debtors owing sums to the Company whose terms have been modified in TDRs.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 3.\nLoans Receivable (Continued)\nCredit Quality Indicators (Continued)\nFor each of the years ended June 30, 2023 and 2022, approximately $182,000 and $54,000, respectively, of interest was foregone on non-accrual loans. Impaired loans consisted of non-accruing loans at June 30, 2023 and 2022, and TDRs at June 30, 2023 and 2022. Impaired loans, segregated by class of loans, were as follows:\n(In Thousands)\nReal Estate Loans:\nOne-to-Four Family Residential\n$\n1,134\n$\n2,391\nCommercial\n-\n-\nMulti-Family Residential\n-\n-\nLand\n-\n-\nConstruction\n-\n-\nEquity and Second Mortgage\n-\n-\nEquity Lines of Credit\n-\n-\nCommercial Loans\n-\n-\nConsumer Loans\n-\n-\nTotal\n$\n1,134\n$\n2,391\nLoan Modifications/Troubled Debt Restructurings. Under the CARES Act, loans less than 30 days past due as of December 31, 2019 will be considered current for COVID-19 modifications. A financial institution can then suspend the requirements under GAAP for loan modifications related to COVID-19 that would otherwise be categorized as a troubled debt restructuring (TDR), and suspend any determination of a loan modified as a result of COVID-19 as being a TDR, including the requirement to determine impairment for accounting purposes. Financial institutions wishing to utilize this authority must make a policy election, which applies to any COVID-19 modification made between March 1, 2020 and the earlier of either December 31, 2020 or the 60th day after the end of the COVID-19 national emergency. Home Federal Bank has made that election. Similarly, the Financial Accounting Standards Board has confirmed that short-term modifications made on a good-faith basis in response to COVID-19 to loan customers who were current prior to any relief will not be considered TDRs.\nPrior to the enactment of the CARES Act, the banking regulatory agencies provided guidance as to how certain short-term modifications would not be considered TDRs, and have subsequently confirmed that such guidance could be applicable for loans that do not qualify for favorable accounting treatment under Section 4013 of the CARES Act.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 4.\nAccrued Interest Receivable\nAccrued interest receivable at June 30, 2023 and 2022 consisted of the following:\n(In Thousands)\nAccrued Interest on:\nMortgage Loans\n$\n$\nOther Loans\n1,086\nInvestments\nU.S. Treasury Notes\n-\nMunicipals\nMortgage-Backed Securities\nTotal\n$\n1,790\n$\n1,124\nNote 5.\nPremises and Equipment\nA summary of the cost and accumulated depreciation of premises and equipment follows:\n(In Thousands)\nLand\n$\n4,720\n$\n4,570\nBuildings\n15,014\n14,258\nEquipment\n3,049\n2,829\nConstruction in Progress\nLeasehold Improvements\n-\n23,273\n22,092\nAccumulated Depreciation\n(6,712\n)\n(5,843\n)\nTotal\n$\n16,561\n$\n16,249\nDepreciation expense charged against operations for the years ended June 30, 2023 and 2022 was $869,000 and $763,000, respectively.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 6.\nDeposits\nDeposits at June 30, 2023 and 2022 are summarized as follows:\nWeighted\nWeighted\nAverage\nAverage\nRate at\nRate at\n6/30/2023\n6/30/2022\nAmount\nPercent\nAmount\nPercent\n(Dollars in Thousands)\nNon-Interest Bearing\n0.00\n%\n0.00\n%\n$\n145,553\n24.36\n%\n$\n161,142\n30.29\n%\nNOW Accounts\n0.36\n%\n0.11\n%\n65,335\n10.94\n%\n58,957\n11.08\n%\nMoney Market\n2.16\n%\n0.12\n%\n114,195\n19.12\n%\n98,627\n18.54\n%\nPassbook Savings\n0.36\n%\n0.26\n%\n81,895\n13.71\n%\n132,981\n25.00\n%\n406,978\n68.13\n%\n451,707\n84.91\n%\nCertificates of Deposit\n3.47\n%\n1.19\n%\n190,383\n31.87\n%\n80,284\n15.09\n%\nTotal Deposits\n$\n597,361\n100.00\n%\n$\n531,991\n100.00\n%\nThe composition of certificates of deposit accounts by interest rate is as follows:\nAmount\nPercent\nAmount\nPercent\n(Dollars in Thousands)\n0.00% to 0.99%\n$\n19,248\n10.11\n%\n$\n36,150\n45.03\n%\n1.00% to 1.99%\n11,630\n6.11\n%\n28,559\n35.57\n%\n2.00% to 2.99%\n14,647\n7.69\n%\n14,323\n17.84\n%\n3.00% to 3.99%\n50,365\n26.46\n%\n1,252\n1.56\n%\n4.00% to 4.99%\n93,037\n48.87 %\n-\n0.00 %\n5.00% to 5.99%\n1,456\n0.76 %\n-\n0.00 %\nTotal Deposits\n$\n190,383\n100.00\n%\n$\n80,284\n100.00\n%\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 6.\nDeposits (Continued)\nMaturities of certificates of deposit accounts at June 30, 2023 are scheduled as follows:\nWeighted\nAverage\nYear Ending June 30,\nAmount\nPercent\nRate\n(Dollars in Thousands)\n$\n168,176\n88.34\n%\n3.58\n%\n13,034\n6.85\n%\n3.01\n6,463\n3.39\n%\n2.62\n1,786\n0.94\n%\n0.54\n0.48\n%\n1.25\nTotal\n$\n190,383\n100.00\n%\n3.47\n%\nInterest expense on deposits for the years ended June 30, 2023 and 2022 was as follows:\n(In Thousands)\nNOW and Money Market\n$\n1,242\n$\nPassbook Savings\nCertificates of Deposit\n2,952\n1,212\nTotal\n$\n4,506\n$\n1,770\nThe aggregate amount of time deposits in denominations of $250,000 or more at June 30, 2023 and 2022 was $59.1 million and $26.8 million, respectively.\nAt June 30, 2023 and 2022, the Bank had brokered certificates of deposit totaling $3.0 million and $6.0 million, respectively.\nNote 7.\nAdvances from Federal Home Loan Bank of Dallas\nPursuant to collateral agreements with the Federal Home Loan Bank of Dallas (FHLB), advances are secured by a blanket floating lien on first mortgage loans. Total interest expense recognized amounted to $79,000 and $41,000 for fiscal years 2023 and 2022, respectively.\nAdvances at June 30, 2023 and 2022 consisted of the following:\nAdvance Total\nContract Rate\n(In Thousands)\n0.00% to 0.99%\n$\n-\n$\n-\n1.00% to 1.99%\n-\n-\n2.00% to 2.99%\n-\n-\n3.00% to 3.99%\n-\n-\n4.00% to 4.99%\n-\nTotal\n$\n-\n$\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 8.\nOther Borrowings\nAt June 30, 2023 and 2022, the Company $10.0 million, respectively, line of credit agreement with First National Bankers Bank with the latest line maturing July 3, 2023. The credit agreement maturing on July 3, 2023 was renewed with a maturity of August 29, 2023. A new credit agreement for $11.0 million was executed on July 3, 2023, maturing August 29, 2024. The line is secured by shares of the subsidiary Banks common stock and bears interest at an initial rate of 8.25%, subject to change when adjustments are made to Wall Street Journal Prime. At June 30, 2023, the line had an outstanding balance of $8.6 million. Interest expense amounted to $494,000 and $66,000 for the years ended June 30, 2023 and 2022, respectively.\nNote 9.\nCommitments\nLease Commitments\nThe Bank leases property for two branch facilities.\nFuture minimum rental payments resulting from the non-cancelable term of these leases are as follows (in thousands):\nYear Ending June 30,\nAmount\n$\nThereafter\n1,330\nTotal\n1,485\nLess Imputed Interest\n(619 )\nPresent Value of Lease Liabilities\n$\nTotal rent expense paid under the terms of these leases for the years ended June 30, 2023 and 2022 amounted to $53,000 and $48,000, respectively.\nThe calculated amount of the ROU assets and lease liabilities in the table above are impacted by the length of the lease term and the discount rate used to present value the minimum lease payments. The Companys lease agreements often include one or more options to renew at the Companys discretion. If at lease inception, the Company considers the exercising of a renewal option to be reasonably certain, the Company will include the extended term in the calculation of the ROU asset and lease liability. Regarding the discount rate, Topic 842 requires the use of the rate implicit in the lease whenever this rate is readily determinable. As this rate is rarely determinable, the Company utilizes its incremental borrowing rate at lease inception, on a collateralized basis, over a similar term. For operating leases existing prior to January 1, 2019, the rate for the remaining lease term as of January 1, 2019, was used. For the Companys only finance lease, the Company utilized its incremental borrowing rate at lease inception.\nJune 30, 2023\nJune 30, 2022\nWeighted-average remaining lease term\nOperating lease\n35.4 years\n36.4 years\nWeighted-average discount rate\nOperating leases\n3.00\n%\n3.00\n%\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 9.\nCommitments (Continued)\nThe following table represents the consolidated statements of condition classification of the Companys ROU assets and lease liabilities. The Company elected not to include short-term leases (i.e., leases with initial terms of twelve months or less) on the consolidated statements of condition.\n(In Thousands)\nJune\n30, 2023\nJune\n30, 2022\nLease Right-of-Use Assets\nClassification\nOperating lease right-of-use assets\nOther Assets\n$\n$\nTotal Lease Right-of-Use Assets\n$\n$\nLease Liabilities\nOperating lease liabilities\nOther Accrued Expenses and Liabilities\n$\n$\nTotal Lease Liabilities\n$\n$\nContractual Commitment\nThe Bank has an agreement with a third-party to provide on-line data processing services. The agreement, which expires May 31, 2024, contains minimum monthly service charges of $28,821. At the end of this term, the agreement will automatically continue for successive periods of five years unless terminated upon written notice given at least six months prior to the end of the present term.\nThe future minimum commitments for the on-line processing services are as follows (in thousands):\nYear Ending June 30,\nAmount\n(In Thousands)\n$\nTotal\n$\nEmployment Contracts\nThe Company and the Bank have employment contracts with a certain key employee. These contracts provide for compensation and termination benefits. The\nfuture minimum commitments for the employment contracts are as follows (in thousands):\nYear Ending June 30,\nAmount\n(In Thousands)\n$\nTotal\n$\nLetters of Credit\nAt June 30, 2023, the Company had secured letters of credit in the aggregate amount of $35.0 million outstanding with the Federal Home Loan Bank, and $35.0 million expiring within one year. These letters of credit were issued to secure public body deposits. There were no outstanding borrowings associated with these letters of credit at June 30, 2023.\nNote 10.\nIncome Taxes\nThe Company and its subsidiary file consolidated federal income tax returns. The current provision for federal and state income taxes is calculated on pretax accounting income adjusted by items considered to be permanent differences between book and taxable income. Income tax expense for the years ended June 30, 2023 and 2022 is summarized as follows:\n(In Thousands)\nCurrent\n$ 1,240\n$\n1,451\nDeferred\n(174 )\n(324\n)\nTotal\n$ 1,066\n$\n1,127\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 10.\nIncome Taxes (Continued)\nThe effective federal income tax rate for the years ended June 30, 2023 and 2022 was 15.75% and 18.78%, respectively. Reconciliations\nof income tax expense at the statutory rate to the Companys effective rates are as follows:\n(In Thousands)\nComputed at Expected Statutory Rate\n$ 1,422\n$\n1,182\nNon-Taxable Income\n(35 )\n(55\n)\nMerger Expenses\n-\nEquity Compensation\n(336 )\n-\nOther\n(92 )\n-\nProvision for Income Tax Expense\n$ 1,066\n$\n1,127\nAt June 30, 2023 and 2022, temporary differences between the financial statement carrying amount and tax bases of assets that gave rise to deferred tax recognition were related to the effect of loan bad debt deduction differences for tax and book purposes, deferred stock option compensation, and supplemental employee retirement benefits. The deferred tax expense or benefit related to securities available-for-sale has no effect on the Companys income tax provision since it is charged or credited to the Companys other comprehensive income or loss equity component.\nThe net deferred income tax asset and liability consisted of the following components at June 30, 2023 and 2022:\nDeferred Tax Assets\n(In Thousands)\nStock Option and SERP Compensation\n$\n$\nMarket Value Adjustment to Available-for-Sale Securities\nTax over Book Accumulated Depreciation\n(767 )\n(415 )\nLoans Receivable - Bad Debt Loss Allowance\n1,086\nOther Asset\n-\nROU Asset\n(174 )\n-\n1,150\n1,143\nValuation Allowance\n-\n-\nTotal Deferred Tax Assets\n$ 1,150\n$ 1,143\nDeferred Tax Liabilities\nPurchase Accounting\n(19 )\n-\nLease Liability\n-\nTotal Deferred Tax Liabilities\n-\nNet Deferred Tax Asset\n$ 1,313\n$\n1,143\nIncluded in retained earnings at June 30, 2023 and 2022 is approximately $3.3 million for which no deferred Federal income tax liability has been recorded. This amount consists of the total amount of bad debt reserves deducted for income tax reporting purposes prior to January 1, 1988. Under current tax law, these pre-1988 bad debt reserves are subject to recapture into taxable income if the Bank were to (a) make certain non-dividend distributions, which include distributions in excess of the Banks current and accumulated earnings and profits, distributions in redemption of stock, and distributions in partial or complete liquidation or (b) cease to maintain a bank or thrift charter. The unrecorded deferred tax liability was approximately $693,000 at June 30, 2023 and 2022.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 10.\nIncome Taxes (Continued)\nAccounting principles generally accepted in the United States of America provide accounting and disclosure guidance about positions taken by an entity in its tax returns that might be uncertain. The Company believes that it has appropriate support for any tax positions taken, and as such, does not have any uncertain tax positions that are material to the consolidated financial statements.\nPenalties and interest assessed by income taxing authorities, if any, would be included in income tax expense.\nNote 11.\nEmployee Benefit Plans\nEffective November 15, 2004, the Bank adopted the Home Federal Bank Employees Savings and Profit Sharing Plan and Trust. This plan complies with the requirements of Section 401(k) of the Internal Revenue Code. Those eligible for this defined contribution plan must have completed twelve months of full time service and attained age 21. For 2023, participating employees may make elective salary reduction contributions of up to $20,500 of their eligible compensation. The Bank will contribute a basic safe harbor contribution of 3% of participant plan salary and will match 100% of the first 6% of plan salary elective deferrals. The Bank is also permitted to make discretionary contributions to be allocated to participant accounts. Pension costs, including administrative fees, attributable to the Banks 401(k) safe harbor plan for the years ended June 30, 2023 and 2022 were $291,000 and $245,000 respectively.\nDuring fiscal year 2011, the Company established a Survivor Benefit Plan for the benefit of selected executives. The purpose of the plan is to provide benefits to designated beneficiaries, if a participant dies while employed by the Company. The plan is considered an unfunded plan for tax and ERISA purposes, and all obligations arising under the plan are payable from the general assets of the Company. At June 30, 2023 and 2022, there were no obligations requiring accrual for this plan.\nThe Bank adopted a Supplemental Executive Retirement Agreement on December 13, 2017 for the benefit of Mr. James R. Barlow as President and Chief Executive Officer of the Company and the Bank effective as of January 1, 2018 (Effective Date). Under the terms of the agreement, after the target retirement date of December 31, 2033, Mr. Barlow will receive annual retirement benefits of $120,000, payable in equal annual installments over ten years. In the event of a separation from service prior to December 31, 2033, other than as a result of death and without cause, Mr. Barlow would receive his accrued benefits through such date payable in a lump sum. If Mr. Barlow has a separation from service either concurrently with or within two years following a change in control, he will be credited with five additional years of service following the date of his separation from service for purposes of calculating his accrued amount. In the event of death while in active service, his designated beneficiaries would receive a lump sum payment of the full retirement benefit. In the event of death after retirement, but before all payments have been made, any remaining benefits will be paid to the designated beneficiaries until all the annual installments have been paid. The retirement benefits are vesting ratably at 6.25% per year for sixteen years beginning with the calendar year ending December 31, 2018.\nFor the years ended June 30, 2023 and 2022, the Company recorded compensation expense totaling $44,358 and $42,817, respectively, to accrue the benefits required by the Supplemental Executive Retirement Agreement.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 12.\nEmployee Stock Ownership Plan\nDuring fiscal 2009, the Company instituted an employee stock ownership plan. The Home Federal Bank Employee Stock Ownership Plan (ESOP) enables all eligible employees of the Bank to share in the growth of the Company through the acquisition of stock. Employees are generally eligible to participate in the ESOP after completion of one year of service and attaining the age of 21.\nThe ESOP purchased the statutory limit of eight percent of the shares sold in our initial public offering completed on January 18, 2005, excluding shares issued to Home Federal Mutual Holding Company of Louisiana. This purchase was facilitated by a loan from the Company to the ESOP in the amount of $1.1 million. The corresponding note is being repaid in 80 quarterly debt service payments of $23,000 on the last business day of each quarter, beginning March 31, 2005, at the rate of 5.25%.\nAs part of our second step conversion completed on December 22, 2010, the ESOP purchased six percent of the shares sold in the offering. This purchase was facilitated by a loan from the Company to the ESOP in the amount of $1.2 million. The corresponding note is being repaid in 80 quarterly debt service payments of $20,000 on the last business day of each quarter, beginning March 31, 2011, at the rate of 3.2%.\nThe loans are secured by a pledge of the ESOP shares. The shares pledged as collateral are reported as unearned ESOP shares in the consolidated balance sheets. The notes payable and the corresponding notes receivable have been eliminated in consolidation.\nThe Company may contribute to the ESOP, in the form of debt service, at the discretion of its board of directors. Cash dividends on the Companys unallocated stock shall be used to either repay the loan or be distributed to the participants in the ESOP. If dividends are used to repay the loan, additional shares will be released from the suspense account and allocated to participants. Shares are released for allocation to ESOP participants based on principal and interest payments of the note. Compensation expense is recognized based on the number of shares allocated to ESOP participants each year and the average market price of the stock for the current year. Released ESOP shares become outstanding for earnings per share computations.\nAs compensation expense is incurred, the unearned ESOP shares account is reduced based on the original cost of the stock. The difference between the cost and the average market price of shares released for allocation is applied to additional paid-in capital. ESOP compensation expense for the years ended June 30, 2023 and 2022, was approximately $403,000 and $459,000, respectively.\nThe ESOP shares as of June 30, 2023 and 2022, were as follows:\nAllocated and Committed to be Released\nShares, Beginning of Year\n272,612\n250,566\nShares Allocated and Committed to be Released\nDuring the Year\n22,046\n22,046\nShares Distributed During the Year\n(15,934\n)\n-\nShares Purchased During the Year\n5,069\n-\nUnallocated and Unreleased Shares, as of Year End\n103,099\n125,145\nTotal ESOP Shares\n386,892\n397,757\nFair Value of Unreleased Shares (In Thousands)\n$\n1,448\n$\n2,460\nStock Price\n$\n14.04\n$\n19.66\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 13.\nStock-Based Compensation\nStock Option Plans\nOn August 10, 2005, the shareholders of the Company approved the establishment of the Home Federal Bancorp, Inc. of Louisiana 2005 Stock Option Plan (the 2005 Option Plan) for the benefit of directors, officers, and other employees. The aggregate number of shares of common stock reserved for issuance under the Option Plan totaled 317,736 (as adjusted). Both incentive stock options and non-qualified stock options may be granted under the plan. The 2005 Stock Option Plan terminated on June 8, 2015, however the 4,266 outstanding stock options as of June 30, 2023 will remain in effect for the remainder of their original ten year terms.\nOn December 23, 2011, the shareholders of the Company approved the establishment of the Home Federal Bancorp, Inc. of Louisiana 2011 Stock Option Plan (the 2011 Option Plan, together with the 2005 Option Plan, the Option Plan) for the benefit of directors, officers, and other employees. The aggregate number of shares of common stock reserved for issuance under the 2011 Option Plan totaled 389,044 (as adjusted). The 2011 Option Plan terminated on December 23, 2021, however, the 49,356 outstanding options as of June 30, 2023 will remain in effect for the remainder of their original ten year term.\nIncentive stock options and non-qualified stock options granted under the Option Plan become vested and exercisable at a rate of 20% per year over five years commencing one year from the date of the grant with an additional 20% vesting on each successive anniversary of the date the option was granted. No vesting shall occur after an employees employment or service as a director is terminated. In the event of death or disability of an employee or director or change in control of the Company, the unvested options shall become vested and exercisable. The Company recognizes compensation expense during the vesting period based on the fair value of the option on the date of the grant.\nStock Incentive Plans\nOn November 12, 2014, the shareholders of the Company approved the adoption of the Companys 2014 Stock Incentive Plan (the 2014 Stock Incentive Plan) for the benefit of employees and non-employee directors as an incentive to contribute to the success of the Company and to reward employees for outstanding performance and the attainment of targeted goals. The 2014 Stock Incentive Plan covers a total of 300,000 shares (as adjusted), of which no more than 75,000 shares (as adjusted), or 25% of the plan, may be share awards. The balance of the plan is reserved for stock option awards which would total 225,000 (as adjusted) stock options assuming all the share awards are issued. All incentive stock options granted under the 2014 Stock Incentive Plan are intended to comply with the requirements of Section 422 of the Internal Revenue Code. On October 26, 2015, the Company granted a total of 69,000 (as adjusted) plan share awards and 207,000 (as adjusted) stock options to directors, officers, and other key employees vesting ratably over five years. On February 5, 2019, the Company granted a total of 6,000 (as adjusted) plan share awards and 27,000 (as adjusted) stock options (which includes 9,000 stock options forfeited from the October 26, 2015 grants) to key employees vesting ratably over five years. The 2014 Stock Incentive Plan cost is recognized over the five year vesting period.\nOn November 13, 2019, the shareholders of the Company approved the adoption of the Companys 2019 Stock Incentive Plan which provides for a total of 250,000 shares (as adjusted) reserved for future issuance as stock awards or stock options. No more than 62,500 (as adjusted) shares, or 25%, may be granted as stock awards. The balance of the plan is reserved for stock option awards. On November 11, 2020, the Company granted a total of 62,500 (as adjusted) plan share awards and 187,500 (as adjusted) stock options to directors, officers and other key employees vesting ratably over five years. The Stock Incentive Plans costs are recognized over the five year vesting period. As of June 30, 2023, there are 1,600 plan share awards and 23,000 stock options available for future grants under the Stock Incentive Plans.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 13.\nStock-Based Compensation (Continued)\nShare Awards\nFollowing is a summary of the status of the share awards outstanding under the Stock Incentive Plans during the fiscal years ended June 30, 2023 and 2022 (split adjusted):\nAwarded Shares\nBalance - Beginning of Year\n51,600\n66,100\nGranted\n-\n-\nForfeited\n(400\n)\n(1,200\n)\nEarned and Issued\n(13,300\n)\n(13,300\n)\nBalance - End of Year\n37,900\n51,600\nCompensation expense pertaining to the share awards under the Stock Incentive Plans was approximately $123,000 and $117,000 for the years ended June 30, 2023 and 2022, respectively.\nStock Options\nFollowing is a summary of the status of the options outstanding under the Option Plan and Stock Incentive Plan during the fiscal years ended June 30, 2023 and 2022 (split adjusted):\nWeighted\nWeighted\nAverage\nAverage\nRemaining\nAggregate\nNumber of\nExercise\nContract\nIntrinsic\nShares\nPrice\nTerm\nValue\nOutstanding at June 30, 2022\n396,322\n$\n11.58\n5.68\n$ 3,201,824\nGranted\n8,000\n19.64\nExercised\n(30,406\n)\n10.79\nForfeited\n(9,000\n)\n18.87\nOutstanding at June 30, 2023\n364,916\n$\n11.64\n$\n4,249,099\nOptions Exercisable at June 30, 2023\n250,616\n$\n11.52\n$\n2,886,715\nOutstanding at June 30, 2021\n655,022\n$\n10.11\n4.45\n$ 6,153,690\nGranted\n-\n-\nExercised\n(249,700\n)\n7.56\nForfeited\n(9,000\n)\n15.63\nOutstanding at June 30, 2022\n396,322\n$\n11.58\n5.68\n$\n3,201,824\nOptions Exercisable at June 30, 2022\n239,122\n$\n11.28\n3.97\n$\n2,002,808\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 13.\nStock-Based Compensation (Continued)\nStock Options (Continued)\nThe fair value of each option granted is estimated on the grant date using the Black-Scholes model. The following assumptions were made in estimating fair value.\n2014 Stock\n2014 Stock\n2019 Stock\n2014 Stock\nIncentive\nPlan\nIncentive\nPlan\nIncentive\nPlan\nIncentive\nPlan\nAugust 15, 2022\nJuly 21, 2022\nNovember 11, 2020\nFebruary 5, 2019\nDividend Yield\n2.40 %\n2.49 %\n2.78 %\n1.79 %\nExpected Term\n10 years\n10 years\n10 years\n10 years\nRisk-Free Interest Rate\n2.79\n%\n2.91 %\n0.98 %\n2.71 %\nExpected Life\n10 years\n10 years\n10 years\n10 years\nExpected Volatility (1)\n33.94 %\n34.01 %\n25.56 %\n16.17 %\n(1) Weekly volatility is annualized by multiplying by the square root of 52.\nA summary of the status of the Companys nonvested options as of June 30, 2023 and changes during the year ended June 30, 2023 is as follows (split adjusted):\nWeighted\nNumber of\nAverage\nShares\nExercise Price\nNonvested at June 30, 2022\n157,200\n$\n12.03\nVested\n(41,900\n)\n12.33\nGranted\n8,000\n19.64\nForfeited\n(9,000\n)\n18.87\nNonvested at June 30, 2023\n114,300\n$\n11.92\nFor the years ended June 30, 2023 and 2022, compensation expense charged to operations for stock options granted under the Stock Incentive Plans was $95,000 and $95,000,\nrespectively.\nNote 14.\nOff-Balance Sheet Activities\nCredit Related Financial Instruments\nThe Bank is a party to credit related financial instruments with off-balance sheet risk in the normal course of business to meet the financing needs of its customers. These financial instruments consist primarily of commitments to extend credit. Such commitments involve, to varying degrees, elements of credit and interest rate risk in excess of the amount recognized in the consolidated balance sheets.\nThe Banks exposure to credit loss in the event of non-performance by the other party to loan commitments is represented by the contractual amount of the commitment. The Bank follows the same credit policies in making commitments as it does for on-balance sheet instruments.\nCommitments to extend credit are agreements to lend to a customer as long as there is no violation of any condition established in the contract. Commitments generally have fixed expiration dates or other termination clauses and may require a payment of a fee. The commitments for equity lines of credit may expire without being drawn upon. Therefore, the total commitment amounts do not necessarily represent future cash requirements. The amount and type of collateral obtained, if deemed necessary by the Bank upon extension of credit, varies and is based on managements credit evaluation of the counterparty.\nNo material gains or losses are anticipated as a result of these transactions.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 14.\nOff-Balance Sheet Activities (Continued)\nAt June 30, 2023 and 2022, the following financial instruments were outstanding:\nContract Amount\n(In Thousands)\nCommitments to Grant Loans\n$\n13,277\n$\n11,365\nUnfunded Commitments Under Lines of Credit\n76,500\n60,487\n$\n89,777\n$\n71,852\nFixed Rate Loans (5.00% - 9.00% in 2023; 3.50% - 5.00 % in 2022)\n$\n89,777\n$\n71,852\nVariable Rate Loans (5.00% - 6.00% in 2023 and 3.50% - 4.50% in 2022)\n-\n-\n$\n89,777\n$\n71,852\nCash Deposits\nThe Company periodically maintains cash balances in financial institutions that are in excess of insured amounts. The Company has not experienced any losses and does not believe that significant credit risk exists as a result of this practice. At June 30, 2023, we had $7.2 million in cash deposits over the insured limit of $250,000.\nRegional Credit Concentration\nA substantial portion of the Banks lending activity is with customers located within a 100 mile radius of the Shreveport, Louisiana metropolitan area, which includes areas of northwest Louisiana, northeast Texas and southwest Arkansas. Although concentrated within the region, the Bank has a diversified loan portfolio, which should preclude the Bank from being dependent upon the well-being of any particular economic sector to ensure collectibility of any significant portion of its debtors loan contracts.\nOther Credit Concentrations\nThe Bank has purchased, with recourse from the seller, loans from third-party mortgage originators. These loans are serviced by these entities. At both June 30, 2023 and June 30, 2022, the balance of the loans outstanding being serviced by these entities was $0.01 million.\nInterest Rate Floors and Caps\nThe Bank writes interest rate floors and caps into its variable rate mortgage loan contracts and loan servicing agreements in an attempt to manage its interest rate exposure. Such floors and caps enable customers to transfer, modify, or reduce their interest rate risk, which, in turn, creates an off-balance sheet market risk to the Bank. At June 30, 2023, the Banks loan portfolio contained approximately $20.9 million of loans in which the loan contracts or servicing agreements possessed interest rate floors and caps.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 15.\nRelated Party Events\nIn the ordinary course of business, the Bank makes loans to its directors and officers. These loans are made on substantially the same terms and conditions, including interest rates and collateral, as those prevailing at the same time for comparable transactions with other customers and do not involve more than normal credit risk or present other unfavorable features.\nAn analysis of the activity in loans made to such borrowers (both direct and indirect), including lines of credit, is summarized as follows for the years ended June 30, 2023 and 2022:\n(In Thousands)\nBalance - Beginning of Year\n$\n4,213\n$\n4,692\nAdditions\nPrincipal Payments\n(610\n)\n(1,147\n)\nBalance - End of Year\n$\n4,398\n$\n4,213\nDeposits from related parties held by the Bank at June 30, 2023 and 2022 amounted to $4.0 million and $3.6 million, respectively.\nNote 16.\nRegulatory Matters\nThe Bank is subject to various regulatory capital requirements administered by federal banking agencies. Failure to meet minimum capital requirements can initiate certain mandatory and possibly other discretionary actions by regulators that, if undertaken, could have a direct material effect on the Banks financial statements. Under capital adequacy guidelines and the regulatory framework for prompt corrective action, the Bank must meet specific capital requirements that involve quantitative measures of the Banks assets, liabilities, and certain off-balance-sheet items, as calculated under regulatory accounting practices. The Banks capital amounts and classification are also subject to qualitative judgments by the regulators about components, risk weightings, and other factors.\nThe Bank is required to maintain minimum capital ratios under OCC regulatory guidelines in order to ensure capital adequacy. Management believes, as of June 30, 2023 and 2022, that the Bank met all OCC capital adequacy requirements to which it is subject.\nAs of June 30, 2023, the most recent notification from the OCC categorized the Bank as well capitalized under the regulatory framework for prompt corrective action. To be categorized as well capitalized, the Bank must maintain minimum capital ratios, which are different than those required to meet OCC capital adequacy requirements.\nThere are no conditions or events since that notification that management believes may have changed the Banks category. The Bank was also classified as well capitalized at June 30, 2022.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 16.\nRegulatory Matters (Continued)\nThe Banks actual and required capital amounts and ratios for OCC regulatory capital adequacy purposes are presented below as of June 30, 2023 and 2022:\nRequired for Capital\nActual\nAdequacy Purposes\nAmount\nRatio\nAmount\nRatio\n(Dollars in Thousands)\nJune 30, 2023\nCore Capital\n(1\n)\n$\n57,281\n8.69\n%\n$\n19,783\n3.00\n%\nCommon Equity Tier 1\n(2\n)\n57,281\n12.79\n29,675\n4.50\nTangible Capital\n(1\n)\n57,281\n8.69\n9,892\n1.50\nTotal Risk-Based Capital\n(2\n)\n62,454\n13.95\n35,817\n8.00\nJune 30, 2022\nCore Capital\n(1\n)\n$\n56,035\n9.65\n%\n$\n17,428\n3.00\n%\nCommon Equity Tier 1\n(2\n)\n56,035\n14.47\n26,142\n4.50\nTangible Capital\n(1\n)\n56,035\n9.65\n8,714\n1.50\nTotal Risk-Based Capital\n(2\n)\n60,486\n15.62\n30,976\n8.00\n_________________________\n(1) Amounts and Ratios to Adjusted Total Assets\n(2) Amounts and Ratios to Total Risk-Weighted Assets\nThe Banks actual and required capital amounts and ratios to be well capitalized under prompt corrective action provisions are presented below as of June 30, 2023 and 2022:\nRequired to be\nActual\nWell Capitalized\nAmount\nRatio\nAmount\nRatio\n(Dollars in Thousands)\nJune 30, 2023\nTier 1 Leverage Capital\n(1\n)\n$\n57,281\n8.69\n%\n$\n32,972\n5.00\n%\nCommon Equity Tier 1\n(2\n)\n57,281\n12.79\n42,864\n6.50\nTier 1 Risk-Based Capital\n(2\n)\n57,281\n12.79\n52,755\n8.00\nTotal Risk-Based Capital\n(2\n)\n62,454\n13.95\n44,771\n10.00\nJune 30, 2022\nTier 1 Leverage Capital\n(1\n)\n$\n56,035\n9.65\n%\n$\n29,046\n5.00\n%\nCommon Equity Tier 1\n(2\n)\n56,035\n14.47\n37,760\n6.50\nTier 1 Risk-Based Capital\n(2\n)\n56,035\n14.47\n46,474\n8.00\nTotal Risk-Based Capital\n(2\n)\n60,486\n15.62\n38,720\n10.00\n__________________________\n(1) Amounts and Ratios to Adjusted Total Assets\n(2) Amounts and Ratios to Total Risk-Weighted Assets\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 16.\nRegulatory Matters (Continued)\nThe actual and required capital amounts and ratios applicable to the Bank for the years ended June 30, 2023 and 2022 are presented in the following tables, including a reconciliation of capital under generally accepted accounting principles to such amounts reported for regulatory purposes (Non-GAAP):\nMinimum for Capital\nActual\nAdequacy Purposes\nJune 30, 2023\nRatio\nAmount\nRatio\nAmount\n(Dollars in Thousands)\nTotal Equity, and Ratio to Average Total Assets\n8.92 %\n$ 58,802\nInvestments in and Advances to\nNonincludable Subsidiaries\n(118\n)\nUnrealized Gains on Securities Available-for-Sale\n2,654\nGoodwill\n(2,670 )\nIntangible Assets\n(1,387 )\nNon-significant investments Capital Stock\n-\nTangible Capital, and Ratio to Adjusted Total Assets\n8.69\n%\n$\n57,281\n1.50\n%\n$\n9,892\nTier 1 (Core) Capital, and Ratio to Adjusted Total Assets\n8.69\n%\n$\n57,281\n3.00\n%\n19,783\nTier 1 (Core) Capital, and Ratio to Risk-Weighted Assets\n12.79\n%\n57,281\n4.50\n%\n29,675\nAllowance for Loan Losses\n5,173\nExcess Allowance for Loan Losses\n-\nTotal Risk-Based Capital, and Ratio to Risk-Weighted Assets\n13.95\n%\n$\n62,454\n8.00\n%\n$\n35,817\nAverage Total Assets\n$\n663,615\nAdjusted Total Assets\n$\n659,440\nRisk-Weighted Assets\n$\n447,713\nMinimum for Capital\nActual\nAdequacy Purposes\nJune 30, 2022\nRatio\nAmount\nRatio\nAmount\n(Dollars in Thousands)\nTotal Equity, and Ratio to Average Total Assets\n9.37 %\n$ 54,454\nInvestments in and Advances to\nNonincludable Subsidiaries\n(118\n)\nUnrealized Gains on Securities Available-for-Sale\n1,699\nNon-significant investments Capital Stock\n-\nTangible Capital, and Ratio to Adjusted Total Assets\n9.65\n%\n$\n56,035\n1.50\n%\n$\n8,714\nTier 1 (Core) Capital, and Ratio to Adjusted Total Assets\n9.65\n%\n$\n56,035\n3.00\n%\n17,428\nTier 1 (Core) Capital, and Ratio to Risk-Weighted Assets\n14.47\n%\n56,035\n4.50\n%\n26,142\nAllowance for Loan Losses\n4,451\nExcess Allowance for Loan Losses\n-\nTotal Risk-Based Capital, and Ratio to Risk-Weighted Assets\n15.62 %\n$\n60,486\n8.00\n%\n$ 30,976\nAverage Total Assets\n$\n581,047\nAdjusted Total Assets\n$\n580,929\nRisk-Weighted Assets\n$\n387,195\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 17.\nRestrictions on Dividends\nBanking regulations place certain restrictions on dividends paid by the Bank to the Company. The Company is dependent upon dividends from the Bank to provide funds for the payment of dividends to the Companys shareholders, interest payments on the subordinated debt and other general corporate purposes. The Banks ability to pay cash dividends directly or indirectly to the Company is governed by federal law, regulations and related guidance. These include the requirement that the Bank must receive approval to declare a dividend if the total amount of all dividends, including the proposed dividend, declared by the Bank in any current year exceeds the total of the Banks net income for the current year to date, combined with its retained net income for the previous two years. The term retained net income as defined by federal regulations means the Banks net income for a specified period less the total amount of all dividends declared in that period.\nThe Bank may not pay dividends to the Company if, after paying those dividends, it would fail to meet the required minimum levels under risk-based capital guidelines or if the bank regulators have notified the Bank that it is in need of more than normal supervision. Under the Federal Deposit Insurance Act, an insured depository institution such as the Bank is prohibited from making capital distributions, including the payment of dividends, if, after making such distribution, the institution would become undercapitalized (as such term is used in the Federal Deposit Insurance Act). Payment of dividends by the Bank also may be restricted at any time at the discretion of the appropriate regulator if it deems the payment to constitute an unsafe and unsound banking practice.\nFor the years ended June 30, 2023 and 2022, the Bank paid a total of $11.4 million and $3.5 million, respectively, in cash dividends to the Company. At June 30, 2023, the Banks retained net income for the calendar years ended December 31, 2022 and 2021 and six months ended June 30, 2023, less the dividends declared and paid during those periods, totaled $1.8 million.\nNote 18.\nFair Value Disclosures\nThe following disclosure is made in accordance with the requirements of ASC 825, Financial\nInstruments. Financial instruments are defined as cash and contractual rights and obligations that require settlement, directly or indirectly, in cash. In cases where quoted market prices are not available, fair values have been estimated using the present value of future cash flows or other valuation techniques. The results of these techniques are highly sensitive to the assumptions used, such as those concerning appropriate discount rates and estimates of future cash flows, which require considerable judgment. Accordingly, estimates presented herein are not necessarily indicative of the amounts the Company could realize in a current settlement of the underlying financial instruments.\nASC 825 excludes certain financial instruments and all nonfinancial instruments from its disclosure requirements. These disclosures should not be interpreted as representing an aggregate measure of the underlying value of the Company.\nThe following methods and assumptions were used by the Company in estimating fair values of financial instruments:\nCash and Cash Equivalents\nThe carrying amount approximates the fair value of cash and cash equivalents.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 18.\nFair Value Disclosures (Continued)\nInvestment Securities\nFair values for investment securities, including mortgage-backed securities, are based on quoted market prices, where available. If quoted market prices are not available, fair values are based on quoted market prices of comparable instruments. The carrying values of restricted or non-marketable equity securities approximate their fair values. The carrying amount of accrued investment income approximates its fair value.\nMortgage Loans Held-for-Sale\nBecause these loans are normally disposed of within ninety days of origination, their carrying value closely approximates the fair value of such loans.\nLoans Receivable\nFor variable-rate loans that re-price frequently and with no significant changes in credit risk, fair value approximates the carrying value. Fair values for other loans are estimated using the discounted value of expected future cash flows. Interest rates used are those being offered currently for loans with similar terms to borrowers of similar credit quality. The carrying amount of accrued interest receivable approximates its fair value.\nOther Real Estate Owned\nOther real estate owned, which is obtained through the foreclosure process, is valued utilizing the appraised collateral value. Collateral values are estimated using level II inputs based on observable market data or Level III inputs based on customized discounting criteria.\nDeposit Liabilities\nThe fair values for demand deposit accounts are, by definition, equal to the amount payable on demand at the reporting date, that is, their carrying amounts. Fair values for other deposit accounts are estimated using the discounted value of expected future cash flows. The discount rate is estimated using the rates currently offered for deposits of similar maturities.\nAdvances from Federal Home Loan Bank\nThe carrying amount of short-term borrowings approximates their fair value. The fair value of long-term debt is estimated using discounted cash flow analyses based on current incremental borrowing rates for similar borrowing arrangements.\nOff-Balance Sheet Credit-Related Instruments\nFair values for outstanding mortgage loan commitments to lend are based on fees currently charged to enter into similar agreements, taking into account the remaining term of the agreements, customer credit quality, and changes in lending rates.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 18.\nFair Value Disclosures (Continued)\nAt June 30, 2023 and 2022, the carrying amount and estimated fair values of the Companys financial instruments were as follows:\nCarrying\nEstimated\nCarrying\nEstimated\nValue\nFair Value\nValue\nFair Value\n(In Thousands)\nFinancial Assets\nCash and Cash Equivalents\n$\n24,765\n$\n24,765\n$\n64,078\n$\n64,078\nDebt Securities Available-for-Sale\n39,551\n39,551\n28,099\n28,099\nSecurities Held-to-Maturity\n74,423\n61,222\n79,950\n69,513\nLoans Held-for-Sale\n3,978\n3,978\nLoans Receivable, Net\n489,493\n444,117\n387,873\n369,728\nFinancial Liabilities\nDeposits\n$\n597,361\n$\n481,055\n$\n531,991\n$\n490,789\nAdvances from FHLB\n-\n-\nOther Borrowings\n8,550\n8,550\n2,350\n2,350\nOff-Balance Sheet Items\nMortgage Loan Commitments\n$\n13,277\n$\n13,277\n$\n11,365\n$\n11,365\nThe estimated fair values presented above could be materially different than net realizable value and are only indicative of the individual financial instruments fair value. Accordingly, these estimates should not be considered an indication of the fair value of the Company taken as a whole.\nThe Company follows the guidance of ASC 820, Fair Value Measurements. ASC 820 establishes a framework for measuring fair value and expands disclosures about fair value measurements. This standard was issued to establish a uniform definition of fair value. The definition of fair value under ASC 820 is market-based, as opposed to company-specific, and includes the following:\nDefines fair value as the price that would be received to sell an asset or paid to transfer a liability, in either case, through an orderly transaction between market participants at a measurement date and establishes a framework for measuring fair value;\nEstablishes a three-level hierarchy for fair value measurements based upon the transparency of inputs to the valuation of an asset or liability as of the measurement date;\nNullifies the guidance in EITF 02-3, which required the deferral of profit at inception of a transaction involving a derivative financial instrument in the absence of observable data supporting the valuation technique;\nEliminates large position discounts for financial instruments quoted in active markets and requires consideration of the companys creditworthiness when valuing liabilities; and\nExpands disclosures about instruments that are measured at fair value.\nThe standard establishes a three-level valuation hierarchy for disclosure of fair value measurements. The valuation hierarchy favors the transparency of inputs to the valuation of an asset or liability as of the measurement date. The three levels are defined as follows:\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 18.\nFair Value Disclosures (Continued)\nLevel 1 - Fair value is based upon quoted prices (unadjusted) for identical assets or liabilities in active markets in which the Company can participate.\nLevel 2 - Fair value is based upon (a) quoted prices for similar assets or liabilities in active markets; (b) quoted prices for identical or similar assets or liabilities in markets that are not active, that is, markets in which there are few transactions for the asset or liability, the prices are not current, or price quotations vary substantially either over time or among market makers, or in which little information is released publicly; (c) inputs other than quoted prices that are observable for the asset or liability; or (d) inputs that are derived principally from or corroborated by observable market data by correlation or other means.\nLevel 3 - Fair value is based upon inputs that are unobservable for the asset or liability. These inputs reflect the Companys own assumptions about the assumptions that market participants would use in pricing the asset or liability (including assumptions about risk). These inputs are developed based on the best information available in the circumstances, which include the Companys own data. The Companys own data used to develop unobservable inputs are adjusted, if information indicates that market participants would use different assumptions.\nA financial instruments categorization within the valuation hierarchy is based upon the lowest level of input that is significant to the fair value measurement.\nThe preceding methods described may produce a fair value calculation that may not be indicative of the net realizable value or reflective of future fair values. Furthermore, although the Company believes its valuation methods are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the reporting date. There have been no changes in the methodologies used during the year ended June 30, 2022.\nFair values of assets and liabilities measured on a recurring basis at June 30, 2023 and 2022 are as follows:\nFair Value Measurements\nJune 30, 2023\n(Level 1)\n(Level 2)\n(Level 3)\nTotal\n(In Thousands)\nAvailable-for-Sale Debt Securities\nFHLMC\n$\n-\n$\n11,156\n$\n-\n$\n11,156\nFNMA\n-\n13,714\n-\n13,714\nGNMA\n-\n3,764\n-\n3,764\nUS Treasury Notes\n-\n9,841\n-\n9,841\nMunicipal Bonds\n-\n1,076\n-\n1,076\nTotal\n$ -\n$ 39,551\n$ -\n$ 39,551\nFair Value Measurements\nJune 30, 2022\n(Level 1)\n(Level 2)\n(Level 3)\nTotal\n(In Thousands)\nAvailable-for-Sale Debt Securities\nFHLMC\n$\n-\n$\n7,032\n$\n-\n$\n7,032\nFNMA\n-\n16,686\n-\n16,686\nGNMA\n-\n4,381\n-\n4,381\nTotal\n$ -\n$ 28,099\n$ -\n$ 28,099\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 18.\nFair Value Disclosures (Continued)\nThe Company did not record any liabilities at fair market value for which measurement of the fair value was made on a recurring basis at June 30, 2023 or 2022.\nThe following tables present the Companys assets and liabilities measured at fair value on a non-recurring basis at June 30, 2023 and 2022.\nFair Value Measurements\nJune 30, 2023\n(Level 1)\n(Level 2)\n(Level 3)\nTotal\n(In Thousands)\nAssets:\nImpaired Loans,\nNet of Allowance\n$\n-\n$\n-\n$\n$\nOther Real Estate Owned,\nNet of Allowance\n-\n-\nTotal\n$ -\n$ -\n$ 1,031\n$ 1,031\nFair Value Measurements\nJune 30, 2022\n(Level 1)\n(Level 2)\n(Level 3)\nTotal\n(In Thousands)\nAssets:\nImpaired Loans,\nNet of Allowance\n$\n-\n$\n-\n$\n2,289\n$\n2,289\nTotal\n$ -\n$ -\n$ 2,289\n$ 2,289\nNote 19.\nEarnings Per Common Share\nThe following table presents the components of average outstanding common shares for the years ended June 30, 2023 and 2022.\nAverage Common Shares Issued\n3,136,906\n3,389,537\nAverage Unearned ESOP Shares\n(116,158\n)\n(139,217\n)\nWeighted Average Number of Common Shares Used in Basic EPS\n3,020,748\n3,250,320\nEffect of Dilutive Securities Stock Options\n132,137\n214,527\nWeighted Average Number of Common Shares and Dilutive Potential Common Shares Used in Dilutive EPS\n3,152,885\n3,464,847\nEarnings per share are computed using the weighted average number of shares outstanding as prescribed in GAAP. For the years ended June 30, 2023 and 2022, there were outstanding options to purchase 386,171 and 396,322 shares, respectively, at a weighted average share price of $11.82 per share for 2023 and $11.58 per share for 2022.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 20.\nSubsequent Events\nIn accordance with FASB ASC 855, Subsequent Events, the Company has determined there have been no subsequent events that have occurred after June 30, 2023, through the date of the financial statements, that would require disclosure of have an adverse impact on financial statements.\nNote 21.\nRevenue Recognition\nIn accordance with Topic 606, revenues are recognized when control of promised goods or services is transferred to customers in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods or services. To determine revenue recognition for arrangements that an entity determines are within the scope of Topic 606, the Company performs the following five steps: (i) identify the contract(s) with a customer; (ii) identify the performance obligations in the contract; (iii) determine the transaction price; (iv) allocate the transaction price to the performance obligations in the contract; and (v) recognize revenue when (or as) the Company satisfies a performance obligation. The Company only applies the five-step model to contracts when it is probable that the entity will collect the consideration it is entitled to in exchange for the goods or services it transfers to the customer. At contract inception, once the contract is determined to be within the scope of Topic 606, the Company assesses the goods or services that are promised within each contract and identifies those that contain performance obligations, and assesses whether each promised good or service is distinct. The Company then recognizes as revenue the amount of the transaction price that is allocated to the respective performance obligation when (or as) the performance obligation is satisfied.\nAll of the Companys revenue from contracts with customers in-scope of ASC 606 is recognized in noninterest income and included in our commercial and consumer banking segment. The following table presents noninterest income, segregated by revenue streams in-scope and out-of-scope of Topic 606, for the years ended June 30, 2023 and 2022:\nAt or For the Year Ended\nJune 30,\n(In Thousands)\nNoninterest Income\nIn-scope of Topic 606:\nDebit card interchange fees\n$\n$\nATM surcharge income\nFees from non-sufficient funds\nNoninterest Income (in-scope of Topic 606)\n1,477\n1,147\nNoninterest Income (out-of-scope of Topic 606)\n2,329\nTotal Noninterest Income\n$\n2,099\n$\n3,476\nDeposit Fees\nThe Bank earns fees from its deposit customers for account maintenance, transaction-based services and overdraft charges. Account maintenance fees consist primarily of account fees and analyzed account fees charged on deposit accounts on a monthly basis. The performance obligation is satisfied and the fees are recognized on a monthly basis as the service period is completed. Transaction-based fees on deposits accounts are charged to deposit customers for specific services provided to the customer, such as wire fees, as well as charges against the account, such as fees for non-sufficient funds and overdrafts. The performance obligation is completed as the transaction occurs and the fees are recognized at the time each specific service is provided to the customer.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 21.\nRevenue Recognition (Continued)\nDebit Interchange Income\nDebit and ATM interchange income represent fees earned when a debit card issued by the Bank is used. The Bank earns interchange fees from debit cardholder transactions through the Visa payment network. Interchange fees from cardholder transactions represent a percentage of the underlying transaction value and are recognized daily, concurrently with the transaction processing services provided to the cardholder. The performance obligation is satisfied and the fees are earned when the cost of the transaction is charged to the cardholders debit card.\nNote 22.\nAcquisition Activity\nOn February 1, 2023, the Company completed the acquisition of Northwest Bancshares Corporation (NWB), the former holding company of First National Bank of Benton (FNBB). Shareholders of NWB received $128.16 in cash for each share of NWB common stock they held yielding an aggregate purchase price of $10.2 million.\nThe acquisition was accounted for under the purchase method of accounting in accordance with ASC 805, Business Combinations (ASC 805). In accordance with ASC 805, the Company recorded goodwill totaling $3.0 million from the acquisition as a result of consideration transferred over net assets acquired. Both the assets acquired and liabilities assumed were recorded at their respective acquisition date fair values. Identifiable intangible assets, including core deposit intangible assets, were recorded at fair value.\nThe fair value estimates of the NWB assets and liabilities are preliminary and require management to make estimates about discount rates, expected cash flows, market conditions, and other future events that are highly subjective in nature and are subject to refinement for a one year period after the date of the acquisition. Under current accounting principles, the Companys estimates of fair values may be adjusted for a period of up to one year from the acquisition date if new information is obtained about facts and circumstances that existed as of the acquisition date that, if known, would have affected the measurement of the amounts recognized as of that date. No adjustments to the acquisition date fair values were made during the period.\nPro forma tables for FNBB were impractical to include due to the cost versus benefit of including such disclosures and the immateriality of such information.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 22.\nAcquisition Activity (Continued)\nThe assets acquired and liabilities assumed, as well as the adjustments to record the assets and liabilities at fair value, are presented in the following table as of February 1, 2023.\n(dollars in thousands)\nAs Acquired\nFair Value Adjustment\nAs recorded by Home Federal Bancorp\nAssets\nCash and cash equivalents\n$\n13,255\n$\n-\n$\n13,255\nInvestment securities\n14,862\n-\n14,862\nLoans\n54,949\n(829\n)\n(a)\n54,120\nOffice properties and equipment, net\n(b)\nCore deposit intangible\n-\n1,510\n(c)\n1,510\nOther assets\n(343\n)\n(33\n)\nTotal assets acquired\n$\n83,393\n$\n1,006\n$\n84,399\nLiabilities\nNoninterest-bearing deposits\n$\n18,121\n-\n$\n18,121\nInterest-bearing deposits\n57,540\n(197\n)\n(d)\n57,343\nOther liabilities\n1,681\n-\n1,681\nTotal liabilities assumed\n$\n77,342\n$\n(197\n)\n$\n77,145\nExcess of assets acquired over liabilities assumed\n7,254\nCash consideration paid\n(10,244\n)\nTotal goodwill recorded\n$\n2,990\n(a)\nThe adjustment to reflect the fair value of loans includes:\nPreliminary adjustment of $727,000 to reflect the removal of FNBBs allowance for loan losses at the acquisition date, in accordance with ASC 805.\nPreliminary net discount of $772,000 for all purchased credit impaired loans that were determined to be within the scope of ASC 310-30, which totaled $4.3 million. The acquired loan balance was reduced by the net amount of the credit and interest adjustments in determining the fair value of the loans.\nPreliminary net discount of $785,000 for all performing loans were determined not to be within the scope of ASC 310-30, which totaled $51.6 million. The acquired loan balance was reduced by the net amount of the credit and interest adjustments in determining the fair value of the loans.\n(b) The adjustment represents the appraisal of the FNBB office property to its estimated fair value at the acquisition date.\n(c) The adjustment represents the value of the core deposit base assumed in the acquisition. The core deposit asset was recorded as an identifiable intangible asset and will be amortized on a straight line basis over the estimated life of the deposit base of 10 years.\n(d) The adjustment represents the fair value of certificates of deposit acquired based on current interest rates for similar instruments. The adjustment will be recognized using a level yield amortization method based on maturities of the deposit liabilities.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 23.\nParent Company Financial Statements\nFinancial information pertaining only to Home Federal Bancorp, Inc. of Louisiana as of June 30, 2023 and 2022 is as follows:\nHOME FEDERAL BANCORP, INC. OF LOUISIANA\nCondensed Balance Sheets\nJune 30, 2023 and 2022\nJune 30,\n(In Thousands)\nAssets\nCash and Cash Equivalents\n$\n$\nInvestment in Subsidiary\n58,802\n54,454\nOther Assets\nTotal Assets\n$\n59,350\n$\n54,792\nLiabilities and Stockholders Equity\nBorrowings\n$\n8,550\n$\n2,350\nOther Liabilities\nStockholders Equity\n50,542\n52,347\nTotal Liabilities and Stockholders Equity\n$\n59,350\n$\n54,792\nHOME FEDERAL BANCORP, INC. OF LOUISIANA\nCondensed Statements of Operations\nFor the Years Ended June 30, 2023 and 2022\nFor the Years Ended June 30,\n(In Thousands)\nEquity in Undistributed Earnings of Subsidiary\n$\n6,458\n$\n5,258\nInterest Income\nTotal Income\n6,470\n5,307\nOperating Expenses\nInterest Expense\nTotal Expense\nIncome Before Income Tax Benefit\n5,503\n4,771\nIncome Tax Benefit\n(201\n)\n(102\n)\nNet Income\n$\n5,704\n$\n4,873\nHOME FEDERAL BANCORP, INC. OF LOUISIANA AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nNote 23.\nParent Company Financial Statements (Continued)\nHOME FEDERAL BANCORP, INC. OF LOUISIANA\nCondensed Statements of Cash Flows\nFor the Years Ended June 30, 2023 and 2022\nFor the Years Ended June 30,\n(In Thousands)\nOperating Activities\nNet Income\n$ 5,704\n$ 4,873\nAdjustments to Reconcile Net Income to Net\nCash Used in Operating Activities\nEquity in Undistributed Earnings of Subsidiary\n(6,458\n)\n(5,258\n)\n(Decrease) in Other Assets\n(50\n)\n(21\n)\nIncrease in Other Liabilities\nNet Cash Used in Operating Activities\n(641 )\n(368 )\nInvesting Activities\nNet Cash Paid in Acquisition\n(10,244 )\n-\nNet Cash used in Investing Activities\n(10,244 )\n-\nFinancing Activities\nDistribution from Subsidiary\n11,400\n3,500\nProceeds from Stock Options Exercised\n1,889\nProceeds of Borrowings\n6,200\n3,150\nRepayment of Borrowings\n-\n(3,200\n)\nProceeds Received from Subsidiary on Stock Compensation Programs\nCompany Stock Purchased\n(5,963\n)\n(4,484\n)\nDividends Paid\n(1,540\n)\n(1,353\n)\nNet Cash Provided by Financing Activities\n11,045\nDecrease in Cash and Cash Equivalents\n(195\n)\nCash and Cash Equivalents, Beginning of Year\nCash and Cash Equivalents, End of Year\n$\n$ Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure\nNot applicable. Item 9A. Controls and Procedures\n(a)\nOur management evaluated, with the participation of our principal executive officer and principal financial officer, the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934) as of the end of the period covered by this report. Based on such evaluation, our principal executive officer and principal financial officer have concluded that our disclosure controls and procedures are designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Securities Exchange Act of 1934 is recorded, processed, summarized, and reported within the time periods specified in the SECs rules and regulations and are operating in an effective manner.\n(b)\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). The Companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nInternal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements prepared for external purposes in accordance with generally accepted accounting principles. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision and with the participation of management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on our evaluation under the framework in Internal Control - Integrated Framework, management concluded that our internal control over financial reporting was effective as of June 30, 2023.\n(c)\nNo change in the Companys internal control over financial reporting (as defined in rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934) occurred during the most recent fiscal quarter that has materially affected, or is reasonably likely to materially affect, its internal control over financial reporting. Item 9B. Other Information\nNot applicable.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance\nThe information required herein is incorporated by reference from the sections captioned Information with Respect to Nominees for Director, Continuing Directors, and Executive Officers and Beneficial Ownership of Common Stock by Certain Beneficial Owners and Management - Delinquent Section 16(a) Reports in the Registrants Proxy Statement to be filed with the Securities and Exchange Commission within 120 days of June 30, 2023 (Proxy Statement).\nCode of Ethics. Home Federal Bancorp has adopted a Code of Ethics that applies to its principal executive officer and principal financial officer, as well as directors, other officers, and employees of Home Federal Bancorp and Home Federal Bank. A copy of the Code of Ethics may be obtained without charge upon request made to Glen W. Brown, Home Federal Bank, 222 Florida Street, Shreveport, Louisiana 71105. Item 11. Executive Compensation\nThe information required herein is incorporated by reference from the section captioned Management Compensation in the Proxy Statement to be filed with the Securities and Exchange Commission within 120 days of June 30, 2023. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership of Certain Beneficial Owners and Management. The information required herein is incorporated by reference from the section captioned Beneficial Ownership of Common Stock by Certain Beneficial Owners and Management in the Proxy Statement to be filed with the Securities and Exchange Commission within 120 days of June 30, 2023.\nEquity Compensation Plan Information. The following table provides information as of June 30, 2023 with respect to shares of common stock that may be issued under our existing equity compensation plans, which consist of the 2005 and 2011 Stock Option Plans, and 2014 and 2019 Stock Incentive Plans, all of which were approved by our shareholders.\nPlan Category\nNumber of\nSecurities to be\nIssued Upon\nExercise of\nOutstanding\nOptions,\nWarrants\nand Rights\n(a)\nWeighted-\nAverage\nExercise Price\nof\nOutstanding\nOptions,\nWarrants\nand Rights\n(b)\nNumber of\nSecurities\nRemaining\nAvailable for\nFuture Issuance Under Equity\nCompensation\nPlans\n(Excluding\nSecurities\nReflected in\nColumn (a))\n(c)\nEquity compensation plans approved by security holders\n402,816\n$\n11.82\n24,600\nEquity compensation plans not approved by security holders\n--\n--\n--\nTotal\n402,816\n$\n11.82\n24,600 Item 13. Certain Relationships and Related Transactions and Director Independence\nThe information required herein is incorporated by reference from the section captioned Indebtedness of Management and Related Party Transactions in the Proxy Statement to be filed with the Securities and Exchange Commission within 120 days of June 30, 2023. Item 14. Principal Accountant Fees and Services\nThe information required herein is incorporated by reference from the section captioned Ratification of Appointment of Independent Registered Public Accounting Firm - Audit Fees in the Proxy Statement to be filed with the Securities and Exchange Commission within 120 days of June 30, 2023.\nPART IV Item 15. Exhibit and Financial Statement Schedules\n(a) The following documents are filed as part of this report and are incorporated herein by reference from Item 8 hereof:\nReport of Independent Registered Public Accounting Firm (FORVIS, LLP, PCAOB Firm ID 686)\nConsolidated Balance Sheets as of June 30, 2023 and 2022\nConsolidated Statements of Operations for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Comprehensive Income for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Changes in Stockholders Equity for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the Years Ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nThe following exhibits are filed as part of the Form 10-K, and this list includes the Exhibit Index:\nNo.\nDescription\nLocation\n3.1\nArticles of Incorporation of Home Federal Bancorp, Inc. of Louisiana\n(1)\n3.2\nBylaws of Home Federal Bancorp, Inc. of Louisiana\n(1)\n4.1\nForm of Stock Certificate of Home Federal Bancorp, Inc. of Louisiana\n(1)\n4.2\nDescription of Securities\n(2)\n10.1\nHome Federal Bancorp, Inc. of Louisiana 2005 Stock Option Plan*\n(3)\n10.2\nHome Federal Bancorp, Inc. of Louisiana 2011 Stock Option Plan*\n(4)\n10.3\nHome Federal Bancorp, Inc. of Louisiana 2011 Recognition and Retention Plan and Trust Agreement*\n(4)\n10.4\nAmended and Restated Employment Agreement between Home Federal Bank and James R. Barlow, dated as of December 27, 2012*\n(5)\n10.5\nEmployment Agreement between Home Federal Bancorp, Inc. of Louisiana and James R. Barlow, dated as of December 27, 2012*\n(5)\n10.6\nSupplemental Executive Retirement Agreement between Home Federal Bank and Daniel R. Herndon, dated as of December 27, 2012*\n(5)\n10.7\nLetter Agreement between Home Federal Bank and Adalberto Cantu, Jr., dated as of February 6, 2013*\n(6)\n10.8\nLetter Agreement by and among Home Federal Bank, Home Federal Bancorp, Inc. of Louisiana and Glen W. Brown accepted as of April 9, 2014*\n(7)\n10.9\nHome Federal Bancorp. Inc. of Louisiana 2014 Stock Incentive Plan*\n(8)\n10.10\nHome Federal Bank 2016 Loan Officer Incentive Compensation Plan*\n(9)\n10.11\nSupplemental Executive Retirement Agreement between Home Federal Bank and James R. Barlow, dated as of December 13, 2017*\n(10)\n10.12\nSeparation Agreement by and among Home Federal Bancorp, Inc. of Louisiana, Home Federal Bank and Daniel R. Herndon*\n(11)\n10.13\nHome Federal Bancorp, Inc. of Louisiana 2019 Stock Incentive Plan*\n(12)\n23.0\nConsent of FORVIS, LLP\nFiled Herewith\n31.1\nRule 13a-14(a)/15d-14(a) Certification of the Principal Executive Officer\nFiled Herewith\n31.2\nRule 13a-14(a)/15d-14(a) Certification of the Chief Financial Officer\nFiled Herewith\n32.0\nSection 1350 Certifications\nFiled Herewith\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\nFiled Herewith\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\nFiled Herewith\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\nFiled Herewith\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\nFiled Herewith\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nFiled Herewith\n101.DEF\nInline XBRL Taxonomy Extension Definitions Linkbase Document.\nFiled Herewith\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101).\nFiled Herewith\n(Footnotes on following page)\n*\nDenotes a management contract or compensatory plan or arrangement.\n(1)\nIncorporated herein by reference from the Companys Registration Statement on Form S-1, as amended, filed with the SEC on September 3, 2010 (File No. 333-169230).\n(2)\nIncorporated herein by reference from the Companys Annual Report on Form 10-K filed with the SEC on September 29, 2020 (File No. 001-35019).\n(3)\nIncorporated herein by reference from the Companys Definitive Schedule 14A filed with the SEC on June 29, 2005 (File No. 000-51117).\n(4)\nIncorporated by reference from the Companys definitive proxy statement for the Annual Meeting of Shareholders held on December 23, 2011 filed with the SEC on October 28, 2011 (File No. 001-35019).\n(5)\nIncorporated by reference from the Companys Current Report on Form 8-K filed with the SEC on December 28, 2012 (File No. 001-35019).\n(6)\nIncorporated by reference from the Companys Quarterly Report on Form 10-Q filed with the SEC on May 10, 2013 (File No. 001-35019).\n(7)\nIncorporated by reference from the Companys Current Report on Form 8-K filed with the SEC on July 9, 2014 (File No. 001-35019).\n(8)\nIncorporated by reference from the Companys definitive proxy statement for the Annual Meeting of Shareholders held on November 12, 2014 (File No. 001-35019).\n(9)\nIncorporated by reference from the Companys Current Report on Form 8-K filed with the SEC on February 11, 2016 (File No. 001-35019).\n(10)\nIncorporated herein by reference from the Companys Current Report on Form 8-K filed with the SEC on December 18, 2017 (File No. 001-35019).\n(11)\nIncorporated herein by reference from the Companys Current Report on Form 8-K filed with the SEC on November 22, 2019 (File No. 001-35019).\n(12)\nIncorporated herein by reference from the Companys definitive proxy statement for the Annual Meeting of Shareholders held on November 13, 2019 filed with the SEC on October 9, 2019 (File No. 001-35019).\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant had duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nHOME FEDERAL BANCORP, INC. OF LOUISIANA\nDate: October 2, 2023\nBy:\n/s/ James R. Barlow\nJames R. Barlow\nChairman of the Board, President and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ James R. Barlow\nJames R. Barlow\nChairman of the Board, President and Chief Executive Officer\n(Principal Executive Officer)\nOctober 2, 2023\n/s/ Glen W. Brown\nGlen W. Brown\nSenior Vice President and Chief Financial Officer\n(Principal Financial and Accounting Officer)\nOctober 2, 2023\n/s/ Walter T. Colquitt, III\nWalter T. Colquitt, III\nDirector\nOctober 2, 2023\n/s/ Scott D. Lawrence\nScott D. Lawrence\nDirector\nOctober 2, 2023\n/s/ Mark M. Harrison\nMark M. Harrison\nDirector\nOctober 2, 2023\n/s/ Thomas Steen Trawick, Jr.\nThomas Steen Trawick, Jr.\nDirector\nOctober 2, 2023\n/s/ Timothy W. Wilhite, Esq.\nTimothy W. Wilhite, Esq.\nDirector\nOctober 2, 2023"
}