{
    "cik": "1504239",
    "company": "Point of Care Nano-Technology, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-25",
    "period_of_report": "2022-07-31",
    "sic": "2836",
    "state_of_inc": null,
    "state_location": "FL",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1504239/0001199835-22-000608-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1504239/000119983522000608/pcnt-10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1504239/0001199835-22-000608.txt",
    "filename": "1504239_10K_2022_0001199835-22-000608.htm",
    "content": "Item 1. Business\nOverview\nOur plan of operation for the next 12 months is to seek and acquire new business assets in the life sciences industry and begin operations with these new assets. We do not intend to limit our activities to a particular field within the life sciences sector and we have not established any particular criteria upon which we shall consider a business opportunity. There can be no assurances that we will be successful with our new business objective.\nOur management will have substantial flexibility in identifying and selecting a prospective new business opportunity in the life sciences sector. We are dependent on the judgment of our management in connection with this process. In evaluating a prospective business opportunity, we will consider, among other factors, the following:\n● costs associated with pursuing a new business opportunity;\n● growth potential of the new business opportunity;\n● experiences, skills and availability of additional personnel necessary to pursue a potential new business opportunity;\n● necessary capital requirements;\n● the competitive position of the new business opportunity;\n● stage of business development;\n● the market acceptance of the potential products and services;\n● proprietary features and degree of intellectual property; and\n● the regulatory environment that may be applicable to any prospective business opportunity.\nThe foregoing criteria are not intended to be exhaustive and there may be other criteria that management may deem relevant. In connection with an evaluation of a prospective or potential business opportunity, management may be expected to conduct a due diligence review.\nThe time and costs required to pursue new business opportunities, which includes negotiating and documenting relevant agreements and preparing requisite documents for filing pursuant to applicable securities laws, cannot be ascertained with any degree of certainty.\nOur management intends to devote such time as it deems necessary to carry out the Companys affairs. The exact length of time required for the pursuit of any new potential business opportunities is uncertain. No assurance can be made that we will be successful in our efforts. We cannot project the amount of time that our management will actually devote to the Companys business objectives.\nWe intend to conduct our activities so as to avoid being classified as an Investment Company under the Investment Company Act of 1940, and therefore, to avoid application of the costly and restrictive registration and other provisions of the Investment Company Act of 1940 and the regulations promulgated thereunder.\nRecent Activities\nOn April 11, 2022, we, through our newly established, wholly owned subsidiary, Duo Sciences, Inc. (DSI), acquired an exclusive license from Cedoga Consulting, LLC (Cedoga) to distribute in the USA, Canada and Mexico, certain intellectual property of Cedoga relating to animal nutrition and animal supplements (the Cedoga IP). In exchange for these license rights, we agreed to issue Cedoga 300,000 (post-reverse split (discussed below)) shares of our common stock. Under the terms of the agreement, we will pay Cedoga royalties from sub-licensing the Cedoga IP on the following terms:\n● 90% of net royalties for sales and initial payments up to $100,000,000 per calendar year;\n● 95% of net royalties received for continuing sales above $100,000,000 per calendar year; and\n● 90% of any lump sum up-front payment sub-licensing fees.\nWe also gave Cedoga an option to purchase 200,000 (post-reverse split) shares of our common stock when net sales of the Cedoga IP exceed $100,000,000.\nOn April 19, 2022, we, through DSI, signed an exclusive representative and sublicensing agreement with Lucy Pet Products Inc. (Lucy) pursuant to which Lucy has agreed to manufacture, market and distribute on our behalf pet products created from the Cedoga IP. Lucy paid us a one-time sublicensing fee of $100,000 on the signing of this agreement and will pay us royalties equal to 5% of their Net Revenue, calculated and payable quarterly. Net Revenue, for purposes of our agreement with Lucy, is defined as total revenue less direct cost of materials, manufacturing, packaging and delivery expenses and less excise, sales or similar taxes.\nHistorical Development\nThe Company was incorporated as Alternative Energy & Environmental Solutions, Inc. in the State of Nevada on June 10, 2010, to develop and license an innovative biotechnology for the environmentally friendly and cost-effective extraction of natural gas (coalbed methane) from low-producing, depleted and abandoned coal mines in the U.S. The Company was not successful in developing this business and discontinued its related operations.\nThe Company changed its name in 2014 to Unique Growing Solutions, Inc. and again in 2015 to Point of Care Nano-Technology, Inc.\nOn February 25, 2015, the Company entered into an exclusive worldwide license Agreement (the License Agreement) with Lamina Equities Corporation (Lamina), a private corporation owned by Dr. Raouf Guirguis. The License Agreement related to intellectual property for diagnosing illness in humans via a saliva test. In connection with signing the License Agreement, the Company appointed Dr. Guirguis as its Chief Executive Officer and issued to him 750,000 (post-reverse split) shares of its common stock, $0.0001 par value per share, resulting in a change of control of the Company with Dr. Guirguis becoming the Companys majority stockholder. The Company did not have, however, the financial resources to pursue business development relating to the Lamina license.\nOn April 15, 2021, Dr. Guirguis resigned from all of his positions with the Company appointing Mr. Nicholas DeVito as Chief Executive Officer, Chief Financial Officer, President, Treasurer, Secretary and sole director. In consideration for the services that Mr. DeVito would be providing to the Company, the Company issued to Mr. DeVito 1,000 shares of its super-voting, non-convertible Class A preferred stock. These shares of non-convertible Class A preferred stock vote together with the outstanding shares of the Companys common stock as a single class and represent eighty percent (80%) of all votes entitled to be voted at any annual or special meeting of the Companys shareholders or action by written consent of shareholders. This issuance of the 1,000 shares of Series A non-convertible preferred stock to Mr. Devito constituted a change of control of the Company giving Mr. Devito control of 80% of the voting power of the Company.\nThe Company and Dr. Guirguis entered into a certain assignment and assumption agreement and a separate transfer agreement pursuant to which the Company transferred to DRG Transfer Inc., a Nevada corporation and wholly owned subsidiary of the Company (DRG), all of the legacy assets of the Company as of April 15, 2021, comprised as of that date of the License Agreement and the name of the Company (i.e., Point of Care Nanotechnology, Inc.) and any outstanding debts of the Company generated while Dr. Guirguis operated the Company, measured as of April 15, 2021, which as of that date consisted solely of unknown contingent liabilities (which cannot be identified or quantified at this time and which are expected to be non-material or nil). The Company transferred ownership of DRG to Dr. Guirguis in exchange for the return of 520,000 (post-reverse split) shares of our common stock then held by Dr. Guirguis (The Consideration Shares). Dr. Guirguis has agreed to allow the Company to continue to use its existing name for an indefinite period of time.\nOur Common Stock\nOur common stock is currently quoted on the OTC Markets, Inc. Pink tier under the symbol PCNT. There is currently a limited trading market in our common stock. There can be no assurance that an active trading market in our common stock will ever develop. In the event that an active trading market commences, there can be no assurance as to the market price of our common stock, whether any trading market will provide liquidity to investors, or whether any trading market will be sustained.\nReverse Split\nExecutive Offices\nOur principal executive office is located at 109 Ambersweet Way, Davenport FL, 33897 and our telephone number is (732) 723-7395. Item 1A. Risk Factors\nAn investment in our common stock involves a high degree of risk. Before making an investment decision, you should give careful consideration to the following risk factors, in addition to the other information included in this annual report, including our financial statements and related notes, before deciding whether to invest in shares of our common stock. The occurrence of any of the adverse developments described in the following risk factors could materially and adversely harm our business, financial condition, results of operations or prospects. In that case, the trading price of our common stock could decline, and you may lose all or part of your investment.\nWe have a limited operational history.\nWe have a limited history upon which an evaluation of our prospects and future performance can be made. Our proposed operations are subject to all business risks associated with new enterprises. The likelihood of our success must be considered in light of the problems, expenses, difficulties, complications, and delays frequently encountered in connection with the expansion of a business operation in an emerging industry, and the continued development of advertising, promotions, and a corresponding customer base. There is a possibility that we could sustain losses in the future, and there are no assurances that we will ever operate profitably.\nOur auditors have expressed substantial doubt about our ability to continue as a going concern.\nAs of July 31, 2022 and July 31, 2021, we had minimal cash or cash equivalents and an accumulated deficit of $120,275,882 and $120,212,367, respectively. Our audited financial statements for the years ended July 31, 2022 and 2021 were prepared using the assumption that we will continue our operations as a going concern. Our independent accountants in their audit report have expressed substantial doubt about our ability to continue as a going concern. Our operations are dependent on our ability to raise sufficient capital or complete a business combination as a result of which we become profitable. Our financial statements do not include any adjustments that may result from the outcome of this uncertainty.\nThere is not enough cash on hand to fund our administrative expenses and operating expenses for the next twelve months. Therefore, we may be unable to continue operations in the future as a going concern. If we cannot continue as a viable entity, our stockholders may lose some or all of their investment in our common stock.\nOur operational strategy is changing to be refocused on the Life Sciences space.\nWe expect our business growth to be generated through future acquisitions of life sciences assets. No assurances can be made if any additional acquisitions will be consummated.\nIf we do not generate sufficient cash flow from operations in the future, we may not be able to fund our product development efforts and acquisitions or fulfill our future obligations.\nOur ability to generate sufficient cash flow from operations to fund our operations and business development efforts, including the potential payment of cash consideration in acquisitions and the payment of our other obligations, depends on a range of economic, competitive and business factors, many of which are outside of our control. We cannot assure you that our business will ever generate sufficient cash flow from operations, or that we will be able to raise equity or debt financings when needed or desirable. An inability to fund our operations would have a material adverse effect on our business, financial condition and results of operations. For further information, please refer to Managements Discussion and Analysis of Financial Condition and Results of Operations-Liquidity and Capital Resources below.\nAcquisitions present many risks, and we may not realize the financial and strategic goals we anticipate at the time of an acquisition.\nOur growth is dependent upon our ability to acquire new assets and to introduce new products and services on a timely basis. Acquisitions, including those of high-technology companies, are inherently risky. We cannot provide any assurance that any future acquisitions, if completed, will be successful in helping us reach our financial and strategic goals. The risks we commonly encounter in undertaking, managing and integrating acquisitions are:\n● an uncertain revenue and earnings stream from the acquired company;\n● difficulties and delays integrating the personnel, operations, technologies, products and systems of the acquired companies;\n● the need to implement controls, procedures and policies appropriate for a public company at companies that prior to acquisition had lacked such controls, procedures and policies;\n● difficulties managing or integrating an acquired companys technologies or lines of business;\n● potential difficulties in completing projects associated with purchased in-process research and development;\n● entry into markets in which we have no or limited direct prior experience and where competitors have stronger market positions and which are highly competitive;\n● the potential loss of key employees of the acquired company;\n● potential difficulties integrating acquired products and services into our operational framework;\n● assuming pre-existing contractual relationships of an acquired company that we would not have otherwise entered into, the termination or modification of which may be costly or disruptive to our business;\n● being subject to unfavorable revenue recognition or other accounting treatment as a result of an acquired companys practices; and\n● intellectual property claims or disputes.\nOur failure to manage growth effectively and successfully integrate acquired assets or companies due to these or other factors could have a material adverse effect on our future business, results of operations and financial condition. In addition, we may not have the opportunity to make suitable acquisitions on favorable terms, which could negatively impact the growth of our business. We expect that other companies in our industry will compete with us to acquire compatible assets or businesses. This competition could increase prices for businesses and technologies that we would likely pursue, and our competitors may have greater resources than we do to complete these acquisitions.\nWe will require substantial funding which may not be available to us on acceptable terms, or at all. If we fail to raise the necessary capital, we may be unable to successfully implement our business plans.\nWe intend to acquire assets in the life sciences sector. We will require capital for any such acquisitions and for operating expenses and capital expenditures.\nWe cannot be certain that funding will be available on acceptable terms, or at all. If we are unable to raise capital in sufficient amounts or on terms acceptable to us we may have to significantly delay, scale back or discontinue the development or our business, The inability to raise the required funds would significantly harm our business, financial condition and prospects.\nThe life-sciences industry is highly competitive and subject to rapid technological changes. As a result, we may be unable to compete successfully, which would harm our business.\nThe life-sciences industry is highly competitive and characterized by rapid technological change. We expect to face intense competition from other companies which have resources substantially greater than ours. This competitive disadvantage may make it extremely difficult for us to acquire commercially viable life science assets.\nCOVID 19 or another pandemic could greatly impact our business\nWhile we believe we are emerging from the restrictions of COVID 19, there can be no assurance that we will not be impacted by a resurgence of this virus or another pandemic. Any such events could place substantive restrictions and impact on our life sciences sector focus. In such a situation, we could face closing of borders, restricting of supply chains, closing of enterprises and reductions in new potential life science business opportunities.\nGeneral Economic Risks\nThe Companys current and future business objectives and plan of operation are likely dependent, in large part, on the state of the general economy. Adverse changes in economic conditions may adversely affect the Companys business objective and plan of operation. These conditions and other factors beyond the Companys control include also, but are not limited to regulatory changes.\nRisks Related to Our common stock\nThe Companys shares of common stock are traded from time to time on the OTC Markets, Inc. Pink Tier.\nOur common stock currently trades on the OTC Markets, Inc. Pink tier, although sporadically. There can be no assurance that there will be a liquid trading market for our common stock following a business combination. In the event that a liquid trading market commences, there can be no assurance as to the market price of our common stock, whether any trading market will provide liquidity to investors, or whether any trading market will be sustained.\nThe application of the penny stock rules could adversely affect the market price of our common stock and increase your transaction costs to sell those shares.\nThe SEC adopted Rule 15g-9 which generally defines penny stock to be any equity security that has a market price (as defined) less than $5.00 per share or an exercise price of less than $5.00 per share, subject to certain exceptions. If the trading price of our common stock falls below $5.00 per share, the open-market trading of our common stock is subject to the penny stock rules, which imposes additional sales practice requirements on broker-dealers who sell to persons other than established customers and accredited investors. The term accredited investor refers generally to institutions with assets in excess of $5,000,000 or individuals with a net worth in excess of $1,000,000 or annual income exceeding $200,000 or $300,000 jointly with their spouse. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document in a form prepared by the SEC, which provides information about penny stocks and the nature and level of risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction and monthly account statements showing the market value of each penny stock held in the customers account. The bid and offer quotations, and the broker-dealer and salesperson compensation information, must be given to the customer orally or in writing prior to effecting the transaction and must be given to the customer in writing before or with the customers confirmation. In addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from these rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written agreement to the transaction. These disclosure requirements may have the effect of reducing the level of trading activity in the secondary market for the stock that is subject to these penny stock rules. Consequently, these penny stock rules may affect the ability of broker-dealers to trade our securities. We believe the penny stock rules discourage investor interest in and limit the marketability of our common stock.\nFINRA sales practice requirements may also limit a stockholders ability to buy and sell our common stock.\nIn addition to the penny stock rules described above, FINRA adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nStockholders should have no expectation of any dividends.\nThe holders of our common stock are entitled to receive dividends when, as and if declared by our board of directors out of funds legally available therefore. To date, we have not declared or paid any cash dividends. Our board of directors does not intend to declare any dividends in the foreseeable future, but instead intends to retain all earnings, if any, for use in our business operations.\nOur President and CEO has a no common stock equity interest and a 100% preferred stock equity interest in the Company and thus is in a position to control all actions requiring stockholder vote.\nAlthough our President and CEO, Nicholas DeVito, does not own any of our common stock, his ownership of 100% of our outstanding super-voting preferred stock give him an 80% voting control interest in the Company. This ownership interest gives Mr. DeVito controlling influence over our business, including decisions regarding mergers, consolidations and the sale of all or substantially all of our assets, election of directors and other significant corporate actions. This concentration of ownership may also have the effect of discouraging, delaying or preventing a future change of control. Additionally, we have no present intention to call for an annual meeting of stockholders to elect new directors prior to the consummation of an asset acquisition. As a result, our current sole officer and director will continue in office for the indefinite future. If there is an annual meeting of stockholders for any reason, the Companys management has broad discretion regarding proposals submitted to a vote by shareholders as a consequence of managements controlling equity interest. Accordingly, the Companys management will continue to exert control indefinitely.\nManagement has broad discretion in decision making.\nAny person who invests in the Companys common stock will do so without an opportunity to evaluate the specific merits or risks of any prospective asset acquisition or business combination. As a result, investors will be entirely dependent on the broad discretion and judgment of our management in connection with the selection of a prospective business opportunity. There can be no assurance that determinations made by our management will permit us to achieve the Companys business objectives.\nCertain provisions in our certificate of incorporation and by-laws, and of Nevada law, may prevent or delay an acquisition of our company, which could decrease the trading price of our common stock.\nOur certificate of incorporation, by-laws and Nevada law contain provisions that are intended to deter coercive takeover practices and inadequate takeover bids by making such practices or bids unacceptably expensive to the raider and to encourage prospective acquirers to negotiate with our board of directors rather than to attempt a hostile takeover. These provisions include, among others:\n● the inability of our stockholders to call a special meeting;\n● rules regarding how stockholders may present proposals or nominate directors for election at stockholder meetings;\n● the right of our board to issue preferred stock without stockholder approval;\n● the ability of our directors, and not stockholders, to fill vacancies on our board of directors.\nFuture sales and issuances of our common stock or could result in additional dilution of the percentage ownership of our stockholders and could cause our share price to fall.\nWe expect that significant additional capital will be needed in the future to continue our planned operations. To the extent we raise capital by issuing equity securities, our stockholders may experience substantial dilution. We may sell common stock, convertible securities or other equity securities in one or more transactions at prices and in a manner we determine from time to time. If we sell common stock, convertible securities or other equity securities in more than one transaction, investors may be materially diluted by subsequent sales. Such sales may also result in material dilution to our existing stockholders, and new investors could gain rights superior to our existing stockholders.\nWe may be at risk of securities class action litigation.\nWe may be at risk of securities class action litigation. In the past, life sciences, biotechnology and pharmaceutical companies have experienced significant stock price volatility, particularly when associated with binary events such as clinical trials and product approvals. If we face such litigation, it could result in substantial costs and a diversion of managements attention and resources, which could harm our business and results in a decline in the market price of our common stock.\nRisks Related to Our Common Stock\nManagement identified material weaknesses in our internal controls, and failure to remediate it or any future ineffectiveness of internal controls could have a material adverse effect on the Companys business and the price of its common stock.\nOur management determined that our disclosure controls and procedures and internal controls were ineffective as of July 31, 2022 and 2021 and if they continue to be ineffective could result in material misstatements in our financial statements.\nManagement continues to review our internal control systems, processes and procedures for compliance with the requirements of a smaller reporting company under Section 404 of the Sarbanes-Oxley Act. Such a review resulted in identification of material weaknesses in our internal controls and a conclusion that our disclosure controls and procedures and internal control over financial reporting (ICFR) were ineffective as of the end of the period covered by this Report.\nA material weakness is a deficiency, or a combination of deficiencies, in ICFR, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. We plan to take measures to remediate these deficiencies, such as providing additional training to our accounting staff in US GAAP. However, the implementation of these measures may not fully address the control deficiencies in our ICFR. Our failure to address any control deficiency could result in inaccuracies in our financial statements and could also impair our ability to comply with applicable financial reporting requirements and related regulatory filings on a timely basis. Moreover, effective ICFR is important to prevent fraud. As a result, our business, financial condition, results of operations and prospects, as well as the trading price of our shares, may be negatively impacted by a failure to accurately report financial results.\nThe material weaknesses and other matters impacting the Companys internal controls may cause it to be unable to report its financial information on a timely basis and thereby subject it to adverse regulatory consequences, including sanctions by the SEC or violations of applicable stock exchange or quotation service listing rules. There could also be a negative reaction in the financial markets due to a loss of investor confidence in the Company and the reliability of its financial statements. Confidence in the reliability of the Companys financial statements may suffer due to the Companys reporting of material weaknesses in its internal controls over financial reporting. This could materially adversely affect the Company and lead to a decline in the price of its common stock.\nIf we fail to comply with the rules under the Sarbanes-Oxley Act of 2002 related to disclosure controls and procedures, or, if we discover material weaknesses and other deficiencies in our internal control and accounting procedures, our stock price could decline significantly and raising capital could be more difficult.\nIf we fail to comply with the rules under the Sarbanes-Oxley Act of 2002 related to disclosure controls and procedures, or, if we discover additional material weaknesses and other deficiencies in our internal control and accounting procedures, our stock price could decline significantly and raising capital could be more difficult. Moreover, effective internal controls are necessary for us to produce reliable financial reports and are important to helping prevent financial fraud. If we cannot provide reliable financial reports or prevent fraud, our business and operating results could be harmed, investors could lose confidence in our reported financial information, and the trading price of our common stock could drop significantly. In addition, we cannot be certain that additional material weaknesses or significant deficiencies in our internal controls will not be discovered in the future.\nOur common stock price could continue to be volatile and you could lose the value of your investment.\nOur stock price has been volatile and has fluctuated significantly in the past. The market price of our common stock could continue to be volatile and could fluctuate widely in price in response to various factors, many of which are beyond our control, including: technological innovations or new products and services by us or our competitors; additions or departures of key personnel; sales of our common stock; our ability to integrate operations, technology, products and services; our ability to execute our business plan; operating results below expectations; loss of any strategic relationships; industry developments; economic and other external factors; and period-to-period fluctuations in our financial results. Because we have a very limited operating history with no revenues to date, you may consider any one of these factors to be material. Our stock price may fluctuate widely as a result of any of the above. In addition, the securities markets have from time to time experienced significant price and volume fluctuations that are unrelated to the operating performance of particular companies. These market fluctuations may also materially and adversely affect the market price of our common stock. Your investment in our stock could lose some or all of its value.\nIf securities or industry analysts do not publish research or reports about our business, or if they change their recommendations regarding our stock adversely, our stock price and trading volume could decline.\nThe trading market for our common stock will be influenced by the research and reports that industry or securities analysts publish about us or our business. We do not currently have and may never obtain research coverage by industry or financial analysts. If no or few analysts commence coverage of us, the trading price of our stock would likely decrease. Even if we do obtain analyst coverage, if one or more of the analysts who cover us downgrade our stock, our stock price would likely decline. If one or more of these analysts cease coverage of our company or fail to regularly publish reports on us, we could lose visibility in the financial markets, which in turn could cause our stock price or trading volume to decline Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nThe Company does not own or rent any properties. Our mailing address is a post-office box located at 109 Ambersweet Way, Davenport, FL 33897 and our telephone number is (732) 723-7395. We are currently conducting our business operations out of the residence of our CEO, Mr. DeVito, at no charge to us. Item 3. Legal Proceedings\nWe know of no material, active or pending legal proceedings against our Company, nor are we involved as a plaintiff in any material proceeding or pending litigation. There are no proceedings in which any of our directors, officers or affiliates, or any registered or beneficial shareholder, is an adverse party or has a material interest adverse to our interest. Item 4. Mine Safety Disclosure\nNot applicable.\nPART II Item 5. Market for Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur Common Stock is quoted on the OTC Markets, Inc. Pink tier under the symbol PCNT. Any over-the-counter market quotations on the OTCs Pink tier reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nDescription of Our Common Stock\nWe are authorized to issue 100,000,000 shares, par value $0.0001 per share, of common stock, of which 940,621 (post-reverse split) shares were issued and outstanding as of October 25, 2022. Holders of common stock are entitled to one vote per share on each matter submitted to a vote at any meeting of stockholders. Shares of common stock do not carry cumulative voting rights and, therefore, holders of a majority of the outstanding shares of common stock will be able to elect the entire Board of Directors, and, if they do so, minority stockholders would not be able to elect any members to the Board of Directors. Our Board of Directors has authority, without action by the stockholders, to issue all or any portion of the authorized but unissued shares of common stock, which would reduce the percentage ownership of the stockholders and which may dilute the book value of the common stock. Stockholders have no pre-emptive rights to acquire additional shares of common stock. The common stock is not subject to redemption and carries no subscription or conversion rights. In the event of liquidation, the shares of common stock are entitled to share equally in corporate assets after satisfaction of all liabilities. The shares of common stock, when issued, will be fully paid and non-assessable.\nHolders of common stock are entitled to receive dividends as our board of directors may from time to time declare out of funds legally available for the payment of dividends. We have not paid dividends on common stock and do not anticipate that we will pay dividends in the foreseeable future.\nAll shares of common stock now outstanding are duly authorized, fully paid and non-assessable.\nPreferred Stock\nWe are authorized to issue up to 10,000,000 blank check shares of preferred stock, par value $0.0001 per share, with all designations, rights and privileges as our board of directors may decide, from time to time, without stockholder approval. As of October 25, 2022, there are 1,000 shares of our preferred stock issued or outstanding.\nOn April 14, 2021, our board of directors agreed to create, and issued, 1,000 shares of series A non-convertible preferred stock to Nicholas P. DeVito. The series A non-convertible preferred stock was designated to carry voting rights equal to eighty percent (80%) of all of the votes entitled to be voted at any annual or special meeting of the shareholders of the Company or action by written consent of the shareholders.\nTransfer Agent\nOur transfer agent is Vstock Transfer, LLC, located at 18 Lafayette Pl, Woodmere, NY 11598, telephone: (212) 828-8436.\nHolders\nAs of October 25, 2022, we had 37 record holders of our common stock (not including beneficial owners who hold shares at broker/dealers in street name).\nDividend Policy\nWhile there are no restrictions that limit our ability to pay dividends, we have not paid, and do not currently intend to pay cash dividends on our common stock in the foreseeable future. Our policy is to retain all earnings, if any, to provide funds for the operation and expansion of our business. The declaration of dividends, if any, will be subject to the discretion of our Board of Directors, which may consider such factors as our results of operations, financial condition, capital needs and acquisition strategy, among others.\nIssuer Purchases of Equity Securities\nNone Item 6. Selected Financial Data.\nNot applicable Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis should be read in conjunction with our audited financial statements and the notes to those financial statements that are included elsewhere in this Form 10-K. Our discussion includes forward-looking statements based upon current expectations that involve risks and uncertainties, such as our plans, objectives, expectations and intentions. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of a number of factors, including those set forth under the Risk Factors, Cautionary Notice Regarding Forward-Looking Statements and Description of Business sections and elsewhere in this annual report. We use words such as anticipate, estimate, plan, project, continuing, ongoing, expect, believe, intend, may, will, should, could, predict, and similar expressions to identify forward-looking statements. Although we believe the expectations expressed in these forward-looking statements are based on reasonable assumptions within the bound of our knowledge of our business, our actual results could differ materially from those discussed in these statements. Factors that could contribute to such differences include, but are not limited to, those discussed in the Risk Factors section of this annual report. We undertake no obligation to update publicly any forward-looking statements for any reason even if new information becomes available or other events occur in the future. Except as required by applicable law, including the securities laws of the United States, we do not intend to update any of the forward-looking statements to conform these statements to actual results. Readers are urged to carefully review and consider the various disclosures made throughout the entirety of this annual report, which attempt to advise interested parties of the risks and factors that may affect our business, financial condition, results of operations, and prospects.\nOverview\nThe Company was incorporated as Alternative Energy & Environmental Solutions, Inc. in the State of Nevada on June 10, 2010, to develop and license an innovative biotechnology for the environmentally friendly and cost-effective extraction of natural gas (coalbed methane) from low-producing, depleted and abandoned coal mines in the U.S. The Company was not successful in developing this business and discontinued its biotechnology related operations. The Company changed its name in 2014 to Unique Growing Solutions, Inc. and again in 2015 to Point of Care Nano-Technology, Inc.\nOn February 25, 2015, the Company entered into the License Agreement with Lamina relating to intellectual property for diagnosing illness in humans via a saliva test. During the past few years, the Company did not have the financial resources to pursue business development relating to the Lamina license and this business was discontinued and split off.\nThe Companys plan of operation over the next 12 months is to seek and acquire new business assets in the life sciences industry and begin operations with these new assets. To that end, on April 11, 2022, we, through our newly established, wholly owned subsidiary, DSI, acquired an exclusive license from Cedoga to distribute in the USA, Canada and Mexico, certain intellectual property of Cedoga relating to animal nutrition and animal supplements. On April 19, 2022, we, through DSI, signed an exclusive representative and sublicensing agreement with Lucy Pet Products Inc. pursuant to which Lucy has agreed to manufacture, market and distribute on our behalf pet products created from the Cedoga IP. There can be no assurance that we will be successful marketing the Cedoga IP or that Lucy or other sublicensees of the Cedoga IP will be successful in their business development efforts.\nAdditionally, we can make no guarantees that we will be successful in achieving any of our new operational objectives.\nResults of Operations\nFiscal Year ended July 31, 2022 compared to the Fiscal Year ended July 30, 2021\nRevenues\nFor the year ended July 31, 2022, we generated $100,000 of revenue from product licenses as compared to $0 revenue of any kind for year ending July 31, 2021.\nCost of Goods Sold\nFor the years ended July 31, 2022 and July 31, 2021, we did not incur any cost of goods sold expenses from product licenses, maintenance, services or other expenses.\nOperating Expenses\nFor the year ended July 31, 2022, we incurred $90,000 of operating expenses from product licenses, and for the year ending July 31, 2021, we did not incur any operating expenses from product licenses. We incurred administrative expenses of $73,515 for the year ended July 31, 2022 and $7,500 for the year ended July 31, 2021.\nNet Other Income (Expense)\nFor the years ended July 31, 2021 and July 31, 2020, we did not receive any income or incur any expense from other sources.\nLiquidity & Capital Resources\nAt July 31, 2022, we had $3,198 in cash, compared to $0 at July 31, 2021. At July 31, 2022, our accumulated stockholders deficit was $120,275,882 compared to $120,212,367 at July 31, 2021. There is substantial doubt as to our ability to continue as a going concern.\nWe have had no net positive cash flow for the two years ended July 31, 2022 and 2021. In the future, our cash flow will depend on the timely and successful market entry of our expected strategic offerings and our ability to raise capital.\nThere were no equity transactions in the fiscal year ended July 31, 2021. In 2022, we received into treasury 520,000 shares of common stock in connection with our settlement agreement with the previous director. We are required to issue 300,000 (post-reverse split) shares of our common stock for acquiring a license agreement.\nEspecially for strategic offerings for paradigm shifting technologies, our managements budget plan is based on a series of assumptions regarding the amount of capital needed to pursue regulatory approval, market acceptance, readiness and pricing for any new life science product we may acquire. While managements assumptions are based on market research, assumptions bear the risk of being incorrect and may result in a delay in projects, delays in regulatory approvals and consequently a delay or a reduction in the related strategic offerings. In case these delays have an impact on our liquidity and therefore our ability to support our operations with the necessary cash flow, we expect to depend on our ability to generate cash flow from other resources, such as debt financing from related or independent resources or as equity financing from existing stockholders or through the stock market. There can be no assurances, however, that we will be successful in raising required funding on terms acceptable to us, if at all.\nWe issued 1,000 shares of series A non-convertible preferred stock to Mr. Nicholas DeVito on August 2, 2021 that gives him 80% voting control of the company.\nPlan of Operations\nDuring the remainder of our fiscal year ending July 31, 2023, we will seek to acquire additional strategic assets in the life sciences space. We will need to seek external sources of capital for financing future projects. These sources may also provide the necessary funds to support our ongoing working capital needs. There can be no assurances, however, that we will be able to obtain additional funds or that such funds will be sufficient to permit us to successfully implement our intended business strategy. In the event we are not able to raise funds, our management will have to postpone the acquisition of any new assets until the required financing becomes available. Additionally, our management believes we will need to raise money to support our standard operations for the remainder of the current fiscal year ending July 31, 2023.\nOur cash balance as reported in our financial statements is not sufficient to fund our growth plan for any period of time. In order to fully implement our plan of operations for the next 12-month period, we will need to raise a significant amount of capital through future offerings. After the next 12-month period, we most likely will need to raise additional financing as well. The discussion below is based on the assumption that we will be able to raise significant capital in the remainder of our fiscal year ending July 31, 2023. We do not currently have any arrangements for any such financing and there can be no assurances that we will be able to raise the required capital on acceptable terms, if at all.\nWe have generated minimal revenues to date and, although we expect to raise significant capital in the future, there can be no assurances that we will be successful in these endeavors. We believe that the actions presently being taken to further implement our business plan and generate revenues will provide the opportunity for us to develop into a successful business operation.\nWe can provide no assurances, however, that we will be able to successfully acquire additional assets or raise sufficient funds in the next six months or longer to continue to execute our plans, to reach or to develop, offer and generate revenues from any of our designated business activities and development actions. Also, we cannot assure you that we will be able to raise additional capital or debt as and when needed on acceptable terms if at all.\nAdditional Cash Requirements\nWe expect to incur additional administrative expenses during the next 12 months. We estimate that we will need the following amounts during the next 12 months to cover the indicated administrative expenses:\nCategory Estimated\nAmount\nLegal 50,000\nAccounting 50,000\nOTC Listing Fees 10,000\nTravel 5,000\nMiscellaneous 5,000\nTOTAL $ 120,000\nThis capital will be used to build out our corporate infrastructure, to provide for the payment of advisory and accounting services, legal, and anticipated up-listing fees for the OTC Markets, Inc. QB tier. However, there can be no assurance that we will qualify for uplisting to the OTC QB tier or that our application to the OTC QB will be approved. The table above does not include a line item for funds required to acquire or develop life science assets. Any such funds will be in amounts in addition to those listed in the table.\nRequired funds may be raised through equity financing, debt financing, or other sources, which may result in further dilution in the equity ownership of our shares. There is no assurance that we will be able to generate operations at a level sufficient for an investor to obtain a return on their investment in our common stock, or that we will be able to raise sufficient capital required to implement our business plan on acceptable terms, if at all. Even if we are successful in raising sufficient capital to implement our business plan, we may continue to be unprofitable.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States of America, the more significant of which are as follows:\nConsolidation\nThe accompanying consolidated financial statement include the accounts of the Company and its wholly owned subsidiary Duo Sciences Inc. (DSI)\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of financial statements and the reported amounts of revenues and expenses during the reporting period. Changes in estimates are recognized in accordance with the accounting rules for the estimate, which is typically in the period when new information becomes available to management. Actual results could differ from those estimates.\nFinancial Instruments\nFinancial instruments consist of cash and accounts payable and accrued liabilities. The carrying amounts of the financial instruments approximate their fair values due to their relatively short-term nature of the underlying terms are consistent with market terms. As of the financial statement date, the Company does not hold any derivate financial instruments. Financial assets and liabilities are measured upon first recognition and reviewed at the financial statement date. Changes in fair value are recognized through profit and loss. Unless otherwise noted, it is managements opinion that the Company is not exposed to significant interest or credit risks arising from these financial instruments.\nFair Value Measurements\nThe Company follows FASB Codification topic (ASC) 820, Fair Value Measurements and Disclosures, for all financial instruments and non-financial instruments accounted for at fair value on a recurring basis. This new accounting standard establishes a single definition of fair value and a framework for measuring fair value, sets out a fair value hierarchy to be used to classify the source of information used in fair value measurement and expands disclosures about fair value measurements required under other accounting pronouncements. It does not change existing guidance as to whether or not an instrument is carried at fair value. The Company defines fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities, which are required to be recorded at fair value, the Company considers the principal or most advantageous market in which the Company would transact and the market-based risk measurements or assumptions that market participants would use in pricing the asset or liability, such as inherent risk, transfer restrictions and credit risk.\nThe Company has adopted FASB ASC 825, Financial Instruments, which allows companies to choose to measure eligible financial instruments and certain other items at fair value that are not required to be measured at fair value. The Company has not elected the fair value option for any eligible financial instruments.\nAn asset or liabilitys level within the fair value hierarchy is based on the lowest level of any input that is significant to the fair value measurement. Availability of observable inputs can vary and is affected by a variety of factors. The Company uses judgment in determining fair value of assets and liabilities, and Level 3 assets and liabilities involve greater judgment than Level 1 and Level 2 assets or liabilities.\nIncome Taxes\nThe Company accounts for income taxes under FASB ASC Topic 740, Income Taxes (ASC Topic 740). Under ASC Topic 740, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Under ASC 740-10-25, the effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized. As the Company has yet to produce positive cash flows from operations, no deferred tax asset or income taxes have been recorded in the financial statements.\nComprehensive Income (Loss)\nThe Company adopted FASB ASC 220, Reporting Comprehensive Income, which establishes standards for the reporting and display of comprehensive income and its components in the financial statements. Comprehensive income consists of net income and other gains and losses affecting stockholders equity that are excluded from net income, such as unrealized gains and losses on investments available for sale, foreign currency translation gains and losses and minimum pension liability. Since inception, the Company has not had any comprehensive income / loss.\nNet Income (Loss) per Common Share\nFASB ASC 260, Earnings per share, requires dual presentation of basic and diluted earnings per share (EPS) with a reconciliation of the numerator and denominator of the EPS computations. Basic earnings per share amounts are based on the weighted average shares of common stock outstanding. If applicable, diluted earnings per share would assume the conversion, exercise or issuance of all potential common stock instruments such as options, warrants and convertible securities, unless the effect is to reduce a loss or increase earnings per share. Diluted net income (loss) per share on the potential exercise of the equity-based financial instruments is not presented where anti-dilutive. Accordingly, although the diluted weighted average number of common stock outstanding is disclosed on the statements of operation, the calculated net loss per share is the same for bother basic and diluted as both are based on the basic weighted average of common stock outstanding. There were no adjustments required to net income for the period presented in the computation of diluted earnings per share.\nSegment Reporting\nFASB ASC 820, Segments Reporting, establishes standards for reporting information about operating segments on a basis consistent with the Companys internal organization structure as well as information about geographical areas, business segments and major customers in financial statements. The Company currently operates in one principal business segment.\nIntangible assets\nIntangible asset are non-monetary identifiable assets, controlled by the Company that will produce future economic benefits, based on reasonable and supportable assumptions about conditions that will exist over the life of the asset. An intangible asset that does not meet these attributes will be recognized as an expense when it is incurred. Intangible assets that do, are capitalized and initially measure at cost. Those with a determinable life will be amortized on a systematic basis over their future economic life. Those with an indefinite useful life shall not be amortized until its useful life is determined to be longer than indefinite. An intangible asset subject to amortization shall be periodically reviewed for impairment. A recoverability test will be performed and, if applicable, unscheduled amortization is considered.\nThe license agreements has been capitalized, recorded at cost and amortized over its estimated useful life of ten years. Amortization has been determined based on a pro rata basis over the expected cash flows.\nNon-cash transactions\nThe Company follows FASB ASC 845 then recording non-cash transactions. The value of the asset received should be based on the value of the assets surrendered. However, where that value is difficult to determine, then the value could be based on the asset received, provided it is more clearly evident than the value of the asset surrendered.\nRelated Parties\nThe Company adopted FASB ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions.\nRecent Accounting Pronouncements\nThe Company adopts new pronouncements relating to generally accepted accounting principles applicable to the Company as they are issued, which may be in advance of their effective date. The Company does not expect the adoption of recently issued accounting pronouncements to have a significant impact on the Companys results of operations, financial position, or cash flow.\nThe financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States of America, the more significant of which are as follows: Item 7A. Quantitative and Qualitative Disclosure about Market Risk.\nNor applicable Item 8. Financial Statements and Supplementary Data\nOur audited financial statements and related financial statement schedule, together with the report of independent registered public accounting firm, appear at pages through of this Annual Report on Form 10-K for the year ended July 31, 2022. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs of July 31, 2022, our management, with the participation of our Chief Executive Officer (principal executive officer) and Chief Financial Officer (principal financial and accounting officer), Mr. Nicholas P. DeVito, evaluated the effectiveness of our disclosure controls and procedures pursuant to Rule 13a-15(b) promulgated under the Securities Exchange Act. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of July 31, 2022, our disclosure controls and procedures were not effective in ensuring that the information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms, including ensuring that such material information is accumulated and communicated to our management, including our Chief Executive Officer and our Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nManagements Annual Report on Internal Control over Financial Reporting (ICFR)\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (ICFR), as such term is defined in Rule 13a-15(f) of the Exchange Act. ICFR refers to the process designed by, or under the supervision of, our Interim Chief Executive Officer and Chief Financial Officer, and effected by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles (GAAP), and includes those policies and procedures that:\n(i) Pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n(ii) Provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n(iii) Provide reasonable assurance regarding prevention or timely detection of an unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, ICFR may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nA material weakness is a deficiency, or a combination of deficiencies, in ICFR, such that there is a reasonable possibility that a material misstatement of annual or interim financial statements will not be prevented or detected on a timely basis.\nManagement has evaluated the effectiveness of the Companys ICFR as of July 31, 2022. Management based its assessment on the framework set forth in COSOs Internal Control - Integrated Framework (1992) in conjunction with SEC Release No. 33-8810 entitled Commission Guidance Regarding Managements Report on Internal Control Over Financial Reporting Under Section 13(a) or 15(d) of the Securities and Exchange Commission (17 CFR PART 241; Effective June 27, 2007).\nBecause of the material weaknesses described below, management concluded that the Companys ICFR was not effective as of July 31, 2022:\n● The Companys lack of sufficient accounting personnel with the requisite knowledge of GAAP and the financial reporting requirements of the SEC.\n● Lack of segregation of duties of internal accounting and SEC reporting departments.\nWe plan to take measures to remediate these deficiencies, such as hiring additional qualified personnel and providing additional training to our accounting staff in US GAAP. However, the implementation of these measures may not fully address the control deficiencies in our ICFR. Our failure to address any control deficiency could result in inaccuracies in our financial statements and could also impair our ability to comply with applicable financial reporting requirements and related regulatory filings on a timely basis. Moreover, effective ICFR is important to prevent fraud. As a result, our business, financial condition, results of operations and prospects, as well as the trading price of our shares, may be negatively impacted by a failure to accurately report financial results.\nThe material weaknesses and other matters impacting the Companys internal controls may cause it to be unable to report its financial information on a timely basis and thereby subject it to adverse regulatory consequences, including sanctions by the SEC or violations of applicable stock exchange or quotation service listing rules. There could also be a negative reaction in the financial markets due to a loss of investor confidence in the Company and the reliability of its financial statements. Confidence in the reliability of the Companys financial statements may suffer due to the Companys reporting of material weaknesses in its internal controls over financial reporting. This could materially adversely affect the Company and lead to a decline in the price of its common stock.\nChanges in Internal Control Over Financial Reporting (ICFR)\nDuring the fourth quarter ended July 31, 2022, there were no changes in our ICFR that have materially affected, or are reasonably likely to materially affect, our ICFR.\nThis annual report does not include an attestation report of our registered public accounting firm regarding ICFR. Managements report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only managements report in this annual report. Item 9B. Other Information.\nSubsequent Events:\nOn August 24, 2022, We completed a financing with an investor for $10,000 in exchange for Units consisting of (i) one share of our common stock for $0.10 per share, (ii) one option to purchase one share of our common stock for $0.20 per share upon our signing of a letter of intent with a third party and (iii) one option to purchase one share of our common Stock for $0.30 per share upon our signing of an agreement with a third party.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe table below sets forth the names, title and ages of our current directors and executive officers. Directors hold office until the next annual meeting of the stockholders or until their successors have been elected and qualified. Executive officers serve at the pleasure of our board of directors and may be removed with or without cause at any time, subject to contractual obligations between our executive officer and the Company, if any.\nName Age Position and Offices Held Director Since\nNicholas DeVito Chief Executive Officer, Chief Financial Officer, President, Treasurer, Secretary and Director April 15, 2021\nBusiness Experience:\nNicholas P. DeVito. Mr. DeVito has 35 years of experience in finance, engineering and operations in a variety of industries including oil & gas, telecommunications, alternative energy, manufacturing and consumer products. He is currently serving as Senior Director of Accounts at Synchronoss Technologies where he has held that position since 2016. Mr. DeVito has served as Chief Executive Officer (2018) and Interim Chief Executive Officer (2019 to 2020)) of Marizyme, Inc. (OTCQB: MRZM). From May 7, 2018 until his resignation from this position on September 12, 2018, he served on the Marizyme board of directors as Chairman. From December 2009 to December 2013, he served as Chief Operating Officer of Xtreme Oil & Gas Inc. (OTC: XTOG), successfully reorganizing that company and completing the public filings to enable the company to begin public trading. Mr. DeVito has served as VP of Business Development for Tellium, Inc., now known as DZS Inc. (NASDAQ: ZHNE), a telecommunications equipment manufacturer that sold optical switching products and completed an IPO in 2001. Mr. DeVito has provided operations and sales consulting services to several public and private companies. He was employed at AT&T and Bell Laboratories from June 1985 to August 1998. He has a BSEE and MSEE from Columbia University and an MBA in Management from New York University. Mr. DeVito has not held any other public company director positions in the past five years.\nKey Attributes, Experience and Skills: Mr. DeVito brings his financial, operational and acquisitions experience to the Board along with his leadership and investor relations skills. He has the ability to establish a vision and manage the execution of business plans and growth goals, creating value for stockholders, and achieving successful exits.\nFamily Relationships\nThere are no family relationships between or among any of our current directors, executive officers or persons nominated or charged by the Company to become directors or executive officers. There are no family relationships among our executive officers and directors and the executive officers and directors of our direct and indirect subsidiaries.\nInvolvement in Certain Legal Proceedings\nNone of the directors or executive officers has, during the past ten years:\n(a) Had any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n(b) Been convicted in a criminal proceeding or subject to a pending criminal proceeding;\n(c) Been subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities, futures, commodities or banking activities; or\n(d) Been found by a court of competent jurisdiction (in a civil action), the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\nCode of Conduct\nWe have not adopted a Code of Conduct.\nChanges in Officers and Directors\nMr. DeVito was appointed the Chairman of our board of directors on April 15, 2022 and Chief Executive Officer, President, Secretary and Treasurer on April 15, 2021 to fill the vacancies created by the resignation of Dr. Raouf Guirguis from these positions.\nCompliance with Section 16(a) of the Securities Exchange Act of 1934\nSection 16(a) of the Exchange Act requires our executive officers and directors and persons who own more than 10% of a registered class of our equity securities to file with the SEC initial statements of beneficial ownership, reports of changes in ownership and annual reports concerning their ownership of our Common Stock and other equity securities, on Forms 3, 4 and 5 respectively. Executive officers, directors and greater than 10% shareholders are required by the SEC regulations to furnish us with copies of all Section 16(a) reports that they file.\nBased solely on our review, our sole officer and director failed to file his Section 16(a) forms on a timely basis in 2022. Item 11. Executive Compensation\nEXECUTIVE COMPENSATION\nThe following table sets forth all plan and non-plan compensation for the last two completed fiscal years paid to all individuals who served as the Companys principal executive officer or acting in similar capacity during the last completed fiscal year, regardless of compensation level, and other individuals as required by Item 402(m)(2) of Regulation S-K. We refer to all of these individuals collectively as our named executive officers.\nSUMMARY COMPENSATION TABLE\nYear Ended Salary and Fees Bonus Total\nName and Principal Position July 31, ($) ($) ($)\nDr. Raouf Guirguis\n--Former Chairman and CEO (1) - - -\nNicholas P. DeVito\n--Chairman and CEO (2) - - -\n- - -\n(1) Resigned from all positions with the Company on April 15, 2021\n(2) Appointed as of April 15, 2021.\nOutstanding Equity Awards at Fiscal Year-End\nAs of July 31, 2022, no stock, stock options, or other equity securities were awarded to our named executive officers.\nEmployment Agreements, Termination of Employment and Change-in-Control Arrangements with our Executive Officers\nOur sole executive officer, Nicholas DeVito, does not have a compensation agreement with us.\nCompensation of Directors\nNone of our directors was compensated for services in 2021 or 2022.\nDirector Agreements\nGeneral\nOur directors may receive equity in the form of options at fair market value for their service on our board of directors. We do not intend to pay cash compensation to directors.\nTerm of Office\nEach of our directors is elected to hold office for a one-year term or until his successor is elected and qualified. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth certain information regarding our common stock beneficially owned as of October 25, 2022, for (i) each stockholder known to be the beneficial owner of 5% or more of our outstanding voting common stock and our voting series A non-convertible preferred stock, (ii) each executive officer and director, and (iii) all executive officers and directors as a group. In general, a person is deemed to be a beneficial owner of a security if that person has or shares the power to vote or direct the voting of such security, or the power to dispose or to direct the disposition of such security. A person is also deemed to be a beneficial owner of any securities of which the person has the right to acquire beneficial ownership within 60 days. Shares of common stock subject to options, warrants or convertible securities exercisable or convertible within 60 days are deemed outstanding for computing the percentage of the person or entity holding such options, warrants or convertible securities but are not deemed outstanding for computing the percentage of any other person. Percentages are determined based on 940,621 shares of common stock of the Company issued and outstanding as of October 25, 2022. To the best of our knowledge, subject to community and marital property laws, all persons named have sole voting and investment power with respect to such shares, except as otherwise noted.\nName and Address of\nBeneficial Owner (1) Common Stock Series A Non-Convertible Preferred Stock\nAmount and Nature\nof Beneficial\nOwnership Percent of Class\nBeneficially Owned\n(2) Amount and Nature\nof Beneficial\nOwnership Percent of Class\nBeneficially Owned\n(3)\nOfficers and Directors\nNicholas DeVito\n-Chief Executive Officer, Chief Financial Officer, President, Treasurer and Secretary 0% 1,000 100%\nAll Officers and Directors as a group (1 persons) 0% 1,000 100%\n5% Stockholders\nDr. Raouf Guirguis (4)\n10202 Sherman Heights Place\nColumbia, MD 21044-5416 50,000 5.3% - -\n(1) Unless otherwise indicated, the address of the named beneficial owner is c/o Point of Care Nano-Technology, Inc. 109 Ambersweet Way, Davenport, FL 33897.\n(2) Based on 940,621 shares of our common stock outstanding as of October 25, 2022.\n(3) Based on 1,000 shares of series A non-convertible preferred stock outstanding as of October 25, 2022.\n(4) Dr. Guirguis controls 50,000 shares of our common stock indirectly via his wifes ownership of those shares. Item 13. Certain Relationships and Related Transactions, and Director Independence\nCertain Relationships and Related Transactions\nNone, during the fiscal years ended July 31, 2021, and 2022.\nIndependent Directors\nNone Item 14. Principal Accounting Fees and Services\nK. R. Margetson Ltd., Chartered Accountant (K.R. Margetson) is the Companys independent public accountant who has audited the fiscal years ended July 31, 2021 and July 31, 2022. The aggregate fees billed for the two most recently completed fiscal years ended July 31, 2021 and July 31, 2022 for professional services rendered by K.R. Margetson were as follows:\nAudit Fees and Audit Related Fees $ 6,000 $ 7,470\nTax Fees -\nAll Other Fees -\nTotal $ 6,000 $ 7,470\nPolicy on Pre-Approval by the Board of Services Performed by Independent Auditors\nOur board of directors pre-approves all services provided by our independent auditors. All of the above services and fees were reviewed and approved by our board of directors either before or after the respective services were rendered.\nPART IV Item 15. Exhibits, Financial Statement Schedules\nExhibit\nIncorporated by Reference\nFiled or\nFurnished\nNumber\nExhibit Description\nForm\nExhibit\nFiling Date\nHerewith\n3.1\nArticles of Incorporation,\nS-1\n3.1\n10/25/2010\n3.2\nAmendment to Articles of Incorporation, dated August 28, 2014.\n8-K\n3.1\n10/30/2014\n3.3\nAmendment to Articles of Incorporation, dated March 31, 2015.\n8-K\n3.1\n04/08/2015\n3.4\nCertificate of Amendment by Custodian dated July 1, 2020\n10-12g\n3.4\n10/15/2021\n3.5\nCertificate of Designation of the Series A Non-Convertible Preferred Stock\n10-12g\n3.5\n10/15/2021\n3.6\nBylaws.\nS-1\n3.2\n10/25/2010\n10.1\nLicense Agreement with Lamina Equities Corporation, dated February 25, 2015.\n8-K\n10.1\n02/27/2015\n10.2\nStipulation and Order Approving Yosef Yafe to be Substituted as Custodian, dated February 17, 2020\n10-12g\n10.2\n10/15/2021\n10.3\nSeparation and Release of Claims Agreement by and between Point of Care Nano-Technology, Inc. and Dr. Raouf Guirguis dated April 15, 2021\n10-12g\n10.3\n10/15/2021\n10.4\nSeparation and Release of Claims Agreement by and between Point of Care Nano-Technology, Inc. and Ayman El-Salhy dated April 15, 2021\n10-12g\n10.4\n10/15/2021\n10.5\nAssignment and Assumption Agreement by and between Point of Care Nano-Technology, Inc. and Dr. Raouf Guirguis dated April 15, 2021\n10-12g\n10.5\n10/15/2021\n10.6\nSettlement Agreement dated May 9, 2021 by and among Yosef Yafe, Ayman El Salhya and Point of Care Nano-Technology, Inc.\n10-12g\n10.6\n10/15/2021\n10.7\nVoluntary Dismissal of the Application for Appointment of Custodian, dated May 14, 2021\n10-12g\n10.7\n10/15/2021\n10.8\nLicense Assignment Agreement by and among Point of Care Nano-Technology, Inc., DRG Transfer, Inc. and Dr. Raouf Guirguis dated as of March 23, 2022\n8-K\n10.2\n4/14/2022\n10.9\nAgreement of Conveyance Transfer and Assignment by and among Point of Care Nano-Technology, Inc., DRG Transfer, Inc. and Dr. Raouf Guirguis dated as of March 23, 2022\n8-K\n10.3\n4/14/2022\n10.10\nLicensing and Distribution Agreement dated as of April 10, 2022 by and between Point of Care Nano-Technology, Inc. and Cedoga Consulting LLC\n8-K\n10.4\n4/14/2022\n10.11\nExclusive Representative and License Agreement between Duo Sciences Inc. and Lucy Pet Products Inc.\n10-Q\n10.1\n6/14/2022\n31.1/31.2\nCertifications of Principal Executive Officer and Principal Financial and Accounting Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n32.1/32.2\nCertification of Principal Executive Officer and Principal Financial and Accounting Officer Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because XBRL tags are embedded within the Inline XBRL document.\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nX\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nX\nSIGNATURES\nPursuant to the requirements of Section 12 of the Securities Exchange Act of 1934, the registrant has duly caused this registration statement to be signed on its behalf by the undersigned, thereunto duly authorized.\nPoint of Care Nano-Technology, Inc.\nBy: /s/ Nicholas DeVito\nNicholas DeVito\nChief Executive Officer and Director\n(Principal Executive Officer)\n(Principal Financial and Accounting Officer)\nDate: October 25, 2022\nFinancial Pages Contents\nAUDITED FINANCIAL STATEMENTS JULY 30, 2021 AND 2020\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nCONSOLIDATED BALANCE SHEETS\nCONSOLIDATED STATEMENTS OF OPERATIONS\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nK. R. MARGETSON LTD. Chartered Professional Accountant\nEast 5th Street Tel: 604.220.7704\nNorth Vancouver BC V7L 1M1 Fax: 1.855.603.3228\nCanada\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of\nPoint of Care Nano-Technology, Inc.:\nOpinion on the financial statements\nI have audited the accompanying consolidated balance sheets of Point of Care Nano-Technology, Inc. as of July 31, 2022 and 2021 and the related consolidated statements of operations, stockholders deficit and cash flows for each of the two years then ended and the related notes (collectively referred to as the financial statements). In my opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as at July 31, 2022 and 2021 and the consolidated results of its operations and its cash flows for each of the two years in the period ended July 31, 2022 in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared using accounting principles generally accepted in the United States of America assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has incurred operating losses since inception, which raises substantial doubt about its ability to continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. My responsibility is to express an opinion on these financial statements based on my audits. My company is a public accounting firm registered with the Public Company Accounting Oversight Board (PCAOB) and is required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the SEC and the PCAOB.\nI conducted my audits in accordance with the standards of the PCAOB. Those standards require that I plan and perform an audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor was I engaged to perform, an audit of its internal control over financial reporting. As part of my audits I am required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, I express no such opinion.\nMy audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining on a test basis, evidence regarding the amounts and disclosures in the financial statements. My audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall financial statement presentation. I believe that my audits provide a reasonable basis for my opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: ( 1) relate to accounts or disclosures that are material to the financial statements and (2) involve especially challenging, subjective, or complex judgements. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and I am not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nAs described in Note 7 of the financial statements, the license was obtained by an obligation to issue 300,000 common shares. The determination of the fair value of the transaction included various factors.\nI identified the determination of fair value as a critical audit matter. The Companys determination was subjective. Specifically, there was a high degree of subjective auditor judgment in evaluating how the Company determined (1) whether the value of the shares given up or the asset received was more easily determined, (2) what the estimated cash flows from the license would be, (3) how long would the asset produce positive cash flows, and (4) what would be a reasonable discount rate to reflect the uncertainty of the projections.\nAddressing the matter involved performing procedures and evaluation audit evidence in connection forming my overall opinion on the financial statements. These procedures include the following among others: (1) Examining the market value and volume of sales of the Companys shares; (2) reviewing market analysis for the Companys industry, (3) analyzing the Companys current results, (3) preparing my own analysis by using experience gained in retroactive review of discounting cash flows from similar situations.\n/s/ K. R. Margetson Ltd\nChartered Professional Accountant\nI have served as the Companys auditor since 2021\nVancouver, Canada\nOctober 24, 2022\nPCAOB ID: 1212\nPOINT OF CARE NANO-TECHNOLOGY, INC.\nCONSOLIDATED BALANCE SHEETS\nAs of July 31, 2022 and July 31, 2021\nJuly 31 July 31\nASSETS\nCurrent Assets\nCash $ 3,198 $ -\nPrepaid expense 2,917 -\nCurrent Assets 6,115 -\nIntangible asset - license (Note 7) 123,466 -\nTotal Assets $ 129,581 $ -\nLIABILITIES AND SHAREHOLDERS DEFICIT\nCurrent Liabilities\nAccounts payable and accrued charges $ 213,335 $ 20,240\nTotal Liabilities 213,335 20,240\nStockholders Deficit\nPreferred stock, par value $0.0001,(Note 5)\n10,000,000 shares authorized;\n1,000 shares issued and outstanding -\nCommon stock, par value $0.0001, (Note 5)\n100,000,000 shares authorized\n940,621 shares issued and outstanding\n520,000 Treasury shares (520 ) -\nAdditional paid-in capital 120,191,707 120,191,187\nAccumulated deficit (120,275,882 ) (120,212,367 )\nTotal Stockholders Deficit (83,754 ) (20,240 )\nTotal Liabilities and Stockholders Deficit $ 129,581 $ -\nSee accompanying notes to the interim financial statements.\nPOINT OF CARE NANO-TECHNOLOGY, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended July 31, 2022 and 2021\nFor the Year Ended July 31\nRoyalty revenue $ 100,000 $ -\nRoyalty fee 90,000 -\nNet royalty income 10,000 -\nOperating expenses\nProfessional fees 51,800 7,500\nGeneral and administration 20,180 -\nAmortization 1,534 -\nOfficer compensation -\nOperating expenses 73,515 7,500\nNet loss and comprehensive loss $ (63,515 ) $ (7,500 )\nWeighted average Net Loss per share, basic and diluted ($ 0.08 ) $ 0.00\nWeighted average number of common shares outstanding 787,183 940,621\nSee accompanying notes to the interim financial statements.\nPOINT OF CARE NANO-TECHNOLOGY, INC.\nCONSOLIDATED STATEMENTS OF DEFICIT\nFor the Year Ended July 31, 2022\nPreferred Stock Common Stock Treasury Stock Additional\nPaid-in\nCapital Accumulated\nDeficit Total\nStockholders\nDeficit\n#\n#\n#\nBalance, July 31, 2021 - $ - 940,621 $ 940 - $ - $ 120,191,187 $ (120,212,367 ) $ (20,240 )\nShares issued 1,000 - - - - - -\nNet loss for the period - - - - - - - (42,255 ) (42,255 )\nBalance, October 31, 2021 1,000 940,621 - - 120,191,187 (120,254,622 ) (62,494 )\nNet loss for the period - - - - - - - (13,795 ) (13,795 )\nBalance, January 31, 2022 1,000 940,621 - - 120,191,187 (120,268,417 ) (76,289 )\nSettlement (Note 6) - -\n(520,000 ) (520 ) - -\nNet loss for the period - - - - - - - (5,837 ) (5,837 )\nBalance, April 30, 2022 1,000 940,621 (520,000 ) (520 ) 120,191,707 (120,274,254 ) (82,126 )\nNet loss for the period - - - - - - - (1,628 ) (1,628 )\nBalance, July 31, 2022 1,000 $ 1 940,621 $ 940 (520,000 ) $ (520 ) $ 120,191,707 $ (120,275,882 ) $ (83,754 )\nFor the Year Ended July 31, 2021\nCommon Stock Additional\nPaid-in\nCapital Accumulated\nDeficit Total\nStockholders\nDeficit\n#\nBalance, July 31, 2020 940,621 $ 940 $ 120,191,187 $ (120,204,867 ) $ (12,740 )\nNet loss for the period - - - - -\nBalance, October 31, 2020 940,621 120,191,187 (120,204,867 (12,740 )\nNet loss for the period - - - - -\nBalance, January 31, 2021 940,621 120,191,187 (120,204,867 (12,740 )\nNet loss for the period - - - - -\nBalance, April 30, 2021 940,621 120,191,187 (120,204,867 ) (12,740 )\nNet loss for the period - - - (7,500 ) (7,500 )\nBalance, July 31, 2021 940,621 $ 940 $ 120,191,187 $ (120,212,367 ) $ (20,240 )\nSee accompanying notes to the interim financial statements.\nPOINT OF CARE NANO-TECHNOLOGY, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Year Ended July 31 2022 and July 31, 2021\nFor the Year Ended July\nCash flows from operating activities\nNet loss for the year $ (63,515 ) $ (7,500 )\nNon-cash expense\nAmortization 1,534 -\nOfficer compensation -\nChange in working capital items\nPrepaid expense (2,917 ) -\nAccounts payable 68,095 7,500\nNet cash flows from operating activities 3,198 -\nChange in cash for the year 3,198 -\nCash, beginning of year - -\nCash, end of year $ 3,198 $ -\nSupplemental disclosures of cash flow Information Cash paid during the year for:\nInterest $ - $ -\nIncome tax $ - $ -\nLicense fee to be paid in common shares (unpaid) $ 125,000 $ -\nSee accompanying notes to the interim financial statements.\nPOINT OF CARE NANO-TECHNOLOGY, INC.\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nJULY 31, 2022 AND 2021\nNote COMPANY AND BACKGROUND\nPoint of Care Nano-Technology, Inc. (the Company) was incorporated under the laws of the State of Nevada on June 10, 2010, under the name of Alternative Energy and Environmental Solutions, Inc. On August 28, 2014, the Company filed an amendment to its Articles of Incorporation changing the name of the Company to Unique Growing Solutions, Inc. On March 31, 2015, the Company filed an amendment to its Articles of Incorporation changing the name of the Company to Point of Care Nano-Technology, Inc.\nOn February 26, 2015, the Companys business model was related to using its license, under a certain license agreement (the License Agreement) from Lamina Equities Corporation, to first develop and then manufacture saliva-based medical diagnosis products. The Company was not successful and discontinued the majority of its operations by July 31, 2016. Beginning from August 2016, the Companys plan, which it has since discontinued, was to provide business services and financing to emerging growth entities.\nOn April 15, 2021, the Company accepted the resignations of Dr. Guirguis and Mr. El-Salhy, received a mutual release from both, and appointed Mr. Nicholas DeVito to be Director, Chief Executive Officer and Chief Financial Officer. In addition, for his services to the Company, Mr. DeVito was awarded 1,000 shares of Class A Preferred Stock that grants him 80% voting rights.\nAlso on April 15, 2021 the Company agreed to form a subsidiary and transfer all debts and the License Agreement back to Dr. Guirguis in exchange for 520,000 shares of Common Stock. On August 231, 2021, the Company formed the wholly owned subsidiary, DRG Transfer, Inc. This transaction closed on March 26, 2022.\nOn July 2, 2021, the Company incorporated a wholly owned subsidiary, Duo Sciences, Inc. (DSI).\nOn April 11, 2022, the Company, through DSI, acquired an exclusive license to distribute certain intellectual property in animal nutrition and animal supplements from Cedoga Consulting, LLC (Cedoga). On April 19, 2022, DSI signed an exclusive sales and promotion agreement with Lucy Pet Products Inc. (Lucy) pursuant to which Lucy will manufacture, market and distribute pet products from the Cedoga intellectual property.\nThe Companys principal executive office location and mailing address is 109 Ambersweet Way, Davenport, FL 33897.\nNote CONTROL BY PRINCIPAL OWNERS\nThe directors and executive officers own, directly or indirectly, beneficially and in the aggregate, the majority of the voting power of the outstanding capital stock of the Company. Accordingly, directors, executive officers and their affiliates, if they voted their shares uniformly, would have the ability to control the approval of most corporate actions, including approving significant expenses, increasing the authorized capital and the dissolution, merger, or sale of the Companys assets.\nNote GOING CONCERN\nThese financial statements have been prepared in accordance with generally accepted principles applicable to a going concern, which assumes that the Company will be able to meet its obligations and continue its operations for its next twelve months. Realization values may be substantially different from carrying values as shown and these financial statements do not give effect to adjustments that would be necessary to the carrying values and classifications of assets and liabilities should the Company be unable to continue as a going concern.\nAt July 31, 2022, the Company had not yet achieved profitable operations and had accumulated losses of $120,275,882 and had $3,198 cash on hand. The Company will need to raise additional cash in order to fund ongoing operations over the next 12 month period. These factors which casts substantial doubt about the Companys ability to continue as a going concern. The Companys ability to continue as a going concern is dependent upon its ability to generate future profitable operations and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. No adjustments to the consolidated financial statements have been made as a result of this concern.\nNote ACCOUNTING POLICIES\nThe financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States of America, the more significant of which are as follows:\nConsolidation\nThe accompanying consolidated financial statement include the accounts of the Company and its wholly owned subsidiary Duo Sciences Inc. (DSI)\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of financial statements and the reported amounts of revenues and expenses during the reporting period. Changes in estimates are recognized in accordance with the accounting rules for the estimate, which is typically in the period when new information becomes available to management. Actual results could differ from those estimates.\nFinancial Instruments\nFinancial instruments consist of cash and accounts payable and accrued liabilities. The carrying amounts of the financial instruments approximate their fair values due to their relatively short-term nature of the underlying terms are consistent with market terms. As of the financial statement date, the Company does not hold any derivate financial instruments. Financial assets and liabilities are measured upon first recognition and reviewed at the financial statement date. Changes in fair value are recognized through profit and loss. Unless otherwise noted, it is managements opinion that the Company is not exposed to significant interest or credit risks arising from these financial instruments.\nFair Value Measurements\nThe Company follows FASB Codification topic (ASC) 820, Fair Value Measurements and Disclosures, for all financial instruments and non-financial instruments accounted for at fair value on a recurring basis. This new accounting standard establishes a single definition of fair value and a framework for measuring fair value, sets out a fair value hierarchy to be used to classify the source of information used in fair value measurement and expands disclosures about fair value measurements required under other accounting pronouncements. It does not change existing guidance as to whether or not an instrument is carried at fair value. The Company defines fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities, which are required to be recorded at fair value, the Company considers the principal or most advantageous market in which the Company would transact and the market-based risk measurements or assumptions that market participants would use in pricing the asset or liability, such as inherent risk, transfer restrictions and credit risk.\nThe Company has adopted FASB ASC 825, Financial Instruments, which allows companies to choose to measure eligible financial instruments and certain other items at fair value that are not required to be measured at fair value. The Company has not elected the fair value option for any eligible financial instruments.\nAn asset or liabilitys level within the fair value hierarchy is based on the lowest level of any input that is significant to the fair value measurement. Availability of observable inputs can vary and is affected by a variety of factors. The Company uses judgment in determining fair value of assets and liabilities, and Level 3 assets and liabilities involve greater judgment than Level 1 and Level 2 assets or liabilities.\nIncome Taxes\nThe Company accounts for income taxes under FASB ASC Topic 740, Income Taxes (ASC Topic 740). Under ASC Topic 740, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Under ASC 740-10-25, the effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized. As the Company has yet to produce positive cash flows from operations, no deferred tax asset or income taxes have been recorded in the financial statements.\nComprehensive Income (Loss)\nThe Company adopted FASB ASC 220, Reporting Comprehensive Income, which establishes standards for the reporting and display of comprehensive income and its components in the financial statements. Comprehensive income consists of net income and other gains and losses affecting stockholders equity that are excluded from net income, such as unrealized gains and losses on investments available for sale, foreign currency translation gains and losses and minimum pension liability. Since inception, the Company has not had any comprehensive income / loss.\nNet Income (Loss) per Common Share\nFASB ASC 260, Earnings per share, requires dual presentation of basic and diluted earnings per share (EPS) with a reconciliation of the numerator and denominator of the EPS computations. Basic earnings per share amounts are based on the weighted average shares of common stock outstanding. If applicable, diluted earnings per share would assume the conversion, exercise or issuance of all potential common stock instruments such as options, warrants and convertible securities, unless the effect is to reduce a loss or increase earnings per share. Diluted net income (loss) per share on the potential exercise of the equity-based financial instruments is not presented where anti-dilutive. Accordingly, although the diluted weighted average number of common stock outstanding is disclosed on the statements of operation, the calculated net loss per share is the same for bother basic and diluted as both are based on the basic weighted average of common stock outstanding. There were no adjustments required to net income for the period presented in the computation of diluted earnings per share.\nSegment Reporting\nFASB ASC 820, Segments Reporting, establishes standards for reporting information about operating segments on a basis consistent with the Companys internal organization structure as well as information about geographical areas, business segments and major customers in financial statements. The Company currently operates in one principal business segment.\nIntangible assets\nIntangible asset are non-monetary identifiable assets, controlled by the Company that will produce future economic benefits, based on reasonable and supportable assumptions about conditions that will exist over the life of the asset. An intangible asset that does not meet these attributes will be recognized as an expense when it is incurred. Intangible assets that do, are capitalized and initially measure at cost. Those with a determinable life will be amortized on a systematic basis over their future economic life. Those with an indefinite useful life shall not be amortized until its useful life is determined to be longer than indefinite. An intangible asset subject to amortization shall be periodically reviewed for impairment. A recoverability test will be performed and, if applicable, unscheduled amortization is considered.\nThe license agreements has been capitalized, recorded at cost and amortized over its estimated useful life of ten years. Amortization has been determined based on a pro rata basis over the expected cash flows.\nNon-cash transactions\nThe Company follows FASB ASC 845 then recording non-cash transactions. The value of the asset received should be based on the value of the assets surrendered. However, where that value is difficult to determine, then the value could be based on the asset received, provided it is more clearly evident than the value of the asset surrendered.\nRelated Parties\nThe Company adopted FASB ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions.\nRecent Accounting Pronouncements\nThe Company adopts new pronouncements relating to generally accepted accounting principles applicable to the Company as they are issued, which may be in advance of their effective date. The Company does not expect the adoption of recently issued accounting pronouncements to have a significant impact on the Companys results of operations, financial position, or cash flow.\nNote COMMON and PREFERRED STOCK\nThe Company has authorized capital of 100,000,000 shares of common stock, par value of $0.0001 per share, and 10,000,000 shares of blank check preferred stock, par value of $0.0001 per share, of which 1,000 shares have been designated as Series A Nonconvertible Preferred Stock (the Series A Preferred Stock). During the year ended July 31, 2022, the Company had the following transactions:\nOn June 8, 2022, the Company received approval from the Financial Industry Regulatory Authority to effect a 50:1 reverse split of the Companys outstanding common stock. The split was reflected in the public markets on June 9, 2022 and has been given retroactive disclosure in the financial statements. Accordingly, all references to common shares in these financial statements reflect the reverse split.\nOn August 2, 2021, the Company issued 1,000 Series A Preferred Stock to Nicholas DeVito, the Companys Chief Executive Officer as compensation. The Preferred Stock gives DeVito 80% control of the voting stock of the Company.\nOn April 10, 2022, the Company entered into an agreement under which it agreed to issue 300,000 common shares in order to obtain a license to distribute product (See below). The Company has not yet issued those shares and the obligation to do so is included in the accounts as a $125,000 liability.\nOn April 15, 2022, as part of the Settlement agreement (See below), the Company received into treasury 520,000 shares of common stock (26,000,000 pre reverse split shares).\nThere were no transactions in the Companys common or preferred stock in the year ended July 31, 2021.\nThere were no warrants or options outstanding as of July 31, 2022.\nNote SETTLEMENT AGREEMENT\nOn April 15, 2021, the Company formed a wholly owned subsidiary, DRG Transfer Inc. (DRG) and transferred all Company debts relating to the License Agreement business and the License Agreement to DRG to be split off to Dr. Guirguis in exchange for 520,000 share (26,000,000 shares pre reverse split) of the Companys common stock held by Dr. Guirguis. This transaction closed on March 26, 2022 with Dr. Guirguis giving up and transferring to DRG all the rights, title and interest in the 520,000 shares and DRG contributing all of the legacy business debt and the License Agreement to DRG Transfer, Inc, a Nevada corporation, and transferring all of the outstanding capital stock in DRG Transfer, Inc. to Dr. Guirguis.\nNote LICENSE PURCHASED and INTANGIBLE ASSETS\nOn April 11, 2022, the Company, through its wholly owned subsidiary DSI, acquired an exclusive license to distribute in the USA, Canada and Mexico, certain intellectual property in animal nutrition and animal supplements from Cedoga Consulting, LLC. The Company receives 10% of all licensing fees due to Cedoga in exchange for 300,000 post reverse split shares of common stock of the Company. Under the terms of the agreement, the Company will pay royalties from sub-licensing on the following basis:\n● 90% of net royalties for sale and initial payments up to $100,000,000 per calendar year.\n● 95% of net royalties received for continuing sales above $100,000,000 per calendar year.\n● 90% of any lump up-front payment sub-licensing fees.\n● Option to purchase 200,000 shares of the Companys common stock when net sales exceed $100,000,000.\nThe license value has been based on the expected discounted cash flows the license will generate to the Company over its estimated 10 year life. The Companys common shares are very lightly traded and management determined that their market value are not reliable as a determinant of value for this transaction.\nSchedule of License Purchased\nAs of July 31\nLicense $ 125,000 $ -\nAccumulated amortization 1,534 -\nBalance, end of year $ 123,466 $ -\nNote EXCLUSIVE SALES SUB-LICENSING AGREEMENT\nOn April 19, 2022, DSI signed an exclusive sales and promotion sub-licensing agreement with Lucy Pet Products Inc. (Lucy) pursuant to which Lucy will manufacture, market and distribute pet products derived from the Cedoga intellectual property. The terms of the sub-licensing agreement are as follows:\n● Lucy will pay the Company a one-time sub-license fee of $100,000 on execution of the sub-licensing agreement.\n● Lucy will pay the Company royalties of 5% of Net Revenue, calculated and payable quarterly. Net Revenue is defined as total revenue less direct cost of materials, manufacturing, packaging and delivery expenses and less excise, sales or similar taxes.\nOn May 11, 2022, the Company received the first payment from Lucy of $100,000 under its sub-license agreement with Lucy and remitted $90,000 to Cedoga according to the Cedoga license agreement.\nNote INCOME TAXES\nAs at July 31, 2022, no tax benefit has been recorded with respect to the net operating loss in the financial statements as the management of the Company believes that the realization of the Companys net deferred tax assets would not be considered more likely than not and accordingly, the potential tax benefits of the net loss carry-forwards are offset by the full valuation allowance. The Company has a net operating loss carryforward of approximately $1,813,968.\nIncome tax recovery differs from that which would be expected from applying the effective tax rates to the net loss for the years ended July 31, 2022 and 2021 as follows:\nSchedule of Income tax Reconciliation\nYear Ended July 31\nNet loss for the year $ (63,515 ) $ (7,500 )\nStatutory and effective tax rate 25.46 % 25.46 %\nExpected income tax recovery $ (16,162 ) $ (1,909 )\nTax benefit deferred 16,162 1,909\nIncome taxes recorded $ - $ -\nSchedule of Deferred Tax Assets\nYear Ended July 31\nTax losses carried forward $ 1,814,000 $ 1,750,000\nStatutory and effective tax rate 25.46 % 25.46 %\nDeferred tax asset $ 462,000 $ 446,000\nValuation allowance (462,000 ) (446,000 )\nNet deferred tax asset $ - $ -\nThe Companys income tax filings are subject to audit by various taxing authorities. The Companys open audit periods include from Inception (June 10, 2010) to the current tax year.\nNote SUBSEQUENT EVENTS\nOn August 24, 2022, the Company completed a financing with an investor for $10,000 in exchange for Units consisting of (i) one share of common stock, par value $0.001 per share for $0.10 per share, (ii) one LOI option to purchase one share of common stock for $0.20 per share upon the Company signing a letter of intent with a third party and (iii) one Agreement option to purchase one share of common stock for $0.30 per share upon the Company signing an agreement with a third party."
}