{
    "cik": "1508348",
    "company": "AmeriCann, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-29",
    "period_of_report": "2022-09-30",
    "sic": "8742",
    "state_of_inc": "DE",
    "state_location": "CO",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1508348/0001437749-22-029891-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1508348/000143774922029891/acan20220930_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1508348/0001437749-22-029891.txt",
    "filename": "1508348_10K_2022_0001437749-22-029891.htm",
    "content": "ITEM 1.\nBUSINESS.\nAmeriCann, Inc. (AmeriCann) is a specialized cannabis company that is developing state-of-the-art product manufacturing and greenhouse cultivation facilities. Our business plan is based on the continued growth of the regulated marijuana market in the United States.\nAmeriCann uses greenhouse technology which is superior to the current industry standard of growing cannabis in warehouse facilities under artificial lights. According to industry experts, by capturing natural sunlight, greenhouses use 25 percent fewer lights, and utility bills are up to 75 percent less than in typical warehouse cultivation facilities. As such, AmeriCanns Canopy System enables cannabis to be produced with a greatly reduced carbon footprint, making the final product less expensive. Additionally, greenhouse construction costs can be nearly half of warehouse construction costs. AmeriCanns business is committed to sustainable, clean cultivation of medical cannabis and to social and environmental ethics, transparency and accountability.\nAmeriCanns team includes board members, expert consultants, engineers and architects who specialize in real estate development, traditional horticulture, lean manufacturing, medical research, facility construction, regulatory compliance, security, cannabis cultivation and genetics, extraction processes, and infused product development.\nAmeriCanns flagship project is the Massachusetts Cannabis Center. The Massachusetts Cannabis Center (MCC) is being developed on a 52-acre parcel located in southeastern Massachusetts. AmeriCanns MCC project is permitted for 987,000 sq. ft. of cannabis cultivation and processing infrastructure, which is being developed in phases to support both the existing medical cannabis and the emerging adult-use cannabis marketplace.\nThe first phase of the million square foot project, Building 1, a 30,000 square foot cultivation and processing facility, is fully-operational and is currently 100% leased by a vertically-integrated Massachusetts cannabis company.\nSee Massachusetts Cannabis Center below for more information.\nMassachusetts Cannabis Center\nOn October 17, 2016, we closed on the acquisition of the 52.6-acre parcel of undeveloped land in Freetown, Massachusetts. The property is located approximately 47 miles southeast of Boston. We are developing the property as the Massachusetts Cannabis Center (MCC).\nAs part of a simultaneous transaction, we assigned the property rights to Massachusetts Medical Properties, LLC (MMP) for a nominal fee and entered a lease agreement pursuant to which MMP agreed to lease the property to us for an initial term of fifty (50) years. We have the option to extend the term of the lease for four (4) additional ten (10) year periods. The lease is a triple net lease, with the Company paying all real estate taxes, repairs, maintenance and insurance.\nThe lease payments are the greater of (a) $30,000 per month; (b) $0.38 per square foot per month of any structure built on the property; or (c) 1.5% of all gross monthly sales of products sold by the Company, any assignee of the Company, or any subtenant of the Company. The lease payments will be adjusted up (but not down) every five (5) years by any increase in the Consumer Price Index.\nPlans for the MCC include the construction of sustainable greenhouse cultivation and processing facilities that will be leased to Registered Marijuana Dispensaries under the Massachusetts Medical Marijuana and Adult Use Programs\nThe Town of Freetown Planning Board has approved our site plan application for the MCC. The site plan application requested 977,000 square feet of infrastructure for cannabis cultivation, processing, testing and associated administration in Freetown's Industrial Park.\nWe are developing MCC in phases that will consist of three different building sites. The buildings have been approved for the following approximate sizes:\nBuilding 1: 30,000 square feet\nBuilding 2: 370,000 square feet\nBuilding 3: 600,000 square feet.\nBuilding 1 is a fully-constructed and operational, state-of-the-art greenhouse cultivation and product manufacturing facility.\nOn July 26, 2019 we entered into a Triple Net Lease for Building 1 with BASK, Inc. (\"BASK\"), a related party. Building 1, an Adult-Use and Medical cannabis cultivation and processing facility, is the first phase of the MCC. BASK commenced operations in Building 1 in February of 2020 and is licensed by the Massachusetts Cannabis Control Commission to cultivate, process and sell cannabis.\nThe 15-year lease for Building 1 with BASK provides, in addition to a monthly Base Rent, a Revenue Participation Fee whereby we will receive 15% of all gross monthly sales of cannabis, cannabis-infused products and non-cannabis products produced at Building 1.\nBuilding 2 is the next phase of the MCC development where we will occupy space for cannabis cultivation and product manufacturing. Designs for Building 2 include 370,000 square feet of greenhouses for cultivation and GMP certified product manufacturing and extraction capabilities.\nOn November 19, 2020, AmeriCann received two licenses from the Massachusetts Cannabis Control Commission. The licenses are for Cannabis Cultivation and a license for Cannabis Product Manufacturing. The Cannabis Cultivation and Cannabis Product Manufacturing licenses awarded to AmeriCann are designated to be operated in Building 2 of the MCC.\nFor the remainder of the project we intend to enter into agreements with other licensed cannabis businesses in Massachusetts to occupy space in the MCC. We will generate revenue through lease arrangements with the operators that include base rents and revenue participation fee payments up to 15% of gross revenue generated from products produced at the MCC. We plan to replicate the brands, technology and innovations developed at the MCC to new markets.\nMarket Conditions\nWhile the industry is growing rapidly, the cannabis industry faces several major obstacles that challenge its growth and profitability. First, the cultivation of cannabis is a very capital-intensive enterprise. Many cannabis entrepreneurs do not have access to the capital required to build the infrastructure required to meet growing demand and sales projections. Traditional sources of financing, such as banks, are not available currently to cannabis producers and retailers in the United States. Second, there is a significant shortage of knowledge related to virtually all areas of the cannabis business. When new states are added to the list of regulated cannabis markets, there is a scarcity of experience and expertise to serve the needs of cultivators, processors and retailers in these states. As explained below, marijuana is illegal under federal law. These obstacles to the cannabis industry require financial resources, expertise and dedicated advocacy to change regulations on the state level.\nGovernment Regulation\nMarijuana is a Schedule-I controlled substance and is illegal under federal law. Even in those states in which the use of marijuana has been legalized, its use remains a violation of federal law.\nA Schedule I controlled substance is defined as a substance that has no currently accepted medical use in the United States, a lack of safety for use under medical supervision and a high potential for abuse. The Department of Justice defines Schedule 1 controlled substances as the most dangerous drugs of all the drug schedules with potentially severe psychological or physical dependence. If the federal government decides to enforce the Controlled Substances Act with respect to marijuana, persons that are charged with distributing, possessing with intent to distribute, or growing marijuana could be subject to fines and terms of imprisonment, the maximum being life imprisonment and a $50 million fine.\nAlthough many states have legalized cannabis for medical and recreational use by adults, the state laws are in conflict with the federal Controlled Substances Act, which makes marijuana use and possession illegal on a national level. Although previous administrations have indicated that they are not opposed to the legalization of marijuana any change in the federal governments enforcement of current federal laws could cause significant financial damage to us and our shareholders.\nCompetition\nCurrently, there are a number of other companies that are involved in the cannabis industry, many of which we consider to be our competition. Many of these companies provide services similar to those which we provide or plan to provide. We expect that other companies will recognize the value of serving the cannabis industry and become our competitors.\nGeneral\nWe were incorporated in Delaware on June 25, 2010.\nOur offices are located at 1555 Blake Street, Unit 502, Denver, CO 80202. We lease this space on a month-to-month basis at a rate of $2,500 per month.\nAs of November 30, 2022, we had three full time employees, that being Timothy Keogh, our Chief Executive Officer, Benjamin Barton, Chief Financial Officer and our Office Manager. As of November 30, 2022, Mr. Keogh was spending approximately 90% of his time on our business and Mr. Barton was spending approximately 95% of his time on our business.\nCOVID-19 Pandemic\nThe Company believes that the COVID- 19 pandemic has had certain impacts on its business, but management does not believe there has been a material long-term impact from the effects of the pandemic on the Companys business and operations, results of operations, financial condition, cash flows, liquidity or capital and financial resources.\nThe Company has established policies to monitor the pandemic and has taken a number of actions to protect its employees, including restricting travel, encouraging quarantine and isolation when warranted, and directing employees to work from home. ITEM 1A.\nRISK FACTORS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. However, our activities are subject to significant risks and uncertainties including failure to secure funding to properly fund our business plan. ITEM 1B.\nUNRESOLVED STAFF COMMENTS\nNot applicable. ITEM 2.\nPROPERTIES.\nSee Item 1. Business. ITEM 3.\nLEGAL PROCEEDINGS.\nNone ITEM 4.\nMINE SAFETY DISCLOSURES.\nNot applicable\nPART II ITEM 5.\nMARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nOur common stock is quoted on the OTCQB under the trading symbol ACAN. Shown below is the range of high and low closing prices for our common stock as reported by the OTCQB for the periods presented:\nQuarter Ended\nHigh\nLow\nDecember 31, 2020\n$ 1.37\n$ 0.40\nMarch 31, 2021\n$ 1.90\n$ 0.85\nJune 30, 2021\n$ 1.40\n$ 1.07\nSeptember 30, 2021\n$ 1.16\n$ 0.73\nDecember 31, 2021\n$ 0.74\n$ 0.44\nMarch 31, 2022\n$ 0.74\n$ 0.38\nJune 30, 2022\n$ 0.55\n$ 0.31\nSeptember 30, 2022\n$ 0.45\n$ 0.28\nHolders of our common stock are entitled to receive dividends as may be declared by the Board of Directors. Our Board of Directors is not restricted from paying any dividends but is not obligated to declare a dividend. No cash dividends have ever been declared and it is not anticipated that cash dividends will ever be paid. We currently intend to retain any future earnings to finance future growth. Any future determination to pay dividends will be at the discretion of our directors and will depend on our financial condition, results of operations, capital requirements and other factors the board of directors considers relevant.\nOur Articles of Incorporation authorize the Board of Directors to issue up to 20,000,000 shares of preferred stock. The provisions in the Articles of Incorporation relating to the preferred stock allow our directors to issue preferred stock with multiple votes per share and dividend rights, which would have priority over any dividends paid to the holders of our common stock. The issuance of preferred stock with these rights may make the removal of management difficult even if the removal would be considered beneficial to shareholders generally, and will have the effect of limiting shareholder participation in certain transactions such as mergers or tender offers if these transactions are not favored by management.\nAs of November 30, 2022, we had approximately 120 shareholders of record and 24,391,961 outstanding shares of common stock. ITEM 6.\nSELECTED FINANCIAL DATA.\nNot applicable. ITEM 7.\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nSelect Quarterly Financial Information\nQuarter Ended September 30, 2022 compared to the Quarter Ended September 30, 2021\nThe Company achieved four consecutive quarters of increased operating revenue, culminating in positive net income for the quarter ending September 2022. The Company had a significant increase in year-over-year revenue, increasing over 44% for the year ended September 30, 2022 relative to the year ended September 30, 2021, an increase of over $899,000.\nThe increase in financial performance is attributable to greater revenue received from products produced and manufactured at Building 1, the Company's initial development at its Massachusetts Cannabis Center in Freetown, Massachusetts.\nAMERICANN, INC.\nSELECTED QUARTERLY FINANCIAL DATA\nQuarters ended\nYear ended\nDecember 31, 2021\nMarch 31, 2022\nJune 30, 2022\nSeptember, 30 2022\nSeptember, 30 2022\nRental income\n$ 243,681\n$ 667,366\n$ 797,734\n$ 811,774\n2,520,555\nRental income - related party\n407,264\n-\n-\n-\n407,264\n(Loss) income from operations\n(368,619 )\n185,117\n326,409\n339,820\n482,727\nNet (loss) income\n(533,028 )\n24,240\n162,734\n172,810\n(173,244 )\nBasic and diluted (loss) income per common share\n$ (0.02 )\n$ 0.00\n$ 0.01\n$ 0.01\n(0.01 )\nQuarters ended\nYear ended\nDecember 31, 2020\nMarch 31, 2021\nJune 30, 2021\nSeptember, 30 2021\nSeptember 30, 2021\nRental income\n$ -\n$ -\n$ -\n$ -\n-\nRental income - related party\n271,585\n437,344\n584,546\n735,076\n2,028,551\nIncome (loss) from operations\n(302,578 )\n(36,295 )\n125,371\n257,795\n44,293\nNet (loss) income\n(502,284 )\n(304,092 )\n(98,955 )\n42,438\n(862,893 )\nBasic and diluted (loss) income per common share\n(0.02 )\n(0.01 )\n$ 0.00\n$ 0.00\n(0.04 )\nResults of Operations\nYear Ended September 30, 2022 compared to the Year Ended September 30, 2021\nTotal Revenues\nDuring the year ended September 30, 2022, we generated $2,927,819 in revenue, as compared to $2,028,551 for the year ended September 30, 2021. The increase in revenue is due to an increase in revenue from Building 1 at the MCC.\nCost of Revenues\nDuring the year ended September 30, 2022, we incurred $45,950 of costs of revenue, as compared to $38,149 for the year ended September 30, 2021. The increase in cost is due to increased building maintenance costs.\nAdvertising and Marketing Expenses\nAdvertising and marketing expenses were $37,731 for the year ended September 30, 2022, as compared to $42,417 for the year ended September 30, 2021. The decrease is due to a decrease in marketing costs.\nProfessional Fees\nProfessional fees were $343,829 for the year ended September 30, 2022, as compared to $311,288 for the year ended September 30, 2021. The increase in professional fees is primarily due an increase in legal, accounting and auditing and consulting fees.\nGeneral and Administrative Expenses\nGeneral and administrative expenses were $2,017,582 for the year ended September 30, 2022, as compared to $1,592,404 for the year ended September 30, 2021. The increase is primarily a result of an increase in stock compensation costs.\nInterest Income\nInterest income was $11,504 for the year ended September 30, 2022, as compared to $18,305 for the year ended September 30, 2021.\nInterest Expense\nInterest expense was $667,475 for the year ended September 30, 2022, as compared to $925,491 for the year ended September 30, 2021. The decrease is primarily attributable to a reduction of interest bearing debt.\nNet Loss\nWe had a net loss of $173,244 for the year ended September 30, 2022, as compared to a net loss of $862,893 for the year ended September 30, 2021. The decrease in net loss is primarily the result an increase in revenues partially offset by an increase in stock compensation expense.\nLIQUIDITY AND CAPITAL RESOURCES\nLoans\nOn August 2, 2019 we secured a $4,000,000 loan from an unrelated third party. The loan was evidenced by a note which bears interest at the rate of 11% per year. On December 4, 2020, the loan was increased by $500,000 and the maturity date was extended from August 2, 2022 to August 1, 2023. The loan is secured by a first lien on Building 1 at the MCC.\nThe note holder also received a warrant which allows the holder to purchase 600,000 shares of the Companys common stock at a price of $1.50 per share. The warrant will expire on the earlier of (i) August 2, 2024 or (ii) twenty days after written notice to the holder that the daily Volume Weighted Average Price of the Companys common stock was at least $4.00 for twenty consecutive trading days and the average daily volume of trades of the Companys common stock during the twenty trading days was at least 150,000 shares.\nSale of Common Stock and Warrants\nCurrently the company has 4,026,650 warrants issued and outstanding with exercise prices ranging from $1.00 to $1.50 and expiration dates ranging from October 17, 2022 to December 31, 2024 associated with transactions prior to October 1, 2019.\nDuring the year ended September 30, 2022, we issued 195,651 shares of stock for services valued $90,000.\nDuring the year ended September 30, 2021, we did not issue any stock for services.\nContractual obligations\nThe Company leases land under an operating lease commencing October 17, 2016, for an initial term of fifty (50) years. We have the option to extend the term of the lease for four (4) additional ten (10) year periods. The lease is a triple net lease, with the Company paying all real estate taxes, repairs, maintenance and insurance. The lease payments are the greater of (a) $30,000 per month; (b) $0.38 per square foot per month of any structure built on the property; or (c) 1.5% of all gross monthly sales of products sold by the Company, any assignee of the Company, or any subtenant of the Company. The Company received a credit for the $925,000 paid towards the purchase price of the land in the form of discounted lease payments. For the initial fifty (50) year term of the lease, the lease payments are reduced by $1,542 each month.\nAnalysis of Cash Flows\nDuring the year ended September 30, 2022, cash flows provided in operations were $848,738 as compared to net cash flows used in operations of $275,153 for the year ended September 30, 2021. The increase is primarily due to an increase in net income and timing of working capital payments.\nCash flows used in investing activities were $204,013 for the year ended September 30, 2022, consisting primarily of additions to construction in progress. Cash flows used in investing activities was $58,637 for the year ended September 30, 2021, consisting primarily of additions construction in progress.\nCash flows provided by financing activities were $0 for the year ended September 30, 2022. Cash flows provided by financing activities was $847,000 for the year ended September 30, 2021, consisting primarily of proceeds from note payable and the exercise of warrants, partially offset by payments on notes payable.\nGoing concern\nThe accompanying consolidated financial statements have been prepared assuming the Company will continue as a going concern, which contemplates, among other things, the realization of assets and satisfaction of liabilities in the normal course of business. The Company had an accumulated deficit of $19,758,689 and $19,585,445 at September 30, 2022 and 2021, respectively, and had a net loss of $173,244 for the year ended September 30, 2022.\nManagement believes that the actions presently being taken to further implement the Companys business plan and generate additional revenues provide the opportunity for the Company to continue as a going concern. While the Company believes in the viability of its strategy to generate additional revenues and in its ability to raise additional funds, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon the Company's ability to further implement its business plan and generate additional revenues. The consolidated financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nTrends\nThe factors that will most significantly affect our future operating results, liquidity and capital resources will be:\n●\nGovernment regulation of the cannabis industry;\n●\nRevision of Federal banking regulations for the cannabis industry; and\n●\nLegalization of the use of cannabis for medical or recreational use in other states.\nOther than the foregoing, we do not know of any trends, events or uncertainties that have had, or are reasonably expected to have, a material impact on:\n●\nrevenues or expenses;\n●\nany material increase or decrease in liquidity; or\n●\nexpected sources and uses of cash.\nRECENT ACCOUNTING PRONOUNCEMENTS\nRecent accounting pronouncements which may be applicable to us are described in Note 1 to the Consolidated Financial Statements included as part of this report.\nSIGNIFICANT ACCOUNTING POLICIES\nOur significant accounting policies are set forth below. We have consistently applied these policies in all material respects.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. The more significant estimates and assumptions made by management are valuation of equity instruments, deferred tax asset valuation and allowance and collectability of accounts receivable and long-lived assets. Actual results could differ from those estimates as the current economic environment has increased the degree of uncertainty inherent in these estimates and assumptions.\nCash and Cash Equivalents\nCash and cash equivalents include cash on hand, demand deposit accounts and temporary cash investments with maturities of ninety days or less at the date of purchase.\nIncome Taxes\nIn accordance with ASC Topic 740 - Income Taxes, the provision for income taxes is computed using the asset and liability method. The liability method measures deferred income taxes by applying enacted statutory rates in effect at the consolidated balance sheet date to the differences between the tax basis of assets and liabilities and their reported amounts on the consolidated financial statements. The resulting deferred tax assets or liabilities have been adjusted to reflect changes in tax laws as they occur. A valuation allowance is provided when it is more likely than not that a deferred tax asset will not be realized.\nWe expect to recognize the financial statement benefit of an uncertain tax position only after considering the probability that a tax authority would sustain the position in an examination. For tax positions meeting a \"more-likely-than-not\" threshold, the amount to be recognized in the consolidated financial statements will be the benefit expected to be realized upon settlement with the tax authority. For tax positions not meeting the threshold, no financial statement benefit is recognized. As of September 30, 2022 and 2021, we had no uncertain tax positions. We recognize interest and penalties, if any, related to uncertain tax positions as general and administrative expenses. We currently have no federal or state tax examinations nor have we had any federal or state examinations since our inception. To date, we have not incurred any interest or tax penalties.\nFor federal tax purposes, our 2019 through 2021 tax years remain open for examination by the tax authorities under the normal three-year statute of limitations.\nConcentration of Credit Risks and Significant Customers\nFinancial instruments that potentially subject us to concentrations of credit risk consist principally of cash, notes receivables, deposits, and tenant receivables. We place our cash with high credit quality financial institutions. As of September 30, 2022, we had outstanding notes receivable of $43,185 and a tenant receivable of $251,462 with a customer, previously a related party.\nFinancial Instruments and Fair Value of Financial Instruments\nWe adopted ASC Topic 820, Fair Value Measurements, for assets and liabilities measured at fair value on a recurring basis. ASC Topic 820 requires the use of fair value measurements, establishes a framework for measuring fair value and expands disclosure concerning such fair value measurements.\nASC Topic 820 defines fair value as the price that would be received upon the sale of an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Additionally, ASC Topic 820 requires the use of valuation techniques that maximize the use of observable inputs and minimize the use of unobservable inputs. These inputs are prioritized below:\nLevel 1:\nObservable inputs such as quoted market prices in active markets for identical assets or liabilities\nLevel 2:\nObservable market-based inputs or unobservable inputs that are corroborated by market data\nLevel 3:\nUnobservable inputs for which there is little or no market data, which require the use of the reporting entitys own assumptions.\nThe carrying value of financial assets and liabilities recorded at fair value is measured on a recurring or nonrecurring basis. Financial assets and liabilities measured on a non-recurring basis are those that are adjusted to fair value when a significant event occurs. We had no financial assets or liabilities carried and measured on a nonrecurring basis during the reporting periods. Financial assets and liabilities measured on a recurring basis are those that are adjusted to fair value each time a financial statement is prepared. We had no financial assets or liabilities carried and measured on a recurring basis during the reporting periods. The carrying value of short-term financial instruments, including cash, tenant and notes receivable, accounts payable and accrued expenses, and short-term borrowings approximate fair value due to the relatively short period to maturity for these instruments. The long-term borrowings approximate fair value since the related rates of interest approximates current market rates.\nDerivative Liabilities\nWe evaluate stock options, stock warrants or other contracts to determine if those contracts or embedded components of those contracts qualify as derivatives to be separately accounted for under the relevant sections of ASC Topic 815-40, Derivative Instruments and Hedging: Contracts in Entitys Own Equity. The result of this accounting treatment could be that the fair value of a financial instrument is classified as a derivative instrument and is marked-to-market at each consolidated balance sheet date and recorded as a liability. In the event that the fair value is recorded as a liability, the change in fair value is recorded in the consolidated statement of operations as other income or other expense. Upon conversion or exercise of a derivative instrument, the instrument is marked to fair value at the conversion date and then that fair value is reclassified to equity. Financial instruments that are initially classified as equity that become subject to reclassification under ASC Topic 815-40 are reclassified to a liability account at the fair value of the instrument on the reclassification date. We determined that none of our financial instruments meet the criteria for derivative accounting as of September 30, 2022 and 2021.\nOperating leases\nEffective October 1, 2019, we adopted ASC 842 Lease Accounting using the effective date method. Under the method, periods prior to adoption remain unchanged. We determine if an arrangement is a lease at inception.\nRight of Use (ROU) assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. Variable lease payments are not included in the calculation of the right-of-use asset and lease liability due to uncertainty of the payment amount and are recorded as lease expense in the period incurred. As most of our leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. We use the implicit rate when readily determinable. Our lease terms may include options to extend or terminate the lease when it is reasonably certain that we will exercise that option. Lease expense for lease payments is recognized on a straight-line basis over the lease term.\nUnder the available practical expedient, we account for the lease and non-lease components as a single lease component for all classes of underlying assets as both a lessee and lessor. Further, we elected a short-term lease exception policy on all classes of underlying assets, permitting us to not apply the recognition requirements of this standard to short-term leases (i.e. leases with terms of 12 months or less).\nLong-lived assets\nOur long-lived assets consist of property and equipment and are reviewed for impairment in accordance with the guidance of the Topic ASC Topic 360, Property, Plant, and Equipment. We test for impairment losses on long-lived assets used in operations whenever events or changes in circumstances indicate that the carrying amount of the asset may not be recoverable. Recoverability of an asset to be held and used is measured by a comparison of the carrying amount of an asset to the future undiscounted cash flows expected to be generated by the asset. If such asset is considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the asset exceeds its fair value. Impairment evaluations involve management's estimates on asset useful lives and future cash flows. Actual useful lives and cash flows could be different from those estimated by management which could have a material effect on our reporting results and financial positions. Fair value is determined through various valuation techniques including discounted cash flow models, quoted market values and third-party independent appraisals, as considered necessary. There were no impairment losses recognized for the years ended September 30, 2022 and 2021.\nProperty, Plant and Equipment\nProperty, plant and equipment are stated at cost. Depreciation of property, plant and equipment begins in the month following the month when the asset is placed into service and is provided using the straight-line method for financial reporting purposes at rates based on the estimated useful lives of the assets. Estimated useful lives range from three to twenty years.\nNon-Cash Equity Transactions\nShares of equity instruments issued for noncash consideration are recorded at the estimated fair market value of the consideration granted based on the estimated fair market value of the equity instrument, or at the estimated fair market value of the goods or services received, whichever is more readily determinable.\nStock-Based Compensation\nWe account for share-based awards to employees in accordance with ASC Topic 718, Stock Compensation. Under this guidance, stock compensation expense is measured at the grant date, based on the fair value of the award, and is recognized as an expense over the estimated service period (generally the vesting period) on the straight-line attribute method. Share-based awards to non-employees are accounted for in accordance with ASU 2018-07 Compensation - Stock Compensation (Topic 718): Improvements to Nonemployee Share-based Payment Accounting, which aligns the accounting for nonemployee share-based payments with accounting of share-based payments to employees,\nRelated Parties\nA party is considered to be related to us if the party directly or indirectly or through one or more intermediaries, controls, is controlled by, or is under common control with us. Related parties also include our principal owners, our management, members of the immediate families of our principal owners and our management and other parties with which we may deal if one party controls or can significantly influence the management or operating policies of the other to an extent that one of the transacting parties might be prevented from fully pursuing its own separate interests. A party which can significantly influence the management or operating policies of the transacting parties, or if it has an ownership interest in one of the transacting parties and can significantly influence the other to an extent that one or more of the transacting parties might be prevented from fully pursuing its own separate interests, is also a related party.\nRevenue Recognition\nProperty lease revenue is earned through annual leases for facilities used in agricultural/manufacturing activities and the Company records revenues on a straight-line basis over the term of these leases. Property lease revenues from these sources are recurring on an annual basis. Unearned property lease revenues were $0 at both September 30, 2022 and 2021.\nThe Company also receives a revenue participation fee which is considered a variable payment and thus is recorded in the period earned in accordance with ASC 842.\nAdvertising Expense\nAdvertising, promotional and selling expenses consist of sales and marketing expenses, and promotional activity expenses. Expenses are recognized when incurred.\nGeneral and Administrative Expense\nGeneral and administrative expenses consist of professional service fees, rent and utility expenses, meals, travel and entertainment expenses, and other general and administrative overhead costs. Expenses are recognized when incurred.\nLoss per Share\nWe compute net loss per share in accordance with the ASC Topic 260. The ASC specifies the computation, presentation and disclosure requirements for loss per share for entities with publicly held common stock.\nBasic loss per share amounts is computed by dividing the net loss by the weighted average number of common shares outstanding. Shares issuable upon the exercise of equity instruments such as warrants and options were not included in the loss per share calculations for 2022 and 2021 because the inclusion would have been anti-dilutive.\nOFF-BALANCE SHEET ARRANGEMENTS\nAs of September 30, 2022, we did not have any off-consolidated balance sheet arrangements.  ITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nAttached. ITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A.\nCONTROLS AND PROCEDURES.\nDisclosure Controls and Procedures\nAn evaluation was carried out under the supervision and with the participation of our management, including our Principal Executive Officer and Principal Financial Officer, of the effectiveness of our disclosure controls and procedures as of the end of the period covered by this report on Form 10-K. Disclosure controls and procedures are procedures designed with the objective of ensuring that information required to be disclosed in our reports filed under the Securities Exchange Act of 1934, such as this Form 10-K, is recorded, processed, summarized and reported within the time period specified in the Securities and Exchange Commissions rules and forms, and that such information is accumulated and is communicated to our management, including our Principal Executive Officer and Principal Financial Officer, or persons performing similar functions, as appropriate, to allow timely decisions regarding required disclosure. Based on that evaluation, our management concluded that, as of September 30, 2022, our disclosure controls and procedures were not effective for the same reasons that our internal control over financial reporting was not adequate.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as required by Sarbanes-Oxley Act, Section 404.A. Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements in accordance with generally accepted accounting principles in the United States and includes those policies and procedures that:\n(1)\nPertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of assets;\n(2)\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the issuer are being made only in accordance with authorizations of management and directors; and\n(3)\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the issuer's assets that could have a material effect on the issuers financial statements.\nWe carried out an evaluation under the supervision and with the participation of management, including our Principal Executive Officer and Principal Financial Officer, of the effectiveness of the design and operation of our internal control over financial reporting as of September 30, 2022. In making this evaluation, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework, published in 2013. Based on that evaluation, our Principal Executive Officer and Principal Financial Officer concluded that our internal control over financial reporting was not effective as of September 30, 2022 at the reasonable assurance level, as a result of material weaknesses related to a lack of a sufficient number of personnel with appropriate training and experience in accounting principles generally accepted in the United States of America, or GAAP, limited or no segregation of duties, and lack of independent directors. As a result, we did not adequately document or test whether our financial activity level controls or our information technology general controls were operating sufficiently to identify a deficiency, or combination of deficiencies, that may result in a reasonable possibility that a material misstatement of the consolidated financial statements would not be prevented or detected on a timely basis. In addition, we did not properly evaluate the accounting and valuation for certain equity instruments. While management has reviewed the consolidated financial statements and underlying information included in this Annual Report on Form 10-K in detail and believes the procedures performed are adequate to fairly present our financial position, results of operations and cash flows for the periods presented in all material respects, the material weaknesses that existed in fiscal 2022 could have led to an error in the original accounting of the estimated fair market value of certain equity instruments.\nRemediation of Material Weaknesses\nA material weakness is a control deficiency (within the meaning of the Public Company Accounting Oversight Board (PCAOB) Auditing Standard No. 2201), or combination of control deficiencies, that result in more than a remote likelihood that a material misstatement of the annual or interim consolidated financial statements will not be prevented or detected. While management believes that the Companys consolidated financial statements previously filed in the Companys SEC reports have been properly recorded and disclosed in accordance with US GAAP, we have designed and plan to implement, or in some cases have already implemented, the specific remediation initiatives described below:\nWe plan to obtain and hire additional accounting personnel, and continue to enhance our internal finance and accounting organizational structure.\nWe have hired a third-party consultant who has the required background and experience in accounting principles generally accepted in the United States of America and with SEC rules and regulations.\nWe are in the process of further enhancing the supervisory procedures to include additional levels of analysis and quality control reviews within the accounting and financial reporting functions.\nWe are in the process of strengthening our internal policies and ensuring that the consistent validation of our conclusions regarding significant accounting policies and their application to our business transactions are carried out by personnel with an appropriate level of accounting knowledge, experience and training.\nWhile we have not yet remediated these material weaknesses, we will continue our remediation efforts during fiscal 2023.\nThis Annual Report does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to such attestation pursuant to rules of the Securities and Exchange Commission that permits us to provide only managements report in this Annual Report.\nChanges in Internal Control over Financial Reporting\nNo changes in our internal control over financial reporting have come to management's attention during our last fiscal quarter that have materially affected, or are likely to materially affect, our internal control over financial reporting. ITEM 9B.\nOTHER INFORMATION.\nNone.\nPART III ITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nName\nAge\nPosition\nTimothy Keogh\nChief Executive Officer and a Director\nBenjamin J. Barton\nChief Financial and Accounting Officer and a Director\nJ. Tyler Opel\nDirector\nThe following is a brief summary of the background of each officer and director including their principal occupations during the past several years. All directors will serve until their successors are elected and qualified or until they are removed.\nTimothy Keogh was appointed our Chief Executive Officer and a director on March 25, 2014. As our Chief Executive Officer, Mr. Keogh has developed sustainable practices and traditional horticultural approaches to the production of cannabis to benefit patients and adults (21+) in regulated markets. Prior to joining AmeriCann, Mr. Keogh was the Chief Executive Officer and a director of Bask, Inc (f/k/a Coastal Compassion, Inc.), a non-profit corporation that has entered the medical marijuana business in Massachusetts. BASKSs efforts began in September of 2012 and was formalized under Massachusetts G.L. Chapter 180 in August of 2013. Under the direction of Mr. Keogh, Bask, Inc. received a limited number Final Certificates for cultivation, processing and dispensing medical cannabis in Massachusetts.\nBetween November 2010 and November 2013 Mr. Keogh owned and managed Dock Promotions, LLC, a company which provided consulting services to waterfront developments and marinas in the areas of design, construction, and operations. Between 2003 and 2010, Mr. Keogh was the Director of Business Services for Marina Management Services, Inc., a corporation which provided management and consulting solutions to waterfront developments, marinas and boatyards throughout the Americas and the Caribbean.\nMr. Keogh was recognized by Marijuana Business Daily as one of the top entrepreneurs in the cannabis industry, is a board member of the Responsible Regulation Alliance in Massachusetts, and continues to be an invited speaker at investment and cannabis industry events throughout the United States. Mr. Keogh holds a Bachelor of Science in Business Administration from Mount St. Marys College.\nBen Barton was appointed a director on January 14, 2014 and Chief Financial Officer on January 22, 2014. Since 1986, Mr. Barton has been active in all aspects of venture capital and public stock offerings. Since 2005, Mr. Barton has been the Managing Director of Strategic Capital Partners, LLC, a private investment company specializing in emerging companies. Mr. Barton was one of the founders of Synergy Resources Corporation, an energy company that traded on the NYSE. Prior to earning an MBA in Finance from UCLA, Mr. Barton received his Bachelor of Science degree in Political Science from Arizona State University.\nJ. Tyler Opel was appointed a director in January of 2019. Prior to joining AmeriCann, Mr. Opel received his business administration degree from the University of Missouri. After working as a financial analyst in the bulk commodity industry, Mr. Opel received his Juris Doctorate from the Southern Illinois School of Law with a specialization in Business and Transactional Law. Mr. Opel is licensed to practice law in Colorado and Missouri and has represented clients in various real estate, construction, administrative, and transactional proceedings.\nEffective March 25, 2014, we entered into an employment agreement with Mr. Keogh. The agreement had an initial term of three years and provided that we would pay Mr. Keogh $12,000 per month during the term of the agreement. Pursuant to the employment agreement, Strategic Capital Partners, LLC, our largest shareholder, sold 1,200,000 shares of our common stock to Mr. Keogh at a price of $0.001 per share.\nSee Item 12 of this report for information concerning options granted to Mr. Keogh.\nOur directors serve until the next annual meeting of our shareholders and until their successors have been duly elected and qualified. Our officers serve at the discretion of our directors.\nWe believe our directors are qualified to act as such for the following reasons:\nTimothy Keogh - experience in cannabis industry\nBenjamin J. Barton - experience in the capital markets\nJ. Tyler Opel - experience in business and transaction law\nTimothy Keogh and Benjamin J. Barton are not independent as that term is defined in Section 803 of the NYSE American Company Guide.\nWe do not have a financial expert as that term is defined by the Securities and Exchange Commission.\nOur Board of Directors does not have standing audit, nominating or compensation committees, committees performing similar functions, or charters for such committees. Instead, the functions that might be delegated to such committees are carried out by our Board of Directors, to the extent required. Our Board of Directors believes that these committees are not needed since we only have three directors.\nOur Board of Directors believes that its current members have sufficient knowledge and experience to fulfill the duties and obligations of an audit committee. None of the current Board members is an audit committee financial expert within the meaning of the rules and regulations of the Securities and Exchange Commission. The Board has determined that each of its members is able to read and understand fundamental consolidated financial statements and has substantial business experience that results in that members financial sophistication.\nOur Board of Directors does not have a leadership structure since each board member is free to introduce any resolution at any meeting of our directors and is entitled to one vote at any meeting.\nHolders of our common stock may send written communications to our entire board of directors, or to one or more board members, by addressing the communication to the Board of Directors or to one or more directors, specifying the director or directors by name, and sending the communication to our offices in Denver, Colorado. Communications addressed to the Board of Directors as whole will be delivered to each board member. Communications addressed to a specific director (or directors) will be delivered to the director (or directors) specified.\nSecurity holder communications not sent to the Board of Directors as a whole or to specified board members will not be relayed to other board members.\nThe Companys directors received the following compensation during the years ended September 30, 2022 and September 30, 2021:\nStock\nAwards\nOptions\nAwards\nAll Other\nName\nPaid in Cash\n(1)\n(2)\nCompensation\nTimothy Keogh\n$\n-\n$\n30,000\n$\n-\n$\n-\nBenjamin J. Barton\n$\n-\n$\n30,000\n$\n-\n$\n-\nJ. Tyler Opel\n$\n-\n$\n30,000\n$\n-\n$\n-\nTimothy Keogh\n$\n-\n$\n-\n$\n-\n$\n-\nBenjamin J. Barton\n$\n-\n$\n-\n$\n-\n$\n-\nJ. Tyler Opel\n$\n-\n$\n-\n$\n-\n$\n-\n(1)\nThe fair value of stock issued for services computed on the date of grant.\n(2)\nThe fair value of options granted computed on the date of grant. ITEM 11.\nEXECUTIVE COMPENSATION.\nDuring the years ended September 30, 2022 and 2021 the following amounts were earned by our officers:\nName\nYear\nSalary\nBonus\nStock\nAwards\n(1)\nOptions\nAwards\nAll Other\nCompensation\n(2)\nTotal\nTimothy Keogh\n$\n180,000\n$\n-\n$\n30,000\n$\n-\n$\n-\n$\n210,000\nChief Executive Officer\n$\n180,000\n$\n-\n$\n-\n$\n-\n$\n-\n$\n180,000\nBenjamin J. Barton\n$\n-\n$\n-\n$\n30,000\n$\n-\n$\n180,000\n$\n210,000\nChief Financial Officer\n$\n-\n$\n-\n$\n-\n$\n-\n$\n180,000\n$\n180,000\n(1)\nThe value of all stock awarded during the periods covered by the table calculated according to ASC 718-10-30-3, which represented the grant date fair value.\n(2)\nConsulting fees paid to Strategic Capital Partners, LLC, an entity controlled by Mr. Barton.\nThe following shows the amounts we expect to pay to our officers during the year ended September 30, 2023 and the amount of time these persons expect to devote to our business.\nName\nProjected\nCompensation\nPercentage of\ntime\nto be devoted\nto the\nCompany's\nbusiness\nTimothy Keogh\n$ 180,000\n%\nBenjamin J. Barton\n$ 180,000\n%\n(1) represents amounts to be paid to Strategic Capital Partners, LLC, as consulting fees\nOur executive officers are compensated through the following three components:\n●\nbase salary;\n●\nlong-term incentives (stock options and/or grants of stock); and\n●\nbenefits.\nThese components provide a balanced mix of base compensation and compensation that is contingent upon the executive officers individual performance. A goal of the compensation program is to provide executive officers with a reasonable level of security through base salary and benefits. We want to ensure that our compensation program is appropriately designed to encourage executive officer retention and motivation to create shareholder value. Salaries generally have been targeted to be competitive when compared to the salary levels of persons holding similar positions in other publicly traded companies of comparable size. The executive officers responsibilities, experience, expertise and individual performance are also considered.\nThe Company has a Stock Incentive Plan (the plan) that provides for the grant of Incentive Stock Options, Non-Qualified Stock Options or Stock Bonuses to persons who are employees of the Company, employees of subsidiaries of the Company, directors, officers, and consultants. Under the plan, the Company may grant stock bonuses or options (up to a combined maximum of 2,500,000 shares or options). Each option allows for the purchase of one share of common stock, subject to an exercise price and vesting schedule to be established by the board of directors at the time of the grant.\nThe Plan is administered by our Board of Directors which has the authority to determine the number of shares to be issued as a stock bonus, and the number of shares issuable upon the exercise of options, the exercise price and expiration date of options, and when, and upon what conditions options granted under the Plan will vest or otherwise be subject to forfeiture and cancellation.\nThe following table shows the weighted average exercise price of the outstanding options granted pursuant to the Companys Stock Incentive Plan as of September 30, 2022, the Companys recently completed fiscal year:\nPlan\nTotal Shares\nReserved\nUnder the\nPlan\nNumber of\nSecurities to\nbe Issued Upon\nExercise\nof Outstanding\nOptions\nWeighted-\nAverage\nExercise Price\nof Outstanding\nOptions\nNumber of Securities\nRemaining Available\nfor\nFuture Issuances\nUnder\nEquity\nCompensation\nPlans (Excluding\nSecurities Reflected\nin\nColumn (a))\n(a)\n(b)\n(c)\nStock Incentive Plan\n2,500,000\n1,850,000\n1.99\n650,000\nThe Companys Stock Incentive Plan has not been approved by the Companys shareholders.\nThe following shows certain information as of November 29, 2022 concerning the stock options and stock bonuses granted pursuant to the Stock Incentive Plan. Each option represents the right to purchase one share of our common stock.\nTotal Shares\nReserved\nUnder the\nPlan\nShares Reserved for\nOutstanding Options\nShares Issued As Stock\nBonus\nRemaining\nOptions/Shares Under\nthe Plan\n2,500,000\n1,850,000\n-\n650,000 ITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table shows the ownership, as of November 30, 2022, of those persons owning beneficially 5% or more of our common stock and the number and percentage of outstanding shares owned by each of our directors and officers and by all officers and directors as a group. Each owner has sole voting and investment power over their shares of common stock.\nName\nShares Owned\n(2)\nPercentage of\nOutstanding\nshares\nTimothy Keogh\n1,365,625\n5.6\n%\nBenjamin J. Barton\n160,625\n0.7\n%\nJ. Tyler Opel\n160,625\n0.7\n%\nStrategic Capital Partners, LLC (1)\n8,966,665\n36.8\n%\nAll officers and directors as a group (three persons)\n10,653,540\n43.8\n%\n(1)\nStrategic Capital Partners, LLC, is controlled by Mr. Barton.\n(2)\nDoes not include shares issuable upon the exercise of the warrants and options listed below, all of which were exercisable as of November 30, 2022.\nName\nDate of\nIssuance\nShares upon\nexercise of\nwarrants or\noptions\nExercise\nPrice\nExpiration\nDate\nStrategic Capital Partners, LLC (1)\n9/30/2019\n1,500,000\n$ 1.25\n12/31/2024\nTimothy Keogh\n9/30/2019\n300,000\n$ 1.50\n8/2/2024\n9/30/2020\n250,000\n$ 1.50\n9/30/2025\n9/30/2020\n250,000\n$ 3.00\n9/30/2025\nBen Barton\n9/30/2019\n300,000\n$ 1.50\n8/2/2024\n9/30/2020\n250,000\n$ 1.50\n9/30/2025\n9/30/2020\n250,000\n$ 3.00\n9/30/2025\n(1)\nStrategic Capital Partners, LLC, is controlled by Mr. Barton. ITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS.\nOn September 30, 2019, we amended and modified two notes payable due to Strategic Capital Partners, LLC a company controlled by Benjamin J. Barton, one of our officers and directors with balances of $1,000,000 and $756,646, into one note, in the principal amount of $1,756,646, bearing interest of 9% per year and maturing on December 31, 2022. Additionally, the conversion option in the first note was eliminated. As additional consideration for the modification of the notes we issued SCP warrants to purchase 1,500,000 shares of our common stock. The warrants are exercisable at a price of $1.25 per share at any time on or before December 31, 2024.\nOn April 7, 2016, we signed agreements with BASK (formerly Coastal Companion, Inc). BASK is one of a limited number of organizations that has received a provisional or final registration to cultivate, process and sell medical cannabis by the Massachusetts Cannabis Control Commission.\nPursuant to the agreements, we provided BASK with financing for construction and working capital required for BASKs approved dispensary and cultivation center in Fairhaven, MA.\nOn August 15, 2018, the Company combined the construction and working capital advances of $129,634 and accrued interest of $44,517 into a new loan with payments over 5 years with 18% interest. As of September 30, 2022, the outstanding loan balance was $43,185.\nBASK has entered into a 15-Year NNN lease of Building 1 of the MCC. The lease commenced on September 1, 2019 and includes a base rent and a revenue participation fee. As of September 30, 2022, the BASK tenant receivable balance was $251,462.\nTim Keogh, our Chief Executive Officer, was a Board Member of BASK between August 2013 and November 2021. ITEM 14.\nPRINCIPAL ACCOUNTING FEES AND SERVICES.\nFor the years ended September 30, 2022 and 2021, MaloneBailey, LLP served as our independent registered public accounting firm.\nThe following table sets forth the aggregate fees paid or accrued for professional services rendered by our independent accountants for the audit of our annual consolidated financial statements for the years ended September 30, 2022 and 2021, and the aggregate fees paid or accrued for audit-related services and all other services rendered by our independent accountants for those years.\nYear Ended September 30,\nAudit fees\n$ 67,000\n$ 53,500\nTax fees\n-\n-\nOther\n-\n-\nTotal\n$ 67,000\n$ 53,500\nThe category of Audit fees includes fees for our annual audit, quarterly reviews of our 10-Q reports, and services rendered in connection with statutory or regulatory filings with the SEC. Tax fees include fees incurred in the review and preparation of our annual income tax filings.\nOur Board of Directors, which serves as our audit committee, pre-approves the scope and estimated costs of all services rendered by our Principal Accountants.\nPART IV ITEM 15.\nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES.\nConsolidated Financial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID 206)\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statement of Changes in Stockholders' Equity\nConsolidated Statements of Cash Flows\nNotes to the Consolidated Financial Statements\nItem 16.\nExhibits and Financial Statement Schedules\nThe following exhibits are filed with this Report:\n3.1.1\nCertificate of Incorporation (1)\n3.1.2\nCertificate of Ownership and Merger (name change to AmeriCann) (2)\n3.2\nBylaws (2)\n4.1\nForm of Series I Warrant (2)\n4.2\nForm of Series II Warrant (2)\n4.3\nForm of Series III Warrant (2)\n4.4\nForm of Series IV Warrant. See Exhibit 10.4\n4.5\nForm of Series V Warrant (2)\n4.6\nForm of Series VI Warrant (2)\n4.7\nForm of Series VII Warrant (2)\n4.8\nForm of Series VIII Warrant (3)\n4.9\nForm of Series IX Warrant (4)\n4.10\nForm of Series X Warrant (4)\n4.11\nForm of Series XI Warrant (5)\n4.12\nForm of Series XII Warrant (5)\n10.1\nAgreements with Wellness Group Pharms (2)\n10.2\nLoan Modification Agreement with Strategic Capital Partners, LLC, together with Warrants and Promissory Notes (2)\n10.3\nAgreements with Coastal Compassion, Inc. (2)\n10.4\nShare Purchase Agreement with Massachusetts Medical Properties, LLC, together with Warrant (Series IV) and Ground Lease (2)\n10.5\nInvestment Agreement with Mountain States Capital, LLC (2)\n10.6\nFirst Amendment to Ground Lease (2)\n10.7\nLoan Agreement, including form of warrant (Series CL) ($800,000) (2)\n10.8\nLoan Agreement ($128,000) (2)\n10.9\nLoan Agreement ($68,000) (2)\n10.10\nForm of Convertible Note (December 2017 financing) (2)\n10.11\nForm of Convertible Note (February 2018 financing) (3)\n10.12\nSecond Amendment to Ground Lease (3)\n10.13\nThird Amendment to Ground Lease (3)\n10.14\nPromissory Note (5)\n10.15\nMortgage and Security Agreement (5)\n31.1\nRule 13a-14(a) Certifications\n31.2\nRule 13a-14(a) Certifications\nSection 1350 Certifications\n101.INS\nInline XBRL Instance Document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n(1)\nIncorporated by reference to Exhibit 3.1 filed with the Companys Registration Statement on Form 10.\n(2)\nIncorporated by reference to same exhibit filed with Amendment No. 1 to the Companys Registration Statement on Form S-1 (File #333-222207).\n(3)\nIncorporated by reference to same exhibit filed with the Companys Registration Statement on Form S-1 (File #333-224256).\n(4)\nIncorporated by reference to the same exhibit filed with the Companys Registration Statement on Form S-1 (File #333-227388).\n(5)\nIncorporated by reference to the same exhibit filed with the Companys Registration Statement on Form S-1 (File # 333-233981).\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of\nAmeriCann, Inc.\nDenver, CO\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of AmeriCann, Inc and its subsidiaries (collectively, the Company) as of September 30, 2022 and 2021, and the related consolidated statements of operations, changes in stockholders equity, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of their operations and their cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has an accumulated deficit that raises substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\n/s/ MaloneBailey, LLP\nwww.malonebailey.com\nWe have served as the Company's auditor since 2016.\nHouston, Texas\nDecember 29, 2022\nAMERICANN, INC.\nCONSOLIDATED BALANCE SHEETS\nSeptember 30, 2022\nSeptember 30, 2021\nAssets\nCurrent Assets:\nCash and cash equivalents\n$ 1,341,127\n$ 696,380\nRestricted cash\n9,967\n9,989\nTenant receivable\n251,462\n-\nTenant receivable - related party\n-\n258,854\nPrepaid expenses and other current assets\n62,766\n12,970\nCurrent portion of note receivable\n43,185\n-\nCurrent portion of note receivable - related party\n-\n41,564\nTotal current assets\n1,708,507\n1,019,757\nConstruction in progress\n338,977\n93,400\nProperty and Equipment, net\n6,611,961\n7,061,884\nOperating lease - right-of-use asset\n6,778,085\n6,846,476\nNote receivable - related party\n-\n43,185\nTotal assets\n$ 15,437,530\n$ 15,064,702\nLiabilities and Stockholders' Equity\nCurrent Liabilities:\nAccounts payable and accrued expenses\n$ 193,170\n$ 190,020\nAccounts payable - related party\n82,500\n97,500\nInterest payable (including $4,303 and $4,303 to related parties)\n53,964\n54,194\nOther payables\n8,612\n12,128\nOperating lease liability, short term\n11,283\n10,432\nNotes payable\n150,000\n150,000\nTotal current liabilities\n499,529\n514,274\nNotes payable (net of unamortized discounts of $162,353 and $269,506)\n4,337,647\n4,230,494\nNotes payable - related party\n581,646\n581,646\nOperating lease liability, long term\n4,216,596\n4,227,878\nTotal liabilities\n9,635,418\n9,554,292\nCommitments and contingencies - see Note 10\nStockholders' Equity:\nPreferred stock, $0.0001 par value; 20,000,000 shares authorized; no shares issued and outstanding\n-\n-\nCommon stock, $0.0001 par value; 100,000,000 shares authorized; 24,391,961 and 24,196,310 shares issued and outstanding as of September 30, 2022 and 2021, respectively\n2,439\n2,420\nAdditional paid in capital\n25,558,362\n25,093,435\nAccumulated deficit\n(19,758,689 )\n(19,585,445 )\nTotal stockholders' equity\n5,802,112\n5,510,410\nTotal liabilities and stockholders' equity\n$ 15,437,530\n$ 15,064,702\nSee accompanying notes to consolidated financial statements.\nAMERICANN, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear ended September 30,\nRental income\n$ 2,520,555\n$ -\nRental income - related party\n407,264\n2,028,551\nCost of revenues\n45,950\n38,149\nGross profit\n2,881,869\n1,990,402\nOperating expenses:\nAdvertising and marketing\n37,731\n42,417\nProfessional fees\n343,829\n311,288\nGeneral and administrative expenses\n2,017,582\n1,592,404\nTotal operating expenses\n2,399,142\n1,946,109\nIncome from operations\n482,727\n44,293\nOther income (expense):\nInterest income\n11,504\n18,305\nInterest expense\n(615,127 )\n(873,143 )\nInterest expense - related party\n(52,348 )\n(52,348 )\nTotal other income (expense)\n(655,971 )\n(907,186 )\nNet loss\n$ (173,244 )\n$ (862,893 )\nBasic and diluted (loss) income per common share\n$ (0.01 )\n$ (0.04 )\nWeighted average common shares outstanding\n24,333,911\n23,867,543\nSee accompanying notes to consolidated financial statements.\nAMERICANN, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS' EQUITY\nAdditional\nPreferred Stock\nCommon Stock\nPaid In\nAccumulated\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nTotal\nBalances, September 30, 2020\n-\n$ -\n23,696,310\n2,370\n24,593,485\n(18,722,552 )\n5,873,303\nStock issued for warrants exercised, net\n-\n-\n500,000\n499,950\n-\n500,000\nNet loss\n-\n-\n-\n-\n-\n(862,893 )\n(862,893 )\nBalances, September 30, 2021\n-\n$ -\n24,196,310\n2,420\n25,093,435\n(19,585,445 )\n5,510,410\nStock issued for services\n-\n-\n195,651\n89,981\n-\n90,000\nExtension of warrants\n-\n-\n-\n-\n374,946\n-\n374,946\nNet loss\n-\n-\n-\n-\n-\n(173,244 )\n(173,244 )\nBalances, September 30, 2022\n-\n$ -\n24,391,961\n2,439\n25,558,362\n(19,758,689 )\n5,802,112\nSee accompanying notes to consolidated financial statements.\nAMERICANN, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended September 30,\nCash flows from operating activities:\nNet loss\n$ (173,244 )\n$ (862,893 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation and amortization\n449,923\n450,537\nAmortization of right of use assets\n68,391\n67,604\nStock based compensation and warrants revaluation expense\n374,946\n-\nStock issued for services\n90,000\n-\nAmortization of debt discount\n107,153\n304,727\nChanges in operating assets and liabilities:\nTenant receivable\n258,854\n-\nTenant receivable - related party\n(251,462 )\n(134,237 )\nPrepaid expenses\n(49,796 )\n(10,470 )\nAccounts payable and accrued expenses\n3,150\n(86,135 )\nOperating lease liability\n(10,431 )\n(9,642 )\nAccounts payable - related party\n(15,000 )\n32,500\nInterest payable\n(230 )\n3,242\nInterest payable - related party\n-\n(21,943 )\nOther payables\n(3,516 )\n(8,443 )\nNet cash flows provided by (used in) operations\n848,738\n(275,153 )\nCash flows from investing activities:\nAdditions to construction in progress\n(245,577 )\n(93,400 )\nPayments received on notes receivable - related party\n41,564\n34,763\nNet cash flows (used in) investing activities\n(204,013 )\n(58,637 )\nCash flows from financing activities:\nProceeds from note payable, net of financing costs\n-\n800,000\nProceeds from the exercise of warrants\n-\n500,000\nPrincipal payments on notes payable\n-\n(453,000 )\nNet cash flows provided by financing activities\n-\n847,000\nNet increase in cash, cash equivalents, and restricted cash\n644,725\n513,210\nCash, cash equivalents, and restricted cash at beginning of period\n706,369\n193,159\nCash, cash equivalents, and restricted cash at end of period\n$ 1,351,094\n$ 706,369\n$ -\nSupplementary Disclosure of Cash Flow Information:\nCash paid for interest\n$ 563,799\n$ 639,466\nCash paid for income taxes\n$ -\n$ -\nSee accompanying notes to consolidated financial statements.\nAMERICANN, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1.\nDESCRIPTION OF BUSINESS AND SIGNIFICANT ACCOUNTING POLICIES\nDescription of Business\nAmeriCann, Inc. (\"the Company\", we, our, or \"the Issuer\") was organized under the laws of the State of Delaware on June 25, 2010.\nOn January 17, 2014, a privately held limited liability company acquired approximately 93% of the Company's outstanding shares of common stock from several of the Company's shareholders which resulted in a change in control of the Company.\nThe Company's business plan is to design, develop, lease and operate state-of-the-art cultivation, processing and manufacturing facilities for licensed cannabis businesses throughout the United States.\nThe Company's activities are subject to significant risks and uncertainties including failure to secure funding to expand its operations.\nCertain prior period amounts have been reclassified to conform with current period presentation. These reclassifications have no impact on net loss.\nAll significant intercompany balances and transactions have been eliminated in the consolidated financial statements.\nSummary of Significant Accounting Policies\nThis summary of significant accounting policies of the Company is presented to assist in understanding the Companys consolidated financial statements. The consolidated financial statements and notes are representations of the Companys management, which is responsible for their integrity and objectivity. These accounting policies conform to accounting principles generally accepted in the United States and have been consistently applied in the preparation of the consolidated financial statements.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of AmeriCann, Inc. and its wholly-owned subsidiaries. All significant intercompany balances and transactions have been eliminated in the consolidated financial statements.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. The more significant estimates and assumptions made by management are valuation of equity instruments, deferred tax asset valuation and allowance and collectability of accounts receivable and long-lived assets. Actual results could differ from those estimates as the current economic environment has increased the degree of uncertainty inherent in these estimates and assumptions.\nCash and Cash Equivalents\nCash and cash equivalents includes cash on hand, demand deposit accounts and temporary cash investments with maturities of ninety days or less at the date of purchase.\nIncome Taxes\nIn accordance with ASC Topic 740, Income Taxes, the provision for income taxes is computed using the asset and liability method. The liability method measures deferred income taxes by applying enacted statutory rates in effect at the consolidated balance sheet date to the differences between the tax basis of assets and liabilities and their reported amounts on the consolidated financial statements. The resulting deferred tax assets or liabilities have been adjusted to reflect changes in tax laws as they occur. A valuation allowance is provided when it is more likely than not that a deferred tax asset will not be realized.\nWe expect to recognize the financial statement benefit of an uncertain tax position only after considering the probability that a tax authority would sustain the position in an examination. For tax positions meeting a \"more-likely-than-not\" threshold, the amount to be recognized in the consolidated financial statements will be the benefit expected to be realized upon settlement with the tax authority. For tax positions not meeting the threshold, no financial statement benefit is recognized. As of September 30, 2021 and 2020, we had no uncertain tax positions. We recognize interest and penalties, if any, related to uncertain tax positions as general and administrative expenses. We currently have no federal or state tax examinations nor have we had any federal or state examinations since our inception. To date, we have not incurred any interest or tax penalties.\nFor federal tax purposes, our 2019 through 2021 tax years remain open for examination by the tax authorities under the normal three-year statute of limitations.\nConcentration of Credit Risks and Significant Customers\nFinancial instruments that potentially subject us to concentrations of credit risk consist principally of cash, notes receivable, deposits tenant receivables and notes receivable. We place our cash with high credit quality financial institutions. As of September 30, 2022 and 2021, we had outstanding notes receivable of $43,185 and $84,749, respectively and tenant receivables of $251,462 and $258,854, respectively, with BASK, Inc. (\"BASK\"), a related party.\nFor the year ended September 30, 2022, all of the Companys revenue was earned from one customer, BASK (which was a related party prior to December 2021, see Note 6).\nFinancial Instruments and Fair Value of Financial Instruments\nWe adopted ASC Topic 820, Fair Value Measurement, for assets and liabilities measured at fair value on a recurring basis. ASC Topic 820 establishes a common definition for fair value to be applied to existing US GAAP that requires the use of fair value measurements that establishes a framework for measuring fair value and expands disclosure of fair value measurements.\nASC Topic 820 defines fair value as the price that would be received upon the sale of an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Additionally, ASC Topic 820 requires the use of valuation techniques that maximize the use of observable inputs and minimize the use of unobservable inputs. These inputs are prioritized below:\nLevel 1:\nObservable inputs such as quoted market prices in active markets for identical assets or liabilities\nLevel 2:\nObservable market-based inputs or unobservable inputs that are corroborated by market data\nLevel 3:\nUnobservable inputs for which there is little or no market data, which require the use of the reporting entitys own assumptions.\nThe carrying value of financial assets and liabilities recorded at fair value is measured on a recurring or nonrecurring basis. Financial assets and liabilities measured on a non-recurring basis are those that are adjusted to fair value when a significant event occurs. We had no financial assets or liabilities carried and measured on a nonrecurring basis during the reporting periods. Financial assets and liabilities measured on a recurring basis are those that are adjusted to fair value each time a financial statement is prepared. We had no financial assets or liabilities carried and measured on a recurring basis during the reporting periods. The carrying value of short-term financial instruments, including cash and cash equivalents, tenant and notes receivable, accounts payable and accrued expenses, and short-term borrowings approximate fair value due to the relatively short period to maturity for these instruments. The long-term borrowings approximate fair value since the related rates of interest approximates current market rates.\nDerivative Liabilities\nWe evaluate stock options, stock warrants or other contracts to determine if those contracts or embedded components of those contracts qualify as derivatives to be separately accounted for under the relevant sections of ASC Topic 815-40, Derivative Instruments and Hedging: Contracts in Entitys Own Equity. The result of this accounting treatment could be that the fair value of a financial instrument is classified as a derivative instrument and is marked-to-market at each consolidated balance sheet date and recorded as a liability. In the event that the fair value is recorded as a liability, the change in fair value is recorded in the consolidated statement of operations as other income or other expense. Upon conversion or exercise of a derivative instrument, the instrument is marked to fair value at the conversion date and then that fair value is reclassified to equity. Financial instruments that are initially classified as equity that become subject to reclassification under ASC Topic 815-40 are reclassified to a liability account at the fair value of the instrument on the reclassification date. We determined that none of our financial instruments meet the criteria for derivative accounting as of September 30, 2022 and 2021.\nOperating leases\nEffective October 1, 2019, we adopted Topic 842 using the effective date method. Under this method, periods prior to adoption remain unchanged. We determine if an arrangement is a lease at inception.\nRight of Use (ROU) assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. Variable lease payments are not included in the calculation of the right-of-use asset and lease liability due to uncertainty of the payment amount and are recorded as lease expense in the period incurred. As most of our leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. We use the implicit rate when readily determinable. Our lease terms may include options to extend or terminate the lease when it is reasonably certain that we will exercise that option. Lease expense for lease payments is recognized on a straight-line basis over the lease term.\nUnder the available practical expedient, we account for the lease and non-lease components as a single lease component for all classes of underlying assets as both a lessee and lessor. Further, we elected a short-term lease exception policy on all classes of underlying assets, permitting us to not apply the recognition requirements of this standard to short-term leases (i.e. leases with terms of 12 months or less).\nLong-Lived Assets\nOur long-lived assets consisted of property, plant and equipment and are reviewed for impairment in accordance with the guidance of the Topic ASC Topic 360, Property, Plant, and Equipment. We test for impairment losses on long-lived assets used in operations whenever events or changes in circumstances indicate that the carrying amount of the asset may not be recoverable. Recoverability of an asset to be held and used is measured by a comparison of the carrying amount of an asset to the future undiscounted cash flows expected to be generated by the asset. If such asset is considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the asset exceeds its fair value. Impairment evaluations involve management's estimates on asset useful lives and future cash flows. Actual useful lives and cash flows could be different from those estimated by management which could have a material effect on our reporting results and financial positions. Fair value is determined through various valuation techniques including discounted cash flow models, quoted market values and third-party independent appraisals, as considered necessary. There were no impairment losses recognized for the years ended September 30, 2022 and 2021.\nProperty, Plant and Equipment\nProperty, plant and equipment are stated at cost. Depreciation of property, plant and equipment begins in the month following the month when the asset is placed into service and is provided using the straight-line method for financial reporting purposes at rates based on the estimated useful lives of the assets. Estimated useful lives range from three to twenty years. Property, plant and equipment consist of:\nSeptember 30,\nSeptember 30,\nBuildings and improvements\n$ 7,608,087\n$ 7,608,087\nComputer equipment\n349,576\n349,576\nFurniture and equipment\n2,764\n2,764\nTotal\n7,960,427\n7,960,427\nAccumulated depreciation\n(1,348,466 )\n(898,543 )\nProperty and equipment, net\n$ 6,611,961\n$ 7,061,884\nDepreciation expense for the years ended September 30, 2022 and 2021 amounted to $449,923 and $450,537, respectively.\nEquity Instruments Issued to Non-Employees for Acquiring Goods or Services\nEffective October 1, 2019, the Company adopted ASU 2018-07, Compensation - Stock Compensation (Topic 718): Improvements to Nonemployee Share-based Payment Accounting, which addresses aspects of the accounting for nonemployee share-based payment transactions. Upon adoption, all of the issuances of stock to non-employees for goods and services are treated in the same matter as share based awards to employees. The adoption did not have an impact on the Companys financial statements.\nNon-Cash Equity Transactions\nShares of equity instruments issued for noncash consideration are recorded at the estimated fair market value of the consideration granted based on the estimated fair market value of the equity instrument, or at the estimated fair market value of the goods or services received, whichever is more readily determinable.\nStock-Based Compensation\nThe Company accounts for share-based awards to employees in accordance with ASC Topic 718, Stock Compensation Under this guidance, stock compensation expense is measured at the grant date, based on the fair value of the award, and is recognized as an expense over the estimated service period (generally the vesting period) on the straight-line attribute method. Effective October 1, 2019, the Company adopted ASU 2018-07, Compensation - Stock Compensation (Topic 718): Improvements to Nonemployee Share-based Payment Accounting, which addresses aspects of the accounting for nonemployee share-based payment transactions.\nRelated Parties\nA party is considered to be related to us if the party directly or indirectly or through one or more intermediaries, controls, is controlled by, or is under common control with us. Related parties also include our principal owners, our management, members of the immediate families of our principal owners and our management and other parties with which we may deal if one party controls or can significantly influence the management or operating policies of the other to an extent that one of the transacting parties might be prevented from fully pursuing its own separate interests. A party which can significantly influence the management or operating policies of the transacting parties, or if it has an ownership interest in one of the transacting parties and can significantly influence the other to an extent that one or more of the transacting parties might be prevented from fully pursuing its own separate interests, is also a related party.\nRevenue Recognition\nEffective October 1, 2018, we adopted ASU 2014-09, Revenue from Contracts with Customers (Topic 606). Under the new standard, we recognize revenues when the following criteria are met: (i) persuasive evidence of a contract with a customer exists, (ii) identifiable performance obligations under the contract exist, (iii) the transaction price is determinable for each performance obligation, (iv) the transaction price is allocated to each performance obligation, and (v) when the performance obligations are satisfied. Currently, we derive all of our revenues from property leases. Property leases are not within the scope of ASC 606.\nProperty lease revenue is earned through annual leases for facilities used in agricultural/manufacturing activities and the Company records revenues on a straight-line basis over the term of these leases. Property lease revenues from these sources are recurring on an annual basis. Unearned property lease revenues were $0 at both September 30, 2022 and 2021. The Company also receives a revenue participation fee which is considered a variable payment and thus is recorded in the period earned in accordance with ASC 842.\nAdvertising Expense\nAdvertising, promotional and selling expenses consist of sales and marketing expenses, and promotional activity expenses. Expenses are recognized when incurred.\nGeneral and Administrative Expense\nGeneral and administrative expenses consist of professional service fees, rent and utility expenses, meals, travel and entertainment expenses, and other general and administrative overhead costs. Expenses are recognized when incurred.\nLoss per Share\nWe compute net loss per share in accordance with the ASC Topic 260. The ASC specifies the computation, presentation and disclosure requirements for loss per share for entities with publicly held common stock.\nBasic loss per share amounts is computed by dividing the net loss by the weighted average number of common shares outstanding. Shares issuable upon the exercise of equity instruments such as warrants and options were not included in the loss per share calculations for 2022 and 2021because the inclusion would have been anti-dilutive.\nRecently Issued Accounting Pronouncements\nDuring the year ended September 30, 2022, there have been no new, or existing, recently issued accounting pronouncements that are of significance, or potential significance, that impact the Companys consolidated financial statements.\nNOTE 2.\nGOING CONCERN\nThe accompanying consolidated financial statements have been prepared assuming the Company will continue as a going concern, which contemplates, among other things, the realization of assets and satisfaction of liabilities in the normal course of business. The Company had an accumulated deficit of $19,758,689 and $19,585,445 at September 30, 2022 and 2021, respectively, and had a net loss of $173,244 and 862,893 for the years ended September 30, 2022 and 2021, respectively. These matters, among others, raise substantial doubt about the Companys ability to continue as a going concern. While the Company is attempting to increase operations and generate additional revenues, the Company's cash position may not be significant enough to support the Company's daily operations. Management intends to raise additional funds through the sale of its securities.\nManagement believes that the actions presently being taken to further implement its business plan and generate additional revenues provide the opportunity for the Company to continue as a going concern. While the Company believes in the viability of its strategy to generate additional revenues and in its ability to raise additional funds, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon the Company's ability to further implement its business plan and generate additional revenues. The consolidated financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nNOTE 3.\nCASH AND CASH EQUIVALENTS AND RESTRICTED CASH\nThe following table provides a reconciliation of cash, cash equivalents and restricted cash reported within the consolidated balance sheets that sum to the total of the same such amounts in the consolidated statements of cash flows:\nSeptember 30,\nSeptember 30,\nCash and cash equivalents\n$ 1,341,127\n$ 696,380\nRestricted cash\n9,967\n9,989\nTotal cash, cash equivalents, and restricted cash shown in the cash flow statement\n$ 1,351,094\n$ 706,369\nAmounts included in restricted cash represent those required to be set aside by the Cannabis Control Commission in Massachusetts as well as by a contractual agreement with a lender for the payment of specific construction related expenditures as part of the Companys property development in Massachusetts.\nNOTE 4.\nNOTES RECEIVABLE\nNotes and other receivables as of September 30, 2022 and 2021, consisted of the following:\nSeptember 30,\nSeptember 30,\nNote receivable from BASK (related party at September 30, 2021), interest rate of 18.0%; monthly principal and interest payments of $4,422, maturing in 2023.\n43,185\n84,749\n43,185\n84,749\nLess: Current portion\n(43,185 )\n(41,564 )\n$ -\n$ 43,185\nNOTE 5.\nNOTES PAYABLE\nUnrelated\nOn February 25, 2021, the Company borrowed $300,000 from an unrelated party. The loan was unsecured, bore interest at a rate of 11% and was due and payable on August 2, 2021. This loan was fully paid in July 2021.\nOn August 25, 2020, the Company borrowed $153,000 from an unrelated party. The loan was unsecured, had an interest rate of 10% per year and was due and payable on August 25, 2021. In February 2021, the Company paid off the loan principal balance of $153,000 and paid a prepayment fee of $47,941. The Company incurred debt issuance costs of $3,000 which was recorded as a debt discount. Amortizations expense related to the debt discount was $2,750 during the year ended September 30, 2021.\nOn August 2, 2019 the Company secured a $4,000,000 investment from an unrelated third party in the form of a loan. The loan was evidenced by a note which bears interest at the rate of 11% per year, was originally due and payable on August 2, 2022 and is secured by a first lien on Building 1 at the Massachusetts Cannabis Center (MCC).\nThe note holder also received a warrant which allows the holder to purchase 600,000 shares of the Companys common stock at a price of $1.50 per share. The warrant will expire on the earlier of (i) August 2, 2024 or (ii) twenty days after written notice of the holder that the daily Volume Weighted Average Price of the Companys common stock was at least $4.00 for twenty consecutive trading days and the average daily volume of trades of the Companys common stock during the twenty trading days was at least 150,000 shares.\nThe broker for the loan received a cash commission of $320,000 plus warrants to purchase 48,000 shares of the Company's common stock. The warrants are exercisable at a price of $1.50 per share and expire on August 2, 2024. The cash commission and the fair value of the warrants amounting to $52,392 were recognized as a discount to the note.\nThe Company allocated the proceeds between the note and the warrants based on their relative fair values. The relative fair value of the 600,000 warrants was $562,762 which was recognized as additional paid in capital and a corresponding debt discount.\nOn December 4, 2020, the loan was modified and increased by $500,000. The maturity of the loan was extended to August 1, 2023. All other provisions of the original loan remain the same. The debt modification was deemed not substantial and was accounted for as a debt modification. The broker for the loan received a cash commission of $40,000 which was expensed when incurred.\nAt September 30, 2022, the outstanding principal on this note was $4,500,000 and the unamortized debt discount was $165,600. All debt discounts are being amortized on a straight-line basis over the terms of the note. Amortization expense related to the debt discounts was $103,906 and $301,977 for the years ended September 30, 2022 and 2021, respectively.\nFebruary 2018 Convertible Note Offering\nOn February 12, 2018 the Company sold convertible notes in the principal amount of $810,000 to a group of accredited investors. The notes are unsecured and bear interest at 8% per year. At September 30, 2022 and September 30, 2021, the outstanding principal on these notes was $150,000. On October 12, 2020, the remaining note was extended to mature on June 30, 2022. On December 15, 2021, the remaining note was extended to mature on December 31, 2022.\nRelated Party\nSCP. On September 30, 2019, we entered into an amended note with Strategic Capital Partners, LLC (SCP), in the principal amount of $1,756,646, bearing interest of 9% per year and maturing on December 31, 2022. During the year ended September 30, 2022, the maturity of the note was extended to December 31, 2023.\nAccrued interest on the note was $4,303 at September 30, 2022 and September 30, 2021, respectively.\nAt September 30, 2022 and 2021, the outstanding principal on this note was $581,646.\nDuring the year ended September 30, 2022, the Company incurred $180,000 of consulting expenses with SCP and paid $195,000. As of September 30, 2022, $82,500 remains unpaid. During the year ended September 30, 2021, the Company incurred $180,000 of consulting expenses with SCP of which $97,500 remained outstanding at September 30, 2021.\nSCP is controlled by Benjamin J. Bardon, one of our officers and directors and principal shareholders.\nNOTE 6.\nRELATED PARTY TRANSACTIONS\nBASK. On April 7, 2016, we signed agreements with BASK. BASK is one of a limited number of organizations that has received a provisional or final registration to cultivate, process and sell medical and adult use cannabis by the Massachusetts Cannabis Control Commission.\nPursuant to the agreements, we agreed to provide BASK with financing for construction and working capital required for BASKs approved dispensary and cultivation center in Fairhaven, MA.\nOn August 15, 2018, the Company combined the construction and working capital advances of $129,634 and accrued interest of $44,517 and setup a new loan with payments over 5 years with 18% interest. At September 30, 2022 and 2021, the outstanding balance on the note receivable was $43,185 and $84,749, respectively.\nOn July 26, 2019, the Company entered into a 15-Year Triple Net lease of Building 1 of the MCC with BASK. The lease commenced on September 1, 2019 and includes an annual base rent of $135,000 and a revenue participation fee equivalent to 15% of BASK's gross revenues. As of September 30, 2022, the BASK tenant receivable balance was $251,462.\nTim Keogh, our Chief Executive Officer, was a Board Member of BASK between August 2013 and November 2021.\nNOTE 7.\nLOSS PER SHARE\nThe following table sets forth the computation of basic and diluted net loss per share:\nYear Ended\nSeptember 30,\nNet loss attributable to common stockholders\n$ (173,244 )\n$ (862,893 )\nBasic weighted average outstanding shares of common stock\n24,333,911\n23,867,543\nDilutive effects of common share equivalents\n-\n-\nDilutive weighted average outstanding shares of common stock\n24,333,911\n23,867,543\nBasic and diluted net loss income per share of common stock\n$ (0.01 )\n$ (0.04 )\nAs of September 30, 2022, we have excluded 1,700,000 of stock options and 4,026,650 of warrants and 100,000 shares that would be issued from conversion of outstanding convertible notes from the computation of diluted net loss per share since the effects are anti-dilutive. As of September 30, 2021, we have excluded 1,700,000 of stock options and 7,666,650 of warrants and 100,000 shares that would be issued from conversion of outstanding convertible notes from the computation of diluted net loss per share since the effects are anti-dilutive.\nNOTE 8.\nINCOME TAXES\nDeferred income taxes arise from the temporary differences between financial statement and income tax recognition of net operating losses. These loss carryovers are limited under the Internal Revenue Code should a significant change in ownership occur. The Company accounts for income taxes pursuant to ASC Topic 740. The Company has made an early adoption of ASU 2015-17 Balance Sheet Classification of Deferred Taxes.\nDeferred income taxes arise from the temporary differences between financial statement and income tax recognition of net operating losses and other items. Loss carryovers are limited under the Internal Revenue Code should a significant change in ownership occur.\nThe components of the deferred income tax assets and liabilities arising under ASC Topic 740 were as follows:\nSeptember 30,\nDeferred tax assets\n$ 2,651,840\n$ 3,586,062\nDeferred tax liabilities\n-\n-\nValuation allowance\n(2,651,840 )\n(3,586,062 )\nNet deferred tax assets/(liabilities)\n-\n-\nThe types of temporary differences between the tax basis of assets and their financial reporting amounts that give rise to a significant portion of the deferred assets and liabilities are as follows:\nSeptember 30,\nTemporary\nDifference\nTax Effect\nTemporary\nDifference\nTax Effect\nDeferred tax assets\nNet operating loss\n$ 173,244\n$ 53,550\n$ 862,893\n$ 266,720\nTax impact true up\n-\n-\n-\n-\nOther temporary differences\n(721,657 )\n$ (223,064 )\n(507,485 )\n$ (156,864 )\nNet deferred tax assets\n(548,413 )\n(169,514\n)\n355,408\n109,856\nValuation allowance\n548,413\n169,514\n(355,408 )\n(109,856 )\nTotal deferred tax asset\n-\n-\n-\n-\nDeferred tax liabilities\nTotal deferred liability\n-\n-\n-\n-\nTotal net deferred tax asset\n$ -\n$ -\n$ -\n$ -\nDeferred income taxes arise from the temporary differences between financial statement and income tax recognition of net operating losses. These loss carryovers are limited under the Internal Revenue Code should a significant change in ownership occur.\nAt September 30, 2022 and September 30, 2021, the Company had approximately $11,383,482 and 11,919,934 respectively, in unused federal net operating loss carryforwards, which will begin to expire principally in the year 2035. A deferred tax (liability)/asset at each date of approximately $(169,514) and $109,856 resulting from the loss carryforwards and other temporary differences has been offset by a 100% valuation allowance. The change in the valuation allowance for the years ended September 30, 2022 and September 30, 2021 was approximately $ (92,833) and $(747,096).\nA reconciliation of the U.S. statutory federal income tax rate to the effective tax rate is as follows:\nSeptember 30,\nU.S. Federal statutory graduated rate\n21.00 %\n21.00 %\nState income tax rate, net of federal benefit\n9.91 %\n9.91 %\nTotal rate\n30.91 %\n30.91 %\nLess: Net operating loss for which no benefit is currently available\n(30.91 )%\n(30.91 )%\nNet effective rate\n0.00 %\n0.00 %\nThe Companys income tax filings are subject to audit by various taxing authorities. The Companys open audit periods are September 30, 2019, 2020, and 2021. In evaluating the Companys provisions and accruals, future taxable income, and reversal of temporary differences, interpretations and tax planning strategies are considered. The Company believes its estimates are appropriate based on current facts and circumstances.\nWe recorded a valuation allowance against all of our deferred tax assets as of both September 30, 2022, and September 30, 2021. We intend to continue maintaining a full valuation allowance on our deferred tax assets until there is sufficient evidence to support the reversal of all or some portion of these allowances. However, given our current earnings and anticipated future earnings, we believe that there is a reasonable possibility that within the near future, sufficient positive evidence may become available to allow us to reach a conclusion that a significant portion of the valuation allowance will no longer be needed. Release of the valuation allowance\nNOTE 9.\nEQUITY\nPreferred Stock\nThe Company has authorized 20,000,000 shares of $.0001 par value preferred stock. No preferred shares were outstanding at September 30, 2022 and 2021.\nCommon Stock\nDuring the year ended September 30, 2022, we issued 195,651 shares of stock for services valued $90,000.\nDuring the year ended September 30, 2021, we issued 500,000 shares of stock for 500,000 warrants exercised at an exercise price of $1.00 per share.\nStock Options\nOn August 18, 2017, our board of directors adopted a stock incentive plan (the plan) that provides for the grant of Incentive Stock Options, Non-Qualified Stock Options or Stock Bonuses to persons who are employees of the Company, employees of subsidiaries of the Company, directors, officers, and consultants. Under the plan, the Company may grant stock bonuses or options (up to a combined maximum of 2,500,000 shares or options). Each option allows for the purchase of one share of common stock, subject to an exercise price and vesting schedule to be established by the board of directors at the time of the grant.\nOptions Issuances in 2022\nThe Company did not issue any options during the year ended September 30, 2022.\nOptions Issuances in 2021\nThe Company did not issue any options during the year ended September 30, 2021.\nThe following table shows the stock option activity for the years ended September 30, 2022 and 2021:\nWeighted\nWeighted\nAverage\nAverage\nContractual\nAggregate\nNumber of\nExercise\nTerm\nIntrinsic\nShares\nPrice\n(Years)\nValue\nExercisable at September 30, 2021\n1,700,000\n$ 1.94\n3.5\n$ -\nOutstanding as of September 30, 2022\n1,700,000\n$ 1.94\n4.7\n$ -\nVested and expected to vest at September 30, 2022\n1,700,000\n$ 1.94\n4.7\n$ -\nExercisable at September 30, 2022\n1,700,000\n$ 1.94\n4.7\n$ -\nStock based compensation expense related to the options was $0 for the years ended September 30, 2022 and 2021. At September 30, 2022, unrecognized stock-based compensation associated with stock options amounted to $0. During the years ended September 30, 2022 and 2021, we received proceeds of $0 from stock option exercises.\nWarrants\nWarrant Issuances in 2022\nThe Company did not issue any warrants during the year ended September 30, 2022.\nWarrant Issuances in 2021\nThe Company did not issue any warrants during the year ended September 30, 2021.\nThe following table shows the warrant activity for the years ended September 30, 2022 and 2021:\nWeighted\nWeighted\nAverage\nAverage\nContractual\nAggregate\nNumber of\nExercise\nTerm\nIntrinsic\nShares\nPrice\n(Years)\nValue\nOutstanding as of September 30, 2021\n7,666,650\n1.21\n0.80\n$ -\nExpired\n(3,640,000 )\n1.00\nOutstanding as of September 30, 2022\n4,026,650\n1.40\n1.20\n$ -\nExercisable at September 30, 2022\n4,026,650\n1.40\n1.20\n$ -\nNOTE 10.\nCOMMITMENTS AND CONTINGENCIES\nOperating Leases\nLand\nOn October 17, 2016, the Company closed on the acquisition of the 52.6-acre parcel of undeveloped land in Freetown, Massachusetts. The property is located approximately 47 miles southeast of Boston. The Company is developing the property as the MCC. Plans for the property may include the construction of sustainable greenhouse cultivation and processing facilities that will be leased or sold to Registered Marijuana Dispensaries under the Massachusetts Medical Marijuana Program.\nAs part of a simultaneous transaction, the Company assigned the property rights to Massachusetts Medical Properties, LLC (MMP) for a nominal fee and entered a lease agreement pursuant to which MMP agreed to lease the property to the Company for an initial term of fifty (50) years. We have the option to extend the term of the lease for four (4) additional ten (10) year periods. The lease is a triple net lease, with the Company paying all real estate taxes, repairs, maintenance and insurance.\nThe lease payments will be the greater of (a) $30,000 per month; (b) $0.38 per square foot per month of any structure built on the property; or (c) 1.5% of all gross monthly sales of products sold by the Company, any assignee of the Company, or any subtenant of the Company. The lease payments will be adjusted up (but not down) every five (5) years by any increase in the Consumer Price Index.\nEffective October 1, 2019, the Company adopted Topic 842 and recorded ROU assets and lease liabilities of $6,980,957 and $4,256,869, respectively. As part of the adoption, prepaid land lease balance of $2,724,088 was classified as a component of the Companys ROU assets.\nThe Company completed the construction of Building 1 on the leased land and on September 1, 2019, BASK, commenced its 15-year sublease of Building 1 which includes a base rent plus 15% of BASKs gross revenues. This sublease income is recorded as Rental income and Rental income - related party through November 2021 and as Rental income between December 2021 and through September 2022 on the Companys consolidated statements of operations.\nAs of September 30, 2022, the Companys right-of-use assets were $6,778,085, the Companys current maturities of operating lease liabilities were $11,283, and the Companys noncurrent lease liabilities were $4,216,596. During the year ended September 30, 2022, the Company had operating cash flows from operating leases of $341,450.\nThe table below presents lease related terms and discount rates as of September 30, 2021.\nAs of\nSeptember 30,\nWeighted average remaining lease term\nOperating leases\n44.00\nWeighted average discount rate\nOperating leases\n7.9\n%\nThe reconciliation of the maturities of the operating leases to the lease liabilities recorded in the Consolidated Balance Sheet as of September 30, 2022 are as follows:\n341,500\n341,500\n341,500\n341,500\n341,500\nThereafter\n13,318,502\nTotal lease payments\n15,026,002\nLess: Interest\n(10,798,123\n)\n$ 4,227,879\nLess: operating lease liability, current portion\n(11,283\n)\nOperating lease liability, long term\n$ 4,216,596\nOffice space\nThe Company leases its office space located at 1555 Blake St., Unit 502, Denver, CO 80202 for $2,500 per month with a lease term of less than 12 months.\nLease expense for office space was $30,000 for the years ended September 30, 2022 and 2021.\nAggregate rental expense under all leases totaled $475,249 and $429,459 for the years ended September 30, 2022 and 2021, respectively.\nNOTE 11.\nSUBSEQUENT EVENTS\nOn October 5, 2022, the Company paid $159,140 to fully repay the $150,000 February 2018 Convertible Note due to an unrelated party, including $9,140 of interest.\nIn October 2022, 1,708,333 of warrants with a price of $1.50 expired.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the Registrant has caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized on the 29th day of December, 2022.\nAMERICANN, INC.\nBy:\n/s/ Timothy Keogh\nTimothy Keogh, Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of l934, this Report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Timothy Keogh\nTimothy Keogh\nChief Executive Officer and a Director\nDecember 29, 2022\n/s/ Benjamin J. Barton\nBenjamin J. Barton\nChief Financial and Accounting Officer and a Director\nDecember 29, 2022\n/s/ J. Tyler Opel\nJ. Tyler Opel\nDirector\nDecember 29, 2022"
}