{
    "cik": "1523486",
    "company": "MOJO DATA SOLUTIONS, INC.",
    "filing_type": "10-K",
    "filing_date": "2022-10-17",
    "period_of_report": "2021-12-31",
    "sic": "5400",
    "state_of_inc": "PR",
    "state_location": "TX",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1523486/0001493152-22-028585-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1523486/000149315222028585/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1523486/0001493152-22-028585.txt",
    "filename": "1523486_10K_2021_0001493152-22-028585.htm",
    "content": "Item 1. Business\nOur History\nThe Company was initially incorporated on July 8, 2010 in the State of Nevada under the name of Authentic Teas, Inc. (AUTT). Effective September 16, 2013, the Company was redomesticated in the Commonwealth of Puerto Rico by merging AUTT with and into a Puerto Rico corporation, MOJO Data Solutions, Inc., which itself was formed on August 21, 2013 solely for the purpose of the redomestication and change of name and was a subsidiary of AUTT. Unless otherwise noted, references herein to MOJO Data Solutions, MOJO, the Company, we, us, our and similar terms shall mean MOJO Data Solutions, Inc., a Puerto Rico corporation, as successor to AUTT. The Companys website address is www.mojodigitalassets.com. The website and information contained on, or that can be accessed through the website are not part of this report. Under the redomestication, each outstanding share of AUTT common stock was automatically converted into one share of MOJO common stock. On October 11, 2013, the OTCBB symbol of the Companys common stock was changed from AUTT to MJDS.\nOn September 27, 2013, the Company entered into an Asset Purchase Agreement with Mobile Data Systems, Inc. (MDS) pursuant to which MOJO agreed to purchase all of the intellectual property and substantially all of the tangible assets of MDS (the MDS Asset Purchase). On January 31, 2014, the Company closed on the MDS Asset Purchase in consideration of $190,000 in cash and a one-year unsecured 5% convertible promissory note in the principal amount of $80,000 payable to Joseph Spiteri, our sole officer and director which note is convertible at any time into shares of the Companys common stock at $0.05 per share. The Cash Amount was utilized to repay and satisfy the outstanding indebtedness under a certain Loan Promissory Note dated September 19, 2011, by and between MDS, as the borrower, and the Long Island Development Corporation, a New York State not-for-profit corporation, as the lender.\nUpon the closing of the acquisition with MDS, the business of MDS became the business of MOJO.\nThe address of our principal executive office is URB Dorado Reef, E21 Calle Las Palmas, Dorado, Puerto Rico 00646. Our telephone number is (631) 521-9700, and our website is located at www.mojodigitalassets.com.\nCompany Overview\nThe Company is undergoing a transformation from an inactive entity to reinvigorating its business efforts. Although the Company has always engaged in technology-forward business, we now seek to engage in endeavors to advance further into blockchain and web3 strategy.\nBlockchain technology is a decentralized and encrypted ledger system that is designed to offer a secure, efficient, verifiable and permanent way of storing records and other information without the need for intermediaries. Digital cryptocurrencies, specifically, can serve multiple purposes. They can be a medium of exchange, store of value, or unit of account. Examples of cryptocurrencies include: Bitcoin, Ethereum, and USDC. Many blockchain-based currencies have alternative, utility-based premises (for example, Ethereum provides the basis for smart contract engagement, although its native token can also be used as a medium of exchange), and applications of the underlying technology span across every industry. Blockchain technologies are being evaluated for a multitude of use cases due to the belief in their ability to have a significant impact in many areas of business, finance, information management and governance.\nWe believe cryptocurrencies can offer many advantages over traditional, fiat currencies, although many of these factors also present potential disadvantages and may introduce additional risks.\nSee Company Highlights for the Companys interest in leveraging the emerging technology.\nCompany Highlights\nThe Company founders have spent two years restructuring the capital structure of the company, submitting the appropriate filings and completing the audits necessary to regain compliance as a fully audited and reporting public company.\nThe Company is considering strategic transaction(s) with a revenue producing company specifically in the areas of bitcoin mining, cybersecurity, blockchain and/or WEB 3.0. MOJO is in the process of evaluating several opportunities in these sectors. In addition, the company is looking at utilizing its founding teams experience in mergers & acquisitions and in particular consolidating fragmented industries. The team has significant experience investing in public and private companies across a variety of different industries.\nTo date, the Company has achieved the following\nSources and Availability of Resources\nEverything we need to develop and improve implement our Company strategy is readily available. We are building a technological team of experts to support the transactions contemplated above and are exploring potential plans to acqui-hire, premised on procuring financing to support business modalities and growth plans.\nIntellectual Property\nWe do not currently hold any registered patents, copyrights or trademarks. We currently own our websites domain name www.mojodigitalassets.com.\nWe rely on trade secret protection and confidentiality agreements to protect proprietary market, business and technical information and know-how that is not or may not be patentable or that we elect not to patent. However, confidential information and trade secrets can be difficult to protect. Moreover, the information embodied in our trade secrets and confidential information may be independently and legitimately developed or discovered by third parties without any improper use of or reference to information or trade secrets. We seek to protect the market, technical and business information supporting our operations, as well as the confidential information relating specifically to our products by entering into confidentiality agreements with parties to whom we need to disclose our confidential information to, such as our employees, consultants, board members, contractors and investors. However we cannot be certain that such agreements have been entered into with all relevant parties. We also seek to preserve the integrity and confidentiality of our data and trade secrets by maintaining physical security of our premises and physical and electronic security of our information technology systems, but it is possible that these security measures could be breached. While we have confidence in these individuals, organizations and systems, agreements or security measures may be breached, and we may not have adequate remedies for those breaches. Our confidential information and trade secrets thus may become known by our competitors in ways we cannot prove or remedy.\nAlthough we expect all of our employees and consultants to assign their inventions to us, and all of our employees, consultants, advisors and any third parties who have access to our proprietary know-how, information or technology to enter into confidentiality agreements, we cannot provide any assurances that all such agreements have been duly executed. We cannot guarantee that our trade secrets and other confidential proprietary information will not be disclosed or that competitors will not otherwise gain access to our trade secrets or independently develop substantially equivalent information and techniques. For example, any of these parties may breach their agreements and disclose our proprietary information, including our trade secrets, and we may not be able to obtain recourse for such breaches. Misappropriation or unauthorized disclosure of our trade secrets could impair our competitive position and may have a material adverse effect on our business. Additionally, if the steps taken to maintain our trade secrets are deemed inadequate, we may have insufficient recourse against the parties misappropriating those trade secrets.\nMarketing and Distribution\nPrincipal Markets\nDependence on Specific Customer or Customers\nOur business is not currently dependent on specific customers, but as the Company portfolio rebuilds with customers, the loss of any one or more would have a material adverse effect on our business.\nIndustry and Competition\nWe operate in a highly competitive, consumer-driven and rapidly changing environment. Our success is, to a large extent, dependent on our ability to acquire, develop, adopt, upgrade and exploit new and existing technologies to address consumers changing demands and distinguish our services from those of our competitors, most of which have greater resources than us and have a longer operating history. We may not be able to accurately predict technological trends or the success of new products and services. If we choose technologies or equipment that are not as effective, cost-efficient or attractive to our customers than those chosen by our competitors, or if we offer services that fail to appeal to consumers, are not available at competitive prices or that do not function as expected, our competitive position could deteriorate, and our business, financial condition and results of operation could suffer.\nThe introduction by our competitors of new technologies, products and services may adversely affect our competitive position. Furthermore, advances in technology, decreases in the cost of existing technologies or changes in competitors product and service offerings may require us in the future to make additional research and development expenditures or to offer at no additional cost or at lower prices, certain products and services that we currently offer to customers separately or at a premium. In addition, the uncertainty of our ability and the costs to obtain intellectual property rights from third parties could impact our ability to respond to technological advances in a timely and effective manner.\nTechnology in our industry changes rapidly which could cause our products and services to become obsolete. We may not be able to keep pace with technological developments. If the new technologies on which we intend to focus our research and development investments fail to achieve acceptance in the marketplace, our competitive position could be negatively impacted limiting or even preventing us from becoming profitable. We may also be at a competitive disadvantage in developing and introducing complex new products and services due to the substantial costs we may incur in producing these products or services, For example, our competitors could use proprietary technologies that are perceived by the market as being superior. Further, after we have incurred substantial costs, one or more of the products or services we or our strategic partners are developing could become obsolete prior to it being widely adopted.\nWe expect to continue to face increased threats from companies who use blockchain technology and mining operations to deliver services similar to ours as the access to blockchain mining equipment continues to improve and costs ratably reduce for unique participants in the market. Our industry is subject to rapid technological change, and we must make substantial investments in new products, services and technologies to compete successfully. Technological innovations generally require a substantial investment before they are commercially viable. We intend, subject to financing, to continue to make substantial investments in developing a new modality to efficiently implement blockchain mining and reduce its environmental impact, and it is possible that our development efforts will not be successful and that our new technologies will not result in meaningful revenues. Our products, services and technologies face significant competition, and any revenues generated or the timing of their deployment, which may be dependent on the actions of others, may not meet our expectations. Competition in the blockchain mining industry is affected by various factors that include, among others: evolving industry standards and business models; evolving methods of mining; change in proof-of-work and proof-of-stake applications; access to mining rigs early off of the production line where resources can be limited or constricted to certain existing players in the industry; and the ability of the management and operations to continually work with fluctuating energy prices and other resource availability to create a financially viable business mode.\nWe intend that mining will produce the predominant share of our revenues, if any. With the continued development of additional and alternative opportunities in the mining space and blockchain technologys natural and rapid evolution, our businesses may face increased competition. Alternative media sources may also affect our ability to generate revenues. This competition may make it difficult for us to grow or generate revenues, which we believe will challenge us to expand the contributions of our business. Item 1A. Risk Factors\nThe information to be reported under this Item is not required of smaller reporting companies. Item 1B. Unresolved Staff Comments\nNot Applicable Item 2. Properties\nOur principal executive office is located Dorado Reef, E21 Calle Las Palmas, Dorado, Puerto Rico 00646 and is provided by Joseph Spiteri, our CEO. The Companys telephone number is (631) 521-9700. The rent is $2500/month and our website is http://www.mojodigitalassets.com/. Item 3. Legal Proceedings\nWe are not presently a party to any litigation nor, to our knowledge, is any litigation threatened against us, which may materially affect our business or our assets. Item 4. Mine Safety Disclosures\nNot Applicable\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nCurrently, our Common Stock is quoted in the OTC Markets Pink Sheets under the Symbol MJDS. The reported high and low sales prices for our common stock as reported thereon are shown below for the periods indicated. The quotations reflect inter-dealer prices without retail mark-up, markdown or commission and may not represent actual transactions.\nHigh Low\nFirst quarter ended March 29, 2020 $ .25 $ .25\nSecond quarter ended June 30, 2020 $ .06 $ .06\nThird quarter ended September 30, 2020 $ .02 $ .02\nFourth quarter ended December 31, 2020 $ .015 $ .015\nFirst quarter ended March 31, 2021 $ .04 $ .04\nSecond quarter ended June 30, 2021 $ .06 $ .06\nThird quarter ended September 30, 2021 $ .089 $ .089\nFourth quarter ended December 31, 2021 $ .041 $ .041\nAs of March 31, 2021, our transfer agent, Olde Monmouth, Inc. confirmed there were 26 holders of record owners of our common stock.\nDividends and Dividend Policy\nWe have never paid dividends on our Common Stock and our present policy is to retain anticipated future earnings for use in our business.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone\nSecurities Authorized for Issuance under Equity Compensation Plans\nNone\nRecent Sales of Unregistered Securities\nAll transactions were completed under Section 4(a)(2) of the Securities Act as they were not in connection with any public offering, and the investors were believed to be accredited and financially sophisticated. Item 6. Selected Financial Data\nThe information to be reported under this item is not required of smaller reporting companies. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operation.\nForward Looking Statements\nThe following discussion and analysis of the consolidated financial condition and consolidated results of operations of the Company is for the years ended December 31, 2014 and 2013 and should be read in conjunction with the consolidated financial statements, and the notes to those consolidated financial statements that are included elsewhere in this report. Our discussion includes forward-looking statements based upon current expectations that involve risks and uncertainties, such as our plans, objectives, expectations and intentions. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of a number of factors. We use words such as anticipate, estimate, plan, project, continuing, ongoing, expect, believe, intend, may, will, should, could, and similar expressions to identify forward-looking statements. As used in this report, the terms MOJO, the Company, we, us, our, and similar terms mean Mojo data solutions, Inc., a Puerto Rico corporation.\nCompany Overview\nSince the consummation of the Asset Purchase Agreement on January 31, 2014 (see Note 2 of the consolidated financial statements for details of the transaction), we have been refocusing the Companys business plan and strategy to develop and monetize the intellectual property assets we purchased from MDS. Preceding the transaction, the Company served as a holding company for our predecessors wholly-owned subsidiary, Authentic Teas Inc., a corporation incorporated in the province of Ontario, Canada on July 8, 2010 (AUTT Canada). AUTT Canada historically sold herbal teas online.\nConsolidated Results of Operations\nYear ended December 31, 2021 compared to the year ended December 31, 2020\nDuring the year ended December 31, 2021, the Company generated revenues of $0 from a non-related party. During the year ended December 31, 2020 the Company generated revenues of $0, from a related party.\nDuring the year ended December 31, 2020, the Company had general and administrative expenses of $98,369 compared to $13.313 during the year ended December 31, 2021. The majority of expenses for the year ended December 31, 2021 were for professional fees related to the regulatory filings.\nDuring the year ended December 31, 2021 and 2020, the Company had interest expense of $0.0 and $0.0, respectively.\nThe foregoing resulted in net loss of $13,313 during the year ended December 31, 2021 compared to a net loss of $98,369 during the year ended December 31, 2020. The Company attributes the decrease in net loss to decreased professional fees.\nLiquidity and Capital Resources\nThe Companys working capital as of December 31, 2021 and 2020 is summarized as follows:\nDecember 31, 2021 December 31, 2020\nCurrent Assets $ 0 $ 0\nCurrent Liabilities $ (13,313 ) $ (98,369 )\nWorking Capital (Deficiency) $ (13,313 ) $ (98,369 )\nThe Companys cash flow for the years ended December 31, 2021 and 2020 is summarized as follows:\nDecember 31, 2021\nDecember 31, 2020\nCash (used in) operating activities\n$ 3,649\n$ (254,468 )\nCash provided by (used in) investing activities\n$ 20,000\n$ 179,766\nCash provided by financing activities\n$\n$ 39,140\nNet increase (decrease) in cash and cash equivalents\n$ 23,648\n$ (37,174)\nAs of December 31, 2021, we had working capital of $23,648 compared to a working capital deficiency of $37,174 as of December 31, 2020, an improvement of $60,822. The change is primarily attributable to the effects of the new management and convertible notes from founder, resulting in a decrease in debt.\nWe anticipate that our cash on hand and the revenue that we anticipate generating going forward from our operations will not be sufficient to satisfy all of our cash requirements for the next twelve month period. We require funds to enable us to address our minimum current and ongoing expenses as presently, we are not generating revenue to meet our operating and capital expenses. We currently do not have committed sources of additional financing and may not be able to obtain additional financing. To acquire additional financing, we plan to raise any such additional capital primarily through equity and debt financing, provided that such funding is available to us. The issuance of additional equity securities by us may result in a significant dilution in the equity interests of our current stockholders. There is no assurance that we will be able to obtain further funds required for our continued operations or that additional financing will be available to us when needed or, if available, that it can be obtained on commercially reasonable terms. If we are not able to obtain additional financing as required on a timely basis, we will not be able to meet certain obligations as they become due and we will be forced to scale down or perhaps even cease our operations.\nOff Balance Sheet Arrangements:\nWe do not have any off-balance sheet arrangements, financings, or other relationships with unconsolidated entities or other persons, also known as special purpose entities (SPEs). Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nThe information to be reported under this item is not required of smaller reporting companies. Item 8. Financial Statements and Supplementary Data\nOur financial statements are contained in the pages beginning, which appear at the end of this annual report. Item 9. Changes In, and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\n(a) Evaluation of Disclosure Controls and Procedures\nWe carried out an evaluation, under the supervision and with the participation of our Chief Executive Officer (CEO), who is also our Principal Financial Officer (PFO), of the design and effectiveness of our disclosure controls and procedures (as defined under Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934) as of the end of the period covered by this report. Based on this evaluation, our CEO/PFO concluded that as of the end of the period covered by this report, these disclosure controls and procedures were not effective. The conclusion that our disclosure controls and procedures were not effective was due to the presence of the following material weaknesses in disclosure controls and procedures which are indicative of many small companies with small staff: (i) inadequate segregation of duties and effective risk assessment as the Company had only one officer; (ii) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of both US GAAP and SEC Guidelines; and (iii) inadequate security and restricted access to computer systems including insufficient disaster recovery plans; and (iv) no written whistleblower policy. Once sufficient funds are available, our CEO/PFO plans to implement appropriate disclosure controls and procedures to remediate these material weaknesses, including (i) appointing additional qualified personnel to address inadequate segregation of duties and ineffective risk management; (ii) adopt sufficient written policies and procedures for accounting and financial reporting and a whistle blower policy; and (iii) implement sufficient security and restricted access measures regarding our computer systems and implement a disaster recovery plan.\n(b) Managements Annual Report on Internal Control over Financial Reporting\nOur CEO/PFO is responsible for establishing and maintaining adequate internal control over financial reporting as defined under Rule 13a-15(f) and Rule 15d-15(f) under the Securities Exchange Act of 1934. As of December 31, 2020 our CEO/PFO assessed the effectiveness of the Companys internal control over financial reporting based on the criteria for effective internal control set forth in the 1992 report entitled Internal Control - Integrated Framework published by the Committee of Sponsoring Organizations (COSO) of the Treadway Commission. Based on that evaluation, our CEO/PFO concluded that, during the period covered by this report, such internal controls and procedures were not effective to detect the inappropriate application of US GAAP rules as more fully described below. This was due to deficiencies that existed in the design or operation of our internal control over financial reporting that adversely affected our internal controls.\nThe matters involving internal controls and procedures that the Companys CEO/PFO considered to be material weaknesses under the standards of the Public Company Accounting Oversight Board were: (1) lack of a functioning audit committee and lack of a majority of outside directors on the Companys board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (2) inadequate segregation of duties consistent with control objectives; (3) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements; and (4) ineffective controls over period end financial disclosure and reporting processes. The aforementioned material weaknesses were identified by the Companys CEO/PFO in connection with his review of our financial statements as of December 31, 2020.\nOur CEO/PFO believes that the material weaknesses set forth above did not have an effect on the Companys financial results. However, our CEO/PFO believes that the lack of a functioning audit committee and lack of a majority of outside directors on the Companys board of directors, results in ineffective oversight of the establishment and monitoring of required internal controls and procedures.\nWe will continue to monitor and evaluate the effectiveness of our internal controls and procedures and our internal controls over financial reporting on an ongoing basis and are committed to taking action and implementing additional enhancements or improvements as funds allow.\nThere have been no significant changes in our internal controls over financial reporting that occurred during the quarter ended December 31, 2021 that have materially affected or are reasonably likely to materially affect, our internal controls over financial reporting.\nThis annual report does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys independent registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only its management report in the Annual Report. Item 9B. Other Information\nNone\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nOur directors hold office until the next annual meeting of stockholders and until their successors are elected and qualified. Any director may resign his or her office at any time and may be removed at any time by the holders of a majority of the shares then entitled to vote. Our Board of Directors appoints our executive officers, and our executive officers serve at the pleasure of our Board of Directors.\nOur directors and executive officers, their ages, positions held, and duration of such are as follows:\nName\nAge\nTitle\nDirector Since:\nJoseph Spiteri\nChief Executive Officer, President,\nSecretary & Treasurer, Chairman\nof the Board of Directors (Principal Executive Officer)\nAugust 4, 2020\nProfessional Experience: The business experience of our officers and directors is set forth below:\nJoseph Spiteri is a software executive with over thirty years of experience in software architecture, engineering, research, and management. He has specialized in the areas of wireless data communications, mobile computing, and multi-tier distributed computing architectures. Mr. Spiteri leads our design, development, and implementation of mobile enterprise applications and custom OEM contract software development.\nMr. Spiteri founded InVision Software in 1995 after a long career as an electrical engineer in the defense electronics industry. In 2004, he founded Mobile Data Systems, a privately-held New York corporation where he served as President, Chief Executive Officer and board member prior to the sale of its assets to the Company.\nLegal Proceedings\nDuring the past two years, Mr. Spiteri, our sole director and executive officer has not been:\n● The subject of any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n● Convicted in a criminal proceeding or is subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n● Subject to any order, judgment or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities.\n● Found by a court of competent jurisdiction (in a civil action), the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, that has not been reversed, suspended, or vacated.\n● Subject of, or a party to, any order, judgment, decree or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of a federal or state securities or commodities law or regulation, law or regulation respecting financial institutions or insurance companies, law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n● subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization, any registered entity or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nNone of our directors or officers or, to our knowledge, any affiliates or any beneficial owner of 5% or more of our common stock, or any associate of such persons, is an adverse party in any material proceeding to, or has a material interest adverse to, us or any of our subsidiaries.\nCorporate Governance\nWe currently have no standing audit, compensation or nominating committees or committees performing similar functions, nor do we have written audit, compensation or nominating committee charters. Our Board of Directors believes it unnecessary to have such committees at this time because they can adequately perform the functions of such committees.\nWe do not have any defined policy or procedural requirements for shareholders to submit recommendations or nominations for directors. The Board of Directors believes that, given the stage of our development, a specific nominating policy would be premature until our business operations develop to a more advanced level. We currently do not have any specific or minimum criteria for the election of nominees to the Board of Directors and we do not have any specific process or procedure for evaluating such nominees. The Board of Directors will assess all candidates, whether submitted by management or shareholders, and make recommendations for election or appointment. A shareholder who wishes to communicate with our Board of Directors may do so by directing a written request addressed to our director at the address on the cover of this report.\nCode of Ethics\nWe have not yet adopted a code of ethics within the definition of Item 406 of Regulation S-K. Currently, we have a single named executive officer and 0 employees. As our business continues to grow, and we become more experienced as a fully-reporting public company, our Board of Directors plans to implement a code of ethics.\nSection 16(a) Beneficial Ownership Reporting Compliance\nWe are currently not subject to Section 16(a) of the Exchange Act as we do not have a class of equity securities registered pursuant to section 12 of the Exchange Act. Item 11. Executive Compensation\nAs a smaller reporting company, we have elected to follow the scaled disclosure requirements for smaller reporting companies with respect to the disclosures required by Item 402 of Regulation S-K. Under such scaled disclosure, we are not required to provide a Compensation Discussion and Analysis, Compensation Committee Report and certain other tabular and narrative disclosures relating to executive compensation.\nExecutive Compensation\nThe following table sets forth information concerning the compensation of our principal executive officer for the years ended December 31, 2021 and 2020.\nSummary Compensation Table\nSalary All Other Compensation Total\nName and Principal Position Year ($) ($) ($)\nJoseph Spiteri - -\nPresident, Chief Executive Officer and Director (2) - -\nNo accrued compensation is due to any executive officer or director of the Company. Each executive officer and director will be entitled to reimbursement of expenses incurred while conducting Company business.\nEmployment Agreements or Arrangements\nWe have not entered into any employment agreements or arrangements, whether written or unwritten, with our directors or executive officers since our inception. See Certain Relationships and Related Transactions; and Director Independence; Consulting Agreement on page 16 of this Memorandum.\nCapital Stock\nOn the date of incorporation on September 21, 2013, the Company was authorized to issue 300,000,000 shares of common stock, par value $0.001 per share and 70,000,000 shares of Series A preferred stock, par value $0.001 per share. On October 3, 2013, the Company amended its Certificate of Incorporation to be authorized to issue 30,000,000 shares of Series B preferred stock, par value $0.001 per share.\nAs of November 12, 2020, each share of Series A preferred stock is entitled to 10:1 voting rights, and each share of Series A Preferred converts into 3 shares of Common Stock. Each share of Series B preferred stock was entitled to one share of common stock in vote and be entitled to participating dividends.\nThe Companys former officers make capital contribution to finance the Companys operation due to lack of cash resources. The capital contribution amounted to $98,369 in the year ended December 31, 2020. On November16, 2021, the Company canceled 225,650,000 shares of common stock for no consideration.\nCapital Issued and Outstanding\nAs of December 31, 2021 and 2020, 70,000,000 shares of Series A preferred stock, 30,000,0000 shares of Series B preferred stock were issued and outstanding. The Company had 58,983,271 and 284,633,271 shares of common stock were issued and outstanding as of December 31, 2021 and 2020, respectively.\nEquity Awards\nOn the dates specified below, the Company issued the following shares of the Companys common stock, par value $0.001 per share (the Common Stock), and Series A Preferred Stock, par value $0.001 per share (Series A Preferred Stock collectively with the Common Stock, the Securities), to the Companys officers and directors. The securities were issued to each individual pursuant to a Stock Purchase Agreement, dated the dates specified below, between the Company and each individual in consideration for services rendered and valued at $0.001 per share. The Company relied upon the exemption from the registration requirements of the Securities Act of 1933 available to the Company pursuant to Section 4(a) (2) (formerly Section 4(2)) promulgated under the Securities Act due to the fact that the individuals were officers and directors of the Company and the issuances did not involve a public offering of securities. The Securities are deemed to be restricted securities and control securities pursuant to Rule 144 promulgated under the Securities Act, and certificates evidencing the Securities bear the customary restrictive legends.\nStockholder (1) Securities (2) Notes (3)\nCommon Stock Series A Preferred Series B Preferred\nJoseph Spiteri 47,500,000 Book Entry\nWR Valentine, LLC 8,750,000 Book Entry\nFUNJ Holdings, LLC 8,750,000 Book Entry\nBull Blockchain Law, LLP (4) (5,000,000 ) Book Entry\nTOTAL 65,000,000\n(4) Shares granted to Bull Blockchain Law, LLP in 2020 were repurchased and will be redistributed to new advisors.\nOther than the foregoing, we have not awarded any shares of stock, options or other equity securities to our directors or executive officers since our inception. We have not adopted any equity incentive plan. Our directors and executive officers may receive stock options at the discretion of our Board of Directors in the future.\nDirector Compensation\nOther than equity compensation set forth above, no director received or accrued any compensation for his services as a director since our inception.\nWe have no formal plan for compensating our directors for their services in their capacity as directors. Our directors are entitled to reimbursement for reasonable travel and other out-of-pocket expenses incurred in connection with attendance at meetings of our Board of Directors. Our Board of Directors may award special remuneration to any director undertaking any special services on our behalf other than services ordinarily required of a director. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership\nThe following table sets forth, as of December 31, 2021, certain information known to us with respect to the beneficial ownership of our common stock, Series A Preferred Stock and Series B Preferred Stock by (i) each of our directors, (ii) each of our named executive officers and current executive officers, (iii) all of our directors and current executive officers as a group, and (iv) each shareholder known by us to be the beneficial owner of more than five percent (5%) of such class of securities. Beneficial ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities.\nName of Beneficial\nOwner (1)\nAmount Percent\n(2)\nJoseph Spiteri\n-CEO, Pres. & Chairman 47,500,000 67.5 %\nNotes\n(1) Unless otherwise noted, the address for each beneficial holder is c/o Mojo Digital Assets, Inc., Dorado Reef, E21 Calle Las Palmas, Dorado, Puerto Rico 00646.\n(2) Based on 58,983,271 shares of common stock issued and outstanding as of August 6, 2021. Shares of common stock subject to options, warrants and convertible securities currently exercisable or convertible, or exercisable or convertible within 60 days, would be counted as outstanding for computing the percentage of the person holding such options, warrants or convertible securities but not counted as outstanding for computing the percentage of any other person. Item 13. Certain Relationships and Related Transactions, and Director Independence\nCertain Relationships and Related Transactions\nOther than as disclosed above, there has been no transaction, since the beginning of the year ended December 31, 2021, or currently proposed transaction, in which we were or are to be a participant and the amount involved exceeds the lesser of $120,000 or one percent of our total assets at year-end for the last completed fiscal year, and in which any of the following persons had or will have a direct or indirect material interest:\n(i) Any director or executive officer of our company;\n(ii) Any person who beneficially owns, directly or indirectly, shares carrying more than 5% of the voting rights attached to our outstanding shares of common stock;\n(iii) Any of our promoters and control persons; and\n(iv) Any member of the immediate family (including spouse, parents, children, siblings and in- laws) of any of the foregoing persons.\nAs December 31, 2020, there were 0 warrants outstanding to purchase shares of our common stock. Item 14. Principal Accounting Fees and Services\nOur Board of Directors has selected BFBorgers CPA PC (BFBorgers) as the independent registered public accounting firm to audit our books and accounts for the fiscal years ending December 31, 2021 and 2020. BFBorgers has served as our independent accountant since 2022 as of the year of this filing. The aggregate fees billed, or expected to be billed, for the last two fiscal years ended December 31, 2021 and 2020, for professional services rendered by BFBorgers were as follows:\nAudit fees $ 0 $ 0\nAudit-related fees $ 3000 -\nTax fees\nAll other fees $ 5500 -\nIn the above table, audit fees are fees billed for services provided related to the audit of our annual financial statements, quarterly reviews of our interim financial statements, and services normally provided by the independent accountant in connection with statutory and regulatory filings or engagements for those fiscal periods. Tax fees are fees billed, or to be billed, by the independent accountant for professional services rendered for tax compliance, tax advice and tax planning.\nOur Board of Directors pre-approves all services provided by our independent accountants. Our Board of Directors reviewed and approved all of the above services and fees.\nPART IV Item 15. Exhibits, Financial Statement Schedules\nThe following documents are filed as part of or are included in this Annual Report:\n1. Financial statements listed in the Index to Financial Statements, filed as part of this Annual Report beginning on page; and\n2. Exhibits listed in the Exhibit Index filed as part of this Annual Report.\nMOJO DIGITAL ASSETS INC.\nFINANCIAL REPORT\nAt December 31, 2021 and 2020, and\nFor the Years Ended December 31, 2021 and 2020\nMOJO DIGITAL ASSETS INC.\nINDEX\nPAGE\nDISCLAIMER REPORT\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBALANCE SHEETS\nSTATEMENTS OF OPERATIONS\nSTATEMENTS OF CHANGES IN SHAREHOLDERS EQUITY (DEFICIT)\nSTATEMENTS OF CASH FLOWS\nNOTES TO FINANCIAL STATEMENTS -F-13\nDISCLAIMER REPORT\nTo Management and Board of Directors\nMojo Digital Assets Inc.\nThe accompanying financial statements of Mojo Digital Assets Inc. as of December 31, 2021 and 2020, and for each of the years in the two-year period ended December 31, 2021, were not subjected to an audit, review, or compilation engagement by us and, we do not express an opinion, a conclusion, nor provide any assurance on them.\n/s/Keith K Zhen CPA\nKeith K Zhen CPA\nBrooklyn, New York\nFebruary 7, 2022\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Mojo Digital Assets Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Mojo Digital Assets Inc. as of December 31, 2021, the related statements of operations, stockholders equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/S/ BF Borgers CPA PC\nBF Borgers CPA PC (5041)\nWe have served as the Companys auditor since 2022\nLakewood, CO\nMay 31, 2022\nMOJO DIGITAL ASSETS INC.\nBALANCE SHEETS\nDecember 31, 2021 December 31, 2020\nASSETS\nCurrent Assets:\nCash and cash equivalents $ 3,649 $ -\nTotal Current Assets 3,649 -\nTotal Assets $ 3,649 $ -\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent Liabilities:\nLoan from a related party (Note 7) $ 20,000 $ -\nTotal Current Liabilities 20,000 -\nTotal Liabilities 20,000 -\nCommitments and Contingencies (Note 8) - -\nShareholders Equity:\nSeries A Preferred stock, par value $0.001, 70,000,000 shares authorized; 70,000,000 shares issued and outstanding 70,000 70,000\nSeries B Preferred stock, par value $0.001, 30,000,000 shares authorized; 30,000,000 shares issued and outstanding 30,000 30,000\nPreferred stock, value\nCommon stock, par value $0.001, 300,000,000 shares authorized; 58,983,271 and 284,633,271 shares issued and outstanding as of December 31, 2021 and 2020, respectively 58,983 284,633\nAdditional paid-in capital 324,019 98,369\nRetained Earnings (Accumulated deficit) (499,353 ) (483,002 )\nTotal Shareholders Equity (Deficit) (16,351 ) -\nTotal Liabilities and Shareholders Equity (Deficit) $ 3,649 $ -\nThe accompanying notes are an integral part of these financial statements.\nMOJO DIGITAL ASSETS INC.\nSTATEMENTS OF OPERATIONS\nFor the Year Ended For the Year Ended\nDecember 31, 2021 December 31, 2020\nRevenue\nSales $ - $ -\nCost of Goods Sold - -\nGross Profit - -\nOperating Expenses\nPayroll - 65,000\nProfessional fees 10,853 23,191\nOffice expenses 5,498 10,178\nTotal Operating Expenses 16,351 98,369\nLoss from Operations (16,351 ) (98,369 )\nLose before Provision for Income Tax (16,351 ) (98,369 )\nProvision for Income Tax - -\nNet Loss $ (16,351 ) $ (98,369 )\nOther comprehensive income (loss) - -\nTotal comprehensive income (loss) $ (16,351 ) $ (98,369 )\nBasic and Fully Diluted Loss per Share $ (0.00 ) $ (0.00 )\nWeighted average shares outstanding 256,427,021 284,633,271\nThe accompanying notes are an integral part of these financial statements.\nMOJO DIGITAL ASSETS INC.\nSTATEMENTS OF CHANGES IN SHAREHOLDERS EQUITY (DEFICIT)\nShares Amount Shares Amount Shares Amount Capital Deficit) (Deficit)\nSeries A Preferred Stock Series B Preferred Stock Common Stock Additional Retained\nEarnings\nTotal\nShareholders\n$0.001 Par Value $0.001 Par Value $0.001 Par Value Paid-in (Accumulated Equity\nShares Amount Shares Amount Shares Amount Capital Deficit) (Deficit)\nBalances at\nJanuary 1, 2020 70,000,000 $ 70,000 30,000,000 $ 30,000 $ 284,633,271 $ 284,633 $ - $ (384,633 ) $ -\nCapital contribution - - - - - - 98,369 - 98,369\nNet income (loss) - - - - - - - (98,369 ) (98,369 )\nBalances at\nDecember 31, 2020 70,000,000 $ 70,000 30,000,000 $ 30,000 $ 284,633,271 $ 284,633 $ 98,369 $ (483,002 ) $ -\nCancelation of common stocks - - - - (225,650,000 ) (225,650 ) 225,650 - -\nNet income (loss) - - - - - - - (16,351 ) (16,351 )\nBalances at\nDecember 31, 2021 70,000,000 $ 70,000 30,000,000 $ 30,000 $ 58,983,271 $ 58,983 $ 324,019 $ (499,353 ) $ (16,351 )\nThe accompanying notes are an integral part of these financial statements.\nMOJO DIGITAL ASSETS INC.\nSTATEMENTS OF CASH FLOWS\nFor the Year Ended For the Year Ended\nDecember 31, 2021 December 31, 2020\nCash Flows from Operating Activities\nNet loss $ (16,351 ) $ (98,369 )\nAdjustments to reconcile net loss\nChanges in operating assets and liabilities\nIncrease/(Decrease) in accrued expenses - -\nNet cash used by operating activities (16,351 ) (98,369 )\nCash Flows from Investing Activities\nNet cash provided (used) by investing activities - -\nCash Flows from Financing Activities\nLoan from a related party 20,000\nProceeds from capital contribution - 98,369\nNet cash provided (used) by financing activities 20,000 98,369\nIncrease (decrease) in cash 3,649 -\nCash at beginning of period - -\nCash at end of period $ 3,649 $ -\nSupplemental Disclosures of Cash Flow Information:\nCash paid during the year for:\nInterest $ - $ -\nIncome tax $ - $ -\nThe accompanying notes are an integral part of these financial statements.\nMOJO DIGITAL ASSETS INC.\nNOTES TO FINANCIAL STATEMENTS\nNote 1- ORGANIZATION AND BUSINESS BACKGROUND\nMojo Digital Assets Inc. (the Company or Mojo) was founded in Nevada on July 8, 2010 as Authentic Teas, Inc. (Authentic). Authentics wholly-owned subsidiary was incorporated in the province of Ontario, Canada on July 8, 2010. On September 13, 2013, Authentic Teas, Inc., a Nevada corporation, merged with and into Mojo Data Solutions, Inc., a Puerto Rico corporation and a wholly-owned subsidiary of Authentic formed on August 21, 2013 solely for the purpose of reincorporating Authentic in Puerto Rico under the name Mojo Data Solutions, Inc., which was changed to TWL Water Technologies, Incorporated on December 30, 2019, and to Mojo Digital Assets Inc. on November 24, 2020.\nThe Company had been engaged in the various business since its incorporation. The Company was not successful and discontinued the majority of its operation by December 31, 2019. Beginning from January 2020, the Company plans on providing business services and financing to emerging growth entities.\nOn August 3, 2020, our CEO, Mr. Joseph Spiteri obtained the control of the Company via the Stock Purchase Agreement (the SPA) entered with the prior officers and directors. Mr. Spiteri purchase all the 70,000,000 shares of Series A preferred stock and was appointed as the sole director.\nNote 2- CONTROL BY PRINCIPAL OWNERS\nThe directors and executive officers own, directly or indirectly, beneficially and in the aggregate, the majority of the voting power of the outstanding capital of the Company. Accordingly, directors, executive officers and their affiliates, if they voted their shares uniformly, would have the ability to control the approval of most corporate actions, including approving significant expenses, increasing the authorized capital and the dissolution, merger, or sale of the Companys assets.\nNote 3- GOING CONCERN\nThe financial statements have been prepared assuming that the Company will continue as a going concern. The Company incurred net losses of $16,351 and $98,369 for the year ended December 31, 2021 and 2020, respectively. In addition, the Company had stockholders deficit of $16,351 as of December 31, 2021. These factors raise substantial doubt about the Companys ability to continue as a going concern. Management believes that the Companys capital requirements will depend on many factors including the success of the Companys development efforts and the Companys efforts to raise capital. Management also believes the Company needs to raise additional capital for working purposes. There is no assurance that such financing will be available in the future. The financial statements of the Company do not include any adjustments relating to the recoverability and classification of recorded assets, or the amounts and classifications of liabilities that might be necessary should the Company be unable to continue as a going concern.\nNote 4- SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying financial statements are prepared in accordance with generally accepted accounting principles in the United States of America (US GAAP).\nMOJO DIGITAL ASSETS INC.\nNOTES TO FINANCIAL STATEMENTS\nNote 4- SIGNIFICANT ACCOUNTING POLICIES (continued)\nUse of Estimates\nThe preparation of financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenue and expenses during the reporting period. Actual results when ultimately realized could differ from those estimates.\nConcentrations of Credit Risk\nFinancial instruments that subject the Company to concentrations of credit risk consist primarily of cash and cash equivalents. The Company maintains its cash and cash equivalents with high-quality institutions. Deposits held with banks may not be insured or exceed the amount of insurance provided on such deposits. Generally these deposits may be redeemed upon demand and therefore bear minimal risk.\nCash and Cash Equivalents\nCash and cash equivalents include cash on hand, deposits in banks with maturities of three months or less, and all highly liquid investments that are unrestricted as to withdrawal or use, and which have original maturities of three months or less.\nValuation of Long-Lived assets\nLong-lived assets and certain identifiable intangibles are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to future net cash flows expected to be generated by the asset. If such assets are considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the assets exceeds the fair value of the assets. Assets to be disposed of are reported at the lower of the carrying amount or fair value less costs to sell.\nRevenue Recognition\nThe Company adopted Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 606, which requires the use of a new five-step model to recognize revenue from customer contracts. The five-step model requires that the Company (i) identify the contract with the customer, (ii) identify the performance obligations in the contract, (iii) determine the transaction price, including variable consideration to the extent that it is probable that a significant future reversal will not occur, (iv) allocate the transaction price to the respective performance obligations in the contract, and (v) recognize revenue when (or as) the Company satisfies the performance obligation.\nRelated Parties\nThe Company adopted FASB ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions.\nMOJO DIGITAL ASSETS INC.\nNOTES TO FINANCIAL STATEMENTS\nNote 4- SIGNIFICANT ACCOUNTING POLICIES (continued)\nProperty, Plant, and Equipment\nProperty, plant, and equipment are carried at cost. The cost of repairs and maintenance is expensed as incurred; major replacements and improvements are capitalized.\nWhen assets are retired or disposed of, the cost and accumulated depreciation are removed from the accounts, and any resulting gains or losses are included in income in the year of disposition.\nDepreciation is calculated on a straight-line basis over the estimated useful life of the assets without residual value. The percentages or depreciable life applied are:\nSCHEDULE OF ESTIMATED USEFUL LIFE OF ASSETS\nOffice equipment and furniture years\nFair Value of Measurements\nThe Company adopted FASB ASC 820 Fair Value Measurements, which defines fair value as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants at the measurement date. Additionally, the inputs used to measure fair value are prioritized based on a three-level hierarchy. This hierarchy requires entities to maximize the use of observable inputs and minimize the use of unobservable inputs. The three levels of inputs used to measure fair value are as follows:\nLevel 1: Unadjusted quoted prices in active markets for identical assets or liabilities.\nLevel 2: Input other than quoted market prices that are observable, either directly or indirectly, and reasonably available. Observable inputs reflect the assumptions market participants would use in pricing the asset or liability and are developed based on market data obtained from sources independent of the Company.\nLevel 3: Unobservable inputs. Unobservable inputs reflect the assumptions that the Company develops based on available information about what market participants would use in valuing the asset or liability.\nAn asset or liabilitys level within the fair value hierarchy is based on the lowest level of any input that is significant to the fair value measurement. Availability of observable inputs can vary and is affected by a variety of factors. The Company uses judgment in determining fair value of assets and liabilities, and Level 3 assets and liabilities involve greater judgment than Level 1 and Level 2 assets or liabilities.\nAs of the balance sheet date, the estimated fair values of the financial instruments approximated their fair values due to the short-term nature of these instruments.\nMOJO DIGITAL ASSETS INC.\nNOTES TO FINANCIAL STATEMENTS\nNote 4- SIGNIFICANT ACCOUNTING POLICIES (continued)\nAdvertising Costs\nThe Company expenses advertising costs as incurred or the first time the advertising takes place, whichever is earlier, in accordance with the FASB ASC 720-35, Advertising Costs. The advertising costs were immaterial for the year ended December 31, 2020.\nResearch and Development Costs\nResearch and development costs relating to the development of new products and processes, including significant improvements and refinements to existing products, are expensed when incurred in accordance with the FASB ASC 730, Research and Development. Research and development costs were immaterial for the year ended December 31, 2020.\nComprehensive Income\nFASB ASC 220, Comprehensive Income, establishes standards for reporting and display of comprehensive income, its components and accumulated balances. Comprehensive income as defined includes all changes in equity during a period from non-owner sources. Accumulated comprehensive income, as presented in the accompanying statements of changes in owners equity consists of changes in unrealized gains and losses on foreign currency translation. This comprehensive income is not included in the computation of income tax expense or benefit.\nSegment Reporting\nFASB ASC 820, Segments Reporting, establishes standards for reporting information about operating segments on a basis consistent with the Companys internal organization structure as well as information about geographical areas, business segments and major customers in financial statements. The Company currently operates in one principal business segment.\nEarnings (Loss) Per Share\nThe Company reports earnings per share in accordance with FASB ASC 260, Earnings Per Share, which requires presentation of basic and diluted earnings per share in conjunction with the disclosure of the methodology used in computing such earnings per share. Basic earnings (loss) per share is computed by dividing income (loss) available to common shareholders by the weighted-average number of common shares outstanding during the period. Diluted earnings per share is computed similar to basic earnings per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. There were no potentially dilutive securities outstanding (options and warrants) for the two-year period ended December 31, 2021.\nMOJO DIGITAL ASSETS INC.\nNOTES TO FINANCIAL STATEMENTS\nNote 4- SIGNIFICANT ACCOUNTING POLICIES (continued)\nIncome Taxes\nThe Company accounts for income tax in accordance with FASB ASC 740-10-25, which requires the asset and liability approach for financial accounting and reporting for income taxes. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance related to deferred tax assets is recorded when it is more likely than not that some portion or all of the deferred tax assets will not be realized.\nThe Company has accumulated deficit in its operation. Because there is no certainty that we will realize taxable income in the future, we did not record any deferred tax benefit as a result of these losses.\nThe Company adopted FASB ASC 740-10-30, which clarifies the accounting for uncertainty in income taxes recognized in an enterprises financial statements. The FASB guidance prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. The FASB guidance also provides guidance on de-recognition of tax benefits, classification on the balance sheet, interest and penalties, accounting in interim periods, disclosure, and transition. In accordance with the FASB guidance, the Company performed a self-assessment and concluded that there were no significant uncertain tax positions requiring recognition in its financial statements.\nRecent Accounting Pronouncements\nThe Company does not expect the adoption of recently issued accounting pronouncements to have a significant impact on the Companys results of operations, financial position, or cash flow.\nSubsequent Events\nThe Company evaluated subsequent events through the date of issuance of these financial statements. We are not aware of any significant events that occurred subsequent to the balance sheet date but prior to the filing of this report that would have a material impact on our financial statements.\nNote 5- LOAN FROM A RELATED PARTY\nThe Company did not generate revenue from its planed operation. The CEO of the Company, Mr. Joseph Spiteri funded the Companys operations. In the year ended December 31, 2021, Mr. Spiteri made loans of $20,000 to the Company. As of December 31, 2021, the balance due to the related party was $20,000. These loans from the related party are unsecured, non-interest bearing and payable on demand. There are no written agreements for these loans.\nMOJO DIGITAL ASSETS INC.\nNOTES TO FINANCIAL STATEMENTS\nNote 6- CAPITAL STOCK\nAuthorized Capital\nOn the date of incorporation on September 21, 2013, the Company is authorized to issue 300,000,000 shares of common stock, par value $0.001 per share, and 70,000,000 shares of Series A preferred stock, par value $0.001 per share. Each share of Series A preferred stock shall be entitled to ten shares of common stock in vote, and be entitled to participating dividends. On October 3, 2013, the Company amended its Certificate of Incorporation to be authorized to issue 30,000,000 shares of Series B preferred stock, par value $0.001 per share. Each share of Series B preferred stock shall be entitled to one share of common stock in vote, and be entitled to participating dividends.\nCapital stocks\nThe Companys former officers make capital contribution to finance the Companys operation due to lack of cash resources. The capital contribution amounted to $98,369 in the year ended December 31, 2020. On November 16, 2021, the Company canceled 225,650,000 shares of common stock for no consideration.\nCapital Issued and Outstanding\nAs of December 31, 2021 and 2020, 70,000,000 shares of Series A preferred stock, 30,000,000 shares of Series B preferred stock were issued and outstanding. The Company had 58,983,271 and 284,633,271 shares of common stock were issued and outstanding as of December 31, 2021 and 2020, respectively.\nNote 7- OFFICE RENTAL EXPENSE\nFrom time to time, the Companys officers provide office space to the Company for free. However, the Company has not reached a formal lease agreement with any officer as of the date of this filing. The office rental expenses were $0 for the year ended December 31, 2021 and 2020.\nNote 8- COMMITMENTS AND CONTINGENCIES\nThe Company adopted ASC 450-20, Loss Contingencies, to report accounting for contingencies. Liabilities for loss contingencies arising from claims, assessments, litigation, fines and penalties and other sources are recorded when it is probable that a liability has been incurred and the amount of the assessment can be reasonably estimated.\nContingent Liability from Prior Operation\nThe Company had been engaged in the various business since its incorporation on September 21, 2013. The Company was not successful and discontinued the majority of its operation by December 31, 2019. Management believes that there are no valid outstanding liabilities from prior operations. If a creditor were to come forward and claim a liability, the Company has committed to contest such claim to the fullest extent of the law. No amount has been accrued in the financial statements for this contingent liability.\nItem 6. Exhibits.\n101.INS\nInline XBRL Instance Document*\n101.SCH\nInline XBRL Taxonomy Extension Schema Document*\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document*\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document*\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document*\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document*\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed herewith.\n** Furnished herewith.\nSIGNATURES\nIn accordance with the requirements of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMojo Data Solutions, Inc.\nDate: October 17, 2022 By: /s/ Joseph Spiteri\nName: Joseph Spiteri\nTitle: Chief Executive Officer"
}