{
    "cik": "1527613",
    "company": "NuZee, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-23",
    "period_of_report": "2022-09-30",
    "sic": "5900",
    "state_of_inc": "NV",
    "state_location": "TX",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1527613/0001493152-22-036487-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1527613/000149315222036487/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1527613/0001493152-22-036487.txt",
    "filename": "1527613_10K_2022_0001493152-22-036487.htm",
    "content": "ITEM 1. BUSINESS.\nOverview\nWe are a specialty coffee company and, we believe, a leading co-packer of single serve pour over coffee in the United States, as well as a preeminent co-packer of coffee brew bags, which is also referred to as tea-bag style coffee. In addition to our single serve pour over and coffee brew bag coffee products, we have recently expanded our product portfolio to offer a third type of single serve coffee format, DRIPKIT pour over products, as a result of our acquisition of substantially all of the assets of Dripkit, Inc. (Dripkit). Our DRIPKIT pour over format features a large-size single serve pour over pack that sits on top of the cup and delivers in our view a barista-quality coffee experience to coffee drinkers in the United States, Canada, and Mexico. Our mission is to leverage our position as a co-packer at the forefront of the North American single serve coffee market to revolutionize the way single serve coffee is enjoyed in the United States. While the United States is our core market, we also have manufacturing and sales operations in Korea and a joint venture in Latin America.\nWe believe we are the only commercial-scale producer within the North American market that has the dual capacity to pack both single serve pour over coffee and coffee brew bag coffee. We intend to leverage our position to become the commercial coffee manufacturer of choice and aim to become the preeminent leader for coffee companies seeking to enter into and grow within the single serve coffee market in North America. We are paid per-package based on the number of single serve coffee products produced by us. Accordingly, we consider our business model to be a form of tolling arrangement, as we receive a fee for almost every single serve coffee product our co-packing customers sell in the North American and Korean markets. While we financially benefit from the success of our co-packing customers through the sales of their respective single serve coffee products, we believe we are also able to avoid the risks associated with owning and managing the product and its related inventory.\nWe have also developed and sell NuZee branded single serve coffee products, including our flagship Coffee Blenders line of both single serve pour over coffee and coffee brew bags, which we believe offers consumers some of the best coffee available in a single serve application in the world.\nWe may also consider co-packaging other products that are complementary to our current product offerings and provide us with a deeper access to our customers. In addition, we are continually exploring potential strategic partnerships, co-ventures, and mergers, acquisitions, or other transactions with existing and future business partners to generate additional business, drive growth, reduce manufacturing costs, expand our product portfolio, enter into new markets, and further penetrate the markets in which we currently operate.\nSingle serve coffee products\nSingle serve pour over coffee\nSingle serve pour over coffee, or hand drip coffee, is a traditional and time-honored technique that pours hot water onto ground coffee with a prepacked coffee filter. Proponents of pour over coffee believe this method makes better coffee. Single serve pour over coffee uses the same brewing technique without a machine, with the coffee flowing straight into a cup using only hot water and the prepacked coffee filter.\nCoffee brew bag coffee\nWe introduced our coffee brew bag, or tea-bag style coffee, in 2019. The brewing method is similar to brewing tea; put the coffee brew bag in a cup, add hot water and let it sit for approximately five minutes. This coffee brewing method is relatively new to North America and we believe has gained attention from roasters and end consumers who desire eco-friendlier alternatives to coffee pods and other types of single serve coffee. Our coffee brew bags are intended to be industrially compostable, allowing consumers to deposit the used coffee brew bag in the curbside compostable bins where available.\nRevolutionizing the single serve coffee market in North America\nWe believe the typical coffee consumer is increasingly focused on the environmental impact of the product, as well as the taste and quality of the ingredients. We anticipate that pod-based, single serve coffee will face increasing pressure given their heavy reliance on the use of plastics. In our view, consumer preferences in North America have evolved over the last decade to substantially mirror those of Japanese consumers, who have traditionally focused on the taste, eco-footprint and quality of ingredients.\nWe believe that the saturation of coffee pods in the North American market, coupled with changing tastes, provides our single serve coffee products with a substantial market opportunity in North America. Accordingly, we believe there are opportunities for growth in the North American market for our single serve pour over and coffee brew bag coffee products. Our single serve coffee products also have a number of advantages over other single serve coffee alternatives:\n● Our single serve coffee solutions are portable and do not require a machine for brewing. Therefore, the consumer investment required to enjoy our product is very minimal (as opposed to machine-based solutions). Single serve coffee products can easily travel and have a number of consume-later applications not available to machine-based solutions (camping, travel, office, etc.).\n● We believe our product offerings are more hygienic than other, machine-based single serve alternatives. For example, the use of a machine requires cleaning and maintenance. If not periodically cleaned or if spent pods are not removed timely, this can lead to poor taste and bacterial growth.\n● Our single serve coffee products allow consumers to brew only what they need, therefore allowing mindful, responsible consumption that can reduce food and water waste and leads to better coffee sustainability.\nWe seek to establish ourselves as the premier manufacturer of single serve coffee products for the North American market and to produce innovative coffee products that we believe will promote sustainability. We also seek to further expand our own brands of single serve coffee products for sale directly to end consumers in order to generate increased revenues and to help accelerate consumer adoption of these brewing formats. We believe that top tier brands that want to compete in the North American single serve coffee market will demand the highest levels of quality from their manufacturing partners. We further believe that we remain a commercial-scale leader in the single serve coffee market in North America as a result of our history of working with sophisticated packing equipment manufacturers, SQF Certification from the Safe Quality Food Institute, organic certification, our commitment to sustainability, operational knowledge and the co-packing arrangements we are continuing to develop with companies. As a result of our ongoing efforts, we feel we are well positioned to be a go-to coffee manufacturer for companies offering single serve coffee products in the North American market.\nWe understand that as single serve pour over and coffee brew bag coffee products gain momentum in the North American market we will face increasing competition. However, (i) we have, and continue to develop, manufacturing expertise on increasingly complex and larger orders, (ii) we have experience dealing with companies of all sizes and their specific requirements (from small roasters to international companies) and (iii) we have SQF, organic and Kosher certification. We received SQF Certification from the Safe Quality Food Institute, which is a customary requirement to produce for large multi-national and international companies.\nOur primary focus is the development of single serve coffee products in the North American market targeting the individual consumer for use at home and office or other settings that would benefit from single serve product offerings and positioning ourselves as the leading commercial-scale co-packer of single serve pour over and coffee brew bag coffee products. We may also consider co-packaging other products that are complementary to our current single serve coffee product offerings and provide us with a deeper access to our customers.\nSince 2016, we have been primarily focused on single serve pour over coffee production. Over this time, we have developed expertise in the operation of our sophisticated packing equipment and the related production of our single serve pour over coffee products at our manufacturing facilities. We have also expanded our co-packing expertise and product offerings to coffee brew bag coffee products, which we believe are gaining traction in the United States, as well as our DRIPKIT pour over products. Our goal is to continue to expand our product portfolio to raise our visibility, consumer awareness and brand profile.\nOur sources of revenue\nCo-packing\nWe operate as a third-party contract packager for the finished goods of other major companies operating in the coffee beverage industry. Under these arrangements, our co-packing customers typically supply us with roasted, whole bean coffee that we package into single serve pour over and coffee brew bag coffee products according to their formulations and specifications. In addition, under our private label coffee development program, our team works directly with our co-packing customers in developing private labels of signature coffees. Under this program, our team of coffee experts works extensively with our co-packing customers to develop a coffee taste profile to their unique needs and then we source, roast (utilizing our third-party roasting or manufacturing partners), blend, pack (in either our traditional single serve pour over, DRIPKIT pour over or coffee brew bag coffee products), and package single serve coffee products to their exact specifications.\nWe currently focus on fostering co-packing arrangements with larger companies developing pour over and coffee brew bag coffee products, in addition to smaller scale, innovative companies that we believe are rapidly growing, as further described below. We believe that as our potential co-packing customers continue to realize that we have the experience co-packing for a variety of customer sizes, we will become the co-packer of choice. The standards required to co-pack for large international companies almost always meet or exceed the standards required to co-pack for any other customer. We also believe that as our co-packing customers competitors realize they have single serve pour over and coffee brew bag coffee solutions, they will be more motivated to develop their own such solutions and that will lead to increased co-packing opportunities for us.\nIn addition to larger companies, we package for smaller companies that we believe have significant growth potential. For example, we started packaging for a particular smaller company in 2017 and continue to do so today. This company started with smaller batch, single product offerings but over the years has meaningfully increased order sizes as well as the number of product offerings. We are continually looking for new and innovative companies with whom we may work and grow.\n \nNuZee and DRIPKIT branded products\nAlthough our primary focus is on the manufacture of single serve coffee products pursuant to co-packing arrangements with our co-packing clients, we have also developed high-quality NuZee branded single serve coffee products that, in addition to our DRIPKIT branded products, are sold directly to consumers. In addition to being available for direct sale to consumers, our NuZee and DRIPKIT branded products serve as samples that are provided to potential new co-packing customers to showcase our co-packing capabilities and production expertise.\nOur NuZee branded products are from our perspective a ‘stepping-stone product for our co-packing customers that market high quality packaging and coffee. Sales of our NuZee branded products, including through Amazon, also help promote consumer adoption into the format and to educate coffee drinkers in the United States about this coffee format that is new to North America but widely known in East Asia. Our NuZee branded products are further described below.\n  ● Coffee Blenders. Our Coffee Blenders line of products, including both single serve pour over coffee products and coffee brew bag coffee, is a high-end product line that, in addition to showcasing our production expertise, also includes what we believe to be some of the best coffee available in a single serve application in the world. In addition, we have recently expanded our Coffee Blenders offerings to include a new Coldpresso latte product line that is available to purchase in Korea online. We sell Coffee Blenders products mainly online. We also have a number of potential co-packing opportunities in which our customers would contract for us to replicate one or more of our Coffee Blenders products with their film and packing, providing further evidence of the high-quality nature of this line and coffee.\n  ● Twin Peaks. We currently sell our Twin Peaks single serve pour over coffee exclusively via Amazon. This program commenced in 2019 and we expect that as Amazon and its customers become more familiar with single serve pour over coffee, we will increase our revenue for this product.\nIn addition to our NuZee branded products, our premium DRIPKIT pour over format features a large-size single serve pour over pack that sits on top of the cup and delivers in our view a barista-quality coffee experience. We offer DRIPKIT pour over packs direct to consumers through our website, wholesale business-to-business to hospitality customers, and co-pack for coffee roasters.\nOur business strategy\nWe intend to achieve our mission and further grow our business by pursuing the following strategies:\n● Continually grow our base of large national or international co-packing customers. In furtherance of our goal to become the go-to commercial coffee manufacturer and preeminent partner for coffee companies seeking to enter into and grow within the single serve coffee market in North America, we focus on entering into co-packing agreements with large international companies, including co-packing arrangements pursuant to our private label coffee development program. We also intend to continue to educate and advocate for the development of pour over coffee products within the broader single serve category. We believe that, as the U.S. market continues to gain awareness of our traditional single serve pour over, DRIPKIT pour over and coffee brew bag coffee products, we will continue to grow our base of large domestic or international co-packing customers.\n \n● Co-pack for smaller scale, innovative coffee customers that we believe are rapidly growing and capture their growth over time. In addition to co-packing for large domestic or international customers, we believe that select smaller scale, rapidly growing, innovative co-packing customers provide us with different opportunities versus larger customers. Large national roasters often look to these smaller scale customers for inspiration. We believe capturing these influential roasters would help us provide format visibility to the bigger roasters as well as influential consumers.\n \n● Efficiently grow our manufacturing footprint and capacity, including by leveraging new and current partnerships, in response to anticipated demand for co-packing. We intend to leverage our partnership announced in 2022 pursuant to which a manufacturing partner in Knoxville, Tennessee will provide us with additional manufacturing, coffee roasting and co-packing capabilities, and facilitate distribution efforts to the Eastern United States. With this partnership, we expect to offer a holistic coffee supply and manufacturing program to our existing and new customers, including coffee roasting and non-single serve coffee product co-packing in addition to our other single serve coffee formats.\n \n● Strategically grow and expand our international operations that align with our vision. We plan to strategically grow our current international operations as well as potentially expand internationally if this growth or expansion is strategic to our vision. We believe the Korean market, albeit competitive, still has significant growth potential as well as strong market acceptance for coffee and single serve pour overs. We have also formed a joint venture in Latin America. As we look at other potential international manufacturing locations, we look for characteristics similar to the Korean, Latin American and U.S. markets. We plan to further leverage our international operations to support our customers expansion into the markets in which we operate. This includes assisting our U.S. customers launching their products in Korea and Mexico.\nDripkit Transaction\nOn February 25, 2022 (the Closing Date), we acquired substantially all of the assets and certain specified liabilities of Dripkit (the Acquisition) pursuant to the Asset Purchase Agreement, dated as of February 21, 2022 (the Asset Purchase Agreement), by and among the Company, Dripkit, and Dripkits existing investors (the Stock Recipients) who executed joinders to the Asset Purchase Agreement as of the Closing Date. Pursuant to the terms of the Asset Purchase Agreement, the aggregate purchase price paid by us for the Acquisition was $860,000, consisting of cash paid by the Company to Dripkit and the Companys issuance to the Stock Recipients of an aggregate of 178,681 shares of the Companys common stock, plus the assumption of certain assumed liabilities, subject to certain adjustments and holdbacks as provided in the Asset Purchase Agreement.\nOn May 2, 2022, pursuant to the terms of the Asset Purchase Agreement, the bulk sales holdback amount was used to satisfy sales and use taxes owed by Dripkit to the State of New York as of the Closing Date. Pursuant to the terms of the Asset Purchase Agreement, the amounts remaining after offsetting the cost of these sales and use taxes were distributed as follows: (i) $39,237 was distributed to Dripkit on May 9, 2022, in connection with the cash bulk sales holdback amount, and (ii) 18,475 shares of our common stock were issued to the Stock Recipients on April 25, 2022, in connection with the stock bulk sales holdback amount.\nFor additional information regarding the Acquisition and the Asset Purchase Agreement, see Note 6-Business Combinations to the Consolidated Financial Statements.\nDripkit operates as a new Dripkit Coffee business division that is wholly owned by NuZee, Inc.\nCustomers and Sales\nOur co-packing customers primarily include large and small size coffee roasters and food service companies. We intend to continue to pursue such co-packing arrangements in the future. We believe this customer interest is primarily due to (i) the saturation of machine based single serve coffee alternatives, (ii) increase in consumer requirements for eco-friendly packaging and (iii) our superior taste quality compared to other single serve coffee alternatives.\n \nSales to relatively few co-packing customers account for a significant percentage of our net sales, and our success depends in part on our ability to maintain good relationships with these key co-packing customers and other key retail and grocery customers. One major customer accounted for approximately 28% and 32% of our total revenue in the years ended September 30, 2022 and 2021, respectively, as further described in Note 2-Basis of Presentation And Summary of Significant Accounting Policies-Major Customers to our Consolidated Financial Statements.\nGenerally, under our co-packing arrangements as well as our fulfillment of purchase orders for the distribution of NuZee branded products through nationally recognized retailers, customers must issue purchase orders for our products and co-packing services. Although these purchase orders stipulate key terms including order quantity, product specifications, price, payment terms, packaging method and delivery instructions, our co-packing arrangements and our arrangements with nationally recognized retailers are typically not governed by any written agreement and have no ongoing minimum purchase requirements; however, we do impose minimum quantity requirements when an order is placed.\nWe also sell our NuZee and DRIPKIT branded products directly to consumers. Currently, Amazon and our Coffee Blenders website are our only established domestic retail channels for direct sales to consumers of NuZee branded products, and our DRIPKIT products are sold through our Dripkit website and third-party online retailers.\nManufacturing and Operational Capacity\nWe currently lease manufacturing facilities in Vista, California and Seoul, Korea to produce our single serve pour over or coffee brew bag coffee products. In November 2021, we entered into a new lease in Seoul, Korea for a larger office and manufacturing space. In 2022, we expanded our office and manufacturing space in Vista, California by approximately 2,000 square feet and also extended our current lease through March 2025 and our sub-leased property through January 2023.\nAs a result of our capital investments since 2015, including our acquisition of packing equipment from manufacturers whom we believe are the global leaders for supplying such machines, we presently have the annual capacity to produce up to 150 million single serve coffee products (pour over or coffee brew bags) at our two manufacturing facilities, which we believe is sufficient to meet our current and anticipated manufacturing requirements. In addition, in May 2022, we announced a new partnership pursuant to which a manufacturing partner in Knoxville, Tennessee has agreed to provide us with additional manufacturing, coffee roasting and co-packing capabilities, and facilitate distribution efforts to the Eastern United States. In connection with the foregoing operational developments, and following our strategic analysis of our current and anticipated facility requirements, we have determined to transition our manufacturing operations away from the facility we previously operated in Plano, Texas. Our executive office and administrative operations are now located in Richardson, Texas.\nWe own high-quality and sophisticated packing equipment developed by premier East Asian suppliers for pour over and coffee brew bag coffee production. We believe these manufacturers are the world leaders for supplying such machines. Nitrogen and air compression machinery is capable of handling expansion, which helps to minimize any ongoing related capital expenditures for such machinery as we expand.\nRaw Materials\nUnder our co-packing arrangements, our co-packing customers typically supply us with roasted, whole bean coffee that we then produce and package into single serve pour over and coffee brew bag coffee products according to their formulations and specifications. In addition, in connection with the production of our NuZee and DRIPKIT branded products and specialty coffees that we have developed for co-packing customers under our private label coffee development program, we source and purchase green coffee from multiple green coffee suppliers, and from multiple regions around the world. After being sourced by us, the green coffee is then shipped to our roasting or manufacturing partners where the coffee is roasted and then shipped to us for grinding, blending, packing, and packaging. Maintaining a steady supply of roasted coffee beans from our co-packing customers is essential to our co-packing arrangements, and securing an adequate supply of green coffee is essential to our ability to manufacture NuZee and DRIPKIT branded products and to support the development of private labels for our co-packing customers under our private label development program. We have arrangements based on purchase orders in place with suppliers and partners for all components required to provide our co-packing services and deliver our NuZee and DRIPKIT branded products.\nOur principal packaging materials include filters, foils, cartons, and craft master cases. We conduct business with multiple vendors of packaging materials on a purchase order basis.\nDistribution\nFor distribution of our single serve coffee products to our co-packing customers, we typically rely on the distribution networks of our co-packing customers, including freight companies and common carriers arranged by them. At the request of our co-packing customers, we may also utilize a freight broker for the distribution and delivery of our products according to our co-packing customers instructions. Our NuZee and DRIPKIT branded products are typically delivered by common carriers directly to each customer. Our manufacturing partner in Knoxville, Tennessee facilitates distribution of certain of our products to the Eastern United States.\nIntellectual Property\nTrademarks\nWe currently own the following United States trademarks: NuZee, NuZee Coffee (Stylized), NuZee Coffee and Design, Coffee Blenders, Twin Peaks, Active Cup, Relax Cup, Think Cup, Nude Cup, Pine Ranch Coffee, and Dripkit. We are also in the process of obtaining rights to the Its Coffee Reimagined and Dripkit and Design trademarks. We intend to continue growing our trademark portfolio in the United States with other related slogans and brands as new products are launched.\nWe further intend to expand our brand protections outside of the United States in line with our prospective international growth. As of the date of this Report, we had registered trademarks Coffee Blenders and Twin Peaks in Japan and registered trademarks Twin Peaks in Korea. We have also filed for NuZee, NuZee Coffee (Stylized), NuZee Coffee and Design, in Canada, Japan, Korea, and Mexico; Dripkit (Words only) and Design in Japan, Mexico, and Korea; and Dripkit and Design in Canada, Japan, and Korea.\nPatents\nWe currently own the following patents relating to our DRIPKIT pour over product: (1) a U.S. design patent that protects the visual ornamental characteristics associated with the DRIPKIT pour over coffee apparatus design, which expires in November 2035; (2) a U.S. utility patent that covers utility patent features of the DRIPKIT portable drip apparatus, which expires in July 2038; and (3) one pending utility patent application that is a continuation patent application for pursuing broader/different utility patent features for the DRIPKIT portable drip apparatus, which is currently pending and awaiting examination. Patent rights (1) and (2) stem from the Acquisition of Dripkit in 2022.\nWe intend to aggressively protect, police and assert our intellectual property rights, including product designs, proprietary product research and concepts as well as our trademark portfolio. Although asserting our rights may result in a substantial cost to the Company, our management strongly believes that the protection of our intellectual property rights is a key component of our operating strategy.\nInternational operations\nKorea\nWe established our Korean subsidiary in 2018. We are one of many producers of single serve pour over coffee products in Korea and do not have any exclusive rights for this region. Our strategy is to leverage our local relationships to secure large co-packing agreements for the markets in Korea, China and other Asian countries. Our Korean subsidiary increased its customer base in our 2022 fiscal year, and we believe that it will be able to continue to secure meaningful co-packing customers in our 2023 fiscal year.\nLatin America\nIn January 2020, we entered into a Joint Venture Agreement (the JV Agreement) with Industrias Marino, S.A. de C.V., a company incorporated under the laws of Mexico (El Marino), to form a joint venture in Mexico between us and El Marino in Mexico (NuZee Latin America). NuZee Latin America is organized under the laws of Mexico. To date, the only activities in NuZee Latin America were the contribution of two machines, and start up and initial marketing and sales activities. Its primary business operations are intended to consist of the manufacture of single serve coffee products for sale in Mexico, Central and South America.\nCompetition\nPrior to the success of coffee pods within the last two decades, coffee was primarily consumed at home and via traditional pot-based drip brewers and, to a lesser extent, instant coffee. Pot-based brewers are typically known for good quality coffee that produces multiple cups but are not well-suited for single serve alternatives. In recent years with the advent of coffee pods and increased coffee consumption outside the home, the North American market has been focused on speed and convenience. Coffee pods addressed the need for a single serve coffee solution that was viewed as superior to instant coffee. As coffee consumption has also moved outside the home in recent years, consumer preferences have also changed, leading to greater demand for higher quality coffee alternatives.\nThe beverage industry in general, and the coffee sector, is extremely competitive. The principal areas of competition include product, quality, convenience, price, packaging, development of new products and flavors, and marketing campaigns. Our Coffee Blenders, DRIPKIT and other NuZee branded products are competing directly with Green Mountain brands and other licensed brands, as well as third-parties in the single serve coffee category who have similar formats to our products. Green Mountain brands have enjoyed broad, well-established national distribution through well-funded advertising, and product awareness. Our Coffee Blenders, DRIPKIT and other NuZee branded products also compete generally with all hot liquid refreshments, including specialty coffees and teas. Companies and brands manufacturing these products generally have far greater financial, marketing, and distribution resources than we do.\nImportant factors that will affect our ability to compete successfully include functional delivery of our products and co-packing services, trade and consumer promotions, the development of new, unique functions in new and various packaging formats, attractive and unique promotions, branded product advertising, pricing, and the success of the distribution networks on which we rely.\nWe also compete to secure distributors who will agree to market our product over those of our competitors, provide stable and reliable distribution, and secure adequate shelf space in retail outlets and search placement in online stores.\nEmployees\nAs of September 30, 2022, we had a total of 22 employees in the United States and 13 employees in Korea, all of whom are full-time. None of our employees are represented by a labor organization or under any collective bargaining arrangements. We believe our relationships with our employees are good.\nOur operations are overseen directly by management that engages our employees to carry on our business. Our management oversees all responsibilities in the areas of corporate administration, product development, marketing, and research. We may expand our current management to retain other skilled directors, officers, and employees with experience relevant to our business focus. Our managements relationships will provide the foundation through which we expect to grow our business in the future. We believe that the skill sets of our core management team will be a primary asset in the development of our brands and trademarks.\nGovernmental Regulation\nOur Coffee Blenders, DRIPKIT and other NuZee branded products are marketed and sold as conventional food or beverages for regulatory purposes. Such products are regulated by the FDA. Ingredients in such products must be approved food additives or Generally Regarded as Safe. We intend to work with ingredient suppliers, manufacturers, and other trade partners that are compliant with the laws and regulation enforced by the FDA. We have not received, nor are we aware of, any inquiries or other regulatory action from the FDA or any other governmental agency regarding our products and we believe we are in full compliance with all FDA regulations.\nThe advertising, distribution, labeling, production, safety, sale, and transportation in the United States of our products are subject to the Federal Food, Drug, and Cosmetic Act, the Federal Trade Commission Act, the Lanham Act, state consumer protection laws, competition laws, federal, state and local workplace health and safety laws, various federal, state and local environmental protection laws, and various other federal, state and local statutes and regulations.\nCorporate Information\nWe were incorporated in 2011 in Nevada as Havana Furnishings, Inc. NuZee Co. Ltd., a California corporation, was incorporated under California law in 2011. NuZee Co. Ltd. (California) merged into Havana Furnishings, Inc. in 2013, at which time we changed our name to NuZee, Inc.\nOn December 9, 2022, at a Special Meeting of Stockholders, our stockholders approved a proposal granting the board of directors of the Company (the Board) discretionary authority to file an amendment (the Certificate of Amendment) to the Companys Articles of Incorporation, as amended (the Articles), which amends the Articles to add a Section 1A to effect a reverse stock split of the Companys common stock, at any ratio from 1-for-10 to 1-for-50 at the Boards discretion (the 2022 Reverse Stock Split). The Board intends to effect the 2022 Reverse Stock Split as soon as practicable.\nIn June 2020, our common stock commenced trading on the Nasdaq Capital Market under the symbol NUZE. Prior to that, our common stock was quoted on the OTCQB Marketplace under the same symbol.\nWe have two international subsidiaries in NuZee KOREA Ltd. (NuZee KR), and NuZee Investment Co., Ltd. (NuZee INV). NuZee KR and NuZee INV are wholly owned subsidiaries of the Company. We also have a joint venture in Mexico, as further discussed above.\nOur principal executive offices are located at 1350 East Arapaho Road, Suite #230, Richardson, Texas 75081, and our telephone number is (760) 295-2408. We also maintain an office in Vista, California.\nAvailable Information\nOur annual and quarterly reports, along with all other reports and amendments filed with or furnished to the SEC, are publicly available free of charge on the Investor Relations section of our website at www.mynuzee.com as soon as reasonably practicable after these materials are filed with or furnished to the SEC. Our website and the information contained on, or that can be accessed through, the website will not be deemed to be incorporated by reference in, and are not considered part of, this Report. Our corporate governance policies, ethics code and board of directors committee charters are posted under the Investor Relations section of the website. The SEC also maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The address of that site is www.sec.gov. ITEM 1A. RISK FACTORS\nRisk Factor Summary\nThe risk factors summarized below could materially harm our business, operating results and/or financial condition, impair our future prospects and/or cause the price of our common stock to decline. These risks are discussed more fully in the section titled Risk Factors. Material risks that may affect our business, operating results and financial condition include, but are not necessarily limited to, the following:\n1. We have a history of net losses. We expect to continue to incur net losses in the future and we may never generate sufficient revenue from the commercialization of our single serve coffee products or co-packing services to achieve or sustain profitability.\n2. Our independent auditors report for the fiscal year ended September 30, 2022 includes an explanatory paragraph regarding substantial doubt about our ability to continue as a going concern, and absent additional financing we may be unable to remain a going concern.\n3. We expect to need to obtain additional capital to fund our existing operations and, if we are unable to obtain such financing, we may be unable to continue to operate as a going concern.\n4. We have limited operating history, which may make it difficult to evaluate our current business and to forecast our future performance.\n5. Our ability to use our net operating loss carryforwards to offset future taxable income may be subject to certain limitations.\n6. A substantial portion of our sales are completed on a purchase order basis. Customers may issue fewer or smaller purchase orders than we expect under our co-packing or retail fulfillment arrangements or decide to delay or cancel orders, which could negatively impact our revenues.\n7. The COVID-19 pandemic and the appearance of new variants continues to affect our business operations and financial condition, and our liquidity could also be negatively impacted.\n8. Sales to a limited number of customers represent a significant portion of our net sales. The loss of a key customer and efforts by our customers to improve their profitability could reduce sales of NuZee branded products and revenues generated from our co-packing services and adversely affect our financial performance.\n9. Continued innovation and the successful development and timely launch of new products and co-packing services are critical to our financial results and achievement of our growth strategy.\n10. Our future financial results are difficult to predict, and failure to meet market expectations for our financial performance or any publicly announced guidance may cause the price of our stock to decline.\n11. Increased competition, including as a result of industry consolidation, could hurt our businesses, and changes in the coffee, tea and beverage environment and retail landscape could impact our financial results.\n12. Our business, growth and profitability depend on the performance of third-parties and our relationship with them, including third-party coffee roasters and manufacturing partners.\n13. Interruption or increased costs of our supply chain and sales network, including a disruption in operations at any of our facilities, could affect our ability to manufacture or distribute products and could adversely affect our business and sales.\n14. The loss of any member of our senior management team or our inability to attract and retain highly skilled personnel could have a material adverse effect on our business.\n15. Because our management structure is not centralized, the management of our business operations may be more expensive and more difficult.\n16. Increases in the cost or decreases in the availability of high-quality coffee beans or other commodities could have an adverse impact on our business and financial results. Additionally, price increases may not be sufficient to offset cost increases and maintain profitability or may result in sales volume declines.\n17. We may be unable to manage our future growth effectively, which could make it difficult to execute our business strategy.\n18. Any failure by us to accurately forecast customer demand for our products and co-packing services, or to quickly adjust to forecast changes, could adversely affect our business and financial results.\n19. We may not be able to adequately protect our intellectual property rights, and our competitors may be able to offer similar products and co-packing services, which would harm our competitive position. Additionally, we may be subject to intellectual property infringement claims, which may be expensive to defend and may disrupt our business and operations.\n20. Failure to comply with applicable transfer pricing and similar regulations could harm our business and financial results.\n21. Our business operations could be disrupted due to miscommunications or translation errors. Additionally, our international sales and operations subject us to additional legal, regulatory, financial and other risks.\n22. Significant additional labeling or warning requirements or limitations on the availability of our products may inhibit sales of affected products.\n23. The market price of our stock may be volatile, and you could lose all or part of your investment.\n24. If we fail to regain compliance with the requirements for continued listing on the Nasdaq Capital Market, our common stock could be delisted from trading, which would adversely affect the liquidity of our common stock and our ability to raise additional capital.\n25. Even if we regain compliance with the Bid Price Rule (as defined below), the Nasdaq Capital Market may subsequently delist our common stock if we fail to comply with ongoing listing standards going forward.\n26. The Board intends to effect the 2022 Reverse Stock Split as soon as practicable in order to regain compliance with Nasdaq Capital Market listing rules. We cannot predict the effect that the 2022 Reverse Stock Split will have on the market price for shares of our common stock.\n27. Our stockholders will experience dilution if we issue additional equity securities in future financing transactions.\n28. A significant portion of our total outstanding shares of common stock are eligible to be sold into the market in the near future, which could cause the market price of our common stock to drop significantly.\n29. Our principal stockholder and management, including our Chief Executive Officer in particular, own a significant percentage of our stock and will be able to exert significant control over matters subject to stockholder approval.\n30. We incur significant costs as a result of operating as a public company, and our management must devote substantial time to compliance initiatives as a result of the listing of our common stock on the Nasdaq Capital Market.\n31. We expect to incur significant costs and devote substantial management time to maintaining our disclosure controls and procedures and internal control over financial reporting, and regardless we may be unable to prevent or detect all errors or acts of fraud or to accurately and timely report our financial results or file our periodic reports in a timely manner. If we are unable to maintain an effective system of internal control over financial reporting, we may not be able to accurately report our financial results, timely file our periodic reports, maintain our reporting status or prevent fraud.\n32. Anti-takeover provisions in our third amended and restated bylaws and Nevada law might discourage, delay or prevent a change of control of our company or changes in our management and, therefore, depress the trading price of our securities.\n33. We have never paid dividends on our capital stock and we do not anticipate paying any dividends in the foreseeable future. Consequently, any profits from an investment in our common stock will depend on whether the price of our common stock increases.\n34. Claims for indemnification by our directors and officers may reduce our available funds to satisfy successful third-party claims against us and may reduce the amount of money available to us.\n35. Product safety and quality concerns could negatively affect our business.\n36. If we are unable to protect our information systems against service interruption or failure, misappropriation of data or breaches of security, our operations could be disrupted, we could be subject to costly government enforcement actions and private litigation and our reputation may be damaged.\n37. Currently pending, threatened or future litigation or governmental proceedings or inquiries could result in material adverse consequences, including judgments or settlements.\n38. Future acquisitions of and investments in new businesses could impact our business and financial condition.\nIn addition to the other information set forth in this Report and other filings we have made and make in the future with the SEC, you should carefully consider the following risk factors and uncertainties, which could materially affect our business, financial condition or results of operations in future periods. Additional risks not currently known to us or that we currently deem to be immaterial also may materially adversely affect our business, financial condition or results of operations in future periods.\nRisks Related to Our Financial Condition and Capital Requirements\nWe have a history of net losses. We expect to continue to incur net losses in the future and we may never generate sufficient revenue from the commercialization of our single serve coffee products or co-packing services to achieve or sustain profitability.\nWe have incurred net losses since our inception in 2013, including net losses of $11.8 million and $18.6 million for the years ended September 30, 2022, and 2021, respectively. As of September 30, 2022, our accumulated deficit was approximately $64.6 million. We expect to incur significant sales and marketing expenses, as well as costs associated with operating as an exchange-listed public company, prior to recording sufficient revenue from our operations to offset these expenses.\nThese losses have had, and will continue to have, an adverse effect on our working capital, total assets and stockholders equity. Our ability to become and remain profitable will depend on our ability to generate significantly higher revenues from the sales of our single serve coffee products and co-packing services, which depends upon a number of factors, including but not limited to successful sales, manufacturing, marketing and distribution of our products and services.\nBecause of the numerous risks and uncertainties associated with our commercialization efforts, we are unable to predict when we will become profitable, and we may never become profitable. Even if we do achieve profitability, we may not be able to sustain or increase profitability on a quarterly or annual basis. Our inability to achieve and then sustain profitability would have a material adverse effect on our business and financial condition.\nOur independent auditors report for the fiscal year ended September 30, 2022 includes an explanatory paragraph regarding substantial doubt about our ability to continue as a going concern, and absent additional financing we may be unable to remain a going concern.\nIf we are unsuccessful in our efforts to raise additional capital, based on our current and expected levels of operating expenses, our current capital is not expected to be sufficient to fund our operations for the next twelve months. These conditions raise substantial doubt about our ability to continue as a going concern. The Report of Independent Registered Public Accounting Firm at the beginning of the Consolidated Financial Statements included in Part II, Item 8, Financial Statements and Supplementary Data of this Report includes an explanatory paragraph about our ability to continue as a going concern.\nOur Consolidated Financial Statements for the year ended September 30, 2022 were prepared on the basis of a going concern, which contemplates that we will be able to realize our assets and discharge liabilities in the normal course of business. Our ability to meet our liabilities and to continue as a going concern is dependent upon the availability of future funding. The financial statements do not include any adjustments that might be necessary if we are unable to continue as a going concern. If we are unable to continue as a going concern, we might have to liquidate our assets and the values we receive for our assets in liquidation or dissolution could be significantly lower than the values reflected in our financial statements.\nIn addition, our current financial situation, and the presence of the explanatory paragraph about our ability to continue as a going concern, could also make it more difficult to raise the capital necessary to address our current needs and may materially adversely affect the price of our common stock.\nWe expect to need to obtain additional capital to fund our existing operations and, if we are unable to obtain such financing, we may be unable to continue to operate as a going concern.\nConsidering our current cash resources and our current and expected levels of operating expenses for the next twelve months, we expect to need additional capital to fund our planned operations for at least twelve months. This evaluation is based on relevant conditions and events that are currently known or reasonably foreseeable. A reduction in consumer demand for, or revenues from the sale of, our single serve coffee products and co-packing services could further constrain our cash resources.\nWe intend to seek to raise additional capital through public or private equity offerings. However, we may not be able raise such additional capital on favorable terms or at all. If we are unsuccessful in efforts to raise additional capital, based on our current levels of operating expenses, our current capital is not expected to be sufficient to fund our operations for the next twelve months. These conditions raise substantial doubt about our ability to continue as a going concern.\nWe may also consider raising additional capital in the future to expand our business, to pursue strategic investments or acquisitions, to take advantage of financing opportunities or for other reasons, including to:\n● fund development of our products and co-packing services;\n● acquire, license or invest in technologies or intellectual property relating to our existing products;\n● acquire or invest in complementary businesses or assets; and\n● finance capital expenditures and general and administrative expenses.\nOur present and future funding requirements will depend on many factors, including:\n● success of our current marketing efforts;\n● our revenue growth rate and ability to generate cash flows from sales of our products and co-packing services;\n● effects of competing technological and market developments; and\n● changes in regulatory oversight applicable to our products.\nThe various alternatives for raising additional capital include short-term or long-term debt financings, equity offerings, collaborations or licensing arrangements and each one carries potential risks. If we raise funds by issuing equity securities, our stockholders will be further diluted. If we raise funds by issuing debt securities, those debt securities would have rights, preferences and privileges senior to those of holders of our common stock. The terms of debt securities issued or borrowings pursuant to a credit agreement could impose significant restrictions on our operations or our ability to issue additional equity securities or issue additional indebtedness. We may also be required under additional debt financing to grant security interests on our assets, including our intellectual property. If we raise funds through collaborations and licensing arrangements, we might be required to relinquish significant rights to our intellectual property, or grant licenses on terms that are not favorable to us which could lower the economic value of those items to us.\nThe credit markets and the financial services industry have in the past experienced turmoil and upheaval characterized by the bankruptcy, failure, collapse, or sale of various financial institutions and intervention from the U.S. federal government. Furthermore, the capital markets and the financial services industry are currently and expected to continue to be unpredictable and volatile. These events typically make equity and debt financing more difficult to obtain. Accordingly, additional equity or debt financing might not be available on reasonable terms, if at all. If we cannot secure additional funding when needed, including due to changes in our business plan, a lower demand for our products or co-packing services or other risks described in this Report, we may have to delay, reduce the scope of or eliminate one or more sales and marketing initiatives and development programs, which would have a materially adverse effect on our business.\nWe have limited operating history, which may make it difficult to evaluate our current business and to forecast our future performance.\nWe have little operating history and are addressing an emerging market. As a result, our current and future business prospects are difficult to evaluate. All potential investors must consider our business prospects in light of the risks and difficulties we have encountered and will continue to encounter as a company operating in a rapidly evolving market. Some of these risks relate to our potential inability to:\n● effectively manage our business and proprietary information;\n● recruit and retain sales and marketing, technical and managerial personnel;\n● recruit and retain appropriate distributor relationships;\n● successfully develop and protect our intellectual property portfolio;\n● successfully provide high quality products and co-packing services as our business expands; and\n● successfully address other risks, as described in this Report or otherwise.\nIf we do not address these risks successfully, it could have a material adverse effect on our business and financial condition.\nOur ability to use our net operating loss carryforwards to offset future taxable income may be subject to certain limitations.\nThe Tax Cuts and Jobs Act (the TCJA), enacted in 2017, limited the use of net operating loss carryforwards arising in periods beginning after 2017 to eighty-percent of taxable income in the period to which the losses are carried. The TCJA also extended the expiration period for net operating losses arising in periods after 2017 from 20 years to an unlimited period.\nHowever, the taxable income limitation on the use of net operating loss carryforwards was eliminated by the Coronavirus Aid, Relief and Economic Security Act (the CARES Act) for tax years beginning before January 1, 2021. We may not be able to utilize our existing net operating losses or any portion thereof in the current tax year or any available carryforward period.\nIn addition, Section 382 may limit the utilization of net operating loss carryforwards. In general, under Section 382 of the Internal Revenue Code of 1986, as amended (the Code), a corporation that undergoes an ownership change is subject to annual limitations on its ability to use its pre-change net operating loss carryforwards, or NOLs, and certain other tax attributes to offset future taxable income or reduce taxes. Our past issuances of stock and other changes in our stock ownership may have resulted in one or more ownership changes within the meaning of Section 382 of the Code; accordingly, our pre-change NOLs may be subject to limitation under Section 382. State NOL carryforwards may be similarly limited. Furthermore, transactions in our stock that have occurred in the past and could occur in the future may trigger another ownership change pursuant to Section 382. Because of the cost and complexity involved in the analysis of a Section 382 ownership change and the fact that we do not have any taxable income to offset, we have not undertaken a study to assess whether an ownership change has occurred or whether there have been multiple ownership changes since we became a loss corporation as defined in Section 382. Future changes in our stock ownership could result in ownership changes under Section 382 of the Code further limiting our ability to utilize our NOLs. Finally, our ability to use NOLs of companies that we may acquire in the future may be subject to limitations. For these reasons, even if we attain profitability, we may not be able to use a material portion of our NOLs, and this could reduce our earnings and potentially affect the valuation of our stock.\nRisks Related to Our Business\nA substantial portion of our sales are completed on a purchase order basis without any written agreements, including sales under our co-packing arrangements as well as purchase orders for NuZee branded products from nationally recognized retailers. Such co-packing customers or retailers may issue fewer or smaller purchase orders than we expect under our co-packing arrangements, which could negatively impact our revenues. In addition, although these purchase orders are generally not cancelable, such customers may decide to delay or cancel orders, which could also negatively impact our revenues.\nGenerally, under our co-packing arrangements as well as our fulfillment of purchase orders for the distribution of NuZee branded products through nationally recognized retailers, customers must issue purchase orders for our products and co-packing services. Although these purchase orders stipulate key terms including order quantity, product specifications, price, payment terms, packaging method and delivery instructions, our co-packing arrangements and our arrangements with nationally recognized retailers are typically not governed by any written agreement and have no ongoing minimum purchase requirements. Accordingly, we cannot predict or make any guarantee of the amount of any future orders from co-packing customers or national retailers. In addition, although orders covered by firm purchase orders are generally not cancelable, customers may decide to delay or cancel orders, and we may have difficulty enforcing the provisions of the purchase order. In the event that customers with whom we have co-packing or retail fulfillment arrangements issue fewer or smaller purchase orders than we expect, or we experience any delays or cancellations in orders (due to current distress in the global economy caused by COVID-19, or otherwise), our revenues could decline substantially. Any such decline could result in us incurring net losses, increasing our accumulated deficit and needing to raise additional capital to fund our operations.\nCOVID-19 continues to affect our business operations and financial condition, and our liquidity could also be negatively impacted, particularly if the United States and East Asian economies remain unstable for a significant amount of time.\nIn December 2019, the novel coronavirus (COVID-19) originated in Wuhan, China. Since its discovery, COVID-19 has spread worldwide and caused significant disruption in the international and United States economies and financial markets. Federal, state and local government responses to COVID-19 and our responses to the outbreak have all disrupted and will continue to disrupt our business. In the United States, individuals are being required to practice social distancing, in many places have been restricted from gathering in large groups, and in some cases have been placed on complete restriction from non-essential movements outside of their homes. Even as efforts to contain the pandemic have made progress and some restrictions have relaxed, new variants of the virus have arisen globally. The impact of the Delta and Omicron variants, or other variants that may emerge, cannot be predicted at this time, and could depend on numerous factors, including vaccination rates and the availability of vaccines in different parts of the world, the effectiveness of COVID-19 vaccines and therapeutics against variants, and the response by governmental bodies to reinstate restrictive measures.\nThe spread of COVID-19 and its variants and resulting business closings, layoffs, travel restrictions and shelter-in-place or similar orders have resulted, and may result in the future, in substantial and widespread reduction in business activity and financial transactions, an increase in unemployment, reduced consumer spending, supply chain interruptions and overall economic and financial market instability, which may affect our ability to produce our products and provide our co-packing services, demand for our products and co-packing services, our revenues and our ability to collect outstanding receivables, as well as the ability of our customers to pay for goods delivered. Such federal or state laws, regulations, orders, or other governmental or regulatory actions addressing COVID-19 could ultimately have an adverse effect on our business, financial condition, results of operations and cash flows.\nIn the fiscal years ended September 30, 2022 and September 30, 2021, as a result of COVID-19 and its variants, certain of our customers slowed or delayed purchases of our co-packing services or single serve coffee products, and we also believe that potential sales of our single serve coffee products to new or potential customers in the hospitality industry were adversely impacted. We have also experienced delays in the submission and approval of custom artwork and packaging as well as the shipment to us of coffee for co-packing. In addition, we incurred lost production time due to employee absences. We do not believe, however, that these delays and disruptions had a significant effect on our business or results of operations to date, and in some cases, we have been able to mitigate these adverse effects in part by sourcing coffee and other supplies from alternative suppliers in the United States. As COVID-19 and its variants are complex and constantly changing, the full extent and duration of the impact of COVID-19 on our business and financial results is currently unknown and depends on future developments that are uncertain and unpredictable, including its impact on supply chains and overall economic and financial markets. If general economic conditions deteriorate or remain uncertain for an extended period of time, our liquidity may be harmed and the trading price of our common stock could decline significantly. COVID-19 may adversely affect the ability of our customers to pay for goods delivered on a timely basis, or at all. Any increase in the amount or deterioration in the collectability of accounts receivable will adversely affect our cash flows and results of operations, requiring an increased level of working capital.\nWe have a manufacturing and sales office in Korea, and we source our manufacturing equipment and filters from East Asian companies. The continued spread of COVID-19 and the appearance of new variants and implementation of restrictive measures may adversely affect our operations in North America and Asia and our business generally, depending on the extent of its spread of the virus, the effect on international trade and commerce and on foreign and domestic travel generally of any measures taken to combat the virus, any action taken by government entities to combat the negative macroeconomic effects of these measures, and other factors. If such circumstances continue to deteriorate, our production capabilities and demand for our products and co-packing services may decline, which would have an adverse effect on our results of operations and financial condition.\nSales to a limited number of customers represent a significant portion of our net sales. The loss of a key customer, including by consolidation in the retail channel, and efforts by our customers to improve their profitability could reduce sales of NuZee branded products and adversely affect our financial performance.\nSales to relatively few co-packing customers account for a significant percentage of our net sales, and our success depends in part on our ability to maintain good relationships with these and other key retail and grocery customers. Currently, Amazon and our Coffee Blenders website are our only established domestic retail channels for direct sales to consumers of NuZee branded products. However, we can provide no assurance that any of these customers or any of our other customers will continue to utilize our products or our co-packing services at current levels, or at all. We have arrangements with our co-packing customers primarily based on purchase orders which stipulate key terms including order quantity, product specifications, price, payment terms, packaging method and delivery instructions.\nAs a result, many of our key customers may cease purchasing our products or utilizing our co-packing services at any time without penalty and are free to purchase products from our competitors. There can be no assurance that our customers will continue to purchase our products or utilize our co-packing services in the same mix or quantities or on the same terms as they have in the past. The loss of one or more of our key customers, or cancellation of or reduction in the amount of purchase by our key customers, could have an adverse effect on our results of operations and financial condition.\nIn addition, because of the competitive environment facing retailers, many of our customers have increasingly sought to improve their profitability through increased promotional programs, pricing concessions, more favorable trade terms and increased emphasis on private label products. To the extent we provide concessions or trade terms that are favorable to customers, our margins would be reduced. Further, if we are unable to continue to offer terms that are acceptable to our significant customers or our customers determine that they need fewer inventories to service consumers, these customers could reduce purchases of our products or may increase purchases of products from our competitors, which would harm our sales and profitability.\nOur industry is also being affected by the trend toward consolidation in the retail channel. Retailers have and will likely continue to seek lower prices from us and demand increased marketing or promotional expenditures. Large retailers also may be more likely to use their distribution networks to introduce and develop private label brands. Strategic partners may also choose to vertically integrate their brands manufacturing and distribution. Any of the foregoing could negatively affect sales of our products and co-packing services and our profitability.\nContinued innovation and the successful development and timely launch of new products and co-packing services are critical to our financial results and achievement of our growth strategy.\nOur primary focus is the development of single serve coffee products in the North American market targeting the individual consumer for use at home and office or other settings. Under our private label coffee development program, we intend to continue working with current and new customers in developing private labels of signature coffees and, in this regard, use our expertise to source, roast (utilizing our third-party roasting or manufacturing partners), blend, and package coffee to their exact specifications. We have also developed and sell NuZee and DRIPKIT branded products. Our growth strategy includes, among other things, further developing our NuZee and DRIPKIT branded product lines and growing our private label coffee development program to reach new co-packing customers, as well as increasing sales of our coffee brew bag coffee products. In the future, as part of our growth strategy, we may also consider co-packaging other products that are complementary to our current single serve coffee product offerings and provide us with a deeper access to our customers.\nOur future success depends, largely, on our ability to implement these and our other growth strategies effectively. However, achievement of our growth strategy is dependent, among other things, on our ability to extend the product offerings of our existing brands and introduce innovative new products and co-packing services. Although we devote significant focus to the development of new products, including NuZee and DRIPKIT branded products, we may not be successful in developing innovative new products or our new products may not be commercially successful. We also may be unsuccessful in expanding our co-packaging services to other products that are complementary to our current single serve coffee product offerings. Additionally, our new product introductions are often time sensitive, and thus failure to deliver innovations on schedule could be detrimental to our ability to successfully launch such new products and retain partners, in addition to potentially harming our reputation and customer loyalty. If we fail to implement our growth strategies or if we invest resources in growth strategies that ultimately prove unsuccessful, our sales and profitability may be negatively affected, which would materially and adversely affect our business, financial condition and results of operations. Our financial results and our ability to maintain or improve our competitive position will depend on our ability to effectively gauge the direction of our key marketplaces and successfully identify, develop, manufacture, market and sell new or improved products and co-packing services in these changing marketplaces.\nOur future financial results are difficult to predict, and failure to meet market expectations for our financial performance or any publicly announced guidance may cause the price of our stock to decline.\nAs we and our industry evolve, we expect to face new challenges with respect to our introduction of innovative products and the changing competitive landscape within the single serve category and the beverage industry. These challenges can occur at various stages, including design, supply chain and sales cycle. Any public forecasts regarding the expected performance of our business and future operating results are forward-looking statements subject to risks and uncertainties, including the risks and uncertainties described in our filings with the SEC and in our other public statements, and necessarily reflect current assumptions and judgments that may prove incorrect. As a result, there can be no assurance that our performance will be consistent with any public forecasts or that any variation from such forecasts will not be material and adverse. Failure to meet expectations, particularly with respect to operating margins, earnings per share, operating cash flows and net revenues may result in a decline and/or increased volatility in the price of our stock. In addition, broad price and volume fluctuations in the stock market as a whole, as well as general economic, business and political conditions, may adversely affect the price of our stock in ways that may be unrelated to our financial performance.\nOur international sales and operations subject us to various additional legal, regulatory, financial and other risks.\nWe have a manufacturing and sales office in Seoul, Korea. We operate globally and are attempting to develop products and provide co-packing services in multiple countries. Consequently, we face complex legal and regulatory requirements in multiple jurisdictions, which may expose us to certain financial and other risks. International operations are subject to a variety of risks, including:\n● foreign currency exchange rate fluctuations;\n● greater difficulty in overseeing foreign operations;\n● logistical and communications challenges;\n● potential adverse changes in laws and regulatory practices, including export license requirements, trade barriers, tariffs and tax laws;\n● burdens and costs of compliance with a variety of foreign laws;\n● political and economic instability;\n● foreign tax laws and potential increased costs associated with overlapping tax structures;\n● greater difficulty in protecting intellectual property;\n● the risk of third-party disputes over ownership of intellectual property and infringement of third-party intellectual property by our products; and\n● general social, economic and political conditions in these foreign markets.\nIncreased competition, including as a result of industry consolidation, could hurt our businesses.\nThe beverage industry is intensely competitive and we compete with respect to product, quality, convenience, technology, innovation, and price. We face significant competition in each of our channels and marketplaces. We compete with major international beverage companies that operate in multiple geographic areas, many of which have greater financial and other resources than we do, as well as numerous companies that are primarily local in operation. Our NuZee and DRIPKIT branded products also compete against local or regional brands as well as against private label brands developed by retailers. Our ability to gain or maintain share of sales in the global marketplace or in various local marketplaces or maintain or enhance our relationships with our partners and customers may be limited as a result of actions by competitors, including as a result of increased consolidation in the food and beverage industry.\nChanges in the coffee, tea and beverage environment and retail landscape could impact our financial results.\nThe coffee, tea and beverage environment is rapidly evolving as a result of, among other things, changes in consumer preferences; shifting consumer tastes and needs; changes in consumer lifestyles; and competitive product and pricing pressures. In addition, the beverage retail landscape is dynamic and constantly evolving, not only in emerging and developing marketplaces, where modern trade is growing at a faster pace than traditional trade outlets, but also in developed marketplaces, where discounters and value stores, as well as the volume of transactions through e-commerce, are growing at a rapid pace. If we are unable to successfully adapt to the rapidly changing environment and retail landscape, our share of sales, volume growth and overall financial results could be negatively affected.\nOur business, growth and profitability depend on the performance of third-parties and our relationship with them.\nIn connection with the manufacture of NuZee and DRIPKIT branded products and private labels for our co-packing customers under our private label development program, we rely on third-party roasters and manufacturing partners to roast green whole bean coffee according to our specifications before shipping to us for grinding, blending, packing and packaging. We also rely on our manufacturing partner in Knoxville, Tennessee to provide us with additional manufacturing, coffee roasting and co-packing capabilities, and facilitate distribution efforts to the Eastern United States. Our reliance on third-party roasters and manufacturing partners subjects us to additional risks, including the possible termination of the arrangement by a third-party roaster or manufacturing partner at a time that is costly or inconvenient for us. Our third-party roasters and manufacturing partners are independent entities subject to their own unique operational and financial risks that are out of our control. If any of these third-party roasters or manufacturing partners fail to perform as required, this could cause delays in our receipt of roasted whole-bean coffee that is necessary to manufacture our products and provide our co-packing services or otherwise adversely affect our business.\nIn addition, a significant portion of our distribution network, and correspondingly our success in distributing our single serve coffee products, depends on the performance of third-parties. Any non-performance or deficient performance by such parties may undermine our operations and profitability. For distribution of our single serve coffee products to our co-packing customers, we typically rely on the distribution networks of our co-packing customers, including freight companies and common carriers arranged by them. At the request of our co-packing customers, we may also utilize a freight broker for the distribution and delivery of our products according to our co-packing customers instructions. The success of these distribution networks depends on the performance of brokers, distributors, common carriers and retailers, as well as our third-party manufacturing partner as it relates to distribution of certain of our products to the Eastern United States. There is a risk that a broker, distributor, common carrier or retailer may refuse to or cease to market or carry our product, or that any such entity or our third-party manufacturing partner may not adequately perform its functions within the network by, without limitation, failing to distribute our products.\nFurthermore, such third-parties financial position or market share may deteriorate, which could adversely affect our distribution, marketing and sale activities. We must also maintain good commercial relationships with third-party brokers, distributors and retailers so that they will promote and carry our product. Any adverse consequences resulting from the performance of third-parties or our relationship with them could undermine our operations and profitability.\nInterruption or increased costs of our supply chain and sales network, including a disruption in operations at any of our facilities, could affect our ability to manufacture or distribute products and could adversely affect our business and sales.\nA disruption in operations at any of our facilities or any other disruption in our supply chain or increase in prices relating to service by our retailers, distributors, common carriers that ship goods within our distribution channels, or otherwise, whether as a result of shipping costs and delays, trade restrictions, casualty, natural disaster, weather, power loss, telecommunications failure, terrorism, labor shortages, contractual disputes, interruptions in port operations or highway arteries, pandemic, strikes, work stoppages, the financial or operational instability of key suppliers, distributors and transportation providers, or other causes, could significantly impair our ability to operate our business, adversely affect our relationship with our customers, and impact our financial condition or results of operations. In the fiscal years ended September 30, 2022 and September 30, 2021, as a result of responses to COVID-19 and its variants, we have experienced delays in the shipment to us of coffee and packaging materials for co-packing. To date, in some cases we have been able to mitigate these adverse effects in part by sourcing coffee and other supplies from alternative suppliers in the United States, but any such mitigation efforts may not be successful in the future.\nThe loss of any member of our senior management team or our inability to attract and retain highly skilled personnel could have a material adverse effect on our business.\nOur success depends on the skills, experience and performance of key members of our senior management team. The individual and collective efforts of our senior management team will be important as we continue to expand our commercial activities and develop additional products. The loss or incapacity of existing members of our senior management team could have a material adverse effect on our business and financial condition if we experience difficulties in hiring qualified successors. Our employment agreements with our executive officers are at will, and the retention of our executive officers for any period of time cannot be guaranteed. We do not maintain key person insurance on any of our employees.\nDue to the specialized nature of the business and our small size, we are highly dependent upon our ability to attract and retain qualified sales and marketing, technical and managerial personnel. The loss of the services of existing personnel, as well as the failure to recruit key sales, marketing, technical and managerial personnel in a timely manner would be detrimental to our development and could have a material adverse effect on our business and financial condition. Our anticipated growth and expansion into areas and activities requiring additional expertise, such as sales and marketing, may require the addition of new management personnel, both domestic and international. All of our employees may terminate their employment at any time with short or no advance notice. We may have difficulties locating, recruiting or retaining qualified sales people. Recruiting and retention difficulties will limit our ability to support our development and sales programs and to build a commercially viable business.\nThe competition for talent is currently extremely high. In this competitive environment, our business could be adversely impacted by increases in labor costs, including wages and benefits, including those increases triggered by regulatory actions regarding wages, scheduling and benefits; increased health care and workers compensation insurance costs; increased wages and costs of other benefits necessary to attract and retain high quality employees with the right skill sets, and increased wages, and benefits and costs related to COVID-19. In addition, our wages and benefits programs, combined with the challenging conditions due to COVID-19, may be insufficient to attract and retain talent.\nBecause our management structure is not centralized, the management of our business operations may be more expensive and more difficult.\nAs part of our strategy to attract the most qualified individuals, we do not require the members of our management team to relocate to a particular geographic area. Accordingly, the members of our management team are geographically dispersed. This decentralized structure might cause additional expenses in the conduct of our business, and may also delay communication between members of our management team, lower the quality of our management decisions or decrease our ability to take action quickly.\nIncreases in the cost of high-quality coffee beans or other commodities or decreases in the availability of high quality coffee beans or other commodities could have an adverse impact on our business and financial results.\nUnder our co-packing arrangements, our co-packing customers typically supply us with roasted, whole bean coffee that we then produce and package into single serve pour over, DRIPKIT pour over and coffee brew bag coffee products according to their formulations and specifications. We also purchase green whole bean coffee from multiple green coffee suppliers to support the manufacture of our NuZee and DRIPKIT branded coffee products and the development of private labels under our private label development program, in which we work with co-packing customers in developing private labels of signature coffees by sourcing, blending, and packaging coffee to their exact specifications. After being sourced by us, the green whole bean coffee is then shipped to our roasting partners where the coffee is roasted and then shipped to us for grinding, blending and packaging.\nThe price of coffee is subject to significant volatility, and may increase due to the factors described below. The high-quality coffee beans we and our co-packing customers seek tend to trade on a negotiated basis at a premium above the commodity trading price of coffee as quoted on the Intercontinental Exchange, also known as the C price of coffee. This premium depends upon the supply and demand at the time of purchase and the amount of the premium can vary significantly. Increases in the C coffee commodity price do increase the price of high-quality coffee and also impact our ability to enter into fixed-price purchase commitments. The supply and price of coffee we and our co-packing customers purchase can also be affected by multiple factors in the producing countries, including weather, natural disasters, crop disease (such as coffee rust) and pests, general increase in farm inputs and costs of production, armed conflict, labor actions, government actions and trade barriers or tariffs, inventory levels and political and economic conditions, as well as real or perceived supply shortages, an increase in green coffee purchased and sold on a negotiated basis rather than directly on commodity markets in response to higher production costs relative to C market prices, pandemics or other disease outbreaks (including COVID-19), and the actions of certain organizations and associations that have historically attempted to influence prices of coffee through agreements establishing export quotas or by restricting coffee supplies. Recently, there has been increased volatility in the C market price, with prices at times increasing to five-year highs. The uncertainty over several factors, including the impact of weather patterns in coffee producing regions, and global supply chain constraints and shipping shortages, caused greater uncertainty in the markets. Specifically, severe frosts and drought in Brazil currently threaten to negatively impact crop yields for multiple harvests, which could reduce supply and increase cost. In addition, the political situation in many of the Arabica coffee growing regions, including Africa, Indonesia, and Central and South America, can be unstable, and such instability could also reduce supply and increase cost. Speculative trading in coffee commodities can also influence coffee prices. Because of the significance of coffee beans to our operations, combined with our ability to only partially mitigate future price risk through purchasing practices and hedging activities, increases in the cost of high-quality coffee beans could have an adverse impact on our profitability, financial condition or results of operations.\nMaintaining a steady supply of roasted coffee beans from our co-packing customers is essential to our co-packing arrangements, and securing an adequate supply of green whole bean coffee is essential to our ability to manufacture NuZee and DRIPKIT branded products and to support the development of private labels for our co-packing customers. We and certain of our co-packing customers rely upon relationships with key suppliers to source coffee. If any of these supply relationships deteriorate or we or our co-packing customers are unable to renegotiate contracts with suppliers (with similar or more favorable terms) or find alternative sources for supply, we or our co-packing customers may be unable to procure a sufficient quantity of high-quality coffee beans at acceptable prices or at all. If we or our co-packing customers are not able to purchase sufficient quantities of coffee due to any of the above factors or a worldwide or regional shortage, we may not be able to fulfill the demand for our products or may suffer reduced demand for our co-packing services, which could have an adverse impact on our business and financial results.\nWe expect to continue to experience inflationary pressure on our cost structure, and price increases may not be sufficient to offset cost increases or may result in sales volume declines.\nAlthough inflation in the United States had been relatively low for many years, there was a significant increase in inflation beginning in the second half of 2021, which has continued into 2022. We expect for the foreseeable future to experience inflationary pressure on our cost structure. We may be able to pass some or all raw materials, energy and other input cost increases to customers by increasing the selling prices of our products or decreasing the size of our products; however, higher product prices or decreased product sizes may also result in a reduction in sales volume and/or consumption. If we are not able to mitigate these inflationary pressures, such as by increasing our selling prices or reducing product sizes sufficiently to offset increased raw material, energy or other input costs, including but not limited to packaging, direct labor, overhead and employee benefits, or if our sales volume decreases significantly, there could be a negative impact on our results of operations and financial condition.\nWe may be unable to manage our future growth effectively, which could make it difficult to execute our business strategy.\nWhile we are currently a small company and, therefore, limited in our product development, marketing and sales activities, we anticipate continued growth in our business operations commensurate with the expansion of our sales and support operations and distribution network and the commercialization of our single serve coffee products. Any future growth could impose significant added responsibilities on members of our existing management and create strain on our organizational, administrative, and operational infrastructure, including sales and marketing, quality control, and customer service. Our ability to manage our growth properly will require us to continue to improve our operational, financial and management controls, as well as our reporting systems and procedures, which in the past have been determined to be inadequate. Our status as an exchange-listed public company will require us to increase our investment in financial accounting and reporting. If our current infrastructure is unable to handle our growth, we may need to expand our infrastructure, to identify and recruit new staff and to implement new reporting systems. The time and resources required to implement such expansion and systems could adversely affect our operations. Our future financial performance and our ability to expand and market our single serve coffee products and to compete effectively will depend, in part, on our ability to manage this potential future growth effectively, without compromising quality.\nAny failure by us to accurately forecast customer demand for our products, or to quickly adjust to forecast changes, could adversely affect our business and financial results.\nThere is inherent risk in forecasting demand due to the uncertainties involved in assessing the current level of maturity of the single serve component of our business. We set target levels for the manufacture of our single serve coffee products and for the purchase of coffee in advance of customer orders based upon our forecasts of customer demand and those of our business partners. If our forecasts exceed demand, we could experience excess inventory in the short-term, excess manufacturing capacity in the short and long-term, and/or price decreases, all of which could impact our financial performance. Alternatively, if demand exceeds our forecasts significantly beyond our current manufacturing capacity, we may not be able to satisfy customer demand, which could result in a loss of share if our competitors are able to meet customer demands. A failure to accurately predict the level of demand for our products could adversely affect our net revenues and net income.\nWe may not be able to adequately protect our intellectual property rights, and our competitors may be able to offer similar products and services, which would harm our competitive position.\nOur success depends in part upon our intellectual property rights. We rely primarily on trademark, trade secret laws, confidentiality procedures, license agreements and contractual provisions to establish and protect our proprietary rights over our products, procedures and services. Other persons could copy or otherwise obtain and use our intellectual properties without authorization or create intellectual properties similar to ours independently. We may also pursue the registration of our domain names, trademarks and service marks in other jurisdictions, including the United States. However, we cannot assure you that we will be able to protect our proprietary rights. Further, our competitors may be able to independently develop similar intellectual property, duplicate our products and services or design around any intellectual property rights we hold. Further, our intellectual property rights may be subject to termination or expirations. The loss of intellectual property protections or the inability to timely regain intellectual property protections could harm our business and ability to compete.\nWe may be subject to intellectual property infringement claims, which may be expensive to defend and may disrupt our business and operations.\nWe cannot be certain that our operations or any aspects of our business do not or will not infringe upon or otherwise violate trademarks, patents, copyrights, know-how or other intellectual property rights held by third parties. We may be from time to time subject to legal proceedings and claims relating to the intellectual property rights of others.\nThere may be third-party intellectual property that is infringed by our products, services or other aspects of our business. There could also be existing patents or other intellectual property rights of which we are not aware that our products may inadvertently infringe. We cannot assure you that holders of the relevant intellectual property rights purportedly relating to some aspect of our technology platform or business, if any such holders exist, would not seek to enforce such intellectual property rights against us in the United States or any other jurisdiction. We also cannot be certain that our efforts will be effective in completely preventing the infringement of trademarks, patents, copyrights, know-how or other intellectual property rights held by third parties. If we are found to have violated the intellectual property rights of others, we may be subject to liability for our infringement activities or may be prohibited from using such intellectual property, and we may incur licensing fees or be forced to develop alternatives of our own. In addition, we may incur significant expenses, and may be forced to divert managements time and other resources from our business and operations to defend against these third-party infringement claims, regardless of their merits. Successful infringement or licensing claims made against us may result in significant monetary liabilities and may materially disrupt our business and operations by restricting or prohibiting our use of the intellectual property in question.\nFailure to comply with applicable transfer pricing and similar regulations could harm our business and financial results.\nIn many countries, including the United States, we are subject to transfer pricing and other tax regulations designed to ensure that appropriate levels of income are reported as earned and are taxed accordingly. Although we believe that we are in substantial compliance with all applicable regulations and restrictions, we are subject to the risk that governmental authorities could audit our transfer pricing and related practices and assert that additional taxes are owed. In the event that the audits or assessments are concluded adversely to us, we may or may not be able to offset or mitigate the consolidated effect of foreign income tax assessments through the use of U.S. foreign tax credits. Because the laws and regulations governing U.S. foreign tax credits are complex and subject to periodic legislative amendment, we cannot be sure that we would in fact be able to take advantage of any foreign tax credits in the future.\nOur business operations are conducted in multiple languages and could be disrupted due to miscommunications or translation errors.\nThe success of our business depends in part on our marketing efforts in the United States and various countries in East Asia and Latin America, each of which is conducted in the local language. Additionally, our operations often require that complex contracts, communications and technical information be accurately translated into foreign languages. Miscommunications or inaccurate foreign language translations could have a material adverse effect on our business operations and financial condition.\nSignificant additional labeling or warning requirements or limitations on the availability of our products may inhibit sales of affected products.\nVarious jurisdictions may seek to adopt significant additional product labeling (such as requiring labeling of products that contain genetically modified organisms) or warning requirements or limitations on the availability of our products relating to the content or perceived adverse health consequences of certain of our products. If these types of requirements become applicable to one or more of our major products under current or future environmental or health laws or regulations, they may inhibit sales of such products. One such law, which is in effect in California and is known as Proposition 65, requires that a warning appear on any product sold in California that contains a substance that, in the view of the state, causes cancer or birth defects. The state maintains lists of these substances and periodically adds other substances to these lists. Proposition 65 exposes all food and beverage producers to the possibility of having to provide warnings on their products in California because it does not provide for any generally applicable quantitative threshold below which the presence of a listed substance is exempt from the warning requirement. Consequently, the detection of even a trace amount of a listed substance can subject an affected product to the requirement of a warning label. However, Proposition 65 does not require a warning if the manufacturer of a product can demonstrate that the use of the product in question exposes consumers to a daily quantity of a listed substance that is below a safe harbor threshold that may be established, is naturally occurring, is the result of necessary cooking, or is subject to another applicable exception. While currently substances created by and inherent in the processes of roasting coffee beans or brewing coffee have been determined by the State of California not to pose a significant risk, such chemicals could be added to the Proposition 65 lists in the future. With respect to substances that have not yet been listed under Proposition 65, the Company takes the position that listing is not scientifically justified. The State of California or other parties, however, may take a contrary position. If we were required to add Proposition 65 warnings on the labels of one or more of our beverage products produced for sale in California, the resulting consumer reaction to the warnings and possible adverse publicity could negatively affect our sales both in California and in other marketplaces.\nRisks Related to Ownership of our Common Stock\nThe market price of our stock may be volatile, and you could lose all or part of your investment.\nThe trading price of our common stock is likely to be highly volatile and subject to wide fluctuations in response to various factors, some of which we cannot control. In addition to the factors discussed in this Risk Factors section and elsewhere in this Report, these factors include but are not limited to:\n● the success of, or developments in, competitive products, services or technologies;\n● regulatory actions with respect to our products and our competitors;\n● the level of success of our marketing strategy;\n● our ability to obtain top-grade packing equipment for single serve coffee production;\n● announcements by us or our competitors of significant acquisitions, strategic collaborations, joint ventures or capital commitments;\n● regulatory or legal developments in the United States and other countries;\n● recruitment or departure of key personnel;\n● expenses related to any of our development programs and our business in general;\n● actual or anticipated changes in financial estimates, development timelines or recommendations by securities analysts;\n● failure to meet or exceed financial estimates and projections of the investment community or that we provide to the public;\n● variations in our financial results or those of companies that are perceived to be similar to us;\n● fluctuations in the valuation of companies perceived by investors to be comparable to us;\n● share price and volume fluctuations attributable to inconsistent trading volume levels of our shares;\n● our ability or failure to raise additional capital in equity or debt transactions;\n● costs associated with our sales and marketing initiatives;\n● costs and timing of obtaining and maintaining FDA and other regulatory clearances and approvals for our products;\n● sales of our common stock by us, our insiders or our other stockholders; and\n● general economic, business, industry, market and political conditions, including prevailing interest rates and the rate of inflation.\nIn addition, the stock market in general has in the past experienced extreme price and volume fluctuations that have often been unrelated or disproportionate to the operating performance of the relevant companies. Broad market and industry factors may negatively affect the market price of our common stock, regardless of our actual operating performance. The realization of any of the above risks or any of a broad range of other risks, including those described in this Risk Factors section, could have a dramatic and material adverse impact on the market price of our common stock.\nDespite our listing on the Nasdaq Capital Market, there can be no assurance that an active trading market for our common stock will be sustained.\nIn June 2020, our common stock commenced trading on the Nasdaq Capital Market under the symbol NUZE. Although our common stock is listed on the Nasdaq Capital Market, an active trading market for our shares may never be sustained. You may not be able to sell your shares quickly or at the market price if trading in shares of our securities is not active. Further, an inactive market may also impair our ability to raise capital by selling shares of our securities and may impair our ability to enter into strategic partnerships or acquire companies or products by using shares of our securities as consideration, which could have a material adverse effect on our business, financial condition, and results of operations.\nIf we fail to regain compliance with the requirements for continued listing on the Nasdaq Capital Market, our common stock could be delisted from trading, which would adversely affect the liquidity of our common stock and our ability to raise additional capital.\nOn September 20, 2022, Nasdaq notified us that, for 30 consecutive business days, the bid price for our common stock had closed below the minimum $1.00 per share requirement for continued inclusion on the Nasdaq Capital Market pursuant to Nasdaq Listing Rule 5550(a)(2) (the Bid Price Rule). In accordance with Nasdaq Listing Rule 5810(c)(3)(A), we were provided an initial period of 180 calendar days, or until March 20, 2023, to regain compliance with the Bid Price Rule. If we do not regain compliance by March 20, 2023, then Nasdaq may grant us a second 180 calendar day period to regain compliance, provided we meet the other initial listing standards for the Nasdaq Capital Market, with the exception of the Bid Price Rule, and provide written notice of our intention to cure the deficiency during the second compliance period. In order to regain compliance, the bid price of our common stock must close at a price of at least $1.00 per share for a minimum of 10 consecutive trading days. If we do not comply with the Bid Price Rule within the allotted compliance periods, including any extensions granted by the Nasdaq Capital Market, then Nasdaq will provide notice to us that our common stock will be delisted. We would then be entitled to appeal that determination to a Nasdaq hearings panel. There can be no assurance that we will regain compliance with the Bid Price Rule during the initial 180-day compliance period or, if necessary, secure a second period of 180 days to regain compliance with the Nasdaq Capital Market listing requirements.\nAs of the date of this Report, we have not yet regained compliance with the Bid Price Rule. However, on December 9, 2022, at a Special Meeting of Stockholders, our stockholders approved a proposal granting the Board discretionary authority to file the Certificate of Amendment to effect the 2022 Reverse Stock Split. The 2022 Reverse Stock Split would decrease the total number of shares of our common stock outstanding and should, absent other factors, proportionately increase the market price of our common stock, which would be above $1.00 per share. Therefore, the Board believes that the 2022 Reverse Stock Split is an effective means for us to regain compliance with the Bid Price Rule. The Board intends to effect the 2022 Reverse Stock Split as soon as practicable.\nDelisting from the Nasdaq Capital Market as a result of our failure to regain compliance with the Bid Price Rule or otherwise could adversely affect our ability to raise additional financing through the public or private sale of equity securities, and would significantly affect the ability of investors to trade our securities and negatively affect the value and liquidity of our common stock. Delisting could also have other negative results, including the potential loss of confidence by employees and the loss of institutional investor interest.\nEven if we regain compliance with the Bid Price Rule, the Nasdaq Capital Market may subsequently delist our common stock if we fail to comply with ongoing listing standards going forward.\nThe Nasdaq Capital Markets rules for listed companies requires us to meet certain financial, public float, bid price and liquidity standards on an ongoing basis in order to continue the listing of our common stock. In addition to specific listing and maintenance standards, the Nasdaq Capital Market has broad discretionary authority over the continued listing of securities, which it could exercise with respect to the listing of our common stock.\nAs a listed company, we are required to meet the continued listing requirements applicable to all Nasdaq Capital Market companies. In addition to the Bid Price Rule previously described, Nasdaq Capital Market listing rules require us to maintain a minimum stockholders equity of $2.5 million under Nasdaq Listing Rule 5550(b)(1), a minimum market value of listed securities of $35 million under Nasdaq Listing Rule 5550(b)(2), or a minimum net income of $500,000 under Nasdaq Listing Rule 5550(b)(3). If we fail to meet one of those standards or any other Nasdaq Capital Market continued listing requirement, our common stock may be subject to delisting, as applied by Nasdaq in its discretion. We intend to take all commercially reasonable actions to maintain our Nasdaq Capital Market listing. If our common stock is delisted in the future, it is not likely that we will be able to list our common stock on another national securities exchange on a timely basis or at all and, as a result, we expect our securities would be quoted on an over-the-counter market; however, if this were to occur, our stockholders could face significant material adverse consequences, including limited availability of market quotations for our common stock and reduced liquidity for the trading of our securities. In addition, in the event of such delisting, we could experience a decreased ability to issue additional securities and obtain additional financing in the future.\nThe Board intends to effect the 2022 Reverse Stock Split as soon as practicable in order to regain compliance with Nasdaq Capital Market listing rules. We cannot predict the effect that the 2022 Reverse Stock Split will have on the market price for shares of our common stock.\nThe Board intends to effect the 2022 Reverse Stock Split as soon as practicable in order to regain compliance with Nasdaq Capital Market listing rules, but there can be no assurance that the 2022 Reverse Stock Split will be effected in a timely manner or at all. Even if we regain compliance with the Bid Price Rule by effecting the 2022 Reverse Stock Split, we may in the future be required to complete one or more additional reverse stock splits in order to regain compliance with Nasdaq listing requirements. We cannot predict the effect that the 2022 Reverse Stock Split or any future reverse stock split will have on the market price for shares of our common stock, and the history of similar reverse stock splits for companies in like circumstances has varied. Some investors may have a negative view of a reverse stock split. Even if the 2022 Reverse Stock Split or any future reverse stock split has a positive effect on the market price for shares of our common stock, performance of our business and financial results, general economic conditions and the market perception of our business, and other adverse factors which may not be in our control could lead to a decrease in the price of our common stock following such reverse stock split.\nFurthermore, even if the 2022 Reverse Stock Split or any future reverse stock split does result in an increased market price per share of our common stock, the market price per share following such reverse stock split may not increase in proportion to the reduction of the number of shares of our common stock outstanding before the implementation of such reverse stock split. Accordingly, even with an increased market price per share, the total market capitalization of shares of our common stock after such reverse stock split could be lower than the total market capitalization before such reverse stock split. Also, even if there is an initial increase in the market price per share of our common stock after such reverse stock split, the market price may not remain at that level.\nIf the market price of shares of our common stock declines following the 2022 Reverse Stock Split or any other reverse stock split, the percentage decline as an absolute number and as a percentage of our overall market capitalization may be greater than would occur in the absence of such reverse stock split due to decreased liquidity in the market for our common stock. Accordingly, the total market capitalization of our common stock following such reverse stock split could be lower than the total market capitalization before such reverse stock split.\nOur stockholders will experience dilution if we issue additional equity securities in future financing transactions.\nIf we issue additional common stock, or securities convertible into or exchangeable or exercisable for common stock, our stockholders may experience additional dilution, and any such issuances may result in downward pressure on the price of our common stock. Further, investors purchasing shares or other securities in the future could have rights superior to existing stockholders.\nA significant portion of our total outstanding shares of common stock are eligible to be sold into the market in the near future, including pursuant to Rule 144, which could cause the market price of our common stock to drop significantly, even if our business is doing well.\nSales of a substantial number of shares of our common stock in the public market could occur at any time. These sales, or the perception in the market that the holders of a large number of shares intend to sell shares, could reduce the market price of our common stock. We have also registered all shares of common stock that are reserved for issuance under the NuZee, Inc. 2019 Stock Incentive Plan and all shares of common stock currently reserved for issuance under the NuZee, Inc. 2013 Stock Incentive Plan. As a result, these shares can be freely sold in the public market upon issuance, subject to volume limitations applicable to affiliates and the lock-up agreements described in our filings with the SEC. A sale under Rule 144 or under any other exemption from the Securities Act, if available, or pursuant to subsequent registrations of our shares of common stock, may have a depressive effect upon the price of our shares of common stock in any active market that may develop. We believe that a significant portion of our total outstanding shares of common stock may be sold in the public market without restriction by non-affiliates pursuant to Rule 144.\nOur principal stockholder and management, including our Chief Executive Officer in particular, own a significant percentage of our stock and will be able to exert significant control over matters subject to stockholder approval.\nAs of December 23, 2022, our executive officers and directors beneficially owned approximately 28% of our voting stock. Our Chief Executive Officer, President and Chairman of the Board individually beneficially owns approximately 22% of our voting stock. This concentration of control creates a number of risks. Our executive officers and directors, along with other holders of 5% or more of our capital stock and their respective affiliates, have the ability to exert significant influence over us through this ownership position. These stockholders may be able to exert significant influence over all matters requiring stockholder approval, including with respect to elections of directors, amendments of our organizational documents, or approval of any merger, sale of assets or other major corporate transaction, and our stockholders may find it difficult to replace members of management should our stockholders disagree with the manner in which the Company is operated. Furthermore, this concentration of ownership may prevent or discourage unsolicited acquisition proposals or offers for our common stock that you may feel are in your best interest as one of our stockholders. The interests of this group of stockholders may not always coincide with your interests or the interests of other stockholders and they may act in a manner that advances their best interests and not necessarily those of other stockholders.\nWe incur significant costs as a result of operating as a public company, and our management must devote substantial time to compliance initiatives as a result of the listing of our common stock on the Nasdaq Capital Market.\nAs a listed company, we are required to meet the continued listing requirements applicable to all NASDAQ Capital Market companies. We expect our ongoing compliance with such rules and regulations to substantially increase our legal and financial compliance costs and to make some activities more time-consuming and costly. These requirements may divert the attention of our management and personnel from other business concerns, and they could have a material adverse effect on our business, financial condition, and results of operations. The increased costs will decrease our net income or increase our net loss, and may require us to reduce costs in other areas of our business or increase the prices of our products or services. For example, these rules and regulations may make it more difficult and more expensive for us to obtain director and officer liability insurance and we may be required to incur substantial costs to maintain the same or similar coverage. We cannot accurately predict or estimate the amount or timing of additional costs we may incur to respond to these requirements. The impact of these requirements could also make it more difficult for us to attract and retain qualified persons to serve on our Board, our Board committees or as executive officers.\nWe expect to incur significant costs and devote substantial management time to maintaining our disclosure controls and procedures and internal control over financial reporting, and regardless we may be unable to prevent or detect all errors or acts of fraud or to accurately and timely report our financial results or file our periodic reports in a timely manner.\nAs a publicly traded company, our management is required to report annually on the effectiveness of our internal control over financial reporting pursuant to Section 404 of the Sarbanes-Oxley Act, or Section 404. The rules governing the standards that must be met for our management to assess our internal control over financial reporting are complex and require significant documentation, testing and possible remediation.\nWe designed our disclosure controls and procedures to reasonably assure that information we must disclose in reports we file or submit under the Exchange Act is accumulated and communicated to management, and recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC. We believe that any disclosure controls and procedures or internal controls and procedures, no matter how well-conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met.\nThese inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people or by an unauthorized override of the controls.\nBecause of the inherent limitations in our control system, misstatements due to error or fraud may occur and not be detected. We cannot assure you that the measures we have taken will be effective in mitigating or preventing significant deficiencies or material weaknesses in our internal control over financial reporting in the future.\nIf we fail to maintain effective internal control over financial reporting to meet the demands that are placed upon us as a public company, including the requirements of the Sarbanes-Oxley Act, we may be unable to accurately report our financial results, or to report them within the timeframes required by law or exchange regulations.\nAdditionally, we have engaged only a very limited number of accounting and finance personnel and we rely in part on outside consultants. We may need to incur additional expenses to hire additional personnel with public company financial reporting expertise to build our financial management and reporting infrastructure, and further develop and document our accounting policies and financial reporting procedures. In the event we need to hire additional personnel with public company financial reporting expertise but we are unable to do so, we may not be able to accurately report our financial results or file our periodic reports in a timely manner, which may cause investors to lose confidence in our reported financial information and may lead to a decline in our stock price.\nIf we are unable to maintain an effective system of internal control over financial reporting, we may not be able to accurately report our financial results, timely file our periodic reports, maintain our reporting status or prevent fraud.\nUnder standards established by the Public Company Accounting Oversight Board, a material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented, detected or corrected on a timely basis.\nIf material weaknesses or significant deficiencies in our internal control over financial reporting are discovered or occur in the future, then there exists a risk that our consolidated financial statements may contain material misstatements that are unknown to us at that time, and such misstatements could require us to restate our financial results. The existence of a material weakness in our internal control over financial reporting may result in current and potential stockholders losing confidence in our financial reporting, which could negatively impact the market price of our common stock.\nIn addition, the existence of any material weaknesses in our internal control over financial reporting may affect our ability to timely file periodic reports under the Exchange Act and may consequently result in the SEC revoking the registration of our common stock, or the delisting of our common stock. Any of these events, if they were to occur, could have a material adverse effect on the market price of our common stock or on our business, financial condition and results of operations.\nAnti-takeover provisions in our third amended and restated bylaws and Nevada law might discourage, delay or prevent a change of control of our company or changes in our management and, therefore, depress the trading price of our securities.\nOur third amended and restated bylaws contain provisions that could have the effect of rendering more difficult or discouraging an acquisition deemed undesirable by our Board. Our third amended and restated bylaws include provisions:\n● limiting the liability of, and providing indemnification to, our directors, including provisions that require the Company to advance payment for defending pending or threatened claims;\n● controlling the procedures for the conduct and scheduling of board and stockholder meetings; and\n● limiting the number of directors on our board and the filling of vacancies or newly created seats on the board to our Board then in office.\nIn addition, we are subject to anti-takeover laws for Nevada corporations. These anti-takeover laws prevent Nevada corporations from engaging in a business combination with any shareholder, including all affiliates and associates of the shareholder, who is the beneficial owner of 10% or more of the corporations outstanding voting stock, for two years following the date that the shareholder first became the beneficial owner of 10% or more of the corporations voting stock, unless specified conditions are met. If those conditions are not met, then after the expiration of the two-year period the corporation may not engage in a business combination with such shareholder unless certain other conditions are met.\nThese provisions, alone or together, could delay hostile takeovers and changes in control or changes in our management. The existence of the foregoing provisions could limit the price that investors might be willing to pay in the future for shares of our common stock. They could also deter potential acquirers of our company, thereby reducing the likelihood that our stockholders could receive a premium for their common stock in an acquisition.\nWe have never paid dividends on our capital stock and we do not anticipate paying any dividends in the foreseeable future. Consequently, any profits from an investment in our common stock will depend on whether the price of our common stock increases.\nWe have not paid dividends on any of our classes of capital stock to date and we currently intend to retain our future earnings, if any, to fund the development and growth of our business. As a result, capital appreciation, if any, of our common stock will be our stockholders sole source of gain for the foreseeable future.\nClaims for indemnification by our directors and officers may reduce our available funds to satisfy successful third-party claims against us and may reduce the amount of money available to us.\nOur third amended and restated bylaws provide that we will indemnify our directors and officers, in each case to the fullest extent permitted by Nevada law. In addition, our third amended and restated bylaws and our indemnification agreements that we have entered into with our directors and officers provide for the following:\n● We will indemnify our directors and officers for serving us in those capacities or for serving other business enterprises at our request, to the fullest extent permitted by Nevada law. Nevada law provides that a corporation may indemnify such person if such person acted in good faith and in a manner such person reasonably believed to be in or not opposed to the best interests of the registrant and, with respect to any criminal proceeding, had no reasonable cause to believe such persons conduct was unlawful.\n● We will also indemnify employees and agents in those circumstances where indemnification is permitted by applicable law.\n● We are required to advance expenses, as incurred, to any indemnitee in connection with defending a proceeding, except that such indemnitee shall undertake to repay such advances if it is ultimately determined that such person is not entitled to indemnification.\n● The rights conferred in our third amended and restated bylaws are not exclusive, and we are authorized to enter into indemnification agreements with our directors, officers, employees and agents and to obtain insurance to indemnify such persons.\nGeneral Risk Factors\nProduct safety and quality concerns could negatively affect our business.\nOur success depends in part on our ability to maintain consumer confidence in the safety and quality of all of our products. While we are committed to the safety and quality of our products, we may not achieve our product safety and quality standards. Product safety or quality issues, or mislabeling, actual or perceived, or allegations of product contamination or quality or safety issues, even when false or unfounded, could subject us to product liability and consumer claims, negative publicity, a loss of consumer confidence and trust, may require us from time to time to conduct costly recalls from some or all of the channels in which the affected product was distributed, could damage the goodwill associated with our brands, and may cause consumers to choose other products. Such issues could result in the destruction of product inventory and lost sales due to the unavailability of product for a period of time, which could cause our business to suffer and affect our results of operations.\nIf equity research analysts do not publish research or reports about our business or if they issue unfavorable commentary or downgrade our common stock, the price of our common stock could decline.\nThe trading market for our common stock will rely in part on the research and reports that equity research analysts publish about us and our business. We do not control these analysts. The price of our common stock could decline if one or more equity analysts downgrade our common stock or if analysts issue other unfavorable commentary or cease publishing reports about us or our business.\nWe may be subject to securities litigation, which is expensive and could divert management attention.\nThe market price of our common stock has been, and may in the future be, volatile. In the past, companies that have experienced volatility in the market price of their stock have been subject to securities litigation, including but not limited to securities class action litigation. We may be the target of this type of litigation in the future. Securities litigation against us could result in substantial costs and divert our managements attention from other business concerns, which could have a material adverse effect on our business and financial condition.\nIf we are unable to protect our information systems against service interruption or failure, misappropriation of data or breaches of security, our operations could be disrupted, we could be subject to costly government enforcement actions and private litigation and our reputation may be damaged.\nOur businesses involve the collection, storage and transmission of personal, financial or other information that is entrusted to us by our customers and employees. Our information systems also contain the Companys proprietary and other confidential information related to our businesses. Despite the implementation of network security measures, our systems and those of third parties on which we rely may also be susceptible to damage, disruptions or shutdowns due to failures during the process of upgrading or replacing software, databases or components; power outages; telecommunications or system failures; server or cloud provider breaches; computer viruses; physical or electronic break-ins; cyber-attacks; catastrophic events; or breaches due to employee error or malfeasance or other attempts to harm our systems. Cybersecurity threats and incidents can range from uncoordinated individual attempts to gain unauthorized access to information technology networks and systems to more sophisticated and targeted measures, known as advanced persistent threats, directed at the Company, its products, its customers and/or its third-party service providers. Because the techniques used to obtain unauthorized access, disable or degrade service, or sabotage systems change frequently and often are not recognized until launched against a target, we may be unable to anticipate these techniques or to implement adequate preventative measures in time. We could also experience a loss of critical data and delays or interruptions in our ability to manage inventories or process transactions. Some of our commercial partners, such as those that help us deliver our website, may receive or store information provided by us or our users through our websites. If these third parties fail to adopt or adhere to adequate information security practices, or fail to comply with our online policies, or in the event of a breach of their networks, our users data may be improperly accessed, used or disclosed.\nIf our systems are harmed or fail to function properly, we may need to expend significant financial resources to repair or replace systems or to otherwise protect against security breaches or to address problems caused by breaches. If we experience a significant security breach or fail to detect and appropriately respond to a significant security breach, we could be exposed to costly legal or regulatory actions against us in connection with such incidents, which could result in orders or consent decrees forcing us to modify our business practices. Any incidents involving unauthorized access to or improper use of user information, or incidents that are a violation of our online privacy policy, could harm our brand reputation and diminish our competitive position. Any of these events could have a material and adverse effect on our business, reputation or financial results. Our insurance policies carry coverage limits, which may not be adequate to reimburse us for losses caused by security breaches.\nChanges in regulatory standards could adversely affect our business.\nOur business is subject to extensive domestic and international regulatory requirements regarding distribution, production, labeling and marketing. Changes to regulation of the beverage industry could include increased limitations on advertising and promotional activities or other non-tariff measures that could adversely impact our business. In addition, we face government regulations pertaining to the health and safety of our employees and our consumers as well as regulations addressing the impact of our business on the environment, domestically as well as internationally. Compliance with these health, safety and environmental regulations may require us to alter our manufacturing processes and our sourcing. Such actions could adversely impact our results of operations, cash flows and financial condition, and our inability to effectively and timely comply with such regulations could adversely impact our competitive position.\nEmployment litigation and unfavorable publicity could negatively affect our future business.\nEmployees may, from time to time, bring lawsuits against us regarding injury, creation of a hostile work place, discrimination, wage and hour, sexual harassment and other employment issues. In recent years there has been an increase in the number of discrimination and harassment claims generally. Coupled with the expansion of social media platforms and similar devices that allow individuals access to a broad audience, these claims have had a significant negative impact on some businesses. Companies that have faced employment or harassment related lawsuits have had to terminate management or other key personnel and have suffered reputational harm that has negatively impacted their sales. If we were to face any employment related claims, our business could be negatively affected.\nFuture changes in financial accounting standards or practices may cause adverse unexpected financial reporting fluctuations and affect reported results of operations.\nA change in accounting standards or practices can have a significant effect on our reported results and may even affect our reporting of transactions completed before the change is effective. New accounting pronouncements and varying interpretations of accounting pronouncements have occurred and may occur in the future. Changes to existing rules or the questioning of current practices may adversely affect our reported financial results or the way we conduct business.\nCurrently pending, threatened or future litigation or governmental or regulatory proceedings or inquiries could result in material adverse consequences, including judgments or settlements.\nWe are, or may from time to time become, involved in lawsuits and other legal, governmental or regulatory proceedings or inquiries. See Item 3. Legal Proceedings included in this Annual Report for information regarding currently pending litigation that could have a material impact on the Company. Many of these matters raise complicated factual and legal issues and are subject to uncertainties and complexities, all of which make the matters costly to address. The timing of the final resolutions to any such lawsuits, inquiries, and other legal proceedings is uncertain.\nAdditionally, the possible outcomes or resolutions to these matters could include adverse judgments or settlements, either of which could require substantial payments, adversely affecting our consolidated financial condition, results of operations and cash flows. Any judgment against us, the entry into any settlement agreement, or the imposition of any fine could have a material adverse effect on our consolidated financial condition, results of operations and cash flows.\nFuture acquisitions of and investments in new businesses could impact our business and financial condition.\nFrom time to time, we may acquire or invest in businesses or partnerships that we believe could complement our business. The pursuit of such acquisitions or investments may divert the attention of management and cause us to incur various expenses, regardless of whether the acquisition or investment is ultimately completed. In addition, acquisitions and investments may not perform as expected and we may be unable to realize the expected benefits, synergies, or developments that we may initially anticipate. Further, if we are able to successfully identify and acquire additional businesses, we may not be able to successfully integrate the acquired personnel or operations, or effectively manage the combined business following the acquisition, any of which could harm our business and financial condition.\nIn addition, to the extent we finance any acquisition or investment in cash, it would reduce our cash reserves, and to the extent the purchase price is paid with shares of our common stock, it could be dilutive to our current stockholders. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable. ITEM 2. PROPERTIES\nOur principal executive office is located at 1350 East Arapaho Road, Suite #230, Richardson, Texas 75081. We lease the Richardson office on an annual basis, at a cost of $1,510 per month, through November 30, 2023.\nWe currently lease manufacturing facilities in Vista, California and Seoul, Korea to produce our single serve pour over or coffee brew bag coffee products. Our manufacturing and sales office in Vista, California has a total monthly lease expense of approximately $11,000, plus common area expenses, and expires on March 31, 2025. We also sublease property in Vista, California, through January 31, 2023 with a monthly lease expense of $2,111. Our manufacturing and sales office in Seoul, Korea has a monthly lease expense of $7,040, and expires on November 15, 2023.\nWe presently have the annual capacity to produce up to 150 million single serve coffee products (pour over or coffee brew bags) at our two manufacturing facilities, which we believe is sufficient to meet our current and anticipated manufacturing requirements. We have analyzed our current facilities considering our anticipated requirements, and we expect to continue to optimize our manufacturing facilities to meet our future needs. ITEM 3. LEGAL PROCEEDINGS\nAs previously disclosed, on November 23, 2021, Next Vision, Inc. (the Consultant) filed a complaint against the Company in the Superior Court of California, County of San Diego Central Division (Case No. 37-2021-00049557-CU-BC-CTL). The Complaint alleges that the Companys delay in issuing shares of the Companys common stock (the Shares) to the Consultant after receiving due notice from the Consultant of its intent to exercise vested stock options to acquire 70,000 Shares, as initially granted in 2018 (or, as adjusted to account for the Companys reverse stock split effected on November 12, 2019, vested stock options to acquire 23,334 Shares) (the Options), which had previously been issued to the Consultant as compensation for consulting services provided in 2018, breached express and implied contractual obligations to the Consultant and resulted in the Company reporting an overstated amount of income on the IRS Form 1099-B that was issued to the Consultant for U.S. federal tax purposes. In addition, the Complaint alleges that the 23,334 Shares issued to the Consultant upon exercise of the Options improperly contained a six-month restriction on resale and that such restriction prevented the Consultant from selling the Shares at the desired time. The Complaint seeks compensatory damages, including to recover for alleged lost profits due to the alleged improper six-month restriction on resale for the Shares, as well as punitive damages, costs of suit, attorneys fees and interest.\nOn January 20, 2022, the Company filed its general denial and answer in which it raised affirmative defenses and disputed the claims contained in the Complaint. On November 29, 2022, the parties engaged in Court-ordered mediation but did not resolve the matter. The Court has set a trial date for August 11, 2023.\nWe believe the allegations set forth in the Complaint are without merit and intend to defend vigorously against the allegations. However, the Company is not able to predict the outcome, and there is no assurance that the Company will be successful in its defense.\nFrom time to time, we may be subject to other legal proceedings and claims in the ordinary course of business. The results of any future litigation cannot be predicted with certainty, and regardless of the outcome, litigation can have an adverse impact on us because of defense and settlement costs, diversion of management resources, and other factors. ITEM 4. MINE SAFETY DISCLOSURES\nNone.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is listed on the Nasdaq Capital Market under the symbol NUZE. As of December 15, 2022, there were approximately 271 holders of record of our common stock. The actual number of stockholders is greater than this number of record holders, and includes stockholders who are beneficial owners, but whose shares are held in street name by brokers and other nominees.\nDividends\nWe have not paid dividends on any of our classes of capital stock to date and do not anticipate paying any cash dividends on shares of our common stock in the foreseeable future. We currently intend to retain all of our future earnings, if any, to fund the development and growth of our business. Any future determination relating to our dividend policy will be made at the discretion of our Board and will depend on a number of factors, including future earnings, capital requirements, financial conditions, future prospects, contractual restrictions and covenants and other factors that our Board may deem relevant. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion provides information which management believes is relevant to an assessment and understanding of our results of operations and financial condition. The discussion should be read along with our financial statements and notes thereto included elsewhere in this Report. Except for historical information contained herein, the following discussion contains forward-looking statements which are subject to known and unknown risks, uncertainties and other factors that may cause our actual results to differ materially from those expressed or implied by such forward-looking statements. We discuss such risks, uncertainties and other factors throughout this Report and specifically under Item 1A of Part I of this Report, Risk Factors. For additional discussion, see CAUTIONARY NOTE REGARDING FORWARD LOOKING STATEMENTS above.\nCorporate Overview\nOur Company\nWe are a specialty coffee company and, we believe, a leading co-packer of single serve pour over coffee in the United States, as well as a preeminent co-packer of coffee brew bags, which is also referred to as tea-bag style coffee. In addition to our single serve pour over and coffee brew bag coffee products, we have recently expanded our product portfolio to offer a third type of single serve coffee format, DRIPKIT pour over products, as a result of our acquisition of substantially all of the assets of Dripkit, Inc. (Dripkit). Our DRIPKIT pour over format features a large-size single serve pour over pack that sits on top of the cup and delivers in our view a barista-quality coffee experience. Our mission is to leverage our position as a co-packer at the forefront of the North American single serve coffee market to revolutionize the way single serve coffee is enjoyed in the United States. While the United States is our core market, we also have manufacturing and sales operations in Korea and a joint venture in Latin America.\nWe believe we are the only commercial-scale producer within the North American market that has the dual capacity to pack both single serve pour over coffee and coffee brew bag coffee. We intend to leverage our position to become the commercial coffee manufacturer of choice and aim to become the preeminent leader for coffee companies seeking to enter into and grow within the single serve coffee market in North America. We are paid per-package based on the number of single serve coffee products produced by us. Accordingly, we consider our business model to be a form of tolling arrangement, as we receive a fee for almost every single serve coffee product our co-packing customers sell in the North American and Korean markets. While we financially benefit from the success of our co-packing customers through the sales of their respective single serve coffee products, we believe we are also able to avoid the risks associated with owning and managing the product and its related inventory.\nWe have also developed and sell NuZee branded single serve coffee products, including our flagship Coffee Blenders line of both single serve pour over coffee and coffee brew bag coffee products, which we believe offers consumers some of the best coffee available in a single serve application in the world. We offer DRIPKIT pour over packs direct to consumers through our website, wholesale business-to-business to hospitality customers, and co-pack for coffee roasters.\nWe may also consider co-packaging other products that are complementary to our current product offerings and provide us with a deeper access to our customers. In addition, we are continually exploring potential strategic partnerships, co-ventures, and mergers, acquisitions, or other transactions with existing and future business partners to generate additional business, drive growth, reduce manufacturing costs, expand our product portfolio, enter into new markets, and further penetrate the markets in which we currently operate. Our goal is to continue to expand our product portfolio to raise our visibility, consumer awareness and brand profile.\nFor additional details regarding our business, see the discussion under Business in Item 1 of Part I of this Report, which is incorporated by reference into this Part II, Item 7 of this Report.\nOur sources of revenue\nCo-packing\nWe operate as a third-party contract packager for the finished goods of other major companies operating in the coffee beverage industry. Under these arrangements, our co-packing customers typically supply us with roasted, whole bean coffee that we package into single serve pour over and coffee brew bag coffee products according to their formulations and specifications. In addition, under our private label coffee development program, our team works directly with our co-packing customers in developing private labels of signature coffees. Under this program, our team of coffee experts works extensively with our co-packing customers to develop a coffee taste profile to their unique needs and then we source, roast (utilizing our third-party roasting or manufacturing partners), blend, pack (in either our traditional single serve pour over, DRIPKIT pour over or coffee brew bag coffee products), and package single serve coffee products to their exact specifications.\nNuZee and DRIPKIT branded products\nAlthough our primary focus is on the manufacture of single serve coffee products pursuant to co-packing arrangements with our co-packing clients, we have also developed high-quality NuZee branded single serve coffee products that, in addition to our DRIPKIT branded products, are sold directly to consumers. In addition to being available for direct sale to consumers, our NuZee and DRIPKIT branded products serve as samples that are provided to potential new co-packing customers to showcase our co-packing capabilities and production expertise.\nOur NuZee branded products are from our perspective a ‘stepping-stone product for our co-packing customers that market high quality packaging and coffee. Sales of our NuZee branded products, including through Amazon, also help promote consumer adoption into the format and to educate coffee drinkers in the United States about this coffee format that is new to North America but widely known in East Asia.\nIn addition to our NuZee branded products, our premium DRIPKIT pour over format features a large-size single serve pour over pack that sits on top of the cup and delivers in our view a barista-quality coffee experience. We offer DRIPKIT pour over packs direct to consumers through our website, wholesale business-to-business to hospitality customers, and co-pack for coffee roasters.\nNasdaq Listing Deficiency; 2022 Reverse Stock Split\nAs previously reported, we have received a notice from The Nasdaq Stock Market, LLC regarding our failure to satisfy the minimum $1.00 per share requirement for continued inclusion on the Nasdaq Capital Market pursuant to Nasdaq Listing Rule 5550(a)(2) (the Bid Price Rule). As disclosed, we have 180 days from the date of the applicable notice to cure the deficiency. To cure this deficiency, on December 9, 2022, at a Special Meeting of Stockholders, our stockholders approved a proposal granting the Companys board of directors (the Board) discretionary authority to file an amendment (the Certificate of Amendment) to the Companys Articles of Incorporation, as amended (the Articles), which amends the Articles to add a Section 1A to effect a reverse stock split of the Companys common stock, at any ratio from 1-for-10 to 1-for-50 at the Boards discretion (the 2022 Reverse Stock Split). The 2022 Reverse Stock Split would decrease the total number of shares of our common stock outstanding and should, absent other factors, proportionately increase the market price of our common stock, which would be above $1.00 per share. Therefore, the Board believes that the 2022 Reverse Stock Split is an effective means for us to regain compliance with the Bid Price Rule. The Board intends to effect the 2022 Reverse Stock Split as soon as practicable. See Part II, Item 1A, Risk Factors.\nOur common stock may be subject to immediate delisting from the Nasdaq Capital Market if our Common Stock has a closing bid price of $0.10 or less for any ten consecutive trading days.\nDripkit Transaction\nOn February 25, 2022 (the Closing Date), we acquired substantially all of the assets and certain specified liabilities of Dripkit (the Acquisition) pursuant to the Asset Purchase Agreement, dated as of February 21, 2022 (the Asset Purchase Agreement), by and among the Company, Dripkit, and Dripkits existing investors (the Stock Recipients) who executed joinders to the Asset Purchase Agreement as of the Closing Date. Pursuant to the terms of the Asset Purchase Agreement, the aggregate purchase price paid by the Company on the Closing Date was $860,000, consisting of (i) $257,000 in cash paid by the Company to Dripkit, and (ii) the Companys issuance to the Stock Recipients of an aggregate of 178,681 shares of the Companys common stock, plus the assumption of certain assumed liabilities including the Companys repayment of the entire outstanding principal amount of Dripkits Small Business Association Economic Injury Disaster Loan in the amount of $78,656, subject to certain adjustments and holdbacks as provided in the Asset Purchase Agreement. Dripkit operates as a new Dripkit Coffee business division that is wholly owned by NuZee, Inc.\nOn May 2, 2022, pursuant to the terms of the Asset Purchase Agreement, the Bulk Sales Holdback Amount was used to satisfy sales and use taxes owed by Dripkit to the State of New York as of the Closing Date. Pursuant to the terms of the Asset Purchase Agreement, the amounts remaining after offsetting the cost of these sales and use taxes were distributed as follows: (i) $39,237 was distributed to Dripkit on May 9, 2022, in connection with the Cash Bulk Sales Holdback Amount, and (ii) 18,475 shares of common stock were issued to the Stock Recipients on April 25, 2022, in connection with the Stock Bulk Sales Holdback Amount.\nFor additional information regarding the Acquisition and the Asset Purchase Agreement, see Note 6-Business Combinations and the Consolidated Financial Statements.\nGoodwill and Intangible Assets Impairment\nAs further described in Note 2-Basis of Presentation And Summary of Significant Accounting Policies-Goodwill and intangible assets to our Consolidated Financial Statements, we evaluate goodwill for impairment on an annual basis as of the last day of our fiscal fourth quarter, and whenever events or circumstances make it more likely than not that an impairment may have occurred. We test for goodwill impairment at the reporting unit level and consider the Company as a reporting unit for goodwill impairment testing. We determined the Company has one operating segment and two components, NuZee, Inc. and NuZee KR, which are combined into one reporting unit as they are considered to be economically similar. The impairment test involves comparing the fair value of the reporting unit to its carrying value, including goodwill. Fair value reflects the price a market participant would be willing to pay in a potential sale of the reporting unit. If the fair value exceeds the carrying value, we conclude that no goodwill impairment has occurred. If the carrying value of the reporting unit exceeds its fair value, we recognize an impairment loss in an amount equal to the excess, not to exceed the carrying value of the goodwill. Since the Company is one reporting unit, the fair value of the Company equals market capitalization, thus net book value is compared to market capitalization to determine if there is any impairment.\nAs further described in Note 7-Goodwill And Intangible Assets to our Consolidated Financial Statements, during the year ended September 30, 2022, we recorded a non-cash impairment charge of $531,412 related to goodwill, which was included in impairment expense within operating expenses in our Consolidated Statements of Operations for the year ended September 30, 2022. The charge was as a result of our net book value being lower than our market capitalization. As of September 30, 2022, the goodwill balance net of the impairment loss was $0.\nIn addition, as further described in Note 2-Basis of Presentation And Summary of Significant Accounting Policies-Goodwill and intangible assets to our Consolidated Financial Statements, we test intangible assets annually for impairment, and when indications of potential impairment exist. We utilize the relief from royalty method to determine the fair value of the tradename. We estimate the fair value of acquired customer relationships using a weighted average of the income. The income approach applies a fair value methodology based on discounted cash flows. If the carrying value of an intangible asset exceeds the fair value, we recognize an impairment loss in an amount equal to the excess, not to exceed the carrying value.\nAs further described in Note 7-Goodwill And Intangible Assets to our Consolidated Financial Statements, during the fiscal year ended September 30, 2022, we recorded non-cash impairment charges for the Dripkit tradename and acquired customer relationships of $80,555 and $63,167, respectively, which was included in impairment expense within operating expenses in our Consolidated Statements of Operations for the year ended September 30, 2022. The charge was primarily the result of a change in forecast related to estimated future revenue growth for Dripkit, sales channel mix, and estimated costs to support such growth, which had the effect of decreasing our forecast of estimated future cash flows. As of September 30, 2022, the remaining tradename asset balance adjusting for impairment was $140,000, and the customer relationship asset balance was fully written off.\nImpact of COVID-19\nThe ongoing COVID-19 global and national health emergency has caused significant disruption in the international and United States economies and financial markets. In the fiscal years ended September 30, 2022 and September 30, 2021, as a result of COVID-19 and its variants, certain of our customers slowed or delayed purchases of our co-packing services or single serve coffee products, and we also believe that potential sales of our single serve coffee products to new or potential customers in the hospitality industry were adversely impacted. We have also experienced delays in the submission and approval of custom artwork and packaging as well as the shipment to us of coffee for co-packing. In addition, we incurred lost production time due to employee absences. We do not believe, however, that these delays and disruptions had a significant effect on our business or results of operations to date, and in some cases, we have been able to mitigate these adverse effects in part by sourcing coffee and other supplies from alternative suppliers in the United States. COVID-19 may have an adverse impact on our business and financial results going forward that we are not currently able to fully determine or quantify. See Item 1A of Part I of this Report for further discussion of risk factors related to COVID-19.\nGeographic Concentration\nOur operations are primarily split between two geographic areas: North America and Asia.\nFor the fiscal year ended September 30, 2022, net revenues attributable to our operations in North America totaled $2,443,863 compared to $1,441,274 of net revenues attributable to our operations in North America during the fiscal year ended September 30, 2021. Additionally, as of September 30, 2022, $378,546 of our property and equipment, net was attributable to our North American operations, compared to $517,966 attributable to our North American operations as of September 30, 2021.\nIn March 2021, the Company wrote off $840,391 of assets in North America as these assets were deemed to be no longer useful for the Companys current business operations at that time. $93,375 of the impairment was related to the ROU asset and $747,016 was to property and equipment. This write-off is included in impairment expense within operating expenses on our consolidated statement of operations for the year ended September 30, 2021. These assets are co-packing equipment that have limited capabilities compared with other equipment the Company is currently utilizing. Since we have yet to utilize this equipment since it was delivered, we have determined their usefulness to our future operations is limited.\nFor the fiscal year ended September 30, 2022, net revenues attributable to our operations in Asia totaled $665,299 compared to $485,386 of net revenues attributable to our operations in Asia during the fiscal year ended September 30, 2021. Additionally, as of September 30, 2022, $146,529 of our property and equipment, net was attributable to our Asian operations, compared to $156,058 attributable to our Asian operations as of September 30, 2021.\nResults of Operations\nOur results of operations for the fiscal year ended September 30, 2022 includes the operations of Dripkit for the period from February 25, 2022, the date of the Acquisition, to September 30, 2022. The Acquisition of Dripkit did not contribute to the periods prior to its acquisition in our financial statements, which therefore impacts comparisons to 2021 for our results of operations in the discussion that follows.\nComparison of Years ended September 30, 2022 and 2021\nRevenue\nYear ended\nSeptember 30,\nChange\nDollars %\nRevenue $ 3,109,162 $ 1,926,660 $ 1,182,502 61 %\nFor the year ended September 30, 2022, revenues increased by $1,182,502, or approximately 61%, compared with the year ended September 30, 2021. This increase was primarily related to co-packing revenues in North America and Korea driven by existing and new customers. In the third and fourth quarters of fiscal year 2021, we expanded our U.S. sales and support operations, which resulted in increased orders and increased co-packing opportunities in the year ended September 30, 2022.\nCost of sales and gross margin\nYear ended\nSeptember 30,\nChange\nDollars %\nCost of sales $ 3,219,575 $ 2,006,753 $ 1,212,822 60 %\nGross loss $ (110,413 ) $ (80,093 ) $ (30,320 ) (38 %)\nGross margin % (4 )% (4 )%\nFor the year ended September 30, 2022, our cost of sales totaled $3,219,575, as compared to cost of sales for the year ended September 30, 2021 of $2,006,753, representing a 60% increase. This increase is primarily attributable to increased material and labor costs related to the increase in sales. For the year ended September 30, 2022, we had a total gross loss of ($110,413) from sales of our products and co-packing services, compared to a total gross loss of ($80,093) for the year ended September 30, 2021. The gross margin rate was (4%) for each of the years ended September 30, 2022 and September 30, 2021.\nOperating Expenses\nYear ended\nSeptember 30,\nChange\nDollars %\nOperating Expenses $ 11,292,105 $ 18,398,788 $ (7,106,683 ) (39 %)\nFor the year ended September 30, 2022, our operating expenses totaled $11,292,105, compared to $18,398,788 for the year ended September 30, 2021, representing a 39% decrease. This decrease is primarily attributable to a decrease of $7,622,500 in stock-based compensation expense, as we incurred $3,034,093 of stock compensation expense in the year ended September 30, 2022, as compared to $10,656,593 of stock compensation expense in the year ended September 30, 2021, as well as lower professional services costs, offset by an increase in Selling, general and administrative expense associated with greater staffing levels, marketing activities and administrative costs. We also recorded impairment expense of $675,134 in connection with goodwill and intangible assets in the fiscal year ended September 30, 2022, as compared to impairment expense of $840,391 in the fiscal year end September 30, 2021 related to the write-off of certain equipment.\nNet Loss\nYear ended\nSeptember 30,\nChange\nDollars %\nNet Loss $ 11,797,712 $ 18,552,030 $ (6,754,318 ) (36 %)\nFor the year ended September 30, 2022, we generated net losses of $11,797,712 compared to $18,552,030 for the year ended September 30, 2021. This decrease in net loss is primarily attributable to a decrease in stock-based compensation expense, lower professional services costs and a decrease in property and equipment impairment charges, offset by an increase in operating expenses associated with greater staffing levels, marketing activities, and administrative costs. For the year ended September 30, 2022, we also recorded goodwill and intangible assets impairment charges.\nLiquidity and Capital Resources\nSince our inception in 2011, we have incurred significant losses, and as of September 30, 2022, we had an accumulated deficit of approximately $65 million. We have not yet achieved profitability and anticipate that we will continue to incur significant sales and marketing expenses prior to recording sufficient revenue from our operations to offset these expenses. In the United States, we expect to incur additional losses because of the costs associated with operating as an exchange-listed public company. We are unable to predict the extent of any future losses or when we will become profitable, if at all.\nTo date, we have funded our operations primarily with proceeds from registered public offerings and private placements of shares of our common stock. Our principal use of cash is to fund our operations, which includes the commercialization of our single serve coffee products, the continuation of efforts to improve our products, administrative support of our operations and other working capital requirements.\nAs of September 30, 2022, we had a cash balance of $8,315,053. Considering our current cash resources and our current and expected levels of operating expenses for the next twelve months, we expect to need additional capital to fund our planned operations for at least twelve months from December 23, 2022. This evaluation is based on relevant conditions and events that are currently known or reasonably knowable. A reduction in consumer demand for, or revenues from the sale of, our single serve coffee products could further constrain our cash resources. We have based these estimates on assumptions that may prove to be wrong, and our operating projections, including our projected revenues from sales of our single serve coffee products, may change as a result of many factors currently unknown to us.\nOn April 13, 2022, pursuant to Securities Act registration exemptions under Regulation S and/or Section 4(a)(2) of the Securities Act, we sold 884,778 units (the 2022 Units) for aggregate net proceeds of approximately $1.65 million, with each 2022 Unit consisting of (a) one share of our common stock and (b) one warrant (each, a 2022 Warrant and collectively, the 2022 Warrants) to purchase one whole share of our common stock with an initial exercise price of $2.00 per share. Holders may exercise their 2022 Warrants on a cashless basis pursuant to a formula set forth in the form of 2022 Warrant. For additional information regarding the 2022 Warrants, see Note 9- Stock Options and Warrants to the Consolidated Financial Statements.\nOn August 10, 2022, we completed an underwritten public offering (the Offering) of 4,200,000 shares of our common stock, pursuant to an Underwriting Agreement dated as of August 7, 2022 and a prospectus supplement to the Companys effective shelf registration statement on Form S-3 (Registration No. 333-248531). We received aggregate net proceeds of approximately $2.5 million, after deducting underwriting discounts and commissions and Offering expenses payable by us.\nDuring the fiscal year ended September 30, 2022, we issued 384,447 shares of common stock related to exercises of 2021 Warrants (as defined below), including 380,447 shares of common stock issued upon exercise of 380,447 Series A Warrants (as defined below) and 4,000 shares of common stock issued upon exercise of 8,000 Series B Warrants (as defined below). In connection with such exercises, we received aggregate net proceeds of $1,702,596.\nIn the future, we may receive additional funds upon the exercise for cash of outstanding warrants, if and when exercised for cash at the election of the warrant holders, including the Series A warrants (the Series A Warrants) and Series B warrants (the Series B Warrants and, collectively with the Series A Warrants, the 2021 Warrants) that were sold by us in March 2021 in an underwritten registered public offering and the 2022 Warrants. The 2021 Warrant holders are obligated to pay the exercise price in cash upon exercise of the 2021 Warrants unless we fail to maintain a current prospectus relating to the common stock issuable upon the exercise of the 2021 Warrants (in which case, the 2021 Warrants may only be exercised via a cashless exercise provision). For additional information regarding the 2021 Warrants, see Note 9-Stock Options and Warrants to the Consolidated Financial Statements.\nWe intend to seek to raise additional capital, including through public or private equity offerings, to support our operating activities for the next twelve months and beyond, and such funding may not be available to us on acceptable terms, or at all. The timing and amount of funds that we will need to raise will depend on a number of factors, including our ability to generate a sufficient amount of revenues from the sale of our single serve coffee products to fund our business operations and the timing and amount of funds received upon the exercise for cash of outstanding warrants by the warrant holders. Until we can generate a sufficient amount of revenue, we may seek to raise additional funds through equity, equity-linked or debt financings. If we raise additional funds through the incurrence of indebtedness, such indebtedness would have rights that are senior to holders of our equity securities and could contain covenants that restrict our operations. Any additional equity financing may be dilutive to our stockholders.\nWhile we believe our plans to raise additional funds will alleviate the conditions that raise substantial doubt about our ability to continue as a going concern, these plans are not entirely within our control and cannot be assessed as being probable of occurring at this time. If we are unable to raise additional funds when needed, our operations and ability to execute our business strategy could be adversely affected.\nIf we are unsuccessful in our efforts to raise additional capital, based on our current and expected levels of operating expenses, our current capital is not expected to be sufficient to fund our operations for the next twelve months. These conditions raise substantial doubt about our ability to continue as a going concern.\nContractual Obligations\nOur significant contractual cash requirements as of September 30, 2022 primarily include payments for operating and finance lease liabilities and principal and interest on loans. Our current and long-term obligations related to these items are outlined in the leases portion of Note 2-Basis of Presentation and Summary of Significant Accounting Policies, and Note 3-Loans, of the Notes to Consolidated Financial Statements within this Report. Additionally, we may incur purchase obligations in the ordinary course of business that are enforceable and legally binding and enter into enforceable agreements to purchase goods or services that specify all significant terms, including fixed or minimum quantities to be purchased and fixed or estimated prices to be paid at the time of settlement. As of September 30, 2022, we had payments for lease and loan obligations of approximately $722,943, of which $420,790 are payable within 12 months as of September 30, 2022. We had no purchase obligations as of September 30, 2022.\nSummary of Cash Flows\nYear Ended\nSeptember 30,\nCash used in operating activities $ (7,462,121 ) $ (7,107,155 )\nCash used in investing activities $ (604,834 ) $ (115,361 )\nCash provided by financing activities $ 5,679,983 $ 13,632,263\nEffect of foreign exchange on cash $ (113,929 ) $ 7,662\nNet (decrease) increase in cash $ (2,500,901 ) $ 6,417,409\nOperating Activities\nWe used $7,462,121 and $7,107,155 of cash in operating activities during the years ended September 30, 2022 and 2021, respectively, principally to fund our operating loss. The increase in cash used in operating activities of $354,966 was primarily attributable to an overall increase in cash operating expenses, including personnel expense, sales and marketing, and administrative costs, for the year ended September 30, 2022, as compared to the year ended September 30, 2021.\nInvesting Activities\nWe used $604,834 and $115,361 of cash in investing activities during the years ended September 30, 2022 and 2021, respectively. Cash used in the year ended September 30, 2022 was for the Acquisition as well as the purchase of equipment. Cash used in the year ended September 30, 2021 was for the purchase of equipment.\nFinancing Activities\nHistorically, we have funded our operations through the issuance of our equity securities.\nCash provided from financing activities decreased from $13,632,263 for the year ended September 30, 2021, to $5,679,983 for the year ended September 30, 2022. The decrease is primarily attributable to more funds raised in the year ended September 30, 2021 from the sale of our equity securities, as compared to the proceeds received in the year ended September 30, 2022 upon the exercise of outstanding 2021 Warrants by the 2021 Warrant holders, the sale of equity securities from our exempt offering in April 2022, the issuance of shares of our common stock under the Equity Distribution Agreement that, as previously disclosed, we terminated on August 5, 2022, and the August 2022 issuance of equity securities under the registered offering.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that may have a current or future material effect on our financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nCritical Accounting Policies and Estimates\nOur discussion and analysis of our financial condition and results of operations are based upon our financial statements that have been prepared in accordance with generally accepted accounting principles in the United States of America (US GAAP). As discussed in Note 2-Basis of Presentation and Summary of Significant Accounting Policies to the Consolidated Financial Statements, the preparation of financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, and the disclosure of contingent assets and liabilities. US GAAP provides the framework from which to make these estimates, assumption and disclosures. We choose accounting policies within US GAAP that management believes are appropriate to accurately and fairly report our operating results and financial position in a consistent manner. Management regularly assesses these policies in light of current and forecasted economic conditions. See the Note 2-Basis of Presentation and Summary of Significant Accounting Policies to the Consolidated Financial Statements for a summary of our accounting policies. While there are a number of significant accounting policies affecting our financial statements, we believe the following critical accounting policies involve the most complex, difficult and subjective estimates and judgments:\nRevenue Recognition\nWe determine revenue recognition through the following steps in accordance with FASB Accounting Standards Update No. 2014-09 (Topic 606) Revenue from Contracts with Customers, which we adopted as of October 1, 2018 on a modified retrospective basis:\n● identification of the contract, or contracts, with a customer;\n● identification of the performance obligations in the contract;\n● determination of the transaction price;\n● allocation of the transaction price to the performance obligations in the contract; and\n● recognition of revenue when, or as, we satisfy a performance obligation.\nRevenue is recognized when control of the promised goods or services are transferred to our customers, in an amount that reflects the consideration we expect to be entitled to in exchange for those goods or services.\nCost of Sales\nThe Company records the cost of the materials used in creating the good as well as direct labor cost used to produce the good. The Company also includes write-offs for all past due and unsellable inventories as well as loss on inventory due to obsolescence in cost of sales.\nInventories\nInventories are stated at the lower of cost or net realizable value. Cost is being measured using the weighted average cost method. We regularly review whether the realizable value of our inventory is lower than its book value. If our valuation shows that the realizable value is lower than book value, we take a charge to expense and directly reduce the value of the inventory.\nThe Company estimates its reserves for inventory obsolescence by examining its inventories on a quarterly basis to determine if there are indicators that the carrying values exceed net realizable value. Indicators that could result in additional inventory write downs include age of inventory, damaged inventory, slow moving products and products at the end of their life cycles. While management believes that the reserve for obsolete inventory is adequate, significant judgment is involved in determining the adequacy of this reserve.\nStock-based Compensation\nWe account for share-based awards issued to employees in accordance with Accounting Standards Codification (ASC) 718, Compensation-Stock Compensation. Accordingly, employee share-based payment compensation is measured at the grant date, based on the fair value of the award, and is recognized as an expense over the requisite service period, which is normally the vesting period. Share-based compensation to directors is treated in the same manner as share-based compensation to employees, regardless of whether the directors are also employees. In June 2018, the FASB issued ASU 2018-07 which simplifies several aspects of the accounting for non-employee transactions by stipulating that the existing accounting guidance for share-based payments to employees (accounted for under ASC Topic 718, Compensation-Stock Compensation) will also apply to non-employee share-based transactions (accounted for under ASC Topic 505, Equity). The Company implemented ASU 2018-07 on October 1, 2019 and the impact of the implementation is not material to the financial statements. We determine the fair value of share-based payments using the Black Scholes option-pricing model for common stock options and warrants and the closing price of our common stock for common share issuances. We recognized forfeitures as they occurred.\nBusiness Combinations\nOn February 25, 2022, we completed the Acquisition. Accounting for business combinations requires us to make significant estimates and assumptions, especially at the acquisition date with respect to tangible and intangible assets acquired. We use our best estimates and assumptions to accurately assign fair value to the tangible and intangible assets acquired at the acquisition date as well as the useful lives of those acquired intangible assets. Examples of critical estimates in valuing certain of the intangible assets and goodwill acquired include but are not limited to future (i) expected cash flows from acquired customer relationships and trademarks, (ii) attrition, (iii) revenues, (iv) royalty rate, (v) operating profit and (vi) discount rate.\nRecent Accounting Pronouncements\nRecent accounting pronouncements which may be applicable to us are described in Note 2-Basis of Presentation and Summary of Significant Accounting Policies to the Consolidated Financial Statements included as part of this Report. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nOur Consolidated Financial Statements and The Report of Independent Registered Public Accounting Firm required by this item are included in this Report on pages through and are incorporated herein by reference. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nThere have been no disagreements with our Independent Registered Public Accounting Firm on any matter of accounting principles or financial disclosures. ITEM 9A. CONTROLS AND PROCEDURES\na. Evaluation on Disclosure Controls and Procedures\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed by our Company is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC, and that such information is collected and communicated to management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. Our Chief Executive Officer and Chief Financial Officer are responsible for establishing and maintaining disclosure controls and procedures for our Company. In designing and evaluating our disclosure controls and procedures, management recognizes that no matter how well conceived and operated, disclosure controls and procedures can provide only reasonable, not absolute, assurance that the objectives of the disclosure controls and procedures are met.\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, carried out an evaluation of the effectiveness of our disclosure controls and procedures (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)) as of the end of the period covered by this Report (the Evaluation Date). Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of the Evaluation Date, our disclosure controls and procedures are effective, at the reasonable assurance level, to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act (i) is recorded, processed, summarized and reported, within the time periods specified in the SEC rules and forms and (ii) is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nb. Managements report on internal control over financial reporting\nOur management, including our Chief Executive Officer and Chief Financial Officer, is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Exchange Act Rules 13a-15(f) and 15d-15(f). Our internal control system was designed to provide reasonable assurance to our management and board of directors regarding the preparation and fair presentation of published financial statements. Our management assessed the effectiveness of the Companys internal control over financial reporting as of the end of the period covered by this Report based on the criteria for effective internal control described in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organization of the Treadway Commission (COSO). Based on this assessment, our management has concluded the Companys internal control over financial reporting was effective as of September 30, 2022.\nAs we are a non-accelerated filer, our independent registered public accounting firm is not required to issue an attestation report on our internal control over financial reporting.\nChanges In Internal Control Over Financial Reporting\nDuring the quarter ended September 30, 2022, we completed the integration of Dripkit into our overall internal control over financial reporting program. There were no other changes in our internal control over financial reporting that occurred during the quarter ended September 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nThe information required by this Item is incorporated herein by reference to the definitive Proxy Statement to be filed pursuant to Regulation 14A of the Exchange Act for our 2023 Annual Meeting of Stockholders. Within 120 days after the close of our fiscal year, we intend to file with the SEC the information required by this Item. ITEM 11. EXECUTIVE COMPENSATION.\nThe information required by this Item is incorporated herein by reference to the definitive Proxy Statement to be filed pursuant to Regulation 14A of the Exchange Act for our 2023 Annual Meeting of Stockholders. Within 120 days after the close of our fiscal year, we intend to file with the SEC the information required by this Item. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe information required by this Item is incorporated herein by reference to the definitive Proxy Statement to be filed pursuant to Regulation 14A of the Exchange Act for our 2023 Annual Meeting of Stockholders. Within 120 days after the close of our fiscal year, we intend to file with the SEC the information required by this Item. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated herein by reference to the definitive Proxy Statement to be filed pursuant to Regulation 14A of the Exchange Act for our 2023 Annual Meeting of Stockholders. Within 120 days after the close of our fiscal year, we intend to file with the SEC the information required by this Item. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this Item is incorporated herein by reference to the definitive Proxy Statement to be filed pursuant to Regulation 14A of the Exchange Act for our 2023 Annual Meeting of Stockholders. Within 120 days after the close of our fiscal year, we intend to file with the SEC the information required by this Item.\nPART IV ITEM 15. EXHIBIT AND FINANCIAL STATEMENT SCHEDULES\n(a) The following documents are filed as part of this Report:\n(1) The following consolidated financial statements of the Company are incorporated by reference in Part II, Item 8 - See Index to Consolidated Financial Statements\n(2) All financial statement schedules have been omitted because they are not applicable or not required or because the information is included elsewhere in the financial statements or the Notes thereto.\n(3) See exhibits listed under Part (b) below.\n(b) Exhibits:\nExhibit No.\nDescription\n2.1+\nAsset Purchase Agreement, dated as of February 21, 2022, by and among the Company, Dripkit, Inc., and Dripkits existing investors party thereto (incorporated by reference to Exhibit 2.1 to the Companys Current Report on Form 8-K filed on February 22, 2022, SEC File Number 001-39338).\n3.1*\nArticles of Incorporation of the Company, dated July 15, 2011.\n3.2\nCertificate of Amendment to Articles of Incorporation of the Company, dated May 6, 2013 (incorporated by reference to Exhibit 3.01(b) to the Companys Current Report on Form 8-K filed on April 25, 2013, SEC File Number 333-176684).\n3.3\nCertificate of Amendment to Articles of Incorporation of the Company, dated October 28, 2019 (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on October 28, 2019, SEC File Number 000-55157).\n3.4\nThird Amended and Restated Bylaws of the Company, effective March 17, 2022 (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on March 23, 2022, SEC File Number 001-39338).\n4.1*\nDescription of Securities.\n4.2\nForm of Underwriters Warrant (incorporated by reference to Exhibit 4.1 to the Companys Registration Statement on Form S-1/A filed on May 14, 2020, SEC File Number 333-234643).\n4.3\nSeries A Warrant Agent Agreement (including the terms of the Series A Warrant) (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on March 23, 2021, SEC File Number 001-39338).\n4.4\nSeries B Warrant Agent Agreement (including the terms of the Series B Warrant) (incorporated by reference to Exhibit 4.2 to the Companys Current Report on Form 8-K filed on March 23, 2021, SEC File Number 001-39338).\n4.5\nForm of Common Stock Purchase Warrant (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed on April 15, 2022, SEC File Number 001-39338).\n10.1\nExecutive Employment Agreement dated August 17, 2019, by and between NuZee, Inc. and Masateru Higashida (incorporated by reference to Exhibit 10.1 to the Companys Registration Statement on Form S-1 filed on November 12, 2019, SEC File Number 333-234643).\n10.2\nEmployment Agreement dated February 1, 2016, by and between NuZee, Inc. and Travis Gorney (incorporated by reference to Exhibit 10.2 to the Companys Registration Statement on Form S-1 filed on November 12, 2019, SEC File Number 333-234643).\n10.3\nNuZee, Inc. 2013 Stock Incentive Plan (incorporated by reference to Exhibit 10.4 to the Companys Registration Statement on Form S-1 filed on November 12, 2019, SEC File Number 333-234643).\n10.4\nNuZee, Inc. 2019 Stock Incentive Plan (incorporated by reference to Exhibit 10.5 to the Companys Registration Statement on Form S-1 filed on November 12, 2019, SEC File Number 333-234643).\n10.5\nMulti-Tenant Industrial Triple Net Lease, dated May 9, 2019 by and between Nuzee, Inc. and Icon Owner Pool I Texas LLC (incorporated by reference to Exhibit 10.6 to the Companys Registration Statement on Form S-1/A filed on March 10, 2020, SEC File Number 333-234643).\n10.6\nJoint Venture Agreement with respect to NuZee Latin America, S.A. de C.V., dated January 9, 2020, by and between Industrias Marino, S.A. de C.V., and NuZee, Inc. (incorporated by reference to Exhibit 10.7 to the Companys Registration Statement on Form S-1/A filed on March 10, 2020, SEC File Number 333-234643).\n10.7\nForm of Stock Option Agreement (2013 Stock Incentive Plan) (incorporated by reference to Exhibit 10.10 to the Companys Annual Report on Form 10-K filed on December 28, 2020, SEC File Number 001-39338).\n10.8\nForm of Stock Option Agreement (2019 Stock Incentive Plan) (incorporated by reference to Exhibit 10.11 to the Companys Annual Report on Form 10-K filed on December 28, 2020, SEC File Number 001-39338).\n10.9\nForm of Restricted Stock Award Agreement under the NuZee, Inc. 2019 Stock Incentive Plan (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on January 15, 2021, SEC File Number 001-39338).\n10.10\nForm of Indemnification Agreement (incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q filed on May 17, 2021, SEC File Number 001-39338).\n10.11\nEmployment Agreement, dated July 2, 2021, by and between NuZee, Inc. and Patrick Shearer (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on July 7, 2021, SEC File Number 001-39338).\n10.12\nForm of Stock Option Agreement under the NuZee, Inc. 2019 Stock Incentive Plan (Performance-Based) (incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed on July 7, 2021, SEC File Number 001-39338).\n10.13\nEmployment Agreement, dated May 7, 2021 by and between NuZee, Inc. and Jose Ramirez (incorporated by reference to Exhibit 10.15 to the Companys Annual Report on Form 10-K filed December 22, 2021, SEC File Number 001-39338).\n10.14\nForm of Stock Option Agreement under NuZee, Inc. 2013 Stock Incentive Plan (Time-Based) (incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q filed on February 11, 2022, SEC File Number 001-39338).\n10.15\nForm of Stock Option Agreement under NuZee, Inc. 2013 Stock Incentive Plan (Performance-Based) (incorporated by reference to Exhibit 10.3 to the Companys Quarterly Report on Form 10-Q filed on February 11, 2022, SEC File Number 001-39338).\n10.16\nForm of Restricted Stock Award Agreement under the NuZee, Inc. 2013 Stock Incentive Plan (incorporated by reference to Exhibit 10.4 to the Companys Quarterly Report on Form 10-Q filed on February 11, 2022, SEC File Number 001-39338).\n10.17\nDescription of Registrants Non-Employee Director Compensation Policy (incorporated by reference to Exhibit 10.1 to the Companys Annual Report on Form 10-Q filed on May 12, 2022, SEC File Number 001-39338).\n10.18*\nEmployment Agreement, dated April 14, 2021 by and between NuZee, Inc. and Tomoko Toyota.\n10.19\nSecond Amended and Restated Employment Agreement, dated as of November 4, 2022, by and between NuZee, Inc. and Shana Bowman (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on November 4, 2022, SEC File Number 001-39338).\n10.20*\nSeparation and Release of Claims Agreement, dated September 21, 2022, by and between NuZee, Inc. and Tomoko Toyota.\n21.1*\nSubsidiaries of NuZee, Inc.\n23.1*\nConsent of MaloneBailey, LLP, independent registered public accounting firm\n31.1*\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2*\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1*\nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2*\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the inline XBRL document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101)\n* Filed or furnished herewith.\nIndicates management contract or compensatory plan.\n+ Certain schedules to this agreement have been omitted pursuant to Item 601 of Regulation S-K. A copy of any omitted schedule will be furnished supplementally to the Securities and Exchange Commission upon request.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on December 23, 2022.\nNuZee, Inc.\nBy: /s/ Masateru Higashida\nName: Masateru Higashida\nTitle: Chief Executive Officer and President\n(Principal Executive Officer), Secretary, Treasurer, and Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Masateru Higashida\nDecember 23, 2022\nMasateru Higashida\nChief Executive Officer and President (Principal Executive Officer), Secretary, Treasurer, and Director\n/s/ Patrick Shearer\nDecember 23, 2022\nPatrick Shearer\nChief Financial Officer (Principal Financial Officer and Principal Accounting Officer)\n/s/ Kevin J. Conner\nDecember 23, 2022\nKevin J. Conner\nDirector\n/s/ Tracy Ging\nDecember 23, 2022\nTracy Ging\nDirector\n/s/ J. Chris Jones\nDecember 23, 2022\nJ. Chris Jones\nDirector\n/s/ Nobuki Kurita\nDecember 23, 2022\nNobuki Kurita\nDirector\n/s/ David G. Robson\nDecember 23, 2022\nDavid G. Robson\nDirector\nNUZEE, INC.\nIndex to Consolidated Financial Statements\nContents\nPage\nConsolidated Financial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 206)\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Comprehensive Income (Loss)\nConsolidated Statements of Changes in Stockholders Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors of\nNuZee, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of NuZee, Inc. and its subsidiaries (collectively, the Company) as of September 30, 2022 and 2021, and the related consolidated statements of operations, comprehensive income (loss), stockholders equity, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of their operations and their cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses and negative cash flows from operations that raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of Intangible Assets ~ Business Combinations\nAs described in Note 6 to the consolidated financial statements, on February 25, 2022, the Company acquired substantially all the assets and certain specified liabilities of Dripkit, Inc. (Dripkit), for net consideration of $876,176. The Company accounted for the acquisition in accordance with ASC Topic 805, Business Combinations, which required the Company to exercise judgment and make estimates and assumptions based on available information regarding the fair values of the elements of a business combination as of the date of acquisition, including the fair values of identifiable intangible assets. Estimates and assumptions that the Company makes in estimating the fair value of identifiable intangible assets include future cash flows that they expect to generate from the acquired assets. The Company recognized $330,000 of finite-lived intangible assets.\nWe identified the determination of fair values of identifiable finite-lived intangible assets, which included trade names and customer relationships, as a critical audit matter. The principal considerations for our determination included the following: (i) changes in the key assumptions could have a significant impact on the fair value of the finite-lived intangible assets acquired, (ii) subjectivity and judgment is required to determine significant unobservable inputs and assumptions utilized by the Company in determining the fair value of the trade names and customer relationships acquired, specifically projected revenue growth rates. Auditing these elements involved especially challenging and subjective auditor judgment due to the nature and extent of audit effort required to address these matters, including the extent of specialized skill or knowledge needed.\nThe primary procedures we performed to address this critical audit matter included:\na. We assessed the reasonableness of projected revenue growth rates by: (i) evaluating historical performance of Dripkit, (ii) utilizing personnel with specialized valuation knowledge and skill.\n/s/ MaloneBailey, LLP\nwww.malonebailey.com\nWe have served as the Companys auditor since 2013.\nHouston, Texas\nDecember 23, 2022\nNuZee, Inc.\nCONSOLIDATED BALANCE SHEETS\nSeptember 30, 2022 September 30, 2021\nASSETS\nCurrent assets:\nCash $ 8,315,053 $ 10,815,954\nAccounts receivable, net 345,258 555,238\nInventories, net 947,995 573,464\nPrepaid expenses and other current assets 547,773 482,288\nTotal current assets 10,156,079 12,426,944\nProperty and equipment, net 525,075 674,024\nOther assets:\nRight-of-use asset - operating lease 642,624 386,587\nInvestment in unconsolidated affiliate 169,634 175,425\nIntangible assets, net 140,000 -\nOther assets 77,962 79,822\nTotal other assets 1,030,220 641,834\nTotal assets $ 11,711,374 $ 13,742,802\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable $ 113,708 $ 342,790\nCurrent portion of long-term loan payable 7,947 43,618\nCurrent portion of lease liability - operating lease 388,325 150,931\nCurrent portion of lease liability - finance lease 24,518 27,833\nAccrued expenses 706,492 274,009\nDeferred income 319,707 175,822\nOther current liabilities 39,241 138,631\nTotal current liabilities 1,599,938 1,153,634\nNon-current liabilities:\nLease liability - operating lease, net of current portion 267,786 247,656\nLease liability - finance lease, net of current portion 29,622 50,567\nLoan payable - long term, net of current portion 4,745 12,696\nOther noncurrent liabilities 66,484 65,802\nTotal non-current liabilities 368,637 376,721\nTotal liabilities $ 1,968,575 $ 1,530,355\nStockholders equity:\nCommon stock; 200,000,000 shares authorized, $0.00001 par value; 23,668,017 and 17,820,390 shares issued and outstanding as of September 30, 2022 and 2021, respectively $ 236 $ 178\nAdditional paid in capital 74,281,189 64,839,254\nAccumulated deficit (64,622,520 ) (52,824,808 )\nAccumulated other comprehensive income 83,894 197,823\nTotal stockholders equity 9,742,799 12,212,447\nTotal liabilities and stockholders equity $ 11,711,374 $ 13,742,802\nThe accompanying notes are an integral part of these consolidated financial statements.\nNuZee, Inc.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear Ended\nSeptember 30, 2022\nYear Ended\nSeptember 30, 2021\nRevenues, net $ 3,109,162 $ 1,926,660\nCost of sales 3,219,575 2,006,753\nGross loss (110,413 ) (80,093 )\nSelling, general and administrative expense 10,616,971 17,080,792\nImpairment expense 675,134 840,391\nOperating expenses 11,292,105 17,921,183\nLoss from operations (11,402,518 ) (18,001,276 )\nOther income 191,631 144,452\nLoss from equity method investment (5,791 ) (7,889 )\nOther expense (574,710 ) (672,929 )\nInterest expense, net (6,324 ) (14,388 )\nNet loss $ (11,797,712 ) $ (18,552,030 )\nBasic and diluted loss per common share $ (0.61 ) $ (1.13 )\nBasic and diluted weighted average number of common stock outstanding 19,366,276 16,413,162\nThe accompanying notes are an integral part of these consolidated financial statements.\nNuZee, Inc.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\nNuZee, Inc.\nFor the years ended September 30, 2022 and 2021\nNet loss $ (11,797,712 ) $ (18,552,030 )\nForeign currency translation (113,929 ) 7,662\nTotal other comprehensive income (loss), net of tax (113,929 ) 7,662\nComprehensive loss $ (11,911,641 ) $ (18,544,368 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nNuZee, Inc.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nCommon stock Additional paid-in Accumulated Accumulated\nOther\nComprehensive\nShares Amount capital deficit income Total\nBalance September 30, 2021 17,820,390 $ 178 $ 64,839,254 $ (52,824,808 ) $ 197,823 $ 12,212,447\nExercise of warrants, net of issuance costs 384,447 1,702,592 -\n1,702,596\nCommon stock issued for cash, ATM offering, net of issuance costs 49,326 - 95,256 -\n95,256\nEquity securities issued for cash, exempt offering, net of issuance costs 884,778 1,649,727 - - 1,649,736\nCommon stock issued for cash, registered offering, net of issuance costs 4,200,000 2,520,826 - - 2,520,868\nCommon stock issued for Dripkit acquisition 197,156 426,842 - - 426,844\nStock option expense - - 2,899,338 - - 2,899,338\nExercise of stock options 14,000 - 12,600 - - 12,600\nRestricted stock award issuance 117,920 134,754 - - 134,755\nOther comprehensive loss - - - - (113,929 ) (113,929 )\nNet loss - - - (11,797,712 ) - (11,797,712 )\nBalance September 30, 2022 23,668,017 74,281,189 (64,622,520 ) 83,894 9,742,799\nCommon stock Additional\npaid-in Accumulated Accumulated\nOther\nComprehensive\nShares Amount capital deficit income Total\nBalance September 30, 2020 14,570,105 $ 146 $ 40,472,229 $ (34,272,778 ) $ 190,161 $ 6,389,758\nEquity securities issued for cash 3,107,070 13,701,253 - - 13,701,284\nCommon stock issued for compensation 137,215 1,251,401 - - 1,251,402\nStock option expense - - 9,405,191 - - 9,405,191\nExercise of stock options 6,000 - 9,180 - - 9,180\nOther comprehensive gain - - - - 7,662 7,662\nOther comprehensive gain (loss) - - - - 7,662 7,662\nNet loss - - - (18,552,030 ) - (18,552,030 )\nBalance September 30, 2021 17,820,390 $ 178 $ 64,839,254 $ (52,824,808 ) $ 197,823 $ 12,212,447\nThe accompanying notes are an integral part of these consolidated financial statements.\nNuZee, Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Year Ended\nSeptember 30, 2022 For the Year Ended\nSeptember 30, 2021\nOperating activities:\nNet loss $ (11,797,712 ) $ (18,552,030 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation and amortization 379,474 344,669\nNoncash lease expense 302,334 278,060\nLoss on disposition of assets 12,618 -\nStock option expense 2,899,338 9,405,191\nRestricted stock award compensation 134,755 -\nCommon stock issued for compensation - 1,251,402\nBad debt expense 34,351 -\nLoss from equity method investment 5,791 7,889\nGoodwill and intangible asset impairment 675,134 -\nProperty and equipment impairment - 840,391\nWrite-off of deferred financing costs 368,783 477,605\nChange in operating assets and liabilities:\nAccounts receivable 175,629 (359,628 )\nInventories (364,867 ) (328,094 )\nPrepaid expenses and other current assets (65,485 ) (283,655 )\nOther assets 1,860\nAccounts payable (229,845 ) 293,012\nDeferred income 143,885 141,822\nLease liability - operating lease (300,847 ) (260,804 )\nAccrued expenses and other current liabilities 162,001 (407,817 )\nOther non-current liabilities 44,095\nNet cash used in operating activities (7,462,121 ) (7,107,155 )\nInvesting activities:\nPurchase of equipment (191,765 ) (115,361 )\nAcquisition of Dripkit (413,069 ) -\nNet cash used in investing activities (604,834 ) (115,361 )\nFinancing activities:\nProceeds from issuance of equity securities, net of issuance costs - 13,701,284\nRepayment of loans (43,622 ) (56,603 )\nProceeds from issuance of common stock, ATM offering, net of issuance costs 95,256 -\nProceeds from issuance of common stock, exercise of warrants, net of issuance costs 1,702,596 -\nProceeds from issuance of equity securities, exempt offering, net of issuance costs 1,649,736 -\nProceeds from issuance of common stock, registered offering, net of issuance costs 2,656,460 -\nRepayment of finance lease (24,260 ) (21,598 )\nCash paid for offering costs (368,783 ) -\nProceeds from issuance of common stock, exercise of stock options 12,600 9,180\nNet cash provided by financing activities 5,679,983 13,632,263\nEffect of foreign exchange on cash (113,929 ) 7,662\nNet change in cash (2,500,901 ) 6,417,409\nCash, beginning of period 10,815,954 4,398,545\nCash, end of period $ 8,315,053 $ 10,815,954\nSupplemental disclosure of cash flow information:\nCash paid for interest $ 9,811 $ 2,871\nCash paid for taxes $ 800 $ 800\nNoncash investing and financing activities:\nCommon stock issued in acquisition of Dripkit $ 426,844 $ -\nStock issuance costs accrued $ 135,592 $ -\nROU assets and liabilities added during the period $ 558,371 $ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nNuZee, Inc.\nNotes to Consolidated Financial Statements\nSeptember 30, 2022\n1. ORGANIZATION\nNuZee, Inc. (the Company, we, our, us) was incorporated on November 9, 2011, in Nevada. The Company is a specialty coffee company and is a leading co-packer of single serve pour over coffee in the United States, as well as a preeminent co-packer of coffee brew bags, which is also referred to as tea-bag style coffee. The Company is a commercial-scale producer that has the dual capability to pack both single serve pour over coffee and coffee brew bags within the North American market including a third type of single serve coffee format, DRIPKIT pour over products, as a result of our acquisition of substantially all of the assets of Dripkit, Inc. (Dripkit). While the United States is the Companys core market, it also has single serve pour over coffee manufacturing and sales operations in Korea and a joint venture in Latin America. The Company has also developed and sells NuZee branded single serve coffee products, including its flagship Coffee Blenders line of both single serve pour over coffee and coffee brew bags.\nThe Company has two wholly owned international subsidiaries in NuZee KOREA Ltd. (NuZee KR) and NuZee Investment Co., Ltd. (NuZee INV).\n2. BASIS OF PRESENTATION AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThe summary of significant accounting policies presented below is designed to assist in understanding the Companys financial statements. Such financial statements and accompanying notes are the representations of the Companys management, who are responsible for their integrity and objectivity. These accounting policies conform to accounting principles generally accepted in the United States of America (GAAP) in all material respects and have been consistently applied in preparing the accompanying financial statements.\nCertain amounts in the prior period financial statements have been reclassified to conform to the presentation of the current period financial statements. The Company reclassified a write off of deferred financing costs related to the termination of an ATM sales agreement, and lease expenses associated with subleased property from Operating expenses to Other expenses totaling, $477,605 and $160,489, respectively, for the year ended September 30, 2021. The Company also reclassified $18,000 of capitalized software costs included in Property and Equipment, net at September 30, 2021 to Prepaid expenses and other current assets. These reclassifications had no effect on the previously reported net loss.\nPrinciples of Consolidation\nThe Company prepares its financial statements on the accrual basis of accounting. The accompanying consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries. All significant intercompany accounts, balances and transactions have been eliminated upon consolidation.\nThe Company consolidates NuZee KR and NuZee INV in accordance with ASC 810, and specifically ASC 810-10-15-8 which states, the usual condition for a controlling financial interest is ownership of a majority voting interest, and, therefore, as a general rule ownership by one reporting entity, directly or indirectly, of over 50% of the outstanding voting shares of another entity is a condition pointing toward consolidation.\nOn February 25, 2022 (the Closing Date), the Company acquired substantially all the assets and certain specified liabilities (the Acquisition) of Dripkit, Inc., a Delaware corporation (Dripkit), pursuant to the Asset Purchase Agreement, dated as of February 21, 2022 (the Asset Purchase Agreement), by and among the Company, Dripkit, and Dripkits existing investors (the Stock Recipients) who executed joinders to the Asset Purchase Agreement as of the Closing Date. Pursuant to the terms of the Asset Purchase Agreement, the aggregate purchase price paid by the Company for the Acquisition was $860,000, consisting of cash paid by the Company to Dripkit and the Companys issuance to the Stock Recipients of an aggregate of 197,156 shares of the Companys common stock (including the 18,475 shares of common stock issued to the Stock Recipients on April 25, 2022, in connection with the stock bulk sales holdback amount, as further described below), plus the assumption of certain assumed liabilities, subject to certain adjustments and holdbacks as provided in the Asset Purchase Agreement. Dripkit is engaged in the business of manufacturing and sales of a single serve pour over coffee format that has a large-size single serve pour over pack that sits on top of the cup. Dripkit operates as a new Dripkit Coffee business division that is wholly owned by NuZee, Inc. The Company analyzed the Acquisition under ASC 805 and concluded that it should be accounted for as a business combination. The Acquisition has been included in the Companys financial statements from the date of the Acquisition.\nEarnings per Share\nBasic earnings per common share is equal to net earnings or loss divided by the weighted average of shares outstanding during the reporting period. Diluted earnings per share reflects the potential dilution that could occur if stock options, warrants and other commitments to issue common stock were exercised or equity awards vest resulting in the issuance of common stock that could share in the earnings of the Company. As of September 30, 2022 and September 30, 2021, the total number of common stock equivalents was 9,307,921 and 9,343,606, respectively, and composed of stock options and warrants. The Company incurred a net loss for the years ended September 30, 2022 and 2021, respectively and therefore, basic and diluted earnings per share for those periods are the same because all potential common equivalent shares would be antidilutive.\nGoing Concern and Capital Resources\nSince its inception, the Company has devoted substantially all of its efforts to business planning, research and development, recruiting management and technical staff, acquiring operating assets, raising capital and the commercialization and manufacture of its single serve coffee products. The Company has grown revenues from its principal operations; however, there is no assurance of future revenue growth similar to historical levels. As of September 30, 2022, the Company had cash of $8,315,053 and working capital of $8,556,141. However, the Company has not attained profitable operations since inception. The accompanying consolidated financial statements have been prepared in accordance with GAAP, which contemplates continuation of the Company as a going concern. The Company has had limited revenues, recurring losses and an accumulated deficit. These items raise substantial doubt as to the Companys ability to continue as a going concern. The accompanying consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty. The Companys continued existence is dependent upon managements ability to develop profitable operations and to raise additional capital for the further development and marketing of the Companys products and business.\nUse of Estimates\nIn preparing these consolidated financial statements, management is required to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities as of the date of the financial statements and the reported amount of revenues and expenses during the reporting periods. Actual results could differ from those estimates.\nFair Value of Financial Instruments\nFair value is an estimate of the exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants (i.e., the exit price at the measurement date). Fair value measurements are not adjusted for transaction cost. Fair value measurement under generally accepted accounting principles provides for use of a fair value hierarchy that prioritizes inputs to valuation techniques used to measure fair value into three levels:\nLevel 1: Unadjusted quoted prices in active markets for identical assets or liabilities.\nLevel 2: Inputs other than quoted market prices that are observable, either directly or indirectly, and reasonably available. Observable inputs reflect the assumptions market participants would use in pricing the asset or liability and are developed based on market data obtained from sources independent of the Company.\nLevel 3: Unobservable inputs reflect the assumptions that the Company develops based on available information about what market participants would use in valuing the asset or liability.\nThe Company does not have any assets or liabilities that are required to be measured and recorded at fair value on a recurring basis.\nThe carrying amounts of cash, accounts receivable, accounts payable, accrued liabilities and short-term debt approximate fair value because of the short-term nature of these instruments. The carrying amount of long-term debt approximates fair value because the debt is based on current rates at which the Company could borrow funds with similar remaining maturities. Fair value estimates are made at a specific point in time, based on relevant market information about the financial instruments when available. These estimates are subjective in nature and involve uncertainties and matters of significant judgment and therefore, cannot be determined with precision. Changes in assumptions could significantly affect the estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with original maturities of three months or less when purchased to be cash equivalents. The Company had no cash equivalents as of September 30, 2022 and 2021.\nConcentration of Credit Risk\nFinancial instruments that potentially subject the Company to concentrations of credit risk consist principally of cash and cash equivalents. The Company places its cash with high quality banking institutions. From time to time, the Company may or may not maintain cash balances at certain institutions in excess of the Federal Deposit Insurance Corporation limit.\nAccounts Receivable\nTrade accounts receivable are periodically evaluated for collectability based on past credit history with customers and their current financial condition. Bad debts expense or write offs of receivables are determined on the basis of loss experience, known and inherent risks in the receivable portfolio and current economic conditions. The Company had $6,862 of allowance for doubtful accounts as of September 30, 2022 and no allowance for doubtful accounts as of September 30, 2021.\nMajor Customers\nFor the years ended September 30, 2022 and 2021, the Companys largest single source of revenue was from one major customer disclosed below.\nSCHEDULE OF REVENUE BY MAJOR CUSTOMERS\nFor the year ended September 30, 2022:\nCustomer Name Sales Amount % of Total\nRevenue Accounts\nReceivable\nAmount % of Total\nAccounts\nReceivable\nCustomer WP $ 882,392 28 % $ 95,351 28 %\nFor the year ended September 30, 2021:\nCustomer Name\nSales Amount\n% of Total\nRevenue\nAccounts\nReceivable\nAmount\n% of Total\nAccounts\nReceivable\nCustomer WP\n$ 611,412\n%\n$ 172,390\n%\nLeases\nIn February 2016, the FASB issued ASU No. 2016-02, Leases (Topic 842), to provide guidance on recognizing lease assets and lease liabilities on the consolidated balance sheet and disclosing key information about leasing arrangements, specifically differentiating between different types of leases. The Company implemented ASU No. 2016-02 on October 1, 2019.\nThe Company performs a quarterly analysis of leases to determine if there are any operating leases that require recognition under ASC 842. The Company has a long-term operating lease for office and manufacturing space in Plano, Texas. The leased property in Plano, Texas, has a remaining lease term through June 2024. The lease has an option to extend beyond the stated termination date, but exercise of this option is not probable. The Company did not apply the recognition requirements of ASC 842 to operating leases with a remaining lease term of 12 months or less.\nDuring the Companys analysis of leases in the year ended September 30, 2022, the Company determined to renew through March 31, 2025 the office and manufacturing space in Vista, California which was previously scheduled to expire on January 31, 2023. The lease has a monthly base rent of $8,451, plus common area expenses. Along with the extension, the Company leased an additional 1,796 square feet that has a monthly base rent of $2,514 through March 31, 2025. The Company extended its sub-leased property in Vista, California, through January 31, 2023. The lease has a monthly rent of $2,111 and has been calculated as a ROU Asset co-terminus with the direct-leased property. Additionally, the Company leased a new larger office and manufacturing space in Seoul, Korea beginning November 15, 2021, through November 15, 2023. The lease has a monthly expense of $7,040. Accordingly, we have added ROU assets and lease liabilities related to those leases as of September 30, 2022.\nAs of September 30, 2022, the Companys operating leases had a weighted average remaining lease term of 1.7 years and a weighted-average discount rate of 5.0%. Other information related to our operating leases is as follows:\nSCHEDULE OF OTHER INFORMATION RELATED TO OPERATING LEASE\nROU Asset - October 1, 2021 $ 386,587\nROU Asset added during the period 558,371\nAmortization during the period (302,334 )\nROU Asset - September 30, 2022 $ 642,624\nLease Liability - October 1, 2021 $ 398,587\nLease Liability added during the period 558,371\nAmortization during the period (300,847 )\nLease Liability - September 30, 2022 $ 656,111\nLease Liability - Short-Term $ 388,325\nLease Liability - Long-Term 267,786\nLease Liability - Total $ 656,111\nThe table below reconciles the fixed component of the undiscounted cash flows for each of the first five years and the total remaining years to the lease liabilities recorded on the Consolidated Balance Sheet as of September 30, 2022.\nAmounts due within 12 months of September 30,\nSCHEDULE OF FUTURE MINIMUM RENTAL PAYMENTS FOR OPERATING LEASES\n349,890\n250,523\n67,310\nTotal Minimum Lease Payments 667,723\nLess Effect of Discounting (11,612 )\nPresent Value of Future Minimum Lease Payments 656,111\nLess Current Portion of Operating Lease Obligations 388,325\nLong-Term Operating Lease Obligations $ 267,786\nOn October 9, 2019, the Company entered into a lease agreement with Alliance Funding Group which provided for a sale lease back on certain packing equipment. The terms of this agreement require us to pay $2,987 per month through June 2024. As part of this agreement, Alliance Funding Group provided our equipment supplier with $124,500 for the purchase of this equipment. This transaction was accounted for as a financing lease. As of September 30, 2022, our financing lease had a remaining lease term of 1.8 years and a discount rate of 12.75%. The interest expense on finance lease liabilities for the year ended September 30, 2022 was $8,853.\nThe table below summarizes future minimum finance lease payments at September 30, 2022 for the 12 months ended September 30:\nSCHEDULE OF FUTURE MINIMUM LEASE PAYMENTS FOR FINANCE LEASES\n$ 33,113\n27,594\nTotal Minimum Lease Payments 60,707\nAmount representing interest (6,567 )\nPresent Value of Minimum Lease Payments 54,140\nCurrent Portion of Finance Lease Obligations 24,518\nFinance Lease Obligations, Less Current Portion $ 29,622\nLease expense included in Operating expense for the year ended September 30, 2022 and 2021 was $320,813 and $162,096, respectively. Lease expense, which represents sublease expense, is included in Other expense for the year ended September 30, 2022 and 2021 was $189,223 and $160,489, respectively. Further details are included in this lease footnote below.\nDuring the year ended September 30, 2022, we had the following cash and non-cash activities associated with our leases:\nSCHEDULE OF CASH AND NON-CASH ACTIVITIES OF LEASES\nOperating cash outflows from operating leases:\n$ 373,968\nOperating cash outflows from finance leases:\n$ 7,594\nFinancing cash outflows from finance lease:\n$ 24,260\nIn September 2020, we subleased the space at 1700 Capital Avenue in Plano, Texas, effective October 1, 2020 under favorable terms that are co-terminus with the original lease ending June 30, 2024. During the year ended September 30, 2022, we recognized sublease income of $185,139 pursuant to the sublease included in Other income on our financial statements. Future minimum lease payments to be received under that sublease as of September 30, 2022, for each of the fiscal years are as follows:\nSCHEDULE OF FUTURE MINIMUM LEASE PAYMENTS OF SUBLEASE\n$ 126,971\n$ 97,377\nTotal Minimum Lease Payments to be Received $ 224,348\nForeign Currency Translation\nThe financial position and results of operations of each of the Companys foreign subsidiaries are measured using the foreign subsidiarys local currency as the functional currency. Revenues and expenses of each such subsidiary have been translated into U.S. dollars at average exchange rates prevailing during the period. Assets and liabilities have been translated at the rates of exchange on the balance sheet date. The resulting translation gain and loss adjustments are recorded directly as a separate component of stockholders equity, unless there is a sale or complete liquidation of the underlying foreign investment. Foreign currency translation adjustment attributable to NuZee, Inc. recorded to other comprehensive (loss) gain amounted to ($113,929) and $7,662 as of September 30, 2022 and 2021, respectively.\nTransaction gains and losses that arise from exchange rate fluctuations on transactions denominated in a currency other than the functional currency are included in the results of operations as incurred.\nEquity Method\nInvestee companies that are not consolidated, but over which the Company exercises significant influence, are accounted for under the equity method of accounting. Whether or not the Company exercises significant influence with respect to an investee depends on an evaluation of several factors including, among others, representation on the investee companys board of directors and ownership level, which is generally a 20% to 50% interest in the voting securities of the investee company. Under the equity method of accounting, an investee companys accounts are not reflected within the Companys consolidated balance sheets and consolidated statements of operations; however, the Companys share of the earnings or losses of the Investee company is reflected in the caption Gain (loss) from equity method investment in the consolidated statements of operations. The Companys carrying value in an equity method investee company is reflected in the caption ‘‘Investment in unconsolidated affiliate in the Companys consolidated balance sheets.\nWhen the Companys carrying value in an equity method investee company is reduced to zero, no further losses are recorded in the Companys consolidated financial statements unless the Company guaranteed obligations of the investee company or has committed additional funding. When the investee company subsequently reports income, the Company will not record its share of such income until it equals the amount of its share of losses not previously recognized.\nOn January 9, 2020, a joint venture agreement was signed between Industrial Marino, S.A. de C.V. (50%) and the Company (50%) forming NuZee LATIN AMERICA, S.A. de C.V. (NLA). NLA was formed pursuant to the laws of Mexico, with corporate domicile in Mazatlán, Mexico. As part of the capitalization of NLA, the Company contributed two co-packing machines to the joint venture. These machines had an aggregate carrying cost of $313,012. The Company received $110,000 in cash for this contribution and recorded an investment in NLA of $160,000 and a loss of $43,012 on the contribution of the machines to NLA.\nThe Company accounts for NLA using the equity method of accounting since the management of day-to-day operations at NLA ultimately lies with the Companys joint venture partner as the operations of NLA are based in its partners facilities as well as our partner appoints the Chairman of the joint Board. As of September 30, 2022, the activity in NLA consisted of the contribution of two machines as described above and other start up and initial sales and marketing related activities. $5,791 and $7,889 of losses were recognized under the equity method of accounting during the years ended September 30, 2022 and September 30, 2021, respectively.\nRevenue Recognition\nIn May 2014, the FASB issued Accounting Standards Update No. 2014-09 (Topic 606) Revenue from Contracts with Customers. Topic 606 supersedes the revenue recognition requirements in Topic 605 Revenue Recognition (Topic 605). The new standards core principle is that an entity will recognize revenue at an amount that reflects the consideration to which the entity expects to be entitled in exchange for transferring goods or services to a customer. The principles in the standard are applied in five steps: 1) Identify the contract(s) with a customer; 2) Identify the performance obligations in the contract; 3) Determine the transaction price; 4) Allocate the transaction price to the performance obligations in the contract; and 5) Recognize revenue when (or as) the entity satisfies a performance obligation. We adopted Topic 606 as of October 1, 2018 on a modified retrospective basis. The adoption of Topic 606 did not have a material impact on our consolidated financial statements, including the presentation of revenues in our Consolidated Statements of Operations.\nReturn and Exchange Policy\nThe Company provides a 30-day money-back guarantee if a buyer is not satisfied with a product. All products are thoroughly inspected and securely packaged before they are shipped to ensure buyers receive the best possible product. If for any reason buyers are unsatisfied with the products, they can return them and the Company will exchange or refund the purchase minus any shipping charges. For wholesale customers, return policies vary based on their specific agreements with customers. Under chargebacks agreements with the customers, the Company agrees to reimburse the seller for a portion of the costs incurred by the seller to advertise and promote certain of the Companys products. The Company estimates, accrues and recognizes such chargebacks. These amounts are included in the determination of net sales.\nAs of September 30, 2022 and September 30, 2021, the Company had no sales allowances for estimated chargebacks and returns, respectively. Revenue recognized is net of sales allowances.\nCost Recognition\nCost of products sold is primarily comprised of direct materials consumed in the manufacturing of co-packing arrangements or the production of our own products for resale. Cost of products sold also includes directly related labor salaries and other overhead cost including depreciation, temporary labor and shipping costs for shipment of raw materials to our facilities.\nSelling, General and Administrative Expense\nSelling, general and administrative expense (SG&A) is primarily comprised of personnel costs, sales and marketing expenses, depreciation and amortization, insurance expenses, professional services fees, travel and office expenses, and facilities costs. In some situations, the Company covers shipping fees for delivering customer orders, and the shipping and handling expenses are recorded under operating expenses in the consolidated statements of operations.\nAdvertising Expenses\nThe Company expenses advertising costs when incurred. Advertising expense for the years ended September 30, 2022 and 2021 is as follows:\nSCHEDULE OF ADVERTISING EXPENSE\nSeptember 30,\nSeptember 30,\nAdvertising $ 192,316 $ 227,845\nResearch and Development\nResearch and development expenses are expensed in the consolidated statements of operations as incurred in accordance with FASB ASC 730, Research and Development. For the years ended September 30, 2022 and 2021, respectively, research and development expenses amounted to $633 and $1,840, respectively.\nOther Expense\nOther expense of $574,710 and $672,929 for the years ended September 20, 2022 and 2021, respectively, primarily includes write off of deferred financing costs and sublease expense.\nPrepaid expenses and other current assets\nPrepaid expenses and other current assets for the years ended September 30, 2022 and 2021 is as follows:\nSCHEDULE OF PREPAID EXPENSES AND OTHER CURRENT ASSETS\nSeptember 30,\nSeptember 30,\nPrepaid expenses and other current assets $ 547,773 $ 482,288\nThe Prepaid expenses and other current assets balance of $547,773 as of September 30, 2022 primarily consists of prepaid insurance, deposits on inventory purchases, and a retainer for professional services, and the balance of $482,288 as of September 30, 2021 primarily consists of prepaid insurance and deposits on inventory purchases.\nInventory\nInventory, consisting principally of raw materials, work in process and finished goods held for production and sale, is stated at the lower of cost or net realizable value, cost being determined using the weighted average cost method. The Company reviews inventory levels at least quarterly and records a valuation allowance when appropriate. At September 30, 2022 and 2021, the carrying value of inventory of $947,995 and $573,464 respectively, reflected on the consolidated balance sheets is net of this adjustment.\nSCHEDULE OF INVENTORY\nSeptember 30,\nSeptember 30,\nRaw materials $ 887,632 $ 552,621\nFinished goods 60,363 20,843\nLess - Inventory reserve - -\nTotal $ 947,995 $ 573,464\nProperty and Equipment\nProperty and equipment is stated at cost, net of accumulated depreciation. The Company generally depreciates property and equipment on a straight-line basis over the estimated useful lives of the assets after the assets are placed in service except for NuZee KR which uses the declining balance method. Office equipment is depreciated over a 3-year life, furniture over a 7-year life, and other equipment over a 5-year life. Depreciation expense for the years ended September 30, 2022 and 2021 was $333,196 and $344,699, respectively. Repair and maintenance costs are expensed as incurred. Expenditures associated with upgrades and enhancements that improve, add functionality, or otherwise extend the life of property and equipment that exceed $1,000 are capitalized. Property and equipment as of September 30, 2022 and 2021 consist of:\nSCHEDULE OF PROPERTY AND EQUIPMENT\nSeptember 30,\nSeptember 30,\nMachinery & Equipment 1,930,898 1,794,968\nVehicles 73,008 76,267\nLeasehold Improvements 62,122 122,698\nLess - Accumulated Depreciation (1,540,953 ) (1,319,909 )\nNet Property and Equipment $ 525,075 $ 674,024\nThe Company is required to make deposits or prepayments and progress payments on equipment purchases before the Company receives possession and title. As a result, the Company accounts for such payments as Other Assets until it has possession at which time the equipment is recorded as Property and Equipment. There were no such deposits as of September 30, 2022 or September 30, 2021.\nSamples\nThe Company distributes samples of its products as a component of its marketing program. Costs for samples are expensed at the time the samples are produced and recorded under operating expenses in the consolidated statements of operations.\nLong-Lived Assets\nThe Company tests long-lived assets or asset groups for recoverability when events or changes in circumstances indicated that their carrying amount may not be recoverable. Circumstances which could trigger a review include, but are not limited to: significant decreases in the market price of the asset; significant adverse changes in the business climate or legal factors; accumulation of costs significantly in excess of the amount originally expected for the acquisition or construction of the asset; current period cash flow or operating losses combined with a history of losses or a forecast of continuing losses associated with the use of the asset; and a current expectation that the asset will more likely than not be sold or disposed significantly before the end of its estimated useful life. Recoverability is assessed based on the carrying amount of the asset and its fair value which is generally determined based on the sum of the undiscounted cash flows expected to result from the use and the eventual disposal of the asset, as well as specific appraisal in certain instances. In March 2021, the Company wrote off $840,391 of assets in North America as these assets were deemed to be no longer useful for the current business operations. This write off is included in operating expenses on our consolidated statement of operations for the year ended September 30, 2021.\nGoodwill and intangible assets\nWe evaluate goodwill for impairment on an annual basis as of the last day of our fiscal fourth quarter, and whenever events or circumstances make it more likely than not that an impairment may have occurred. These events or circumstances could include a significant change in the business climate, legal factors, operating performance indicators, competition, client engagement, or sale or disposition. We monitor the existence of potential impairment indicators throughout the fiscal year. We test for goodwill impairment at the reporting unit level. We consider the Company as a reporting unit for goodwill impairment testing. We determined the Company has one operating segment and two components, NuZee, Inc. and NuZee KR, which are combined into one reporting unit as they are considered to be economically similar. The impairment test involves comparing the fair value of the reporting unit to its carrying value, including goodwill. Fair value reflects the price a market participant would be willing to pay in a potential sale of the reporting unit. If the fair value exceeds the carrying value, we conclude that no goodwill impairment has occurred. If the carrying value of the reporting unit exceeds its fair value, we recognize an impairment loss in an amount equal to the excess, not to exceed the carrying value of the goodwill. Since the Company is one reporting unit, the fair value of the Company equals market capitalization, thus net book value is compared to market capitalization to determine if there is any impairment.\nDuring the year ended September 30, 2022, we recorded a goodwill impairment loss of $531,412 as a result of our market capitalization being below our net book value, which is included in impairment expense within Operating expenses in our Consolidated Statements of Operations. Refer to Note 7: Goodwill and Intangible Assets for further details regarding the goodwill impairment charge recorded during the year ended September 30, 2022. As of September 30, 2022, the goodwill balance net of the impairment loss was $0. We had no goodwill as of September 30, 2021.\nIntangible assets have either an identifiable or indefinite useful life. Intangible assets with identifiable useful lives are amortized on a straight-line basis over their economic or legal life, whichever is shorter. We have identifiable useful life intangible assets related to acquired Dripkit tradename and customer relationships. We test these intangible assets annually for impairment, and when indications of potential impairment exist. We utilize the relief from royalty method to determine the fair value of the tradename. Management uses considerable judgment to determine key assumptions, including projected revenue, royalty rates and appropriate discount rates. We estimate the fair value of acquired customer relationships using a weighted average of the income. The income approach applies a fair value methodology based on discounted cash flows. This analysis requires significant estimates and judgments, including estimation of future cash flows, which is dependent on internal forecasts, estimation of the long-term rate of growth for our business, estimation of the useful life over which cash flows will occur, customer attrition, and determination of our weighted average cost of capital. If the carrying value of an intangible asset exceeds the fair value, we recognize an impairment loss in an amount equal to the excess, not to exceed the carrying value. During the year ended September 30, 2022, we recorded an impairment loss of $63,167 related to tradename, and $80,555 related to customer relationships, which are included in impairment expense within Operating expenses in our Consolidated Statements of Operations. Refer to Note 7: Goodwill and Intangible Assets for further details regarding the tradename and customer relationship impairment charges recorded during the year ended September 30, 2022. After the noted impairments above, the Company had intangible assets related to the Dripkit tradename and customer relationship of $140,000 and $0, respectively, as of September 30, 2022, and had no intangible assets as of September 30, 2021.\nIncome Taxes\nIn accordance with ASC 740 - Income Taxes, the provision for income taxes is computed using the asset and liability method. Under the asset and liability method, deferred income tax assets and liabilities are determined based on the differences between the financial reporting and tax bases of assets and liabilities and are measured using the currently enacted tax rates and laws. A valuation allowance is provided for the amount of deferred tax assets that, based on available evidence, are not expected to be realized.\nThe Company also follows the guidance related to accounting for income tax uncertainties. In accounting for uncertainty in income taxes, the Company recognizes the financial statement benefit of a tax position only after determining that the relevant tax authority would more likely than not sustain the position following an audit. For tax positions meeting the more likely than not threshold, the amount recognized in the financial statements is the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement with the relevant tax authority. No liability for unrecognized tax benefits was recorded as of September 30, 2022 and 2021.\nRelated parties\nA party is considered to be related to the Company if the party directly or indirectly or through one or more intermediaries, controls, is controlled by, or is under common control with the Company. Related parties also include principal owners of the Company, its management, members of the immediate families of principal owners of the Company and its management and other parties with which the Company may deal if one party controls or can significantly influence the management or operating policies of the other to an extent that one of the transacting parties might be prevented from fully pursuing its own separate interests. A party which can significantly influence the management or operating policies of the transacting parties or if it has an ownership interest in one of the transacting parties and can significantly influence the other to an extent that one or more of the transacting parties might be prevented from fully pursuing its own separate interests is also a related party.\nOther Current Liabilities\nOther current liabilities are primarily comprised of deposits and advances received from equity investors for certain legal opinions that will be provided by the Companys counsel which totaled $8,553 and $99,760 as of September 30, 2022 and September 30, 2021, respectively.\nStock-based Compensation\nWe account for share-based awards issued to employees in accordance with Accounting Standards Codification (ASC) 718, Compensation-Stock Compensation. Accordingly, employee share-based payment compensation is measured at the grant date, based on the fair value of the award, and is recognized as an expense over the requisite service period, which is normally the vesting period. Share-based compensation to directors is treated in the same manner as share-based compensation to employees, regardless of whether the directors are also employees. In June 2018, the FASB issued ASU 2018-07 which simplifies several aspects of the accounting for non-employee transactions by stipulating that the existing accounting guidance for share-based payments to employees (accounted for under ASC Topic 718, Compensation-Stock Compensation) will also apply to non-employee share-based transactions (accounted for under ASC Topic 505, Equity). The Company implemented ASU 2018-07 on October 1, 2019 and the impact of the implementation was not material to the financial statements.\nWe determine the fair value of share-based payments using the Black Scholes option-pricing model for common stock options and warrants and the closing price of our common stock for common share issuances. We recognize forfeitures as they occurred.\nComprehensive income/loss\nComprehensive income/loss is defined to include all changes in equity except those resulting from investments by owners and distributions to owners. Among other disclosures, all items that are required to be recognized under current accounting standards as components of comprehensive income/loss are required to be reported in a financial statement that is presented with the same prominence as other financial statements. The Companys current component of other comprehensive income/loss pertain to foreign currency translation adjustments.\nSegment Information\nASC Topic 280, Disclosures about Segments of an Enterprise and Related Information, established standards for the way that public business enterprises report information about operating segments in annual financial statements and requires those enterprises to report selected information about operating segments in interim financial reports issued to stockholders. Management has determined that the Company operates in one business segment, which is the commercialization and development of functional beverages.\nRecent Accounting Pronouncements\nChanges to accounting principles are established by the Financial Accounting Standards Boards (FASB) in the form of Accounting Standards Update (ASU) to the FASBs Codification. We consider the applicability and impact of all ASUs on our financial position, results of operations, cash flows, or presentation thereof.\nThe Company reviewed all recently issued pronouncements in 2022, but not yet effective, and does not believe the future adoption of any such pronouncements may be expected to cause a material impact on the Companys financial condition or the results of its operations.\n3. LOANS\nOn April 1, 2019, the Company purchased a delivery van from Ford Motor Credit for $41,627. The Company paid $3,500 as a down payment and financed $38,127 for 60 months at a rate of 2.9%. The loan is secured by the van. The outstanding balance on the loan at September 30, 2022 and 2021 amounted to $12,692 and $20,416, respectively. On February 15, 2019 NuZee KR entered into equipment financing for production equipment with Shin Han Bank for $60,563. In June 2019, NuZee KR purchased additional equipment and increased the loan with Shin Han Bank by $86,518. The financing has a term of 36 months at a rate of 4.33%. Principal payments began in July 2019. The outstanding balance on this loan at September 30, 2022 and 2021 amounted to $0 and $35,898, respectively.\nThe loan payments required for the next five years are as follows:\nSCHEDULE OF LOAN PAYMENTS\nFord Motor\nCredit\n2022 (October-December) $ 1,965\n2023 (January-September) 5,982\nTotal Current Portion 7,947\n2023 (October-September) 2,019\n2,726\nTotal Long-Term Portion 4,745\nGrand Total $ 12,692\n4. GEOGRAPHIC CONCENTRATIONS\nThe Company is organized based on fundamentally one business segment although it does sell its products on a world-wide basis. The Company is organized in three geographical segments. The Company co-packs product for customers and produces and sells its products directly in North America and Korea. In fiscal year 2022, the Company had a minimally staffed office in Japan that provided support for import and export of product and materials between the U.S. and Japan, as well as investor relations support to our stockholders based in Japan; these functions are now supported by our personnel residing in the United States. Information about the Companys geographic operations for the years ended September 30, 2022 and 2021 are as follows:\nSCHEDULE OF GEOGRAPHIC OPERATIONS\nYear Ended\nSeptember 30, 2022\nYear Ended\nSeptember 30, 2021\nNet Revenue:\nNorth America $ 2,443,863 $ 1,441,274\nSouth Korea 665,299 485,386\nNet Revenue $ 3,109,162 $ 1,926,660\nSeptember 30, 2022 September 30, 2021\nProperty and equipment, net:\nNorth America $ 378,546 $ 517,966\nJapan 1,664 1,496\nSouth Korea 144,865 154,562\nProperty and equipment, net $ 525,075 $ 674,024\n5. RELATED PARTY TRANSACTIONS\nDuring the years ended September 30, 2022 and 2021, the Company sold $0 and $28,298 of materials to NLA, respectively.\nDuring the years ended September 30, 2022 and 2021, NuZee KR sold $8,117 and $0 of single serve pour over and coffee brew bag coffee products, respectively, to Mystery Golf Ltd., a company owned by the chief executive officer of NuZee KR.\n6. BUSINESS COMBINATIONS\nAs described in Note 2, on February 25, 2022, the Company acquired substantially all the assets and certain specified liabilities of Dripkit pursuant to the Asset Purchase Agreement, dated as of February 21, 2022, by and among the Company, Dripkit, and Dripkits existing investors who executed joinders to the Asset Purchase Agreement as of the Closing Date. Pursuant to the terms of the Asset Purchase Agreement, the aggregate purchase price paid by the Company for the Acquisition was $860,000, consisting of cash paid by the Company to Dripkit and the Companys issuance to the Stock Recipients of shares of the Companys common stock, plus the assumption of certain assumed liabilities, including a $13,000 bridge loan and approximately $3,176 of payables, subject to certain adjustments and holdbacks as provided in the Asset Purchase Agreement resulting in an acquisition accounting purchase price of $876,176. The Company analyzed the Acquisition under ASC 805 and concluded that it should be accounted for as a business combination. Dripkit operates as a new Dripkit Coffee business division that is wholly-owned by NuZee, Inc.\nPursuant to the terms of the Asset Purchase Agreement, on the Closing Date, the cash portion of the purchase price was reduced by the following amounts: (a) $22,000, in satisfaction of the bridge loan made from the Company to Dripkit in February 2022 to provide Dripkit with operational financing prior to the Closing Date, (b) $35,500, as an indemnity holdback for the purpose of satisfying any indemnification claims made by the Company pursuant to the Asset Purchase Agreement, and (c) $40,000, as a cash bulk sales holdback (the Cash Bulk Sales Holdback Amount). In addition, on the Closing Date, the Company held back $40,000 worth of stock consideration as the Stock Bulk Sales Holdback Amount (together with the Cash Bulk Sales Holdback Amount, the Bulk Sales Holdback Amount).\nOn the Closing Date, after adjustments and holdbacks under the Asset Purchase Agreement, the Company paid the aggregate purchase price as follows: (i) cash paid by the Company to Dripkit was $257,000, and (ii) the Company issued to the Stock Recipients an aggregate of 178,681 shares of the Companys common stock. The Company repaid the entire outstanding principal amount of Dripkits Small Business Association Economic Injury Disaster Loan in the amount of $78,656. In addition, the Company recorded a liability on its balance sheet in Accounts Payable of $115,500 related to potential future amounts due related to the Bulk Sales Holdback of $80,000 and the indemnity holdback of $35,500.\nDuring the year ended September 30, 2022, pursuant to the terms of the Asset Purchase Agreement, the Bulk Sales Holdback Amount was used to satisfy sales and use taxes owed by Dripkit to the State of New York as of the Closing Date. Pursuant to the terms of the Asset Purchase Agreement, the amounts remaining after offsetting the cost of these sales and use taxes were distributed as follows in the quarter ended June 30, 2022: (i) $39,237 was distributed to Dripkit on May 9, 2022, in connection with the Cash Bulk Sales Holdback Amount, and (ii) 18,475 shares of common stock were issued to the Stock Recipients on April 25, 2022, in connection with the Stock Bulk Sales Holdback Amount.\nThe following table presents the allocation of the aggregate purchase price paid by the Company for the Acquisition of $860,000, plus the assumption of certain assumed liabilities, including a $13,000 bridge loan and approximately $3,176 of payables, resulting in an acquisition accounting purchase price of $876,176, to the assets acquired for the acquisition of Dripkit:\nSCHEDULE OF ALLOCATION OF AGGREGATE PURCHASE PRICE\nTotal purchase price $ 876,176\nAssets acquired:\nInventory $ 9,664\nProperty and equipment 5,100\nIdentifiable intangible assets 330,000\nTotal assets acquired $ 344,764\nEstimated fair value of net assets acquired $ 344,764\nGoodwill $ 531,412\nIdentified Intangibles and Goodwill\nThe Company identified tradename and customer relationships intangible assets. The tradename and customer relationships intangible assets will be amortized on a straight-line basis over their respective estimated useful lives. The goodwill recognized results from such factors as an assembled workforce and managements industry know-how. See Note 7-Goodwill and Intangible Assets for additional information on identified intangible assets and goodwill.\nThe financial statements for the year ended September 30, 2022 include the operating results of Dripkit for the period from February 25, 2022, the date of the Acquisition, to September 30, 2022. The consolidated statement of operations for the year ended September 30, 2022 includes revenues of approximately $69,767, net loss of approximately $272,610, and amortization expense of approximately $46,278, contributed by Dripkit.\nDuring the year ended September 30, 2022, the Company incurred $270,478 of transaction costs related to the Acquisition which are included in Selling, general and administrative expense.\nUnaudited Pro forma Financial Information\nThe following unaudited proforma financial information presents the combined results of operations of the Company and gives effect to the Acquisition for the year ended September 30, 2022, as if the Acquisition had occurred as of October 1, 2020 instead of on February 25, 2022.\nThe pro forma financial information is presented for illustrative purposes only and is not necessarily indicative of the results of operations that would have been realized if the Acquisition had been completed on October 1, 2020, nor does it purport to project the results of operations of the combined company in future periods. The pro forma financial information does not give effect to any integration costs related to the acquired company.\nThe pro forma financial information for the Company and Dripkit is as follows for the years ended:\nSCHEDULE OF UNAUDITED PRO FORMA FINANCIAL INFORMATION\nSeptember 30,\nSeptember 30,\nRevenues $ 3,168,528 $ 2,322,859\nNet loss $ 11,651,790 $ 18,815,500\nFor purposes of the pro forma disclosures above, the primary adjustments for the year ended September 30, 2022 include the elimination of transaction costs of approximately $270,478.\n7. GOODWILL AND INTANGIBLE ASSETS\nImpairments\nGoodwill\nDuring the year ended September 30, 2022, we recorded a non-cash impairment charge of $531,412 related to goodwill, which was included in impairment expense within operating expenses in our Consolidated Statements of Operations. The charge was a result of our net book value being lower than our market capitalization.\nChanges in goodwill for the year ended September 30, 2022, consists of the following:\nSCHEDULE OF CHANGES IN GOODWILL\nSeptember 30,\nBalance at September 30, 2021 $ -\nDripkit acquisition 531,412\nImpairment charge (531,412 )\nBalance at September 30, 2022 $ -\nIdentifiable life intangible assets\nDuring the year ended September 30, 2022, we recorded non-cash impairment charges for the Dripkit tradename and acquired customer relationships of $80,555 and $63,167, respectively, which was included in impairment expense within operating expenses in our Consolidated Statements of Operations. The charge was primarily the result of a change in forecast related to estimated future revenue growth for Dripkit, sales channel mix, and estimated costs to support such growth, which had the effect of decreasing our forecast of estimated future cash flows. As of September 30, 2022, the remaining tradename asset balance adjusting for impairment was $140,000, and the customer relationship asset balance was fully written off.\nAs of September 30, 2022, the Companys intangible assets consisted of the following:\nSCHEDULE OF INTANGIBLE ASSETS\nAmortization September 30, 2022\nPeriod\n(Years) Gross Accumulated\nAmortization Impairment Charge Net\nTradenames $ 230,000 $ 26,833 $ 63,167 $ 140,000\nCustomer relationships 100,000 19,445 80,555 -\nBalance at September 30, 2022\n$ 330,000 $ 46,278 $ 143,722 $ 140,000\nAmortization expense was $46,278 for the year ended September 30, 2022.\nAmortization expense for the next five fiscal years is as follows:\nSCHEDULE OF AMORTIZATION EXPENSE\nTradename\nAmortization\n31,111\n31,111\n31,111\n31,111\n15,556\nGrand Total $ 140,000\n8. ISSUANCE OF EQUITY SECURITIES\nDuring the year ended September 30, 2021, the Company sold (i) 72,955 shares of common stock to Triton Funds LP in a registered public offering for aggregate net proceeds of $534,494 pursuant to a Common Stock Purchase Agreement dated as of October 26, 2020 and a prospectus supplement to the Companys effective shelf registration statement on Form S-3 (Registration No. 333-248531), and (ii) 256,338 shares of common stock at $9.14 per share for aggregate net proceeds of $2,149,486 pursuant to Securities Act registration exemptions under Regulation S and/or Section 4(a)(2) of the Securities Act. In addition, as further described below, during the year ended September 30, 2021, the Company sold pursuant to an Underwriting Agreement dated as of March 19, 2021 and a prospectus supplement to the Companys effective shelf registration statement on Form S-3 (Registration No. 333-248531) (i) 2,777,777 units (2021 Units) in an underwritten registered public offering for aggregate net proceeds of $11,017,304 which includes the proceeds from the underwriters full exercise of their overallotment option with respect to the warrant component of the 2021 Units, as further described below, with each Unit consisting of (a) one share of our common stock, (b) one Series A warrant (each, a Series A Warrant and collectively, the Series A Warrants) to purchase one share of our common stock with an initial exercise price of $4.50 per whole share, and (c) one Series B warrant (each, a Series B Warrant and collectively, the Series B Warrants and together with the Series A Warrants, the 2021 Warrants) to purchase one-half share of our common stock with an initial exercise price of $5.85 per whole share, and (ii) 416,666 Series A Warrants and 416,666 Series B Warrants, each pursuant to the underwriters full exercise of their overallotment option with respect to such warrants.\nOn March 11, 2021, we terminated our At Market Issuance Sales Agreement, dated September 1, 2020 (the ATM Agreement), with B. Riley Securities, Inc. (f/k/a/ B. Riley FBR, Inc.) and The Benchmark Company, LLC (collectively, the Agents), pursuant to which we could from time to time offer and sell up to an aggregate of $50.0 million of shares of our common stock through the Agents in at-the-market-offerings, as defined in Rule 415 under the Securities Act. We did not sell any shares of common stock under the ATM Agreement. The Companys consolidated statement of cash flows for the year ended September 30, 2021 includes write-off of stock issuance expenses of $477,605, which is included in Other expense in our consolidated statement of operations, in connection with the terminated ATM Agreement with B. Riley Securities, Inc. (f/k/a/ B. Riley FBR, Inc.) and The Benchmark Company, LLC, as agents.\nOn December 28, 2021, the Company entered into an Equity Distribution Agreement (the Equity Distribution Agreement) with Maxim Group LLC, as agent (the Agent), pursuant to which the Company could offer and sell, from time to time, shares of common stock through the Agent in at-the-market-offerings, as defined in Rule 415 under the Securities Act, having an aggregate offering price of up to $20,000,000. Pursuant to the Equity Distribution Agreement, the Company paid the Agent a commission rate, in cash, equal to 3.0% of the aggregate gross proceeds from each sale of shares of the Companys common stock under the Equity Distribution Agreement. The offer and sale of shares under the Equity Distribution Agreement were made pursuant to the Companys effective shelf registration statement on Form S-3 (Registration No. 333-248531) and the related prospectus. In the year ended September 30, 2022, the Company issued and sold 49,326 shares of common stock under the Equity Distribution Agreement, raising net proceeds of $95,256. In connection with such sales, the Company paid compensation to the Agent in the amount of $3,003. On August 5, 2022, the Company terminated the Equity Distribution Agreement. The Companys consolidated statement of cash flows for the year ended September 30, 2022 includes write-off of stock issuance expenses of $368,783, which is included in Other expense in our consolidated statement of operations, in connection with the terminated Equity Distribution Agreement with the Agent.\nOn April 13, 2022, pursuant to Securities Act registration exemptions under Regulation S and/or Section 4(a)(2) of the Securities Act, the Company sold 884,778 units (the 2022 Units), at a price of $2.00 per 2022 Unit for aggregate net proceeds of $1,649,736, with each 2022 Unit consisting of (a) one share of our common stock and (b) one warrant (each, a 2022 Warrant and collectively, the 2022 Warrants) to purchase one whole share of our common stock with an initial exercise price of $2.00 per share.\nOn August 10, 2022, the Company completed an underwritten public offering of 4,200,000 shares of common stock, pursuant to an Underwriting Agreement dated as of August 7, 2022 and a prospectus supplement to the Companys effective shelf registration statement on Form S-3 (Registration No. 333-248531). The Company received aggregate net proceeds of approximately $2.5 million ($2,656,460 of proceeds from issuance of common stock minus $135,592 of accrued stock issuance costs in our consolidated statement of cash flows for the year ended September 30, 2022), after deducting underwriting discounts and commissions and offering expenses payable by the Company.\nExercise of Warrants\nIn the year ended September 30, 2022, the Company issued 384,447 shares of common stock related to exercises of 2021 Warrants, including 380,447 shares of common stock issued upon exercise of 380,447 Series A Warrants and 4,000 shares of common stock issued upon exercise of 8,000 Series B Warrants. In connection with such exercises, in year ended September 30, 2022, the Company received aggregate net proceeds of $1,702,596.\nRestricted Shares\nOn January 11, 2021, the Compensation Committee (the Compensation Committee) of the Companys Board of Directors granted to Shanoop Kothari, who was serving at the time as both the Companys Chief Financial Officer and Chief Operating Officer, in connection with the Compensation Committees determination of Mr. Kotharis annual compensation, an award of 152,215 restricted shares (the Restricted Shares) of the Companys common stock under the NuZee, Inc. 2019 Stock Incentive Plan. These Restricted Shares vested as follows: (i) 50,739 Restricted Shares vested immediately (35,739 net shares were issued to Mr. Kothari following the forfeiture of 15,000 vested shares to cover taxes); (ii) 50,739 Restricted Shares vested on March 31, 2021; and (iii) 50,737 Restricted Shares were originally scheduled to vest on March 31, 2022 but were accelerated to vest on Mr. Kotharis separation date of August 16, 2021. The Company recognized common stock compensation expense of $1,251,402 for the year ended September 30, 2021 related to these Restricted Shares.\nGrant of Restricted Stock Awards to the Companys Independent Board Members\nOn March 17, 2022, pursuant to the Companys non-employee director compensation policy, the Compensation Committee granted 23,584 restricted shares of the Companys common stock to each of the Companys five independent directors pursuant to the NuZee, Inc. 2013 Stock Incentive Plan, totaling 117,920 Restricted Shares. These Restricted Shares are scheduled to vest in full on the one-year anniversary of the grant date, subject to each independent directors continued service as a director of the Company. The Company recognized common stock compensation expense of $134,755 for the year ended September 30, 2022 related to these Restricted Shares.\nExercise of options\nDuring the year ended September 30, 2021, 6,000 shares were issued upon the exercise of stock options. As part of this exercise, the Company received $9,180 in proceeds. During the year ended September 30, 2022, 14,000 shares were issued upon the exercise of stock options, and the Company received $12,600 as part of this exercise.\n9. STOCK OPTIONS AND WARRANTS\nOptions\nDuring the fiscal year ended September 30, 2022, the Company granted 185,000 new stock options at an average exercise price of $1.31 to employees. For employees, these options shall vest and become exercisable (i) in the case of time-based options, generally as to 1/3 on each anniversary of the grant date, although different vesting patterns exist, or (ii) in the case of performance-based options (the Performance-Based Options), based on the Companys or individuals achievement of certain performance milestones established by the Compensation Committee for each fiscal year in the fiscal years ending September 30, 2023, 2024 and 2025. During the fiscal year ended September 30, 2022, the Company issued a total of 128,000 Performance-Based Options, which represents the maximum number of Performance-Based Options that may be earned if all performance milestones are achieved for the applicable performance periods.\nThe exercise price for the options issued in the year ended September 30, 2022 ranged from $0.313 - $2.16 per share. The options will expire ten years from the grant date, unless terminated earlier as provided by the option agreements.\nDuring the fiscal year ended September 30, 2021, the Company issued 3,366,681 options at an average exercise price of $4.88, including issuing 15,000 options to independent contractors, 1,369,944 options to independent Board members and 1,981,737 options to employees. For independent contractors, these options shall vest and become exercisable over a period of 3 years, with 33% of the options vesting on each anniversary of the grant date. For employees, these options shall vest and become exercisable (i) in the case of time-based options, generally as to 1/3 on each anniversary of the grant date, although different vesting patterns exist, or (ii) in the case of performance-based options (the Performance-Based Options), based on the Companys or individuals achievement of certain performance milestones established by the Compensation Committee for each fiscal year in the fiscal years ending September 30, 2021, 2022, 2023 and 2024. During the year ended September 30, 2021, the Company issued a total of 1,610,743 Performance-Based Options, which represents the maximum number of Performance-Based Options that may be earned if all performance milestones are achieved for the applicable performance periods.\nThe exercise price for the options issued in the year ended September 30, 2021 ranged from $2.91 - $16.79 per share. The options will expire ten years from the grant date, unless terminated earlier as provided by the option agreements.\nThe fair value of each option award was estimated on the date of grant using the Black-Scholes option valuation model using the assumptions noted as follows: expected volatility was based on the volatility of a peer group of companies for the year ended September 30, 2022, and historical volatility of Company stock for the year ended September 30, 2021. For the year ended September 30, 2022, the expected term of options granted was determined using the simplified method under SAB 107 which represents the mid-point between the vesting term and the contractual term. For the year ended September 30, 2021, the expected term of options granted was based on the contractual term. The risk-free rate is calculated using the U.S. Treasury yield curve and is based on the expected term of the option.\nThe Black-Scholes option pricing model was used with the following weighted average assumptions for options granted during the year ended September 30, 2022 and 2021, respectively:\nSCHEDULE OF WEIGHTED AVERAGE ASSUMPTIONS FOR FAIR VALUE MEASUREMENT OF OPTIONS GRANTED\nFor employees September 30, 2022 September 30, 2021\nRisk-free interest rate 2.38-3.71 % 1.27 - 2.2 %\nExpected option life years years\nExpected volatility 68.2-70.5 % - 301 %\nExpected dividend yield 0.00 % 0.00 %\nExercise price $ 0.31-$2.16 $ 2.91 - $3.27\nFor non-employees September 30, 2022 September 30, 2021\nRisk-free interest rate Not applicable 0.78 - 1.71 %\nExpected option life Not applicable 10 years\nExpected volatility Not applicable 302 -310 %\nExpected dividend yield Not applicable 0.00 %\nExercise price Not applicable $ 3.03 - 16.79\nThe Company is expensing these stock option awards on a straight-line basis over the requisite service period. The Company recognized stock option expense $2,899,338 and $9,405,191, respectively, for the years ended September 30, 2022 and 2021. Unamortized option expense as of September 30, 2022, for all options outstanding amounted to approximately $1,104,758. These costs are expected to be recognized over a weighted-average period of 1.23 years.\nDuring the year ended September 30, 2022, the Company issued 14,000 shares of common stock upon the exercise of outstanding stock options and 563,016 stock options were forfeited. For the year ended September 30, 2022, of the 563,016 options were forfeited, 227,667 options forfeited because of the termination of employment and 335,349 options forfeited because the performance conditions were not met. In addition, 144,000 vested stock options expired pursuant to the terms of the applicable award agreements following the termination of employment.\nThe following table summarizes stock option activity for the year ended September 30, 2022.\nSUMMARY OF STOCK OPTION ACTIVITY\nNumber of Shares Weighted Average Exercise Price Weighted Average Remaining Contractual Life (years) Aggregate Intrinsic Value\nOutstanding at September 30, 2021 4,511,691 $ 4.73 8.4 $ 452,206\nGranted 185,000 1.31\nExercised (14,000 ) 0.90\nExpired (144,000 ) 19.42\nForfeited (563,016 ) 3.12\nOutstanding at September 30, 2022 3,975,675 4.28 7.4 $ 1,207\nExercisable at September 30, 2022 2,226,557 $ 4.59 6.5 $ -\nDuring the year ended September 30, 2021, the Company issued 6,000 shares of common stock upon the exercise of outstanding stock options and 469,657 stock options were forfeited. For the year ended September 30, 2021, of the 469,657 options were forfeited, 361,657 options forfeited because of the termination of employment and 108,000 options forfeited because the performance conditions were not met.\nThe following table summarizes stock option activity for the year ended September 30, 2021.\nNumber of Shares Weighted Average Exercise Price Weighted Average Remaining Contractual Life (years) Aggregate Intrinsic Value\nOutstanding at September 30, 2020 1,620,667 $ 5.74 7.3 $ 19,112,118\nGranted 3,366,681 4.88\nExercised (6,000 ) 1.53\nExpired - -\nForfeited (469,657 ) 9.29\nOutstanding at September 30, 2021 4,511,691 4.73 8.4 $ 452,206\nExercisable at September 30, 2021 1,640,892 $ 5.64 7.3 $ 368,673\nA summary of the status of the Companys unvested options as of September 30, 2022 and 2021, are presented below:\nSUMMARY OF UNVESTED SHARES\nNumber of Nonvested Weighted Average Grant\nOptions Date Fair Value\nNonvested options at September 30, 2020 762,917 $ 10.60\nGranted 3,366,681 $ 4.88\nExercised - $ -\nForfeited (316,328 ) $ 7.66\nVested (942,471 ) $ 8.16\nNonvested options at September 30, 2021 2,870,799 $ 5.02\nGranted 185,000 $ 0.84\nExercised - $ -\nForfeited (563,016 ) $ 3.09\nVested (743,665 ) $ 6.11\nNonvested options at September 30, 2022 1,749,118 $ 4.41\nWarrants\nWarrants\nOn June 23, 2020, as part of our agreement with Benchmark Company, LLC, the underwriter of the Companys June 2020 registered public offering of common stock, we issued 40,250 warrants (the 2020 Warrants) to purchase our common stock at an exercise price of $9.00 per share. The 2020 Warrants became exercisable on December 23, 2020 and expire on June 18, 2025.\nWarrants\nOn March 19, 2021, the Company sold (i) 2,777,777 2021 Units, at a price to the public of $4.50 per 2021 Unit, with each 2021 Unit consisting of (a) one share of our common stock, (b) one Series A Warrant, and (c) one Series B Warrant, and (ii) 416,666 Series A Warrants and 416,666 Series B Warrants, each pursuant to the underwriters full exercise of their overallotment option with respect to such warrants. Each Series A Warrant entitles the registered holder to purchase one share of our common stock at an exercise price of $4.50 per share. Each Series B Warrant entitles the registered holder thereof to purchase one-half of a share of our common stock at an exercise price of $5.85 per whole share. The 2021 Warrants have a term of 5 years. The Series A and Series B Warrant holders are obligated to pay the exercise price in cash upon exercise of the 2021 Warrants unless we fail to maintain a current prospectus relating to the common stock issuable upon the exercise of the 2021 Warrants (in which case, the 2021 Warrants may only be exercised via a cashless exercise provision).\nWarrants\nOn April 13, 2022, the Company sold 884,778 2022 Units, with each 2022 Unit consisting of (a) one share of our common stock and (b) one 2022 Warrant. Each 2022 Warrant entitles the holder to purchase one share of our common stock at an exercise price of $2.00 per share. The 2022 Warrants have a term of 5 years. Holders may exercise their 2022 Warrants on a cashless basis pursuant to a formula set forth in the form of 2022 Warrant.\nThe following table summarizes warrant activity for the year ended September 30, 2022:\nSCHEDULE OF WARRANT ACTIVITY\nNumber of Shares Issuable Upon Exercise of Warrants Weighted Average Exercise Price Weighted Average Remaining Contractual Life (years) Aggregate Intrinsic Value\nOutstanding at September 30, 2021 4,831,915 $ 4.98 4.5 $ -\nIssued 884,778 2.00\nExercised (384,447 ) 4.51\nExpired - -\nOutstanding at September 30, 2022 5,332,246 $ 4.52 3.7 -\nExercisable at September 30, 2022 5,332,246 $ 4.52 3.7 $ -\nIn the year ended September 30, 2022, we issued 384,447 shares of common stock related to exercises of 2021 Warrants, including 380,447 shares of common stock issued upon exercise of 380,447 Series A Warrants and 4,000 shares of common stock issued upon exercise of 8,000 Series B Warrants. In connection with such exercises, in the year ended September 30, 2022, we received aggregate net proceeds of $1,702,596.\nThe following table summarizes warrant activity for the year ended September 30, 2021:\nNumber of Shares Issuable Weighted Weighted Average Remaining\nUpon Average Contractual Aggregate\nExercise of Exercise Life Intrinsic\nWarrants Price (years) Value\nOutstanding at September 30, 2020 40,250 $ 9.00 4.7 $ 321,598\nIssued 4,791,665 4.95\nExercised - -\nExpired - -\nOutstanding at September 30, 2021 4,831,915 $ 4.98 4.5 -\nExercisable at September 30, 2021 4,831,915 $ 4.98 4.5 $ -\n10. INCOME TAX\nThe company recorded $0 income tax expense for the years ended September 30, 2022 and 2021.\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes.\nThe Company will have tax losses available to be applied against future years income as result of the losses incurred. However, due to the losses incurred in the period and expected future operating results, management determined that it is more likely than not that the deferred tax asset resulting from the tax losses available for carry forward will not be realized through the reduction of future income tax payments. Accordingly, a 100% valuation allowance has been recorded for deferred income tax assets. Cumulative net operating loss carry forward is $37,663,761 and $27,750,819 as of September 30, 2022 and 2021, respectively, and will begin expiring in 2033. Utilization of these NOLs might be subject to various limitations such as the IRC Section 382 limitation and the 80% taxable income limitation. A full study of the NOL limitations has not been completed yet.\nThe earliest tax year which remains open to examination is 2019.\nThe Company used statutory blended tax rates of 28%, 11% and 33.58% for its deferred tax assets that arose in the US, Korea, and Japan respectively.\nDeferred tax assets consisted of the following as of September 30, 2022 and 2021:\nSCHEDULE OF DEFERRED TAX ASSETS\nNet Operating Losses $ 10,263,914 $ 7,770,229\nStock based compensation 5,775,567 4,926,021\nFixed assets and intangible assets 168,498 -\nTotal deferred tax assets $ 16,207,979 $ 12,696,250\nValuation Allowance $ (16,207,979 ) $ (12,696,250 )\nDeferred tax assets net of valuation allowance $ - $ -\n11. CONTINGENCIES\nFrom time to time, we may be subject to legal proceedings and claims in the ordinary course of business. The results of any future litigation cannot be predicted with certainty, and, regardless of the outcome, litigation can have an adverse impact on us because of defense and settlement costs, diversion of management resources, and other factors. Matters that are probable of unfavorable outcomes to us and which can be reasonably estimated are accrued. Such accruals are based on information known about the matters, our estimates of the outcomes of such matters and our experience in contesting, litigating and settling similar matters.\n12. SUBSEQUENT EVENTS\nResignation of Patrick Shearer as Chief Financial Officer\nOn November 2, 2022, Patrick Shearer notified the Company of his resignation as the Companys Chief Financial Officer. Mr. Shearers resignation will be effective as of January 4, 2023 (the Effective Date).\nAppointment of Shana Bowman as Interim Chief Financial Officer\nOn November 4, 2022, in connection with Mr. Shearers resignation as described above, Shana Bowman was appointed as the Companys Interim Chief Financial Officer, with such appointment to be effective on the Effective Date. Ms. Bowman will serve as the Companys principal financial officer and principal accounting officer on an interim basis.\nOn November 4, 2022, the Company and Ms. Bowman entered into that certain Second Amended and Restated Employment Agreement (the Employment Agreement), providing for Ms. Bowmans continued employment as the Controller until the Effective Date, and thereafter as Interim Chief Financial Officer. Pursuant to the Employment Agreement, commencing on the Effective Date, Ms. Bowman is entitled to an annual base salary of $185,000 (the Base Salary), with an annual target bonus opportunity equal to 20-30% of the Base Salary (Annual Bonus), the amount and terms of such Annual Bonus to be determined in the sole and absolute discretion of the Compensation Committee. The Employment Agreement provides for $15,000 of the Base Salary to be paid as of the date of the Employment Agreement. Ms. Bowman is also eligible to participate in any equity compensation plan of the Company and to receive future equity awards at the Compensation Committees discretion.\nAppointment of Marie Franklin as Senior Vice President of Sales and Marketing\nOn December 9, 2022, the Company appointed Marie Franklin to serve as the Companys Senior Vice President of Sales and Marketing, effective December 1, 2022 (the Employment Date). Pursuant to her employment agreement (the Franklin Employment Agreement), commencing on the Employment Date, Ms. Franklin is entitled to an annual base salary of $180,000. The Franklin Employment Agreement provides that Ms. Franklin will be entitled to receive an annual bonus for the fiscal year ended September 30, 2023 (Fiscal Year 2023) that includes (a) a cash component ranging from $12,000 to $100,000 and (b) a stock option component ranging from options to purchase 5,000 to 100,000 shares of the Companys common stock, each of which will be awarded, if at all, based upon achievement of a specified amount of gross revenue for Fiscal Year 2023, as calculated in accordance with GAAP. Ms. Franklin is also eligible to participate in any equity compensation plan of the Company and to receive future equity awards at the Compensation Committees discretion.\nStockholder Approval of Reverse Stock Split\nOn December 9, 2022, at a Special Meeting of Stockholders, the Companys stockholders approved a proposal granting the Board discretionary authority to file an amendment (the Certificate of Amendment) to the Companys Articles of Incorporation, as amended (the Articles), which amends the Articles to add a Section 1A to effect a reverse stock split of the Companys common stock, at any ratio from 1-for-10 to 1-for-50 at the Boards discretion. The Board intends to effect the 2022 Reverse Stock Split as soon as practicable.\nNew Operating Lease\nEffective December 1, 2022, we entered into a new operating lease for our principal executive office, which is located at 1350 East Arapaho Road, Suite #230, Richardson, Texas 75081. We lease the Richardson office on an annual basis, at a cost of $1,510 per month, through November 30, 2023."
}