{
    "cik": "1530425",
    "company": "Artisan Consumer Goods, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-10-12",
    "period_of_report": "2023-06-30",
    "sic": "1000",
    "state_of_inc": null,
    "state_location": "WA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1530425/0001477932-23-007594-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1530425/000147793223007594/arrt_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1530425/0001477932-23-007594.txt",
    "filename": "1530425_10K_2023_0001477932-23-007594.htm",
    "content": "ITEM 1. BUSINESS\nOrganization\nOn September 14, 2009, the Company was incorporated under the laws of the State of Nevada. Until the date of filing of this Annual Report on Form 10-K, we were engaged in the business of acquisition, exploration and development of natural resource properties. On April 17, 2018, under the laws of the State of Nevada, we changed our name from Lash, Inc. to Artisan Consumer Goods, Inc. On October 19, 2016, under the laws of the State of Nevada, we changed our name from Cassidy Ventures Inc. to Lash, Inc.\nAmber Joy Finney has served as our President and Chief Executive Officer, Treasurer and sole director since September 28, 2016. Ms. Finney is also the holder of 2,271,429 shares of our common stock, amounting to 51.6% of the issued and outstanding shares of our common stock. William Drury has served as our Secretary since February 19, 2013.\nWilliam Drury also served as our Treasurer and sole director from February 19, 2013, until September 28, 2016. Mr. Drury also served as our President from July 31, 2015 until September 28, 2016.\nAs of June 30, 2023, we were authorized to issue 500,000,000 shares of common stock, par value $.001 per share, and 25,000,000 shares of blank check preferred stock, par value $0.001 per share.\nOur independent auditor has issued an audit opinion which includes a statement raising substantial doubt as to our ability to continue as a going concern.\nOur Business - and Immediate Need for Financing\nOn July 15, 2021, we acquired the assets of Paleo Scavenger, LLC for $10,000. Paleo owns the Within / Without Granola (WWG) brand. The purchase price includes the WWG trademarks, brands, books, records, intellectual property, commercial sales channel, customer lists and manufacturing rights. Early in 2021, WWG ceased operations and we restarted the manufacturing process in June 2022.\nWe generated our first sales since inception during August 2022. We are currently selling our original and maple flavored granola products on Shopify. During February 2023, the inventory from the first run of the Within / Without Granola products expired and the remaining inventory was written off. The Company is searching for a new manufacturer to produce smaller batches of the Within / Without Granola products. As of October 12, 2023, a new manufacturer has not been engaged.\nWe must raise at least $100,000 to commence our plan of operation, described above, and fund our ongoing operational expenses. We have no assurance that future financing will materialize. If that financing is not available, we may be unable to continue our operations. Management believes that if we are successful in raising $100,000, we will be able to generate sales revenue within the following twelve months thereof. However, if such financing is not available, we could fail to satisfy our future cash requirements. We have no assurance that future financing will materialize. Management believes that if subsequent private placements are successful, we will be able to generate sales revenue within the following twelve months thereof. However, additional equity financing may not be available to us on acceptable terms or at all, and thus we could fail to satisfy our future cash requirements.\nIf we are unsuccessful in raising at least $100,000 through a private placement, we will then have to seek additional funds through debt financing, which would be highly difficult for a new, development stage business to obtain. Therefore, the Company is highly dependent upon the success of an anticipated private placement offering and failure thereof would result in the Company having to seek capital from other sources such as debt financing, which may not even be available to the Company. However, if such financing were available, because we are a development stage company with little in the way of operations to date, we would likely have to pay additional costs associated with high-risk loans and be subject to an above market interest rate. If and when these funds are obtained, management would evaluate the terms of such debt financing and determine whether the business could sustain operations and growth and manage the debt load. If we cannot raise additional proceeds via a private placement of our common stock or secure debt financing, we would be required to cease business operations and as a result, investors in our common stock would lose all of their investment.\nFacilities\nWe currently do not rent any real property or offices. Our current administrative business address is 999 N Northlake Way Ste 203, Seattle, Washington 98103-3442. We do not conduct any operations at such an address. The Company is looking for principal office space, appropriate for the Companys stage of development, in Gold Bar, Washington. ITEM 1A. RISK FACTORS\nRISKS RELATING TO OUR COMPANY\nAs a smaller reporting company (as defined in Rule 12b-2 of the Exchange Act), we are not required to provide the information called for by this Item 1A. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nOur current business address is 999 N Northlake Way Ste 203, Seattle, Washington 98103-3442. We do not conduct any operations at that address. Our telephone number is (206) 517-7141. ITEM 3. LEGAL PROCEEDINGS\nWe are not currently involved in any legal proceedings, and we are not aware of any pending or potential legal actions. ITEM 4. MINE SAFETY DISCLOSURES.\nNone.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY AND RELATED STOCKHOLDER MATTERS MARKET INFORMATION\nMARKET INFORMATION\nOur shares of common stock are quoted on the over-the-counter markets, currently on the OTC Pink tier of the OTC Markets Group, Inc. (the OTC Markets Group), under the stock symbol ARRT. As of October 12, 2023, the Company had 4,400,048 shares of common stock issued and outstanding, and we had approximately 28 holders of record of our common stock.\nDIVIDENDS\nHistorically, we have not paid any dividends to the holders of our common stock, and we do not expect to pay any such dividends in the foreseeable future as we expect to retain our future earnings for use in the operation and expansion of our business.\nTRANSFER AGENT\nOur transfer agent is Empire Stock Transfer of Henderson, Nevada. Their address is 1859 Whitney Mesa Dr., Henderson, Nevada 89014, whose telephone number is (702) 818-5898.\nRECENT SALES OF UNREGISTERED SECURITIES\nNone.\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS\nWe have not established any compensation plans under which equity securities are authorized for issuance.\nPURCHASES OF EQUITY SECURITIES BY THE REGISTRANT AND AFFILIATED PURCHASERS\nWe did not purchase any of our shares of common stock or other securities during the year ended June 30, 2023. ITEM 6. SELECTED FINANCIAL DATA\nAs a smaller reporting company, as defined in Rule 12b-2 of the Exchange Act, we are not required to provide the information called for by this Item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with our financial statements and the related notes that appear elsewhere in this annual report. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to such differences include those discussed below and elsewhere in this annual report on Form 10-K.\nOVERVIEW\nThe Company was incorporated in the State of Nevada on September 14, 2009 and has established a fiscal year end of June 30.\nCASH FLOWS\nOur financial statements are prepared using generally accepted accounting principles in the United States of America applicable to a going concern, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. We have not yet established an ongoing source of revenue sufficient to cover our operating costs. Our ability to continue as a going concern is dependent on our company obtaining additional capital to fund operating losses until we become profitable. If we are unable to obtain additional capital, we could be forced to significantly curtail or cease operations.\nWe have only realized nominal revenues from our business. In the next 12 months, we plan to identify business to whom we can license and/or distribute our brand and product(s) as well as seek additional opportunities to continue as a going concern.\nCRITICAL ACCOUTNING POLICIES\nPlease refer to Note 2 - Summary of Significant Accounting Policies in the accompanying Notes to the Consolidated Financial Statements.\nRESULTS OF OPERATIONS\nOverview. Artisan Consumer Goods, Inc. is a Nevada corporation, originally formed on September 19, 2009. We are attempting to restart the Within / Without Granola (WWG) brand acquired on July 15, 2021. We generated our first sales in August 2022. We generated sales of $7,648 and $-0- for the years ended June 30, 2023 and 2022, respectively. The Company has generated net losses of $42,825 and $38,537 for the years ended June 30, 2023 and 2022, respectively. The increase in net loss of $4,288 is attributable to the factors discussed below.\nRevenues. We had revenues of $7,648 and $-0- for the years ended June 30, 2023 and 2022, respectively. We had our first sales of our original and maple flavored granola products in August 2022. During February 2023, the inventory from the first run of the Within / Without Granola products expired. The Company is searching for a new manufacturer to produce smaller batches of the Within / Without Granola products. As of October 12, 2023, a new manufacturer has not been engaged.\nGross Margin. Once cost of revenue and other expenses to generate revenue are considered, we had reported gross margins of ($1,752) and $-0- for the years ended June 30, 2023 and 2022, respectively. The negative gross margin for the years ended June 30, 2023 resulted from the expiration of the Within / Without Granola inventory in February 2023.\nExpenses. For the years ended June 30, 2023 and 2022, respectively, we incurred total operating expenses of $41,102 and $30,297. The increase of $10,805 was primarily a result from our July 15, 2021 acquisition of the Within / Without Granola brand, which resulted in an approximate increase of $8,000 of general and administrative expenses and an approximate increase in professional fees of $3,000.\nOther Income (Expense). Our total other income (expense) was $29 and ($8,240) for the years ended June 30, 2023 and 2022, respectively. The increase of $8,269 was attributable to a $44 increase in other income related to the change in market value of shares issued to Mr. Drury but not yet sold (See Note 3 - Related Party Transaction in the accompanying notes to the financial statements) and an $8,225 inventory impairment charge during the year ended June 30, 2022.\nThe following table provides selected financial data about our company for the years ended June 30, 2023 and 2022.\nBalance Sheet Data\nJune 30,\nJune 30,\nCash\n$ 2,067\n$ 13,555\nTotal Assets\n$ 6,192\n$ 28,904\nTotal Liabilities\n$ 266,445\n$ 248,187\nShareholders Deficit\n$ (260,253 )\n$ (219,283 )\nGOING CONCERN\nArtisan Consumer Goods, Inc. currently has limited operations. The financial statements in Item 8, have been prepared on a going concern basis which assumes the Company will be able to realize its assets and discharge its liabilities in the normal course of business for the foreseeable future. The Company has generated minimal revenues and incurred a loss since inception resulting in an accumulated deficit of $19,258,251 at June 30, 2023 and further losses are anticipated in the development of its business raising substantial doubt about the Companys ability to continue as a going concern. The ability to continue as a going concern is dependent upon the Company generating profitable operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management intends to finance operating costs over the next twelve months with existing cash on hand, loans from directors and/or private placement of common stock. In addition, our independent auditor has issued an audit opinion for Artisan Consumer Goods, Inc. which includes a statement raising substantial doubt as to our ability to continue as a going concern.\nLIQUIDITY AND CAPITAL RESOURCES\nOur cash balance was $2,067 and working capital deficit was $264,378 at June 30, 2023. Total expenditures over the next 12 months are expected to be approximately $100,000. If we experience a shortage of funds prior to generating revenues from operations we may utilize funds from our directors, who have informally agreed to advance funds to allow us to pay for operating costs, however they have no formal commitment, arrangement or legal obligation to advance or loan funds to us. Management believes our current cash balance will not be sufficient to fund our operations for the next twelve months.\nAs at June 30, 2023, our total assets were $6,192 and were comprised of cash for $2,067, inventory for $-0-, intellectual property for $3,125 (net of accumulated amortization) and trademarks for $1,000. The intellectual property and trademarks resulted from our July 15, 2021 acquisition of the Within / Without Granola brand.\nAs at June 30, 2023, our current liabilities of $266,445 were comprised of accounts payable of $49,522, accrued liabilities for $48,257 and related party loans of $168,666. As at June 30, 2023, our stockholders deficiency was $260,253.\nCash Flows from Operating Activities\nWe have not generated positive cash flows from operating activities. Net cash used in operations was $35,938 and $25,678 for the years ended June 30, 2023 and 2022, respectively.\nCash Flows from Investing Activities\nFor the years ended June 30, 2023 and 2022, net cash flows used by investing activities was $-0- and $10,000, respectively, from our asset purchase of Within / Without Granola on July 15, 2021.\nCash Flows from Financing Activities\nFor the fiscal years ended June 30, 2023 and 2022, net cash flows provided by financing activities was $24,450 and $51,719, respectively from cash advances from our CEO.\nPLAN OF OPERATION\nOur plan of operation for the following twelve months is as follows:\nOn July 15, 2021, we acquired the assets of Paleo Scavenger, LLC for $10,000. Paleo owns the Within / Without Granola (WWG) brand. The purchase price includes the WWG trademarks, brands, books, records, intellectual property, commercial sales channel, customer lists and manufacturing rights. Early in 2021, WWG ceased operations and we restarted the manufacturing process in June 2022.\nWe generated our first sales since inception during August 2022. We are currently selling our original and maple flavored granola products on Shopify. During February 2023, the inventory from the first run of the Within / Without Granola products expired and the remaining inventory was written off. The Company is searching for a new manufacturer to produce smaller batches of the Within / Without Granola products. As of October 12, 2023, a new manufacturer has not been engaged.\nWe must raise at least $100,000 to commence our plan of operation, described above, and fund our ongoing operational expenses. We have no assurance that future financing will materialize. If that financing is not available, we may be unable to continue our operations. Management believes that if we are successful in raising $100,000, we will be able to generate sales revenue within the following twelve months thereof. However, if such financing is not available, we could fail to satisfy our future cash requirements. We have no assurance that future financing will materialize. Management believes that if subsequent private placements are successful, we will be able to generate sales revenue within the following twelve months thereof. However, additional equity financing may not be available to us on acceptable terms or at all, and thus we could fail to satisfy our future cash requirements.\nIf we are unsuccessful in raising at least $100,000 through a private placement, we will then have to seek additional funds through debt financing, which would be highly difficult for a new, development stage business to obtain. Therefore, the Company is highly dependent upon the success of an anticipated private placement offering and failure thereof would result in the Company having to seek capital from other sources such as debt financing, which may not even be available to the Company. However, if such financing were available, because we are a development stage company with little in the way of operations to date, we would likely have to pay additional costs associated with high-risk loans and be subject to an above market interest rate. If and when these funds are obtained, management would evaluate the terms of such debt financing and determine whether the business could sustain operations and growth and manage the debt load. If we cannot raise additional proceeds via a private placement of our common stock or secure debt financing, we would be required to cease business operations and as a result, investors in our common stock would lose all of their investment.\nOFF-BALANCE SHEET ARRANGEMENTS\nWe have no off-balance sheet arrangements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a smaller reporting company, as defined in Rule 12b-2 of the Exchange Act, we are not required to provide the information called for by this Item. ITEM 8. FINANCIAL STATEMENTS\nArtisan Consumer Goods, Inc.\nJune 30, 2023 and 2022\nIndex to the Financial Statements\nContents\nPage(s)\nReport of Independent Registered Public Accounting Firm (PCAOB: 5041)\nBalance Sheets at June 30, 2023 and 2022\nStatements of Operations for the years ended June 30, 2023 and 2022\nStatement of Changes in Stockholders Deficiency for the years ended June 30, 2023 and 2022\nStatements of Cash Flow for the years ended June 30, 2023 and 2022\nNotes to the financial statements\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Artisan Consumer Goods, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Artisan Consumer Goods, Inc. as of June 30, 2023 and 2022, the related statements of operations, stockholders' equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Company's ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/S/ BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Company's auditor since 2021\nLakewood, CO\nOctober 11, 2023\nARTISAN CONSUMER GOODS, INC.\nBalance Sheets\nJune 30,\nJune 30,\nAssets\nCurrent assets:\nCash\n$ 2,067\n$ 13,555\nInventory\n-\n8,224\nTotal current assets\n2,067\n21,779\nOther assets\nIntellectual property (net of accumulated amortization of $5,875 and $2,875)\nas of June 30, 2023 and 2022, respectively\n3,125\n6,125\nTrademarks\n1,000\n1,000\nTotal other assets\n4,125\n7,125\nTotal Assets\n$ 6,192\n$ 28,904\nLiabilities and Stockholders' Deficiency\nCurrent liabilities:\nAccounts payable\n$ 49,522\n$ 45,685\nAccrued expenses\n48,257\n48,286\nRelated party loans\n168,666\n154,216\nTotal current liabilities\n266,445\n248,187\nCommitments and contingencies\nStockholders' deficiency:\nPreferred stock, $0.001 par value; 25,000,000 shares authorized, -0- preferred stock shares issued and outstanding as of June 30, 2023 and 2022\n-\n-\nCommon stock, $0.001 par value, 500,000,000 shares authorized 4,400,048 issued and outstanding as of as of June 30, 2023 and 2022\n4,400\n4,400\nAdditional paid-in capital\n18,984,200\n18,984,200\nStock to be issued\n9,398\n7,543\nAccumulated deficit\n(19,258,251 )\n(19,215,426 )\nTotal stockholders' deficiency\n(260,253 )\n(219,283 )\nTotal Liabilities and Stockholders' Deficiency\n$ 6,192\n$ 28,904\nThe accompanying notes are an integral part of these financial statements.\nARTISAN CONSUMER GOODS, INC.\nStatements of Operations\nFor the Twelve Months Ended\nJune 30,\nJune 30,\nRevenue\n$ 7,648\n$ -\nCost of Revenue\n9,400\n-\nGross margin\n(1,752 )\n-\nOperating expenses:\nStock based compensation\n1,855\n1,470\nProfessional fees\n26,749\n24,071\nGeneral and administrative expenses\n9,498\n1,881\nAmortization expense\n3,000\n2,875\nTotal operating expenses\n41,102\n30,297\nNet operating income (loss)\n(42,854 )\n(30,297 )\nOther income (expense):\nOther income\n(15 )\nImpairment Expense\n-\n(8,225 )\nTotal Other income (expense)\n(8,240 )\nNet income (loss)\n$ (42,825 )\n$ (38,537 )\nBasic and diluted income (loss) per share\n$ (0.01 )\n$ (0.01 )\nWeighted average number of common\nshares outstanding - basic and diluted\n4,400,048\n4,400,048\nThe accompanying notes are an integral part of these financial statements.\nARTISAN CONSUMER GOODS, INC.\nStatements of Changes in Stockholders' Deficiency\nAdditional\nCommon\nTotal\nCommon Stock\nPreferred Stock\nPaid-In\nStock\nAccumulated\nStockholders'\nShares\nAmount\nShares\nAmount\nCapital\nTo Be Issued\nDeficit\nDeficiency\nBalance at June 30, 2021\n4,400,048\n$ 4,400\n-\n$ -\n$ 18,984,200\n$ 6,073\n$ (19,176,889 )\n$ (182,216 )\nStock based compensation\n1,470\n1,470\nNet loss\n(38,537 )\n(38,537 )\nBalance at June 30, 2022\n4,400,048\n$ 4,400\n-\n$ -\n$ 18,984,200\n$ 7,543\n$ (19,215,426 )\n$ (219,283 )\nStock based compensation\n1,855\n1,855\nNet loss\n(42,825 )\n(42,825 )\nBalance at June 30, 2023\n4,400,048\n$ 4,400\n-\n$ -\n$ 18,984,200\n$ 9,398\n$ (19,258,251 )\n$ (260,253 )\nThe accompanying notes are an integral part of these financial statements.\nARTISAN CONSUMER GOODS, INC.\nStatements of Cash Flow\nFor the Twelve Months Ended\nJune 30,\nJune 30,\nCash flows from operating activities:\nNet income (loss)\n$ (42,825 )\n$ (38,537 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nAmortization expense\n3,000\n2,875\nStock based compensation\n1,855\n1,470\nImpairment expense\n-\n8,225\nFair value adjustment for shares issued from settlement agreement (Note 3)\n(29 )\nChanges in operating assets and liabilities:\nInventory\n8,224\n(16,449 )\nAccounts payable\n(6,163 )\n13,336\nNet cash used in operating activities\n(35,938 )\n(29,065 )\nCash flows from investing activities:\nAsset purchase of Within / Without Granola\n-\n(10,000 )\nNet cash used in investing activities\n-\n(10,000 )\nCash flows from financing activities\nProceeds from related party advances\n24,450\n51,719\nNet cash provided by financing activities\n24,450\n51,719\nNet increase (decrease) in cash\n(11,488 )\n12,654\nCash - beginning of the year\n13,555\nCash - end of the year\n$ 2,067\n$ 13,555\nSupplemental disclosures:\nInterest paid\n$ -\n$ -\nIncome taxes\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements.\nArtisan Consumer Group, Inc.\nNotes to Financial Statements\nAs of June 30, 2023 and 2022\nNOTE 1 ORGANIZATION AND DESCRIPTION OF BUSINESS\nArtisan Consumer Goods, Inc. (the Company) was incorporated in the State of Nevada on September 14, 2009, and its year-end is June 30. The Companys principle executive office address is 999 N Northlake Way Ste 203, Seattle, Washington 98103-3442.\nThe Company had previously acquired mineral properties located in the Thunder Bay mining district, Province of Ontario, Canada but never determined whether these properties contain reserves that are economically recoverable. As of June 30, 2015, the Company ceased our exploration operations in the Thunder Bay mining district due to a lack of funds. As of September 30, 2018, the Company ceased pursuing all mining exploration.\nThe Company acquired the Within / Without Granola (WWG) brand on July 15, 2021 form Paleo Scavenger, LLC for $10,000. During June 2022, the Company restarted the manufacturing process for the Within / Without Granola products. The Company generated the first sales since inception during August 2022. The Company is currently selling the original and maple flavored granola products on Shopify. During February 2023, the inventory from the first run the Within / Without Granola products expired and the remaining inventory was written off. The Company is searching for a new manufacturer to produce smaller batches of the Within / Without Granola products. As of June 30, 2023, a new manufacturer has not been engaged.\nNOTE 2 SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe Companys audited consolidated financial statements have been prepared on an accrual basis of accounting, in conformity with accounting principles generally accepted in the United States of America (US GAAP).\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates. The Company provides estimates for its common stock valuations and valuation allowances for deferred taxes.\nCash Flow Reporting\nThe Company follows ASC 230, Statement of Cash Flows, for cash flows reporting, classifies cash receipts and payments according to whether they stem from operating, investing, or financing activities and provides definitions of each category, and uses the indirect or reconciliation method (Indirect method) as defined by ASC 230, Statement of Cash Flows, to report net cash flow from operating activities by adjusting net income to reconcile it to net cash flow from operating activities by removing the effects of (a) all deferrals of past operating cash receipts and payments and all accruals of expected future operating cash receipts and payments and (b) all items that are included in net income that do not affect operating cash receipts and payments.\nCash and Cash Equivalents\nThe Company considers all highly liquid debt instruments and other short-term investments with maturities of three months or less, when purchased, to be cash equivalents. There were no cash equivalents as of June 30, 2023.\nThe Company maintains its cash balance at one financial institution that is insured by the Federal Deposit Insurance Corporation.\nAccounts Receivable\nAccounts receivables are recorded at the invoiced amount and are stated net of an allowance for doubtful accounts. The allowance for doubtful accounts is the Companys best estimate of the amount of probable credit losses in the existing accounts receivable. The allowance is based on historical collection data and current franchisee information. Account balances are charged off against the allowance after all means of collection have been exhausted and the potential for recovery is considered remote. At June 30, 2023, no allowance for doubtful accounts was deemed necessary. The accounts receivable balance was $-0- at June 30, 2023 and 2022.\nInventory\nInventory is stated at the lower of cost (FIFO: first-in, first-out) or net realizable value. The cost of inventory includes the cost of raw materials and freight. During June 2022 the Company purchased its first inventory of the original and maple flavored products for $16,449. At June 30, 2022, it was determined the fair value of the inventory was overstated and the Company recorded an impairment charge of $8,225 at June 30, 2022. During February 2023, the inventory from the first run the Within / Without Granola products expired and the remaining inventory balance of $2,541 was written off. A new production run has not been scheduled. At June 30, 2023 and 2022, the Companys inventory was $-0- and $8,224, respectively.\nBasic Earnings (loss) per Share\nThe Company computes net income (loss) per share in accordance with ASC 260, Earnings per Share. ASC 260 specifies the computation, presentation and disclosure requirements for earnings (loss) per share for entities with publicly held common stock.\nBasic net earnings (loss) per share amounts are computed by dividing the net earnings (loss) by the weighted average number of common shares outstanding. Diluted earnings (loss) per share are the same as basic earnings (loss) per share due to the lack of dilutive items in the Company.\nShare Based Compensation\nThe Company accounts for share-based compensation in accordance with the fair value recognition provisions of the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) No. 718 and No. 505. The Company issues restricted stock to employees and consultants for their services. Cost for these transactions are measured at the fair value of the equity instruments issued at the date of grant. These shares are considered fully vested and the fair market value is recognized as an expense in the period granted. The Company recognized consulting expenses and a corresponding increase to additional paid-in-capital related to stock issued for services. For agreements requiring future services, the consulting expense is to be recognized ratably over the requisite service period. Stock based compensation amounted to $1,855 and $1,470 for the years ended June 30, 2023 and 2022, respectively.\nFair Value Measurements\nIn September 2006, the FASB issued ASC 820 which defines fair value, establishes a framework for measuring fair value, and expands disclosures about fair value measurements. The provisions of ASC 820 were effective January 1, 2008.\nAs defined in ASC 820, fair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (exit price). The Company utilizes market data or assumptions that market participants would use in pricing the asset or liability, including assumptions about risk and the risks inherent in the inputs to the valuation technique. These inputs can be readily observable, market corroborated, or generally unobservable. The Company classifies fair value balances based on the observations of those inputs. ASC 820 establishes a fair value hierarchy that prioritizes the inputs used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurement) and the lowest priority to unobservable inputs (level 3 measurement).\nThe three levels of the fair value hierarchy defined by ASC 820 are as follows:\nLevel 1 - Quoted prices are available in active markets for identical assets or liabilities as of the reporting date. Active markets are those in which transactions for the asset or liability occur in sufficient frequency and volume to provide pricing information on an ongoing basis. Level 1 primarily consists of financial instruments such as exchange-traded derivatives, marketable securities and listed equities.\nLevel 2 - Pricing inputs are other than quoted prices in active markets included in level 1, which are either directly or indirectly observable as of the reported date. Level 2 includes those financial instruments that are valued using models or other valuation methodologies. These models are primarily industry-standard models that consider various assumptions, including quoted forward prices for commodities, time value, volatility factors, and current market and contractual prices for the underlying instruments, as well as other relevant economic measures. Substantially all of these assumptions are observable in the marketplace throughout the full term of the instrument, can be derived from observable data or are supported by observable levels at which transactions are executed in the marketplace. Instruments in this category generally include non-exchange-traded derivatives such as commodity swaps, interest rate swaps, options and collars.\nLevel 3 - Pricing inputs include significant inputs that are generally less observable from objective sources. These inputs may be used with internally developed methodologies that result in managements best estimate of fair value.\nThe Company did not identify any assets or liabilities that are required to be adjusted on the balance sheet to fair value in accordance with ASC 825-10 as of June 30, 2023 and 2022.\nIncome Taxes\nThe Companys policy is to provide for deferred income taxes based on the difference between the financial statement and tax bases of assets and liabilities using enacted tax rates that will be in effect when the differences are expected to reverse. The U.S. Tax Cuts and Jobs Act (TCJA) legislation reduces the U.S. federal corporate income tax rate from 35.0% to 21.0% and is effective June 22, 2018 for the Company. On January 1, 2023, the U.S. federal corporate income tax increased from 21% to 28%.We did not provide any current or deferred U.S. federal income tax provision or benefit for any of the periods presented because we have experienced operating losses since inception. When it is more likely than not that a tax asset cannot be realized through future income the Company must allow for this future tax benefit. We provided a full valuation allowance on the net deferred tax asset, consisting of net operating loss carryforwards, because management has determined that it is more likely than not that we will not earn income sufficient to realize the deferred tax assets during the carryforward period.\nThe Company intends to file income tax returns in the U.S. federal tax jurisdiction and various state tax jurisdictions. The tax years for 2010 to 2018 remain open for examination by federal and/or state tax jurisdictions. The Company is currently not under examination by any other tax jurisdictions for any tax year.\nGoing Concern\nThese financial statements have been prepared on a going concern basis which assumes the Company will be able to realize its assets and discharge its liabilities in the normal course of business for the foreseeable future. The Company has generated minimal revenues and incurred a loss since inception resulting in an accumulated deficit of $19,258,251 at June 30, 2023 and further losses are anticipated in the development of its business raising substantial doubt about the Companys ability to continue as a going concern. The ability to continue as a going concern is dependent upon the Company generating profitable operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management intends to finance operating costs over the next twelve months with existing cash on hand, loans from directors and/or private placement of common stock.\nThere is no guarantee that the Company will be able to raise any capital through any type of offering.\nRecently Issued Accounting Standards\nThere have been no new accounting pronouncements during the years ended June 30, 2023 that we believe would have a material impact on our financial position or results of operations.\nNOTE 3 ACQUISITIION AND INTANGIBLE ASSETS\nOn July 15, 2021, the Company acquired the assets of Paleo Scavenger, LLC (Paleo) for $10,000. Paleo owns the Within / Without Granola (WWG) brand. The purchase price includes the WWG trademarks, brands, books, records, intellectual property, commercial sales channel, customer lists and manufacturing rights. WWG ceased operations in early 2021. The Company restated operation in June 2022 and reported the first sale of the granola products during August 2022.\nThe purchase price has been allocated to the net assets acquired based upon their estimated fair values as follows:\nWWG Trademark\n$ 1,000\nCommercial Sales Channel\n2,000\nCustomer List\n5,000\nOther Intellectual Property\n2,000\nTotal\n$ 10,000\nThe fair value of the Intangible assets: commercial sales channel, customer list and other intangible assets was calculated using the net present value of the projected gross profit to be generated over the next 36 months beginning on July 15, 2021 with quarterly amortization of $750. The WWG Trademark was deemed to have an indefinite life and will be evaluated for impairment on an annual basis. Amortization expense amounted to $3,000 and $2,875 for the years ended June 30, 2023 and 2022, respectively, in the accompanying statements of operations.\nProforma information has not been presented as it has been deemed immaterial.\nNOTE 4 RELATED PARTY TRANSACTIONS\nOn February 1, 2015, the Company entered into a 24-month consulting agreement extension with William Drury, an Officer of the Company and WICAWIBE LLC. Prior to subsequent termination, the agreement was to expire on January 31, 2017 and the monthly fee was $15,000. On September 28, 2016, Mr. Drury resigned as President and Treasurer of the Company. On September 29, 2016, a settlement agreement between Mr. Drury and the Company was signed which provides a payment of $50,000 in cash and $50,000 in the Companys common stock to release the Company from all possible claims of accrued salary, independent contractor fees, expense and cost owed to Mr. Drury and terminate the consulting agreement which was scheduled to expire on January 31, 2017. On October 2, 2016, Mr. Drury resigned as director and the Company accepted his resignation and ratified the settlement agreement dated September 29, 2016. According to the settlement agreement, $46,500 was paid directly to Mr. Drury on October 5, 2016 and the remaining $3,500 paid directly to an attorney for the legal fees related to the settlement agreement. The shares of the Companys common stock are issuable to Mr. Drury in increments of 3,571 shares. Mr. Drury will continue to be issued 3,571 until he is able to garner $50,000 by selling the shares in the over-the-counter market or an exchange (as defined under the securities act of 1933, as amended). On October 24, 2016, the Company issued 14,286 shares of the Companys common stock to Mr. Drury to partially settle the $50,000 common stock obligation. Those shares had a fair value of $3,200 at the date of issuance. This liability represents an unconditional obligation to issue a variable number of shares for a fixed monetary amount. The fair value of the shares issued to Mr. Drury but not yet sold are netted against the liability in the balance sheet. Subsequent adjustments to the fair value of the shares issued but not sold are recognized as an adjustment to the net liability and other income/expense until such time as the shares are sold. Mr. Drury has not sold these shares during the years ended June 30, 2023 and 2022. The Company recognized other income (expense) due to the marking of these shares to fair value subsequent to issuance and recognized $29 and ($15) for the years ended June 30, 2023 and 2022, respectively, in the accompanying statements of operations.\nSince September 2016, the Companys President, Amber Finney, advanced the Company $168,666 as a related party loan. The proceeds for these loans were used for working capital. As of June 30, 2023 and 2022, there are related party loans totaling $168,666 and $154,216, respectively. These advances are unsecured, due on demand and carry no interest or collateral.\nThe officers of the Company could become involved in other business activities as they become available. This could create a conflict between the Company and the other business interests. The Company has not formulated a policy for the resolution of such a conflict should one arise.\nNOTE 5 EQUITY TRANSACTIONS\nAs of June 30, 2023, there are 500,000,000 shares of common stock at par value of $0.001 per share authorized and 4,400,048 issued and outstanding and 25,000,000 shares of (blank check) preferred stock, par value $0.001 per share authorized and -0- shares issued and outstanding.\nNOTE 6 - INCOME TAXES\nThe Companys policy is to provide for deferred income taxes based on the difference between the financial statement and tax bases of assets and liabilities using enacted tax rates that will be in effect when the differences are expected to reverse. We did not provide any current or deferred U.S. federal income tax provision or benefit for any of the periods presented because we have experienced operating losses since inception. When it is more likely than not that a tax asset cannot be realized through future income the Company must allow for this future tax benefit. We provided a full valuation allowance on the net deferred tax asset, consisting of net operating loss carryforwards, because management has determined that it is more likely than not that we will not earn income sufficient to realize the deferred tax assets during the carryforward period.\nThe Company is not aware of any uncertain tax position that, if challenged, would have a material effect on the financial statements for the fiscal year ended June 30, 2023 or during the prior three years applicable under FASB ASC 740. We did not recognize any adjustment to the liability for uncertain tax position and therefore did not record any adjustment to the beginning balance of accumulated deficit on the balance sheet. All tax returns for the Company remain open for examination.\nThe provision for income taxes differs from the amount computed by applying the statutory federal income tax rate to income before provision for income taxes. The sources and tax effects of the differences for the periods presented are as follows:\nIncome tax provision at the federal statutory rate\n28 %\n21 %\nEffect on operating losses\n(28 )%\n(21 )%\nThe net deferred tax assets consist of the following:\nJune 30,\nJune 30,\nDeferred tax asset\n$ 5,392,310\n$ 4,035,239\nValuation allowance\n(5,392,310 )\n(4,035,239 )\nNet deferred tax asset\n$ -\n$ -\nNOTE 7 - SUBSEQUENT EVENTS\nThe Company evaluated all events or transactions that occurred after June 30, 2023 up through October 12, 2023. During this period, the Company did not have any material recognizable subsequent events. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nDISCLOSURE CONTROLS AND PROCEDURES\nUnder the supervision and with the participation of our management, including our principal executive officer and the principal financial officer, we are responsible for conducting an evaluation of the effectiveness of the design and operation of our internal controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as of the end of the fiscal year covered by this report. Disclosure controls and procedures means that the material information required to be included in our Securities and Exchange Commission (SEC) reports is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms relating to our company, including any consolidating subsidiaries, and was made known to us by others within those entities, particularly during the period when this report was being prepared. Based on this evaluation, our principal executive officer and principal financial officer concluded as of the evaluation date that our disclosure controls and procedures were not effective as of June 30, 2023.\nMANAGEMENTS ANNUAL REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nAs of June 30, 2023, management assessed the effectiveness of our internal control over financial reporting. The Companys management is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. Internal control over financial reporting is defined in Rule 13a-15(f) or 15d-15(f) promulgated under the Securities Exchange Act of 1934, as amended, as a process designed by, or under the supervision of, the Companys principal executive officer and the principal financial officer and effected by the Companys Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP in the United States of America and includes those policies and procedures that:\n·\nPertain to the maintenance of records that in reasonable detail accurately and fairly reflect our transactions and dispositions of our assets;\n·\nProvide reasonable assurance our transactions are recorded as necessary to permit preparation of our financial statements in accordance with GAAP, and that receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n·\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statement.\nIn evaluating the effectiveness of our internal control over financial reporting, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework. Based on that evaluation, completed only by Amber Joy Finney, our President and Chief Officer, Treasurer and sole director, who also serves as our principal executive officer, principal financial officer and principal accounting officer, Ms. Finney concluded that, as of June 30, 2023, such internal controls and procedures were not effective to detect the inappropriate application of US GAAP rules as more fully described below.\nThis was due to deficiencies that existed in the design or operation of our internal controls over financial reporting that adversely affected our internal controls and that may be considered to be material weaknesses.\nThe matters involving internal controls and procedures that our management considered to be material weaknesses under the standards of the Public Company Accounting Oversight Board were: (i) lack of a functioning audit committee due to a lack of a majority of independent members and a lack of a majority of outside directors on our board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (ii) inadequate segregation of duties consistent with control objectives; and (iii) ineffective controls over period end financial disclosure and reporting processes. The aforementioned material weaknesses were identified by our President and Chief Executive Officer, and sole Director, who also serves as our principal financial officer and principal accounting officer, in connection with the review of our financial statements as of June 30, 2023.\nManagement believes that the lack of a functioning audit committee and the lack of a majority of outside directors on our board of directors results in ineffective oversight in the establishment and monitoring of required internal controls and procedures, which could result in a material misstatement in our financial statements in future periods.\nCHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING.\nThere were no changes in the Companys internal control over financial reporting that occurred during the fourth quarter of the year ended June 30, 2023 that have materially affected, or that are reasonably likely to materially affect, the Companys internal control over financial reporting. ITEM 9B. OTHER INFORMATION.\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOur executive officers and directors and their respective ages as of June 30, 2023 are as follows:\nName\nAge\nPositions and Offices\nAmber Joy Finney\nPresident and Chief Executive Officer, Treasurer and director\nWilliam Drury\nSecretary\nThe directors named above will serve until the next annual meeting of the stockholders or until their respective resignation or removal from office. Thereafter, directors are anticipated to be elected for one-year terms at the annual stockholders meeting. Officers will hold their positions at the pleasure of the Board of Directors, absent any employment agreement, of which none currently exists or is contemplated.\nSet forth below is a brief description of the background and business experience of our executive officers and directors for the past five years.\nAMBER JOY FINNEY\nMs. Finney has served as our President and Chief Executive Officer, Secretary, Treasurer and director since September 28, 2016. From October 2012 until December 2016, Ms. Finney served as President of VoiceFlix, a Seattle-area based advertising and marketing company, which she had founded. In 2004, Ms. Finney obtained a BA degree from The Evergreen State College. Ms. Finneys experience in advertising, marketing and sales led to our conclusion that Ms. Finney should be serving as a member of our board of directors in light of our business and structure.\nWILLIAM DRURY\nMr. Drury has served as our secretary since February 19, 2013. Mr. Drury also served as our Treasurer and sole director from February 19, 2013, until September 28, 2016, and also served as our President from July 31, 2015 until September 28, 2016. Mr. Drury also serves as President and sole Director of Hub Deals Corp. Mr. Drury has over 19 years of executive level experience in a wide range of disciplines. Mr. Drury is President at General 3D Corp. Previously, Mr. Drury served as President of Quantum Genomics Corp., an international biochemical development business based in Paris, France. Mr. Drury has also served as Director of Production and Content Services at NewSight Corp., a software and hardware company that invents, manufactures, markets and sells auto stereoscopic LCD and Plasma displays and content. Prior to his time at NewSight, Mr. Drury was the Vice President of Production at VRex, a stereoscopic visualization technology company. At VRex, Mr. Drury designed, constructed, and staffed one of the first full time true 3D stereoscopic production facilities in the world, creating content for clients, such as, the United States Army, Merck, Merrill Lynch, and Pfizer. At VRex Mr. Drurys work was instrumental in the sale of VRex to the Malaysian Government for inclusion in their Cyber Jaya Technology Park. Mr. Drury holds degrees from Boston University and Baruch College. Mr. Drury is also a member of the boards of directors of Quantum Genomics Corporation, ICN Corporation and Global Oxygen Development Corp.\nTERM OF OFFICE\nAll directors hold office until the next annual meeting of the stockholders of the Company and until their successors have been duly elected and qualified. The Companys Bylaws provide that the Board of Directors will consist of no less than three members. Officers are elected by and serve at the discretion of the Board of Directors.\nDIRECTOR INDEPENDENCE\nOur board of directors is currently composed of one member, which director does not qualify as an independent director in accordance with the published listing requirements of the NASDAQ Global Market. The NASDAQ independence definition includes a series of objective tests, such as that the director is not, and has not been for at least three years, one of our employees and that neither the director, nor any of his or her family members has engaged in various types of business dealings with us. In addition, our board of directors has not made a subjective determination as to each director that no relationships exist which, in the opinion of our board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director, though such subjective determination is required by the NASDAQ rules. Had our board of directors made these determinations, our board of directors would have reviewed and discussed information provided by the directors and us with regard to each directors business and personal activities and relationships as they may relate to us and our management.\nCERTAIN LEGAL PROCEEDINGS\nNo director, nominee for director, or executive officer of the Company has appeared as a party in any legal proceeding material to an evaluation of his ability or integrity during the past five years.\nSIGNIFICANT EMPLOYEES AND CONSULTANTS\nOther than our officers and directors, we currently have no other significant employees.\nAUDIT COMMITTEE AND CONFLICTS OF INTEREST\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. The Board of Directors has not established an audit committee and does not have an audit committee financial expert, nor has the Board of Directors established a nominating committee. The Board is of the opinion that such committees are not necessary since the Company is an early exploration stage company and has only two directors, and to date, such directors have been performing the functions of such committees. Thus, there is a potential conflict of interest in that our directors and officers have the authority to determine issues concerning management compensation, nominations, and audit issues that may affect management decisions.\nThere are no family relationships among our directors or officers. Other than as described above, we are not aware of any other conflicts of interest with any of our executive officers or directors.\nCODE OF ETHICS\nThe Company has not adopted a code of ethics that applies to its principal executive officers, principal financial officer, principal accounting officer or controller, or persons performing similar functions. The Company has not adopted a code of ethics because it has only commenced operations. ITEM 11. EXECUTIVE COMPENSATION\nThe following tables set forth certain information about compensation paid, earned or accrued for services by our President and all other executive officers (collectively, the Named Executive Officers) in the fiscal years ended June 30, 2023 and 2022:\nSUMMARY COMPENSATION TABLE\nThe table below summarizes all compensation awarded to, earned by, or paid to our Officers for all services rendered in all capacities to us for the fiscal year ended as indicated:\nName and Principal Position\nYear\nSalary($)\nBonus($)\nStock\nAwards($)\nOption\nAwards($)\nNon-Equity\nIncentive\nPlan\nCompensation($)\nNonqualified\nDeferred\nCompensation($)\nAll Other\nCompensation($)\nTotal($)\nAmber Joy Finney (1)\nWilliam Drury (2)\n_____________\n(1)\nAppointed President and Chief Executive Officer, Treasurer and director on September 28, 2016.\n(2)\nAppointed Secretary on February 19, 2013. Appointed President on July 31, 2015, appointed Treasurer and director on February 19, 2013, and resigned as President, Treasurer and director September 28, 2016.\nNone of our directors have received monetary compensation since our inception through June 30, 2023. We currently do not pay any compensation to our directors serving on our board of directors.\nSTOCK OPTION GRANTS\nWe have not granted any stock options to the executive officers since our inception. Upon the further development of our business, we will likely grant options to directors and officers consistent with industry standards for junior mineral exploration companies.\nEMPLOYMENT AGREEMENTS\nThe Company is not a party to any employment agreement and has no compensation agreement with any of its officers and directors.\nDIRECTOR COMPENSATION\nThe following table sets forth director compensation as of June 30, 2023:\nFees\nNon-Equity\nNonqualified\nEarned\nIncentive\nDeferred\nPaid in\nStock\nOption\nPlan\nCompensation\nAll Other\nName\nCash\n($)\nAwards\n($)\nAwards\n($)\nCompensation\n($)\nEarnings\n($)\nCompensation\n($)\nTotal\n($)\nAmber Joy Finney (1)\n_____________\n(1)\nAppointed President and Chief Executive Officer, Treasurer and director on September 28, 2016. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table lists, as of June 30, 2023, the number of shares of common stock of our Company that are beneficially owned by (i) each person or entity known to our Company to be the beneficial owner of more than 5% of the outstanding common stock; (ii) each officer and director of our Company; and (iii) all officers and directors as a group. Information relating to beneficial ownership of common stock by our principal shareholders and management is based upon information furnished by each person using beneficial ownership concepts under the rules of the Securities and Exchange Commission. Under these rules, a person is deemed to be a beneficial owner of a security if that person has or shares voting power, which includes the power to vote or direct the voting of the security, or investment power, which includes the power to vote or direct the voting of the security. The person is also deemed to be a beneficial owner of any security of which that person has a right to acquire beneficial ownership within 60 days. Under the Securities and Exchange Commission rules, more than one person may be deemed to be a beneficial owner of the same securities, and a person may be deemed to be a beneficial owner of securities as to which he or she may not have any pecuniary beneficial interest. Except as noted below, each person has sole voting and investment power.\nThe percentages below are calculated based on 4,400,048 shares of our common stock issued and outstanding as of June 30, 2023. We do not have any outstanding warrant, options or other securities exercisable for or convertible into shares of our common stock.\nTitle of Class\nName and Address of\nBeneficial Owner (5)\nAmount and\nNature of\nBeneficial Ownership\nPercent of\nCommon Stock\n(1)\nCommon Stock\nAmber Joy Finney (2)\n2,271,426\n51.6\n%\nCommon Stock\nWilliam Drury (3)\n681,434\n15.5\n%\nCommon Stock\nJean Jacques Mariani (4)\n342,859\n7.8\n%\nAll directors and executive officers as a group (2 persons)\n2,952,860\n67.1\n%\n_____________\n(1)\nAs of June 30, 2023, we had 4,400,048 shares of common stock outstanding.\n(2)\nAppointed President and Chief Executive Officer, Treasurer and director on September 28, 2016.\n(3)\nAppointed Secretary on February 19, 2013. Appointed President on July 31, 2015, appointed Treasurer and director on February 19, 2013, and resigned as President, Treasurer and director September 28, 2016. 85,717 shares held by Wicawibe LLC, and 595,717 shares held by Gain Delight Trading Ltd.\n(4)\nAddress is unknown.\n(5)\nUnless otherwise noted, the address of each person listed is c/o Artisan Consumer Goods, Inc., 999 N Northlake Way Ste 203, Seattle, Washington 98103-3442. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS\nNone. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nFor the years ended June 30, 2023 and 2022, the total fees charged to the company for audit services, including quarterly reviews were $12,100 and $14,190 and for tax services and other services were $0 and $0, respectively.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULE\n(a) The following Exhibits, as required by Item 601 of Regulation SK, are attached or incorporated by reference, as stated below.\nNumber\nDescription\n3.1.1\nArticles of Incorporation (1)\n3.1.2\nCertificate of Amendment (2)\n3.1.3\nCertificate of Amendment (3)\n3.1.4\nCertificate of Amendment (4)\n3.1.5\nCertificate of Change (5)\n3.1.6\nCertificate of Amendment (6)\n3.2.1\nBylaws (1)\n31.1\nCertification of Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of Principal Executive Officer and Principal Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS *\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\n101.SCH *\nInline XBRL Taxonomy Extension Schema Document\n101.CAL *\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF *\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB *\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE *\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n104 *\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101).\n_________________\n(1)\nIncorporated by reference to the Registrants Form S-1 (File No. 333-176939), filed with the Commission on September 21, 2011.\n(2)\nIncorporated by reference to the Registrants Form 10-K (File No. 000-54838), filed with the Commission on October 15, 2013.\n(3)\nIncorporated by reference to the Registrants Form 10-K (File No. 000-54838), filed with the Commission on January 31, 2017.\n(4)\nIncorporated by reference to the Registrants Form 10-Q for the fiscal quarter ended September 30, 2016 (File No. 000-54838), filed with the Commission on February 1, 2017.\n(5)\nIncorporated by reference to the Registrants Form 10-K (File No. 000-54838), filed with the Commission on October 16, 2017.\n(6)\nIncorporated by reference to the Registrants Form 8-K (File No. 000-54838), filed with the Commission on May 23, 2018.\n____________\n* XBRL (Extensible Business Reporting Language) information is furnished and not filed or a part of a registration statement or prospectus for purposes of Sections 11 or 12 of the Securities Act of 1933, as amended, is deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, and otherwise is not subject to liability under these sections.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nARTISAN CONSUMER GOODS, INC.\n(Name of Registrant)\nDate: October 12, 2023\nBy:\n/s/ Amber Joy Finney\nName:\nAmber Joy Finney\nTitle:\nPresident and Chief Executive Officer (principal executive officer, principal financial officer, and principal accounting officer)"
}