{
    "cik": "1539778",
    "company": "RAYONT INC.",
    "filing_type": "10-K",
    "filing_date": "2022-12-29",
    "period_of_report": "2022-06-30",
    "sic": "8090",
    "state_of_inc": "NV",
    "state_location": "CA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1539778/0001493152-22-036734-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1539778/000149315222036734/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1539778/0001493152-22-036734.txt",
    "filename": "1539778_10K_2022_0001493152-22-036734.htm",
    "content": "ITEM 1. BUSINESS.\nHistory and Overview\nRayont Inc., formerly known as Velt International Group Inc. was incorporated in Nevada on February 7, 2011 under the name A & C United Agriculture Developing Inc. Our current principal executive office is located at 228 Hamilton Avenue, 3rd Floor, Palo Alto, California 94301.\nOn February 7, 2011, Andy Liu and Charlie Huang, two founders, driven by the sense of mission and duty to provide safe, high-quality and affordable vegetable products in China for her current and future generations, formed the company in state of Nevada, USA at 2011.\nOn March 13, 2017, Yidan (Andy) Liu and Jun (Charlie) Huang, the principal stockholders of the Company (Sellers), entered into a Stock Purchase Agreement (the Agreement) with Chin Kha Foo, the assignee of Choa-Jung Lee, and his assigns (the Buyers), pursuant to which, among other things, Sellers agreed to sell to the Buyers, and the Buyers agreed to purchase from Sellers, a total of 24,000,000 shares of Common Stock of the Company of record and beneficially by Sellers (the Purchased Shares). The Purchased Shares represented approximately 64% of the Companys issued and outstanding shares of Common Stock, resulting in a change of the control of the Company.\nThe Board of the Directors and shareholders approved the reverse split of the Companys issued and outstanding common stock whereby each twenty shares of common stock was converted into one share of common stock. The stock split became effective with the Financial Industry Regulatory Authority (FINRA) on May 21, 2018.\nOn November 19, 2018, the Companys principal shareholder, Mr. Chin Kha Foo (Mr. Foo), entered into a Stock Purchase Agreement (the SPA) to transfer 60% of the Companys issued and outstanding shares to Rural Asset Management Services, Inc., a Malaysian Labuan company (RAM). On December 14, 2018, RAM became the principal shareholder of the Company and Mr. Ali Kasa was appointed to be the Companys President, CEO, CFO, and Secretary of the Company due to the change in control of the Company. RAM is an equity investment company with portfolio of interest in biotechnology, healthcare, cancer treatment research and technology, ICT and Crypto Currency. RAM has invested in companies located in Malaysia, Australia and the USA.\nOn January 22, 2019, the Company entered into an Acquisition Agreement with THF Holdings Pty Ltd., an Australian corporation (THF) and Rural, pursuant to which the Company acquired 100% of the issued and outstanding capital stock of THF in exchange for 4,000,000 shares of Companys common stock, valued on January 22, 2019 at $1,000,000. THF is an Australian Cancer treatment and medical device company. Rural was the majority shareholder of THF. In March 2019, the acquisition of THF was completed and THF became a subsidiary of the Company. In addition, the acquisition was accounted for business combination under common control of Rural. This company was sold in September 3, 2022. THF has subsequently changed name to Rayont (Australia) Pty Ltd,\nOn September 7, 2019, FINRA approved name and trading symbol change. In addition to the name change the Company also commenced a significant change in corporate strategy and the future direction of the Company.\nOn September 30, 2020, pursuant to an Acquisition Agreement the Company acquired all of the issued and outstanding shares of Rayont International (Labuan) Inc (RIL), a Malaysian Offshore company as Exclusive Licensee of a Cancer Treatment technology for Sub-Sahara African Region. Under the agreement, Rayont acquired 100% of the outstanding shares of RIL in exchange for 25,714,286 shares of the Companys common stock valued at $1.8 Million based on the closing share price on the OTC Markets on September 29, 2020.\nRayont International (Labuan) Inc is an on offshore company incorporated in Labuan, Malaysia which offers attractive 3% tax on profit. The company is a clinical-stage life sciences company that holds the exclusive license for registering and commercializing Photosoft technology for treatment of all cancers across Sub-Sahara African region. The technology has already been licensed in Australia, New Zealand, China and Malaysia. The human clinical trial efforts have started in Australia and China conducted by Hudson Medical Institute, Australian.\nOn August 26, 2020, the Company established Rayont Technologies Pty Ltd. (Rayont Technologies) through Rayont (Australia) Pty Ltd. Rayont Technologies is an Australian corporation and Internet of Things specialist providing services such as end-to-end employee engagement and experience platform for businesses in Australia and globally. Rayont Technologies engages in providing customized digital learning based on real-life and practical situations and e-learning program. This company was sold on January 31, 2022.\nIn order to cope with rapid growth Rayont Technologies Pty Ltd entered an agreement on October 15, 2020 with Ms. Kayla Ranee Smith to purchase the assets of Workstar Tech (Aust) Pty Ltd for USD215,017.19 (AUD302,876.22) payable over 90 days upon Ms. Smith transferring the assets to Rayont Technologies Pty Ltd. This company was sold on January 31, 2022.\nOn December 23, 2020, Rayont Australia Pty Ltd, a wholly-owned subsidiary of Rayont Inc. (the Company), acquired all of the issued and outstanding capital stock of Prema Life Pty Ltd, an Australian company (Prema Life), from TheAlikasa (Australia) Pty Ltd, Prema Lifes sole shareholder. The acquisition of Prema Life was completed, and Prema Life became a subsidiary of the Company. Prema Life is a Hazard Analysis Critical Control Point (HACCP) certified manufacturer and supplier of functional foods and supplements, and of practitioner only naturopathic and homeopathic medicines. Prema Life produces an extensive range of products including proteins, green blends, sports nutrition, weight management and maintenance, and health and wellness products. This company was sold on September 1, 2022.\nOn December 23, 2020, pursuant to an Acquisition Agreement, Rayont Australia Pty Ltd, a wholly-owned subsidiary of Rayont Inc. (the Company), acquired all of the issued and outstanding capital stock of GGLG Properties Pty LTD, an Australian company (GGLG), from TheAlikasa (Australia) Pty Ltd, GGLGs sole shareholder (the Seller). The Seller is an affiliate of the Company and therefore the acquisition is being treated as a related party transaction. The purchase price is $605,920, which is a 10% discount of the total amount of GGLGs net tangible assets. The purchase price will be paid in six instalments after a $265,300 down payment. In the event an instalment payment is not paid timely, the Seller has agreed to accept shares of the Company valued at $0.87 per share. The price per share is based on a 20% discount of the average share price on the OTC Markets over the last 30 trading days.\nOn February 18, 2021 the Australian Foreign Investment Review Board approved the capital stock transferring of GGLG Properties Pty Ltd to the Rayont Australia Pty Ltd. On March 9, 2021, the parties agreed to amend the acquisition agreements for the GGLG Properties Pty Ltd and as per Board Resolution, the Company issued 710,713 shares of its common stocks in lieu of payment by Rayont Australia Pty Ltd of approximately $605,920 to TheAlikasa Pty Ltd as full and final payment for the acquisition of 100% of the issued and outstanding common stock of GGLG.\nGGLG Properties Pty Ltd is a special purpose company to hold the property asset of Rayont (Australia) Pty Ltd. Until the 28 June 2021, GGLG Properties Pty Ltd owned the property located at 11 Aldinga Street, Brendale, 4500 QLD, Australia which is the facility where Prema Life Pty Ltd operates. With the sale of property, GGLG Properties Pty Ltd has no real assets and operations hence, it has to reinvent itself and select a business activity to focus on. This company was sold on September 1, 2022.\nOn December 29, 2020, the Company incorporated Rayont Malaysia Sdn Bhd with a paid-up capital of $25 and on December 31, 2020 incorporated Rayont Technologies (M) Sdn Bhd with a paid-up capital of $25 from Rayont Malaysia Sdn Bhd to carry out its business activities in Malaysia. On February 5, 2021 Rayont Technologies (M) Pty Ltd entered into an Asset Purchase Agreement with Sage Interactive Sdn Bhd to purchase its assets in consideration of the payment of USD 105,000.00. These assets include software for remote learning, customer contracts, digital content and two key employees and one director. These assets will operate in Malaysia under Workstar trademark and operation shall be integrated with Rayont Technologies Australia to drive efficiency and scale of digital assets operations. Rayont Technologies (M) Sdn Bhd was sold on January 31, 2022.\nOn April 1, 2022 under the agreement Rayont Inc., through its wholly owned subsidiary No More Knots Holdings Pty Ltd, acquired 100% of the total outstanding shares and units of No More Knots Pty Ltd, No More Knots (Taringa) Pty Ltd and No More Knots (Newmarket) Pty Ltd in exchange for AUD3,000,000 (approximately USD 2,247,865) cash, payable in two tranches. The first trench of USD1,910,685 (AUD2,550,000) is paid on May 4, 2022 and the second tranche of USD337,180 (AUD450,000) is payable before or on January 31, 2023 if three conditions are met namely;\n1. Achievement of EBIDTA of USD500,000 (AUD700,000) by June 30, 2022.\n2. Former owner remain and transition the business until December 31, 2022.\n3. Complete the opening of new branch by December 31,2022.\nAs of June 30,2022 the business failed to meet the first condition so the amount of the USD110,000 (AUD150,000) has been deducted from the purchase price. The remaining conditions have been met by the vendor and as of December 28,2022 is unconditional and it has been agreed to be paid on 31 January 2023.\nNo More Knots is home to over 45 tertiary qualified therapists who specialise in Remedial Massage and Myotherapy\nAs of this filing date, the Company has not completed and file its Form 8K as required by the SEC rules and regulations. The Company is in the process of completing all necessary documentation for the Form 8K filling in due time\nOn May 14, 2022 Wonderfoods Retail Pty Ltd, a wholly owned subsidiary of Rayont (Australia) Pty Ltd, entered into an agreement with Jovestone Pty Ltd to purchase the business of Go Vita at Capalaba in consideration for USD6,918 (AUD10,000) and existing stock value at USD64,337 (AUD93,000) payable in three instalments. The total payment for the purchase of the business completed on August 17, 2022.\nOn June 29, 2022 Rayont (Australia) Pty Ltd (Asset Seller), Rayont International (L) Limited (License Seller) and Nova Medical Group Pty Ltd (Buyer) signed the Asset Sale Agreement for sale of Next Generation Photo Dynamic Therapy (NGPDT) License for Sub-Sahara Africa and its equipment for a consideration of USD3,500,000 where the consideration is split as follows:\n● License for Sub-Sahara Africa - USD 2,500,000\n● Equipment - USD 1,000,000\nAbout Rayont Inc\nRayont Inc is a Nevada USA company. Rayont operates in the personalized natural healthcare sector in USA and Australia.\nRayont uses scientific tools such as DNA, microbiome, iridology and other tests to personalize diagnoses, prescription and treatments of natural complementary and alternative medicine products, services and treatments to our patients in the markets we operate.\nRayont Inc Corporate Structure\nAs of June 30, 2022, the company group structure consisted of the following companies:\nRayont Inc Group Products and Services\nIn line with our purpose help people live healthy life. We offer our patients and clients the following products and services:\nComplementary and Alternative Medicine Contract Manufacturing\nNatural Vitality Australia is an Australian boutique contract manufacturer of innovative health foods and nutraceuticals. Natural Vitality Australia has been manufacturing quality health products for over 13 years as well as producing its own brand, Wonder Foods for over 30 years.\nWe are an experienced, certified organic processor with a wide range of organic ingredients on offer. Natural Vitality Australia specializes in functional foods, green blends, sports nutrition, weight management/maintenance and health and wellness products.\nNatural Vitality Australia offers a range of manufacturing options include powders, liquids, capsules, homeopathic, creams and ointments.\nhttps://nva.com.au\nPrescription Only Complementary Alternative Medicine\nNatura Prescriptum Medicina (NPM) is a brand of products that licensed naturopaths can prescribe to their patients. These products are manufactured at our own manufacturing facility and distributed via our distributors to pharmacies across Australia.\nWe have more than 2000 licensed naturopaths across Australia who carry our products and distribute it to their clients.\nhttps://premalifeaustralia.com/product/weight-support-drops/\nComplementary & Alternative Medicine E-Commerce\nhttps://wonderfoods.com.au is an e-commerce platform that offers functional food, supplements, complementary and alternative medicine products for those who seek to improve their health naturally.\nThe site offers consumers a range of products made from natural organic sources of products and delivered to customers across Australia.\nTelehealth Platform for Naturopaths\nhttp://healthscript.io is a platform for complementary and alternative health on demand. The platform enables consumers to find, consult and obtain prescription from licensed naturopaths online of from their phone.\nThe platform is an Australian platform for now with aspiration to become a global platform is available on website, android and IOS.\nThe prescriptions are digitally delivered to Premalife office and the delivered to patients with mail within 48 hours.\nHealth Education\nhttps://totalvita.com.au is FREE health literacy and education website for consumers globally. The articles are written by professional medical, allied health, naturopaths and other professionals.\nCosmetics\nhttps://www.rosanaturals.com/about/ is a cosmetic range of products sold under the brand rosa naturals. The products are manufactured at our factory and distributed online and through pharmacies across Australia. We recently acquired biomimmic skin care brand adding to our cosmetics brand. https://www.biomimicskincare.com\nRemedial Massage & Myotherapy\nhttps://nomoreknots.com.au is the largest Australian remedial massage & myotherapy offering a wide range of service to patients of various ages such as remedial massage, myotherapy, pregnancy massage, physio, osteopathy, and beauty therapy. The services are offered currently at Greenslopes, Taringa, Newmarket, and Ipswich. We are adding Clayfield as our fifth branch with aspiration to become not just an Australia wide player but a global brand.\nCompounding Pharmacy\nhttps://www.tuguncompounding.com.au is a Queensland based custom made compounding pharmacy. A growing network of practitioners across Australia supply their patients prescriptions to Tugun Compounding Pharmacy where they are fulfilled and custom made. The company has capabilities to produce a wide range of products including active ingredients, aesthetics and dermatology.\nSkin DNA Testing\nhttps://www.skindna.com.au is a proprietary Skin DNA testing platform and largest skin DNA profiling tool in the world. The company has its main\nMarketing and Sales\nIn order to become competitive in the private equity space, the Company has taken steps to establish a number of digital marketing channels namely:\n1) Websites. This is an effective marketing and branding tool for customers, employees and investors as well as the public educations. The Company has completed its website and updates it regularly. The following are some important websites that the Company has:\nCompany\nWebsite\nRayont Inc\nhttps://rayont.com\nWonder Foods Pty Ltd\nhttps://wonderfoods.com.au\nHealth Script Pty Ltd\nhttp://healthscript.io\nPrema Life Pty Ltd\nhttps://totalvita.com.au\nPrema Life Pty Ltd\nhttps://www.rosanaturals.com\nPrema Life Pty Ltd\nhttps://premalifeaustralia.com\nPrema Life Pty Ltd\nhttps://nva.com.au\nThe Skin DNA Pty Ltd\nhttps://www.skindna.com.au\nHealth Script Pty Ltd\nhttps://www.tuguncompounding.com.au\nNo More Knots Pty Ltd\nhttps://nomoreknots.com.au\nBiomimic Pty Ltd\nhttps://www.biomimicskincare.com\n2) Social media channels The Company has set up major social media channels such as Facebook, LinkedIn and Instagram for each brand. The Company has established YouTube channels for some of the brands. These social media channels are linked and integrated with the websites.\n3) Digital and traditional advertising. The marketing infrastructure enables the Company and its subsidiaries to conduct both digital and traditional advertising activities.\nIntellectual Property\nThe Company through its subsidiaries has acquired current trademarks, classes, countries registered and developed a number of intellectual properties in form of trademarks. The table below provides the list of expiry date for each trademark.\nOwner\nNumber\nTrade Mark (Words)\nClasses\nNarration\nRenewal Date\nPrema Life\nBio Research\nAll goods in this class, particularly pharmaceutical products\n22-August-2024\nPrema Life\nRadico Colour Me\nHair Colours\n18-June-2023\nPrema Life\nOliveheart\nDietary Food Supplement for Human Consumption\n19-June-2023\nPrema Life\nLitenup\nDietary food preparations for medical use (medical food); Dietary food supplements; Dietetic food supplements adapted for medical purposes; Dietetic foods adapted for medical purposes; Dietetic foods for medicinal purposes; Dietetic foodstuffs for medical purposes; Food supplements (dietary supplements); Food supplements for medical purposes\n24-February-2025\nPrema Life\nBlackAqua\nDietary supplemental drinks in nature of vitamin and mineral beverages, nutritionally fortified water; energy drinks (dietary supplements); mineral supplement for humans\n17-July-2025\nPrema Life\nPhysio-eze\nPain relieving creams\n05-August-2025\nPrema Life\nMacaroo\nDietary supplements; Herbal dietary supplements\n14-September-2025\nPrema Life\nMarineGreen Plus\nDietary food supplements; Dietary nutritional supplements; Dietary supplements; Herbal dietary supplements; Plant extracts (dietary supplements); Supplements (trace element) for foodstuffs for human consumption\n22-April-2026\nPrema Life\nFigalax\nDietary fiber; Dietary fibre; Dietary food supplements; Dietary protein supplements; Dietary supplements; Energy drinks (dietary supplements)\n04-May-2026\nPrema Life\nNPM\nBrand creation services\n05-April-2027\nPrema Life\nBio Activ\nBrand creation services\n05-April-2027\nPrema Life\nSun Ray Health & Botanicals\nBrand creation services\n05-April-2027\nPrema Bros\nPrema\nExtra-virgin olive oil; Fish in olive oil; Olive oil; Olive oil dip; Olive oil for food\nAril 2027\nComplementary and Alternative Medicine Manufacturing Industry\nMaintaining health and well-being has moved to the forefront of Australians minds as the COVID-19 epidemic has swept across the globe. This has led to a surge in consumer demand for health and wellbeing products in tandem with an increased awareness of naturopath remedies.\nTechnological advancement has lagged the industry average in the supplements sector, though projected growth and increased demand will force the industry to adapt and invest into technological and productive innovation.\nOverall, success in the vitamin and supplement industry is characterized by three attributes: low revenue concentration, high Asian demand and economies of scale.\nA well-positioned firm would optimally take advantage of these factors by expanding internationally and producing high volumes to minimize marginal costs and maximise profits before established players can collect a market share too large to appropriate.\nVitamin & Supplement Manufacturing Industry\nSource: https://www.grandviewresearch.com/industry-analysis/dietary-supplements-market\nVitamin and Supplement Manufacturing in Australia - Market Size 2007-2028\nSource: https://www.ibisworld.com/au/market-size/vitamin-supplement-manufacturing\nThe Vitamin & Supplement Manufacturing industry has grown at a faster rate than the Consumer Goods & Services sector in Australia.\nVitamin & Supplement Market Segmentation\nMajor Players in Australia\nNo\nIndustry Players\nDescription\nMarket Share\nBlackmore Ltd\nBlackmores Ltd is Australias leading natural health company. Founded by Maurice Blackmore, the company is listed on ASX and operates in Australia and globally. Blackmore has developed high quality products and services that deliver a more natural approach to health, based on our expertise in vitamins, minerals, herbs and nutrients.\n5.9%\nNature`s Care Pty Ltd\nNature`s Care Pty Ltd was founded in Sydney in 1990. The company manufactures and distributes health supplements throughout Australia and globally.\n6.9%\nPharmacare Laboratories Pty Ltd\nPharmacare Laboratories Pty Ltd is an Australian based natural health company that manufactures and distributes products across Australia and globally.\n5.7%\nKey Global Markets Overview\nGovernment Regulations\nCertain aspects of our business activities are regulated by different government regulations in different countries we operate. Given the nature of business operations of Rayont Inc and its subsidiaries, the laws and regulations application are:\n● The standards in the Australia New Zealand Food Standards Code are legislative instruments under the Legislation Act 2003. Most of products we manufacture and distribute are classifies as food in Australia and New Zealand.\n● Therapeutic Goods Administration (TGA) is Australias government authority responsible for evaluating, assessing and monitoring products that are defined as therapeutic goods. It regulates medicines, medical devices and biologicals to help Australians stay healthy and safe. A significant portion of products we manufacture and distribute as classified as medicine and hence require medical doctors prescriptions to be sold to consumers.\nEmployees\nAs of June 30, 2022, the Group of Rayont has 58 employees of which:\nCompany\nNumber of Employees\nPrema Life Pty Ltd\nNo More Knots Pty Ltd\nNo More Knots Holdings Pty Ltd\nNo More Knots (Taringa) Pty Ltd\nNo More Knots (Newmarket) Pty Ltd\nWonder Foods Retail Pty Ltd\nRayont (Australia) Pty Ltd\nRayont Inc\nTotal\nAll of whom performed operational, technical and administrative functions. No payroll will be paid to the employees from Rayont Inc before the Company generates net profits. We believe our future success will depend to a large extent on our continued ability to attract and retain highly skilled and qualified employees. We consider our employee relations to be good. None of these employees belong to labour unions. ITEM 1A. RISK FACTORS.\nNot Applicable to smaller reporting companies. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNot Applicable to smaller reporting companies. ITEM 2. PROPERTIES.\nOur executive office address is located at 228 Hamilton Avenue, 3rd Floor, Palo Alto, California 94301. The lease for this facility is $2,100 yearly. The other subsidiaries of the group operate in properties owns from the group or by lease as explained below:\n● Prema Life Pty Ltd owns the property located at 32 French Avenue, Brendale QLD 4500, Australia. This property was bought in June 28, 2021. It consists of 2720m2 land and Building 1760m2.\n● Rayont (Australia) Pty Ltd owns the property located at 900 Sandgate Road, Clayfield QLD, 4011, Australia. This property was bought in September 23, 2021. It consists of 607m2 land and Building 445m2.\n● Rayont Properties Pty Ltd owns two properties. The first is located at 85 Juliette St, Greenslopes (lot 272) QLD 4120, Australia. This property was bought in May 4, 2022. It consists of 405m2 land and Building 280m2. The second is located at 44 Marquis Street, Greenslopes (lot 280) QLD 4120, Australia. This property was bought in May 4, 2022. It consists of 405m2 land and Building 115m2.\n● No More Knots (Newmarket) Pty Ltd is lessee for the property located at 285-287 Enoggera Road, Newmarket, Qld, 4051, Australia. The lease for this facility is $57,441 yearly. Term of lease is for five years.\n● No More Knots (Taringa) Pty Ltd is lessee for the property located at 215 Moggill Road, Taringa QLD 4068, Australia. The lease for this facility is $57,911yearly. Term of lease is for five years.\n● Wonder Foods Retail Pty Ltd is lessee for the property located at Unit 6, 3986-3988 Pacific Highway, Loganholme QLD 4129, Australia. The lease for this facility is $46,671 yearly. Term of lease is for five years.\nWe believe that our facilities are suitable and adequate for their intended use. ITEM 3. LEGAL PROCEEDINGS.\nNone. ITEM 4. MINE SAFETY DISCLOSURES\nNot Applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket for Common Equity\nOur common stock is quoted on the OTC Market Pink Sheet (OTC PINK) under the symbol RAYT. The following table sets forth the high and low bid prices for our common stock for the two most recently completed fiscal years. Such prices are based on inter-dealer prices, without retail mark-up, markdown or commission, and may not necessarily represent actual transactions.\nFiscal 2019 Low High\nFirst Quarter $ 0.29 $ 0.34\nSecond Quarter $ 0.23 $ 0.75\nThird Quarter $ 0.20 $ 0.51\nFourth Quarter $ 0.33 $ 0.50\nFiscal 2020 Low High\nFirst Quarter $ 0.09 $ 0.50\nSecond Quarter $ 0.09 $ 0.51\nThird Quarter $ 0.05 $ 0.50\nFourth Quarter $ 0.07 $ 0.07\nFiscal 2021 Low High\nFirst Quarter $ 0.07 $ 1.45\nSecond Quarter $ 1.13 $ 2.65\nThird Quarter $ 1.50 $ 3.02\nFiscal 2022 Low High\nFirst Quarter $ 0.24 $ 2.98\nSecond Quarter $ 2.5 $ 2.74\nThird Quarter $ 0.44 $ 2.5\nFourth Quarter $ 0.8 $ 1.95\nPenny Stock Considerations\nThe trading of our common stock is deemed to be penny stock as that term is generally defined in the Securities Exchange Act of 1934 to mean equity securities with a price of less than $5.00. Our shares thus are subject to rules that impose sales practice and disclosure requirements on broker-dealers who engage in certain transactions involving a penny stock.\nUnder the penny stock regulations, a broker-dealer selling a penny stock to anyone other than an established customer or accredited investor must make a special suitability determination regarding the purchaser and must receive the purchasers written consent to the transaction prior to the sale, unless the broker-dealer is otherwise exempt. Generally, an individual with a net worth in excess of $1,000,000 or annual income exceeding $100,000 individually or $300,000 together with his or her spouse is considered an accredited investor. In addition, under the penny stock regulations the broker-dealer is required to:\n● Deliver, prior to any transaction involving a penny stock, a disclosure schedule prepared by the SEC relating to the penny stock market, unless the broker-dealer or the transaction is otherwise exempt;\n● Disclose commissions payable to the broker-dealer and our registered representatives and current bid and offer quotations for the securities;\n● Send monthly statements disclosing recent price information pertaining to the penny stock held in a customers account, the accounts value and information regarding the limited market in penny stocks; and\n● Make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written agreement to the transaction, prior to conducting any penny stock transaction in the customers account.\nBecause of these regulations, broker-dealers may encounter difficulties in their attempt to buy or sell shares of our common stock, which may affect the ability of selling stockholders or other holders to sell their shares in the secondary market and have the effect of reducing the level of trading activity in the secondary market. These additional sales practice and disclosure requirements could impede the sale of our common stock in the market place. In addition, the liquidity for our common stock may be decreased, with a corresponding decrease in the price of our common stock. Our shares are likely to be subject to such penny stock rules for the foreseeable future.\nCommon Stock Currently Outstanding\nAs of December 28, 2022, 50,163,797 shares were issued and outstanding.\nHolders\nAs of the date of this Report, we had approximately 587 stockholders of record of our common stock.\nDividends\nWe have not declared any cash dividends on our common stock since our inception and do not anticipate paying any dividends in the foreseeable future. We plan to retain future earnings, if any, for use in our business. Any decisions as to future payments of dividends will depend on our earnings and financial position and such other facts, as the Board of Directors deems relevant.\nReports to Stockholders\nWe are currently subject to the information and reporting requirements of the Securities Exchange Act of 1934 and will continue to file periodic reports, and other information with the SEC. We intend to send annual reports to our stockholders containing audited financial statements.\nTransfer Agent\nPacific Stock Transfer Company located at 6725 Via Austi Pkwy., Suite 300, Las Vegas, NV 89119 is the transfer agent for our common stock.\nRecent Sales of Unregistered Securities\nDuring July 1, 2021 to June 30, 2022, the Company sold 49,114 shares of common stock to 2 independent investors pursuant to a private placement; 16,614 shares at $2.21; 32,500 shares at $2.20 for a total amount of $108,217.\nThe Company relied upon Section 4(2) and Regulation S of the Securities Act of 1933, as amended, for the sale of these securities. No commissions were paid regarding the share issuance and the shares were issued in a book entry form with a Rule 144 restrictive legend.\nIssuer Purchases of Equity Securities\nNone\nAdditional Information\nCopies of our annual reports on Form 10−K, quarterly reports on Form 10−Q, current reports on Form 8−K, and any amendments to those reports, are available free of charge on the Internet at www.sec.gov. All statements made in any of our filings, including all forward-looking statements, are made as of the date of the document, in which the statement is included, and we do not assume or undertake any obligation to update any of those statements or documents unless we are required to do so by law. The reports are also available on our corporate website at https://www.rayont.com. Upon written or oral request, we will provide to each person, including any beneficial owner, a copy of any or all of such reports, at no cost. ITEM 6. SELECTED FINANCIAL DATA.\nNot Applicable to smaller reporting companies. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThis Annual Report contains forward-looking statements that describe managements beliefs and expectations about the future. We have identified forward-looking statements by using words such as anticipate, believe, could, estimate, may, expect, and intend, or words of similar import. Although we believe these expectations are reasonable, our operations involve a number of risks and uncertainties and actual results may be materially different than our expectations.\nOur Managements Discussion and Analysis contains not only statements that are historical facts, but also statements that are forward-looking. Forward-looking statements are, by their very nature, uncertain and risky. These risks and uncertainties include international, national, and local general economic and market conditions; our ability to sustain, manage, or forecast growth; our ability to successfully make and integrate acquisitions; new product development and introduction; existing government regulations and changes in, or the failure to comply with, government regulations; adverse publicity; competition; the loss of significant customers or suppliers; fluctuations and difficulty in forecasting operating results; change in business strategy or development plans; business disruptions; the ability to attract and retain qualified personnel; the ability to protect technology; the risk of foreign currency exchange rate; and other risks that might be detailed from time to time in our filings with the Securities and Exchange Commission.\nThe following discussion of our financial condition and results of operations should be read in conjunction with our financial statements and the related notes, and other financial information included in this Form 10-K.\nOverview\nRayont Inc. (formerly Velt International Group Inc., or Rayont or the Company) is a Nevada corporation formed on February 7, 2011. The Companys common stock are currently traded on the Over the Counter Pink Sheet under the symbol RAYT.\nOn November 19, 2018, the Companys former principal shareholder, Mr. Chin Kha Foo, entered into a stock purchase agreement to transfer 60% of the Companys issued and outstanding shares to Rural Asset Management Services, Inc., a Malaysian Labuan company (Rural). On December 14, 2018, Rural became the principal shareholder of the Company and Mr. Ali Kasa was appointed to be the Companys President, CEO, CFO, and Secretary due to the change in control of the Company. Rural is an equity investment company with portfolio of interest in biotechnology, healthcare, cancer treatment research and technology, ICT and Crypto Currency. Rural has invested to companies located in Malaysia, Australia and the USA.\nOn January 22, 2019, the Company entered into an acquisition agreement with THF Holdings Pty Ltd., an Australian corporation and Rural, pursuant to which the Company acquired 100% of the issued and outstanding capital stock of THF Holdings Pty Ltd. in exchange for 4,000,000 shares of the Companys common stock, valued on January 22, 2019 at $1,000,000. THF Holdings Pty Ltd. is an Australian Cancer treatment and medical device company. Rural is the majority shareholder of THF Holdings Pty Ltd. In March 2019, the acquisition of THF Holdings Pty Ltd. was completed and THF Holdings Pty Ltd. became a subsidiary of the Company. In addition, the acquisition was accounted for business combination under common control of Rural. On August 25, 2020, the name THF Holdings Pty Ltd. was changed to Rayont (Australia) Pty Ltd. (Rayont Australia). This company was sold on September 1, 2022.\nOn January 24, 2019, the Company entered into an acquisition agreement with THF International (Hong Kong) Ltd., a Hong Kong company (THF Hong Kong) and the shareholders of THF Hong Kong, pursuant to which the Company acquired 100% of the issued and outstanding capital stock of THF Hong Kong in exchange for 8,000,000 shares of the Companys common stock, valued at $2,000,000 on January 24, 2019. On May 13, 2019, the Company executed an amendment to the acquisition agreement, wherein the Company agreed to acquire only 85% of THF Hong Kong and reduce the purchase price to 6,800,000 shares from 8,000,000 shares. On August 4, 2019, the Company and the THF Hong Kong agreed to terminate the acquisition.\nOn January 24, 2019, the Company entered into an acquisition agreement with Natural Health Farm (Labuan) Inc. (NHF) and the shareholders of NHF, pursuant to which the Company acquired 100% of the issued and outstanding capital stock of NHF in exchange for 40,000,000 shares of the Companys common stock, valued at $10,000,000 on January 24, 2019. NHF is a Malaysian company concentrating on clinical life sciences and holds an exclusive license for registering and commercializing Photosoft technology for treatment of all cancers in the Sub-Sahara African region. The technology has been licensed in Australia, New Zealand, China, Malaysia and Sub-Sahara Africa. The human clinical trial efforts have started in Australia and China conducted by Hudson Medical Institute, Australia. On August 4, 2019, the Company and NHF agreed to terminate the acquisition.\nOn August 26, 2020, the Company established Rayont Technologies Pty Ltd. (Rayont Technologies) through Rayont Australia. Rayont Technologies is an Australian corporation and is engaged primarily in digital learning solutions to support the development of people skills that drive business growth. This company was sold on January 31, 2022.\nOn September 30, 2020, the Company acquired all of the issued and outstanding capital stock of Rayont International (L) Limited (Rayont International), a Malaysian company. The purchase price paid by the Company was 25,714,286 shares of its common stock valued at $1,800,000 or $0.07 per share, which was the closing price of the Companys common stock on the OTC Markets on September 29, 2020. Rayont International is a clinical-stage life sciences company that holds the exclusive license for registering and commercializing PhotosoftTM technology for treatment of all cancers across Sub-Sahara African region. The technology has been licensed in Australia, New Zealand, China, Malaysia and Sub-Sahara Africa. The exclusive license for License for Sub-Sahara Africa was sold on June 29, 2022 for the amount of USD 2,500,000 to the Nova Medical Group Pty Ltd.\nOn October 15, 2020, Rayont Technologies Pty Ltd entered into an agreement with Ms. Kayla Ranee Smith to purchase the assets of Workstar Tech (Aust) Pty Ltd for AUD 302,876.22 payable over 90 days upon Ms Smith transfers the assets to Rayont Technologies Pty Ltd. The assets that Rayont Technologies acquired under the agreement includes trademark, website, software, office assets. Rayont Technologies Pty Ltd was sold on January 31, 2022.\nOn December 23, 2020, Rayont Australia Pty Ltd, a wholly-owned subsidiary of Rayont Inc. (the Company), acquired all of the issued and outstanding capital stock of Prema Life Pty Ltd, an Australian company (Prema Life), from TheAlikasa (Australia) Pty Ltd, Prema Lifes sole shareholder. The acquisition of Prema Life was completed, and Prema Life became a subsidiary of the Company. Prema Life is a HACCP certified manufacturer and supplier of functional foods and supplements, and of practitioner only naturopathic and homeopathic medicines. Prema Life produces an extensive range of products including proteins, green blends, sports nutrition, weight management and maintenance, and health and wellness products. In addition, the acquisition was accounted for business combination under common control. The method of accounting for such transfers, as well as the acquisition of businesses, was similar to the pooling of interests method of accounting. Under this method, the carrying amount of net assets recognized in the balance sheets of each combining entity are carried forward to the balance sheet of the combined entity. The amount by which the proceeds paid by the Company differs from Prema Lifes historical carrying value of the acquired business is accounted for as a return of capital or contribution of capital. In addition, transfers of net assets between entities under common control were accounted for as if the transfer occurred from the date that the Company and the acquired business were both under the common control and had begun operations. Prema Life Pty Ltd was sold on September 1, 2022.\nOn December 23, 2020, pursuant to an Acquisition Agreement, Rayont Australia Pty Ltd, a wholly-owned subsidiary of Rayont Inc. (the Company), acquired all of the issued and outstanding capital stock of GGLG Properties Pty LTD, an Australian company (GGLG), from TheAlikasa (Australia) Pty Ltd, GGLGs sole shareholder (the Seller). The Seller is an affiliate of the Company and therefore the acquisition is being treated as a related party transaction. In addition, the acquisition was accounted for business combination under common control. The method of accounting for such transfers, as well as the acquisition of businesses, was similar to the pooling of interests method of accounting. Under this method, the carrying amount of net assets recognized in the balance sheets of each combining entity are carried forward to the balance sheet of the combined entity. The amount by which the proceeds paid by the Company differs from GGLG ‘s historical carrying value of the acquired business is accounted for as a return of capital or contribution of capital. In addition, transfers of net assets between entities under common control were accounted for as if the transfer occurred from the date that the Company and the acquired business were both under the common control and had begun operations. The purchase price is $605,920, which is a 10% discount of the total amount of GGLGs net tangible assets. The purchase price will be paid in six installments after a $265,300 down payment. In the event an installment payment is not paid timely, the Seller has agreed to accept shares of the Company valued at $0.87 per share. The price per share is based on a 20% discount of the average share price on the OTC Markets over the last 30 trading days.\nOn February 18, 2021 the Foreign Investment Review Board approved the capital stock transferring of GGLG Properties Pty Ltd to the Rayont Australia Pty Ltd. On March 9, 2021, the parties agreed to amend the acquisition agreements for the GGLG Properties Pty Ltd and as per Board Resolution, the Company issued 710,713 shares of its common stocks in leu of payment by Rayont Australia Pty Ltd of approximately $605,920 (AUD 800,000) to TheAlikasa Pty Ltd as full and final payment for the acquisition of 100% of the issued and outstanding common stock of GGLG. This company was sold on September 1, 2022.\nOn December 29, 2020, the Company incorporated Rayont Malaysia Sdn Bhd with a paid-up capital of $25 and Rayont Malaysia Sdn Bhd incorporated on December 31, 2020 Rayont Technologies (M) Sdn Bhd with a paid-up capital of $25 respectively to carry out its business activities in Malaysia. On February 5, 2021 Rayont Technologies (M) Pty Ltd entered into an Asset Purchase Agreement with Sage Interactive Sdn Bhd to purchase its assets in consideration of the payment of USD 105,000.00. These assets include software for remote learning, customer contracts, digital content and three key employees. These assets will operate in Malaysia under Workstar trademark and operation shall be integrated with Rayont Technologies Australia to drive efficiency and scale of digital assets operations. Rayont Technologies (M) Sdn Bhd was sold on January 31, 2022.\nOn April 1, 2022 under the agreement Rayont Inc., through its wholly owned subsidiary No More Knots Holdings Pty Ltd, acquired 100% of the total outstanding shares and units of No More Knots Pty Ltd, No More Knots (Taringa) Pty Ltd and No More Knots (Newmarket) Pty Ltd in exchange for AUD3,000,000 (approximately USD 2,247,865) cash, payable in two tranches. The first trench of USD1,910,685 (AUD2,550,000) is paid on May 4, 2022 and the second tranche of USD337,180 (AUD450,000) is payable before or on January 31, 2023 if three conditions are met namely;\n1. Achievement of EBIDTA of USD500,000 (AUD700,000) by June 30, 2022.\n2. Former owner remain and transition the business until December 31, 2022.\n3. Complete the opening of new branch by December 31,2022.\nAs of June 30,2022 the business failed to meet the first condition so the amount of the USD110,000 (AUD150,000) has been deducted from the purchase price. The remaining conditions have been met by the vendor and as of December 28,2022 is unconditional and it has been agreed to be paid on 31 January 2023.\nNo More Knots is home to over 45 tertiary qualified therapists who specialise in Remedial Massage and Myotherapy\nAs of this filing date, the Company has not completed and file its Form 8K as required by the SEC rules and regulations. The Company is in the process of completing all necessary documentation for the Form 8K filling in due time.\nOn May 14, 2022 Wonderfoods Retail Pty Ltd, a wholly owned subsidiary of Rayont (Australia) Pty Ltd, entered into an agreement with Jovestone Pty Ltd to purchase the business of Go Vita at Capalaba in consideration for USD6,918 (AUD10,000) and existing stock value at USD64,337 (AUD93,000) payable in three instalments. The total payment for the purchase of the business completed on August 17, 2022.\nOn June 29, 2022 Rayont (Australia) Pty Ltd (Asset Seller), Rayont International (L) Limited (License Seller) and Nova Medical Group Pty Ltd (Buyer) signed the Asset Sale Agreement for sale of Next Generation Photo Dynamic Therapy (NGPDT) License for Sub-Sahara Africa and its equipment for a consideration of USD3,500,000 where the consideration is split as follows:\n● License for Sub-Sahara Africa - USD 2,500,000\n● Equipment - USD 1,000,000\nAbout Rayont Inc\nRayont Inc is a Nevada USA company. Rayont operates in the personalized natural healthcare sector in USA and Australia.\nRayont uses scientific tools such as DNA, microbiome, iridology and other tests to personalize diagnoses, prescription and treatments of natural complementary and alternative medicine products, services and treatments to our patients in the markets we operate.\nResults of Operations\nFor the twelve months ended June 30, 2022 and 2021\nRevenue\nThere were $2,839,357 and $2,969,599 revenue generated for the twelve months ended June 30, 2022 and 2021, respectively. The revenues were attributable to revenues generated from digital learning solutions provided by Rayont Technologies in Australia, and the revenues generated from Prema Life, No More Knots, No More Knots (Taringa), No More Knots (Newmarket) and Wonder Foods in Australia. The Company continues looking for other opportunities which could potentially increase the profits of the Company.\nCost of Goods Sold\nThere were $1,456,733 and $1,221,026 cost of goods sold for the twelve months ended June 30, 2022 and 2021, respectively. The increase was attributable to costs incurred by Prema Life in Australia.\nOperating Expense\nOur operating expenses consist of selling, general and administrative expenses, depreciation and amortization expense.\nFor the twelve months ended June 30, 2022 and 2021, there were a total of $2,868,918 and $2,410,075 operating expenses, respectively. The increase was primarily due to the salary expenses incurred for the operating subsidiary, Rayont Technologies, the operating expenses generated from Prema Life as for the twelve months ended June 30, 2022, as well as the increase in the depreciation and amortization expense due to the existing and new intangible and tangible assets acquired. The Company recorded the amortization expense for intangible asset Exclusive license for registering and commercializing PhotosoftTM technology that was the biggest intangible asset of the Company.\nOther Income\nOther income was $2,370,877 and $953,709 for the twelve months ended June 30, 2022 and 2021, respectively. The increase was attributable to sale of the equipment for the cancer treatment in the amount of $385,361; to sale of the Next Generation Photo Dynamic Therapy (NGPDT) License for Sub-Sahara Africa in the amount of $ 1,071,430.59. Whilst, USD353,194 arose due to tax incentive/grant obtained in relation to approved research and development activities carried out. Other income is generated from the sale of the subsidiary Rayont Technologies Australia in the amount of $668,174 and $39,975 from the sale of Rayont Technologies in Malaysia. In addition, debt forgiven in the amount of $167,124. The amount of $314,382 is deducted from Other income as a result of the sale of two subsidiaries Rayont Technologies Malaysia and Rayont Technologies Australia in the consolidation of the financial statements of the group.\nThe amount of USD 298,418 was attributable to differences between seller and purchase price of the property that GGLG Properties Pty Ltd sold on June 29, 2021. On October 15, 2020, the Company entered into an agreement to purchase the assets of Workstar Tech (Aust) Pty Ltd, from an individual towards purchase of fair value of USD476,594.32 (AUD632,393) for purchase consideration of USD228,258.35 (AUD302,876). The income from this transaction is $244,376. Whilst, USD185,539 arose due to tax incentive/grant obtained in relation to approved research and development activities carried out. The amount of $225,376 was mainly due to tax incentive/grant obtained in relation to approved research and development activities carried out, due to ATO COVID19 Job Seeker, Cash Flow Boost incentives from Australian Government.\nNet Income (Loss)\nWe had a net income of $244,858 and of $ 383,884 for the twelve months ended June 30, 2022 and June 30, 2021 respectively based on the factors discussed above.\nLiquidity and Capital Resources\nAs of June 30, 2022 and As of June 30, 2021, the Company had working capital deficit of $83,884 and $1,456,964, respectively.\nThe deficit is attributable to loans due to a related party of $ 128,677 and $387,238, accounts payable of $384,355 and $99,615, accrued liabilities of $470,689 and $472,021, loan payable of $2,481,440 and $2,051,554, other payables of $278,800 and $209,712 and finance lease of $10,983 and $8,188, operating lease liabilities of $ 112,333 and $0 at June 30, 2022 and June 30, 2021, respectively.\nAs of June 30, 2022 and June 30, 2021, the Company had $3,783,393 and $1,771,364 in current assets, respectively.\nAs of June 30, 2022 and June 30, 2021, we had a cash and equivalents balance of $185,782 and $243,610, respectively. The Companys operations are primarily funded by the revenue, other income, proceeds received from the sale of common stock in private placements and loans received during those periods.\nCash Flows from Operating Activities\nNet cash used in operating activities was $169,145 for the twelve months ended June 30, 2022 compared with net cash used in operating activities of $187,493 for the twelve months ended June 30, 2021. During the twelve months ended June 30, 2022, the net cash used in operating activities was attributed to net income of $244,858, offset by depreciation and amortization expense of $485,830, non-cash portion of share based compensation for service of $61,500, gain on sale of assets of $1,456,792, gain on sale of investment of $310,277, debt waiver in the amount of $167,124 an decrease in accounts receivable of $335,759, an increase in inventory of $53,913, an increase in accounts payable of $307,322, an increase in accrued liabilities of $28,968, an increase in prepaid expense of $61,619, an decrease in other receivables of $160,024, an decrease in other assets of $14,639 and an increase in other payable of $241,680.\nDuring the twelve months ended June 30, 2021, the net cash used in operating activities was attributed to net loss of $383,884, offset by depreciation and amortization expense of $454,508, gain on sale of assets of $244,376 an increase in accounts receivable of $343,432, an increase in inventory of $152,984, an decrease in accounts payable of $9,454, an increase in accrued liabilities of $129,701, an increase in prepaid expense of $23,719, an decrease in advance to officer of $2,219, an increase in other assets of $46,788, a increase in other receivables of $322,358, an decrease in other payable of $14,694.\nCash Flows from Investing Activities\nNet cash used in investing activities was $5,229,238 for the twelve months ended June 30, 2022 compared with net cash used in investing activities of $1,845,552 for the twelve months ended June 30, 2021.\nDuring the twelve months ended June 30, 2022, the net cash used in investing activities was attributed to the purchases of intangible assets of $188,480, purchases of property and equipment of $3,191,324, acquisition of subsidiaries, net of cash and cash equivalents of $1,849,434.\nDuring the twelve months ended June 30, 2021, the net cash used in investing activities was attributed to the purchases of property and equipment of $1,720,498, purchases of intangible assets of $126,136, cash from acquisition of $1,082.\nCash Flow from Financing Activities\nWe generated cash in financing activities during the twelve months ended June 30, 2022 and 2021 of $5,334,858 and $2,031,580, respectively, from issuance of common stock in the amount of $108,217 and $701,988 respectively, proceeds from loan payable in the amount of $5,519,604 and $1,562,712, respectively, repayment to related party in the amount of $292,963 and $233,120, respectively.\nNon-Cash Investing and Financing Activities\nDuring the twelve months ended June 30, 2022, issuance of common stock for services in the amount of the $61,500, Issuance of common stock for Business acquisitions in the amount of $ 618,320, Issuance of common stock for acquisition of a property in the amount of $1,159,040.\nDuring the twelve months ended June 30, 2021, the related party debt in the amount of $ 2,016,363 was forgiven and recorded to additional paid in capital, issuance of common stock for business acquisitions in the amount of $1,800,000.\nEquity and Capital Resources\nWe have created income for the year ended June 30, 2022 and had an accumulated deficit of $3,634,943 as of June 30, 2022. As of June 30, 2022, we had cash of $185,782 and a working capital deficit of $83,884, compared to cash of $243,610 and a working capital deficit of $1,456,964 as of June 30, 2021.\nWe had material commitments for capital expenditures as of June 30, 2022. We expect our expenses will continue to increase during the foreseeable future as a result of increased operational expenses and the development of potential business opportunities. However, we do not anticipate that the Company will generate revenue sufficient to cover its planned operating expenses in the foreseeable future, and we are dependent on the proceeds from future debt or equity investments to sustain our operations and implement our business plan. If we are unable to raise sufficient capital, we will be required to delay or forego some portion of our business plan, which would have a material adversely effect on our anticipated results from operations and financial condition. There is no assurance that we will be able to obtain necessary amounts of additional capital or that our estimates of our capital requirements will prove to be accurate. As of the date of this Form 10-K, we did not have any commitments from any source to provide such additional capital. Even if we are able to secure outside financing, it may not be available in the amounts or the times when we require. Furthermore, such financing would likely take the form of bank loans, private placement of debt or equity securities or some combination of these. The issuance of additional equity securities would dilute the stock ownership of current investors while incurring loans, leases or debt would increase our capital requirements and possible loss of valuable assets if such obligations were not repaid in accordance with their terms.\nOff-Balance Sheet Arrangements\nUnder SEC regulations, we are required to disclose off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, such as changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. An off-balance sheet arrangement means a transaction, agreement or contractual arrangement to which any entity that is not consolidated with us is a party, under which we have:\n● Any obligation under certain guarantee contracts,\n● Any retained or contingent interest in assets transferred to an unconsolidated entity or similar arrangement that serves as credit, liquidity or market risk support to that entity for such assets,\n● Any obligation under a contract that would be accounted for as a derivative instrument, except that it is both indexed to our stock and classified in shareholder equity in our statement of financial position, and\n● Any obligation arising out of a material variable interest held by us in an unconsolidated entity that provides financing, liquidity, market risk or credit risk support to us, or engages in leasing, hedging or research and development services with us.\nWe do not have any off-balance sheet arrangements that we are required to disclose pursuant to these regulations. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nNot Applicable to smaller reporting companies. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nRAYONT INC. AND SUBSIDIARIES\nCONSOLIDATED FINANCIAL STATEMENTS\nAS OF JUNE 30, 2022 AND 2021\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 6723)\nConsolidated Balance Sheets as of June 30, 2022 and June 30, 2021\nConsolidated Statements of Operations and Comprehensive Loss for the twelve months ended June 30, 2022 and 2021\nConsolidated Statements of Stockholders Equity for the twelve months ended June 30, 2022 and June 30, 2021\nConsolidated Statements of Cash Flows for the twelve months ended June 30, 2022 and 2021\nNotes to Consolidated Financial Statements -F-30\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nThe Board of Directors and Stockholders of\nRayont Inc.\nHamilton Avenue\n3rd Floor\nPalo Alto, California 94301\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Rayont Inc. (the ‘Company) as of June 30, 2022 and 2021, and the related consolidated statements of operations and comprehensive income/(loss), stockholders equity, and cash flows for each of two years in the year ended of June 30, 2022 and 2021, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for each of two years in the year ended June 30, 2022 and 2021, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Companys current liabilities exceeded its current assets by $83,884 and had an accumulated loss of $3,634,943. Furthermore, the Company incurred a negative cash flow from operating activities of $169,145 during the year. These factors raise substantial doubt about its ability to continue as a going concern. Managements plans regarding those matters are described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to those charged with governance that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgements. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nReview of restriction imposed by bank covenants\nThe Company has a total loan payable of $7,293,415 and $2,233,833 as of June 30, 2022 and June 30, 2021, as disclosed in the consolidated financial statements, representing approximately 80% and 65% of the total groups liabilities for respective financial year.\nDuring the year, the subsidiaries of the group have obtained loans to re-finance its existing borrowings from private lenders and to finance the merger and acquisition of subsidiaries, the bank has imposed bank covenants and undertaking, including fulfillment of the financial ratio.\nOur audit procedures in this area included the following, among others:\na) Obtained and reviewed the bank offer letters and understanding the conditions imposed by the bank;\nb) Examined the managements assessment of the fulfilment of covenants imposed by the bank;\nc) Assessed the appropriateness of the managements evaluation of the breaches of covenants;\nd) Evaluated the adequacy of the evidence obtained and the appropriateness of loans classification;\ne) Assessed the adequacy of the disclosure in the financial statements.\nBusiness combination\nThe Company has a goodwill of $1,866,708 and $nil as of June 30, 2022 and June 30, 2021, as disclosed in the consolidated financial statements, representing 13% and -% of the total groups assets for respective financial year. The goodwill arises from the acquisition of subsidiaries during the financial year and the Company accounted these transactions as a business combination in accordance with the applicable standard. We identified this as the critical audit matter given to the magnitude and complexity of the goodwill recognition and measurement.\nOur procedures in this area included the following, among others:\na) Obtained understanding of terms and conditions of the acquisition as stipulated in the agreements;\nb) Evaluated the appropriateness of the accounting treatment in relation to the business combination;\nc) Evaluated the managements assessment and the judgement made in relation to the goodwill impairment test;\nd) Evaluated the adequacy of the evidence obtained and the appropriateness of the judgment made;\ne) Assessed the adequacy of the disclosure in the financial statements.\n/s/ JP CENTURION & PARTNERS PLT\nJP CENTURION & PARTNERS PLT\nWe have served as the Companys auditor since 2020.\nJP Centurion & Partners PLT (PCAOB: 6723)\nKuala Lumpur, Malaysia\nDecember 28, 2022\nRAYONT INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nJune 30, 2022 June 30, 2021\n(Audited) (Audited)\nASSETS\nCurrent Assets:\nCash and cash equivalents $ 185,782 $ 243,610\nAccounts receivables 172,705 534,525\nInventories 512,053 500,165\nPrepaid expense 81,008 23,933\nDue from related parties 66,016 15,881\nOther receivables 2,765,829 453,250\nTotal Current Assets 3,783,393 1,771,364\nNon-Current Assets:\nProperty and equipment, net 6,241,049 3,140,757\nIntangible assets - 2,245,231\nOther receivables 1,009,537 -\nGoodwill 1,866,708\n-\nRight of use asset 524,892 -\nOther assets 767,656 -\nTotal Non-Current Assets 10,409,842 5,385,988\nTOTAL ASSETS $ 14,193,235 $ 7,157,352\nLIABILITIES AND STOOCKHOLDERS EQUITY\nCurrent Liabilities:\nAccounts payable $ 384,355 $ 99,615\nAccrued liabilities 470,689 472,021\nDue to related parties 128,677 387,238\nLoan payable 2,481,440 2,051,554\nFinance lease payable 10,983 8,188\nOperating lease liabilities 112,333 -\nOther payables 278,800 209,712\nTotal Current Liabilities 3,867,277 3,228,328\nNon-Current Liabilities:\nFinance lease payable 7,812 19,669\nOperating lease liabilities 412,559 -\nLoan payable 4,811,975 182,329\nTotal Non-Current Liabilities 5,232,346 201,998\nTOTAL LIABILITIES $ 9,099,623 $ 3,430,326\nCOMMITMENTS AND CONTNGENCIES - -\nStockholders Equity:\nCommon stock, $0.001 par value; 500,000,000 shares authorized; 48,094,606 and 46,783,369 shares issued and outstanding as of June 30, 2022 and June 30, 2021, respectively $ 48,095 $ 46,784\nPreferred stock, $0.001 par value; 20,000,000 shares authorized; nil share issued and outstanding - -\nAdditional paid-in capital 8,939,829 6,996,198\nShares to be issued - 618,320\nAccumulated deficit (3,634,943 ) (3,879,801 )\nAccumulated other comprehensive loss (259,369 ) (54,475 )\nTOTAL STOCKHOLDERS EQUITY 5,093,612 3,727,026\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY $ 14,193,235 $ 7,157,352\nRAYONT INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME / (LOSS)\n(UNAUDITED)\nRestated\nYear ended\nJune 30, 2022\nYear ended\nJune 30, 2021\nRevenue $ 2,839,357 $ 2,969,599\nCost of Revenue (1,456,733 ) (1,221,026 )\nGross profit 1,382,624 1,748,573\nOperating expenses:\nSelling, general and administrative expenses 2,383,088 1,955,567\nDepreciation and amortization expense 485,830 454,508\nTotal operating expenses 2,868,918\n2,410,075\nOperating Loss (1,486,294\n) (661,502 )\nOther (expense) / income:\nInterest income - 141,756\nInterest expense (615,455 ) (50,079 )\nOther income, net 2,370,877 953,709\nTotal other income 1,755,422 1,045,386\nIncome before income taxes 269,128 383,884\nIncome tax expense (24,270\n) -\nNet income $ 244,858 $ 383,884\nOther comprehensive items\nForeign currency translation loss (204,894 ) (29,660 )\nTotal other comprehensive loss (204,894 ) (29,660 )\nTotal comprehensive income 39,964\n354,224\nLess: comprehensive income attributable to noncontrolling interest - -\nTotal Comprehensive income attributable to shareholders of the Company $ 39,964\n$ 354,224\nWeighted average shares, basic and diluted 47,896,069 37,769,100\nNet earnings per common share, basic and diluted $ 0.01 $ 0.01\nRAYONT INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\n(UNAUDITED)\nAccumulated\nAdditional Stock Stock\nOther\nCommon Stock Paid-In Subscriptions To Be Accumulated Comprehensive\nShares Amount Capital Receivable Issued Deficit Income / (Loss) Total\nFor the twelve months ended June 30, 2021\nBalance as of June 30, 2020 13,157,532 13,158 4,270,513 - - (4,263,685 ) (24,815 ) (4,829 )\nCommon Stock issued for business acquisition of a subsidiary under common control 25,714,286 25,714 48,670 - - - - 74,384\nCommon Stock issued for cash 7,911,551 7,912 694,076 - - - - 701,988\nAdjustments to additional paid in capital from acquisitions - - (33,423 ) - - - - (33,423 )\nDebt forgiveness - - 2,016,362 - - - - 2,016,362\nCommon Stock to be issued - - - - 618,320 - - 618,320\nForeign currency translation loss - - - - - - (29,660 ) (29,660 )\nNet income for the twelve months ended June 30, 2021 - - - - - 383,884 - 383,884\nBalance as of June 30, 2021 46,783,369 46,784 6,996,198 - 618,320 (3,879,801 ) (54,475 ) 3,727,026\nFor the twelve months ended June 30, 2022\nBalance as of June 30, 2021 46,783,369 46,784 6,996,198 - 618,320 (3,879,801 ) (54,475 ) 3,727,026\nCommon Stock issued for business acquisition of a subsidiary under common control 710,713 617,610 - (618,320 ) - - -\nCommon Stock issued for acquisition of a property 515,771 1,158,524 - - - - 1,159,040\nCommon Stock issued for services 35,639 61,464 - - - - 61,500\nCommon Stock issued for cash 49,114 108,168 - - - - 108,217\nAdjustments to additional paid in capital from acquisitions - - (2,135 ) - - - - (2,135 )\nForeign currency translation loss - - - - - - (204,894 ) (204,894 )\nNet income for the 12 months ended June 30, 2022 - - - - - 244,858 - 244,858\nBalance as of June 30, 2022 48,094,606 48,095 8,939,829 - - (3,634,943 ) (259,369 ) 5,093,612\nRAYONT INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(UNAUDITED)\nRestated\nYear ended\nJune 30, 2022\nYear ended\nJune 30, 2021\nOperating Activities:\nNet income $ 244,858 $ 383,884\nAdjustments to reconcile net income to net cash used in operating activities:\nNon-cash portion of share based compensation for service 61,500 -\nDepreciation and amortization expense 485,830 454,508\nGain on Disposal of Investments (310,277 ) -\nGain on sale of assets (1,456,792 ) (244,376 )\nDebt waiver by payable (167,124 ) -\nChanges in operating assets and liabilities:\nAccounts receivable 335,759 (343,432 )\nInventory (53,913 ) (152,984 )\nAccounts payable 307,322 (9,454 )\nAccrued liabilities 28,968 129,701\nPrepaid expense (61,619 ) (23,719 )\nAdvance to officer - 2,219\nOther assets 14,639 (46,788 )\nOther receivables 160,024 (322,358 )\nOther payable 241,680 (14,694 )\nNet cash used in operating activities (169,145 ) (187,493 )\nInvesting Activities:\nCash from acquisition - 1,082\nAcquisition of subsidiaries, net of cash and cash equivalents (1,849,434 ) -\nPurchases of intangible assets (188,480 ) (126,136 )\nPurchases of property and equipment (3,191,324 ) (1,720,498 )\nNet cash used in investing activities (5,229,238 ) (1,845,552 )\nFinancing Activities:\nRepayment to related party (292,963 ) (233,120 )\nProceeds from loan payable 5,519,604 1,562,712\nIssuance of common stock 108,217 701,988\nNet cash provided by financing activities 5,334,858 2,031,580\nEFFECT OF EXCHANGE RATE ON CASH 5,697 (10,939 )\nNet decrease in cash and cash equivalents (57,828 ) (12,404 )\nCash and cash equivalents at beginning of the period 243,610 256,014\nCash and cash equivalents at end of the period $ 185,782 $ 243,610\nSUPPLEMENTAL DISCLOSURE:\nInterest paid $ 609,959 $ 50,079\nIncome tax paid $ - $ -\nSUPPLEMENTAL DISCLOSURE FOR NONCASH INVESTING AND FINANCING ACITIVIES:\nIssuance of common stock for services $ 61,500 $ -\nIssuance of common stock for business acquisitions $ 618,320 $ 1,800,000\nIssuance of common stock for acquisition of a property $ 1,159,040 $ -\nForgiveness of debt $ - $ 2,016,362\nRAYONT INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION AND BUSINESS DESCRIPTION\nRayont Inc. (formerly Velt International Group Inc., or Rayont or the Company) is a Nevada corporation formed on February 7, 2011. Rayont uses scientific tools such as DNA, microbiome, iridology and other tests to diagnose and personalize the prescription of natural complementary medicine products, services and treatments to our patients in the markets we operate.\nGiven the acquisition of THF Holdings Pty Ltd and Rayont International (Labuan) Inc as well as the cancer treatment assets that the Company has invested on, Rayont has been focusing on commercializing these investments. The commercialization of the current assets for cancer treatment requires medical board approval for almost all of the countries subject to the license. Rayont has conducted the initial study to identify the requirements for obtaining the approvals for using PDT to treat cancer across different jurisdictions in Sub-Saharan Africa (SSA). The same PDT technology has been licensed in China, Australia and New Zealand. It is currently undergoing medical trials in Australia and China. The recent announcements show positive results that the technology works. The Company believes that it will take time before it can start commercializing these assets and start to generate revenues and operating profits. THF Holdings Pty Ltd has subsequently changed name to Rayont (Australia) Pty Ltd,\nOn August 26, 2020, the Company established Rayont Technologies Pty Ltd. (Rayont Technologies) through Rayont Australia. Rayont Technologies is an Australian corporation and IOT providing services such as end-to-end employee engagement and experience platform for businesses in Australia and globally.\nRayont Technologies Pty Ltd entered an agreement on October 15, 2020 with Ms. Kayla Ranee Smith to purchase the assets of Workstar Tech (Aust) Pty Ltd for AUD 302,876.22 payable over 90 days upon Ms Smith transfers the assets to Rayont Technologies Pty Ltd. Rayont Technologies Pty Ltd was sold in January 31, 2022.\nOn December 23, 2020, Rayont Australia Pty Ltd, a wholly-owned subsidiary of Rayont Inc. (the Company), acquired all of the issued and outstanding capital stock of Prema Life Pty Ltd, an Australian company (Prema Life), from TheAlikasa (Australia) Pty Ltd, Prema Lifes sole shareholder. The acquisition of Prema Life was completed, and Prema Life became a subsidiary of the Company. Prema Life is a HACCP certified manufacturer and supplier of functional foods and supplements, and of practitioner only naturopathic and homeopathic medicines. Prema Life produces an extensive range of products including proteins, green blends, sports nutrition, weight management and maintenance, and health and wellness products. In addition, the acquisition was accounted for business combination under common control. The method of accounting for such transfers, as well as the acquisition of businesses, was similar to the pooling of interests method of accounting. Under this method, the carrying amount of net assets recognized in the balance sheets of each combining entity are carried forward to the balance sheet of the combined entity. The amount by which the proceeds paid by the Company differs from Prema Lifes historical carrying value of the acquired business is accounted for as a return of capital or contribution of capital. In addition, transfers of net assets between entities under common control were accounted for as if the transfer occurred from the date that the Company and the acquired business were both under the common control and had begun operations. Prema Life Pty Ltd was sold on September 1, 2022.\nOn December 23, 2020, pursuant to an Acquisition Agreement, Rayont Australia Pty Ltd, a wholly-owned subsidiary of Rayont Inc. (the Company), acquired all of the issued and outstanding capital stock of GGLG Properties Pty LTD, an Australian company (GGLG), from TheAlikasa (Australia) Pty Ltd, GGLGs sole shareholder (the Seller). The Seller is an affiliate of the Company and therefore the acquisition is being treated as a related party transaction. In addition, the acquisition was accounted for business combination under common control. The method of accounting for such transfers, as well as the acquisition of businesses, was similar to the pooling of interests method of accounting. Under this method, the carrying amount of net assets recognized in the balance sheets of each combining entity are carried forward to the balance sheet of the combined entity. The amount by which the proceeds paid by the Company differs from GGLG ‘s historical carrying value of the acquired business is accounted for as a return of capital or contribution of capital. In addition, transfers of net assets between entities under common control were accounted for as if the transfer occurred from the date that the Company and the acquired business were both under the common control and had begun operations. The purchase price is $605,920, which is a 10% discount of the total amount of GGLGs net tangible assets. The purchase price will be paid in six installments after a $265,300 down payment. In the event an installment payment is not paid timely, the Seller has agreed to accept shares of the Company valued at $0.87 per share. The price per share is based on a 20% discount of the average share price on the OTC Markets over the last 30 trading days.\nOn February 18, 2021 the Foreign Investment Review Board approved the capital stock transferring of GGLG Properties Pty Ltd to the Rayont Australia Pty Ltd. On March 9, 2021, the parties agreed to amend the acquisition agreements for the GGLG Properties Pty Ltd and as per Board Resolution, the Company issued 710,713 shares of its common stocks in leu of payment by Rayont Australia Pty Ltd of approximately $605,920 (AUD 800,000) to TheAlikasa Pty Ltd as full and final payment for the acquisition of 100% of the issued and outstanding common stock of GGLG. This company was sold on September 1, 2022.\nOn December 29, 2020, the Company incorporated Rayont Malaysia Sdn Bhd with a paid-up capital of $25 and on December 31, 2020 was incorporated Rayont Technologies (M) Sdn Bhd with a paid-up capital of $25 from Rayont Malaysia Sdn Bhd to carry out its business activities in Malaysia. On February 5, 2021 Rayont Technologies (M) Pty Ltd entered into an Asset Purchase Agreement with Sage Interactive Sdn Bhd to purchase its assets in consideration of the payment of USD 105,000.00. These assets include software for remote learning, customer contracts, digital content and two key employees and one director. These assets will operate in Malaysia under Workstar trademark and operation shall be integrated with Rayont Technologies Australia to drive efficiency and scale of digital assets operations. Rayont Technologies (M) Sdn Bhd was sold in January 31, 2022.\nOn April 1, 2022 under the agreement Rayont Inc., through its wholly owned subsidiary No More Knots Holdings Pty Ltd, acquired 100% of the total outstanding shares and units of No More Knots Pty Ltd, No More Knots (Taringa) Pty Ltd and No More Knots (Newmarket) Pty Ltd in exchange for AUD3,000,000 (approximately USD 2,247,865) cash, payable in two tranches. The first trench of USD1,910,685 (AUD2,550,000) is paid on May 4, 2022 and the second tranche of USD337,180 (AUD450,000) is payable before or on January 31, 2023 if three conditions are met namely;\n1. Achievement of EBIDTA of USD500,000 (AUD700,000) by June 30, 2022.\n2. Former owner remain and transition the business until December 31, 2022.\n3. Complete the opening of new branch by December 31,2022.\nAs of June 30,2022 the business failed to meet the first condition so the amount of the USD110,000 (AUD150,000) has been deducted from the purchase price. The remaining conditions have been met by the vendor and as of December 28,2022 is unconditional and it has been agreed to be paid on 31 January 2023.\nNo More Knots is home to over 45 tertiary qualified therapists who specialise in Remedial Massage and Myotherapy\nAs of this filing date, the Company has not completed and file its Form 8K as required by the SEC rules and regulations. The Company is in the process of completing all necessary documentation for the Form 8K filling in due time.\nOn May 14, 2022 Wonderfoods Retail Pty Ltd, a wholly owned subsidiary of Rayont (Australia) Pty Ltd, entered into an agreement with Jovestone Pty Ltd to purchase the business of Go Vita at Capalaba in consideration for USD6,918 (AUD10,000) and existing stock value at USD64,337 (AUD93,000) payable in three instalments. The total payment for the purchase of the business completed on August 17, 2022.\nOn June 29, 2022 Rayont (Australia) Pty Ltd (Asset Seller), Rayont International (L) Limited (License Seller) and Nova Medical Group Pty Ltd (Buyer) signed the Asset Sale Agreement for sale of Next Generation Photo Dynamic Therapy (NGPDT) License for Sub-Sahara Africa and its equipment for a consideration of USD3,500,000 where the consideration is split as follows:\n● License for Sub-Sahara Africa - USD 2,500,000\n● Equipment - USD 1,000,000\nAbout Rayont Inc\nRayont Inc is a Nevada USA company. Rayont operates in the personalized natural healthcare sector in USA and Australia.\nRayont uses scientific tools such as DNA, microbiome, iridology and other tests to personalize diagnoses, prescription and treatments of natural complementary and alternative medicine products, services and treatments to our patients in the markets we operate.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (GAAP). The consolidated financial statements include the financial statements of the Company and its subsidiary. All significant inter-company balances and transactions have been eliminated on consolidation.\nUse of Estimates\nThe preparation of our consolidated financial statements and accompanying notes in conformity with GAAP requires us to make certain estimates and assumptions. Actual results could differ from those estimates.\nGoing Concern\nThe Companys current liabilities exceeded its current assets by $83,884 and had an accumulated loss of $3,634,943. Furthermore, the Company incurred a negative cash flow from operating activities of $169,145 during the year. These indicate adverse conditions that raise substantial doubt about the Companys ability to continue as a going concern. These adverse conditions are negative financial trends, specifically negative working capital, recurring operating losses, accumulated deficit and other adverse key financial ratios.\nThe Company generated revenues to cover its operating expense during the year ended June 30, 2022. The Company plans to continue obtaining funding from the majority shareholder and the President of the Company to support the Companys normal business operating. There is no assurance, however, that the Company will be successful in raising the needed capital and, if funding is available, that it will be available on terms acceptable to the Company.\nThe consolidated financial statements do not include any adjustments relating to the recoverability and classification of recorded assets, or the amounts and classification of liabilities that might be necessary in the event that the Company cannot continue as a going concern.\nConcentration of Risk\nThe Company maintains its cash in bank accounts which, at times, may exceed the federally insured limits. The Company has not experienced any losses in such accounts and believes it is not exposed to any significant credit risk on cash in bank.\nThere is one customer who accounted for 10% or more of the Companys accounts receivable for the year ended June 30, 2022 and there is one customer who accounted for 10% or more of the Companys accounts receivable for the year as of June 30, 2021.\nThere is no supplier who accounted for 10% or more of the Companys purchases nor with significant outstanding payables for the twelve months ended June 30, 2022 and 2021.\nFair Value of Financial Instruments\nThe carrying amounts of the Companys current financial assets and liabilities approximated their fair values due to the short maturities. The fair value of noncurrent financial assets and liabilities are determined based on the value of the discounted cash flows. The Company believes no material difference exists between the fair value and carry amounts of the noncurrent financial assets and liabilities\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents. As of June 30, 2022 and June 30, 2021, the Company had cash in bank of $ 185,782 and $243,610 respectively.\nIntangible assets\nIntangible assets for purchased are recognized and measured at cost upon acquisition and consist of the Companys exclusive license with various useful life.\nAs of June 30, 2022 and June 30, 2021, the Company had intangible assets of $0 and $2,245,231 respectively associated with Rayont Internationals exclusive license for registering and commercializing PhotosoftTM technology for treatment of all cancers across Sub-Sahara African region. The technology has been licensed in Australia, New Zealand, China, Malaysia and Sub-Sahara Africa which is sold on June 29, 2022. The other intangible assets are associated with trademark, website, software that Rayont Technologies Pty Ltd entered into an agreement on October 15, 2020 to purchase the assets of Workstar Tech (Aust) Pty Ltd. This company was sold on January 31, 2022. Intangible assets are not part of the balance sheets as of June 30, 2022 anymore.\nIn addition, on February 5, 2021 Rayont Technologies (M) Sdn Bhd entered into an Asset Purchase Agreement with Sage Interactive Sdn Bhd to purchase intangible assets include software for remote learning, customer contracts and digital content. As of June 30, 2021, the carrying amount of this asset is $100,625. This company was sold on January 31, 2022 and its intangible assets are not part of the balance sheets as of June 30, 2022.\nFor other intangible assets, company determined the useful life of the asset as 10 years and its amortized based on the useful life.\nThe Company tests for indefinite lived intangibles impairment in the fourth quarter of each year and whenever events or circumstances indicate that the carrying amount of the asset exceeds its fair value and may not be recoverable. In accordance with its policies, the Company performed a qualitative assessment of indefinite lived intangibles at June 30, 2022, and determined there was no impairment of indefinite lived intangibles.\nProperty and equipment\nProperty and equipment are carried at cost and, less accumulated depreciation. The cost of repairs and maintenance is expensed as incurred; major replacements and improvements are capitalized. When assets are retired or disposed of, the cost and accumulated depreciation are removed from the accounts, and any resulting gains or losses are included in income in the year of disposal. The Company examines the possibility of decreases in the value of property and equipment when events or changes in circumstances reflect the fact that their recorded value may not be recoverable.\nThe Companys property and equipment mainly consists of computer and laser equipment. Depreciation is computed using the straight-line method over the estimated useful lives of the assets, which range from 4-40 years.\nImpairment of Long-lived Assets\nThe Company reviews long-lived assets when changes in circumstances or event could impact the recoverability of the carrying value of the assets. Recoverability of long-lived assets is determined by comparing the estimated undiscounted cash flows related to the long-lived assets to their carrying value. Impairment is determined by comparing the present value of future undiscounted cash flows, or some other fair value measure, to the carrying value of the asset. For the years ended June 30, 2022 and June 30, 2021, no impairment of long-lived assets was indicated, and no impairment loss was recorded.\nRevenue Recognition\nRevenue is recognized upon transfer of control of promised products or services to customers in an amount that reflects the consideration we expect to be entitled to in exchange for those products and services. We enter into contracts that include products and services, which are generally capable of being distinct and accounted for as separate performance obligations. Revenue is recognized net of allowances for returns and any taxes collected from customers.\nThe Companys contracts with customers may include multiple performance obligations. Revenue relating to agreements that provide more than one performance obligation is recognized based upon the relative fair value to the customer of each performance obligation as each obligation is earned. The Company derives its revenues the follows:\nDigital Learning Solutions:\nRevenue from digital learning solutions is recognized when control has transferred to the customer which typically occurs when the service is completed or the delivery of the license to the customer.\nSale of Goods - Medicinal Supplements:\nRevenue from these sales is recognized when the entity has delivered the products to locations specified by its customers and the customers have accepted the products in accordance with the sales contract.\nProducts are sold to certain customers with volume discount and these customers also have the right to return within a reasonable time frame. Revenue from these sales is recorded based on the contracted price less the estimated volume discount and returns at the time of sale.\nEarnings / (Loss) Per Share\nBasic earnings per share is computed by dividing net income (loss) attribute to stockholders of common stock by the weighted-average number of common shares outstanding for the period. Diluted net earnings per share is computed by dividing net income / (loss) by the weighted average number of common shares outstanding plus equivalent shares.\nDiluted earnings per share reflects the potential dilution that could occur from common shares issuable through convertible notes and preferred stock when the effect would be dilutive. The Company only issued common stock and does not have any potentially dilutive instrument as of June 30, 2022 and 2021.\nTranslation of Foreign Currency\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the statement of operations.\nThe functional currency of the Company is the United States Dollars (US$) and the accompanying financial statements have been expressed in US$. In addition, the Companys Australian subsidiaries maintains its books and record in a local currency, Australian Dollars (AUD), which is functional currency as being the primary currency of the economic environment in which the entity operates. The Companys Malaysian subsidiaries maintain their books and record in US$.\nIn general, for consolidation purposes, assets and liabilities of its subsidiaries whose functional currency is not US$ are translated into US$, in accordance with ASC Topic 830-30, Translation of Financial Statement, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements of foreign subsidiary are recorded as a separate component of accumulated other comprehensive income.\nTranslation of amounts from the local currency of the Company into US$1 has been made at the following exchange rates for the respective years:\nSCHEDULE OF EXCHANGES RATE\nAs of and for the 12 months ended June 30,\nYear-end AUD : US$1 exchange rate 1.4482 1.3340\n12 months average AUD : US$1 exchange rate 1.3788 1.3484\nRecent Accounting Pronouncements\nManagement believes none of the recently issued accounting pronouncements will have a material impact on the consolidated financial statements.\nNOTE 3 - INVENTORIES\nAs of June 30, 2022 and June 30, 2021, inventories were composed of the following:\nSCHEDULE OF INVENTORIES\nJune 30, 2022 June 30, 2021\nRaw materials $ 187,140 $ 190,533\nWorking in progress 82,446 93,147\nFinished goods 242,467 216,485\nTotal inventories $ 512,053 $ 500,165\nNOTE 4 - PROPERTY AND EQUIPMENT, NET\nAs of June 30, 2022 and June 30, 2021, property and equipment consisted of the following:\nSCHEDULE OF PROPERTY AND EQUIPMENT, NET\nJune 30, 2022 June 30, 2021\nLand $ 2,982,738 $ 1,273,595\nBuilding 2,673,276 1,030,735\nLeasehold improvements 758,066 -\nLaser equipment - 1,302,073\nVehicle 27,445 29,794\nComputer equipment 7,378 18,248\nTotal 6,448,902 3,654,445\nLess: accumulated depreciation (207,853 ) (513,688 )\nTotal property and equipment, net $ 6,241,049 $ 3,140,757\nOn June 30, 2018, the Company purchased computers in the amount of $7,378.\nOn January 22, 2019, the Companys subsidiary, Rayont (Australia) Pty. Ltd, purchased the cancer treatment equipment for USD 1,239,008 (AUD1,736,966).\nOn June 26, 2020, the Companys subsidiary, GGLG Properties Pty Ltd, purchased a property located at 11 Aldinga Street Brendale QLD 4500, Australia for USD472,135 (AUD686,814). GGLG Properties Pty Ltd disposed this property on June 29, 2021 for USD693,403.\nOn May 4, 2022, Rayont Properties Pty Ltd (formerly known as GGLG Properties Pty Ltd) acquired two properties. First property is located at 85 Juliette St, Greenslopes (lot 272) QLD 4120 Australia and has a surface land of 405m2 and surface of building of 280m2. Its purchase price is USD1,643,327 (AUD2,300,000), excluding GST. The stamp duty of this property in the amount of USD90,198 (AUD130,625) it is capitalized too. It is used for operations of No More Knots Pty Ltd.\nSecond property is located at 44 Marquis Street, Greenslopes QLD 4120 Australia and has a surface land of 405m2 and surface of building of 115m2. Its purchase price is USD600,746 (AUD870,000), excluding GST. The stamp duty of this property in the amount of USD22,217 (AUD32,175) it is capitalized too. This property is rented to third parties and parking is used for No More Knots Pty Ltd.\nOn October 15, 2020, the Company entered into an agreement to purchase the assets of Workstar Tech (Aust) Pty Ltd, from an individual towards purchase of fair value of USD476,594.32 (AUD632,393) for purchase consideration of USD228,258.35 (AUD302,876). The company considered the gain on purchase of assets as an income in fiscal year ended June 30, 2021.\nThese assets include intangible assets like trademark, website, software in the amount of USD465,666.59 (AUD617,893) and tangible assets like office assets, computer contracts in the amount of USD10,927.73 (AUD14,500). This company was sold on January 31, 2022 and its assets are not part of the BS as of June 30, 2022.\nOn October 28, 2020, the Companys subsidiary obtained a Finance Lease for vehicle in the amount of $34,167 (AUD 44,880) from Australian Alliance Automotive Finance Pty Limited to assist the Company to meet its operating activities.\nOn June 28, 2021, the Companys subsidiary, Prema Life Pty Ltd, purchased a property which consist of 2720m2 land and 1760m2 building located at 32 French Avenue, Brendale QLD 4500, Australia for a total amount of USD2,304,330 excluding GST. The land cost is $1,273,595 and the building cost is $1,030,735. The purchase price of this property is paid totally by mortgage loans.\nIn addition, Prema Life has done leasehold improvements in the amount of $505,374 as of June 30, 2022.\nOn September 23, 2021, the Companys subsidiary, Rayont (Australia) Pty Ltd, purchased a new property located at 900 Sandgate Road, Clayfield QLD, 4011, Australia for USD1,159,040 excluding GST. The purchase price of this property is paid by issuing shares of Rayont Inc. In addition, the Company has received a loan to cover some fit-out expense and its interest is capitalized in the cost of this property. The policy that the Company has used for the capitalization of the interest is ASC835. Interest is capitalized during the period under which the asset is being prepared for its intended use. The purpose of this is to obtain a more accurate representation of the full costs incurred in acquiring or constructing the asset. The interest capitalized should be added to the cost of the asset on the balance sheet and, when the asset is used internally, amortized over the life of the asset. The amount of the interest capitalized is USD107,296 (AUD147,790). In addition, it is capitalized even the stamp duty of the property in the amount of USD52,654 (AUD72,525).\nNo More Knots (Taringa) Pty Ltd, the new company acquired on April 1, 2022, has done leasehold improvements in the amount of $249,723 as of June 30, 2022.\nNo More Knots (Clayfield) Pty Ltd, the company incorporated on January 19, 2022, has done leasehold improvements in the amount of $2,969.20 as of June 30, 2022.\nDuring the twelve months ended June 30, 2022 and 2021, the depreciation expenses were $167,592 and $131,903, respectively.\nNOTE 5 - INTANGIBLE ASSETS\nOn October 15, 2020, the Company entered into an agreement to purchase the assets of Workstar Tech (Aust) Pty Ltd, from an individual towards purchase of fair value of USD476,594.32 (AUD632,393) for purchase consideration of USD228,258.35 (AUD302,876). The company considered the gain on purchase of assets as an income in fiscal year ended June 30, 2021.\nThese assets include intangible assets like trademark, website, software in the amount of USD465,666.59 (AUD617,893) and tangible assets like office assets, computer contracts in the amount of USD10,927.73 (AUD14,500). This company was sold on January 31, 2022 and its assets are not part of the balance sheets as of June 30, 2022\nAmortization is computed using the straight-line method over the 10-year estimated useful lives of the assets.\nOn February 5, 2021 Rayont Technologies (M) Pty Ltd entered into an Asset Purchase Agreement with Sage Interactive Sdn Bhd to purchase its assets in consideration of the payment of USD 105,000.00. These assets include software for remote learning, customer contracts and digital content. This company was sold on January 31, 2022 and its assets are not part of the balance sheets as of June 30, 2022.\nAmortization is computed using the straight-line method over the 10-year estimated useful lives of the assets.\nThe Company had evaluated the useful life of 10 years from 2018 for the intangible assets of $2,000,000, which is associated with Rayont Internationals exclusive license for registering and commercializing PhotosoftTM technology for treatment of all cancers across Sub-Sahara African region. The technology has been licensed in Australia, New Zealand, China, Malaysia and Sub-Sahara Africa. This license was sold on June 29, 2022 and is not part of the balance sheets as of June 30, 2022\nAs of June 30, 2022 and June 30, 2021, intangible assets, consisted of the following:\nSCHEDULE OF INTANGIBLE ASSETS\nJune 30, 2022 June 30, 2021\nExclusive license for registering and commercializing PhotosoftTM technology $ - $ 2,000,000\nTrademark, website, software - 568,188\nTotal - 2,568,188\nLess: accumulated amortization - (322,957 )\nTotal intangible assets, net $ - $ 2,245,231\nFor the twelve months ended June 30, 2022 and 2021, the amortization expenses were $318,238 and $322,605, respectively.\nNOTE 6 - ACCOUNTS PAYABLE\nAccounts payable are amounts billed to the Company by suppliers for goods and services in the ordinary course of business. All amounts have short-term repayment terms and vary by supplier.\nAs of June 30, 2022 and June 30, 2021, the Company had outstanding balances of $384,355 and $99,615 related to the accounts payable.\nNOTE 7 - LOAN PAYABLE\nAs of June 30, 2022 and June 30, 2021, loans payable, consisted of the following:\nSCHEDULE OF LOAN PAYABLE\nCurrent loan payable: June 30, 2022 June 30, 2021\nMortgage loan $ 450,405 $ 2,046,477\nCOVID-19 loan - 5,077\nLoan - Mazars (Quickfee) 45,032 -\nNote payable -1800 Diagonal 172,200 -\nLydia Loh Holdings Loan 1,035,769 -\nLoan - Trevor Townsend 414,307 -\nHP Liability - Label Applicator 3,296 -\nAttvest Insurance Loan 25,430 -\nLoan - Biz Cap 306,804 -\nLoan Kelly Townsend 28,198 -\nTotal current loan payable $ 2,481,440 $ 2,051,554\nNon-current loan payable:\nMortgage loan 4,811,975 182,329\nTotal non-current loan payable: $ 4,811,975 $ 182,329\nTotal loan payable $ 7,293,415 $ 2,233,883\nMortgage loan\nOn June 26, 2020, the Companys subsidiary obtained a mortgage loan of $453,713 (AUD 660,000) from two private lenders Oliver Fleming Pty Ltd as Trustee and Oliver John Fleming to assist the Company to buy the land of the business place. The term of the loan is one year from the commencement date, and the interest rate is 10% per annum. Monthly payments are compound just from interest in the amount of $ 4,108 (AUD 5,500). The loan is secured under the Companys present and future property of any kind, including all personal property. The principal amount is paid in the end of the term, on June 26, 2021.\nOn June 28, 2021, the Companys subsidiary purchased a property which consist of 2720m2 land and building 1760m2. Since the intention was to settle the property prior to June 30, 2021as per the Sale & Purchase Contract, the liability of the loan had to be recognized, even though the agreement date of the loans for this property is on August 6, 2021 and on September 1, 2021. This transaction is an adjusting event for the balance sheet at June 30, 2021. The Companys subsidiary obtained on August 6, 2021 a mortgage loan of $ 1,746,920 (AUD 2,380,000) from private lender COE Property Group Pty Ltd to assist the Company to buy the property of the business place. This loan is divided in two tranches. The term of the loan is one year from the commencement date for the first tranche in the amount of $ 1,490,020 (AUD 2,030,000), the interest rate is 9% per annum and for the second tranche in the amount of $ 256,900 (AUD 350,000), the term of the loan is 4 months from the commencement date and the interest rate is 36% per annum. Monthly payments are compound just from interest in the amount of $ 11,175 (AUD 15,225) for first tranche and interest in the amount of $ 7,707 (AUD 10,500) for the second tranche. The loan is secured under the Companys present and future property of any kind, including all personal property. The principal amount will be paid in the end of the term, December 6, 2021 for second tranche and August 5, 2022 for first tranche. Both tranches are paid on May 4, 2022.\nThe Companys subsidiary obtained on September 1, 2021 a mortgage loan of $ 257,915 (AUD 350,000) from private lender RDS Superannuation Pty Ltd as Trustee for The Ron Bruce Motor Trimmers Pty Ltd to assist the Company to buy the property of the business place. The term of the loan is two months from the commencement date, and the interest rate is 18% per annum. Monthly payments are compound just from interest in the amount of $ 3,869 (AUD 5,250). The loan is secured under the Companys present and future property of any kind, including all personal property. The principal amount is paid in the end of the term, October 15, 2021.\nOn May 4, 2022 some subsidiaries of the group in Australia received loans from Commonwealth Bank as described below:\nPrema Life Pty ltd received a loan in the amount of USD2,500,750 (AUD3,500,000). The loan term is five years with a variable rate of 3.16% per annum. This loan is received to refinance the 23 Frech property of Prema (to pay loans received earlier for this property like COE, James Lee and QRIDA). This is a secured loan.\nRayont (Australia) Pty Ltd received a loan in the amount of USD250,075 (AUD350,000). The loan term is three years with a variable rate of 3.50% per annum. This loan is received to extinguish private lenders secured over 900 Sandgate property. This is a secured loan.\nNo More Knots Holdings Pty Ltd received a loan in the amount of USD357,250 (AUD500,000). The loan term is three years with a variable rate of 3.50% per annum. This loan is received to pay No More Knots Pty Ltd Acquisitions Balance. This is a secured loan.\nWonder Foods Retail Pty Ltd received a loan in the amount of USD107,175 (AUD150,000). The loan term is three years with a variable rate of 3.50% per annum. This loan is received to fund the stock in Wonder Foods Retail. This is a secured loan.\nRayont Properties Pty Ltd received two loans: The first loan is in the amount of USD2,207,091 (AUD3,089,000). The loan term is five years with a variable rate of 3.50% per annum. This loan is received to buy two properties located at 85 Juliette St, Greenslopes (lot 272) QLD 4120 Australia and 44 Marquis Street, Greenslopes QLD 4120 Australia. The second loan is in the amount of USD57,875 (AUD81,000). The loan term is three years with a variable rate of 3.50% per annum. This loan is received to buy two properties located at 85 Juliette St, Greenslopes (lot 272) QLD 4120 Australia and 44 Marquis Street, Greenslopes QLD 4120 Australia. Those are secured loans.\nRestriction imposed by from Commonwealth Bank covenants\nCommonwealth Bank has imposed financial covenants to the subsidiaries of the group for its mortgage loans obtained from the Bank, however, certain subsidiaries financial position and performance do not meet with these requirements for the year ended June 30, 2022. During the periodic review by the Bank for the period ended June 30, 2022, the Bank has agreed and satisfied with the undertaking by the Companys Director and on the conditions met at overall consolidated results of the subsidiaries. Consequently, the Company has assessed and determined that financial covenants required were adhered with additional circumstances being addressed as at balance sheet date and therefore has no perform further adjustment or reclassification.\nAs of June 30, 2022 and June 30, 2021 the Company had outstanding current balances of $450,405 and $2,046,477 and non-current balances of $4,811,975 and $182,329, respectively related to the mortgage loan.\nThe Companys subsidiary obtained on October 15, 2021 a loan of $266,976 (AUD 360,000) from private lender James Lee to assist the Company to pay another loan. The term of the loan was three months from the commencement date but it is extended with two more months, and the interest rate is 48% per annum or 96% per annum if the payment will be default as per loan agreement. The loan is secured under the Companys present and future property of any kind, including all personal property. The principal amount and the interest should be paid both on March 15, 2022. The Companys subsidiary obtained on November 12, 2021 a loan of $547,319 (AUD747,500) from private lender Aura Loan Management Pty Ltd to assist the Company to cover the fit-out expenses for the property purchased lately located at 900 Sandgate Road, Clayfield QLD, 4011 Australia in order to be ready for internal use of the subsidiary Rayont (Autsralia) Pty Ltd. The term of the loan is 12 months from the commencement date, and the interest rate is 9.25% per annum. Monthly payments are compound just from interest in the amount of $4,183 (AUD5,762). The loan is secured under the Companys present and future property of any kind, including all personal property. This loan is paid on May 4, 2022.\nCOVID-19 loan\nOn June 29, 2020, the Companys subsidiary obtained a COVID-19 loan of $ 171,729 (AUD 250,000) from Queensland Rural and Industry Development Authority (QRIDA) to assist the Company to meet its working capital expenses. The term of the loan is 10 years from the commencement date, and the interest rate is 0% for the first 12 months from the commencement date and then 2.5% from the remainder of the term. The Companys subsidiary has an Interest Only Period beginning 12 months after the Commencement Date and ending 36 months from the Commencement Date. The loan is secured under the Companys present and future property of any kind, including all personal property. This loan is paid on May 4, 2022. As of June 30, 2022 and June 30, 2021, the Company had outstanding balances of $0 and $5,077, respectively related to the COVID-19 loan.\nRayont inc, received on May 23, 2022 a note payable in the amount of 172,200 from 1800 Diagonal Lending LLC. This note has 12% interest rate per annum and has original issue discount in the amount of $18,450.\nInterest and outstanding principal, subject to adjustment, shall be paid in ten (10) payments each in the amount of $19,286.40.\nRayont (Australia) Pty Ltd has received on June 10, 2022 a private loan in the amount of USD423,240 (AUD600,000) from Trevor Townsend. The loan term is one year and with a variable rate of 8% per annum. This loan is received to finance the acquisition of business of No More Knots Pty Ltd. This is a secured loan.\nRayont (Australia) Pty Ltd has received on May 4, 2022 a private loan in the amount of USD1,071,750 (AUD1,500,000) from Lydia Loh Holdings Pty Ltd. The repayment date was for 10 days but then the loan was agreed to be extended by another 160 days with an interest rate of 0.7% per day. Purpose of this loan was to acquire No More Knots Pty Ltd, No More Knots Taringa and No More Knots Newmarket. This is a secured loan. This loan has been transferred to the buyer of the Rayont Australia as of September 1, 2022.\nRayont (Australia) Pty Ltd has received two small private loans on December 12, 2021 and April 4, 2022 in the amount of USD55,662 (AUD77,556) and USD26,554 (AUD35,176), respectively from Quickfee. The loan term is one year. This loan is received to paid the invoices sent from Mazzars for Rayont Australia. This is unsecured loan.\nNo More Knots Holdings Pty Ltd has received on May 4, 2022 a private loan in the amount of USD29,178 (AUD40,836.44) from Kelly Townsend. The loan is non-interest bearing and payable on demand. This loan is received to finance operations of No More Knots Holdings Pty Ltd. This is unsecured loan.\nNo More Knots Pty Ltd has received on May 12, 2022 two private loans in the amount of USD95,928 (AUD140,000) and USD34,260 (AUD50,000) from Bizcap AU Pty Ltd. The loan term is 26 weeks and 90 days, respectively with total interest amount of USD47,005 (AUD68,600) and USD16,787 (AUD24,500) for the period, respectively. This loan is received to finance operations of No More Knots Pty Ltd. This is unsecured loan.\nNo More Knots (Taringa) Pty Ltd has received on May 12, 2022 one private loan in the amount of USD37,686 (AUD55,000) from Bizcap AU Pty Ltd. The loan term is 26 weeks with total interest amount of USD18,466 (AUD26,950) for the period. This loan is received to finance operations of No More Knots Pty Ltd. This is unsecured loan.\nNo More Knots (Newmarket) Pty Ltd has received on May 12, 2022 one private loan in the amount of USD37,686 (AUD55,000) from Bizcap AU Pty Ltd. The loan term is 26 weeks with total interest amount of USD18,466 (AUD26,950) for the period. This loan is received to finance operations of No More Knots Pty Ltd. This is unsecured loan.\nPrema Life Pty Ltd has received on April 21, 2022 one private loan in the amount of USD184,400 (AUD250,000) from Bizcap AU Pty Ltd. The loan term is 140 days with total interest amount of USD90,356 (AUD122,500) for the period. This loan is received to finance operations of No More Knots Pty Ltd. This is unsecured loan.\nFor the 12 months ended June 30, 2022 and 2021 the interest expenses were $615,455 and $50,079, respectively.\nNOTE 8 - FINANCE LEASE PAYABLE\nSCHEDULE OF FINANCE LEASE\nCurrent finance lease: June 30, 2022 June 30, 2021\nFinance lease for vehicle $ 10,983 $ 8,188\nTotal current finance lease $ 10,983 $ 8,188\nNon-current finance lease:\nFinance lease for vehicle 7,812 19,669\nTotal non-current finance lease: $ 7,812 $ 19,669\nTotal finance lease $ 18,795 $ 27,857\nOn the 28th of October 2020, the Companys subsidiary obtained a Finance Lease for vehicle in the amount of $34,167 (AUD 44,880) from Australian Alliance Automotive Finance Pty Limited to assist the Company to meet its operating activities. The term of the loan is 4 years from the commencement date, and the interest rate is 5.03% for the term. As of June 30, 2022, the Company had outstanding balances of $18,795 related to the Finance Lease.\nFinance lease activity is included in property and equipment, net.\nNOTE 9 - CONCENTRATION\n(a) Major Customers\nAt June 30, 2022 and June 30, 2021, one major customer represented approximately 26% and 27% of total accounts receivable, respectively.\n(b) Major Suppliers\nAt June 30, 2022 and June 30, 2021 there was no supplier who accounted for 10% or more of the Companys purchases nor with significant outstanding payables.\nNOTE 10 - RELATED PARTY TRANSACTIONS\nThe related parties of the Company with whom transactions are reported in the consolidated financial statements are as follows:\nName\nRelationship\nRural Asset Management Services, Inc. (Rural)\nOne of major shareholder of Rayont Inc\nTheAlikasa (Australia) Pty Ltd\nCommon director / shareholder of the Company\nBlue Pacific Academy\nEntity under the same beneficial owner/ common directors\nHealth Script Pty Ltd\nEntity under the same beneficial owner/ common directors\nAccounting Business Solutions Pty Ltd\nEntity under the same beneficial owner/ common directors\nAbrar Investments Pty Ltd\nCommon shareholder\nTasman Accounting Pty Ltd\nEntity under the same beneficial owner/ common directors\nVantis Partners Pty Ltd\nEntity under the same beneficial owner/ common directors\nAmount due from related parties\nSCHEDULE OF AMOUNT DUE TO (FROM) RELATED PARTIES\nJune 30, 2022 June 30, 2021\nTheAliKasa Australia Pty Ltd $ 20,097 $ -\nRural Asset Management Services - 11,881\nBlue Pacific Academy - 4,000\nHealth Script Pty Ltd 45,919 -\nTotal $ 66,016 $ 15,881\nAmount due from related parties $ 66,016 $ 15,881\nAs of March 31, 2022 and June 30, 2021, Rayont International (L) had loans receivable of $11,881 from Rural Asset Management Services. On June 30, 2020, the company agreed to grant a loan to the Rural for the amount of $91,823. The loan bears no interest rate and receivable on demands. Due to the short maturity of the loan, the Company had a current loans receivable of $91,823 as of September 30, 2020. The Company made a three-party agreement on December 31, 2020 between its subsidiary Rayont International (L), Rayont Inc and Rural in order to eliminate the loans from /to Rural and there is no need for money to move around. The remaining balance of $11,881 will be received on demands.\nAs of March 31, 2022 and June 30, 2021, Rayont International (L) Ltd had loans receivable of $4,000 from Blue Pacific Academy. The loans receivable was non-interest bearing and due upon request. this loan is paid back on June 30, 2022.\nAs of June 17, 2022 and June 30, 2021, Rayont (Australia) Pty Ltd has loans receivable of $45,919 and $nil from Health Script Pty Ltd. This is a prepayment for acquisition of the Tugan business that is completed in September 1, 2022. The loans receivable was non-interest bearing and due upon request and it is.\nAs of June 30, 2022 and June 30, 2021, Prema Life Pty Ltd and Wonder Foods Pty Ltd had amount receivable of $20,097 and $nil from director of the company. Prema Life Pty Ltd owed the director $386,105 as of June 30, 2021. In repaying this amount Prema Life Pty Ltd as of June 30, 2022 had paid $20,097 more than it was supposed to pay. This was not meant to be a loan but rather an oversight of the accounts. The oversight indicates a deficiency of internal control over financial reporting under the current operations. The Management has taken immediate remedial action rectifying the overpayment. As at 30 September 2022, the Director loan is not overdrawn. Prema Life Pty Ltd was sold on September 1, 2022 to unrelated party and this loan has been reconciled as part of that transaction.\nAmounts due to related parties\nAs of June 30, 2022 and June 30, 2021, the Company had amount due to related parties as follows:\nJune 30, 2022 June 30, 2021\nAccounting Business Solutions Pty Ltd $ - $ 1,133\nAbrar Investments Pty Ltd -\nDirectors loan - 386,105\nTasman Accounting Pty Ltd 3,453 -\nVentis Partners Pty Ltd 125,162 -\nTotal $ 128,677 $ 387,238\nAmount due to related parties $ 128,677 $ 387,238\nOn August 1, 2021 the director has given a loan amount of $386,105 which is used to pay the property that is bought from Prema Life Pty Ltd. This loan has 3% interest per annum and it is fully settled as of December 31, 2021.\nOn May 4, 2022 the Ventis Partners Pty Ltd has given a loan amount of $125,162 which is used to pay the properties that is bought from Rayont Properties Pty Ltd. This loan is non-interest bearing and payable on demand.\nOn June 5, 2022 the Tasman Accounting Pty Ltd has given a loan amount of $3,453 which is used to pay the operation expenses of No More Knots (Taringa) Pty Ltd. This loan is non-interest bearing and payable on demand.\nThe other amounts due to related parties were non-interest bearing and payable on demand. The amounts were used to support its operation, to acquire the properties.\nNOTE 11 - STOCK-BASED COMPENSATION\nThe Company accounts for stock issued for services using the fair value method in accordance with ASC 718, Stock-Based Compensation, the measurement date of shares issued for services is the grant date.\nOn December 19, 2018, the Company issued 3,000,000 shares of its common stock to a consultant for services rendered to the Company at $0.32 per share.\nOn January 14, 2019, under the Companys 2019 Equity Incentive Plan, the Company issued an aggregate of 900,000 shares to a consultant for services rendered to the Company $0.26 per share.\nOn January 30, 2019, the Company issued 200,000 shares of its common stock to a consultant for services rendered to the Company at $0.26 per share.\nOn January 30, 2019, the Company issued 300,000 shares of its common stock to a consultant for services rendered to the Company at $0.26 per share.\nOn January 31, 2019, the Company issued 150,000 shares of its common stock to a consultant for services rendered to the Company at $0.26 per share.\nOn January 31, 2019, the Company issued 250,000 shares of its common stock to a marketing staff for marketing services rendered to the Company at $0.26 per share.\nOn February 11, 2019, the Board of Directors authorized the issuance of 1,000,000 shares of the Companys common stock to its prior President, for services rendered at $0.25 per share.\nOn April 8, 2019, the Company issued 200,000 shares of its common stock to one consultant for services rendered to the Company at $0.25 per share.\nOn April 26, 2019, the Company issued 900,000 shares of its common stock to one consultant for services rendered to the Company at $0.25 per share.\nOn April 8, 2020, under the Companys 2019 Equity Incentive Plan, the Company issued an aggregate of 250,000 shares of its common stock to one former officer, the CEO of the Company and one consultant for services rendered to the Company at 0.08 per shares.\nThe Company did not record the compensation cost for services for the twelve months ended June 30, 2021.\nIn addition, the Company accounts for stock issued for business acquisition using the fair value method. The measurement date of shares issued for acquisition is the grant date.\nOn September 30, 2020, the Company issued 25,714,286 shares of its common stock to Taleo Holdings (L) Ltd for acquisition of Rayont International (L) Limited at $0.07 per share based on the closing share price on the OTC Markets on September 29, 2020.\nOn July 17, 2021, the Company issued 710,713 shares of its common stock to TheAliKasa (Australia) Pty Ltd for acquisition of business from Rayont (Australia) Pty Ltd. at $0.87 per share based on the closing share price on the OTC Markets on July 17, 2021.\nOn September 23, 2021, the Company issued 515,771 shares of its common stock to AMH Corporate Pty Ltd for acquisition of property from Rayont (Australia) Pty Ltd. at $2.25 per share based on the closing share price on the OTC Markets on September 23, 2021.\nOn December 16, 2021, the Company issued 10,500 shares of its common stock to Board of Directors for their services provided to Rayont group at $2.50 per share based on the closing share price on the OTC Markets on December 16, 2021.\nOn March 31, 2022, the Company issued 13,889 shares of its common stock to Board of Directors for their services provided to Rayont group at $1.89 per share based on the closing share price on the OTC Markets on March 31, 2022.\nOn June 2, 2022, the Company issued 11,250 shares of its common stock to Board of Directors for their services provided to Rayont group at $0.80 per share based on the closing share price on the OTC Markets on June 2, 2022.\nThe Company relied upon Section 4(2) and Regulation D of the Securities Act of 1933, as amended, for the issuances of the securities listed above. No commissions were paid regarding the share issuance and the share certificates were issued with a Rule 144 restrictive legend.\nNOTE 12 - INCOME TAXES\nThe income before income taxes of the Company for the years ended June 30, 2022 and 2021 were comprised of the following:\nSCHEDULE OF INCOME BEFORE TAXES\nFor the years ended June 30\nTax jurisdictions from:\n- Local $ (362,040 ) $ (209,669 )\n- Foreign, representing:\nAustralia (152,727 ) 851,416\nMalaysia 783,895 (257,866 )\nIncome before income taxes $ 269,128 $ 383,884\nProvision for income taxes consisted of the following:\nSCHEDULE OF PROVISION FOR INCOME TAXES\nFor the years ended June 30\nCurrent:\n- Local $ - $ -\n- Foreign:\nAustralia 24,270 -\nMalaysia - -\nTotal Current Income Tax Expense 24,270 -\nDeferred:\n- Local (76,028 ) (44,030 )\n- Foreign, representing:\nAustralia (32,073 ) -\nMalaysia - (54,152 )\nChanges in valuation allowance 108,101 98,182\nIncome tax expense $ 24,270 $ -\nThe effective tax rate in the periods presented is the result of the mix of income earned in various tax jurisdictions that apply a broad range of income tax rates. During the periods presented, the Company has a number of subsidiaries that operates in different countries and is subject to tax in the jurisdictions in which its subsidiaries operate, as follows:\nUnited States of America\nThe Tax Act reduces the U.S. statutory corporate tax rate from 35% to 21% for our tax years beginning in 2018. The Company is registered in the State of Nevada and is subject to United States of America tax law. As of June 30, 2022, the operations in the United States of America incurred $3,956,354 of cumulative net operating losses (NOLs) which can be carried forward to offset future taxable income. The NOL carry forwards begin to expire in 2042, if unutilized. The Company has provided for a full valuation allowance of approximately $830,834 against the deferred tax assets on the expected future tax benefits from the net operating loss carry forwards as the management believes it is more likely than not that these assets will not be realized in the future.\nMalaysia\nRayont (Malaysia) Sdn Bhd is subject to the Malaysia Corporate Tax Laws at a two tier corporate income tax rate based on amount of paid up capital. The 2022 tax rate for company with paid-up capital of MYR 2,500,000 (approximately $603,486) or less and that are not part of a group containing a company exceeding this capitalization threshold is 17% on the first MYR 600,000 (approximately $144,092) taxable profit with the remaining balance being taxed at 24%.\nRayont International (L) is subject to the Labuan Corporate Tax Laws, that is 3% of audited net profits for trading activity and zero percent for non-trading activity, conditional upon fulfilling the substance requirements under the Labuan Business Activity Tax Act, 1990. Failure of fulfilling the substance requirements, Labuan entity will be taxed at 24% on its taxable income.\nFor the year ended June 30, 2022, Rayont (Malaysia) Sdn Bhd generated a profit of $39,313 and Rayont International (L) generated a profit of $781,970 but given the fact that are capital gain and it is not subject to tax as per Malaysia tax law.\nAs of June 30, 2022, the operations in Malaysia generated $500,413 of cumulative net operating profit.\nAustralia\nThe Australian Income Tax had significant changes progressively since 30 June 2017. The rate was previously 27.5% from the 2017 till 2020 and 26% in the year 2021. From July 1, 2022, companies that are base rate entities must apply the 25% company tax rate. The full company tax rate of 30% applies to all companies that are not eligible for the lower company tax rate. Eligibility for the lower company tax rate depends on whether a company in Australia is classified as a base rate entity.\nThe Base Rate entity company tax rate can take advantage of the lower tax rate, and must meet the following condition.\nA company is a base rate entity for an income year if:\n● the companys aggregated turnover for that income year is less than USD35M or (AUD50M) for that income year, and\n● it has 80% or less of their assessable income in that income year that is base rate entity passive income\nAll the Australian companies have satisfied the requirements of the base rate entity and therefore the 25% tax rate is applicable.\nFor three subsidiaries companies tax liabilities as per Australian Tax laws are in the amount of $24,270.\nAs of June 30, 2022, the operations in the Australia incurred $608,252.00 of cumulative net operating losses (NOLs) which can be carried forward to offset future taxable income. The NOL can carry forwards in indefinite time period, if unutilized. The Company has provided for a full valuation allowance of approximately $127,733 against the deferred tax assets on the expected future tax benefits from the net operating loss carry forwards as the management believes it is more likely than not that these assets will not be realized in the future.\nThe following table sets forth the significant components of the aggregate net deferred tax assets of the Company as of June 30, 2022 and June 30, 2021:\nSCHEDULE OF AGGREGATE NET DEFERRED TAX ASSETS\nAs of June 30\nGross Deferred tax assets:\nOn Net operating loss carryforwards $ $\n- United States of America 830,834 755,188\n- Australia 127,733 90,564\n- -\nTotal gross deferred tax assets 958,567 845,752\nLess: valuation allowance (958,567 ) (845,752 )\nNet deferred tax assets $ - $ -\nManagement believes that it is more likely than not that the deferred tax assets will not be fully realizable in the future. Accordingly, the Company provided for a full valuation allowance against its deferred tax assets of $958,567 as of June 30, 2022. For the year ended June 30, 2022, the valuation allowance increased by $112,815\nNOTE 13 - OTHER INCOME\nOther income was $2,370,877 and $953,709 for the twelve months ended June 30, 2022 and 2021, respectively. The increase was attributable to sale of the equipment for the cancer treatment in the amount of $385,361; to sale of the Next Generation Photo Dynamic Therapy (NGPDT) License for Sub-Sahara Africa in the amount of $ 1,071,430.59. Whilst, USD353,194 arose due to tax incentive/grant obtained in relation to approved research and development activities carried out. Other income is generated from the sale of the subsidiary Rayont Technologies Australia in the amount of $668,174 and $39,975 from the sale of Rayont Technologies in Malaysia. In addition, debt forgiven in the amount of $167,124. The amount of $314,382 is deducted from other income as a result of the sale of two subsidiaries Rayont Technologies Malaysia and Rayont Technologies Australia in the consolidation of the financial statements of the group.\nThe amount of USD 298,418 was attributable to differences between seller and purchase price of the property that GGLG Properties Pty Ltd sold on June 29, 2021. On October 15, 2020, the Company entered into an agreement to purchase the assets of Workstar Tech (Aust) Pty Ltd, from an individual towards purchase of fair value of USD476,594.32 (AUD632,393) for purchase consideration of USD228,258.35 (AUD302,876). The income from this transaction is $244,376. Whilst, USD185,539 arose due to tax incentive/grant obtained in relation to approved research and development activities carried out. The amount of $225,376 was mainly due to tax incentive/grant obtained in relation to approved research and development activities carried out, due to ATO COVID19 Job Seeker, Cash Flow Boost incentives from Australian Government.\nNOTE 14 - OTHER RECEIVABLES AS CURRENT ASSETS\nAs of June 30, 2022, the Company had other receivables in the amount of $2,765,829 which is compound from the sale of Rayont Internationals exclusive license for registering and commercializing PhotosoftTM technology for treatment of all cancers across Sub-Sahara African region on June 29, 2022 in the amount of $2,500,000 that will be paid from the buyer based on a repayment schedule; $175,225 arose due to tax incentive/grant obtained in relation to approved research and development activities carried out by subsidiary Prema Life Pty Ltd; prepayment of the Value Added Tax in the amount of $27,652 from some subsidiaries; Rayont Inc has paid an retainer fee in the amount of $20,000 but has not received the service and $155 as deposit for the service received; a deposit done in trust account from Rayont (Australia) Pty Ltd in the amount of $29,623 for the acquisitions after June 30, 2022: a deposit done from Wonder Foods in the amount of $13,174 for lease rent.\nAs of June 30, 2021, the Company had other receivables in the amount of $453,250 which is compound from a prepayment of the Value Added Tax done from Prema Life in the amount of $202,768; Rayont Properties Trust sold its assets and the amount of $201,649 will be paid from the buyer based on a repayment schedule; a deposit done from Prema Life in the amount of $14,993 for lease rent; the amount of $32,003 as deposit done for different reasons from other subsidiaries and the amount of $1,836 that is interest income for Rayont Inc.\nNOTE 15 - OTHER ASSETS AS NON-CURRENT ASSETS\nAs of June 30, 2022, the Company had other assets in the amount of $767,656 which is compound from the shares that Rayont (Australia) Pty Ltd has received from another public company Quantum Capital Inc. as a payment for the sale of its subsidiaries on January 31, 2022 in the amount of $716,872; a deposit done from No More Knots (Taringa) Pty Ltd for lease rent in the amount of $13,784; a deposit done from No More Knots (Newmarket) Pty Ltd for lease rent in the amount of $37,000.\nNOTE 16 - OTHER RECEIVABLES AS NON-CURRENT ASSETS\nAs of June 30, 2022, the Company had other receivables in the amount of $1,009,537 which is compound from the sale of the equipment for the cancer treatment on June 29, 2022 from Rayont (Australia) Pty Ltd in the amount of $ 1,002,632 that will be paid from the buyer based on a repayment schedule; goodwill in the amount of $6,905 that has subsidiary Wonder Foods Retail Pty Ltd.\nNOTE 17 - RESTATEMENT OF PRIOR ISSUED FINANCIAL STATEMENTS\nThe Company changed last year its fiscal year-end from a fiscal year ending on September 30 to a fiscal year ending on June 30. Based on this change, prior issued financial statements ended June 30, 2021 includes our audited consolidated financial statements as at and for the nine months ended June 30, 2021 but the fiscal year ended June 30, 2022 is a full year so the management decided to do the consolidation for prior years for a period of twelve months as a comparative period for actual fiscal year ended June 30, 2022 by adopting ASC250-10 guidelines and prepared the restated financial statement for June 30, 2021, enclosed herewith. The Company has not amended its previously filed Annual Reports on Form 10-K or Quarterly Reports on Form 10-Q for the periods affected by the restatement and has adjusted the balances by revising the consolidated balance sheet for the year ended June 30, 2021, income statement for the twelve months ended June 30, 2021, cash flow statements for the twelve months ended June 30, 2021 included herein.\nThe restatement for the consolidated balance sheet as of and for the year ended June 30, 2021, income statement for the twelve months ended June 30, 2021 and cash flow statement for the twelve months ended June 30, 2021:\nRAYONT INC. AND SUBSIDIARIES RESTATED CONSOLIDATED BALANCE SHEETS\nSCHEDULE OF RESTATEMENT OF FINANCIAL STATEMENTS\nAs Previously Reported Restatement Adjustments As Restated\nJune 30, 2021\nAs Previously Reported Restatement Adjustments As Restated\nASSETS\nCurrent Assets:\nCash and cash equivalents $ 243,610 $ - $ 243,610\nAccounts receivables 534,525 - 534,525\nInventories 500,165 - 500,165\nPrepaid expense 23,933 - 23,933\nDue from related parties 15,881 - 15,881\nOther receivables 453,250 - 453,250\nTotal Current Assets 1,771,364 - 1,771,364\nNon-Current Assets:\nProperty and equipment, net 3,140,757 - 3,140,757\nIntangible assets 2,245,231 - 2,245,231\nTotal Non-Current Assets 5,385,988 - 5,385,988\nTOTAL ASSETS $ 7,157,352 $ - $ 7,157,352\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent Liabilities:\nAccounts payable $ 99,615 $ - $ 99,615\nAccrued liabilities 472,021 - 472,021\nDue to related parties 387,238 - 387,238\nLoan payable 2,051,554 - 2,051,554\nFinance lease payable 8,188 - 8,188\nOther payables 209,712 - 209,712\nTotal Current Liabilities 3,228,328 - 3,228,328\nNon-Current Liabilities:\nFinance lease payable 19,669 - 19,669\nLoan payable 182,329 - 182,329\nTotal Non-Current Liabilities 201,998 - 201,998\nTOTAL LIABILITIES $ 3,430,326 $ - $ 3,430,326\nCOMMITMENTS AND CONTNGENCIES -\nStockholders Equity:\nCommon stock, $0.001 par value; 500,000,000 shares authorized; 46,783,369 and 38,871,818 shares issued and outstanding as of June 30, 2021 and September 30, 2020, respectively $ 46,784 $ - $ 46,784\nPreferred stock, $0.001 par value; 20,000,000 shares authorized; nil share issued and outstanding - - -\nAdditional paid-in capital 6,996,198 - 6,996,198\nShares to be issued 618,320 - 618,320\nAccumulated deficit (3,912,404 ) 32,603 (3,879,801 )\nAccumulated other comprehensive loss (21,872 ) (32,603 ) (54,475 )\nTOTAL STOCKHOLDERS EQUITY 3,727,026 3,727,026\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY $ 7,157,352 $ 0 $ 7,157,352\nRAYONT INC. AND SUBSIDIARIES RESTATED CONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME (LOSS)\nAs Previously Reported Restatement Adjustments As Restated\nFor the nine months ended June 30, 2021\nFor the twelve months ended June 30, 2021\nRevenue $ 2,244,157 $ 725,442 $ 2,969,599\nCost of Revenue (979,476 ) (241,550 ) (1,221,026 )\nGross profit 1,264,681 483,892 1,748,573\nOperating expenses:\nSelling, general and administrative expenses 1,687,873 267,694 1,955,567\nDepreciation and amortization expense 422,633 31,875 454,508\nTotal Operating Expenses 2,110,506 299,569 2,410,075\nOperating Loss (845,825 ) 184,323 (661,502 )\nOther income/(expense):\nInterest income 140,252 1,504 141,756\nInterest expense (38,704 ) (11,375 ) (50,079 )\nOther income, net 790,701 163,008 953,709\nTotal other income 892,249 153,137 1,045,386\nIncome before income taxes 46,424 337,460 383,884\nIncome tax expense - - -\nNet income $ 46,424 $ 337,460 $ 383,884\nOther comprehensive items\nForeign currency translation loss (61,035 ) 31,375 (29,660 )\nTotal other comprehensive loss (61,035 ) 31,375 (29,660 )\nTotal comprehensive loss (14,611 ) 368,835 354,224\nLess: comprehensive income attributable to noncontrolling interest - - -\nComprehensive loss / income attributable to shareholders of the Company $ (14,611 ) $ 368,835 $ 354,224\nWeighted average shares, basic and diluted 46,393,747 (8,624,647 ) 37,769,100\nNet income per common share, basic and diluted $ 0.00 $ 0.01 $ 0.01\nRAYONT INC. AND SUBSIDIARIES RESTATED CONSOLIDATED STATEMENTS OF CASH FLOWS\nAs Previously Reported Restatement Adjustments As Restated\nFor the nine months ended June 30, 2021\nFor the twelve months ended June 30, 2021\nOperating Activities:\nNet Income $ 46,424 $ 337,460 $ 383,884\nAdjustments to reconcile net income to net cash used in operating activities:\nNon-cash portion of share based compensation for service - - -\nDepreciation and amortization expense 422,633 31,875 454,508\nGain on sale of assets (238,014 ) (6,362 ) (244,376 )\nChanges in operating assets and liabilities:\nAccounts receivable (157,303 ) (186,129 ) (343,432 )\nInventory (22,915 ) (130,069 ) (152,984 )\nAccounts payable 42,828 (52,282 ) (9,454 )\nAccrued liabilities 78,934 50,767 129,701\nPrepaid expense (24,041 ) (23,719 )\nAdvance to officer 6,717 (4,498 ) 2,219\nOther assets (47,054 ) (46,788 )\nOther receivables (398,265 ) 75,907 (322,358 )\nOther payable 4,160 (18,854 ) (14,694 )\nNet cash used in operating activities (285,896 ) 98,403 (187,493 )\nInvesting Activities:\nCash from acquisition - 1,082 1,082\nPurchases of intangible assets (126,479 ) (126,136 )\nProceeds from loan receivable 93,000 (93,000 ) -\nPurchases of property and equipment (1,765,027 ) 44,529 (1,720,498 )\nNet cash used in investing activities (1,798,506 ) (48,128 ) (1,845,552 )\nFinancing Activities:\nRepayment to related party (155,376 ) (77,744 ) (233,120 )\nProceeds from loan payable 1,577,422 (14,710 ) 1,562,712\nIssuance of common stock 701,988 - 701,988\nNet cash provided by financing activities 2,124,034 (92,454 ) 2,031,580\nEFFECT OF EXCHANGE RATE ON CASH 7,804 (18,743 ) (10,939 )\nNet increase (decrease) in cash and cash equivalents 47,436 31,532 (12,404 )\nCash and cash equivalents at beginning of the period 196,174 59,840 256,014\nCash and cash equivalents at end of the year $ 243,610 $ 91,372 $ 243,610\nSUPPLEMENTAL DISCLOSURE:\nInterest paid $ 38,704 $ 11,375 $ 50,079\nIncome tax paid $ - $ - $ -\nSUPPLEMENTAL DISCLOSURE FOR NONCASH INVESTING AND FINANCING ACITIVIES:\nIssuance of common stock for acquisitions $ - $ 1,800,000\n$ 1,800,000\nForgiveness of debt $ 2,016,362 $ - $ 2,016,362\nNOTE 18 - RIGHT-OF-USE ASSET AND OPERATING LEASE LIABILITIES\nOperating leases are accounted for on the balance sheet within the right-of-use (ROU) assets and lease liabilities recognized in Operating lease liabilities - current and Operating lease liabilities - non-current, respectively.\nLease assets and liabilities are recognized at the lease commencement date. Lease liabilities are measured at the present value of the lease payments not yet paid. To determine the present value of lease payments not yet paid, the Company estimates borrowing rates corresponding to the maturities of the leases based on prevailing financial market conditions, comparable company and credit analysis, and management judgment. ROU assets measured based on the lease liability and no initial direct costs, prepaid or deferred rent, and lease incentives.\nThe Company recognizes expense for these leases on a straight-line basis over the lease term and also considered annual incremental charges.\nLease related costs recognized in the statements of operations for the year ended June 30, 2022\nSCHEDULE OF LEASE RELATED COSTS\nLease 1 Lease 2 Lease 3\nOperating lease expenses $ 13,162 16,681 6,486\nSupplemental balance sheet information related to leases is as follows:\nSCHEDULE OF INFORMATION RELATED TO LEASES\nOperating Leases June 30, 2022\nLease 1 Lease 2 Lease 3\nRight-of-use assets $ 12,231 285,032 227,629\nLease liabilities - current 12,231 58,014 42,088\nLease liabilities - non-current - 227,018 185,541\nTotal lease liabilities $ 12,231 285,032 227,629\nSCHEDULE OF WEIGHTED AVERAGE REMAINING LEASE TERMS AND DISCOUNT RATE\nJune 30, 2022\nWeighted Average Remaining Lease Terms\nLease 1 months\nLease 2 years 5 months\nLease 3 years 10 months\nDiscount Rate\nLease 1 2.91 %\nLease 2 2.42 %\nLease 3 2.83 %\nSCHEDULE OF OPERATING LEASES MATURITY\nOperating Leases Lease 1 Lease 2 Lease 3\n$ 12,261 64,083 47,806\n- 66,326 49,479\n68,647 51,212\n71,050 52,400\n30,374 42,430\nThereafter\nTotal lease payments 12,261 300,481 243,327\nLess: imputed interest (30 ) (15,449 ) (15,697 )\nPresent value of lease liabilities $ 12,231 285,032 227,629\nNOTE 19 - COMMITMENTS AND CONTINGENCIES\nThe Company has no commitment or contingency as of June 30, 2022.\nNOTE 20 - GOODWILL\nGoodwill is the excess of cost of an acquired entity over the fair value of amounts assigned to assets acquired and liabilities assumed in a business combination. Under the guidance of ASC 350, goodwill is not amortized, rather it is tested for impairment annually, and will be tested for impairment between annual tests if an event occurs or circumstances change that would indicate the carrying amount may be impaired. An impairment loss generally would be recognized when the carrying amount of the reporting units net assets exceeds the estimated fair value of the reporting unit and would be measured as the excess carrying value of goodwill over the derived fair value of goodwill. The Companys policy is to perform an annual impairment testing for its reporting units of each fiscal year. For the years ended June 30, 2022, the Company determined there were no indicators of impairment of goodwill.\nOn April 1, 2022 under the agreement Rayont Inc., through its wholly owned subsidiary No More Knots Holdings Pty Ltd, acquired 100% of the total outstanding shares and units of No More Knots Pty Ltd, No More Knots (Taringa) Pty Ltd and No More Knots (Newmarket) Pty Ltd in exchange for AUD3,000,000 (approximately USD 2,247,865) cash, payable in two tranches. The first trench of USD1,910,685 (AUD2,550,000) is paid on May 4, 2022 and the second tranche of USD337,180 (AUD450,000) is payable before or on January 31, 2023 if three conditions are met namely;\n1. Achievement of EBIDTA of USD500,000 (AUD700,000) by June 30, 2022.\n2. Former owner remain and transition the business until December 31, 2022.\n3. Complete the opening of new branch by December 31,2022.\nAs of June 30,2022 the business failed to meet the first condition so the amount of the USD110,000 (AUD150,000) has been deducted from the purchase price. The remaining conditions have been met by the vendor and as of December 28,2022 is unconditional and it has been agreed to be paid on 31 January 2023.\nNo More Knots is home to over 45 tertiary qualified therapists who specialise in Remedial Massage and Myotherapy\nThe Company accounted for the transaction as a business combination in accordance ASC 805 Business Combinations. The Company is in the process of performing an allocation of the purchase price paid for the assets acquired and the liabilities assumed. The fair values of the assets acquired, as set forth below, are considered provisional and subject to adjustment as additional information is obtained through the purchase price measurement period (a period of up to one year from the closing date). The provisional allocation of the purchase price is based on managements preliminary estimates. The management completed its analysis to finalize the purchase price allocation.\nSCHEDULE OF PURCHASE PRICE ALLOCATION\nPurchase consideration $ 1,967,960\nFair value of the net assets acquired and liabilities assumed $ 101,252\nGoodwill $ 1,866,708\nNOTE 21 - SEGMENT REPORTING\nASC 280, Segment Reporting establishes standards for reporting information about operating segments on a basis consistent with the Companys internal organization structure as well as information about services categories, business segments and major customers in financial statements. The Company has reportable segment based on business unit, nutritional supplements and myotherapy; software and content business and reportable segment based on country, Australia and Malaysia.\nIn accordance with the Segment Reporting Topic of the ASC, the Companys chief operating decision maker has been identified as the Chief Executive Officer and President, who reviews operating results to make decisions about allocating resources and assessing performance for the entire Company. Existing guidance, which is based on a management approach to segment reporting, establishes requirements to report selected segment information quarterly and to report annually entity-wide disclosures about products and services, major customers, and the countries in which the entity holds material assets and reports revenue. All material operating units qualify for aggregation under Segment Reporting due to their similar customer base and similarities in economic characteristics; nature of products and services; and procurement, manufacturing and distribution processes.\nSCHEDULE OF SEGMENT REPORTING BUSINESS UNIT\nFor the Year Ended and As of\nJune 30, 2022\nBy Business Unit Software and Content Nutritional Supplements and Myotherapy Other Segment Total\nRevenue $ 0 $ 2,839,357 $ 2,839,357\nCost of revenue (1,456,733 ) (1,456,733 )\nGeneral and administrative expenses (2,238,213 ) (630,705 ) (2,868,918 )\nLoss from operations (855,589 ) (630,705 ) (1,486,294 )\nTotal assets $ 0 $ 14,193,235 $ 14,193,235\nCapital Expenditure\nProperty and equipment $ 0 6,241,049 $ 6,241,049\nIntangible assets $ 0 $ 0\nFor the Year Ended and As of\nJune 30, 2021\nBy Business Unit Software and Content Nutritional Supplements Other Segment Total\nRevenue $ 872,476 $ 2,097,123 $ 2,969,599\nCost of revenue (86,110 ) (1,134,915 ) (1,221,026 )\nGeneral and administrative expenses (606,641 ) (1,542,228 ) (261,207 ) (2,410,075 )\nIncome / loss from operations 179,725 (580,020 ) (261,207 ) (661,502 )\nTotal assets $ 2,683,037 $ 4,221,412 252,904 $ 7,157,352\nCapital Expenditure\nProperty and equipment $ 0 3,140,757 $ 3,140,757\nIntangible assets $ 0 2,245,231 $ 2,245,231\nFor the Year Ended and As of\nJune 30, 2022\nBy Country Malaysia Australia Other Segment Total\nRevenue $ 0 $ 2,839,357 $ 2,839,357\nCost of revenue (1,456,733 ) (1,456,733 )\nGeneral and administrative expenses (2,238,213 ) (630,705 ) (2,868,918 )\nLoss from operations (855,589 ) (630,705 ) (1,486,294 )\nTotal assets $ 0 $ 14,193,235 $ 14,193,235\nCapital Expenditure\nProperty and equipment $ 0 6,241,049 $ 6,241,049\nIntangible assets $ 0 $ 0\nFor the Year Ended and As of\nJune 30, 2021\nBy Country Malaysia Australia Other Segment Total\nRevenue $ 72,886 $ 2,896,713 - $ 2,969,599\nCost of revenue (28,942 ) (1,192,084 ) - (1,221,026 )\nGeneral and administrative expenses (6,556 ) (2,142,312 ) (261,207 ) (2,410,075 )\nIncome / loss from operations 37,388 (437,683 ) (261,207 ) (661,502 )\nTotal assets $ 1,868,411 $ 5,036,037 252,904 $ 7,157,352\nCapital expenditure\nProperty and equipment $ 0 3,140,757 $ 3,140,757\nIntangible assets $ 0 2,245,231 $ 2,245,231\nNOTE 22 - SUBSEQUENT EVENTS\nOn July 1, 2022, under the agreement Rayont Inc., through its wholly owned subsidiary No More Knots (Ipswich) Pty Ltd, acquired the business of the Ipswich Massage from buyer OneDose Pty Ltd, in exchange for AUD825,000 (approximately USD600,000). Rayont will pay the purchase price in four instalments. As of today, it is remaining the last instalment that is due on July 5, 2023 in the amount of AUD51,000 (USD).\nOn August 22, 2022, under the agreement Rayont Inc., through its wholly owned subsidiary Rayont Australia Pty Ltd, acquired 100% of the total outstanding shares and units of The SkinDNA Company Pty Ltd, in exchange for AUD750,000 (approximately USD500,000). Rayont paid by issuing 1,524,044 of its shares to the shareholder of record of The Skin DNA Company Pty Ltd. The Corporations common stock was valued at USD0.34 per share on the OTC Markets on August 22, 2022.\nOn November 25, 2022, the Company received a termination request from the former shareholders of The SkinDNA Company Pty Ltd. Both parties are discussing ways how to resolve the concerns each party has through informal mediation.\nOn September 1, 2022, Rayont Inc., through its wholly owned subsidiary No More Knots Holdings Pty Ltd incorporated Biomimic Pty Ltd for the amount of $70.\nOn September 1, 2022, Rayont Inc., through its wholly owned subsidiary No More Knots Holdings Pty Ltd incorporated Health Script Pty Ltd for the amount of $70.\nOn September 1, 2022, under the agreement Rayont Inc., through its wholly owned subsidiary Health Script Pty Ltd, acquired the business of Tugun Compounding Pty Ltd, in exchange for AUD665,000 (approximately USD450,870). The sum of USD265,520 (AUD390,000) is made as the Cash Payment and USD 185,350 (AUD275,000) is paid by issuing 545,147 shares at $0.34 per share of Rayont Inc to the shareholder of record of Tugun Compounding Pty Ltd.\nOn September 1, 2022, under the agreement Rayont Inc., sold 100% of the total outstanding shares and units of Rayont (Australia) Pty Ltd, Prema Life Pty Ltd and Rayont Properties Pty Ltd ATF Rayont Property Trust, in exchange for AUD4,944,225 (approximately USD3,352,185) to the buyer Exit Properties Pty Ltd.\nOn September 3, 2022, under the agreement Rayont Inc., through its wholly owned subsidiary Health Script Pty Ltd, acquired the business of Prema Life Pty Ltd, in exchange for AUD1,050,000 (approximately USD718,725).\nOn October 5, 2022 three board directors of Rayont Inc , Mark Rudulph Van Wyk, Thea Dillon and Jason Adam Sunstein resigned from their position as Board of Directors of their own accord.\nThe Company relied upon Section 4(2) and Regulation S of the Securities Act of 1933, as amended, for the sale of these securities. No commissions were paid regarding the share issuance and they were issued in book entry form with a Rule 144 restrictive legend. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nDisclosure controls and procedures are designed with an objective of ensuring that information required to be disclosed in our periodic reports filed with the Securities and Exchange Commission, such as this Annual Report on Form 10-K, is recorded, processed, summarized and reported within the time periods specified by the Securities and Exchange Commission. Disclosure controls are also designed with an objective of ensuring that such information is accumulated and communicated to our management, including our chief executive officer, in order to allow timely consideration regarding required disclosures.\nThe evaluation of our disclosure controls by our principal executive officer included a review of the controls objectives and design, the operation of the controls, and the effect of the controls on the information presented in this Annual Report. Our management, including our Chief Executive Officer, does not expect that disclosure controls can or will prevent or detect all errors and all fraud, if any. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Also, projections of any evaluation of the disclosure controls and procedures to future periods are subject to the risk that the disclosure controls and procedures may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nAs of the end of the period covered by this report, we carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934 as of the end of the period covered by this report. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that there were significant deficiency in our internal controls over Financial reporting as of June 30, 2022 and they were therefore not as effective as they could be to ensure that information required to be disclosed by us in reports that we file or submit under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms. The significant deficiency in our controls and procedure were lack of formal documents such as invoices and lack of evidence for proper approval and review of disbursements. Management does not believe that any of these significant deficiency materially affected the results and accuracy of its financial statements. However, in view of this discovery of such weaknesses, management has begun a review to improve them.\nManagements Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting for the company in accordance with as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the (i) effectiveness and efficiency of operations, (ii) reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles, and (iii) compliance with applicable laws and regulations. Our internal controls framework is based on the criteria set forth in the Internal Control - Integrated Framework that was issued in 2013 by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagements assessment of the effectiveness of the small business issuers internal control over financial reporting is as of the year ended June 30, 2022. We believe that internal controls over financial reporting as set forth above shows some weaknesses and are not effective. We have identified certain weaknesses considering the nature and extent of our current operations and any risks or errors in financial reporting under current operations.\nThis annual report does not include an attestation report of the companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to rules of the SEC that permit the Company to provide only managements report in this annual report.\nSubsequent to the end of the period covered by this report, and in light of the weakness described above, management is in the process of designing and implementing improvements in its internal control over financial reporting and we currently plan tom hire an independent third party consultant to assist in identifying and determining the appropriate accounting procedures and controls to implement. ITEM 9B. OTHER INFORMATION.\nNone\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nThe following table contains the name, age of our Directors and executive officers as of June 30, 2022.\nName\nAge\nPosition Held\nHeld Office Since\nMarshini Thulkanam\nChief Financial Officer and Director\nDhurata Toli\nSecretary\nMark Rudulph Van Wyk\nIndependent Director\nThea Dillon\nIndependent Director\nJason Adam Sunstein\nIndependent Director\nThe directors will serve until the next annual meeting of stockholders of the Company and until such directors successor is elected and qualified or until such directors earlier death, resignation or removal. The following is information concerning the business background of Ms. Thulkanam.\nMs. Thulkanam has over 20 years in public practice, as well as the commercial environment. She provides accounting, CFO on demand and tax solutions to her variety of clients from diverse industries, including hospitability, retail, health, professional services, property developments, and medical centres and construction companies. Ms. Thulkanam graduated from Massey University, New Zealand and has worked in both New Zealand and Australian Chartered Accounting Firms. She is a member of the Chartered Accountants Australian and New Zealand and a Registered Tax Agent. Her focus is family businesses from start up to complex entities and takes great pride in assisting her clients navigate through Australias complex tax systems to provide great outcomes. Ms. Thulkanam is the founder and Managing Director of Accounting Biz Solutions Pty Ltd, an accounting and bookkeeping practice in Queensland, Australia. She is the CFO on demand for a number of private funds such as Future Asset Management International Ltd and Zenio Capital Ltd.\nMs. Toli has extensive experience in both government and private sector for over 21 years in financial analyses, accounting, financial controls, reporting and taxation, financial, market risk profiling, trainings. Ms. Toli started her career with NOA in management and risk analysis before managing a branch of BKT Bank. Thereafter, she worked with the Municipality of Tirana as Director of Operations and then with Abkons company on the Trans Adriatic Pipeline as a Financial Consultant. In 2017, Ms. Toli became the Financial Controller and Secretary of a USA public corporation with subsidiaries in Australia and Malaysia, overseeing all aspects of the Companys accounting functions including planning, executing, controlling, reporting all financial matters and as an active member of the M&A team. In addition, she was the Board Secretary for Corporation. Ms. Toli earned her Master of Science degree in banking from the University of New York Tirana in collaboration with the Institute Universitaire Kurt Bosch in Switzerland and Masters Degree in Finance and Accounting from Tirana University. She also holds an Approved Accounting Certificate, Real Estate Appraiser and Six Sigma Quality Improvement Project for Loan Assessment and Approval Process Mapping delivered by IMPACT W.L.L.\nMs. Dillon has extensive experience within the Remedial Massage & Myotherapy profession having successfully founded and operated a number of South East Qld based businesses in the industry over the past 15 years. She is passionate about enriching lives and enhancing health & wellbeing, and enjoys passing her wealth of knowledge & expertise to others so that they may thrive personally and professionally.\nThea holds a Diploma of Remedial Massage, Adv Diploma of Myotherapy, an Honors Degree in Exercise Science & a Certificate IV in Training & Assessment, and is an accomplished High Performance Sport Therapist, having worked with the Australian Olympic Team on multiple occasions. She was a founding partner of Gold Coast Physio & Sports Health in 2008 and remained an Owner through to 2013 before continuing as a Principal Remedial Massage Therapist through to 2016. She has been the Owner and Principal Therapist of No More Niggles since November 2016 where she provides exceptional remedial and sports massage services.\nFrom December 2018 through January 2021, Thea was a Trainer at Massage Schools of QLD, designing and delivering remedial massage & myotherapy training content at post graduate level. From 2019 through 2021, Thea was in the Lead Soft Tissue Therapy role for the Australian Olympic Team in Tokyo. She was also a Practice Manager at No More Knots throughout 2020 and continues to deliver professional development and mentoring sessions across the No More Knots Team.\nMr. Sunstein was one of the founders and since October 2013, has been the CFO and a director of International Land Alliance, Inc., a publicly traded company, engaged in residential land development with target properties located primarily in the Baja California Northern region of Mexico. Mr. Sunstein brings finance, mergers and acquisitions and general management experience. Since 1989, he has participated in a broad variety of both domestic and international structured investments and financings, ranging from debt and preferred stock to equity and developmental capital across a wide variety of infrastructure and corporate financings. He has been involved in numerous start-ups, turnarounds and public companies. Mr. Sunstein serves as on the Board of Directors of several public and private companies. In December 2014 Mr. Sunstein filed for Chapter 7 bankruptcy, and it was discharged May 2015. He attended San Diego State University where he majored in Finance and has held NASD Series 7 (General Securities Representative) and Series 63 licenses.\nMr. Van Wyk is a seasoned business leader and strategist with a diverse 37 year global career across several industry sectors including health and aged care services, community services, environmental, financial and professional services, engineering, infrastructure, mining/resources, construction, manufacturing, building services and agriculture. He holds qualifications from the University of Pretoria (South Africa), Graduate School of Business at the University of Cape Town (South Africa) and De Montfort University in Leicester (United Kingdom). Mark is a Member of the Australian Institute of Company Directors, Fellow of the International Institute of Directors and Managers, a Member of the CEO Institute, a Member of the Advisory Board Centre and is also a Certified CEO and an advisory board Certified Chair™. He has held senior positions and executive roles in several listed Australian companies. Entrepreneur and founder of eleven SMEs. Board Experience having served as Advisory Board Member, Chairperson, Executive Director, Non-Executive Director, Alternate Director, Company Secretary and Committee Member. His most recent experience includes being a Non-Executive Director of Smiles Inclusive Limited, an Australian dental services provider since July 2021 and Chairman and Executive Director of Paying.Green Holdings, a global profit-for-purpose organisation focused on delivering sustainable environmental solutions to businesses since 2020. Prior to this Mark was Chairman and Executive Director of Medicrew Holdings, an integrated primary health care services provider with a number of medical centres across South East Queensland from July 2015 to June 2021. ITEM 11. EXECUTIVE COMPENSATION.\nExecutive Compensation\nThe following table sets forth the compensation paid to each of our principal executive officers (the Named Executive Officers) during the last three completed fiscal years:\nSUMMARY COMPENSATION TABLE\nManagement Compensation\nName and Fiscal\nYears Ended\nJune 30, 2022,\nand 2020\nFees earned or paid in cash ($) Stock awards ($) Option awards ($) Non-equity incentive plan compensation ($) Nonqualified deferred compensation earnings ($) All other compensation ($) Total ($)\nMarshini Alyia Moodley (1)\nFY 2022 -\n- - - - -\nFY 2021 -\n- - - - -\nFY 2020\n8,000 - - -\n8,000\nAleem Sheikh(2) -\n- - - - -\nDhurata Toli (3)\nFY 2022 - - - - - 60,000 60,000\nFY 2021 - - - - - 14,000 14,000\nReyad Fezzani (4) FY 2022 - 40,000 - - - - 40,000\nLeilani Latimer (5) FY 2022 - 12,500 - - - - 12,500\nMark Rudulph Van Wyk (6) FY FY 2022 - 2,000 - - - - 2,000\nThea Dillon (7) FY 2022 - 2,000 - - - - 2,000\nJason Adam Sunstein(8) FY - 5,000 - - - - 5,000\nGreg Jackson FY 2019 (9) - 4,000 - - - - 4,000\nChin Kha Foo (10) FY 2019 - - - - - - -\n(1) Ms. Thulkanam resigned as CEO, President and Secretary on March 25, 2021 and was appointed as President, CEO and Director on February 28, 2022.\n(2) Mr. Sheikh was appointed as President, CEO and Director on March 25, 2021 and resigned on February 28, 2022\n(3) Ms. Toli was appointed as Secretary on March 25, 2021\n(4) Mr. Fezzani was appointed as Director on March 12, 2021 and resigned on April 19, 2022\n(5) Ms. Latimer was appointed as Director on April 22, 2021 and resigned on April 20, 2022\n(6) Mr. Van Wyk was appointed as Director on April 21, 2022 and resigned on October 5, 2022\n(7) Ms. Dillon was appointed as Director on April 21, 2022 and resigned on October 5, 2022\n(8) Mr. Sunstein was appointed as Director on April 21, 2022 and resigned on October 5, 2022.\n(9) Mr. Jackson was appointed a Director, CEO, President, CFO and Secretary on August 9, 2019 and resigned on March 31, 2020\n(10) Mr. Foo was appointed a Director and President/CEO/CFO on July 2, 2017 and resigned on August 9, 2019\nCompensation of Directors\nEach Director that is not an officer is reimbursed the reasonable out-of-pocket expenses in connection with their travel to attend meetings of the Board of Directors. No payments were made to our current directors for the fiscal years ended 2022, 2021 and 2020. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nSecurity Ownership of Certain Beneficial Owners and Management\nThe following table sets forth information as of the Record Date with respect to the beneficial ownership of Common Stock by (i) each person known by us to be the beneficial owner of more than 5% of our outstanding Common Stock after the Closing Date (ii) our current directors, (iii) each person who will become a director on or after the tenth day following our mailing of this Information Statement, (iv) each of newly named executive officers and (v) all of our newly named executive officers and directors as a group.\nBeneficial ownership is determined in accordance with the rules of the SEC. Except as indicated by footnote and subject to community property laws, where applicable, to our knowledge the persons named in the table below have sole voting and investment power with respect to all shares of Common Stock that are shown as beneficially owned by them. In computing the number of shares of Common Stock owned by a person and the percentage ownership of that person, any such shares subject to options and warrants held by that person that are exercisable as of the Record Date or that will become exercisable within 60 days thereafter are deemed outstanding for purposes of that persons percentage ownership but not deemed outstanding for purposes of computing the percentage ownership of any other person. The percent of class is based on 50,163,797 shares of common stock issued and outstanding as of June 30, 2022. Unless otherwise indicated, the mailing address of each officer and director is c/o Rayont Inc., 228 Hamilton Avenue, 3rd Floor, Palo Alto, California 94301\nOfficers and Directors Shares of\nCommon\nstock\nPercentage\nMarshini Alyia Moodley 550,000 1.096 %\nMark Rudulph Van Wyk 2,500 0.005 %\nDhurata Toli 200,000 0.399 %\nThea Dillon 2,500 0.005 %\nJason Adam Sunstein 6,250 0.012 %\nAll Officers and Directors as a Group (5) 761,250 1.517 %\nMore than 5% Beneficial Owners:\nRural Asset Management Services, Inc. (1) 4,232,000 8.436 %\nTaleo Holdings (L) LTD (2) 20,803,079 41.470 %\n(1) The principal owner of Rural Asset Management Services, Inc is Si Jing Yi and its address is Kensington Gardens, No. U1317 Lot 7616, Jalan Jumider, Federal Territory, Malaysia.\n(2) The principal owner of Taleo Holdings (L) LTD is Ali Kasa and its address is 3 Spica Drive, Tanah Merah, 4128 QLD, Australia.\nLegal Proceedings\nThe Company is not aware of any legal proceedings in which any director, officer, or any owner of record or beneficial owner of more than 5% of any class of voting securities of the Company, or any affiliate of any such director, officer, affiliate of the Company, or security holder, or any person who will become a director upon completion of the transactions contemplated by the Agreement is a party, or any information that any such person is adverse to the Company or has a material interest adverse to the Company.\nCORPORATE GOVERNANCE\nThe Board of Directors\nAs set forth in our Articles of Incorporation and Bylaws, all directors of the Company hold office until the next annual meeting of stockholders or until their successors have been duly elected and qualified. Other than as disclosed in this Information Statement, to the knowledge of the Company, are no agreements with respect to the election of directors. The Companys executive officers serve at the discretion of the Board.\nCode of Ethics\nWe have not adopted a written Code of Ethics at this time that applies to our principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions. Our Board of Directors are reviewing the necessity of adopting such a document given we are still in the start-up exploration stage and have limited employees, officers and directors.\nNominating Committee\nWe do not have a Nominating Committee. Since our formation we have relied upon the personal relationships of our President to attract individuals to our Board of Directors.\nWe do not have a policy regarding the consideration of any director candidates which may be recommended by our stockholders, including the minimum qualifications for director candidates, nor has our Board of Directors established a process for identifying and evaluating director nominees. We have not adopted a policy regarding the handling of any potential recommendation of director candidates by our stockholders, including the procedures to be followed. Our Board has not considered or adopted any of these policies as we have never received a recommendation from any stockholder for any candidate to serve on our Board of Directors. Given our relative size and lack of directors and officers insurance coverage, we do not anticipate that any of our stockholders will make such a recommendation in the near future. While there have been no nominations of additional directors proposed, in the event such a proposal is made, all members of our Board will participate in the consideration of director nominees.\nCompensation Committee\nWe do not have a Compensation Committee. Our entire Board of Directors review and recommend the salaries, and benefits of all employees, consultants, directors and other individuals compensated by us.\nAudit Committee\nWe do not have a standing Audit Committee. The functions of the Audit Committee are currently assumed by our Board of Directors. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nThe related parties of the Company with whom transactions are reported in the consolidated financial statements are as follows:\nName\nRelationship\nRural Asset Management Services, Inc. (Rural)\nOne of major shareholder of Rayont Inc\nTheAlikasa (Australia) Pty Ltd\nCommon director / shareholder of the Company\nBlue Pacific Academy\nEntity under the same beneficial owner/ common directors\nHealth Script Pty Ltd\nEntity under the same beneficial owner/ common directors\nAccounting Business Solutions Pty Ltd\nEntity under the same beneficial owner/ common directors\nAbrar Investments Pty Ltd\nCommon shareholder\nTasman Accounting Pty Ltd\nEntity under the same beneficial owner/ common directors\nVantis Partners Pty Ltd\nEntity under the same beneficial owner/ common directors\nAmount due from related parties\nJune 30, 2022 June 30, 2021\nTheAliKasa Australia Pty Ltd $ 20,097 $ -\nRural Asset Management Services - 11,881\nBlue Pacific Academy - 4,000\nHealth Script Pty Ltd 45,919 -\nTotal $ 66,016 $ 15,881\nAs of March 31, 2022 and June 30, 2021, Rayont International (L) had loans receivable of $11,881 from Rural Asset Management Services. On June 30, 2020, the company agreed to grant a loan to the Rural for the amount of $91,823. The loan bears no interest rate and receivable on demands. Due to the short maturity of the loan, the Company had a current loans receivable of $91,823 as of September 30, 2020. The Company made a three-party agreement on December 31, 2020 between its subsidiary Rayont International (L), Rayont Inc and Rural in order to eliminate the loans from /to Rural and there is no need for money to move around. The remaining balance of $11,881 will be received on demands.\nAs of March 31, 2022 and June 30, 2021, Rayont International (L) Ltd had loans receivable of $4,000 from Blue Pacific Academy. The loans receivable was non-interest bearing and due upon request. this loan is paid back on June 30, 2022.\nAs of June 17, 2022 and June 30, 2021, Rayont (Australia) Pty Ltd has loans receivable of $45,919 and $nil from Health Script Pty Ltd. This is a prepayment for acquisition of the Tugan business that is completed in September 1, 2022. The loans receivable was non-interest bearing and due upon request and it is.\nAs of June 30, 2022 and June 30, 2021, Prema Life Pty Ltd and Wonder Foods Pty Ltd had amount receivable of $20,097 and $nil from director of the company. Prema Life Pty Ltd owed the director $386,105 as of June 30, 2021. In repaying this amount Prema Life Pty Ltd as of June 30, 2022 had paid $20,097 more than it was supposed to pay. This was not meant to be a loan but rather an oversight of the accounts. The oversight indicates a deficiency of internal control over financial reporting under the current operations. The Management has taken immediate remedial action rectifying the overpayment. As at 30 September 2022, the Director loan is not overdrawn. Prema Life Pty Ltd was sold on September 1, 2022 to unrelated party and this loan has been reconciled as part of that transaction.\nAmounts due to related parties\nAs of June 30, 2022 and June 30, 2021, the Company had amount due to related parties as follows:\nJune 30, 2022 June 30, 2021\nAccounting Business Solutions Pty Ltd $ - $ 1,133\nAbrar Investments Pty Ltd -\nDirectors loan - 386,105\nTasman Accounting Pty Ltd 3,453\nVentis Partners Pty Ltd 125,162\nTotal $ 128,677 $ 387,238\nOn August 1, 2021 the director has given a loan amount of $386,105 which is used to pay the property that is bought from Prema Life Pty Ltd. This loan has 3% interest per annum and it is fully settled as of December 31, 2021.\nOn May 4, 2022 the Ventis Partners Pty Ltd has given a loan amount of $125,162 which is used to pay the properties that is bought from Rayont Properties Pty Ltd. This loan is non-interest bearing and payable on demand.\nOn June 5, 2022 the Tasman Accounting Pty Ltd has given a loan amount of $3,453 which is used to pay the operation expenses of No More Knots (Taringa) Pty Ltd. This loan is non-interest bearing and payable on demand.\nThe other amounts due to related parties were non-interest bearing and payable on demand. The amounts were used to support its operation, to acquire the properties.\nDirector Independence\nOur board of directors has determined that we have two board members that qualifies as independent as the term is used in Item 7(d)(3)(iv)(B) of Schedule 14A under the Securities Exchange Act of 1934, as amended, and as defined by Rule 4200(a)(15) of the NASDAQ Marketplace Rules.\nOur Common Stock is traded on the OTC Pink Limited under the symbol RAYT. The OTC Bulletin Board electronic trading platform does not maintain any standards regarding the independence of the directors for our Board and we do not believe we are subject to the requirements of any national securities exchange or an inter-dealer quotation system with respect to the need to have any and/or a majority of our directors be independent. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nJP Centurion & Partners Plt is our current independent auditor for the fiscal year ended on June 30, 2022 and June 30, 2021.\nThe following table shows the fees paid or accrued by us for the audit and other services provided by, Total Asia Associates Plt and JP Centurion & Partners Plt, our auditors for the 12 months ended June 30, 2022 and June 30, 2021, respectively.\nAudit Fees (i) $ 16,050 $ 55,227\nAudit-Related Fees (ii) - -\nTax Fees (iii) - -\nAll Other Fees (iv) - -\nTotal $ 16,050 $ 55,227\nAs defined by the SEC, (i) audit fees are fees for professional services rendered by our principal accountant for the audit of our annual financial statements and review of financial statements included in our Form 10-K, or for services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years; (ii) audit-related fees are fees for assurance and related services by our principal accountant that are reasonably related to the performance of the audit or review of our financial statements and are not reported under audit fees; (iii) tax fees are fees for professional services rendered by our principal accountant for tax compliance, tax advice, and tax planning; and (iv) all other fees are fees for products and services provided by our principal accountant, other than the services reported under audit fees, audit-related fees, and tax fees.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nThe following documents are exhibits to this report.\nNumber\nDescription\n31.1\nCertification of our President and Chief Executive Officer, under Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of our Chief Financial Officer, under Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification of our President, Chief Executive Officer and Chief Financial Officer, under Section 906 of the Sarbanes-Oxley Act of 2002.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nRAYONT INC.\nDate: December 29, 2022 By: /s/ Marshini Aliya Moodley\nMarshini Aliya Moodley\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacity and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Marshini Aliya Moodley\nPrincipal Executive Officer & Director\nMarshini Aliya Moodley\nDecember 29, 2022\n/s/ Marshini Aliya Moodley,\nPrincipal Accounting Officer & Director\nMarshini Aliya Moodley\nDecember 29, 2022\nEXHIBIT INDEX\nNumber\nDescription\n10.1\nOn January 22, 2019, the Company entered into and closed an Acquisition Agreement with THF Holdings Pty Ltd., an Australian corporation (THF)\n10.2\nOn September 30, 2020, pursuant to an Acquisition Agreement, Rayont Inc. (the Company), acquired all of the issued and outstanding capital stock of Rayont International (L) Limited, a Malaysian company.\n10.3\nAssets Purchase Agreement with Workstar Tech (Aust) Pty Ltd\n10.4\nOn December 23, 2020, pursuant to an Acquisition Agreement, Rayont Australia Pty Ltd, a wholly-owned subsidiary of Rayont Inc. (the Company), acquired all of the issued and outstanding capital stock of Prema Life Pty Ltd, an Australian company (Prema Life)\n10.5\nOn December 23, 2020, pursuant to an Acquisition Agreement, Rayont Australia Pty Ltd, a wholly-owned subsidiary of Rayont Inc. (the Company), acquired all of the issued and outstanding capital stock of GGLG Properties Pty LTD, an Australian company (GGLG)\n10.6\nOn March 12, 2021, in the best interests of the Company, the Board appointed Reyad Fezzani to be a Chairman of the Board of Directors of the Company.\n10.7\nOn April 1, 2022, pursuant to an Acquisition Agreement, No More Knots Holdings Pty Ltd, a wholly-owned subsidiary of Rayont Inc. (the Company), acquired all of the issued and outstanding capital stock of No More Knots Pty LTD, No More Knots (Taringa) Pty Ltd and No More Knots (Newmarket) Pty Ltd, Australian companies.\n10.8\nOn July 1, 2022, under the agreement Rayont Inc., through its wholly owned subsidiary No More Knots (Ipswich) Pty Ltd, acquired the business of the Ipswich Massage from buyer OneDose Pty Ltd,.\n10.9\nOn September 1, 2022, under the agreement Rayont Inc., through its wholly owned subsidiary Health Script Pty Ltd, acquired the business of Tugun Compounding Pty Ltd.\n10.10\nOn September 1, 2022, under the agreement Rayont Inc., sold 100% of the total outstanding shares and units of Rayont (Australia) Pty Ltd, Prema Life Pty Ltd and Rayont Properties Pty Ltd ATF Rayont Property Trust to the buyer Exit Properties Pty Ltd.\n10.11\nOn September 3, 2022, under the agreement Rayont Inc., through its wholly owned subsidiary Health Script Pty Ltd, acquired the business of Prema Life Pty Ltd.\n31.1\nCertification of our President and Chief Executive Officer, under Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of our Chief Financial Officer, under Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification of our President, Chief Executive Officer and Chief Financial Officer, under Section 906 of the Sarbanes-Oxley Act of 2002."
}