{
    "cik": "1554906",
    "company": "Crown Baus Capital Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-10-10",
    "period_of_report": "2021-04-30",
    "sic": "7200",
    "state_of_inc": "NV",
    "state_location": "A1",
    "fiscal_year_end": "0430",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1554906/0001477932-23-007491-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1554906/000147793223007491/cbca_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1554906/0001477932-23-007491.txt",
    "filename": "1554906_10K_2021_0001477932-23-007491.htm",
    "content": "ITEM 1. BUSINESS\nCorporate Background\nCrown Baus Capital Corp. (We or the Company) was incorporated pursuant to the laws of the State of Nevada on August 8, 2011, as Flow Tech Solutions, Inc. We changed our name to World Stevia Corp. on August 15, 2013, then to Cannabis Capital Corp. on March 3, 2014, and finally to Crown Baus Capital Corp. on May 27, 2014.\nOverview of Business and Operations\nThe Companys mission is to work together with our shareholders, investors, and communities to create long-term value.\nOur strategy is to identify companies in industries that complement the expertise of our management team, Board of Directors, and partners. Our managements track record provides a highly attractive opportunity for prospective targets looking for proven value, liquidity, and capital procurement.\nThe Company is focused on becoming a global acquisitions-based company targeting high tech industries and financial services.\nEmployees\nWe have two executives who are shareholders and currently contribute their time. The Company uses several consultants to assist in locating potential target companies and procure the financial resources required for the success of our business plan.\nGovernment Regulation\nWe are currently not subject to any specific government regulation.\nSubsidiaries\nWe do not have any subsidiaries.\nIntellectual Property\nWe have no intellectual property other than own our domain address which signifies our online presence. Our trade name is our company name which is legally incorporated in the State of Nevada. ITEM 1A. RISK FACTORS\nSmaller reporting companies are not required to provide disclosure pursuant to this Item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nAs the Company is neither an accelerated filer nor a large, accelerated filer, as defined in Rule 12b-2 of the Exchange Act (§240.12b-2 of this chapter) or is a well-known seasoned issuer, the Company is not required to provide disclosure pursuant to this Item. ITEM 2. PROPERTIES\nThe Companys office address is located at Suite 204 - 2383 King George Blvd, Surrey, British Columbia V4A5A4 Canada. The office space is contributed by our management. ITEM 3. LEGAL PROCEEDINGS\nNone. ITEM 4. MINE SAFETY DISCLOSURES\nNot Applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nThe Companys Common Stock trades on the OTC Markets platform under the symbol CBCA.\nPrice Range of Common Stock\nThe following information reflects the high and low bid prices of the Companys common stock on the OTC Markets platform.\nQuarterly period\nHigh\nLow\nFiscal year ended April 30, 2021:\nFirst Quarter\n$ .78\n$ .18\nSecond Quarter\n$ .78\n$ .18\nThird Quarter\n$ .75\n$ .06\nFourth Quarter\n$ .75\n$ .09\nFiscal year ended April 30, 2020:\nFirst Quarter\n$ 1.12\n$ .75\nSecond Quarter\n$ .80\n$ .22\nThird Quarter\n$ 1.10\n$ .16\nFourth Quarter\n$ 1.11\n$ .30\nCommon Stock\nAll outstanding shares of Common Stock are of the same class and have equal rights and attributes. The holders of Common Stock are entitled to one vote per share on all matters submitted to a vote of the Companys stockholders. All stockholders are entitled to share equally in dividends, if any, as may be declared from time to time by the Board of Directors out of funds legally available. In the event of liquidation, the holders of Common Stock are entitled to share ratably in all assets remaining after payment of all liabilities. The stockholders do not have cumulative or preemptive rights.\nOur transfer agent is Empire Stock Transfer. Their mailing address is 1859 Whitney Mesa Dr, Henderson, NV 89014. The telephone and email address are (702)-818-5898 and casey@empirestock.com.\nThe description of certain matters relating to the securities of the Company is a summary and is qualified in its entirety by the provisions of the Companys Certificate of Incorporation, as amended, and By-Laws.\nHolders\nAs of the date of this filing we had approximately 60 shareholders of record of our common stock, including Cede and Co. which holds shares for the beneficial interest of an unknown number of stockholders in brokerage accounts.\nDividends\nThe Company has not paid any cash dividends to date and does not anticipate or contemplate paying dividends in the foreseeable future. It is the present intention of management to utilize all available funds for the development of the Companys business.\nStock Option/Warrant Grants\nAs of the date of this filing, the Company has no outstanding Option/Warrant grants.\nRecent Sales of Unregistered Securities\nNone. ITEM 6. SELECTED FINANCIAL DATA\nAs a smaller reporting company as defined in Rule 12b-2 of Regulation S-K, the Company is not required to provide information required by Item 301 of Regulation S-K with respect to Selected Financial Data. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCurrent Operations\nPlan of Operations\nThe Companys current plan of operations for the twelve months ending April 30, 2021, involved the continued development of the business plan.\nOur ability to implement the phases of our business plan was dependent on us obtaining significant financing for these projects, which we were unable to secure during the year ending April 30, 2021.\nGoing Concern\nWe do not currently have any financing arranged and we cannot provide investors with any assurance that we will be able to raise sufficient funding from the sale of our common stock to fund further phases of our business plan. Even if we are successful in obtaining equity financing to fund our joint venture, there is no assurance that we will obtain the funding necessary to pay our creditors and note-holders on a timely basis. As a result, investors in our common stock would most likely lose all of their investments.\nResults from Operations - For the years ended April 30, 2021, as compared to April 30, 2020 .\nOperating results for the years ended April 30, 2021, and 2020 are summarized as follows:\nYears Ended April 30,\nRevenue\n$ -\n$ -\nOperating expenses\n6,112\n205,411\nOther income (expense)\n-\n-\nNet operating gain (loss)\n$ (6,112 )\n$ (205,411 )\nOur net operating loss decreased $199,299 for our year ended April 30, 2021, from our year ended April 30, 2020. During the year ended April 30, 2021, our operating expenses decreased $199,299 from the year ended April 30, 2020. The decrease in expenses was mainly comprised of a decrease in management fees.\nLiquidity and Capital Resources\nAs of April 30, 2021, we had cash of $1,025 and our working capital deficit was $331,354. In 2021, we generated revenues of $0 and a net loss of $6,112 from operations as compared to 2020 revenues of $0 and a net operating expense of $205,411.\nThe Company expects significant capital expenditure during the next 12 months, contingent upon raising additional capital. We anticipate that we will need a minimum of $2,000,000 for operations for the next 12 months.\nThe source of such capital is uncertain, and there is no assurance that the Company will be successful in obtaining such capital on commercially reasonable terms, or at all. We have a working capital deficit and will need cash infusions from investors and/or current shareholders to deploy our current business plan and joint venture.\nTo implement our business plan, we will need to continue to raise working capital in the form of equity in an amount up to $2,000,000 over the twelve-month period ending April 30, 2021, on terms and conditions to be determined. If we were unable to raise any funds from the sale of equity, management may elect to seek subsequent interim or bridge financing in the form of debt as may be necessary.\nAt this time, management is unable to determine the specific amounts and terms of such future financing, or whether or not we will be successful in raising such funds on a basis acceptable to us.\nIn order to finance the operations of the Company during the twelve months ending April 30, 2021, and 2020, the Companys management and/or shareholders entered a series of note transactions or accounts payable totaling $6,279 and $1,250, respectively.\nCash Flow\nYears Ended\nApril 30,\nNet cash provided (used) in operating activities\n$ (6,112 )\n$ (205,411 )\nNet cash used in investing\n-\n-\nNet cash provided (used) by financing activities\n6,279\n1,250\nNet increase (decrease) in cash\n$ 167\n$ (204,161 )\nCash used in operating activities for years ended April 30, 2021, and 2020 was primarily for expenses related to general operations and for Company incurred administrative expenses.\nGoing Concern\nManagement believes that our current financial condition, liquidity, and capital resources will not satisfy our cash requirements for the next twelve months to deploy our current business plan, and as such we will need to either raise additional proceeds through financing facilities, sales of securities and our officers and directors will need to make additional financial commitments to our Company, neither of which is guaranteed. We plan to satisfy our future cash requirements, primarily the working capital required to execute on our current business and fund our necessary operating expenses, through financial commitments from future debt facilities and equity sales, if and when possible.\nManagement believes that we may generate some revenues within the next 12 months of 2021, but that these revenues will not satisfy our cash requirements to implement our current business plan, which is subject to change depending upon pending business opportunities and available financing.\nWe had no committed source for funds as of April 30, 2021, other than our convertible debt instruments. No representation is made that any funds will be available when needed. In the event that funds cannot be raised when needed, we may not be able to carry out our business plan, may never achieve revenue, and could fail to satisfy our future cash requirements as a result of these uncertainties.\nIt will be necessary to raise working capital funds through equity and debt financing facilities, which are extremely difficult for a developmental stage company to secure and may not be available to us or on a basis favorable to us. However, if such debt financing is available, we would likely have to pay additional costs associated with high-risk loans and be subject to above market interest rates.\nThe Company has accumulated a deficit of $47,027,466 at, April 30, 2021. We currently have only limited working capital with which to continue our operating activities. The amount of capital required to sustain operations is subject to future events and uncertainties, but the Company anticipates it will need to obtain approximately $2,000,000 in additional working capital in the form of debt and/or equity in order to cover our current expenses over the next 12 months in furtherance of our business plan. Whether such capital will be obtainable or obtainable on commercially reasonable terms is at this date uncertain. These circumstances raise substantial doubt about the Companys ability to continue as a going concern.\nCritical Accounting Policies\nOur financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America, which require us to make estimates and judgments that significantly affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities at the date of the financial statements. Note 3, Summary of Significant Accounting Policies in the Notes to the Financial Statements for the year ended April 30, 2021, describes our significant accounting policies which are reviewed by management on a regular basis.\nCapital Expenditures\nWe have not incurred any material capital expenditures.\nOff-Balance Sheet Arrangements\nWe have not entered into any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources and would be considered material to investors. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nNot Applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nCROWN BAUS CAPITAL CORP.\nReport of Independent Registered Public Accounting Firm\nBalance Sheets\nStatements of Income\nStatements of Cash Flows\nStatements of Stockholders Equity\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo: Shareholders and\nBoard of Directors of Crown Baus Capital Corp.\nOpinion on the Financial Statements\nWe have audited the financial statements of Crown Baus Capital Corp. which comprise the balance sheets as of April 30, 2021 and April 30, 2020, and the related statements of operations, stockholders deficit, and cash flows for the years ended April 30, 2021, and April 30, 2020, and the related notes to the financial statements (collectively referred to as the \"financial statements\").\nIn our opinion, the accompanying financial statements present fairly, in all material respects, the financial position of Crown Baus Capital Corp. for the years ended April 30, 2021 and April 30, 2020, and the results of its operations and its cash flows for the two years ended April 30, 2021 in accordance with accounting principles generally accepted in the United States of America.\nSubstantial Doubt About the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has a working capital deficit, and accumulated deficit for the years ended April 30, 2021 and April 30, 2020. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2. The financial statements do not include adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\nWe have served as Crown Baus Capital Corps auditor since 2023.\nPCAOB ID: 06771\nWe have served as Crown Baus Capital Corps auditor since 2023.\nHouston, Texas\nSeptember 29, 2023\nCrown Baus Capital Corp.\nBalance Sheets\nApril 30, 2021, and 2020\nASSETS\nCurrent Assets:\nCash and equivalents\n$ 1,025\n$ 858\nPrepaid expenses\n-\n-\nTotal current assets\n1,025\nOther Assets\nInvestment\n-\n-\nTOTAL ASSETS\n$ 1,025\n$ 858\nLiabilities\nAccounts payable and accrued expenses\n$ 75,167\n$ 75,167\nLoans payable - non affiliates\n200,000\n200,000\nLoans payable - stockholders\n63,324\n57,045\nTotal current liabilities\n338,491\n332,212\nStockholders' Deficit:\nCommon stock, $0.001 par value; 200,000,000 shares authorized, 161,050,000 and 161,050,000 shares issued and outstanding, respectively\n161,050\n161,050\nAdditional paid in capital\n46,550,000\n46,550,000\nCancellation receivable\n(21,050 )\n(21,050 )\nDeficit accumulated during development stage\n(47,027,466 )\n(47,021,354 )\nTotal Stockholders' Deficit\n(337,466 )\n(331,354 )\nTOTAL LIABILITIES AND STOCKHOLDERS' DEFICIT\n$ 1,025\n$ 858\nSee accompanying notes to financial statements\nCrown Baus Capital Corp.\nStatements of Operations\nFor the years Ended April 30, 2021, and 2020\nRevenue\n$ -\n$ -\nExpenses:\nOfficers compensation\n-\n-\nManagement fees\n-\n200,000\nProfessional fees\n-\n-\nOther\n6,112\n5,411\n6,112\n205,411\nOperating loss\n(6,112 )\n(205,411 )\nNet gain (loss) before provision for income taxes\n(6,112 )\n(205,411 )\nProvision for income taxes\n-\n-\nNet gain (loss)\n$ (6,112 )\n$ (205,411)\nBasic and diluted loss per share\n$ 0.00\n$ (0.00 )\nBasic and diluted weighted average\nNumber of shares outstanding\n161,050,000\n161,050,000\nSee accompanying notes to financial statements\nCrown Baus Capital Corp.\nStatements of Stockholders Deficit\nFor the Years Ended April 30, 2021, and 2020\nCommon Stock\nShares\nAmount\nAdditional Paid-in Capital\nCommon Stock\nto be returned\nAccumulated Deficit\nTotal Stockholders' Deficit\nBalance, April 30, 2020\n161,050,000\n$ 161,050\n$ 46,550,000\n$ (21,050 )\n$ (47,021,354 )\n$ (331,354 )\nNet loss\n-\n-\n-\n-\n(6,112 )\n(6,112 )\nBalance April 30, 2021\n161,050,000\n$ 161,050\n$ 46,550,000\n$ (21,050 )\n$ (47,027,466 )\n$ (337,466 )\nSee accompanying notes to financial statements\nCrown Baus Capital Corp.\nStatements of Cash Flows\nFor the Years Ended\nFrom April 30, 2021 to April 30, 2020\nCash flows from operating activities:\nNet gain (loss)\n$ (6,112 )\n$ (205,411 )\nAccounts payable and accrued expenses\n-\n200,000\n-\n-\nNet cash used by operating activities\n(6,112 )\n(5,411 )\nCash flows from financing activities:\nStockholder's loans\n6,279\n1,250\nNet cash provided by financing activities\n6,279\n1,250\nNet change in cash and cash equivalents\n(4,161 )\nCash and cash equivalents - beginning of period\n5,019\nCash at end of period\n$ 1,025\n$ 858\nSupplemental cash flow information:\nCash paid for interest\n-\n-\nCash paid for income tax\n-\n-\nNon-cash Investing and Financing Activity:\nConversion of accounts payable to notes payable\n-\n200,000\nReconciliation of cash and non-cash:\nCash and cash equivalents - end of period\n$ 1,025\n$ (199,142 )\nNon-cash transaction\n$ -\n$ 200,000\nCash - end of period\n$ 1,025\n$ 858\nSee accompanying notes to financial statements\nCROWN BAUS CAPITAL CORP.\nNOTES TO FINANCIAL STATEMENTS\nNOTE 1. DESCRIPTION OF BUSINESS\nCrown Baus Capital Corp. (We or the Company) was incorporated pursuant to the laws of the State of Nevada on August 8, 2011, as Flow Tech Solutions, Inc. We changed our name to World Stevia Corp. on August 15, 2013, then to Cannabis Capital Corp. on March 3, 2014, and finally to Crown Baus Capital Corp. on May 27, 2014.\nOverview of Business and Operations\nThe Companys mission is to work together with our shareholders, investors, and communities to create long-term value.\nOur strategy is to identify companies in industries that complement the expertise of our management team, Board of Directors, and partners. Our managements track record provides a highly attractive opportunity for prospective targets looking for proven value, liquidity, and capital procurement.\nThe Company is focused on becoming a global acquisitions-based company targeting high tech industries and financial services.\nThe Company has negotiated with several targets, but none have accomplished the desired goals and were either abandoned or canceled after signing management or acquisition agreements These agreements were announced and their cancellations disclosed in various Form 8-K filed with the Securities and Exchange Commission from February 17, 2014, through October 24, 2014 (incorporated herein by reference).\nNOTE 2. BASIS OF PRESENTATION\nThe accompanying financial statements of the Company are presented in accordance with the requirements for Form 10-K and Regulation S-X. Accordingly, they do not include all of the disclosures required by generally accepted accounting principles. In the opinion of management, all adjustments (all of which were of a normal recurring nature) considered necessary to fairly present the financial position, results of operations, and cash flows of the Company on a consistent basis, have been made.\nGoing Concern\nThe Company has an accumulated deficit of $47,027,466. The Company currently has only limited working capital with which to continue its operating activities. The amount of capital required to sustain operations is subject to future events and uncertainties. The Company must secure additional working capital through loans, sale of equity securities, or a combination, in order to implement its current business plans. There can be no assurance that such funding will be available in the future, or available on commercially reasonable terms favorable to the Company. These conditions raise substantial doubt about the Company's ability to continue as a going concern.\nThe accompanying financial statements have been presented on the basis of the continuation of the Company as a going concern and do not include any adjustments relating to the recoverability and classification of recorded asset amounts or the amounts and classifications of liabilities that might be necessary should the Company be unable to continue as a going concern. Management continued to manage its costs for the year ended April 30, 2021, to ensure appropriate funding is on hand for its limited operations.\nNOTE 3. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation\nThe financial statements include the accounts of the Company. The Company did not have operations for the year ended April 30, 2021, or 2020.\nUse of Estimates\nThe preparation of financial statements in conformity with United States generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. The Company regularly evaluates estimates and assumptions related to intangible assets and deferred income tax asset valuation allowances. The Company bases its estimates and assumptions on current facts, historical experience, and various other factors that it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. The actual results experienced by the Company may differ materially and adversely from the Companys estimates. To the extent there are material differences between the estimates and the actual results, future results of operations will be affected.\nImpairment of Long-Lived Intangible Assets\nWe review our long-lived assets, including intangible assets subject to amortization, for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Impairment, if any, is measured as the excess of the carrying amount over the fair value based on market value (when available) or discounted expected cash flows of those assets and is recorded in the period in which the determination is made. Intangible assets not subject to amortization are tested annually for impairment and more frequently if events or changes in circumstances indicate that it is more likely than not that the asset is impaired.\nCash\nCash includes all highly liquid instruments with an original maturity of three months or less at the date of purchase. The Company maintains its cash in cash deposit accounts, which are insured by the Federal Deposit Insurance Corporation (FDIC) up to $250,000 per legal ownership. At times, the Companys accounts may exceed federally insured limits. To date, the Company has not experienced any losses in such accounts. At, April 30, 2021, and 2020, the Company had $1,025 and $858 in cash and no other cash equivalents, respectively.\nFair Value of Financial Instruments\nThe Companys financial instruments consist of cash, accounts payable, accrued liabilities, line of credit payable, loans from a related party, contingent consideration payable, and convertible note payable. The carrying amount of these financial instruments approximates fair value due either to length of maturity or interest rates that approximate prevailing market rates unless otherwise disclosed in these financial statements.\nDerivative Financial Instruments\nThe Company reviews the terms of convertible debt, equity instruments and other financing arrangements to determine whether there are embedded derivative instruments, including embedded conversion options that are required to be bifurcated and accounted for separately as a derivative financial instrument. Also, in connection with the issuance of financing instruments, the Company may issue freestanding options or warrants that may, depending on their terms, be accounted for as derivative instrument liabilities, rather than as equity. The Company may also issue options or warrants to non-employees in connection with consulting or other services.\nDerivative financial instruments are initially measured at their fair value. For derivative financial instruments that are accounted for as liabilities, the derivative instrument is initially recorded at its fair value and is then re-valued at each reporting date, with changes in the fair value reported as charges or credits to income. For warrant-based derivative financial instruments, the Company used the Black-Scholes option pricing model to value the derivative instruments. The Binomial Lattice Model may be used to provide a model that the Company believes provides a more representative model of future expenses, conversion periods and length of time to conversion than the Black Scholes based upon only the remaining short time to note maturities all existing notes have embedded conversion features that cause all of the following accounting treatments to be utilized. To the extent that the initial fair values of the freestanding and/or bifurcated derivative instrument liabilities exceed the total proceeds received, an immediate charge to income is recognized, in order to initially record the derivative instrument liabilities at their fair value.\nThe discount from the face value of the convertible debt or equity instruments resulting from allocating some or all of the proceeds to the derivative instruments, together with the stated interest on the instrument, is amortized over the life of the instrument through periodic charges to income, usually using the effective interest method.\nThe classification of derivative instruments, including whether such instruments should be recorded as liabilities or as equity, is reassessed at the end of each reporting period. If reclassification is required, the fair value of the derivative instrument, as of the determination date, is reclassified. Any previous charges or credits to income for changes in the fair value of the derivative instrument are not reversed. Derivative instrument liabilities are classified in the balance sheet as current or non-current based on whether or not net-cash settlement of the derivative instrument could be required within twelve months of the balance sheet date.\nRevenue Recognition\nIn May 2014, the FASB issued ASU 2014-09, Revenue from Contracts with Customers (ASU 2014-09) and Accounting Standards Codification (ASC) Subtopic 340-40, Other Assets and Deferred Costs - Contracts with Customers (ASC 340-40), (collectively, Topic 606). On January 1, 2019, the Company adopted Topic 606. ASU 2014-09 requires entities to recognize revenue through the application of a five-step model, which includes identification of the contract, identification of the performance obligations, determination of the transaction price, allocation of the transaction price to the performance obligations and recognition of revenue as the entity satisfies the performance obligations. The Company implemented ASU 2014-09 for the interim and annual reporting periods of 2015 through 2020, which resulted in no changes to our financial statements as there is no revenue reported in the years presented.\nBusiness Combinations\nEach investment in a business is being measured and determined whether the investment should be accounted for as a cost-basis investment, an equity investment, a business combination, or a common control transaction. An investment in which the Company do not have a controlling interest and which the Company is not the primary beneficiary but where the Company has the ability to exert significant influence is accounted for under the equity method of accounting. For those investments that we account for in accordance ASC 805, Business Combinations, the Company records the assets acquired and liabilities assumed at the managements estimate of their fair values on the date of the business combination. The assessment of the estimated fair value of each of these can have a material effect on the reported results as intangible assets are amortized over various lives. Furthermore, according to ASC 805-50-30-5, when accounting for a transfer of assets or exchange of shares between entities under common control, the entity that receives the net assets or the equity interests shall initially measure the recognized assets and liabilities transferred at their carrying amounts in the accounts of the transferring entity at the date of transfer.\nNet Income (Loss) Per Common Share\nBasic loss per common share (EPS) is calculated by dividing the net loss available to common shareholders by the weighted average number of common shares outstanding for the period. Diluted EPS reflects the potential dilution that could occur if securities or other contracts to issue common stock were exercised or converted into common stock. The number of common shares that are exercisable from warrants or converted from debt into common stock is material to affect diluted EPS results.\nStock-Based Compensation\nOn August 8, 2011, the Company adopted the fair value recognition provisions codified in ASC 718, Compensation-Stock Compensation. The Company adopted those provisions using the modified-prospective-transition method. Under this method, compensation cost recognized for all periods prior to April 30, 2012, includes a) compensation cost for all share-based payments granted prior to, but not yet vested as of November 30, 2005, based on the grant-date fair value and b) compensation cost for all share-based payments granted subsequent to November 30, 2005, based on the grant-date fair value. In addition, deferred stock compensation related to non-vested options is required to be eliminated against additional paid-in capital. The results for periods prior to April 30, 2012, were not restated.\nThe Company accounts for equity instruments issued in exchange for the receipt of goods or services from parties other than employees in accordance with ASC 505, Equity. Costs are measured at the estimated fair market value of the consideration received or the estimated fair value of the equity instruments issued, whichever is more reliably measurable. The value of equity instruments issued for consideration other than employee services is determined on the earliest of a performance commitment or completion of performance by the counterparty. There are no stock based compensation commitments in existence at, April 30, 2021.\nIncome Taxes\nPotential benefits of income tax losses are not recognized in the accounts until realization is more likely than not. The Company has adopted the accounting standards codified in ASC 740, Income Taxes as of its inception. Pursuant to those standards, the Company is required to compute tax asset benefits for net operating losses carried forward. The potential benefit of net operating losses has not been recognized in these financial statements because the Company cannot be assured it is more likely than not that it will utilize the net operating losses carried forward in future years.\nASC 740-10-25 prescribes recognition thresholds that must be met before a tax position is recognized in the financial statements and provides guidance on de-recognition, classification, interest and penalties, accounting in interim periods, disclosure, and transition. An entity may only recognize or continue to recognize tax positions that meet a more likely than not threshold. Based on its evaluation, the Company has concluded that there are no significant uncertain tax positions requiring recognition in its financial statements.\nThe Company does not have any unrecognized tax benefits as of April 30, 2021, and 2020 that, if recognized, would affect the Companys effective income tax rate. The Companys policy is to recognize interest and penalties related to income tax issues as components of income tax expense. The Company did not recognize or have any accrual for interest and penalties relating to income taxes as of April 30, 2021, and 2020 .\nCommon Share Non-Monetary Consideration\nIn situations where common shares are issued and the fair value of the goods or services received is not readily determinable, the fair value of the common shares is used to measure and record the transaction. The fair value of the common shares issued in exchange for the receipt of goods and services is based on the stock price as of the earliest of the date at which:\ni.\nThe counterpartys performance is complete;\nii.\ncommitment for performance by the counterparty to earn the common shares is reached; or\niii.\nthe common shares are issued if they are fully vested and non-forfeitable at that date.\nShare Purchase Warrants\nThe Company accounts for common share purchase warrants at fair value in accordance with ASC 815, Derivatives and Hedging. The Black-Scholes option pricing valuation method is used to determine the fair value of these warrants. The use of this method requires that the Company make assumptions regarding stock volatility, dividend yields, expected term of the warrants and risk-free interest rates.\nConvertible Instruments\nThe Company evaluates and accounts for conversion options embedded in convertible instruments in accordance with ASC 815 Derivatives and Hedging Activities. Applicable GAAP requires companies to bifurcate conversion options from their host instruments and account for them as free-standing derivative financial instruments according to certain criteria. The criteria include circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under other GAAP with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument. Each reporting period, the Company evaluates whether convertible debt to acquire stock of the Company contain provisions that protect holders from declines in the stock price or otherwise could result in modification of the exercise price under the respective convertible debt agreements.\nThe Company accounts for convertible instruments (when we have determined that the embedded conversion options should not be bifurcated from their host instruments) as follows: The Company records when necessary, discounts to convertible notes for the intrinsic value of conversion options embedded in debt instruments based upon the differences between the fair value of the underlying common stock at the commitment date of the note transaction and the effective conversion price embedded in the note. Debt discounts under these arrangements are amortized over the term of the related debt to their stated date of redemption. The Company uses a Binomial Lattice Model to judge the fair value of all of its currently outstanding derivative liabilities and to amortize any debt discounts that may have a remaining balance.\nRisks and Uncertainties\nThe Company is not able to predict the ultimate impact political and health concerns will have on its business; however, if the current economic conditions continue, the Company will be forced to significantly scale back its business operations and its growth plans and could ultimately have a significant negative impact on the Company.\nRecently and Issued Accounting Pronouncements\nManagement has considered all recent accounting pronouncements issued since the last audit of our financial statements. The Companys management believes that these recent pronouncements will not have a material effect on the Companys financial statements.\nNOTE 4. RELATED PARTY TRANSACTIONS\nDuring the year ended April 30, 2021, a stockholder of the Company loaned the Company $6,279 to pay for certain expenses. Total loans payable to stockholders, on April 30, 2021, totaled $63,324. The loans bear no interest and are payable on demand.\nManagement Agreements\nFor the years ended April 30, 2021, the following executive compensation was recorded:\nNone.\nNOTE 5. STOCKHOLDERS' DEFICIT\nIn February 2012, the Company issued 25,000,000 shares of common stock at par value of $0.001.\nOn August 15, 2013, the Company did a 5:1 forward split of its common stock bringing the issued and outstanding common stock to 125,000,000.\nDuring February 2014, the Company issued 15,000,000 shares of its common stock with a fair market value of $45,000,000, as bonuses pursuant to the terms of three management agreements with officer's and stockholders for management services rendered to the Company.\nFor the year ended April 30, 2014, the Company issued 2,200,000 shares of the Company's common stock with a fair market value of $40,788,000 to certain consultants, pursuant to the terms of their consulting agreements, for services to be provided in future periods. For the year ended April 30, 2014, $322,037 had been expensed. This contract was cancelled in 2015 and the consulting charge reversed.\nOn June 24, 2014, the Company entered into a Property Purchase Agreement to acquire properties in Washington State and California for business operations. A total of $200,000 in deposits were paid towards to acquisition of the properties in addition to issued 100,000 Rule 144 restricted shares of common stock with a fair market value of $1,250,000.\nOn June 24, 2014, the Company entered into a five-year Consulting Agreement with a consultant to perform services related to acquiring properties in Washington, Nevada, Colorado, and California in addition to managing them for the Company in exchange for 1,150,000 Rule 144 restricted shares of common stock with a fair market value of $14,375,000. This project was cancelled in 2015. No charges were taken except that the common shares were issued and as of the date of this filing have not been recovered.\nOn May 1, 2014, the Company closed the acquisition of WebCongress, Inc., a Nevada corporation and Miami based technology, education, and consulting company. Pursuant to the April 15, 2014, Share Purchase Agreement, the Company issued 100,000 Rule 144 Restricted shares of common stock with a fair market value of $1,854,000 or $18.54 per share to the principals, to acquire WebCongress. The Company also committed to funding a total of $3,000,000 to cover operating costs over three years. This contract was cancelled in 2015 and the stock has been returned but not cancelled.\nOn January 11, 2018, the Company issued 2,500,000 shares of common stock for services valued at $1,050,000 and 15,000,000 common shares valued at $450,000 for an acquisition.\nThe Company has not issued any warrants or stock options.\nNOTE 6. INCOME TAXES\nPotential benefits of income tax losses and other tax assets are not recognized in the accounts until realization is more likely than not. As of April 30, 2021, the Company has operating loss carry forwards of approximately $46,412,466 for tax purposes in various jurisdictions subject to expiration as described below. Pursuant to ASC 740, Income Taxes, the Company is required to compute tax asset benefits for net operating losses carried forward and other items giving rise to deferred tax assets. Future tax benefits which may arise as a result of these losses and other items have not been recognized in these financial statements, as their realization is determined not likely to occur and accordingly, the Company has recorded a valuation allowance for the deferred tax asset relating to these items.\nThe actual income tax provisions differ from the expected amounts calculated by applying the combined income tax statutory rates applicable in each jurisdiction to the Companys loss before income taxes and non-controlling interest. The calculated tax deferred benefit on April 30, 2021, and 2020 is based on the current Federal statutory income tax rate of 35% applied to the loss before provision for income taxes.\nThe following table accounts for the differences between the actual income tax benefit and amounts computed for the years ended April 30, 2021, and 2020:\nYears Ended\nApril 30,\nTax benefit at the federal statutory rate\n$ 47,027,466\n$ 47,021,354\nNon-deductible costs\n-\n-\nDecrease in valuation allowance\n(47,027,466 )\n(47,021,354 )\nIncome tax expense\n$ -\n$ -\nThe components of the deferred tax asset and deferred tax liability on April 30, 2021, and 2020 are as follows:\nApril 30,\nDeferred tax assets\n$ 9,875,768\n9,874,484\nValuation allowance\n(9,875,768 )\n(9,874,484 )\n$ -\n-\nA valuation allowance has been provided to reduce the net deferred tax asset, as management determined that it is more likely than not that the deferred tax assets will not be realized.\nOn April 30, 2021, the Company has approximately a net operating loss carry forward for United States income tax purposes approximating $47,027,466. These losses expire in varying amounts between April 30, 2034, and 2041.\nNOTE 7. BASIS OF REPORTING\nThe Company's financial statements are presented on a going concern basis, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business.\nThe Company has experienced a loss from operations as a result of the investment necessary to achieve its operating plan, which is long-range in nature. For the period ending April 30, 2021, the Company incurred a net loss of approximately $47,027,466. In addition, the Company has no significant assets or revenue generating operations at, April 30, 2021.\nThe Company currently does not have sufficient cash to sustain itself for the next 12 months and will require additional funding in order to execute its plan of operations and to continue as a going concern. To meet its cash needs, management expects to raise capital through a private placement offering. In the event that this funding does not materialize, certain stockholders have agreed, orally, to loan, on a non-interest-bearing demand basis, sufficient funds to maintain the Company's operations for the next 12 months.\nThe financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result from the possible inability of the Company to continue as a going concern.\nNOTE 8. FAIR VALUE MEASUREMENT\nThe Company values its derivative instruments under FASB ASC 820 which defines fair value, establishes a framework for measuring fair value, and expands disclosures about fair value measurements.\nFair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (exit price). The Company utilizes market data or assumptions that market participants would use in pricing the asset or liability, including assumptions about risk and the risks inherent in the inputs to the valuation technique. These inputs can be readily observable, market corroborated, or generally unobservable. The Company classifies fair value balances based on the observability of those inputs. ASC 820 establishes a fair value hierarchy that prioritizes the inputs used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurement) and the lowest priority to unobservable inputs (level 3 measurement).\nThe three levels of the fair value hierarchy are as follows:\nLevel 1 - Quoted prices are available in active markets for identical assets or liabilities as of the reporting date. Active markets are those in which transactions for the asset or liability occur in sufficient frequency and volume to provide pricing information on an ongoing basis. Level 1 primarily consists of financial instruments such as exchange-traded derivatives, marketable securities, and listed equities.\nLevel 2 - Pricing inputs are other than quoted prices in active markets included in level 1, which are either directly or indirectly observable as of the reported date.\nLevel 3 - Pricing inputs include significant inputs that are generally less observable from objective sources. These inputs may be used with internally developed methodologies that result in managements best estimate of fair value.\nThe Companys financial instruments consisted of cash, prepaid expenses, deposit, accounts payable and accrued liabilities, line of credit, loan from stockholders and convertible debt. The estimated fair value of cash, prepaid expenses, deposit, accounts payable and accrued liabilities, line of credit, loan from stockholders approximates the carrying amount due to the short maturity of these instruments. The recognition of the derivative values of convertible debt are based on the weighted-average Black-Scholes option pricing model, which the Companys classifies as a level three of the fair value measurement hierarchy.\nThe derivative liabilities are measured at fair value using quoted market prices and estimated volatility factors based on historical quoted market prices for the Companys common stock and are classified within Level 3 of the valuation hierarchy.\nNOTE 9. STOCKHOLDERS DEFICIT\nAuthorized\nThe Company is authorized to issue 200,000,000 shares of common stock, having a par value of $0.001 per share.\nIssued and Outstanding\nCommon Stock\nNOTE 10. SUBSEQUENT EVENTS\nNone. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS\nThere have been no occurrences requiring response to this item. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nThe Companys management, with the participation of the Companys Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)) as of the end of the period covered by this report. Based on such evaluation, the Companys Chief Executive Officer and Chief Financial Officer have concluded that, as of the end of such period, the Companys disclosure controls and procedures were effective as of the end of the period covered by this report.\nManagements Report on Internal Control over Financial Reporting\nThe Companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting is not intended to provide absolute assurance that a misstatement of our financial statements will be prevented or detected. Also, projections of any evaluation of effectiveness to future periods are subject to the risks that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement conducted an evaluation of the effectiveness, as of April 30, 2021, of our internal control over financial reporting based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) updated 2013. Based on this evaluation, management concluded that the Companys internal control over financial reporting was effective as of April 30, 2021.\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a15(f) and 15d15(f) under the Exchange Act. The Company's internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. The Company's internal control over financial reporting includes those policies and procedures that:\n·\npertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n·\nprovide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n·\nprovide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nChanges in Internal Control over Financial Reporting\nDuring the year ended April 30, 2021, there were no changes in our internal control over financial reporting identified in connection with managements evaluation of the effectiveness of our internal control over the financial reporting that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act.\nIndependent Registered Accountants Internal Control Attestation\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. On July 21, 2010, President Obama signed into law the Dodd-Frank Wall Street Reform and Consumer Protection Act, which permanently exempts smaller reporting companies from providing attestation of their internal controls pursuant to Section 404 of the Sarbanes-Oxley Act. As a result, this report does not provide such an attestation, and the Company will be exempted from providing such an attestation until such time as it reaches $75 million in market capitalization. ITEM 9B. OTHER INFORMATION\nThere is no information to be disclosed in a report on Form 8-K during the fourth quarter of the fiscal year covered by this Form 10-K that has not been previously filed with the Securities and Exchange Commission.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nOur Directors and Executive Officers\nSet forth below is certain information with respect to our executive officers and directors. Our directors are generally elected at the annual shareholders meeting and hold office until the next annual shareholders meeting and until their successors are elected and qualify. Executive officers are elected by our board of directors and serve at its discretion. Our bylaws provide that the board of directors shall consist of at least one member, but the number may be increased, or decreased to not less than one, from time to time, either by the directors by adoption of a resolution to such effect or by the stockholders by amendment of the By Laws. Our board of directors currently consists of three members. The names and ages of the directors and executive officers of the Company, and their positions with the Company, are as follows:\nName\nAge\nPosition\nT.J. Singh (1)\nChief Financial Officer and Director\nAndy Jagpal\nChief Executive Officer, President, and Director\nCharles J.S. Kwon\nDirector\n(1) Mr. Singh resigned all positions on April 1, 2021.\nThe term of office of each director expires at our annual meeting of stockholders or until their successors are duly elected and qualified. Directors are not compensated for serving as such. Officers serve at the discretion of the Board of Directors.\nBiographies of Chairman, Officers and Directors\nCharles J.S. Kwon\nDirector\nMr. Kwon received his Business Diploma from the British Columbia Institute of Technology in 2002. Afterwards, he started his career in the capital markets as a trader. Then in 2006, as an Investment Advisor at Global Securities. For the past 5 years, Mr. Kwon has been a partner at ReThink, managing their Real Estate and Investment holdings. Mr. Kwon melds his experience in the capital market sector with business expertise, inspirational vision, fundraising experience, and strategic focus.\nMr. Kwon will serve as a Company director and officer until his duly elected successor is appointed or his resignation. There are no arrangements or understandings between Mr. Kwon and any other person pursuant to which he was selected as an officer or director. There are no family relationships between Mr. Kwon and any of the Companys officers or directors. Mr. Kwon has not held any other directorships in a company with a class of securities registered pursuant to section 12 of the Exchange Act or subject to the requirements of section 15(d) of such Act or any company registered as an investment company under the Investment Company Act of 1940 during the past 5 years.\nT.J. Singh\nChief Financial Officer and Director\nMr. Singh is a Chartered Professional Accountant (CPA, CGA) with over 20 years of accounting, tax and business advisory experience including management roles at the Big 4 accounting firms including KPMG, PwC & Deloitte. Mr. Singh also held the role of Senior Global Tax Manager at CHC, an international helicopter services company with revenues exceeding $1B. Currently, Mr. Singh provides business advisory services to start-up companies in high growth sectors and participates in real estate development projects in Metro Vancouver. At Crown Baus Capital Corp., Mr. Singh will oversee the quarterly and annual financial reporting functions including the timely completion and filing of the annual audited statements.\nMr. Singh resigned on April 1, 2021.\nAndy Jagpal\nChief Executive Officer, President, and Director\nMr. Jagpal holds a Bachelor of Science from the University of British Columbia and was a research assistant with the Dean of Plant Science and Agriculture Canada. As an entrepreneur, Mr. Jagpal was the President of Alliance Vancouver, an Executive Office Business Center that assisted new start-up companies and existing high growth companies with their back-office and day to day business management including telephone and reception service, administrative services, bookkeeping and staff resourcing. Over 100 companies were supported by Alliance Vancouver in their downtown Vancouver locations. Mr. Jagpal has also been involved with taking emerging companies public and providing access to venture capital along with mergers and acquisition support. Mr. Jagpal has also participated in the startup of mining projects in Philippines and Peru. Currently Mr. Jagpal serves as President of Primo Nutraceuticals, a company listed on the Canadian Securities Exchange. Primo is involved in producing and marketing nutraceutical products for the health and wellness marketplace.\nSignificant Employees\nNone.\nFamily Relationships\nNone.\nInvolvement in Certain Legal Proceedings\nNo officers or directors has been involved in any of the following events within the last ten years that is material to an evaluation of their ability or integrity as described in Item 401(f) of Regulation S-K.\nBoard Committees\nNominating and Compensation Committees\nThe Company does not have standing nominating or compensation committees, or committees performing similar functions. The Company's Board of Directors believes that it is not necessary to have a compensation committee at this time because the functions of such a committee are adequately performed by the Board of Directors. The Board of Directors is also of the view that it is appropriate for the Company not to have a standing nominating committee because the Board of Directors has performed and will perform adequately the functions of a nominating committee.\nThe Company does not have any restrictions on shareholder nominations under its certificate of incorporation or by-laws. The only restrictions are those applicable generally under Nevada corporate law and the federal proxy rules, The Board of Directors will consider suggestions from individual shareholders, subject to evaluation of the person's merits. Stockholders may communicate nominee suggestions directly to the Board of Directors, accompanied by biographical details and a statement of support for the nominees. The suggested nominee must also provide a statement of consent to being considered for nomination. There are no formal criteria for nominees at the present time.\nAudit Committee and Audit Committee Financial Expert\nWe are not required to, and we do not have an Audit Committee. The Company's directors perform some of the same functions of an Audit Committee, such as: recommending a firm of independent certified public accountants to audit the financial statements; reviewing the auditors' independence, the financial statements, and their audit report; and reviewing management's administration of the system of internal accounting controls. The Company does not currently have a written audit committee charter or similar document.\nWe have no audit committee financial expert as defined in Item 407(d)(5)(ii) of Regulation S-K. Our directors have financial statement preparation and interpretation ability obtained over the years from past business experience and education. We believe the cost related to retaining a financial expert at this time is prohibitive. Further, because of the nature of our current limited operations, we believe the services of a financial expert are not warranted.\nCode of Ethics\nThe Companys Board of Directors is developing a code of ethics (the Code) that will apply to members of the Board of Directors, all officers, employees and contemplated directors, officers, and employees. The Code will set forth written standards that are designed to deter wrongdoing and to promote:\n·\nhonest and ethical conduct,\n·\nfull, fair, accurate, timely, and understandable disclosure in reports and documents that we file with, or submit to, the Securities and Exchange Commission and in other public communications made by us;\n·\ncompliance with applicable governmental laws, rules, and regulations;\n·\nprompt internal reporting of violations of the Code to an appropriate person or persons identified in the Code; and\n·\naccountability for adherence to the Code.\nAn official Code of Ethics has been finalized by the Board of Directors and made available upon request by a shareholder of the Company. We will describe the nature of amendments to the Code on our website, except that we may not describe amendments that are purely technical, administrative, or otherwise non-substantive. We will also disclose on our website any waivers from any provision of the Code that we may grant. Information about amendments and waivers to the Code will be available on our website for at least 12 months, and thereafter, the information will be available upon request for five years.\nConflicts of Interest\nCertain conflicts of interest exist and may continue to exist between the Company and its officers and directors due to the fact that each has others business interests to which they devote their primary attention. Each officer and director may continue to do so notwithstanding the fact that management time should be devoted to the business of the Company.\nCertain conflicts of interest may exist between the Company and its management, and conflicts may develop in the future. The Company has not established policies or procedures for the resolution of current or potential conflicts of interest between the Company, its officers and directors or affiliated entities. There can be no assurance that management will resolve all conflicts of interest in favor of the Company, and conflicts of interest may arise that can be resolved only through the exercise by management their best judgment as may be consistent with their fiduciary duties. Management will try to resolve conflicts to the best advantage of all concerned.\nShareholder Communications\nThe Company provides access for its shareholders to the Company via telephone and its web site, www.elitedata.io. Shareholders are able to, and encouraged to, view all of the Companys SEC filings as well as gain knowledge about the Companys activities and developments that affect the shareholders relationship with the Company. The Company has retained the services of a dedicated professional that provides functions related to the development and distribution of shareholder communications.\nSECTION 16(a) BENEFICIAL OWNERSHIP REPORTING COMPLIANCE\nSection 16(a) of the Securities Exchange Act of 1934, as amended, requires our directors and executive officers and the holders of more than 10% of our common stock to file with the Securities and Exchange Commission initial reports of ownership and reports of changes in ownership of our equity securities. Based solely on our review of the copies of the forms received by us and written representations from certain reporting persons, we believe that, during the year ended April 30, 2021, all of our executive officers, directors, and the holders of 10% or more of our Common Stock had not complied with all Section 16(a) filing requirements. ITEM 11. EXECUTIVE COMPENSATION\nCompensation Discussion and Analysis\nThe Company is not a \"listed company\" under SEC rules and is therefore not required to have a compensation committee. Accordingly, the Company has no compensation committee.\nExcept as set forth in the summary compensation table below, during the fiscal years ended April 30, 2020, and 2021, the Company has not provided any salary, bonus, annual or long-term equity or non-equity based incentive programs, health benefits, life insurance, tax-qualified savings plans, special employee benefits or perquisites, supplemental life insurance benefits, pension or other retirement benefits or any type of nonqualified deferred compensation programs for its executive officers or employees.\nNo retirement, pension, profit sharing, stock option or insurance programs or other similar programs are currently\nThere are no understandings or agreements regarding compensation our management will receive after a business combination that is required to be included in this table, or otherwise.\nThe following table shows the compensation accrued during the years ended April 30, 2020, and 2021 to the Company's executive officers.\nSUMMARY COMPENSATION TABLE\nName and Principal Position\nYear\nSalary\nBonus\nWarrant Awards\nAll Other Compensation\nTotal\nCharles Kwon\n$ -\n$ -\n$ -\n$ -\n$ -\nPresident, CEO, Director\nBenjamin Tam\n$ -\n$ -\n$ -\n$ -\n$ -\nCFO\nT.J. Singh\n$ -\n$ -\n$ -\n$ -\n$ -\nCFO\nAndy Jagpal\n$ -\n$ -\n$ -\n$ -\n$ -\nPresident, CEO, Director\n________\nEmployment Agreements\nNone.\nCompensation of Directors\nDuring the fiscal years ending April 30, 2021, and 2020, respectively, except as set forth above. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGED AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information regarding the Company's common stock beneficially owned on April 30, 2017, for (i) each shareholder the Company knows to be the beneficial owner of 5% or more of its outstanding common stock, (ii) each of the Company's executive officers and directors, and (iii) all executive officers and directors as a group. In general, a person is deemed to be a \"beneficial owner\" of a security if that person has or shares the power to vote or direct the voting of such security, or the power to dispose or to direct the disposition of such security. A person is also deemed to be a beneficial owner of any securities of which the person has the right to acquire beneficial ownership within 60 days. To the best of the Company's knowledge, all the people named have sole voting and investment power with respect to such shares, except as otherwise noted. On April 30, 2021, 161,050,000 shares of the Company's common stock were outstanding.\nName of Person or Group\nNumber of Shares\nof Common Stock Owned\nPercentage of Ownership\nCharles J.S. Kwon\n-\n-\nAndy Jagpal\n80,000,000\n49.67 %\nT.J. Singh\n-\n-\nAll executive officers and directors as a group (three persons)\n80,000,000\n49.67 %\n___________________\nThese shares are owned by 1226508 BC Ltd which is owned and operated by Mr. Jagpal\nThe Company has no securities authorized for issuance under equity compensation plans. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nExcept as otherwise indicated herein, there have been no related party transactions, or any other transactions or relationships required to be disclosed pursuant to Item 404. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nAudit Fees\nThe aggregate fees billed by Victor Mokuolu, CPA PLLC for our annual financial statements and review of financial statements included in our quarterly reports or services that are normally provided in connection with statutory and regulatory filings were $6,000 for the year ended April 30, 2021.\nTax Fees\nThe Company incurred $0 expenses for professional services for tax compliance, tax advice, and tax planning for the fiscal year ended April 30, 2020, and $0 expenses for year ended April 30, 2021.\nPolicy on Audit Committee Pre-Approval of Audit and Permissible Non-audit Services of Independent Auditors\nThe Board of Directors acts as the audit committee of the Company, and accordingly, all services are approved by all the members of the Board of Directors.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nFinancial Statements\nThe Company's financial statements are included in Item 8 of this Annual Report.\nFinancial Statement Schedules\nAll schedules are omitted because they are not applicable or have been provided in Item 8 of this Annual Report.\nExhibits:\nThose exhibits marked with an asterisk (*) refer to exhibits filed herewith. The other exhibits are incorporated herein by reference, as indicated in the following list.\nExhibit Number\nDescription of Exhibit\n3.2\nAmended Articles of Incorporation (incorporated by reference to the Companys Form 8-K filed April 15, 2014)\n3.3\nAmended Articles of Incorporation (incorporated by reference to the Companys Form 8-K filed July 17, 2014)\n10.01\nChange in control (incorporated by reference to the Companys Form 8-K filed July 23, 2014)\n31.1\nCertification by Andy Jagpal, Chief Executive Officer as required by Section 302 of Sarbanes-Oxley Act 2002 filed herewith\n31.2\nCertification by ??, Chief Financial Officer as required by Section 302 of Sarbanes-Oxley Act 2002 filed herewith\n32.1\nCertification as required under Section 906 of Sarbanes-Oxley Act of 2002 filed herewith\n32.2\nCertification as required under Section 906 of Sarbanes-Oxley Act of 2002 filed herewith\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nCROWN BAUS CAPITAL CORP.\nDated: October 5, 2023\nBy:\n/s/ Andy Jagpal\nName:\nAndy Jagpal\nIts:\nChief Executive Officer, Chief Financial Officer, and Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSIGNATURE\nCAPACITY IN WHICH SIGNED\nDATE\n/s/ Andy Jagpal\nChief Executive Officer, and Director (Principal Executive Officer)\nOctober 5, 2023\nAndy Jagpal\n/s/ Andy Jagpal\nChief Financial Officer\nAndy Jagpal"
}