{
    "cik": "1556801",
    "company": "iMine Corp",
    "filing_type": "10-K",
    "filing_date": "2022-11-01",
    "period_of_report": "2022-07-31",
    "sic": "1400",
    "state_of_inc": "NV",
    "state_location": "FL",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1556801/0001640334-22-002318-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1556801/000164033422002318/jrvs_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1556801/0001640334-22-002318.txt",
    "filename": "1556801_10K_2022_0001640334-22-002318.htm",
    "content": "Item 1. Business\nBusiness\nOverview\nIn July of 2022 we acquired RAC Real Estate Acquisition Corp, a Wyoming Corporation (RAC). RAC is now a wholly owned subsidiary of the Company. The Company, through RAC, plans to focus on real estate transactions, in which we will buy and develop real estate for sale or rent of low-income housing. We plan to invest in three sectors of this market by (i) buying, refurbishing and selling traditional foreclosures, (ii) buying, developing and renting Land Banks that have an average pool of homes or lots in excess of 100 in one location, and (iii) buying, refurbishing or developing and selling homes made available by the government through HECM pools. We are currently working with a third-party vendor to facilitate this plan.\nOn July 22, 2022, the Company received a promissory note, in the principal amount of $672,960 from, and entered into a Loan Agreement dated July 18, 2022 with, Fix Pads Holdings, LLC a South Carolina limited liability company. The note has a 12% interest rate per annum payable as follows: (1) a pre-payment on July 22, 2022 of pro-rated interest for the period from July 22, 2022 through July 30, 2022 in the amount of $2,212.47; (2) a pre-payment of interest on August 1, 2022 for the period from August 1, 2022 through September 30, 2022 in the amount of $13,496.07; and then (3) monthly payments of interest only beginning on October 1, 2022 and continuing on the 1st day of each month thereafter until all principal and accrued interest are paid in full by July 1, 2023. The note is secured by mortgages or deeds of trust on 7 properties. Consideration for the note was paid in part by the Company in the amount of $328,625.72 and in part by an investor, Frank Campanaro, in the amount of $328,625.73 (together both amounts equal $657,251.45 which represent the total note amount of $672,960 minus the two prepayments described above). On July 26, 2022, The Company entered into a partial assignment of the promissory note dated July 25, 2022, with Mr. Campanaro whereby the Company assigned to Mr. Campanaro the right to payment of principal in the amount of $336,480 and the right to half of the amount of any interest payments made on the principal amount of the note.\nOn August 18, 2022, the Company received a promissory note, in the principal amount of $358,620 from, and entered into a loan agreement, with, Fix Pads Holdings, LLC. The note has a 12% interest rate per annum payable as follows: (1) a pre-payment on August 19, 2022 of pro-rated interest for the period from August 19, 2022 through August 31, 2022 in the amount of $1,414.82; (2) a pre-payment of interest on August 19, 2022 for the period from September 1, 2022 through October 31, 2022 in the amount of $7,192.06; and then (3) monthly payments of interest only beginning on November 1, 2022 and continuing on the 1st day of each month thereafter until all principal and accrued interest are paid in full by August 1, 2023. The note is secured by mortgages or deeds of trust on 4 properties. Consideration for the note was paid in part by the Company in the amount of $175,006.56 and in part by Mr. Campanaro, in the amount of $175,006.56 (together both amounts equal $350,013.12 which represent the total note amount of $358,620 minus the two prepayments described above). On August 18, 2022, the Company entered into a partial assignment of the promissory note with Mr. Campanaro whereby the Company assigned to Mr. Campanaro the right to payment of principal in the amount of $179,310 and the right to half of the amount of any interest payments made on the principal amount of the note.\nOn October 4, 2022, the Company, through RAC, entered into a Limited Liability Agreement with Fixed Pads Holdings. As a result of the agreement, RAC and fix pads formed a limited liability company called RAC FIXPADS II, LLC, incorporated in the state of Delaware. The purpose of which is to purchase, finance, collateralize, improve, rehabilitate, market, sell or lease property, as well as carry on any lawful business, purpose or activity. The LLC has two members RAC and Fix Pads, both providing an initial contribution to the LLC of $1,000 in exchange for a 50% membership interest represented by an issuance of 1,000 Units of the LLC to each party. Each member is entitled to 1 vote per member. The LLC is managed by a manager, Fix Pads.\nThe Agreement provides that additional capital contributions of the members will be made to the LLC as follows: (i) Fix Pads will transfer and assign all rights to and incidents of ownership for 60 residential properties it has title, or will have title, to the LLC, as set forth in the Agreement; and (ii) RAC will make additional cash contributions to the capital of the LLC, up to a maximum of $5,214,000, on such dates and in such amounts as requested by the LLC, in the manner set forth in the Agreement.\nUnder the Agreement profits and losses are allocated by the LLC to the members based on initial cash contributions of the members, the value of the properties contributed by Fix Pads and the additional cash contributions by RAC. Distributions to the members under the Agreement will be made as follows: (i) from the sale of each property by the LLC, the LLC shall distribute $13,000 of the net sale proceeds to RAC and distribute and additional amount to RAC equal to the average RAC additional cash capital contribution per property, the balance net proceeds will be distributed to Fix Pads; (ii) for any property that is leased by the LLC, RAC will have the option to buy such property from the LLC and for any such property that is not bought by RAC, any net rental income will be retained by the LLC and distributed to the members based on (a) further written agreement of the members or (b) if the members are unable to agree then on such terms as provided in the Agreement.\nSince the acquisition of RAC, the Company, through our third-party vendor, has financed 11 foreclosed homes to be refurbished and sold as a test of the viability of this business model. These homes are located, for the most part, in the southern part of the United States in Arkansas, Mississippi, Florida and Virginia. Two of the homes are located, one in Iowa and one in Indiana. The third-party vendor currently has the capability to completely refurbish 20 to 30 homes per month and have aligned themselves with a new state of the art panel designed home manufacturing company based in Europe. These panel designed homes will significantly reduce construction costs, labor costs and time of construction for each project.\nOur plan over the next 12 months is to finance over 70 foreclosed homes to be refurbished and sold. We plan to contract with Land Bank lots in excess of 100 lots to be developed into homes for rent for low-income housing. The Land Bank homes are to be constructed with the new state of the art panel designed homes manufactured in Europe. We are currently looking to invest in a land bank near St. George, Utah.\nWe were a former shell company. Since our acquisition of RAC and commencing operations, however, we are no longer a shell company.\nOn June 15, 2022, the Companys common stock was reverse split at a 1:125 ratio. As a result, our outstanding shares of common stock went from 74,498,250 common stock outstanding to 595,986 common stock outstanding. References in this annual report to shares of common stock outstanding reflect this reverse stock split, unless otherwise stated.\nOrganization\nWe are a Nevada corporation incorporated on October 26, 2010, under the name Oconn Industries Corp. On March 11, 2014, we changed our corporate name to Diamante Minerals, Inc. On March 20, 2018, we changed our corporate name to iMine Corporation.\nOur address is 488 NE 18th Street, #511, Miami FL 33132, telephone (786) 553-4006. We do not have a corporate website.\nSales and Marketing\nWe intend to market our properties to those seeking homes, including to low-income individuals and families. We may engage third party real estate brokers and agents provide these services.\nCompetition\nWe believe there are only limited barriers to entry in our business. Current and future competitors may have more resources than we have. Our projects face competition generally from REITs, institutional pension plans and other public and private real estate companies and private real estate investors for the acquisition of properties and for raising capital. In transaction services, we face competition with real estate firms in the acquisition and disposition of properties, and we also compete with other sponsors of real estate for investors to provide the capital to allow us to make these investments. We also compete against real estate companies who may be chosen by a broker-dealer as an investment platform instead of us. In management services, we compete with other properties for viable investors for properties.\nReal estate development is a highly competitive business. We compete with numerous developers, builders and others for the acquisition of property. As we attempt to expand our operations, we will certainly be competing with other business ranging from large multinational corporations to small startup business such as ourselves. Many of our competitors may have longer operating histories, better brand recognition and greater financial resources than we do.\nThere can be no assurance that we will be able to compete effectively with the other companies in our industry.\nGovernment Regulations\nReal Property Development\nThe real estate development industry is subject to environmental, building, construction, zoning and real estate regulations that are imposed by various federal, state and local authorities. In developing a community, we must obtain the approval of various government agencies regarding matters such as permitted land uses, housing density, installation of utility services and the dedication of acreage for open space, parks, schools and other community purposes. Federal, state and local regulations affect real property development by specifying, among other things, the type and quality of building material that must be used, certain aspects of land use and building design and the manner in which homebuilders may conduct their sales, operations and overall relationships with potential renters and buyers. Changes in prevailing local circumstances or applicable laws may require additional permit and approvals or modifications of approvals previously obtained. Permits and approves will vary depending on the type and location of the land being developed.\nTiming of the beginning and completion of developmental projects can depend upon receipt of necessary authorizations, permits and approvals. Because of the provisional nature of these approvals and the concerns of various environmental and public interest groups, the approval process can be delayed by withdrawals or modifications of preliminary approvals and by litigation and appeals challenging development rights. Our ability to develop projects could be delayed or prevented due to litigation challenging previously obtained governmental approvals. We also may be subject to periodic delays or may be precluded entirely from developing in certain communities due to building moratoriums or slow-growth or no-growth initiatives that could be implemented in the future. Such delays could adversely affect our ability to complete our projects, significantly increase the costs of doing so or drive potential customers to purchase competitors products.\nManagement Services\nThe Company, any salespersons we may have and, in some instances, property managers we may employee may be regulated by the states in which we do business. These regulations may include licensing procedures, prescribed professional responsibilities and anti-fraud provisions. Our activities may also be subject to various local, state, national and international jurisdictions fair advertising, trade, housing and real estate settlement laws and regulations and are affected by laws and regulations relating to real estate and real estate finance and development.\nEnvironmental Compliance\nFederal, state and local laws and regulations impose environmental zoning restrictions, use controls, disclosure obligations and other restrictions that impact the management, development, use or sale of real estate. Such laws and regulations tend to discourage sales and leasing activities with respect to some properties. If transactions in which we are involved are delayed or abandoned as a result of these restrictions, our business could be adversely affected. In addition, a failure by us to disclose environmental concerns to potential investors or third-party buyers of the developed property may subject our company to liability and may adversely impact our business or cause us to incur costs for cleanup of hazardous substances or wastes or other environmental liabilities.\nVarious environmental laws and regulations also can impose liability for the costs of investigating or remediating hazardous or toxic substances at sites currently or formerly owned or operated by a party, or at off-site locations to which such party sent wastes for disposal. As a potential property manager, we could be held liable as an operator for any such contamination; even if the original activity was legal and we had no knowledge of, or did not cause, the release or contamination. Further, because liability under some of these laws is joint and several, we could be held responsible for more than our share, or even all, of the costs for such contaminated site if the other responsible parties are unable to pay. Similarly, we are generally obliged, under the debt financing arrangements on the properties owned by us, to provide an indemnity to the lenders for environmental liabilities and to remediate any environmental problems that might arise. Insurance for these matters may not always be available, or sufficient to cover our losses.\nEmployees\nWe have two employees, our chief executive officer and chief financial officer, Jose Maria Eduardo Gonzalez Romero, who provides his services to us on a part-time basis and Yolanda Goodell Vice President that also provides her services on a part time bases ITEM 1A. RISK FACTORS\nAn investment in our common stock involves a high degree of risk. You should carefully consider the risks described below together with all of the other information included in this annual report before making an investment decision with regard to our securities. The statements contained in this annual report include forward-looking statements that are subject to risks and uncertainties that could cause actual results to differ materially from those set forth in or implied by forward-looking statements. The risks set forth below are not the only risks facing us. Additional risks and uncertainties may exist that could also adversely affect our business, prospects or operations. If any of the following risks actually occurs, our business, financial condition or results of operations could be harmed. In that case, the trading price of our common stock could decline, and you may lose all or a significant part of your investment.\nBecause of our lack of cash and our working capital deficiency, we will not have resources to expand our business of acquiring, developing and selling/renting real estate, and we will need to raise funds for such activities.\nAt July 31, 2022, we have cash of $718 and a working capital of approximately $308,563, and, because our only current source of revenue is interest income from two promissory notes the Company acquired in connection with our business plan. If we are unable to obtain funding for these activities we may be unable to complete an acquisition or file our delinquent SEC quarterly reports. If we are unable to implement our business plan because we do not have sufficient funds available to us, we will be forced to cease operations. Any financing which we may be able to obtain is likely to be on very unfavorable terms and, if equity is issued, may result in significant dilution to our stockholders.\nSubsequent to our completion of an acquisition, we may be required to take write-downs or write-offs, restructuring and impairment or other charges that could have a significant negative effect on our financial condition, results of operations and our stock price, which could cause you to lose some or all of your investment.\nWe did not have the financial resources to conduct extensive due diligence in our acquisition of RAC, material issues may be present inside RAC that we did not uncover or factors outside of RACs business and outside of our control may arise. As a result of these factors, we may be forced to write-down or write-off assets, restructure our operations, or incur impairment or other charges that could result in our reporting losses or losses significantly in excess of those we may anticipate based on the financial statement of RAC. Even if our due diligence successfully identified certain risks, unexpected risks may arise and previously known risks may materialize in a manner not consistent with our preliminary risk analysis. Even though these charges may be non-cash items, the fact that we report charges of this nature could contribute to negative market perceptions about us or our securities. In addition, charges of this nature may cause us to violate net worth or other covenants to which we may be subject under pre-existing of RAC or by virtue of our obtaining post-acquisition debt financing.\nOur auditors report includes a going concern paragraph.\nOur financial statements include a going-concern paragraph. The accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates the realization of assets and the liquidation of liabilities in the normal course of business. During the year ended July 31, 2022, the Company incurred a net loss of $23,238. As of July 31, 2022, the Company had an accumulated deficit of $23,238 and has nominal revenues since inception and only recently engaged in an active business. In order to continue as a going concern, the Company will need, among other things, additional capital resources. Managements plans to raise necessary funding through equity financing arrangements, which may be insufficient to fund its capital expenditures, working capital and other cash requirements for the year ended July 31, 2023. However, until the Company engages in an active business or makes an acquisition the Company is likely to not be able to raise any significant debt or equity financing.\nThe ability of the Company to begin operations in its new business model is dependent upon, among other things, obtaining financing to commence operations and develop a business plan or making an acquisition. The Company cannot give any assurance as to its ability to develop or acquire a business or to operate profitably.\nThese factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. The accompanying consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nIf we are unable to attract, train and retain technical and financial personnel, our business may be materially and adversely affected.\nIt is likely that our future success will depend, to a significant extent, on our ability to attract, train and retain key management, technical and financial personnel. Recruiting and retaining capable personnel, particularly for a company with no history of earnings or operations will be vital to our success. We anticipate that there will be substantial competition for qualified personnel. We cannot assure you we will be able to attract or retain the technical and financial personnel we require. If we are unable to attract and retain qualified employees, our business may be materially and adversely affected.\nRisks Concerning our Common Stock\nBecause our common stock is a penny stock, you may have difficulty selling our common stock.\nOur common stock is a penny stock, as defined by the SEC regulations, and therefore is subject to the rules adopted by the SEC regulating broker-dealer practices in connection with transactions in penny stocks. The SEC rules may have the effect of reducing trading activity in our common stock by making it more difficult for investors to purchase and sell their shares. The SECs rules require a broker or dealer proposing to effect a transaction in a penny stock to deliver the customer a risk disclosure document that provides certain information prescribed by the SEC, including, but not limited to, the nature and level of risks in the penny stock market. The broker or dealer must also disclose the aggregate amount of any compensation received or receivable by him in connection with such transaction prior to consummating the transaction. In addition, the SECs rules also require a broker or dealer to make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written agreement to the transaction before completion of the transaction. The existence of the SECs rules may result in a lower trading volume of our common stock and lower trading prices. Further, some broker-dealers will not process transactions in penny stocks.\nThere is a limited market for our common stock, which may make it difficult for you to sell your stock.\nOur common stock trades on the OTC Pink marketplace under the symbol JRVS. The OTC Pink market is not a national securities exchange and does not provide the benefits to stockholders which a national exchange provides. Furthermore, according to the OTC Markets website, the OTC Pink is for all types of companies that are there by reasons of default, distress or design, which is why they are further segmented based on the level of information that they provide. There is a limited trading market for our common stock and there are frequently days on which there is no trading in our common stock. Accordingly, there can be no assurance as to the liquidity of any markets that may develop for our common stock, the ability of holders of our common stock to sell our common stock, or the prices at which holders may be able to sell our common stock. Further, because of the thin float, the reported bid and asked prices may have little relationship to the price you would pay if you wanted to buy shares or the price you would receive if you wanted to sell shares.\nExercise of Series A Preferred shares or future convertible instruments may have a dilutive effect on our common stock.\nWe have outstanding 100,000 Series A Preferred shares which are exercisable at a 25% discount to the next financing of at least $1,000,000. If the price per share of our common stock at the time of exercise of these or future options or warrants, or conversion of any future convertible notes or any other convertible securities is in excess of the various exercise or conversion prices of such convertible securities, exercise or conversion of such convertible securities would have a dilutive effect on our common stock. Further, any additional financing that we secure may require the granting of rights, preferences or privileges senior to those of our common stock and which result in additional dilution of the existing ownership interests of our common stockholders.\nOur lack of internal controls over financial reporting may affect the market for and price of our common stock.\nOur disclosure controls and our internal controls over financial reporting are not effective. We do not have the financial resources or personnel to develop or implement systems that would provide us with the necessary information on a timely basis so as to be able to implement financial controls. Our financial condition together with the fact that we presently have two part-time employees, one of which is both our chief executive officer and chief financial officer and does not have an accounting background, makes it difficult for us to implement a system of internal controls over financial reporting, and we cannot assure you that we will be able to develop and implement the necessary controls. The absence of internal controls over financial reporting may inhibit investors from purchasing our shares and may make it more difficult for us to raise debt or equity financing. Further, we cannot assure you that, if we make an acquisition, we will be able to implement internal controls over financial reporting. Because we anticipate that any company we may acquire will not have internal controls over financial reporting in effect, we cannot assure you that we will be able to implement such internal controls.\nOur lack of a full-time chief financial officer could affect our ability to develop financial controls, which could affect the market price for our common stock.\nWe do not have a full-time chief financial officer. At present, our chief executive officer, who does not have an accounting background, is also acting as our chief financial officer. We do not anticipate that we will be able to hire a qualified chief financial officer unless our financial condition improves significantly. The lack of an experienced chief financial officer, together with our lack of internal controls, may impair our ability to raise money through a debt or equity financing as well as the market for and the market price of our common stock.\nWe do not have any independent directors.\nAt present, we do not have any independent directors. Our board consists of three directors, one of which is Jose Maria Eduardo Gonzalez Romero, who is our chief executive officer and chief financial officer. Because we have no independent directors, we do not have many checks and balances on Mr. Romero, which may make it difficult for us to develop internal controls and to raise money in the financial markets.\nOur stock price may be volatile and your investment in our common stock could suffer a decline in value.\nThe dollar volume trading in our stock is low and we cannot assure you that any significant market will develop. As a result, any reported prices may not reflect the price at which you would be able to sell shares if you want to sell any shares you own or buy shares if you wish to buy share. Further, stocks with a low trading volume may be more subject to manipulation than a stock that has a significant public float. The price of our stock may fluctuate significantly in response to a number of factors, many of which are beyond our control. These factors include, but are not limited to, the following, in addition to the risks described above and general market and economic conditions:\n·\nour low stock price, which may result in a modest dollar purchase or sale of our common stock having a disproportionately large effect on the stock price;\n·\nthe markets perception as to our ability to make an acquisition that can generate revenue and net income;\n·\nthe markets perception as to our ability to generate positive cash flow or earnings following an acquisition or change in business;\n·\nchanges in our or securities analysts estimate of our financial performance;\n·\nour ability or perceived ability to obtain necessary financing for our operations;\n·\nthe perception of the market for the principal products which any company we may acquire or any business we may seek to develop and our ability to generate revenue and cash flow from that business or proposed business;\n·\nthe risks associated with any business we may acquire or any business we may seek to develop;\n·\nthe anticipated or actual results of our operations;\n·\nchanges in market valuations of other companies in our industry;\n·\nlitigation or changes in regulations affecting our industry;\n·\nconcern about our lack of internal controls;\n·\nany discrepancy between anticipated or projected results and actual results of our operations;\n·\nthe effect or anticipated effect of changes in trade and tariffs on our business;\n·\nactions by third parties to either sell or purchase stock in quantities which would have a significant effect on our stock price; and\n·\nother factors not within our control.\nRaising funds by issuing equity or convertible debt securities could dilute the net tangible book value of the common stock and impose restrictions on our working capital.\nIf we were to raise additional capital by issuing equity securities, either alone or in connection with a non-equity financing, the net tangible book value of the then outstanding common stock could decline. If the additional equity securities were issued at a per share price less than the market price, which is customary in the private placement of equity securities, the holders of the outstanding shares would suffer a dilution, which could be significant. We may have difficulty in raising funds through the sale of debt securities because of both our financial position, the thin market for our stock; the lack of any collateral on which a lender may place a value, and the absence of any history of revenue or operations. If we are able to raise funds from the sale of debt securities, the lenders may impose restrictions on our operations and may impair our working capital as we service any such debt obligations.\nWe do not intend to pay any cash dividends in the foreseeable future.\nWe have not paid any cash dividends on our common stock and do not intend to pay cash dividends on our common stock in the foreseeable future.  ITEM 2. PROPERTIES\nWe do not own or lease any real property. ITEM 3. LEGAL PROCEEDINGS\nWe have no material pending legal proceedings required to be disclosed under this item. ITEM 4. MINE SAFETY DISCLOSURES.\nNot Applicable\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nOur common stock is quoted on the OTC Pink marketplace under the symbol JRVS. From April 2014 until May 3, 2018, our common stock was quoted under the symbol DIMN.\nStockholders of Record\nAs of September 05, 2022, we had approximately 29 record holders of our common stock. Certain shares are held in nominee or street name and accordingly, the number of beneficial owners of such shares is not known or included in the foregoing number.\nTransfer Agent\nGlobex Transfer, LLC, 780 Deltona Blvd., Suite 202, Deltona, FL 32725, telephone (813) 344-4490, is the transfer agent for our common stock.\nDividends\nWe have not paid any cash dividends to date and do not anticipate or contemplate paying dividends in the foreseeable future.\nSecurities Authorized for Issuance under Equity Compensation Agreements\nNone. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of financial condition and results of operations should be read in conjunction with our consolidated financial statements and related notes included elsewhere in this report. This discussion contains forward-looking statements that involve risks, uncertainties and assumptions. See Note Regarding Forward-Looking Statements. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of certain factors discussed in Risk Factors and elsewhere in this report.\nOverview\nIn July of 2022 we acquired RAC Real Estate Acquisition Corp, a Wyoming Corporation (RAC). RAC is now a wholly owned subsidiary of the Company. The Company, through RAC, plans to focus on real estate transactions, in which we will buy and develop real estate for sale or rent of low-income housing. We plan to invest in three sectors of this market by (i) buying, refurbishing and selling traditional foreclosures, (ii) buying, developing and renting Land Banks that have an average pool of homes or lots in excess of 100 in one location and (iii) buying, refurbishing or developing and selling homes made available by the government through HECM pools. We are currently working with a third-party vendor to facilitate this plan.\nOn July 22, 2022, the Company received a promissory note, in the principal amount of $672,960 from, and entered into a Loan Agreement dated July 18, 2022 with, Fix Pads Holdings, LLC a South Carolina limited liability company. The note has a 12% interest rate per annum payable as follows: (1) a pre-payment on July 22, 2022 of pro-rated interest for the period from July 22, 2022 through July 30, 2022 in the amount of $2,212.47; (2) a pre-payment of interest on August 1, 2022 for the period from August 1, 2022 through September 30, 2022 in the amount of $13,496.07; and then (3) monthly payments of interest only beginning on October 1, 2022 and continuing on the 1st day of each month thereafter until all principal and accrued interest are paid in full by July 1, 2023. The note is secured by mortgages or deeds of trust on 7 properties. Consideration for the note was paid in part by the Company in the amount of $328,625.72 and in part by an investor, Frank Campanaro, in the amount of $328,625.73 (together both amounts equal $657,251.45 which represent the total note amount of $672,960 minus the two prepayments described above). On July 26, 2022, The Company entered into a partial assignment of the promissory note dated July 25, 2022, with Mr. Campanaro whereby the Company assigned to Mr. Campanaro the right to payment of principal in the amount of $336,480 and the right to half of the amount of any interest payments made on the principal amount of the note.\nOn August 18, 2022, the Company received a promissory note, in the principal amount of $358,620 from, and entered into a loan agreement, with, Fix Pads Holdings, LLC. The note has a 12% interest rate per annum payable as follows: (1) a pre-payment on August 19, 2022 of pro-rated interest for the period from August 19, 2022 through August 31, 2022 in the amount of $1,414.82; (2) a pre-payment of interest on August 19, 2022 for the period from September 1, 2022 through October 31, 2022 in the amount of $7,192.06; and then (3) monthly payments of interest only beginning on November 1, 2022 and continuing on the 1st day of each month thereafter until all principal and accrued interest are paid in full by August 1, 2023. The note is secured by mortgages or deeds of trust on 4 properties. Consideration for the note was paid in part by the Company in the amount of $175,006.56 and in part by Mr. Campanaro, in the amount of $175,006.56 (together both amounts equal $350,013.12 which represent the total note amount of $358,620 minus the two prepayments described above). On August 18, 2022, the Company entered into a partial assignment of the promissory note with Mr. Campanaro whereby the Company assigned to Mr. Campanaro the right to payment of principal in the amount of $179,310 and the right to half of the amount of any interest payments made on the principal amount of the note.\nOn October 4, 2022, the Company, through RAC, entered into a Limited Liability Agreement with Fixed Pads Holdings. As a result of the agreement, RAC and fix pads formed a limited liability company called RAC FIXPADS II, LLC, incorporated in the state of Delaware. The purpose of which is to purchase, finance, collateralize, improve, rehabilitate, market, sell or lease property, as well as carry on any lawful business, purpose or activity. The LLC has two members RAC and Fix Pads, both providing an initial contribution to the LLC of $1,000 in exchange for a 50% membership interest represented by an issuance of 1,000 Units of the LLC to each party. Each member is entitled to 1 vote per member. The LLC is managed by a manager, Fix Pads.\nThe Agreement provides that additional capital contributions of the members will be made to the LLC as follows: (i) Fix Pads will transfer and assign all rights to and incidents of ownership for 60 residential properties it has title, or will have title, to the LLC, as set forth in the Agreement; and (ii) RAC will make additional cash contributions to the capital of the LLC, up to a maximum of $5,214,000, on such dates and in such amounts as requested by the LLC, in the manner set forth in the Agreement.\nUnder the Agreement profits and losses are allocated by the LLC to the members based on initial cash contributions of the members, the value of the properties contributed by Fix Pads and the additional cash contributions by RAC. Distributions to the members under the Agreement will be made as follows: (i) from the sale of each property by the LLC, the LLC shall distribute $13,000 of the net sale proceeds to RAC and distribute and additional amount to RAC equal to the average RAC additional cash capital contribution per property, the balance net proceeds will be distributed to Fix Pads; (ii) for any property that is leased by the LLC, RAC will have the option to buy such property from the LLC and for any such property that is not bought by RAC, any net rental income will be retained by the LLC and distributed to the members based on (a) further written agreement of the members or (b) if the members are unable to agree then on such terms as provided in the Agreement.\nSince the acquisition of RAC, the Company, through our third-party vendor, has financed 11 foreclosed homes to be refurbished and sold as a test of the viability of this business model. Our plan over the next 12 months is to finance over 70 foreclosed homes to be refurbished and sold. We plan further to contract with Land Bank lots in excess of 100 lots to be developed into homes for rent. The Land Bank homes are to be constructed with new state of the art panel designed homes that are manufactured in Europe. This will significantly reduce the cost and time of construction for these homes.\nPrior to March 16, 2018, we were engaged in the development of mining assets. We never generated any revenue from this business and as of April 30, 2018, all of the assets associated with the mining business were fully reserved against and have no value. On March 16, 2018, we had a change in management and changed our business to developing the business of designing and selling computer equipment which can be used for the mining of cryptocurrency. In April 2019, our sole director and officer resigned and we discontinued the business of designing and selling computer equipment for the cryptocurrency business, from which we did not generate any revenue. On August 14, 2019, the then sole officer and director resigned and Jose Maria Eduardo Gonzalez Romero was elected as our sole officer and director. In 2018 we purchased certain equipment for $500,000 borrowed from Mr. Romero. The equipment was never delivered to us in the United States, and on October 29, 2021, we entered into a settlement agreement with Gygabyte whereby we paid $10,790 to Gigabyte. Four pallets of equipment have been shipped from Taiwan and are expected to arrive in the U.S. next quarter. The equipment is in component parts and there is no assurance if this can be assembled and mined or sold since this equipment was purchased over three years ago.\nOn November 1, 2021, we entered into a settlement with Mr. Romero whereby he converted the principal amount of his $500,000 loan along with accrued interest into shares of the company at $.02 per share and we issued additional shares to him for his service as the CEO under his previous employment agreement. The total number of shares issued to Mr. Romero for his note conversion and compensation was 35,189,100.\nOn June 15, 2022, the Companys common stock was reverse split at a 1:125 ratio. As a result, our outstanding shares of common stock went from 74,498,250 common stock outstanding to 595,986 common stock outstanding. References in this annual report to shares of common stock outstanding reflect this reverse stock split, unless otherwise stated.\nResult of operations\nFrom inception (May 11, 2022) to July 31, 2022\nOn July 1, 2022, the Company entered into an Agreement and Plan of Reorganization dated June 30, 2022 (the Agreement) with RAC Real Estate Acquisition Corp., a Wyoming Corporation (RAC) incorporated on May 11, 2022, and the Shareholders of RAC, namely Frank Gillen, Francis Pittilloni, and Yolanda Goodell (Shareholders), whereby the Company issued to the Shareholders a combined 100,000 shares of Series A Preferred Stock, par value of $0.001 per share in consideration for a combined 1,000 shares of RAC common stock, par value $0.001, held by Shareholders, which represents 100% of the issued and outstanding capital stock of RAC. As a result, RAC became a wholly owned subsidiary of the Company. Shareholders of RAC paid a combine capital contribution of $500,000 in cash as consideration for their combine 1,000 shares of RAC common stock.\nFor financial accounting purposes, this transaction was treated as a reverse acquisition by RAC and resulted in a recapitalization with RAC being the accounting acquirer and the Company as the acquired company. The consummation of this reverse acquisition resulted in a change of control. Accordingly, the historical financial statements prior to the acquisition are those of the accounting acquirer, RAC, and have been prepared to give retroactive effect to the reverse acquisition completed on June 30, 2022, and represent the operations of RAC. The consolidated financial statements after the acquisition date, June 30, 2022, include the balance sheets of both companies at fair value, the historical results of RAC and the results of the Company from the acquisition date. All share and per share information in the accompanying consolidated financial statements and footnotes has been retroactively restated to reflect the recapitalization.\nMay 11, 2022\n(Inception) to\nJuly 31,\nRevenue\n$ 1,106\nOperating expenses\nProfessional fees\n24,285\nNet loss\n$ 23,238\nFor the inception (May 11, 2022) to July 31, 2022, we generated revenue from interest income of $1,106.\nWe incurred operating expenses of $24,344, primarily professional fees, resulting in a loss from operations of $23,238. We did not incur other expenses, resulting in a net loss from continuing operations of $23,238, or ($0.10) per share (basic and diluted).\nLiquidity and Capital Resources\nThe following table summarizes our working capital at July 31, 2022:\nJuly 31,\nCurrent assets\n$ 337,198\nCurrent liabilities\n$ 28,635\nWorking capital\n$ 308,563\nThe following tables summarize our cash flows from inception to July 31, 2022.\nMay 11, 2022\n(Inception) to\nJuly 31,\nCash used in operating activities\n$ (9,669 )\nCash used in investing activities\n$ (328,291 )\nCash provided by financing activities\n$ 338,678\nCash on hand\n$ 718\nOperating activities\nThe cash flow used in operating activities for the inception (May 11, 2022) to July 31, 2022, reflects the net loss of $23,238, adjusted by non-cash interest income of $1,106, increased by accounts payable and accrued liabilities of $8,850 and due to related parties of $5,825.\nInvesting activities\nFor the inception (May 11, 2022) to July 31, 2022, the Company received cash from acquisition of subsidiary of $335 and used $328,626 for advance on loan receivable.\nFinancing activities\nFor the inception (May 11, 2022) to July 31, 2022, the Company received cash from issuance of Series A Preferred stock of $500,000 and repaid $161,322 to related parties.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates the realization of assets and the liquidation of liabilities in the normal course of business. During the year ended July 31, 2022, the Company incurred a net loss of $23,238. As of July 31, 2022, the Company had an accumulated deficit of $23,238. In order to continue as a going concern, the Company will need, among other things, additional capital resources. Managements plans to raise necessary funding through equity financing arrangements, which may be insufficient to fund its capital expenditures, working capital and other cash requirements for the year ended July 31, 2023. However, until the Company engages in an active business or makes an acquisition the Company is likely to not be able to raise any significant debt or equity financing.\nThe ability of the Company to begin operations in its new business model is dependent upon, among other things, obtaining financing to commence operations and develop a business plan or making an acquisition. The Company cannot give any assurance as to its ability to develop or acquire a business or to operate profitably.\nThese factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. The accompanying consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors.\nCritical Accounting Policies\nUse of Estimates: The preparation of the accompanying consolidated financial statements in conformity with GAAP requires management to make certain estimates and assumptions that directly affect the results of reported assets, liabilities, revenue, and expenses, including the valuation of non-cash transactions. Actual results may differ from these estimates.\nDebt Investments\nThe Companys debt securities are primarily invested in a third-party vendor, and asset management company, to purchase, develop and manage real estate properties. Given the nature of lending to these types of businesses, substantially all of the Companys investments in these portfolio companies are considered Level 3 assets under ASC Topic 820 because there generally is no known or accessible market or market indexes for debt instruments for these investment securities to be traded or exchanged. The Company may, from time to time, invest in public debt of companies that meet the Companys investment objectives, and to the extent market quotations or other pricing indicators (i.e. broker quotes) are available, these investments are considered Level 1 or 2 assets in line with ASC Topic 820.\nRevenue Recognition\nThe Company recognizes revenue in accordance with Topic 606, which requires the Company to recognize revenues when control of the promised goods or services is transferred to customers at an amount that reflects the consideration to which the Company expects to be entitled to in exchange for those goods or services. The Company recognizes revenue based on the five criteria for revenue recognition established under Topic 606: 1) identify the contract, 2) identify separate performance obligations, 3) determine the transaction price, 4) allocate the transaction price among the performance obligations, and 5) recognize revenue as the performance obligations are satisfied.\nThe Company records interest income on an accrual basis and recognizes it as earned in accordance with the contractual terms of the loan agreement and underlying debt instrument, to the extent that such amounts are expected to be collected. Debt investments are placed on non-accrual status when it is probable that principal, interest or fees will not be collected according to contractual terms. When a debt investment is placed on non-accrual status, the Company ceases to recognize interest and fee income until the portfolio company has paid all principal and interest due or demonstrated the ability to repay its current and future contractual obligations to the Company. The Company may not apply the non-accrual status to a loan where the investment has sufficient collateral value to collect all of the contractual amount due and is in the process of collection. Interest collected on non-accrual investments are generally applied to principal.\nRecent Accounting Pronouncements\nWe have implemented all new pronouncements that are in effect and that may impact our consolidated financial statements and we do not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on our consolidated financial statements or results of operations. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a smaller reporting company, we have elected not to provide the information required by this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe following financial statements are being filed with this report and are located immediately following the signature page.\nFinancial Statements, July 31, 2022\n·\nReport of Independent Registered Public Accounting Firm (PCAOB ID 2851)\n·\nConsolidated Balance Sheet at July 31, 2022\n·\nConsolidated Statement of Operations for the period from inception (May 11, 2022) through July 31, 2022\n·\nConsolidated Statement of Changes in Stockholders Equity for the period from inception (May 11, 2022) through July 31, 2022\n·\nConsolidated Statement of Cash Flows for the period from inception (May 11, 2022) through July 31, 2022\n·\nNotes to Consolidated Financial Statements ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNo disagreement or reportable event requiring disclosure under this item has occurred. ITEM 9A. CONTROLS AND PROCEDURES\nManagements Conclusions Regarding Effectiveness of Disclosure Controls and Procedures\nWe conducted an evaluation of the effectiveness of our disclosure controls and procedures (Disclosure Controls), as defined by Rules 13a-15(e) of the Securities Exchange Act of 1934, as amended (the Exchange Act), as of July 31, 2022, the end of the year covered by this annual report on Form 10-K. The Disclosure Controls evaluation was done under the supervision and with the participation of management, including our chief executive officer and chief financial officer, who is the same person. There are inherent limitations to the effectiveness of any system of disclosure controls and procedures. Accordingly, even effective disclosure controls and procedures can only provide reasonable assurance of achieving their control objectives. Based upon this evaluation, our chief executive officer and chief financial officer concluded that, due to our limited internal audit function and the absence of any accounting staff, our disclosure controls were not effective as of July 31, 2022, such that the information required to be disclosed by us in reports filed under the Securities Exchange Act of 1934 is (i) recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and (ii) accumulated and communicated to the chief executive officer/chief financial officer, as appropriate to allow timely decisions regarding disclosure.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) under the Securities Exchange Act. Our management is also required to assess and report on the effectiveness of our internal control over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act of 2002 (Section 404). Management assessed the effectiveness of our internal control over financial reporting as of July 31, 2022. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework. During our assessment of the effectiveness of internal control over financial reporting as of July 31, 2022, management identified material weaknesses related to (i) our internal audit functions (ii) inadequate levels of review of the financial statements, (iii) a lack of segregation of duties within accounting functions, (iii) the absence of any full-time accounting personnel, and (v) the absence of any independent directors. Therefore, our internal controls over financial reporting were not effective as of July 31, 2022.\nManagement has determined that our internal controls contain material weaknesses due to the absence of segregation of duties, as well as lack of qualified accounting personnel and excessive reliance on third party consultants for accounting, financial reporting and related activities. The lack of any separation of duties, with the same person, who is our only employee who serves as both chief executive officer and chief financial officer, and who does not have an accounting background and serves on a part-time basis, makes it unlikely that we will be able to implement effective internal controls over financial reporting in the near future.\nDue to our size and nature, segregation of all conflicting duties is not possible. However, to the extent possible, we plan to implement procedures to assure that the initiation of transactions, the custody of assets and the recording of transactions will be performed by separate individuals if and when we have sufficient income to enable us to hire such individuals, and we cannot give any assurance that we will be able to hire such personnel. Our financial condition makes it difficult for us to implement a system of internal controls over financial reporting.\nUntil we generate significantly greater revenues and employ accounting personnel, it is doubtful that we will be able implement any system which provides us with any degree of internal controls over financial reporting. Due to the nature of this material weakness in our internal control over financial reporting, there is more than a remote likelihood that misstatements which could be material to our annual or interim financial statements could not be prevented or detected.\nA material weakness (within the meaning of PCAOB Auditing Standard No. 5) is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis. A significant deficiency is a deficiency, or a combination of deficiencies, in internal control over financial reporting that is less severe than a material weakness, yet important enough to merit attention by those responsible for oversight of our financial reporting.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nChanges in Internal Control over Financial Reporting.\nDuring the period ended July 31, 2022, there was no change in our internal control over financial reporting (as such term is defined in Rule 13a-15(f) under the Exchange Act) that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table presents information with respect to our officers, directors:\nName\nAge\nPosition(s)\nJose Maria Eduardo Gonzalez Romero\nChief executive officer, chief financial officer, president, secretary and director\nYolanda Goodell\nVice president and director\nFrancis Pittilloni\nDirector\nMr. Romero has been our chief executive officer, chief financial officer, president, secretary and a director since August 14, 2019. Mr. Romero has, since 2010, been president and chief executive officer of Panama Ship Store, a distribution company in Panama which is owned by Mr. Romero and is his principal occupation. From 1998 to 2008, he was director for the export market in Latin America for Procter & Gamble. Mr. Romero has more than 25 years of experience in the marketing, finance, commercial and logistics areas. He holds a university degree in business and economics from the University Autonoma of GDL in Mexico. Mr. Romero will work for us on a part-time basis.\nMs. Goodell has been a director since November 4, 2021 and has been vice president since March 14, 2022. She also currently the vice president, chief marketing officer, secretary and treasurer for RAC, our wholly owned subsidiary. From February 2021 to present Ms. Goodell has held the position as chief marketing officer of PreCheck Health Services, a high complexity molecular laboratory based in Miami Florida. Prior to her role as CMO she held the position as VP of sales for Latin America from 2017 to February 2021.\nMr. Pittilloni has been a director since November 4, 2022. He is also currently the chief operating officer for RAC, our wholly owned subsidiary. From February 2021 to present, Mr. Pittilloni has held the position as chief operating officer of PreCheck Health Services, a high complexity molecular laboratory based in Miami Florida. Prior to his role as COO from 2017 to February 2018 he was director of operations & hotel brand development for Globia, based out of Spain and was the managing partner of 2W Global Management a brand consulting company.\nCode of Ethics\nWe have adopted a code of ethics that applies to our principal executive officers, principal financial officer, principal accounting officer or controller, or persons performing similar functions.\nCommittees of the Board of Directors\nWe do not have any committees of our board of directors.\nCompliance with Section 16(a) of the Securities Exchange Act of 1934\nSection 16(a) of the Securities Exchange Act of 1934, as amended, requires executive officers and directors of issuers whose securities are registered pursuant to the Securities Exchange Act and persons who own more than 10% of a registered class of our equity securities to file with the SEC initial statements of beneficial ownership, reports of changes in ownership and annual reports concerning their ownership of the our common stock and other equity securities, on Form 3, 4 and 5 respectively. Mr. Romero was delinquent in a Form 3, Ms. Goodell was delinquent in a Form 3 and Form 4 filing and Mr. Pittillonni was delinquent in a Form 3 and Form 4 filing. All delinquent filings mentioned herein have since been filed with the SEC. ITEM 11: EXECUTIVE COMPENSATION\nThe following summary compensation table sets forth information concerning compensation for services rendered in all capacities during the years ended July 31, 2022 and 2021, earned by or paid to our executive officers who served in that capacity during the year ended July 31, 2022.\nBonus\nStock\nOptions/\nWarrant\nNon-Equity\nPlan\nNonqualified\nDeferred\nAll\nOther\nName and Principal Position\nYear\nSalary\nAwards\nAwards\nAwards\nCompensation\nEarnings\nCompensation\nTotal\n($)\n($)\n($)\n($)\n($)\n($)\n($)\n($)\n($)\nJose Maria Eduardo Gonzalez Romero1\n-\n-\n-\n-\n-\n-\n-\n-\nCEO, CFO\n-\n-\n-\n-\n-\n-\n-\n-\n_________\n1 Jose Maria Eduardo Gonzalez Romero is serving on a monthly basis for no compensation\nEmployment Agreements\nOn August 14, 2019, we entered into an employment agreement with Mr. Romero for a term through July 31, 2020, pursuant to which Mr. Romero is to serve as our chief executive officer and we agreed to issue to Mr. Romero a total of 24,000 shares of common stock in four instalments of 6,000 shares on each of the execution of the employment agreement, November 10, 2019, February 10, 2020 and May 10, 2020, provided that, with certain exceptions, he is employed by us on such date.\nPension Benefits\nWe currently have no plans that provide for payments or other benefits at, following, or in connection with retirement of our officers.\nOutstanding Equity Awards at Fiscal Year-End\nThere are no outstanding equity awards at July 31, 2022. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table provides information as to shares of common stock beneficially owned as of October 25, 2022 by:\n●\nEach director;\n●\nEach current officer named in the summary compensation table;\n●\nEach person owning of record or known by us, based on information provided to us by the persons named below, at least 5% of our common stock; and\n●\nAll directors and officers as a group.\nFor purposes of the following table, beneficial ownership means the sole or shared power to vote, or to direct the voting of, a security, or sole or shared investment power with respect to a security, or any combination thereof, and the right to acquire such power (for example, through the exercise of warrants granted by us) within 60 days of October 25, 2022.\nName and Address of Beneficial Owner\nAmount and Nature of Beneficial Ownership (Common Stock)\n% of shares (Common Stock)\nAmount and Nature of Beneficial Ownership (Preferred A Stock)1\n% of Shares (Preferred A Stock\nJose Maria Eduardo Gonzalez Romero\nPH Torre La Cresra #11, Bellavista, Panama City, PM\n281,513\n47.2%\nYolanda Goodell\n11153 SW 37th MNR, Davie, FL 33328\n19,513\n3.3%\n33,333\n33.3%\nFrancis Pittilloni\n100 Biscayne BLVD, Miami, FL 33132\n19,513\n3.3%\n33,333\n33.3%\nAll officers and directors as a group\n53.8%\n5% Stockholders\n______________\nEach share of Series A Preferred Stock entitles the holder to 10 votes on any matter presented to the holders of the Common Stock and are exercisable at a 25% discount to the next qualified financing of at least $1,000,000. The remaining shares of Series A Preferred Stock are held by Frank Gillen. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nOn July 1, 2022, we entered into an Agreement and Plan of Reorganization dated June 30,2022 with RAC and the shareholders of RAC, namely Frank Gillen, Francis Pittilloni, a director of the Company, and Yolanda Goodell, an officer and director of the Company (RAC Shareholders). As a result, the Company acquired all of the outstanding shares of RAC, which were valued at $500,000 based upon the net cash position of RAC. In exchange for their shares RAC Shareholders received 100,000 Series A Preferred Stock as follows: 33,334 Series A Preferred Stock to Mr. Gillen in exchange for 334 shares of RAC, 33,333 Series A Preferred Stock to Mr. Pittilloni in exchange for 333 shares of RAC and 33,333 Series A Preferred Stock to Ms. Goodell in exchange for 333 shares of RAC. The $500,000 in funds held by RAC was generated through the sale of shares of its common stock as follows: 334 shares to Mr. Gillen for gross proceeds of $166,668, 333 shares to Mr. Pittilloni for gross proceeds of $166,666 and 333 to Ms. Goodell for gross proceeds of $166,666. Mr. Pittilloni is a director of the Company and Ms. Goodell is a director and serves as Vice President of the Company.\nDirector Independence\nOur securities are not listed on a national securities exchange or in an inter-dealer quotation system which has requirements that directors be independent. As a result, we have adopted the independence standards of the NYSE American (formerly known as the American Stock Exchange and more recently the NYSE MKT) to determine the independence of our directors. These standards provide that a person will be considered an independent director if he or she is not an officer of the Company and is, in the view of the Companys Board of Directors, free of any relationship that would interfere with the exercise of independent judgment. Our Board of Directors has determined that we have no independent directors. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table sets forth the fees billed by our independent accountants, KCCW Accountancy Corp. for the years ended July 31, 2022, and 2021 for the categories of services indicated.\nKCCW Accountancy Corp.\nYear Ended July 31,\nAudit fees\n$ 13,500\n$ 12,500\nAudit-related fees\n-\n-\nTax fees\n-\n-\nAll other fees\n-\n-\nAudit fees consist of fees related to professional services rendered in connection with the audit of our annual financial statements.\nAll other fees relate to professional services rendered in connection our registration statement.\nOur policy is to pre-approve all audit and permissible non-audit services performed by the independent accountants. These services may include audit services, audit-related services, tax services and other services. Under our audit committees policy, pre-approval is generally provided for particular services or categories of services, including planned services, project based services and routine consultations. In addition, the audit committee may also pre-approve particular services on a case-by-case basis. Our board approved all services that our independent accountants provided to us in the past two fiscal years.\nPART IV ITEM 15. EXHIBITS\nEXHIBIT\nExhibit\nIncorporated by Reference\nFiled\nNumber\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\nHerewith\n2.1\nAgreement and plan of reorganization dated July 1, 2022, between the Company and RAC Real Estate Acquisition Corp, a Wyoming Corporation\n8-K\n000-55233\n2.1\n7/7/2022\n3.1\nAmended and Restated Articles of Incorporation dated June 6, 2022\n14C\n000-55233\nExhibit A\n4/8/2022\n3.2\nBy laws of the Company\nS-1\n333-184830\n3.2\n11/8/2012\n10.1\nEmployment agreement dated August 14, 2019, between the Company and Jose Maria Eduardo Gonzalez Romero\n8-K\n000-55233\n99.1\n8/15/2019\n10.2\nLoan agreement dated July 18, 2022, between the Company and Fix Pads LLC, a South Carolina limited liability company\n8-K\n000-55233\n99.1\n7/29/2022\n10.3\n12% secured promissory note dated July 22, 2022\n8-K\n000-55233\n99.2\n7/29/2022\n10.4\nPartial assignment of promissory note dated July 25,2022, between the Company and Frank Campanaro\n8-K\n000-55233\n99.3\n7/29/2022\n10.5\nLoan agreement dated August 18, 2022 between the Company and Fix Pads LLC, a South Carolina limited liability company\n8-K\n000-55233\n99.1\n8/26/2022\n10.6\n12% secured promissory note dated August 18,2022\n8-K\n000-55233\n99.2\n8/26/2022\n10.7\nPartial assignment of promissory note dated August 18, 2022, between the Company and Frank Campanaro\n8-K\n000-55233\n99.3\n8/26/2022\n10.8\nLimited liability Company Agreement of RAC FIXPADS II, LLC dated effective October 4, 2022\n8-K\n000-55233\n99.1\n10/11/2022\n14.1\nCode of Ethics\n10-K\n333-184830\n14.1\n8/29/2013\n31.1\nCertification of principal executive and financial officer pursuant to Section 302 of the Sarbannes Oxley Act of 2002\nx\n32.1\nSection 1350 certification of the principal executive officer and principal financial officer\nx\n101.INS\nXBRL Instance Document\nx\n101.SCH\nXBRL Taxonomy Schema Document\nx\n101.CAL\nXBRL Taxonomy Calculation Document\nx\n101.DEF\nXBRL Taxonomy Linkbase Document\nx\n101.LAB\nXBRL Taxonomy Label Linkbase Document\nx\n101.PRE\nXBRL Taxonomy Presentation Linkbase Document\nx\nITEM 16. FORM 10-K SUMMARY\nNot Applicable\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nDate: November 1, 2022\niMine Corporation\nBy:\n/s/ Jose Maria Eduardo Gonzalez Romero\nName:\nJose Maria Eduardo Gonzalez Romero\nTitle:\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Jose Maria Eduardo Gonzalez Romero\nChief executive officer, chief financial officer\nNovember 1, 2022\nJose Maria Eduardo Gonzalez Romero\nand director (principal executive and financial officer)\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID 2851)\nConsolidated Balance Sheet as of July 31, 2022\nConsolidated Statement of Operations from May 11, 2022 (inception) to July 31, 2022\nConsolidated Statement of Changes in Stockholders Equity from May 11, 2022 (inception) to July 31, 2022\nConsolidated Statement of Cash Flows from May 11, 2022 (inception) to July 31, 2022\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of iMINE Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of iMINE Corporation (the Company) as of July 31, 2022, the related consolidated statements of operations, changes in stockholders equity, and cash flows for the period from May 11, 2022 (inception) to July 31, 2022, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at July 31, 2022, and the results of its operations and its cash flows for the period then ended, in conformity with the generally accepted accounting principles in the United States of America.\nGoing Concern Uncertainty\nThe accompanying consolidated financial statements have been prepared assuming that iMINE Corporation will continue as a going concern. As described in Note 3 to the consolidated financial statements, the Company has incurred losses from operations and is in need of additional capital to grow its operations so that it can become profitable. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans with regard to these matters are described in Note 3. The accompanying consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ KCCW Accountancy Corp.\nWe have served as the Companys auditor since 2022.\nDiamond Bar, California\nNovember 1, 2022\niMine Corporation\nConsolidated Balance Sheet\nJuly 31,\nASSETS\nCurrent Assets\nCash\n$ 718\nLoan receivable\n336,480\nTotal Current Assets\n337,198\nTOTAL ASSETS\n$ 337,198\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent Liabilities\nAccounts payable and accrued liabilities\n$ 13,075\nDeferred interest income\n6,748\nDue to related parties\n8,812\nTotal Current Liabilities\n28,635\nTOTAL LIABILITIES\n28,635\nStockholders' Equity\nPreferred stock: 10,000,000 authorized; $0.001 par value\nSeries A preferred stock 100,000 designated; $0.001 par value 100,000 shares issued and outstanding\nCommon stock: 300,000,000 authorized; $0.001 par value 595,986 shares issued and outstanding\nAdditional paid in capital\n331,105\nAccumulated deficit\n(23,238 )\nTotal Stockholders' Equity\n308,563\nTOTAL LIABILITIES AND STOCKHOLDERS' EQUITY\n$ 337,198\nThe accompanying notes are an integral part of these consolidated financial statements.\niMine Corporation\nConsolidated Statement of Operations\nMay 11, 2022\n(Inception) to\nJuly 31,\nInterest income\n$ 1,106\nOperating expenses\nGeneral and administrative\nProfessional fees\n24,285\nTotal operating expenses\n24,344\nLoss from operations\n(23,238 )\nLoss before income taxes\n(23,238 )\nProvision for income taxes\n-\nNet Loss\n$ (23,238 )\nBasic and diluted loss per share of common stock\n$ (0.10 )\nBasic weighted average number of common shares outstanding\n228,093\nThe accompanying notes are an integral part of these consolidated financial statements.\niMine Corporation\nConsolidated Statement of Changes in Stockholders Equity\nSeries A\nTotal\nPreferred Stock\nCommon Stock\nAdditional\nAccumulated\nStockholders'\nShares\nAmount\nShares\nAmount\nPaid in\nCapital\nDeficit\nEquity\nBalance - Inception May 11, 2022\n-\n$ -\n-\n$ -\n$ -\n$ -\n$ -\nSeries A preferred stock issued to founders\n100,000\n-\n-\n499,900\n-\n500,000\nReorganization\n-\n-\n595,986\n(168,795 )\n-\n(168,199 )\nNet loss\n-\n-\n-\n(23,238 )\n(23,238 )\nBalance - July 31, 2022\n100,000\n$ 100\n595,986\n$ 596\n$ 331,105\n$ (23,238 )\n$ 308,563\nThe accompanying notes are an integral part of these consolidated financial statements.\niMine Corporation\nConsolidated Statement of Cash Flows\nMay 11, 2022\n(Inception) to\nJuly 31,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss\n$ (23,238 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nNon-cash interest income\n(1,106\n)\nChanges in operating assets and liabilities:\nAccounts payable and accrued liabilities\n8,850\nDue to related parties\n5,825\nNet cash used in operating activities\n(9,669 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nCash receipt from acquisition of subsidiary\nAdvance on loan receivable\n(328,626 )\nNet cash used in investing activities\n(328,291 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from issuance of Series A Preferred Stock\n500,000\nRepayment to related parties\n(161,322 )\nNet cash provided by financing activities\n338,678\nNet change in cash\nCash, beginning of period\n-\nCash, end of period\n$ 718\nSupplemental cash flow information\nCash paid for interest\n$ -\nCash paid for taxes\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements.\niMine Corporation\nNotes to Consolidated Financial Statements\nNOTE 1 - ORGANIZATION AND BUSINESS OPERATIONS\niMine Corporation (the Company or iMine) is a Nevada corporation incorporated on October 26, 2010 under the name Oconn Industries Corp. The Companys name was changed on March 11, 2014 from Oconn Industries Corp. to Diamante Minerals, Inc. and to iMine Corporation on March 20, 2018. The change of name to iMine Corporation was effective through the merger of the Companys wholly owned subsidiary, iMine Corporation, into the Company. The Company's subsidiary, iMine Corporation, an Indiana corporation, which has been administratively dissolved.\nIn July 2022, the Company acquired RAC Real Estate Acquisition Corp, a Wyoming Corporation (\"RAC\"). RAC is now a wholly owned subsidiary of the Company. The Company, through RAC, plans to focus on real estate transactions, in which the Company will buy and develop real estate for sale or rent of low-income housing. The Company plans to invest in three sectors of this market by (i) buying, refurbishing and selling traditional foreclosures, (ii) buying, developing and renting Land Banks that have an average pool of homes or lots in excess of 100 in one location and (iii) buying, refurbishing or developing and selling homes made available by the government through HECM pools. The Company is currently working with a third-party vendor to facilitate this plan.\nShare Exchange and Reorganization\nOn July 1, 2022, the Company entered into an Agreement and Plan of Reorganization dated June 30, 2022 (the Agreement) with RAC, and the shareholders of RAC, namely Frank Gillen, Francis Pittilloni, and Yolanda Goodell (the Shareholders), whereby the Company issued to the Shareholders a combined 100,000 shares of Series A Preferred Stock, par value of $0.001 per share in consideration for a combined 1,000 shares of RAC common stock, par value $0.001, held by the Shareholders, which represents 100% of the issued and outstanding capital stock of RAC. As a result, RAC becomes a wholly owned subsidiary of the Company. Shareholders of RAC paid a combined capital contribution of $500,000 in cash as consideration for their combined 1,000 shares of RAC common stock.\nRecapitalization\nFor financial accounting purposes, this transaction was treated as a reverse acquisition by RAC and resulted in a recapitalization with RAC being the accounting acquirer and the Company as the acquired company. The consummation of this reverse acquisition resulted in a change of control. Accordingly, the historical financial statements prior to the acquisition are those of the accounting acquirer, RAC, and have been prepared to give retroactive effect to the reverse acquisition completed on June 30, 2022 and represent the operations of RAC. The consolidated financial statements after the acquisition date, June 30, 2022, include the balance sheets of both companies at fair value, the historical results of RAC and the results of the Company from the acquisition date. All share and per share information in the accompanying consolidated financial statements and footnotes has been retroactively restated to reflect the recapitalization.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe consolidated financial statements and related disclosures have been prepared pursuant to the rules and regulations of the Securities and Exchange Commission (SEC). The consolidated financial statements have been prepared using the accrual basis of accounting in accordance with Generally Accepted Accounting Principles (GAAP) of the United States.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amount of revenues and expenses during the reporting period. Actual results could differ from those estimates. The Companys periodic filings with the SEC include, where applicable, disclosures of estimates, assumptions, uncertainties and markets that could affect the financial statements and future operations of the Company.\nFiscal Period\nThe Companys fiscal year end is July 31.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of iMine and its wholly owned subsidiaries. Intercompany transactions and balances have been eliminated.\nCash and Cash Equivalents\nFor purposes of balance sheet presentation and reporting of cash flows, the Company considers all unrestricted demand deposits, money market funds and highly liquid debt instruments with an original maturity of less than 90 days to be cash and cash equivalents. The Company had no cash equivalents at July 31, 2022.\nPeriodically, the Company may carry cash balances at financial institutions more than the federally insured limit of $250,000 per institution. The Company has not experienced losses on account balances and management believes, based upon the quality of the financial institutions, that the credit risk with regard to these deposits is not significant.\nFair Value Measurements\nThe Company measures the fair value of financial assets and liabilities based on US GAAP guidance which defines fair value, establishes a framework for measuring fair value, and expands disclosures about fair value measurements.\nFASB ASC 820, Fair Value Measurements defines fair value for certain financial and nonfinancial assets and liabilities that are recorded at fair value, establishes a framework for measuring fair value and expands disclosures about fair value measurements. It requires that an entity measure its financial instruments to base fair value on exit price, maximize the use of observable units and minimize the use of unobservable inputs to determine the exit price. It establishes a hierarchy which prioritizes the inputs to valuation techniques used to measure fair value. This hierarchy increases the consistency and comparability of fair value measurements and related disclosures by maximizing the use of observable inputs and minimizing the use of unobservable inputs by requiring that observable inputs be used when available. Observable inputs are inputs that reflect the assumptions market participants would use in pricing the assets or liabilities based on market data obtained from sources independent of the Company. Unobservable inputs are inputs that reflect the Companys own assumptions about the assumptions market participants would use in pricing the asset or liability developed based on the best information available in the circumstances. The hierarchy prioritizes the inputs into three broad levels based on the reliability of the inputs as follows:\n·\nLevel 1 - Inputs are quoted prices in active markets for identical assets or liabilities that the Company has the ability to access at the measurement date. Valuation of these instruments does not require a high degree of judgment as the valuations are based on quoted prices in active markets that are readily and regularly available.\n·\nLevel 2 - Inputs other than quoted prices in active markets that are either directly or indirectly observable as of the measurement date, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\n·\nLevel 3 - Valuations based on inputs that are unobservable and not corroborated by market data. The fair value for such assets and liabilities is generally determined using pricing models, discounted cash flow methodologies, or similar techniques that incorporate the assumptions a market participant would use in pricing the asset or liability.\nFinancial instruments, including cash, prepaid expense, accounts payable and accrued liabilities, deferred interest income, and due to related parties, are carried at amortized cost, which management believes approximates fair value due to the short-term nature of these instruments.\nDebt Investments\nThe Companys debt securities are primarily invested in a third-party vendor and asset management company, to purchase, develop and manage real estate properties. Given the nature of lending to these types of businesses, substantially all of the Companys investments in these portfolio companies are considered Level 3 assets under ASC Topic 820 because there generally is no known or accessible market or market indexes for debt instruments for these investment securities to be traded or exchanged. The Company may, from time to time, invest in public debt of companies that meet the Companys investment objectives, and to the extent market quotations or other pricing indicators (i.e. broker quotes) are available, these investments are considered Level 1 or 2 assets in line with ASC Topic 820.\nRevenue Recognition\nThe Company recognizes revenue in accordance with Topic 606, which requires the Company to recognize revenues when control of the promised goods or services is transferred to customers at an amount that reflects the consideration to which the Company expects to be entitled to in exchange for those goods or services. The Company recognizes revenue based on the five criteria for revenue recognition established under Topic 606: 1) identify the contract, 2) identify separate performance obligations, 3) determine the transaction price, 4) allocate the transaction price among the performance obligations, and 5) recognize revenue as the performance obligations are satisfied.\nThe Company records interest income on an accrual basis and recognizes it as earned in accordance with the contractual terms of the loan agreement and underlying debt instrument, to the extent that such amounts are expected to be collected. Debt investments are placed on non-accrual status when it is probable that principal, interest or fees will not be collected according to contractual terms. When a debt investment is placed on non-accrual status, the Company ceases to recognize interest and fee income until the portfolio company has paid all principal and interest due or demonstrated the ability to repay its current and future contractual obligations to the Company. The Company may not apply the non-accrual status to a loan where the investment has sufficient collateral value to collect all of the contractual amount due and is in the process of collection. Interest collected on non-accrual investments are generally applied to principal.\nShare-based expenses\nThe Company accounts for stock-based compensation arrangements with employees, nonemployee directors and consultants using a fair value method, which requires the recognition of compensation expense for costs related to all stock-based payments, including stock options, on a straight-line basis over the requisite service period in the Companys consolidated statements of operations. The fair value method requires the Company to estimate the fair value of stock-based payment awards on the date of grant.\nIncome Taxes\nThe Company provides for income taxes under ASC 740, Accounting for Income Taxes. ASC 740 requires the use of an asset and liability approach in accounting for income taxes. Deferred tax assets and liabilities are recorded based on the differences between the financial statement and tax bases of assets and liabilities and the tax rates in effect when these differences are expected to reverse.\nASC 740 requires the reduction of deferred tax assets by a valuation allowance if, based on the weight of available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized.\nBeneficial Conversion Feature\nThe issuance of the convertible debt generated a beneficial conversion feature (BCF), which arises when a debt or equity security is issued with an embedded conversion option that is beneficial to the investor or in the money at inception because the conversion option has an effective strike price that is less than the market price of the underlying stock at the commitment date. The Company recognized the BCF by allocating the intrinsic value of the conversion option, which is the number of shares of common stock available upon conversion multiplied by the difference between the effective conversion price per share and the fair value of common stock per share on the commitment date, resulting in a discount on the convertible debt (recorded as a component of additional paid-in capital). The discount is amortized to interest expense over the term of the convertible debt.\nConcentrations of Credit Risk\nThe Companys financial instruments that are exposed to concentrations of credit risk primarily consist of its cash and related party payables it will likely incur in the near future. The Company places its cash with financial institutions of high credit worthiness. At times, its cash balance with a particular financial institution may exceed any applicable government insurance limits. The Companys management plans to assess the financial strength and credit worthiness of any parties to which it extends funds, and as such, it believes that any associated credit risk exposures are limited.\nNet Loss per Share of Common Stock\nThe Company calculates net loss per share in accordance with ASC Topic 260, Earnings per Share. Basic loss per share is computed by dividing the net loss by the weighted average number of common shares outstanding during the period. Diluted earnings per share of common stock are computed by dividing net earnings by the weighted average number of shares and potential shares outstanding during the period. Potential shares of common stock consist of shares to be issued taken into account the effect of dilutive instruments. As of July 31, 2022, there were 100,000 shares of series A preferred stock, that were not included in the calculation of dilutive earnings per share as their effect would be anti-dilutive.\nCommitments and Contingencies\nThe Company follows ASC 450-20, Loss Contingencies, to report accounting for contingencies. Liabilities for loss contingencies arising from claims, assessments, litigation, fines and penalties and other sources are recorded when it is probable that a liability has been incurred and the amount of the assessment can be reasonably estimated.\nRecent Accounting Pronouncements\nIn August 2020, the FASB issued ASU 2020-06, ASC Subtopic 470-20 Debt-Debt with Conversion and Other Options and ASC subtopic 815-40 Hedging-Contracts in Entitys Own Equity. The standard reduced the number of accounting models for convertible debt instruments and convertible preferred stock. Convertible instruments that continue to be subject to separation models are (1) those with embedded conversion features that are not clearly and closely related to the host contract, that meet the definition of a derivative, and that do not qualify for a scope exception from derivative accounting; and, (2) convertible debt instruments issued with substantial premiums for which the premiums are recorded as paid-in capital. The amendments in this update are effective for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years. The adoption of this guidance on May 11,2022 did not have a material effect on the Companys consolidated financial statements.\nIn October 2021, the FASB issued ASU 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers, which amends ASC 805 to require an acquirer to, at the date of acquisition, recognize and measure contract assets and contract liabilities acquired in accordance with ASU 2014-9, Revenue from Contracts with Customers (Topic 606) as if the entity had originated the contracts. The guidance is effective for fiscal years beginning after December 15, 2022. The Company is currently assessing the impact of the adoption of this standard on its consolidated financial statements.\nIn March 2020, the FASB issued ASU 2020-4, Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting, which provides optional expedients and exceptions for a limited time to ease the potential burden of accounting for reference rate reform on financial reporting. This guidance applies to contracts, hedging relationships and other transactions affected by the discontinuation of the London Interbank Offered Rate (LIBOR) and other interbank offered rates. The guidance is effective beginning on March 12, 2020 through December 31, 2022. In January 2021, the FASB issued ASU 2021-01 allowing entities to apply certain aspects of ASC 848 (previously ASU 2020-4) to all derivative instruments that undergo a modification of the interest rate used for discounting, margining or contract price alignment as a result of the reference reform. The guidance is also effective through December 31, 2022. The Company is currently assessing the impact of the adoption of this standard on its consolidated financial statements.\nThe Company has implemented all new pronouncements that are in effect and that may impact its consolidated financial statements and does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its consolidated financial statements or results of operations.\nNOTE 3 - GOING CONCERN AND LIQUIDITY CONSIDERATIONS\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates the realization of assets and the liquidation of liabilities in the normal course of business. During the period ended July 31, 2022, the Company incurred a net loss of $23,238. As of July 31, 2022, the Company had an accumulated deficit of $23,238. In order to continue as a going concern, the Company will need, among other things, additional capital resources. Managements plans to raise necessary funding through equity financing arrangements, which may be insufficient to fund its capital expenditures, working capital and other cash requirements for the year ended July 31, 2023. However, until the Company engages in an active business or makes an acquisition the Company is likely to not be able to raise any significant debt or equity financing.\nThe ability of the Company to begin operations in its new business model is dependent upon, among other things, obtaining financing to commence operations and develop a business plan or making an acquisition. The Company cannot give any assurance as to its ability to develop or acquire a business or to operate profitably.\nThese factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. The accompanying consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nNOTE 4 - LOAN RECEIVABLE\nOn July 22, 2022, the Company received a promissory note, in the principal amount of $672,960 from, and entered into a Loan Agreement dated July 18, 2022 with, Fix Pads Holdings, LLC. The note has a 12% interest rate per annum payable of $672,960 as follows: (1) a pre-payment on July 22, 2022 of pro-rated interest for the period from July 22, 2022 through July 30, 2022 in the amount of $2,212; (2) a pre-payment of interest on August 1, 2022 for the period from August 1, 2022 through September 30, 2022 in the amount of $13,496; and then (3) monthly payments of interest only beginning on October 1, 2022 and continuing on the 1st day of each month thereafter until all principal and accrued interest are paid in full by July 1, 2023. The note is secured by mortgages or deeds of trust on property valued at $1,121,600.\nConsideration for the note was paid in part by the Company in the amount of $328,626 and in part by a third party investor in the amount of $328,626.\nDuring the year ended July 31, 2022, the Company recorded interest income of $1,106 and deferred interest income of $6,748 as of July 31, 2022.\nNOTE 5 - RELATED PARTY TRANSACTIONS\nDuring the period ended July 31, 2022, the Company's shareholders paid operating expenses of $5,825 on behalf of the Company, and the Company repaid $161,322 to related parties.\nAs of July 31, 2022, the Company had due to related party of $8,812.\nNOTE 6 - EQUITY\nAuthorized Preferred Stock\nThe Company has authorized 10,000,000 shares of preferred stock at par value of $0.001 per share.\nOn July 1, 2022, the Board of Directors of the Company, by unanimous consent, approved and authorized the Certificate of Designation for 100,000 shares of its Series A Preferred Stock, par value $0.001, to be executed by proper officer of the Company and filed with the State of Nevada.\n·\nThe Series A Preferred Shares share in any dividends pari passu with the holders of common stock;\n·\nThe Series A Preferred Shares have a liquidation preference equal to $10.00 per share;\n·\nEach share of Series A Preferred Stock entitles the holder to 10 votes on any matter presented to the holders of the Common Stock;\n·\nThe Series A Preferred Shares have the right to convert into shares of Common Stock at a 25% discount to the next financing of $1,000,000 or more, subject to adjustment for stock splits or combinations, dividends and distributions of Common Shares, reorganizations, mergers or consolidations, or for issuance of shares of common stock below the conversion price;\n·\nThe Company has no right to redeem the shares; and\nOn July 1, 2022, the Company issued all 100,000 shares of the Series A Preferred Stock for acquisition of RAC (see Note 1).\nAs of July 31, 2022, the Company had 100,000 shares of preferred stock issued and outstanding.\nAuthorized Common Stock\nThe Company has authorized 300,000,000 shares of common stock at par value of $0.001 per share. Each share of common stock entitles the holder to one vote on any matter on which action of the stockholders of the corporation is sought.\nOn July 1, 2022, the Company recognized the equity of iMine as part of the reorganization which resulted in the Company recognizing the issued and outstanding 595,986 shares of common stock.\nAs of July 31, 2022, the Company had 595,986 shares of common stock issued and outstanding.\nAs of July 31, 2022, the Company had no options and warrants outstanding.\nNOTE 7 - INCOME TAXES\nThe provision for refundable federal income tax at 21% consists of the following for the periods ending:\nJuly 31,\nLoss for the year\n$ (23,238 )\nIncome tax (benefit) at statutory rate\n$ (4,880 )\nChange in valuation allowance\n4,880\nProvision for income taxes\n$ -\nThe Company assesses the likelihood that deferred tax assets will not be realized. ASC 740, Income Taxes requires that a valuation allowance be established when it is more likely than not that all, or a portion of, deferred tax assets will not be realized. A review of all available positive and negative evidence needs to be considered, including the scheduled reversal of deferred tax liabilities, projected future taxable income, and tax planning strategies. After consideration of all the information available, management believes that uncertainty exists with respect to future realization of its deferred tax assets and has, therefore, established a full valuation allowance as of July 31, 2022.\nNet deferred tax assets consist of the following components as of:\nJuly 31,\nDeferred tax assets:\nNon-operating loss carryforward\n$ 4,880\nValuation allowance\n(4,880 )\nNet deferred tax asset\n$ -\nThe Company has not completed its evaluation of NOL utilization limitation under IRC Section 382, change of ownership rules, but believes that it had a change of ownership that would limit the amount of the U.S. NOLs that could be utilized each year based on the provisions of Section 382.\nNOTE 8 - SUBSEQUENT EVENTS\nOn August 18, 2022, the Company issued the promissory note. The note has a 12% interest rate per annum payable of $358,620 and is due on August 1, 2023. Consideration for the note was paid in part by the Company in the amount of $175,007.\nOn October 4, 2022, the Company, through RAC, entered into a Limited Liability Agreement with Fix Pads Holdings, LLC (\"Fix Pads\"). As a result of the agreement, RAC and Fix Pads formed a limited liability company called RAC FIXPADS II, LLC, incorporated in the state of Delaware. The LLC has two members RAC and Fix Pads, both providing an initial contribution to the LLC of $1,000 in exchange for a 50% membership interest represented by an issuance of 1,000 Units of the LLC to each party. Each member is entitled to 1 vote per member. The LLC is managed by a manager, Fix Pads. The agreement provides that additional capital contributions of the members will be made to the LLC as follows: (i) Fix Pads will transfer and assign all rights to and incidents of ownership for 60 residential properties it has title, or will have title, to the LLC, as set forth in the Agreement; and (ii) RAC will make additional cash contributions to the capital of the LLC, up to a maximum of $5,214,000, on such dates and in such amounts as requested by the LLC, in the manner set forth in the agreement.\nManagement has evaluated subsequent events through November 1, 2022, the date on which the financial statements are available to be issued. All subsequent events requiring recognition as of July 31, 2022 have been incorporated into these consolidated financial statements."
}