{
    "cik": "1557798",
    "company": "Tianci International, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-31",
    "period_of_report": "2022-07-31",
    "sic": "1311",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1557798/0001683168-22-007135-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1557798/000168316822007135/tianci_10k-073122.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1557798/0001683168-22-007135.txt",
    "filename": "1557798_10K_2022_0001683168-22-007135.htm",
    "content": "Item 1. Business\nCorporate Overview\nWe are currently a shell company with no meaningful assets or operations other than our efforts to identify and merge with an operating company. We were incorporated in the State of Nevada on June 13, 2012. Our current business office is located at 20 Holbeche Road, Arndell Park, NSW, Australia. Our telephone number is +61-02 9672 1899.\nWe were initially an exploration stage company under the name of Freedom Petroleum Inc. (changed to Steampunk Wizards, Inc., effective on July 2, 2015) that originally intended to engage in the exploration and development of oil and gas properties. In April 2015, after reviewing the markets with investor appetite and management's duties to its shareholders, the Company determined to discontinue its oil and gas operation. We then began exploring opportunities in the computer gaming and application industry.\nWe engaged in computer game development until October 13, 2016, when control of our company changed pursuant to a share purchase agreement and a spin-off agreement. On October 26, 2016, our corporate name was changed from Steampunk Wizards, Inc. to \"Tianci International, Inc.\" The name change was effected on November 27, 2016, in connection with the merger of us into our then subsidiary, Tianci International Inc.\nEffective April 6, 2017, we effectuated a 1-for-40 reverse stock split (the 2017 Reverse Stock Split) of our issued and outstanding shares of common stock, $0.0001 par value, whereby 49,854,280 outstanding shares were exchanged for 1,246,357 shares of our common stock. Common share amounts and per share amounts in these accompanying financial statements and notes have been retroactively adjusted to reflect this reverse stock split.\nOn August 3, 2017, we entered into a Stock Purchase Agreement (the SPA) with Shifang Wan (the Seller), the record holder of 4,397,837 common shares, or approximately 87.00% of the issued and outstanding of Common Stock of the Company, and Chuah Su Chen and Chuah Su Mei (collectively, the Purchasers, and together with the Company and the Seller, the Parties). Pursuant to the SPA, the Seller sold to the Purchasers and the Purchasers acquired from the Sellers the Shares for a total gross purchase price of Three Hundred Fifty Thousand Dollars ($350,000). The acquisition was consummated on August 15, 2017. The Purchasers used personal funds to acquire the Shares.\nEffective August 6, 2021, Tianci International, Inc., a Nevada corporation (we, us, or the Company), Chuah Su Mei, our former Chief Executive Officer, President and Director, and Silver Glory Group Limited, entered into a Stock Purchase Agreement (the Stock Purchase Agreement) pursuant to which Chuah Su Mei agreed to sell to Silver Glory Group Limited all 1,793,000 shares of common stock of the Company held by her (the Shares) for cash consideration of Five Hundred Twenty Five Thousand Dollars ($525,000) (the Transaction). The Shares represent approximately 73.18% of the issued and outstanding common stock of the Company and are being sold in reliance upon an exemption from registration under the Securities Act of 1933, as amended, pursuant to Section 4(2) thereof. The sale of the Shares consummated on August 26, 2021, and was purchased by Silver Glory Group Limited using its working capital. As a result of the Transaction, Silver Glory Group Limited holds a controlling interest in the Company and may unilaterally determine the election of the members of the Board of Directors (the Board) and other substantive matters requiring approval of the Companys stockholders.\nUpon the closing of the Transaction, on August 26, 2021, the then current directors and officers of the Company resigned from his or her positions with the Company. The resignations were not due to any dispute or disagreement with the Company on any matter relating to the Company's operations, policies or practices.\nConcurrently with such resignation, the following individuals were appointed to serve in the offices set forth next to his name until the next annual meeting of stockholders of the Company and until such directors successor is elected and qualified or until such directors earlier death, resignation or removal.\nName Office\nZhigang Pei Chief Executive Officer, Chief Financial Officer, Secretary and Director\nShufang Gao Director\nDavid Wei Fang Director\nJack Fan Liu Independent director\nYee ManYung Independent director\nJimmy Weiyu Zhu Independent director\nNone of the directors or executive officers has a direct family relationship with any of the Companys directors or executive officers. Each officer and director will serve in his positions without compensation. The Company plans to enter into compensatory arrangements with its officers and directors in the future.\nCurrent Business\nOur principal business is to achieve long-term growth potential through a combination with a business rather than immediate, short-term earnings. Based on proposed business activities, we are a blank check company. We intend to comply with the periodic reporting requirements of the Exchange Act for so long as it is subject to those requirements.\nAs of the date of this Annual Report, we have not entered into any binding agreement with any party regarding acquisition opportunities for us. We hope to continue to engage in discussions with other operating businesses affiliated with our executive officers regarding potential acquisition opportunities. There is no assurance that any nonbinding term sheet will result into a definitive purchase transaction nor can we assure you that we will be able to successfully acquire such company or any company in the near future.\nThe analysis of new business opportunities will be undertaken by or under the supervision of the Companys officers. We have unrestricted flexibility in seeking, analyzing and participating in potential business opportunities. In its efforts to analyze potential acquisition targets, we will consider the following kinds of factors:\n· Potential for growth, indicated by new technology, anticipated market expansion or new products;\n· Competitive position as compared to other firms of similar size and experience within the industry segment as well as within the industry as a whole;\n· Strength and diversity of management, either in place or scheduled for recruitment;\n· Capital requirements and anticipated availability of required funds from the Registrant, from operations, through the sale of additional securities, through joint ventures or similar arrangements or from other sources;\n· The extent to which the business opportunity can be advanced;\n· The accessibility of required management expertise, personnel, raw materials, services, professional assistance and other required items; and\n· Other relevant factors.\nIn applying the foregoing criteria, no one of which will be controlling, management will attempt to analyze all factors and circumstances and make a determination based upon reasonable investigative measures and available data. Potentially available acquisition opportunities may occur in many different industries, and at various stages of development, all of which will make the task of comparative investigation and analysis of such business opportunities extremely difficult and complex. We may not discover or adequately evaluate adverse facts about the business to be acquired. In evaluating a prospective business combination, we will conduct as extensive a due diligence review of potential targets as possible given the lack of information that may be available regarding private companies, our limited personnel and financial resources.\nWe expect that our due diligence will encompass, among other things, meetings with the target businesss incumbent management and inspection of its facilities, as necessary, as well as a review of financial and other information, which is made available to us. This due diligence review will be conducted either by our management or by unaffiliated third parties we may engage. Our lack of funds and the lack of full-time management will likely make it impracticable to conduct a complete and exhaustive investigation and analysis of a target business before we consummate a business combination. Management decisions, therefore, will likely be made without detailed feasibility studies, independent analysis, market surveys and the like which, if we had more funds available to us, would be desirable. We will be particularly dependent in making decisions upon information provided by the promoters, owners, sponsors or others associated with the target business seeking our participation.\nThe time and costs required to select and evaluate a target business and to structure and complete a business combination cannot presently be ascertained with any degree of certainty. Any costs incurred with respect to the indemnification and evaluation of a prospective business combination that is not ultimately completed will result in a loss to us.\nAdditionally, we are in a highly competitive market for a small number of business opportunities, which could reduce the likelihood of consummating a successful business combination. We are, and will continue to be, an insignificant participant in the business of seeking mergers with, joint ventures with and acquisitions of small private and public entities. A large number of established and well-financed entities, including small public companies and venture capital firms, are active in mergers and acquisitions of companies that may be desirable target candidates for us. Nearly all these entities have significantly greater financial resources, technical expertise and managerial capabilities than we do; consequently, we will be at a competitive disadvantage in identifying possible business opportunities and successfully completing a business combination. These competitive factors may reduce the likelihood of our identifying and consummating a successful business combination.\nHistorical Activities\n2014 Securities Sale\nIn January 2014, we were a party to a securities purchase agreement (the \"2014 SPA\") by and among ourselves, certain of our shareholders (the \"Selling Shareholders\") owning an aggregate of 27,000,000 shares (before the 2017 Reverse Stock Split) (approximately 51.7%) of our common stock (the \"Sold Stock\") and Anton Lin (\"Lin\"). Pursuant to the 2014 SPA, Lin purchased the Sold Stock for $27,000 (the \"Purchase Price\") from the Selling Shareholders in a private sale transaction (the \"Private Sale\"). The Selling Shareholders were our former sole officer and director: Thomas Hynes (\"Hynes\") and corporate secretary: Nina Bijedic (\"Bijedic\"). Pursuant to the 2014 SPA, Hynes and Bijedic submitted their resignations from all positions held with us; prior to the closing of the Private Sale, our Board of Directors appointed Lin as our sole director and Chief Executive Officer, which appointment took effect immediately following the close of the Private Sale. Following the Private Sale, a change in control occurred since Lin gained control of almost 52% of our outstanding common stock.\n2015 Share Exchange\nOn July 15, 2015, we entered into a share exchange agreement (the Exchange Agreement) with Steampunk Wizards Ltd., a company incorporated pursuant to the laws of Malta (Malta Co.), Lin, being the owner of record of 11,451,541 common shares (before the 2017 Reverse Stock Split) of the Company and the persons listed thereof (the Shareholders), being the owners of record of all of the issued share capital of Malta Co. (the Steampunk Stock). Pursuant to the Exchange Agreement, upon surrender by the Shareholders and the cancellation by Malta Co. of the certificates evidencing the Steampunk Stock as registered in the name of each Shareholder, and pursuant to the registration of us in the register of members maintained by Malta Co. as the new holder of the Steampunk Stock and the issuance of the certificates evidencing the aforementioned registration of the Steampunk Stock in the name of us, on August 21, 2015, we issued 4,812,209 shares (the New Shares) (before the 2017 Reverse Stock Split) (subject to adjustment for fractionalized shares as set forth below) of our common to the Shareholders (or their designees), and Lin caused 10,096,229 shares (before the 2017 Reverse Stock Split) of our common stock that he owned (the Lin Stock, together with the New Shares, the Acquisition Stock) to be transferred to the Shareholders (or their designees), which collectively represented 55% of the issued and outstanding common stock of us immediately after the Closing, in exchange for the Steampunk Stock, representing 100% of the issued share capital of Malta Co. As a result of the exchange of the Steampunk Stock for the Acquisition Stock (the Share Exchange), Malta Co. became a wholly owned subsidiary (the Subsidiary) of us and there was a change of control of us following the closing. The Shareholders of Malta Co. owned approximately 55% of our issued and outstanding common stock. There were no warrants, options or other equity instruments issued in connection with the Exchange Agreement.\nMalta Co. was incorporated in 2014 to acquire the intellectual property (IP) related to an unfinished game called Tangled Tut. Making full use of the teams experience and diverse talent set, the company built the first mobile game with 3D printable rewards embedded and the associated IP and server technology.\nThrough Malta Co, we became an independent games development and technology company that specialized in developing enchanting games and gaming technology where the real and virtual worlds blur. We launched a mobile casual game called Bungee Mummy - Challenges, designed primarily for smartphones and tablets (supporting both Android and IOS), in late August of 2015.\nOn January 29, 2016, Lin resigned from his CEO and sole director positions with Tianci, and Mr. Joshua OCock became our CEO, CFO, Secretary and Director.\n2016 Securities Sale and Spin-Off\nOn October 13, 2016, we entered into a spin-off agreement (the Spin-Off Agreement) with Malta Co. and Praefidi Holdings Limited (the Buyer), an entity organized under the laws of Malta that was owned by Brendon Grunewald. Pursuant to the Spin-Off Agreement, the Buyer received all of the issued and outstanding capital stock of Malta Co. and we received $2,000 as purchase price. The Buyer became the sole equity owner of Malta Co. and we had no further interest in Malta Co.\nOn October 13, 2016, shareholders who owned in the aggregate 18,071,445 shares (the 2016 Shares) (before the 2017 Reverse Stock Split) of our common stock, representing approximately 65.1% of all our issued and outstanding common stock at the time, entered into a Share Purchase Agreement (the Change of Control SP) with certain purchasers listed therein pursuant to which the purchasers acquired the 2016 Shares for an aggregate purchase price of $150,000. In connection with the sale, a change in control occurred, and Mr. Joshua OCock, our former President, Chief Executive Officer, Chief Financial Officer, Treasurer, Secretary and sole director, resigned from all of his director and officer positions with us.\nSimultaneously with the closing, Cuilian Cai, was appointed as a director and Chief Executive Officer and Chief Financial Officer of Tianci.\nEffective November 7, 2016, we changed our name from Steampunk Wizards, Inc. to Tianci International, Inc.\nOn January 4, 2017, we issued 19,532,820 shares of our common stock (before the 2017 Reverse Stock Split) to certain purchasers in accordance with the terms and conditions of a Securities Purchase Agreement (the Private Placement SPA), at price of $0.005 per share for an aggregate purchase price of $98,104. The shares sold in the private placement were issued in reliance on an exemption from registration under the Securities Act of 1933, as amended, pursuant to Section 4(2) thereof. The proceeds were used for working capital purposes.\n2017 Securities Sale and Change in Control\nOn August 3, 2017, Tianci, ShiFang Wan (SFW), Chuah Su Mei, and Chuah Su Chen executed a Stock Purchase Agreement (the Stock Purchase Agreement), pursuant to which SFW sold to the Chuah Su Chen and Chuah Su Mei an aggregate of 4,397,837 shares of Common Stock, or approximately 87% of the issued and outstanding Common Stock, at a purchase price of $350,000. The acquisition consummated on August 15, 2017, and 2,000,000 shares of the Companys common stock were purchased by Chuah Su Chen using her own personal funds. Upon consummation, the former sole executive officer and director of Tianci resigned from all of her positions with Tianci, and Chuah Su Mei, Chuah Su Chen and Yeow Yuen Kai were appointed to serve in the positions set forth next to their names below:\nName Position\nChuah Su Chen Director, Secretary and Chief Financial Officer\nChuah Su Mei Director, Chief Executive Officer and President\nYeow Yuen Kai Director and Chief Technology Officer\nChuah Su Chen and Chuah Su Mei are siblings.\nEffective August 30, 2017, Jerry Ooi was appointed to serve as a Director of Tianci until his successor(s) shall be duly elected or appointed, unless he resigns, is removed from office or is otherwise disqualified from serving as a director of Tianci. Mr. Kai resigned from his position as the Chief Technology Officer effective September 20, 2017, and his position as our director effective August 31, 2019.\n2021 Securities Sale and Change in Control\nEffective August 6, 2021, Tianci International, Inc., a Nevada corporation (we, us, or the Company), Chuah Su Mei, our former Chief Executive Officer, President and Director, and Silver Glory Group Limited, entered into a Stock Purchase Agreement (the Stock Purchase Agreement) pursuant to which Chuah Su Mei agreed to sell to Silver Glory Group Limited all 1,793,000 shares of common stock of the Company held by her (the Shares) for cash consideration of Five Hundred Twenty Five Thousand Dollars ($525,000) (the Transaction). The Shares represent approximately 73.18% of the issued and outstanding common stock of the Company and are being sold in reliance upon an exemption from registration under the Securities Act of 1933, as amended, pursuant to Section 4(2) thereof. The sale of the Shares consummated on August 26, 2021, and was purchased by Silver Glory Group Limited using its working capital. As a result of the Transaction, Silver Glory Group Limited holds a controlling interest in the Company and may unilaterally determine the election of the members of the Board of Directors (the Board) and other substantive matters requiring approval of the Companys stockholders.\nUpon the closing of the Transaction, on August 26, 2021, the then current directors and officers of the Company resigned from his or her positions with the Company. The resignations were not due to any dispute or disagreement with the Company on any matter relating to the Company's operations, policies or practices. Each of the foregoing former officers and directors also forgave all amounts due to them from the Company in connection with the closing of the Transaction.\nConcurrently with such resignation, the following individuals were appointed to serve in the offices set forth next to his name until the next annual meeting of stockholders of the Company and until such directors successor is elected and qualified or until such directors earlier death, resignation or removal.\nName Office\nZhigang Pei Chief Executive Officer, Chief Financial Officer, Secretary and Director\nShufang Gao Director\nDavid Wei Fang Director\nJack Fan Liu Independent director\nYee ManYung Independent director\nJimmy Weiyu Zhu Independent director\nNone of the directors or executive officers has a direct family relationship with any of the Companys directors or executive officers. Each officer and director will serve in his positions without compensation. The Company plans to enter into compensatory arrangements with its officers and directors in the future.\nEmployees. As of the date of this Annual Report, we did not have any employees. We expect to hire employees after the acquisition of an operating business. Item 1A. Risk Factors\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nWe do not own any property. Our principal offices located at 20 Holbeche Road, Arndell Park, NSW, Australia. Item 3. Legal Proceedings\nFrom time to time, we may be involved in litigation relating to claims arising out of our operations in the normal course of business. We are not aware of any pending or threatened legal proceeding that, if determined in a manner adverse to us, could have a material adverse effect on our business and operations. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur company's common stock is quoted on the OTCQB under the symbol \"CIIT\". Our stock did not begin trading until March 15, 2013. There is currently no established public trading market for our common stock, and there can be no assurance that we will be able to establish or maintain such public trading market for our securities in the future, if ever.\nThe following table sets forth the quarterly high and low closing bid prices for the common stock for the past two fiscal years. The prices set forth below represent inter-dealer quotations, without retail markup, markdown or commission and may not be reflective of actual transactions.\nHigh Low\nQuarter ended July 31, 2022 $ 3.76 $ 0.60\nQuarter ended April 30, 2022 $ 1.45 $ 0.03\nQuarter ended January 31, 2022 $ 1.48 $ 0.56\nQuarter ended October 31, 2021 $ 2.52 $ 0.65\nQuarter ended July 31, 2021 $ 1.77 $ 0.41\nQuarter ended April 30, 2021 $ 2.02 $ 0.50\nQuarter ended January 31, 2021 $ 3.90 $ 0.70\nQuarter ended October 31, 2020 $ 2.50 $ 0.15\nOn October 23, 2022, the closing bid price of the common stock was $1.05.\nHolders\nAs of October 24, 2022, there were 88 stockholders of record and an aggregate of 2,450,148 shares of our common stock were issued and outstanding. Our common shares are issued in registered form. The transfer agent of our company's common stock is Action Stock Transfer Corporation at 2469 E Fort Union Blvd, Suite 214, Salt Lake City, UT 84121.\nDescription of Securities\nThe authorized capital stock of our company consists of 100,000,000 of common stock, at $0.0001 par value, and 20,000,000 shares of preferred stock, at $0.0001 par value.\nDividend Policy\nWe have not paid any cash dividends on our common stock and have no present intention of paying any dividends on the shares of our common stock. Our current policy is to retain earnings, if any, for use in our operations and in the development of our business. Our future dividend policy will be determined from time to time by our board of directors.\nEquity Compensation Plan Information\nWe do not have in effect any compensation plans under which our equity securities are authorized for issuance and we do not have any outstanding stock options.\nRecent Sales of Unregistered Securities\nNone.\nPurchase of Equity Securities by the Issuer and Affiliated Purchasers\nWe did not purchase any of our shares of common stock or other securities during our fourth quarter of our fiscal year ended July 31, 2022. Item 6. Selected Financial Data\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with our audited financial statements and the related notes that appear elsewhere in this annual report. The following discussion contains forward-looking statements based upon current expectations that involve risks and uncertainties, such as our plans, objectives, expectations and intentions. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of a number of factors, including those set forth under the Item 1A. Risk Factors, Cautionary Notice Regarding Forward-Looking Statements and Business sections in this Form 10-K. We use words such as anticipate, estimate, plan, project, continuing, ongoing, expect, believe, intend, may, will, should, could, and similar expressions to identify forward-looking statements.\nOur audited financial statements are stated in United States Dollars and are prepared in accordance with Generally Accepted Accounting Principles of the United States of America (the U.S. GAAP)\nOverview\nWe are currently a shell company with no meaningful assets or operations other than our efforts to identify and merge with an operating company. We were incorporated in the State of Nevada on June 13, 2012. Our current business office is located at 20 Holbeche Road, Arndell Park NSW, Australia. Our telephone number is +61-02 9672 1899.\nWe were initially an exploration stage company under the name of Freedom Petroleum Inc. (changed to Steampunk Wizards, Inc., effective on July 2, 2015) that originally intended to engage in the exploration and development of oil and gas properties. In April 2015, after reviewing the markets with investor appetite and management's duties to its shareholders, the Company determined to discontinue its oil and gas operation. We then began exploring opportunities in the computer gaming and application industry.\nWe engaged in computer game development until October 13, 2016, when control of our company changed pursuant to a share purchase agreement and a spin-off agreement. On October 26, 2016, our corporate name was changed from Steampunk Wizards, Inc. to \"Tianci International, Inc.\" The name change was effected on November 27, 2016, pursuant to Nevada Revised Statutes Section 92A.180 in connection with the merger of us into our then subsidiary, Tianci International Inc.\nOn August 3, 2017, we entered into a Stock Purchase Agreement (the SPA) with Shifang Wan (the Seller), the record holder of 4,397,837 common shares, or approximately 87.00% of the issued and outstanding of Common Stock of the Company, and Chuah Su Chen and Chuah Su Mei (collectively, the Purchasers, and together with the Company and the Seller, the Parties). Pursuant to the SPA, the Seller sold to the Purchasers and the Purchasers acquired from the Sellers the Shares for a total gross purchase price of Three Hundred Fifty Thousand Dollars ($350,000). The acquisition was consummated on August 15, 2017. The Purchasers used personal funds to acquire the Shares.\nUpon the consummation of the sale, Ms. Cuilian Cai resigned from her positions as director, Chief Executive Officer and Chief Financial Officer of the Company. Her resignation was not due to any dispute or disagreement with the Company on any matter relating to the Company's operations, policies or practices. Chuah Su Chen and Chuah Su Mei were appointed to serve in the positions set forth next to their names below:\nName Position\nChuah Su Chen Director, Chief Financial Officer and Secretary\nChuah Su Mei Director, Chief Executive Officer and President\nChuah Su Chen and Chuah Su Mei are sisters.\nWe are in active discussions with an operating business affiliated with our executive officers regarding potential acquisition. There is no assurance that we will be able to successfully acquire such company or any company in the near future.\nEffective August 6, 2021, Tianci International, Inc., a Nevada corporation (we, us, or the Company), Chuah Su Mei, our Chief Executive Officer, President and Director, and Silver Glory Group Limited, entered into a Stock Purchase Agreement (the Stock Purchase Agreement) pursuant to which Chuah Su Mei agreed to sell to Silver Glory Group Limited all 1,793,000 shares of common stock of the Company held by her (the Shares) for cash consideration of Five Hundred Twenty Five Thousand Dollars ($525,000) (the Transaction). The Shares represent approximately 73.18% of the issued and outstanding common stock of the Company and are being sold in reliance upon an exemption from registration under the Securities Act of 1933, as amended, pursuant to Section 4(2) thereof. The sale of the Shares consummated on August 26, 2021, and was purchased by Silver Glory Group Limited using its working capital. As a result of the Transaction, Silver Glory Group Limited holds a controlling interest in the Company and may unilaterally determine the election of the members of the Board of Directors (the Board) and other substantive matters requiring approval of the Companys stockholders.\nUpon the closing of the Transaction, on August 26, 2021, each of Chuah Su Chen, Chuah Su Mei, and Jerry Ooi, constituting all current directors and officers of the Company, resigned from his or her positions with the Company. The resignations were not due to any dispute or disagreement with the Company on any matter relating to the Company's operations, policies or practices. Each of the foregoing former officers and directors also forgave all amounts due to them from the Company in connection with the closing of the Transaction.\nConcurrently with such resignation, the following individuals were appointed to serve in the offices set forth next to his name until the next annual meeting of stockholders of the Company and until such directors successor is elected and qualified or until such directors earlier death, resignation or removal.\nName Office\nZhigang Pei Chief Executive Officer, Chief Financial Officer, Secretary and Director\nShufang Gao Director\nDavid Wei Fang Director\nJack Fan Liu Independent director\nYee ManYung Independent director\nJimmy Weiyu Zhu Independent director\nNone of the directors or executive officers has a direct family relationship with any of the Companys directors or executive officers. Each officer and director will serve in his positions without compensation. The Company plans to enter into compensatory arrangements with its officers and directors in the future.\nLimited Operating History; Need for Additional Capital\nWe have had limited operations and have been issued a \"going concern\" opinion by our auditor, based upon our reliance on the sale of our common stock and loans from a related party, as the sole source of funds for our future operations.\nThere is no historical financial information about us upon which to base an evaluation of our performance. We have not generated any revenues from operations. We cannot guarantee we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources, possible delays in the launching of our games and market or wider economic downturns. We do not believe we have sufficient funds to operate our business for the next 12 months.\nWe have no assurance that future financing will be available to us on acceptable terms, or at all. If financing is not available on satisfactory terms, we may be unable to continue, develop or expand our operations. Equity financing could result in additional dilution to existing shareholders. If we are unable to raise additional capital to maintain our operations in the future, we may be unable to carry out our full business plan or we may be forced to cease operations.\nGoing Concern\nOur financial statements have been prepared on a going concern basis which assumes the Company will be able to realize its assets and discharge its liabilities in the normal course of business for the foreseeable future. As of July 31, 2022, the Company had working capital deficiency of $222,887 and has incurred losses since its inception resulting in an accumulated deficit of $1,700,154. Further losses are anticipated in the development of the business, raising substantial doubt about the Companys ability to continue as a going concern. The financial statements do not include any adjustment that might result from the outcome of this uncertainty.\nThe ability to continue as a going concern is dependent upon the Company generating profitable operations in the future and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management intends to finance operating costs over the next twelve months with loans from directors and/or private placements of common stock.\nResults of Operations\nThe following tables provide selected financial data about our company as of and for the years ended July 31, 2022 and 2021.\nBalance Sheet Data\nJuly 31, July 31,\nChange\nCash $ 9,000 $ 3,951 $ 5,049\nTotal assets 22,250 17,951 4,299\nTotal liabilities 245,387 343,061 (97,674 )\nStockholders' deficit $ (223,137 ) $ (325,110 ) $ 101,973\nSummary Income Statement Data\nYear Ended\nJuly 31,\nChange\nNet Revenue $ - $ - $ -\nTotal Operating Expenses 247,743 63,003 184,740\nLoss From Operations 247,743 63,003 184,740\nOther Expenses - 11,381 (11,381 )\nNet Loss $ 247,743 $ 74,384 $ 173,359\nRevenue. During the fiscal years ended July 31, 2022 and 2021, we did not generate any revenues.\nOperating Expenses. Operating expenses were $247,743 and $63,003 for the years ended July 31, 2022 and 2021, respectively. Operating expenses mainly consisted of professional fees, executive compensation and office and miscellaneous expenses. The increase in operating expenses resulted primarily from an increase in professional fees and executive compensation.\nLoss from Operations. For the years ended July 31, 2022, and 2021, we incurred a loss from operations of $247,743 and $63,003, respectively. The increase in loss from operations was attributable to the increase in our operating expenses.\nOther Expenses. Other expenses for year ended July 31, 2021, consisted of $11,381 for an income tax penalty.\nNet Loss. For the years ended July 31, 2022, and 2021, we incurred a net loss of $247,743 and $74,384, respectively. The increase in net loss was primarily attributable to the increase in our operating expenses.\nLiquidity and Capital Resources\nWorking Capital\nJuly 31, July 31,\nChange\nCurrent Assets $ 22,250 $ 17,951 $ 4,299\nCurrent Liabilities 245,387 343,061 (97,674 )\nWorking Capital (Deficiency) $ (223,137 ) $ (325,110 ) $ 101,973\nAs of July 31, 2022, we had working capital deficit of $223,137 as compared to working capital deficit of $325,110 as of July 31, 2021. The decrease in working capital deficit was mainly due to a decrease in amounts due to related parties for the payment of operating expenses.\nCash Flows\nYear Ended\nJuly 31,\nCash used in operating activities $ (206,390 ) $ (74,248 )\nCash provided by investing activities - -\nCash provided by financing activities 211,439 74,231\nNet change in cash and cash equivalents $ 5,049 $ (17 )\nCash Flow from Operating Activities\nDuring the year ended July 31, 2022, net cash used in operating activities was $206,390, compared to $74,248 for the year ended July 31, 2021. The increase in net cash used in operating activities was mainly due to the increase in net loss offset by a decrease in accounts payable and accrued liabilities, prepaid expenses and an increase in prepaid management fees.\nCash Flow from Investing Activities\nDuring the years ended July 31, 2022, and 2021, we had no cash flow from investing activities.\nCash Flow from Financing Activities\nDuring the year ended July 31, 2022, net cash provided by financing activities was $211,439, compared to $74,231 for the year ended July 31, 2021. The increase in net cash provided by financing activities was mainly due to the increase in proceeds from related parties.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures, or capital resources that is material to investors.\nCritical Accounting Policies\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (U.S. GAAP) requires estimates and assumptions that affect the reported amounts of assets and liabilities, revenues and expenses, and related disclosures of contingent assets and liabilities in the financial statements and accompanying notes. The SEC has defined a companys critical accounting policies as the ones that are most important to the portrayal of the companys financial condition and results of operations, and which require the company to make its most difficult and subjective judgments, often as a result of the need to make estimates of matters that are inherently uncertain. Based on this definition, we have not identified any additional critical accounting policies and judgments. We also have other key accounting policies, which involve the use of estimates, judgments and assumptions that are significant to understanding our results, which are described in Note 3 to our financial statements. Although we believe that our estimates, assumptions and judgments are reasonable, they are based upon information presently available. Actual results may differ significantly from these estimates under different assumptions, judgments or conditions. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data\nTIANCI INTERNATIONAL, INC.\nFINANCIAL STATEMENTS\nPAGE\nReport of Independent Registered Public Accounting Firm (PCAOB ID 2851)\nBalance Sheets as of July 31, 2022 and 2021\nStatements of Operations for the years ended July 31, 2022 and 2021\nStatement of Changes in Stockholders Deficit for the years ended July 31, 2022 and 2021\nStatements of Cash Flows for the years ended July 31, 2022 and 2021\nNotes to Financial Statements\nAudit Tax Consulting Financial Advisory Registered with Public Company Accounting Oversight Board (PCAOB)\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders of\nTianci International, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Tianci International, Inc. (the Company) as of July 31, 2022 and 2021, the related statements of operations, stockholders deficit, and cash flows for the years ended July 31, 2022 and 2021, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company at July 31, 2022 and 2021, and the results of its operations and its cash flows for the years ended July 31, 2022 and 2021, in conformity with the U.S. generally accepted accounting principles.\nGoing Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern. As described in Note 2 to the financial statements, the Company has not yet established an ongoing source of revenues sufficient to cover its operating costs, which raises substantial doubt about its ability to continue as a going concern. Managements plans with regard to these matters are described in Note 2. The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ KCCW Accountancy Corp.\nWe have served as the Companys auditor since 2017.\nDiamond Bar, California\nOctober 29, 2022\nTIANCI INTERNATIONAL, INC.\nBALANCE SHEETS\nJuly 31, July 31,\nASSETS\nCurrent Assets\nCash $ 9,000 $ 3,951\nPrepaid expenses 1,750 14,000\nPrepaid compensation 11,500 -\nTotal Current Assets 22,250 17,951\nTOTAL ASSETS $ 22,250 $ 17,951\nLIABILITIES AND SHAREHOLDERS' DEFICIT\nCurrent Liabilities\nAccounts payable and accrued liabilities $ 50,499 $ 9,896\nDue to related parties 194,888 333,165\nTotal Current Liabilities 245,387 343,061\nTotal Liabilities 245,387 343,061\nCommitments and Contingencies - -\nSHAREHOLDERS' DEFICIT\nPreferred stock, $0.0001 par value; 20,000,000 shares authorized; no shares issued and outstanding - -\nCommon stock, $0.0001 par value, 100,000,000 shares authorized; 2,450,148 shares issued and outstanding\nAdditional paid-in capital 1,477,022 1,127,306\nAccumulated deficit (1,700,404 ) (1,452,661 )\nTotal Shareholders' Deficit\n(223,137 ) (325,110 )\nTOTAL LIABILITIES AND SHAREHOLDERS' DEFICIT $ 22,250 $ 17,951\nThe accompanying notes are an integral part of these financial statements.\nTIANCI INTERNATIONAL, INC.\nSTATEMENTS OF OPERATIONS\nYear Ended\nJuly 31,\nRevenues $ - $ -\nOperating Expenses\nGeneral administrative expenses 174,331\nProfessional fees 73,412 62,379\nTotal Operating Expenses 247,743 63,003\nLoss from Operations (247,743 ) (63,003 )\nOther Income (Expense)\nOther expenses - (11,381 )\nTotal Other Income (Expense) - (11,381 )\nLoss before Income Taxes (247,743 ) (74,384 )\nProvision for income taxes - -\nNet Loss $ (247,743 ) $ (74,384 )\nBasic and diluted loss per common share $ (0.10 ) $ (0.03 )\nBasic and diluted weighted average common shares outstanding 2,450,148 2,469,065\nThe accompanying notes are an integral part of these financial statements.\nTIANCI INTERNATIONAL, INC.\nSTATEMENTS OF CHANGES IN STOCKHOLDERS DEFICIT\nFOR YEARS ENDED JULY 31, 2022 AND\nCommon Stock Additional\nTotal\nNumber of\nShares\nAmount Paid-in\nCapital\nAccumulated\nDeficit\nShareholders\nDeficit\nBalance - July 31, 2020 4,751,718 1,127,076 (1,378,277 ) (250,726 )\nCancellation of common shares (2,301,570 ) (230 ) - -\nNet loss for the year - - - (74,384 ) (74,384 )\nBalance - July 31, 2021 2,450,148 $ 245 $ 1,127,306 $ (1,452,661 ) $ (325,110 )\nDebt forgiveness by related parties - - 349,716 - 349,716\nNet loss for the year - - - (247,743 ) (247,743 )\nBalance - July 31, 2022 2,450,148 $ 245 $ 1,477,022 $ (1,700,404 ) $ (223,137 )\nThe accompanying notes are an integral part of these financial statements\nTIANCI INTERNATIONAL, INC.\nSTATEMENTS OF CASH FLOWS\nYear Ended\nJuly 31,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss $ (247,743 ) $ (74,384 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nChanges in operating assets and liabilities:\nPrepaid expenses 12,250 (2,000 )\nPrepaid compensation (11,500 ) -\nAccounts payable and accrued liabilities 40,603 2,136\nNet cash used in operating activities (206,390 ) (74,248 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from related parties 212,641 74,231\nRepayment to related parties (1,202 ) -\nNet cash provided by financing activities 211,439 74,231\nNet change in cash 5,049 (17 )\nCash - beginning of period 3,951 3,968\nCash - end of period $ 9,000 $ 3,951\nSupplemental Cash Flow Disclosures\nCash paid for interest $ - $ -\nCash paid for income taxes $ - $ -\nNon-cash financing and investing activities\nCancellation of common shares $ - $ 230\nDebt forgiveness by related parties $ 349,716 $ -\nThe accompanying notes are an integral part of these financial statement\nTIANCI INTERNATIONAL, INC.\nNOTES TO FINANCIAL STATEMENTS\nJuly 31, 2022\nNOTE 1 - ORGANIZATION AND DESCRIPTION OF BUSINESS\nTianci International, Inc. (the Company, Tianci) was incorporated under the laws of the State of Nevada, as Freedom Petroleum, Inc. on June 13, 2012. In May 2015, the Company changed its name to Steampunk Wizards, Inc. and on November 9, 2016, the Company changed its name to Tianci International, Inc. As of the date of this report, the Company is a holding company and has not carried out substantive business operations of its own.\nThe Companys fiscal year end is July 31.\nChange of control\nEffective August 6, 2021, Tianci International, Inc., Chuah Su Mei, the Companys former Chief Executive Officer, President and Director, and Silver Glory Group Limited, entered into a Stock Purchase Agreement (the Stock Purchase Agreement) pursuant to which Chuah Su Mei agreed to sell to Silver Glory Group Limited all 1,793,000 shares of common stock of the Company held by her (the Shares) for cash consideration of Five Hundred Twenty Five Thousand Dollars ($525,000) (the Transaction). The Shares represent approximately 73.18% of the issued and outstanding common stock of the Company. The sale of the Shares consummated on August 26, 2021. As a result of the Transaction, Silver Glory Group Limited holds a controlling interest in the Company.\nUpon the closing of the Transaction, on August 26, 2021, each of Chuah Su Chen, Chuah Su Mei, and Jerry Ooi, constituting all current directors and officers of the Company, resigned from his or her positions with the Company. Each of the foregoing former officers and directors also forgave all amounts due to them from the Company in connection with the closing of the Transaction.\nConcurrently with such resignation, Zhigang Pei was appointed as Chief Executive Officer, Chief Financial Officer, Secretary and Director and two directors and three independent directors were also appointed to serve until the next annual meeting of stockholders of the Company.\nNOTE 2 - GOING CONCERN MATTERS\nAs of July 31, 2022, the Company had $9,000 in cash held in trust. The Company had incurred a net loss of $247,743 for the year ended July 31, 2022.\nThe Companys cash balance and revenues generated are not currently sufficient and cannot be projected to cover operating expenses for the next twelve months from the date of this report. These matters raise substantial doubt about the Companys ability to continue as a going concern. Managements plans include attempting to improve its business profitability, its ability to generate sufficient cash flows from its operations to meet its operating needs on a timely basis, obtain additional working capital funds through equity and debt financing arrangements, and restructure on-going operations to eliminate inefficiencies to raise cash balance in order to meet its anticipated cash requirements for the next twelve months from the date of this report. However, there can be no assurance that these plans and arrangements will be sufficient to fund the Companys ongoing capital expenditures, working capital, and other requirements. Management intends to make every effort to identify and develop sources of funds. The outcome of these matters cannot be predicted at this time. There can be no assurance that any additional financings will be available to the Company on satisfactory terms and conditions, if at all.\nThe ability of the Company to continue as a going concern is dependent upon its ability to raise additional capital and continue profitable operations. The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nNOTE 3 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe annual financial information referred to above has been prepared and presented in conformity with accounting principles generally accepted in the United States of America applicable to annual financial information and with the instructions to Form 10-K and regulation of the Securities and Exchange Commission (SEC). The annual financial information has been prepared on a basis consistent with prior periods and years and includes all disclosures that are necessary and required by applicable laws and regulations.\nThe accompanying financial statements and notes are presented in accordance with accounting principles generally accepted in the United States of America (the U.S. GAAP) and are presented in U.S. dollars. These annual financial statements include all adjustments that, in the opinion of management, are necessary in order to make the financial statements not misleading.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements. The estimates and judgments will also affect the reported amounts for certain revenues and expenses during the reporting period. Actual results could differ from these good faith estimates and judgments.\nCash and Cash Equivalents\nCash and cash equivalents include cash on hand, cash in trust, and all highly liquid debt instruments with original maturities of three months or less. The Company had $9,000 and $3,951 in cash and cash equivalents as of July 31, 2022 and 2021, respectively.\nFair Value Measurements\nAs defined in ASC 820 Fair Value Measurements, fair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (exit price). The Company utilizes market data or assumptions that market participants would use in pricing the asset or liability, including assumptions about risk and the risks inherent in the inputs to the valuation technique. These inputs can be readily observable, market corroborated, or generally unobservable. The Company classifies fair value balances based on the observability of those inputs. ASC 820 establishes a fair value hierarchy that prioritizes the inputs used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurement) and the lowest priority to unobservable inputs (level 3 measurement).\nThe Company's financial instruments consist of cash, prepaid expense, accounts payable, and due to related parties. The carrying amounts of these financial instruments approximate fair value due to either length of maturity or interest rates that approximate prevailing rates unless otherwise disclosed in these financial statements.\nRevenue Recognition\nThe Company has yet to generate revenues from operations. The Company will recognize revenue when control of the promised goods or services are transferred to a customer, in an amount that reflects the consideration that the Company expects to receive in exchange for those goods or services.\nIncome Taxes\nIncome taxes are accounted for under the asset and liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carry forwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance is recorded to reduce the Companys deferred tax assets to the amount that is more likely than not to be realized. See Note 6 for information related to income taxes, including the recorded balances of its valuation allowance related to deferred tax assets.\nBasic and Diluted Earnings (Loss) Per Share\nBasic earnings (loss) per share is calculated by dividing the Companys net loss applicable to common stockholders by the weighted average number of common shares during the period. Diluted earnings (loss) per share is calculated by dividing the Companys net loss available to common stockholders by the diluted weighted average number of shares outstanding during the year. The diluted weighted average number of shares outstanding is the basic weighted number of shares adjusted for any potentially dilutive debt or equity. There are no such common stock equivalents outstanding as of July 31, 2022 and 2021.\nRecent Accounting Pronouncements\nManagement has considered all recent accounting pronouncements issued and their potential effect on the financial statements. The Company's management believes that these recent pronouncements will not have a material effect on the Company's financial statements.\nNOTE 4 - DUE TO RELATED PARTIES\nDuring the years ended July 31, 2022 and 2021, the former and current shareholder of the Company advanced $212,641 and $74,231 for working capital purpose, respectively.\nDuring the years ended July 31, 2022 and 2021, the Company repaid $1,202 and $0 due to a former shareholder of the Company, respectively.\nOn August 26, 2021 and pursuant to the Stock Purchase Agreement dated on August 6, 2021 (see Note 1 - Change of control), Chuah Su Mei, the Companys former Chief Executive Officer, President and Director and all other former officers forgave all amounts due to them from the Company. In regard to this forgiveness, the Company recognized debt forgiveness by related parties of $349,716 as additional paid-in-capital.\nDuring the year ended July 31, 2022, the Company accrued $168,300 for the compensation of its CEO and five directors. During the year ended July 31, 2022, the Company paid compensation of $126,500 to the five directors. As of July 31, 2022, the Company owed $41,800 unpaid compensation to the CEO, which was included in accounts payable and accrued liabilities, and prepaid the amount of $11,500 for compensation to the five directors.\nAs of July 31, 2022, and July 31, 2021, the Company owed $194,888 and $333,165, respectively, to a shareholder of the Company. This loan is non-interest bearing, unsecured and due on demand.\nNOTE 5 - EQUITY\nPreferred Stock\nThe Company has 20,000,000 authorized preferred shares with a par value of $0.0001 per share. The Board of Directors are authorized to divide the authorized shares of Preferred Stock into one or more series, each of which shall be so designated as to distinguish the shares thereof from the shares of all other series and classes.\nThere were no shares of preferred stock issued and outstanding as of July 31, 2022 and 2021.\nCommon Stock\nThe Company has 100,000,000 authorized common shares with a par value of $0.0001 per share.\nOn August 4, 2020, the Chief Executive Officer of the Company cancelled 301,570 shares of common stock and Chief Financial Officer of the Company cancelled 2,000,000 shares of common stock.\nAs of July 31, 2022, and 2021, there were 2,450,148 shares of common stock issued and outstanding, respectively.\nNOTE 6 - INCOME TAXES\nThe Company files income tax returns in the U.S. federal jurisdiction, and state and local jurisdictions.\nThe Company follows ASC 740. Deferred income taxes reflect the net effect of (a) temporary difference between carrying amounts of assets and liabilities for financial purposes and the amounts used for income tax reporting purposes, and (b) net operating loss carry-forwards. No net provision for refundable Federal income tax has been made in the accompanying statements of operations because no recoverable taxes were paid previously. Similarly, no deferred tax asset attributable to the net operating loss carry-forward has been recognized, as it is not deemed likely to be realized.\nThe income tax benefit for the years ended July 31, 2022 and 2021 consists of the following:\nSchedule of components of income tax expense\nFor the Years Ended\nJuly 31,\nLoss before income tax $ (247,743 ) $ (74,384 )\nTax rate 21% 21%\nIncome tax expense (benefit) at statutory rate $ (52,026 ) $ (15,621 )\nChange in valuation allowance 52,026 15,621\nIncome tax expense (benefit) $ - $ -\nDeferred taxes reflect the net tax effect of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts recorded for tax purposes. Significant components of the Companys deferred tax assets and liabilities are as follows:\nSchedule of deferred tax assets\nAs of July 31,\nNOL Carryover $ 546,983 $ 494,957\nValuation allowance (546,983 ) (494,957 )\nNet deferred tax asset $ - $ -\nThe reconciliation of the effective income tax rate to the U.S. federal statutory rate as of July 31, 2022 and 2021:\nSchedule of effective income tax reconciliation\nAs of July 31,\nFederal income tax (benefit) (21)% (21)%\nIncrease in valuation allowance 21% 21%\nEffective income tax rate 0% 0%\nAt July 31, 2022 and 2021, the Company had $2,604,680 and $2,356,937, respectively of the U.S. net operating losses (the U.S. NOLs), which begin to expire beginning in 2035. NOLs generated in tax years prior to July 31, 2018, can be carryforward for twenty years, whereas NOLs generated after July 31,2018 can be carryforward indefinitely.\nThe Company assesses the likelihood that deferred tax assets will not be realized. FASB ASC Topic 740, Income Taxes requires that a valuation allowance be established when it is more likely than not that all, or a portion of, deferred tax assets will not be realized. A review of all available positive and negative evidence needs to be considered, including the scheduled reversal of deferred tax liabilities, projected future taxable income, and tax planning strategies. After consideration of all the information available, management believes that uncertainty exists with respect to future realization of its deferred tax assets and has, therefore, established a full valuation allowance as of July 31, 2022 and 2021.\nThe Company has not completed its evaluation of NOL utilization limitation under IRC Section 382, change of ownership rules, but believes that it had a change of ownership that would limit the amount of U.S. NOLs that could be utilized each year based on the Internal Revenue Code, as Amended.\nThe Companys tax returns are subject to examination by tax authorities beginning with the year ended July 31, 2018.\nNOTE 7 - COMMITMENTS AND CONTINGENCIES\nThe Company had no other commitments or contingencies as of July 31, 2022.\nFrom time to time the Company may become a party to litigation matters involving claims against the Company.\nManagement believes that it is adequately insured for its operations and there are no current matters that would have a material effect on the Company's financial position or results of operations.\nNOTE 8 - SUBSEQUENT EVENTS\nManagement has evaluated subsequent events through the date which the financial statements were available to be issued. All subsequent events requiring recognition as of July 31, 2022 have been incorporated into these financial statements and there are no subsequent events that require disclosure in accordance with FASB ASC Topic 855, Subsequent Events. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nThere were no disagreements with our accountants related to accounting principles or practices, financial statement disclosure, internal controls or auditing scope or procedure during the two fiscal years and subsequent interim periods. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures, as such term is defined in Rule 13a-15(e) under the Securities Exchange Act of 1934 (the Exchange Act), that are designed to ensure that information required to be disclosed in our Exchange Act reports is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer (\"CEO\")/Chief Financial Officer (\"CFO\"), as appropriate, to allow timely decisions regarding required disclosure. We conducted an evaluation (the Evaluation), under the supervision and with the participation of our CEO/CFO of the effectiveness of the design and operation of our disclosure controls and procedures (Disclosure Controls) as of the end of the period covered by this report pursuant to Rule 13a-15 of the Exchange Act. Based on this evaluation and the existence of the material weaknesses discussed below in Management's Report on Internal Control over Financial Reporting, our management, including our CEO/CFO concluded that our disclosure controls and procedures were not effective at the reasonable assurance level as of the end of the period covered by this Report.\nWe do not expect that our disclosure controls and procedures will prevent all errors and all instances of fraud. Disclosure controls and procedures, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the disclosure controls and procedures are met. Further, the design of disclosure controls and procedures must reflect the fact that there are resource constraints, and the benefits must be considered relative to their costs. Because of the inherent limitations in all disclosure controls and procedures, no evaluation of disclosure controls and procedures can provide absolute assurance that we have detected all our control deficiencies and instances of fraud, if any. The design of disclosure controls and procedures also is based partly on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nManagement's Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended, as a process designed by, or under the supervision of, our principal executive and principal financial officers and effected by our Board, management and other personnel to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\n· pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets;\n· provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of our management and directors; and\n· provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Additionally, projections of any evaluation of effectiveness to future periods are subject to the risks that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of our internal control over financial reporting as of July 31, 2022. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013). Based on this assessment, management concluded that our internal control over financial reporting was not effective as of July 31, 2022, due to the existence of the material weaknesses as of July 31, 2022, discussed below. A material weakness is a control deficiency, or a combination of control deficiencies, that results in more than a remote likelihood that a material misstatement of the annual or interim financial statements will not be prevented or detected in the following areas:\n· Because of the companys limited resources, there are limited controls over information processing.\n· There is an inadequate segregation of duties consistent with control objectives. Our Companys management is composed of only one person, resulting in a situation where limitations on segregation of duties exist. In order to remedy this situation, we would need to hire additional staff to provide greater segregation of duties. Currently, it is not feasible to hire additional staff to obtain optimal segregation of duties. Management will reassess this matter in the following year to determine whether improvement in segregation of duty is feasible.\n· The Company does not have a sitting audit committee financial expert, and as a result of the recent change in control, an audit committee, and thus the Company lacks the board oversight role within the financial reporting process.\n· There is a lack of formal policies and procedures necessary to adequately review significant accounting transactions. The Company utilizes a third-party independent contractor for the preparation of its financial statements. Although the financial statements and footnotes are reviewed by our management, we do not have a formal policy to review significant accounting transactions and the accounting treatment of such transactions. The third-party independent contractor is not involved in the day to day operations of the Company and may not be provided information from management on a timely basis to allow for adequate reporting/consideration of certain transactions.\nManagement believes that the material weaknesses set forth above were the result of the scale of our operations and are intrinsic to our small size. Management believes these weaknesses did not have a material effect on our financial results and intends to take remedial actions upon receiving funding for the Companys business operations.\nOur management will continue to monitor and evaluate the effectiveness of our internal controls and procedures and our internal controls over financial reporting on an ongoing basis and is committed to taking further action and implementing additional enhancements or improvements, as necessary and as funds allow.\nThis Annual Report on Form 10-K does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting due to permanent exemptions for smaller reporting companies.\nChanges in Internal Control Over Financial Reporting\nOther than as described above, there have been no changes in our internal control over financial reporting during the fourth quarter of fiscal 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nBecause of its inherent limitations, a system of internal control over financial reporting can provide only reasonable assurance and may not prevent or detect misstatements. Further, because of changes in conditions, effectiveness of internal controls over financial reporting may vary over time. Our system contains self-monitoring mechanisms, and actions are taken to correct deficiencies as they are identified. Item 9B. Other Information\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nAll directors of our company hold office until the next annual meeting of the security holders or until their successors have been elected and qualified. The officers of our company are appointed by the board of directors and hold office until their death, resignation or removal from office. The directors and executive officers, their ages, positions held, and duration as such, are set forth below as of the date of this Annual Report.\nName Age Office\nZhigang Pei Chief Executive Officer, Chief Financial Officer, Secretary and Director\nShufang Gao Director\nDavid Wei Fang Director\nJack Fan Liu Independent director\nYee ManYung Independent director\nJimmy Weiyu Zhu Independent director\nBusiness Experience\nThe following is a brief account of the education and business experience during at least the past five years of each director, executive officer and key employee of our company, indicating the persons principal occupation during that period, and the name and principal business of the organization in which such occupation and employment were carried out.\nZhigang Pei, age 50, joined us on August 26, 2021, as our Chief Executive Officer, Chief Financial Officer, Secretary, and a member of the Board. Mr. Pei has served as the Executive Director of Anyang Xinrun Investment Co., Ltd., a PRC company since November 2009. He has also served as the Executive Director and General Manager of Henan Ziwei Real Estate Development Co., Ltd., and Henan Anyang Dahua Commercial and Trading Plaza Development Co., Ltd. since 2015. Mr. Pei graduated from No.2 Middle School Anyang City in1989. Mr. Pei brings to the Board his deep experience in real estate and investment industries.\nShufang Gao, age 53, has worked as CEO of Hong Kong listed groups, president of domestic capital companies, and vice president of A-share listed companies. He is familiar with the A-share capital market and Hong Kong capital market, and has mature experience in the strategy and operation development of listed companies. He joined us on August 26, 2021, as a member of our Board. From October 2020 to August 2021, he served as the Vice President and Director of SiChuan Jinding Group. Prior to that, he was the Vice Chairman of Luoyang Yongning Nonferrous Technology Co., Ltd. from August 2019 to September 2020. From April 2018 to July 2019, Mr. Gao served as the Vice President of Tibet Huayu Mining Co., Ltd., an A-share listed company. He was the Chief Executive Officer of Haotian Development Group Co., Ltd. (Hong Kong Main Board Listed Company 00474) from August 2016 to September 2017. From August 2012 to August 2016, he served as the President of Haihua Group Holdings Co., Ltd., an international container leasing company. Mr. Gao received his Bachelor of Management Degree from Dalian University of Technology in 1999. He received his Masters of Finance and Accounting Degree from the Chinese University of Hong Kong in 2008. Mr. Gao brings to the Board his international experience in the operation and risk control areas of listed companies.\nDavid Wei Fang, age 49, has over ten years of experience in the securities and investment industry. He joined us on August 26, 2021, as a member of our Board. Mr. Fang served as the Partner of Tiger Securities and the CEO of Tiger Securities International in Hong Kong from May 2018 to July 2019. From January 2017 to April 2018, Mr. Fang served as the CEO of Haotian International Securities in Hong Kong. Mr. Fang was the Head of High Net Worth Individual, Corporate Client and ICBC Global Wealth Management Center of ICBC International in Hong Kong from October 2014 to December 2016. Mr. Fang has a Bachelors degree in Economics from Anhui University of Finance and Economics in 1994. Mr. Fang obtained his Master of Business Administration Degree from Georgia South University in 2004. Mr. Fang brings to the Board his deep experience in the securities and investment industry.\nJack Fan Liu, age 43, joined us on August 26, 2021, as a member of our Board. Prior to joining us, Mr. Liu was the Vice President of China Regenerative Medicine International Limited from September 2014 to October 2017. From July 2009 to August 2014, Mr. Liu was the Investment Director of Tian Huan Investment Company. He was a financial analyst of Founder Securities (SSE:601901) from May 2007 to June 2009. Mr. Liu received his B.A. in Engineering from Nanjing Tech University in 2001 and his Master of Economics from Concordia University, Canada in 2006. He brings to the Board his experience and knowledge of investments and mergers and acquisitions of companies in Hong Kong and China.\nYung Yee Man, age 29, has more than 5 years of HR manager experience in both Hong Kong and NASDAQ listed company. She also has two years experience as an assistant of board members. Ms. Yung joined us on 26 August, 2021, as a member of our Board. Ms. Yung holds a Masters degree in Corporate Communication from University of Leeds in 2017. Ms. Yung is currently pursuing an MBA Degree in University of South Australia. Ms. Yung brings to the Board her human resources and public company experience.\nJimmy Weiyu Zhu, age 55, joined us on August 26, 2021, as a member of our Board. Mr. Zhu has nearly twenty-five years of experience in the fields of mining, commodity trading, trade financing, logistics and shipping, and covering for companies located in Australia and Hong Kong. Mr. Zhu was the Financial Controller of Hai Xin Petroleum Trading Ltd. ( Hong Kong) from September 2017 to October 2020. Prior to that time, he served as the Financial Controller and Director of Ocean Container Leasing Services Ltd. and Gold Time International Resources Ltd. (Hong Kong) from July 2012 to August 2017. He received his B.A. in Accounting and Finance from Northeast University of Finance and Economics, China in 1991. Mr. Zhu brings to the Board his deep experience in commodities, finance and trading.\nFamily Relationships\nThere are no family relationships between any of our directors, executive officers and proposed directors or executive officers.\nInvolvement in Certain Legal Proceedings\nNone of our directors, executive officers, promoters or control persons has been involved in any of the following events during the past ten years:\n1. A petition under the Federal bankruptcy laws or any state insolvency law was filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he was a general partner at or within two years before the time of such filing, or any corporation or business association of which he was an executive officer at or within two years before the time of such filing;\n2. Such person was convicted in a criminal proceeding or is a named subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. Such person was the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from, or otherwise limiting, the following activities:\ni. Acting as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity\nii. Engaging in any type of business practice; or\niii. Engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n4. Such person was the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any activity described in paragraph (f)(3)(i) of this section, or to be associated with persons engaged in any such activity;\n5. Such person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6. Such person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7. Such person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\ni. Any Federal or State securities or commodities law or regulation; or\nii. Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\niii. Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8. Such person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCode of Ethics\nWe have adopted a Code of Business Conduct and Ethics that applies to, among other persons, members of our board of directors, our company's officers including our president, chief executive officer and chief financial officer, employees, consultants and advisors. As adopted, our Code of Business Conduct and Ethics sets forth written standards that are designed to deter wrongdoing and to promote:\n1. honest and ethical conduct, including the ethical handling of actual or apparent conflicts of interest between personal and professional relationships;\n2. full, fair, accurate, timely, and understandable disclosure in reports and documents that we file with, or submit to, the Securities and Exchange Commission and in other public communications made by us;\n3. compliance with applicable governmental laws, rules and regulations;\n4. the prompt internal reporting of violations of the Code of Business Conduct and Ethics to an appropriate person or persons identified in the Code of Business Conduct and Ethics; and\n5. accountability for adherence to the Code of Business Conduct and Ethics.\nOur Code of Business Conduct and Ethics requires, among other things, that all of our company's senior officers commit to timely, accurate and consistent disclosure of information; that they maintain confidential information; and that they act with honesty and integrity.\nIn addition, our Code of Business Conduct and Ethics emphasizes that all employees, and particularly senior officers, have a responsibility for maintaining financial integrity within our company, consistent with generally accepted accounting principles, and federal and state securities laws. Any senior officer, who becomes aware of any incidents involving financial or accounting manipulation or other irregularities, whether by witnessing the incident or being told of it, must report it to our company. Any failure to report such inappropriate or irregular conduct of others is to be treated as a severe disciplinary matter. It is against our company policy to retaliate against any individual who reports in good faith the violation or potential violation of our company's Code of Business Conduct and Ethics by another.\nOur Code of Business Conduct and Ethics was filed as Exhibit 14.1 to our Annual Report on Form 10-K for fiscal year ended July 31, 2013. We will provide a copy of the Code of Business Conduct and Ethics to any person without charge, upon request. Requests can be sent to: Tianci International, Inc., Attn: Secretary, 20 Holbeche Road, Arndell Park, NSW, Australia.\nBoard Meetings\nOur board of directors consists of Zhigang Pei, Shufang Gao, David Wei Fang, Jack Fan Liu, Yee Man Yung and Jimmy Weiyu Zhu. The board held no formal meetings during the year ended July 31, 2022, but took actions once via unanimous written consent. We expect our current board to act by written consent or through board meetings in accordance with the provisions of the Nevada General Corporate Law and our Bylaws.\nNomination Process\nAs of July 31, 2022, we did not effect any material changes to the procedures by which our shareholders may recommend nominees to our board of directors. Our board of directors does not have a policy with regards to the consideration of any director candidates recommended by our shareholders. Our board of directors has determined that it is in the best position to evaluate our companys requirements as well as the qualifications of each candidate when the board considers a nominee for a position on our board of directors. If shareholders wish to recommend candidates directly to our board, they may do so by sending communications to the president of our company at the address on the cover of this annual report.\nCorporate Governance & Board Independence\nOur Board of Directors consists of six directors. We have adopted a standard of director independence that conforms with the published listing requirements of the NASDAQ Stock Market. Jack Fan Liu, Yee Man Yung and Jimmy Weiyu Zhu are independent directors. As of the date hereof, we do not have a policy that a majority of our board be comprised of independent directors.\nPrior to our change of control, we had established an audit committee. We intend to establish a new audit committee in the future. We believe that members of our audit committee will capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. We believe that retaining an independent director who would qualify as an \"audit committee financial expert\" would be overly costly and burdensome and is not warranted in our circumstances given the early stages of our development and the fact that we have not generated any material revenues to date.\nWe have not yet established a Nominating or Governance Committees as standing committees but expect to do so as our business matures. The Board does not have an executive committee or any committees performing a similar function. We are not currently listed on a national securities exchange or in an inter-dealer quotation system that has requirements that a majority of the board of directors be independent. All functions of a nominating/governance committee were performed by our whole board of directors. Our board of directors intends to appoint such persons and form such committees as are required to meet the corporate governance requirements imposed by the national securities exchanges as necessary. Our board of directors does not believe that it is necessary to have such committees at the early stage of the companys development, and our board of directors believes that the functions of such committees can be adequately performed by the members of our board of directors.\nInvolvement in Certain Legal Proceedings\nFrom time to time, we may be involved in various claims, lawsuits, and disputes with third parties, actions involving allegations of discrimination or breach of contract actions incidental to the normal operations of the business. We may be named as a defendant in such lawsuits and thus become subject to the attendant risk of substantial damage awards. We believe that we have adequate liability insurance coverage. There can be no assurance, however, that we will not be sued, that any such lawsuit will not exceed our insurance coverage, or that we will be able to maintain such coverage at acceptable costs and on favorable terms.\nWe are not a party to, nor is any of our property the subject of, any legal proceedings. There are no proceedings pending in which any of our officers, directors or 5% shareholders are adverse to us or any of our subsidiaries or in which they are taking a position or have a material interest that is adverse to us or any of our subsidiaries. Item 11. Executive Compensation\nCompensation Philosophy and Objectives\nCurrently, our executive directors and officers do not receive compensation for services in such capacities. We expect to establish a compensation plan as our company matures. We expect that our executive compensation philosophy will be to create a long-term direct relationship between pay and our performance. Our executive compensation program will be designed to provide a balanced total compensation package over the executives career with us. The compensation program objectives will be to attract, motivate and retain the qualified executives that help ensure our future success, to provide incentives for increasing our profits by awarding executives when corporate goals are achieved and to align the interests of executives and long-term stockholders. We expect the compensation package of our named executive officers to consist of two main elements:\n1. base salary for our executives that is competitive relative to the market, and that reflects individual performance, retention and other relevant considerations; and\n2. discretionary bonus awards payable in cash and tied to the satisfaction of corporate objectives.\nProcess for Setting Executive Compensation\nAs we do not have Compensation Committee, our Board will be responsible for developing and overseeing the implementation of our philosophy with respect to the compensation of executives and for monitoring the implementation and results of the compensation philosophy to ensure compensation remains competitive, creates proper incentives to enhance stockholder value and rewards superior performance. The Board or Compensation Committee will annually review and approve for each named executive officer, and particularly with regard to the Chief Executive Officer, all components of the executives compensation. The Board or Compensation Committee may award discretionary bonuses to each of the named executives, and reviews and approves the process and factors (including individual and corporate performance measures and actual performance versus such measures) used by the Chief Executive Officer to recommend such awards. Additionally, the Board or Compensation Committee will review and approve the base salary, equity-incentive awards (if any) and any other special or supplemental benefits of the named executive officers.\nWe expect out Chief Executive Officer to periodically provide the Board or Compensation Committee with an evaluation of each named executive officers performance, based on the individual performance goals and objectives developed by the Chief Executive Officer at the beginning of the year, as well as other factors. The Board of Compensation Committee will provide an evaluation for the Chief Executive Officer. These evaluations will serve as the bases for bonus recommendations and changes in the compensation arrangements of our named executives.\nOur Compensation Peer Group\nWe expect to engage in informal market analysis in evaluating our executive compensation arrangements. As the Company and its businesses mature, we may retain compensation consultants that will assist us in developing a formal benchmark and selecting a compensation peer group of companies similar to us in size or business for the purpose of comparing executive compensation levels.\nProgram Components\nWe expect our executive compensation program to consist of the following elements:\nBase Salary\nOur base salary structure will be designed to encourage internal growth, attract and retain new talent, and reward strong leadership that will sustain our growth and profitability. The base salary for each named executive officer will reflect our past and current operating profits, the named executive officers individual contribution to our success throughout his career, internal pay equity and informal market data regarding comparable positions within similarly situated companies. In determining and setting base salary, the Board/Compensation Committee will consider all of these factors, though it will not assign specific weights to any factor. The Board/Compensation Committee will generally review the base salary for each named executive officer on an annual basis. For each of our named executive officers, we expect to review base salary data internally obtained by the Company for comparable executive positions in similarly situated companies to ensure that the base salary rate for each executive is competitive relative to the market.\nDiscretionary Bonus\nThe objectives of our bonus awards will be to encourage and reward our employees, including the named executive officers, who contribute to and participate in our success by their ability, industry, leadership, loyalty or exceptional service and to recruit additional executives who will contribute to that success.\nEach of our named executive officers will be eligible for consideration for a discretionary cash bonus. The Chief Executive Officer will make recommendations regarding bonus awards for the named executive officers and the Board/Compensation Committee provides the bonus recommendation for the Chief Executive Officer. However, the Board/Compensation Committee will have sole and final authority and discretion in designating to whom awards are made, the size of the award, if any, and its terms and conditions. The bonus recommendation for each of the named executive officers depends on a number of factors, including (i) the performance of the Company for the year, (ii) the satisfaction of certain individual and corporate performance measures, and (iii) other factors which the Compensation Committee may deem relevant. The Company did not award any cash bonuses during fiscal year 2022.\nStock Holdings\nThe Board/Compensation Committee recognizes the importance of having a portion of the named executive officers compensation be paid in the form of equity, to help align the executives interests with the interests of the Companys stockholders. Initially, we expect the Board/Compensation Committee to emphasize the cash-based portion of our compensation program over a stock program because it believes the discretionary nature of the cash-based compensation gives it the needed flexibility to factor in and reward the attainment of longer-term goals for the Company and the executives, as the Board/Compensation Committee deems appropriate.\nWe have not timed nor do we plan to time our release of material non-public information for the purpose of affecting the value of executive compensation.\nThe following tables set forth, for each of the last two completed fiscal years of the Company, the total compensation awarded to, earned by or paid to any person who was a principal executive officer during the preceding fiscal year and every other highest compensated executive officers earning more than $100,000 during the last fiscal year (together, the Named Executive Officers). The tables set forth below reflect the compensation of the Named Executive Officers.\nSUMMARY COMPENSATION TABLE\nName and Principal\nPosition Year Salary\n($) Bonus\n($) Stock Awards\n($) Option Awards\n($) Non-Equity Incentive Plan Compensation\n($) Change in Pension\nValue and\nNonqualified Deferred Compensation Earnings\n($) All Other Compensation\n($) Total\n($)\nChuah Su Mei - - - - - - - -\n(1) - - - - - - - -\nZhigang Pei 41,800 - - - - - - 41,800\n(2) - - - - - - - -\nShufang Gao 41,800 - - - - - - 41,800\n(3) - - - - - - - -\nDavid Wei Fang 41,800 - - - - - - 41,800\n(3) - - - - - - - -\nJack Fan Liu 14.300 - - - - - - 14,300\n(3) - - - - - - - -\nYee Man Yung 14,300 - - - - - - 14,300\n(3) - - - - - - - -\nJimmy Weiyu Zhu 14,300 - - - - - - 14,300\n(3) - - - - - - - -\n(1) Ms. Chuah was appointed our Chief Executive Officer, President and Director on August 15, 2017. She resigned from all her positions with the Company on August 26, 2021.\n(2) Zhigang Pei was appointed our Chief Executive Officer, Chief Financial Officer, Secretary and Director on August 26, 2021.\n(3) Shufang Gao，David Wei Fang , Jack Fan Liu , Yee Man Yung and Jimmy Weiyu Zhu were appointed our Directors on August 26, 2021.\nNarrative Disclosure to Summary Compensation Table\nOn August 27, 2021, we entered into an Employment Agreement with each of Zhigang Pei, Shufang Gao and Wei Fang (collectively, the Employment Agreements), whereby each individual agreed to serve as an Executive Director for a monthly compensation equal to USD 3,800. Each Employment Agreement expires on August 26, 2024, unless earlier terminated by death, resignation or removal.\nWe are entitled to terminate the each Employment Agreement for cause without notice or remuneration (unless otherwise required by law) if: (i) the executive is convicted or pleads guilty to a felony or to an act of fraud, misappropriation or embezzlement; (ii) the executive has been grossly negligent or acted dishonestly to the detriment of the Company; (iii) the executive has engaged in actions amounting to willful misconduct or failed to perform his duties hereunder and such failure continues after the executive is afforded a reasonable opportunity to cure such failure; or (iv) the executive violates the provisions relating to confidentiality, non-competition and non-solicitation of the Employment Agreement. Upon a termination for cause, the executive shall not be entitled to any severance or other benefits under the Employment Agreement but shall be entitled to receive accrued base salary.\nIf the Employment Agreement is terminated due to the executives death or disability, the executive shall be entitled to receive accrued base salary.\nIf the Employment Agreement is terminated by the Company without cause, the executive will receive a lump sum payment equal to 12 months of base salary, a lump sum cash payment equal to a pro-rated amount of his/her target annual bonus for the year immediately preceding the termination, payment of premiums for continued health benefits under the Companys health plans for 12 months following termination, and immediate vesting of 100% of the then-unvested portion of any outstanding equity awards held by the executive, if any.\nIf the Employment Agreement is terminated due to a change in control, the executive will receive a lump sum payment equal to 12 months of base salary, a lump sum cash payment equal to a pro-rated amount of his/her target annual bonus for the year immediately preceding the termination, and immediate vesting of 100% of the then-unvested portion of any outstanding equity awards held by the executive.\nIf the Employment Agreement is terminated by the executive due to (1) a material reduction in the executives authority, duties and responsibilities, or (2) a material reduction in the executives annual salary, the eermination and xecutive will receive a lump sum payment equal to 12 months of base salary.\nThe foregoing descriptions of the Employment Agreements are qualified in their entirety by reference to the Employment Agreements, which are filed as Exhibits 10.1, 10.2 and 10.3 to this Annual Report and incorporated herein by reference.\nDirector Retainer Agreements with Our Independent Directors\nOn August 27, 2021, each of our three independent directors Jack Fan Liu, Yee ManYung and Jimmy Weiyu Zhu entered into a Director Retainer Agreement agreeing to serve on our Board of Directors for monthly compensation of USD 1300 for each independent director, respectively. The Director Retainer Agreements contain normal and customary terms including provisions relating to indemnification and confidentiality. The foregoing descriptions of the Director Retainer Agreements are qualified in their entirety by reference to the Director Retainer Agreements, which are filed as Exhibit 10.4, 10.5, and 10.6 to this Annual Report and incorporated herein by reference.\nOther than set out above and below, there are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. Our directors and executive officers may receive share options at the discretion of our board of directors in the future. We do not have any material bonus or profit sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that share options may be granted at the discretion of our board of directors.\nStock Option Plan\nCurrently, we do not have a stock option plan in favor of any director, officer, consultant or employee of our company.\nGrants of Plan-Based Awards\nThere were no grants of plan based awards during the year ended July 31, 2022.\nOutstanding Equity Awards at Fiscal Year End\nThere were no outstanding equity awards at the year ended July 31, 2022.\nOption Exercises and Stock Vested\nDuring our fiscal year ended July 31, 2022, there were no options exercised by our named officer.\nCompensation of Directors\nWe currently do not compensate our directors for their services in their capacity as directors.\nPension, Retirement or Similar Benefit Plans\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. We have no material bonus or profit-sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that stock options may be granted at the discretion of the board of directors or a committee thereof.\nCompensation Risk Management\nOur Board of directors conducted an assessment of potential risks that may arise from our compensation programs. Based on this assessment, our Board concluded that our policies and practices do not encourage excessive and unnecessary risk taking that would be reasonably likely to have material adverse effect on the Company.\nCompensation Committee Interlocks and Insider Participation\nWe have not yet established a Compensation Committee. Our Board of Directors performs the functions that would be performed by a compensation committee, including deliberations concerning compensate of our executive officers.\nDuring the fiscal year ended July 31, 2022, none of our executive officers has served: (i) on the compensation committee (or other board committee performing equivalent functions or, in the absence of any such committee, the entire board of directors) of another entity, one of whose executive officers served on our board of directors; or (ii) as a director of another entity, one of whose executive officers served on the compensation committee (or other board committee performing equivalent functions or, in the absence of any such committee, the entire board of directors) of the registrant.\nCompensation Committee Report\nOur Board has reviewed and discussed the Compensation Discussion and Analysis in this report with management. Based on its review and discussion with management, the Board of Directors recommended that the Compensation Discussion and Analysis be included in this Annual Report. The material in this report is not deemed filed with the SEC and is not incorporated by reference in any of our filings under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended, whether made on, before, or after the date of this Annual Report and irrespective of any general incorporation language in such filing.\nSubmitted by members of the Board of Directors:\nZhigang Pei\nShufang Gao\nDavid Wei Fang\nJack Fan Liu\nYee Man Yung\nJimmy Weiyu Zhu Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth certain information regarding beneficial ownership of our common stock as of October 24, 2022, by (i) each person (or group of affiliated persons) who is known by us to own more than five percent (5%) of the outstanding shares of our common stock, (ii) each director, executive officer and director nominee, and (iii) all of our directors, executive officers and director nominees as a group.\nBeneficial ownership is determined in accordance with SEC rules and generally includes voting or investment power with respect to securities. For purposes of this table, a person or group of persons is deemed to have beneficial ownership of any shares of common stock that such person has the right to acquire within 60 days of October 24, 2022. For purposes of computing the percentage of outstanding shares of our common stock held by each person or group of persons named above, any shares that such person or persons has the right to acquire within 60 days of October 24, 2022, is deemed to be outstanding for such person, but is not deemed to be outstanding for the purpose of computing the percentage ownership of any other person. The inclusion herein of any shares listed as beneficially owned does not constitute an admission of beneficial ownership.\nUnless otherwise noted, the business address of each beneficial owner listed is 20 Holbeche Road, Arndell Park, NSW, Australia. Except as otherwise indicated, the persons listed below have sole voting and investment power with respect to all shares of our common stock owned by them, except to the extent that power may be shared with a spouse.\nAs of October 24, 2022, we had 2,450,148 shares of common stock issued and outstanding.\nName of Beneficial Owner Amount and Nature of\nBeneficial Ownership\nPercent\nof Class\nZhigang Pei (1) 1,793,000 73.18%\nAll executive officers and directors as a group (six persons) - -\nGreater Than 5% Shareholder\nSilver Glory Group Limited (1) 1,793,000 73.18%\n(1) Zhigang Pei jointed us on August 26, 2021 as our Chief Executive Officer, Chief Financial Officer, Secretary and Director. Zhigang Pei is the beneficial owner of Silver Glory Group Limited. Item 13. Certain Relationships and Related Transactions, and Director Independence\nDuring the years ended July 31, 2022 and 2021, a shareholder of the Company advanced $212,641 and $74,231 for working capital purpose, respectively.\nDuring the years ended July 31, 2022 and 2021, the Company repaid $1,202 and $0 due to a former shareholder of the Company, respectively.\nOn August 26, 2021 and pursuant to the Stock Purchase Agreement dated on August 6, 2021 (see Note 1 - Change of control), Chuah Su Mei, the Companys former Chief Executive Officer, President and Director and all other former officers forgave all amounts due to them from the Company. In regard to this forgiveness, the Company recognized debt forgiveness by related parties of $349,716 as additional paid-in-capital.\nDuring the year ended July 31, 2022, the Company accrued $168,300 for the compensation of its CEO and five directors. During the year ended July 31, 2022, the Company paid salary of $126,500 to the five directors. As of July 31, 2022, the Company owed $41,800 unpaid compensation to the CEO, which was included in due to related parties, and prepaid the amount of $11,500 for compensation of August 2022 to the five directors.\nAs of July 31, 2022, and July 31, 2021, the Company owed $236,688 and $333,165, respectively, to a shareholder of the Company. This loan is non-interest bearing, unsecured and due on demand. Item 14. Principal Accounting Fees and Services\nThe aggregate fees billed for the most recently completed fiscal years ended July 31, 2022 and July 31, 2021, for professional services rendered by the principal accountant for the audit of our annual financial statements and review of the financial statements included in our quarterly reports on Form 10-Q and services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for these fiscal periods were as follows:\nYear Ended\nJuly 31, 2022\nYear Ended\nJuly 31, 2021\nAudit Fees (1) $ 9,500 $ 10,250\nAudit Related Fees (2) $ - $ -\nTax Fees (3) $ - $ 1,000\nAll Other Fees (4) $ - $ -\nTotal $ 9,500 $ 11,250\n(1) Audit fees consist of fees incurred for professional services rendered for the audit of our financial statements, for reviews of our interim financial statements included in our quarterly reports on Form 10-Q and for services that are normally provided in connection with statutory or regulatory filings or engagements.\n(2) Audit-related fees consist of fees billed for professional services that are reasonably related to the performance of the audit or review of our financial statements, but are not reported under Audit fees.\n(3) Tax fees consist of fees billed for professional services relating to tax compliance, tax planning, and tax advice.\n(4) All other fees consist of fees billed for all other services.\nOn August 30, 2017, we adopted certain pre-approval policies and procedures which are more fully described in Exhibit 99.1.\nPrior to the establishment of our Audit Committee and the adoption of our Pre-Approval Policies, our board of directors pre-approved all services provided by our independent auditors. All of the above services and fees were reviewed and approved by the board of directors either before or after the respective services were rendered.\nPART IV Item 15. Exhibits, Financial Statement Schedules\n(a) Financial Statements\n(1) Financial statements for our company are listed in the index under Item 8 of this document\n(2) All financial statement schedules are omitted because they are not applicable, not material or the required information is shown in the financial statements or notes thereto.\n(b) Exhibits\nExhibit\nNumber\nDescription of Exhibit\n3.1\nArticles of Incorporation (1)\n3.2\nArticles of Amendment (2)\n3.3\nBylaws (1)\n4.1*\nForm of common stock certificate\n4.2\nDescription of Securities (3)\n10.1*\nEmployment Agreement, dated August 27, 2021, by and between Zhigang Pei and Tianci International, Inc.\n10.2*\nEmployment Agreement, dated August 27, 2021, by and between Shufang Gao and Tianci International, Inc.\n10.3*\nEmployment Agreement, dated August 27, 2021, by and between Wei Fang and Tianci International, Inc.\n10.4*\nDirector Retainer Agreement, dated August 27, 2021, by and between Fan Liu and Tianci International, Inc.\n10.5*\nDirector Retainer Agreement, dated August 27, 2021, by and between Yee Man Yung and Tianci International, Inc.\n10.6*\nDirector Retainer Agreement, dated August 27, 2021, by and between Weiyu Zhu and Tianci International, Inc.\n14.1\nCode of Ethics (4)\n14.2\nInsider Trading Policy (5)\n14.3\nDisclosure Policy (5)\n24*\nPower of Attorney\n31.1*\nCertification of Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act\n31.2*\nCertification of Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act\n32.1*\nCertification of Principal Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act\n32.2*\nCertification of Principal Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act\n99.1\nPre-Approval Procedures (6)\n101.*\nInline XBRL Document Set for the financial statements and accompanying notes in Part II, Item 8, Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\n104.*\nInline XBRL for the cover page of this Annual Report on Form 10-K, included in the Exhibit 101 Inline XBRL Document Set.\n______\n* Filed herewith.\n(1) Incorporated by reference to our Registration Statement on Form S-1 filed on September 24, 2012.\n(2) Incorporated by reference to Appendix A to the Definitive Information Statement on Schedule 14C filed on June 11, 2015.\n(3) Incorporated by reference to our Annual Report on Form 10-K filed on October 5, 2020.\n(4) Incorporated by reference to our Annual Report on Form 10-K filed on November 13, 2013.\n(5) Incorporated by reference to our Annual Report on Form 10-K filed on November 13, 2015.\n(6) Incorporated by reference to our Current Report on Form 8-K filed on August 27, 2015\nItem 16. Form 10-K Summary\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereto duly authorized.\nTIANCI INTERNATIONAL, INC.\n(Registrant)\nDated: October 31, 2022 /s/ Zhigang Pei\nZhigang Pei\nChief Executive Officer, Chief Financial Officer, Secretary and Director\n(Principal Executive Officer and Principal Financial Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDated: October 31, 2022 /s/ Zhigang Pei\nZhigang Pei\nChief Executive Officer, Chief Financial Officer, Secretary and Director\n(Principal Executive Officer and Principal Financial Officer)\nDated: October 31, 2022 /s/ Shufang Gao\nShufang Gao\nDirector\nDated: October 31, 2022 /s/ David Wei Fang\nDavid Wei Fang\nDirector\nDated: October 31, 2022 /s/ Jack Fan Liu\nJack Fan Liu\nDirector\nDated: October 31, 2022 /s/ Yee ManYung\nYee ManYung\nDirector\nDated: October 31, 2022 /s/Jimmy Weiyu Zhu\nJimmy Weiyu Zhu\nDirector\nRepresenting all of the members of the Board of Directors.\n* By /s/ Zhigang Pei\nZhigang Pei\nAttorney-in-Fact**\n** By authority of the power of attorney filed herewith"
}