{
    "cik": "1557798",
    "company": "Tianci International, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-10-23",
    "period_of_report": "2023-07-31",
    "sic": "1311",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1557798/0001683168-23-007330-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1557798/000168316823007330/tianci_i10k-073123.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1557798/0001683168-23-007330.txt",
    "filename": "1557798_10K_2023_0001683168-23-007330.htm",
    "content": "Item 1. Business\nThe Share Exchange\nOn March 6, 2023 Tianci International, Inc. (\"Tianci\"), which had previously been a shell corporation with no business operations, completed a share exchange with RQS Capital Limited (RQS Capital), in which RQS Capital transferred all of the issued and outstanding capital stock of RQS United Group Limited (RQS United) to Tianci, and Tianci issued to RQS Capital 1,500,000 shares of its common stock and paid a cash price of $350,000 (the Share Exchange).\nRQS United is a holding company incorporated in the Republic of Seychelles. RQS United has no operations other than holding 90% of the outstanding share capital of its subsidiary, Roshing International Co., Ltd., a company organized under the laws of Hong Kong (Roshing). Shufang Gao and Ying Deng, who are officers and members of Tianci's Board of Directors are also officers and directors of Roshing. Ying Deng owns the 10% of Roshing that is not owned by RQS United.\nThe Share Exchange has been accounted for as a reverse acquisition effected as a recapitalization, wherein RQS United was considered the acquirer for accounting and financial reporting purposes. The assets and liabilities of the acquired entity have been brought forward at their book value and no goodwill has been recognized on Tiancis financial statements.\nThe Business of Roshing\nRoshing was incorporated on June 22, 2011 and is engaged in the sale of components of electronic devices, development of software and websites, technical consulting, and providing maintenance support on customized software. Roshings business is primarily carried out in Hong Kong, although we realize a substantial portion of our software development and related services revenue in Singapore.\nTo date, Roshing has carried on operations in five categories:\na. Electronic Device Hardware Components Product Sales\nRoshing distributes hardware components to manufacturers of electronic devices. Roshings product line includes high performance computer chips, Wi-Fi modules, Bluetooth modules, 4G network modules, LED screens, and touch screens. Roshing markets off-the-shelf products, which it ships directly from the manufacturer to Roshings customer.\nb. Software and Website Development Services\nRoshing develops customized freight shipping and related logistic software and websites. The software helps wholesalers, ecommerce retailers, and freight forwarders to manage complex workflows and improve work efficiency by enabling shipping workflow management, sea shipping container management, ecommerce inventory and shipping management, and logistics data analysis.\nc. Technical Consulting and Training Services\nRoshing provides technical consulting and training services to help customers, generally its existing customers, to better understand and properly use its customized software and related hardware. Services are generally carried out on a per-time fixed rate basis.\nd. Software Maintenance and Business Promotion Services\nRoshing provides software maintenance service to keep customers software up to date. Roshing also assists customers in promoting business with ongoing marketing support. The Company charges a flat rate for a fixed duration on a subscription basis, generally 12 months.\ne. Business Consulting Services\nRoshing assists business enterprises in preparing applications for immigration and non-immigration visas. Roshing performs background checks and cash analysis, then assists the client in preparing the visa application(s). The Company charges a flat fee for these services.\nMoving forward, by leveraging the professional experience and market resources of the senior management team, Roshing is expected to provide a wide variety of shipping & freight forward services, including sea freight forwarding, air freight forwarding, trucking, and warehousing.\nMarketing\nRoshing markets its hardware products directly to the electronic device industry and markets its software directly to wholesalers. In each case, the primary method of marketing is participation by our engineering staff in events such as expos, seminars and industry association meetings that are focused on our target markets. We present Roshing as a valuable assistant to the customer, with the goal of developing a long-term relationship with repeat orders. As a result of this strategic focus, almost 96% of our sales during fiscal year 2022 were made to just five customers, and 52% of our sales during fiscal year 2023 were made to two customers.\nVendors\nRoshing distributes electronic components manufactured by a variety of vendors. There is no vendor that, were our relationship to terminate, we could not adequately replace promptly.\nRoshing employs two software engineers and a logistics project manager, who are together dedicated to fulfillment of the software development contracts entered by Roshing. When the flow of software development contracts exceeds the production capacities of those three employees, Roshing subcontracts to third party developers that it has tested for competence.\nThe core software package that Roshing markets to wholesalers was designed under an Entrusted Custom Development Protocol signed by Roshing and Vendor A. The Protocol provides for Vendor As continued involvement in Roshings marketing of software, detailing the terms under which Roshing may engage Vendor A to develop specific applications of the software package for customers of Roshing.\nCompetition\nRoshing competes in all of its market operations with a large number of competitors, big and small. Roshing competes based on the quality of its services and attention to the needs of its customers. Specifically, we focus on the following factors to capture customer preference:\n· Commitment to product and service quality, development, and innovation.\nOur emphasis on highly customized software solutions and high-quality hardware products attaches an aura of quality to our market presence.\n· Comprehensive and high standard product range.\nWe offer a wide range of high quality and sophisticated hardware component products.\n· Special focus on logistic industry\nOur software-related services provide a comprehensive solution for customers in the logistic industry.\nEmployees\nRoshing has eight employees in addition to its directors: Shufang Gao and Ying Deng. Two employees are focused on marketing and administration; the remaining six are engineers or project managers. Roshing believes its relations with its employees are good.\nOur Plan for the Future\nOur plan is to rely on the following key factors to enable the growth of our business.\n· Our ability to retain and increase customers\nOur ability to increase our revenues and our profitability will depend on our ability to retain our existing customers as well as to continue to increase our customer base and revenue per customer. To achieve this, we strive to increase our marketing efforts and to enhance the quality and capabilities of our software solutions. Currently we have customers in Hong Kong and Singapore, and we expect to continue expanding our business to other countries of the Asia-Pacific region.\n· Investment in talent\nWe believe that a core element of the competitiveness of our business is talent. To retain existing and attract potential customers, we will continue to rely on our people and their knowledge and experience in the industry. We intend to acquire top talent to keep pace with the growth of our target industries and continue to offer cutting-edge hardware and software solutions.\n· Our ability to pursue strategic opportunities for growth\nTo enhance Roshings capabilities, we intend to pursue strategic acquisitions and make investments in select technologies and businesses, particularly in industries with which our senior management has experience. We believe that a solid acquisition and investment strategy will be critical for us to accelerate our growth and strengthen our competitive position in the future. Item 1A. Risk Factors\nInvesting in our common stock involves risk. You should carefully consider the risks described below together with all of the other information contained in this Report, including the financial statements and the related notes, before deciding whether to purchase any shares of our common stock. If any of the following risks is realized, our business, financial condition or operating results could materially suffer. In that event, the trading price of our common stock could decline and you may lose all or part of your investment.\nI. RISKS RELATED TO OUR BUSINESS\nWe have a limited operating history and face significant challenges and will incur substantial expenses as we build our capabilities.\nWe have a limited operating history and are subject to the risks inherent in a growing company, including, among other things, risks that we may not be able to hire sufficient qualified personnel and establish operating controls and procedures. As we build our own capabilities, we expect to encounter risks and uncertainties frequently experienced by growing companies in new and rapidly evolving fields, including the risks and uncertainties related to the evolving effects of the COVID-19 pandemic and those described herein. If we are unable to build our own capabilities, our operating and financial results could differ materially from our expectations, and our business could suffer.\nWe are currently dependent on a small group of customers for most of our revenue. If we cannot expand our customer base many-fold, our business will not be successful.\nThe revenue generated to date by our business has come from a small number of customers. During the year ended July 31, 2022, five customers were responsible for over 95% of our revenue. During the year ended July 31, 2023, two customers were responsible for over 52% of our revenue. In order for Tianci to be viable as a public company, we must multiply our revenue many-fold. To accomplish that, we must dramatically expand our customer base. If we fail to multiply our customers, Tiancis stock will have no significant value.\nIf we are unable to hire, retain or motivate qualified personnel, consultants, independent contractors, and advisors, we may not be able to grow effectively.\nOur performance will be largely dependent on the talents and efforts of highly skilled individuals that we attract to our company. Our future success depends on our continuing ability to identify, hire, develop, motivate and retain highly qualified personnel for all areas of our organization: technological as well as entrepreneurial. Competition for such qualified employees is intense. If we do not succeed in attracting competent personnel or in retaining or motivating them, we may be unable to grow effectively. In addition, our future success depends largely on our ability to retain key consultants and advisors. Our inability to retain their services could negatively impact our business and our ability to execute our business strategy.\nWe do not presently maintain fire, theft, product liability or any other property insurance, which leaves us with exposure in the event of loss or damage to our properties or claims filed against us.\nWe do not maintain fire, theft, product liability or other insurance of any kind. We bear the economic risk with respect to loss of or damage or destruction to our property and to the interruption of our business, as well as liability to third parties for damage or destruction to them or their property that may be caused by our personnel or products. Such liability could be substantial and the occurrence of such loss or liability may have a material adverse effect on our business, financial condition and prospects.\nII. RISKS RELATED TO DOING BUSINESS IN HONG KONG\nAll our operations are in Hong Kong. However, due to the long arm provisions under the current PRC laws and regulations, the Chinese government may exercise significant oversight and discretion over the conduct of our business and may intervene in or influence our operations at any time, which could result in a material change in our operations and/or the value of our common stock.\nTianci is a holding company and we conduct our operation through our operating subsidiary Roshing in Hong Kong. Our operations are primarily located in Hong Kong and a few of our clients are PRC corporations. At the present time, we are not materially affected by recent statements by the Chinese Government indicating an intent to exert more oversight and control over offerings that are conducted overseas and/or foreign investment in China-based issuers. However, due to long arm provisions under the current PRC laws and regulations, there remains regulatory uncertainty with respect to the implementation of Chinese law in Hong Kong. The PRC government may choose to exercise significant oversight and discretion, and the policies, regulations, rules, and the enforcement of laws of the Chinese government to which we are subject may change rapidly and with little advance notice to us or our shareholders. These laws and regulations may be interpreted and applied inconsistently by different agencies or authorities, and inconsistently with our current policies and practices. New laws, regulations, and other government directives in the PRC may also be costly to comply with.\nWe are aware that recently the PRC government initiated a series of regulatory actions and statements to regulate business operations in certain areas in China with little advance notice, including cracking down on illegal activities in the securities market, enhancing supervision over China-based companies listed overseas using variable interest entity structure, adopting new measures to extend the scope of cybersecurity reviews, and expanding the efforts in anti-monopoly enforcement. Since these statements and regulatory actions are new, it is highly uncertain how soon legislative or administrative regulation making bodies will respond and what existing or new laws or regulations or detailed implementations and interpretations will be modified or promulgated, if any, and the potential impact such modified or new laws and regulations will have on our daily business operation, the ability to accept foreign investments and list on an U.S. or other foreign exchange.\nChinas government may intervene or influence our operations at any time or may exert more control over offerings conducted overseas and foreign investment in China-based issuers, which may result in a material change in our operations and/or the value of our common stock. The promulgation of new laws or regulations, or the new interpretation of existing laws and regulations, in each case that restrict or otherwise unfavorably impact the ability or way we conduct our business and could require us to change certain aspects of our business to ensure compliance, which could decrease demand for our services, reduce revenues, increase costs, require us to obtain more licenses, permits, approvals or certificates, or subject us to additional liabilities. To the extent any new or more stringent measures are required to be implemented, our business, financial condition and results of operations could be adversely affected as well as materially decrease the value of our common stock.\nWe will rely on dividends and other distributions on equity paid by our Hong Kong subsidiary to fund any cash and financing requirements we may have. In the future, the PRC government may impose restrictions on our ability to transfer funds out of Hong Kong to fund operations or for other use outside of Hong Kong. Any limitation on the ability of our subsidiary to make payments to us could have a material adverse effect on our ability to conduct our business and might materially decrease the value of our common stock.\nWe are a holding company incorporated in the United States, and we rely on dividends and other distributions on equity paid by our subsidiary in Hong Kong for our cash and financing requirements, including the funds necessary to pay dividends and other cash distributions to our shareholders and service any debt we may incur. If our subsidiary incurs debt on its own behalf in the future, the instruments governing the debt may restrict its ability to pay dividends or make other distributions to us.\nUnder the current practice of the Inland Revenue Department of Hong Kong, no tax is payable in Hong Kong in respect of dividends paid by Roshing. The PRC laws and regulations do not currently have any material impact on transfers of cash from Roshing to Tianci or from Tianci to Roshing. However, the Chinese government may, in the future, impose restrictions or limitations on our ability to transfer money out of Hong Kong, to distribute earnings and pay dividends to and from the other entities within our organization, or to reinvest in our business outside of Hong Kong. Such restrictions and limitations, if imposed in the future, may delay or hinder the expansion of our business to outside of Hong Kong and may affect our ability to receive funds from our operating subsidiary in Hong Kong. The promulgation of new laws or regulations, or the new interpretation of existing laws and regulations, in each case, that restrict or otherwise unfavorably impact the ability or way we conduct our business, could require us to change certain aspects of our business to ensure compliance, which could decrease demand for our services, reduce revenues, increase costs, require us to obtain more licenses, permits, approvals or certificates, or subject us to additional liabilities. To the extent any new or more stringent measures are implemented, our business, financial condition and results of operations could be adversely affected and such measured could materially decrease the value of our common stock.\nChanges in international trade policies, trade disputes, barriers to trade, or the emergence of a trade war may dampen growth in Hong Kong, China and other markets where the majority of our clients reside.\nPolitical events, international trade disputes, and other business interruptions could harm or disrupt international commerce and the global economy, and could have a material adverse effect on us and our customers, service providers, and other partners. International trade disputes could result in tariffs and other protectionist measures which may materially and adversely affect our business.\nTariffs could increase the cost of the goods and products which could affect customers investment decisions. In addition, political uncertainty surrounding international trade disputes and the potential of the escalation to a trade war could have a negative effect on customer confidence, which could materially and adversely affect our business. We may also have access to fewer business opportunities, and our operations may be negatively impacted as a result. In addition, the current and future actions or escalations by either the United States or China that affect trade relations may cause global economic turmoil and potentially have a negative impact on our markets, our business, or our results of operations, as well as the financial condition of our customers. and we cannot provide any assurances as to whether such actions will occur or the form that they may take.\nUnder the Basic Law of the Hong Kong Special Administrative Region of the Peoples Republic of China, Hong Kong is exclusively in charge of its internal affairs and external relations, while the government of the PRC is responsible for its foreign affairs and defense. As a separate customs territory, Hong Kong maintains and develops relations with foreign states and regions. However, based on recent political development, the U.S. State Department has indicated that the United States no longer considers Hong Kong to have significant autonomy from China. Hong Kongs preferential trade status was removed by the United States government and the United States may impose the same tariffs and other trade restrictions on exports from Hong Kong that it places on goods from mainland China. These and other recent actions may represent an escalation in political and trade tensions involving the U.S, China and Hong Kong, which could potentially harm our business.\nIII. RISKS RELATED TO AN INVESTMENT IN OUR COMMON STOCK\nEven if a market for our common stock develops, the stock price is nevertheless likely to be volatile. You may have difficulty obtaining a price for your shares that you consider reasonable.\nAlthough Tiancis common stock is listed for trading on the OTC Pink Market maintained by OTC Markets, the market for the common stock is very thin, with only occasional trades at prices that increase or decrease significantly and suddenly. Therefore, if an investor wants to sell shares, there may be no buyer available, or the price offered may be less than the actual value of the shares. Unless and until significant daily volume occurs in the trading market for our shares, the price of the common stock will be affected by many factors that are beyond our control and may not be directly related to our operating performance. As a result of these factors, you cannot be assured that when you are ready to sell your shares, the market price will accurately reflect the value of your shares or that you will be able to obtain a reasonable price for your shares.\nOur CEO beneficially owns the majority of our outstanding stock and, accordingly, will have control over stockholder matters, the Companys business and management.\nShufang Gao, the Chief Executive Officer of Tianci, through his holding company owns securities with 68% of the voting power in Tianci. As a result, Mr. Gao will have the ability to:\n· Elect or defeat the election of our directors;\n· Amend or prevent amendment of our articles of incorporation or bylaws;\n· Effect or prevent a merger, sale of assets or other corporate transaction; and\n· Affect the outcome of any other matter submitted to the stockholders for vote.\nMoreover, because of the significant ownership position held by Mr. Gao, new investors will not be able to effect a change in the Companys business or management, and therefore, shareholders would be subject to decisions made by management and the majority shareholder.\nIn addition, Managements stock ownership may discourage a potential acquirer from making a tender offer or otherwise attempting to obtain control of us, which in turn could reduce our stock price or prevent our stockholders from realizing a premium over our stock price.\nThe sale of securities by us in any equity or debt financing could result in dilution to our existing stockholders and have a material adverse effect on our earnings.\nOur Board of Directors is authorized to issue up to 100,000,000 shares of common stock and up to 20,000,000 shares of undesignated preferred stock. Our Board of Directors has the authority to issue additional shares of common stock without consent of any of our stockholders. In addition, our Articles of Incorporation provide that the Board can designate the voting rights, liquidation rights, dividend rights and other rights of holders of the preferred stock. The Board, therefore, could use the Preferred Stock to give an investor group disproportionate voting rights or priority over the common stock in the allocation of benefits from the operations of Roshing, including preferential dividends. The Board could also use the Preferred Stock to create a poison pill to prevent a takeover of Tianci that might be considered beneficial by the common shareholders.\nAny sale of common stock by us in a future private placement offering could result in dilution to the existing stockholders as a direct result of our issuance of additional shares of our capital stock. In addition, our business strategy may include expansion through internal growth by acquiring complementary businesses, acquiring, or licensing additional brands, or establishing strategic relationships with targeted customers and suppliers. In order to do so, or to finance the cost of our other activities, we may issue additional equity securities that could dilute our stockholders stock ownership. We may also assume additional debt and incur impairment losses related to goodwill and other tangible assets, and this could negatively impact our earnings and results of operations.\nBecause we will be subject to penny stock rules, the level of trading activity in our stock may be reduced.\nUntil we are able to secure a listing for our common stock on a national securities exchange, it is likely that our common stock will be classified as a penny stock. Penny stocks generally are equity securities with a price of less than $5.00 (other than securities registered on some national securities exchanges). Broker-dealer practices in connection with transactions in penny stocks are regulated by penny stock rules adopted by the Securities and Exchange Commission. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document that provides information about penny stocks and the nature and level of risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction, and, if the broker-dealer is the sole market maker, the broker-dealer must disclose this fact and the broker-dealers presumed control over the market, and monthly account statements showing the market value of each penny stock held in the customers account. In addition, broker-dealers who sell these securities to persons other than established customers and accredited investors must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written agreement to the transaction. Consequently, these requirements may have the effect of reducing the level of trading activity, if any, in the secondary market for a security subject to the penny stock rules. If a trading market does develop for our common stock, these regulations will likely be applicable, and investors in our common stock may find it difficult to sell their shares.\nFINRA sales practice requirements may limit a stockholders ability to buy and sell our stock.\nFINRA has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may have the effect of reducing the level of trading activity in our common stock. As a result, fewer broker-dealers may be willing to make a market in our common stock, reducing a stockholders ability to resell shares of our common stock. Item 1B. Unresolved Staff Comments\nNot applicable.\nItem 1B. Cybersecurity\nNot applicable. Item 2. Properties\nThe executive offices of Roshing are located in Hong Kong at 2/F No. 18, Area 2, So Kuwn Wat Village, Tuen Mun Hong Kong. Roshing leases the offices for a monthly rent of HKD 3,000 (@ U.S.$386). The lease terminates on January 12, 2025.\nRoshing also utilized office space in Shenzhen, China located at Building 8, 26/F, Suite 2605A, Qianhai Zhuoyue Jinrong Center (Phase 1) Unit 2, Guiwan Area, Nanshan District, Shenzhen. Roshing used the space under a sublease that will terminate on August 31, 2024. The monthly rental (from $1,827 to $2,014) is paid by Shufang Gao and Ying Deng, members of Tiancis Board of Directors and directors of Roshing, as a contribution to the capital of RQS Limited. The sublease was terminated on May 31, 2023.\nManagement believes the real property leased by Roshing will be adequate for its operations for the foreseeable future. Item 3. Legal Proceedings\nNeither Tianci International nor any of its subsidiaries is party to material pending legal proceedings, other than ordinary routine litigation incidental to the product distribution business. Item 4. Mine Safety Disclosures.\nNot Applicable.\nPART II Item 5. Market For Registrants Common Equity, Related Stockholder Matters And Issuer Purchases Of Equity Securities.\n(a) Market Information\nThe Companys common stock is quoted on the OTC Pink Market under the symbol \"CIIT\". The quotations reported on the OTC Pink Market reflect inter-dealer prices without retail markup, markdown or commissions, and may not necessarily represent actual transactions.\nThe Company's common stock is thinly traded. The quoted bid and asked prices for the Common Stock vary significantly from week to week. An investor holding shares of the Company's Common Stock may find it difficult to sell the shares and may find it impossible to sell more than a small number of shares at the quoted bid price.\n(b) Shareholders\nOur shareholders list contains the names of 111 stockholders of record of the Companys Common Stock.\n(c) Dividends\nAny future decisions regarding dividends will be made by our board of directors. We currently intend to retain and use any future earnings for the development and expansion of our business and do not anticipate paying any cash dividends in the foreseeable future. Our board of directors has complete discretion on whether to pay dividends, subject to the approval of our stockholders. Even if our board of directors decides to pay dividends, the form, frequency and amount will depend upon our future operations and earnings, capital requirements and surplus, general financial condition, contractual restrictions and other factors that the board of directors may deem relevant.\n(d) Securities Authorized for Issuance Under Equity Compensation Plans\nThe Company had no securities authorized for issuance under equity compensation plans as of July 31, 2023.\n(e) Sale of Unregistered Securities\nThe Company did not make any sale of unregistered securities during the 4th quarter of fiscal year 2023.\n(f) Repurchase of Equity Securities\nThe Company did not repurchase any shares of its common stock during the 4th quarter of fiscal year 2023.  Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nOn March 3, 2023, Tianci acquired ownership of RQS United Group Limited, a company organized under the laws of the Republic of Seychelles (RQS United), pursuant to the Share Exchange Agreement dated March 3, 2023 among the Company, RQS United and RQS Capital Limited, the prior owner of RQS Limited.\nRQS United is a holding company incorporated in the Republic of Seychelles. RQS United has no operations other than holding 90% of the outstanding share capital of its subsidiary, Roshing International Co., Ltd., a company organized under the laws of Hong Kong (Roshing). Roshing was incorporated on June 22, 2011 and is engaged in the sale of components of electronic devices, development of software and websites, technical consulting, and providing maintenance support on customized software. Roshing started also providing immigration-related consulting services in the most recent quarter. Moving forward, by leveraging the professional experience and market resources of the senior management team, Roshing is expected to provide a wide variety of freight forward services, including sea freight forwarding, air freight forwarding, trucking, warehousing, and custom clearance services. Roshings business is primarily carried out in Hong Kong, although we realize a substantial portion of our software development revenue in Singapore.\nResults of Operations\nComparison of the year ended July 31, 2023 and 2022\nFor the year ended\nJuly 31,\nChange Change\nPercentage\nRevenues 452,409 752,839 (300,430 ) -40%\nCost of Revenues 456,494 478,521 (22,027 ) -5%\nGross (loss) income (4,085 ) 274,318 (278,403 ) -101%\nSelling and marketing 54,169 4,912 49,257 1003%\nGeneral and administrative 285,740 77,590 208,150 268%\n(Loss) income from operations (343,994 ) 191,816 (535,810 ) -279%\nProvision for income taxes 12,095 31,650 (19,555 ) -62%\nNet (loss) income (356,089 ) 160,166 (516,255 ) -322%\nLess: net (loss) income attributable to non-controlling interest (14,879 ) 16,017 (30,896 ) -193%\nNet (loss) income attributable to Tianci (341,210 ) 144,149 (485,359 ) -337%\nRevenues\nDuring the year ended July 31, 2023, our revenue decreased by $300,430, or approximately 40%, to $452,409 for the year ended July 31, 2023 from $752,839 for the year ended July 31, 2022. We experienced decline in both product and service revenues in 2023 due to diminishing market demand and our reduction in marketing expenses. We expect our revenue to grow after we add freight forward services to our lines of business.\nOur revenues from our revenue categories are summarized as follows:\nFor the Year Ended July 31,\nProduct Revenues $ 294,880 $ 500,500\nService Revenues $ 157,529 $ 252,339\n$ 452,409 $ 752,839\nCost of Revenues\nTotal cost of revenues decreased by $22,027, or approximately 5%, to $456,494 for the year ended July 31, 2023 as compared to $478,521 for the year ended July 31, 2022. Our cost of revenues from our revenue categories are summarized as follows:\nFor the Year Ended July 31,\nCost of Product $ 227,660 $ 336,644\nCost of Service $ 228,834 $ 141,877\n$ 456,494 $ 478,521\nThe year-to-year decrease in our cost of revenues is primarily attributable to the decrease in our revenue. Thus, our cost of revenues from hardware product sales decreased to $227,660 for the year ended July 31, 2023, from $336,644 for the year ended July 31, 2022, as we experienced a 41% decrease in hardware product sales.\nNevertheless, overall cost of revenue fell only 5%, while overall revenue fell by 40%. The disparity occurred because our cost of revenues from software related services increased by $86,957 to $228,834 for the year ended July 31, 2023, from $141,877 for the year ended July 31, 2022. The increase in cost of revenues from software related services resulted from our grant of common stock as an incentive to our internal software developers. We recorded the $144,000 fair value of the shares as a cost of services.\nGross Profit\nWe had a gross loss of $4,085 for the year ended July 31, 2023 compared to a gross profit of $274,318 for the year July 31, 2022, which was primarily due to the reduction in revenue without a corresponding reduction in our overall cost of revenues, as discussed above.\nThe gross profit margin of hardware products decrease by 9.9% to 22.8% for the year ended July 31, 2023, from 32.7% for the year ended July 31, 2022, which was primarily due to rising raw material cost and increasing market competition, which put downward pressure on our pricing. Our software related services resulted in a 45.3 % gross loss for the year ended July 31, 2023, again primarily due to the stock-based compensation issued to our developers.\nOperating Expenses\nThere was significant change in our total operating expenses, which were $339,909 and $82,502 for the year ended July 31, 2023, and 2022, respectively. Our operating expenses primarily include payroll expenses, advertising and rent. The increase was partially due to the stock compensation valued at $66,000 that we issued to the selling and general administrative personnel for their continued service after the reverse merger. The professional fees and other costs incurred in connection with the Share Exchange in March 2023 also increased our operating expenses for fiscal year 2023.\nIncome tax expense\nOur income tax expense amounted to $ 12,095 and $ 31,650 for the year ended July 31, 2023, and 2022, respectively. The change was mainly due to the decrease in profits subject to taxation in Hong Kong.\nLiquidity and Capital Resources\nIn assessing our liquidity, we monitor and analyze our cash on-hand and our operating expenditure commitments. Our liquidity needs are to meet our working capital requirements and operating expenses obligations. As of July 31, 2023, our working capital deficit was $(284,543), our cash amounted to $256,342, our current assets were $312,226 and our current liabilities were $596,768. To date, we have financed our operations primarily through capital contributions and advances from shareholders. At July 31, 2023 we owed $276,077 to related parties (See Note 3 of the interim financial statement) and $240,800 to officers for compensation under their employment agreements.\nWe believe our liquidity and working capital will be sufficient to sustain our business operation for the next twelve months. We may, however, need additional cash resources in the future if there are changes in business conditions or other developments or if the company finds and wishes to pursue opportunities for investment, acquisition, capital expenditure, or similar actions.\nWe are planning to enter the shipping & freight forwarding services in 2023, which may require significant capital expenditure for developing the business. If we determined that our cash requirements exceed the amount of cash and cash equivalents we have on hand at the time, we may seek to issue equity or debt securities or obtain credit facilities. The issuance and sale of additional equity may result in dilution to our shareholders. The incurrence of indebtedness would result in increased fixed obligations and could result in operating covenants that would restrict our operations. Our obligation to bear credit risk for certain financing transactions we facilitate may also strain our operating cash flow. We cannot assure you that financing will be available in amounts or on terms acceptable to us, if at all.\nThe following summarizes the key components of our cash flows for the year ended July 31, 2023 and 2022.\nFor the year ended\nJuly 31,\nNet cash provided by (used in) operating activities $ 324,581 $ (84,161 )\nNet cash used in investing activities - -\nNet cash provided by (used in) financing activities (89,476 ) 85,148\nNet change in cash and restricted cash $ 235,105 $ 987\nOperating activities\nDespite our net loss of $356,089, net cash was provided by operating activities for the year ended July 31, 2023 primarily because our accounts receivable decreased by $737,663 during the period, as we made efforts on the collection process. The decrease was offset by a decrease of $447,292 in our accounts payable balance attributable to payment to our vendors. In addition, our operating loss of $356,089 included $210,000 in various noncash items.\nNet cash was used in operating activities for the year ended July 31, 2022 primarily because our accounts receivable increased by $737,620 during the year, as we offer long payment terms to our customers, typically 6 months after delivery of service or products. Nevertheless, cash used in operations during the fiscal year was only $84,161, as we increased our accounts payable balance by $444,944 attributable to long payment terms from our vendors, recorded net income of $160,166, and increased deferred income tax expense, inventory, and income taxes payable for a total amount of $ 48,349.\nInvesting activities\nThe company has no investing activities for the years ended July 31, 2023 and 2022.\nFinancing activities\nNet cash used in financing activities for the year ended July 31, 2023 was $89,476, which was primarily attributable to our repayment of a working capital advance by a related party in the amount of $341,885. Cash outflow was offset by the $31,490 in working capital advance from related parties, $84,503 in operating expenses that were paid directly by shareholders, the payments of Shenzhen China rent by related parties amounting to $16,580, the receipt of a subscription receivable of $50,000, and a capital contribution of $65,650.\nNet cash provided by financing activities for the year ended July 31, 2022, was primarily attributable to a working capital advance from a related party amounting to $2,007, the operating expenses that are paid directly by shareholders amounting to $77,375, and the payments of Shenzhen China rent by related parities amounting to $20,046. Cash inflow was offset by repayment of a working capital advance to related party in the amount of $14,280.\nImpact of the COVID-19 Pandemic\nThe global outbreak of COVID-19 and resulting health crisis has caused, and continues to cause, significant and widespread disruptions to the Hong Kong and global economies, financial and consumer markets. We believe, however, that the COVID-19 outbreak has had very limited impact on our business.\nDuring the course of the COVID-19 pandemic, public health officials and other governmental authorities have imposed and may impose new mitigation measures, regulations and requirements to address the spread of COVID-19. Public health officials and other governmental authorities also have imposed directives and may impose additional directives that could require changes in our business practices. The scope and duration of these mitigation measures and directives continue to evolve throughout the course of the COVID-19 pandemic. Depending on the future course of COVID-19 and further outbreaks, we may experience restrictions and temporary closures of our offices.\nAlthough we have continued to serve our clients and operate our business throughout the COVID-19 pandemic, there can be no assurance that future events will not have an effect on our business, results of operations or financial condition because the extent and duration of the health crisis remains uncertain. Future adverse developments in connection with the COVID-19 crisis, including further outbreaks and new strains or variants of COVID-19, evolving international, federal, state and local restrictions and safety regulations in response to COVID-19, changes in consumer behavior and health concerns, the pace of economic activity in the wake of COVID-19, or other similar issues could adversely affect our business, results of operations or financial condition in the future, or our financial results and business performance in future periods.\nWe continue to actively manage the impact of the COVID-19 crisis as we face continued uncertainty regarding the impact COVID-19 will have on our financial operations in the near and long term. The need for, or timing of, any future actions in response to COVID-19 is largely dependent on the mitigation of the spread of the virus along with the adoption and continued effectiveness of vaccines, status of government orders, directives and guidelines, recovery of the business environment, global supply chain conditions, economic conditions, and consumer demand for our products and services, all of which are highly uncertain.\nCritical Accounting Estimates\nOur financial statements and accompanying notes have been prepared in accordance with U.S. GAAP. The preparation of these financial statements and accompanying notes requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis of making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources.\nIn connection with the preparation of our financial statements for the year ended July 31, 2023, there was no accounting estimate we made that was subject to a high degree of uncertainty and was critical to our results.\nRecently Issued Accounting Pronouncements\nThe Company considers the applicability and impact of all accounting standards updates (ASUs). Management periodically reviews new accounting standards that are issued. The Company does not believe that any recently issued but not yet effective accounting standards, if currently adopted, would have a material effect on the Companys consolidated balance sheets, statements of operations and comprehensive income and statements of cash flows. Item 7a Quantitative And Qualitative Disclosures About Market Risk.\nNot Applicable. Item 8. Financial Statements\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of July 31, 2023 and 2022.\nConsolidated Statements of Operations for the Years Ended July 31, 2023 and 2022.\nConsolidated Statements of Changes in Stockholders (Deficiency) Equity for the Years Ended July 31, 2023 and 2022.\nConsolidated Statements of Cash Flows for the Years Ended July 31, 2023 and 2022.\nto Notes to Consolidated Financial Statements.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Tianci International, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Tianci International, Inc. (the Company) as of July 31, 2023 and July 31, 2022 and the related consolidated statements of operations, changes in stockholders equity, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of Tianci International, Inc. as of July 31, 2023 and July 31, 2022, and the results of its operations and cash flows for the years then ended in conformity with accounting principles generally accepted in the United States.\nExplanatory Paragraph Regarding Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the consolidated financial statements, the Companys present financial situation raises substantial doubt about its ability to continue as a going concern. Managements plans in regard do this matter are also described in 1. These financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there were no critical audit matters.\n/s/ Michael T. Studer CPA P.C.\nMichael T. Studer CPA P.C.\nFreeport, New York\nOctober 20, 2023\nPCAOB ID #822\nWe have served as the Companys auditor since 2023.\nTIANCI INTERNATIONAL, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(EXPRESSED IN UNITED STATES DOLLARS)\nJuly 31, July 31,\nASSETS\nCurrent assets:\nCash $ 256,342 $ 21,237\nAccounts receivable - 737,663\nPrepaid expense 1,750 -\nDue from related party 54,134 -\nTotal current assets 312,226 758,900\nOther assets:\nLease security deposit 1,542 1,439\nRight-of-use asset 6,436 -\nTotal non-current assets 7,978 1,439\nTOTAL ASSETS $ 320,204 $ 760,339\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable $ 779 $ 444,944\nIncome taxes payable 26,298 14,202\nDue to related parties 276,077 194,794\nLease liability - current 4,368 -\nAdvances from customers 29,070 -\nAccrued liabilities and other payables 260,176 1,640\nTotal current liabilities 596,768 655,580\nLease liability - noncurrent 2,068 -\nTotal liabilities 598,836 655,580\nCommitments and contingencies - -\nStockholders equity (deficit):\nSeries A Preferred stock, $0.0001 par value; 80,000 shares authorized; 80,000 and 0 shares issued and outstanding as of July 31, 2023 and 2022, respectively -\nUndesignated preferred stock, $0.0001 par value; 20,000,000 shares authorized; no shares issued and outstanding - -\nCommon stock, $0.0001 par value, 100,000,000 shares authorized; 5,903,481 and 1,500,000 shares issued and outstanding as of July 31, 2023 and 2022, respectively*\nSubscription receivable - (50,000 )\nAdditional paid-in capital 4,982 82,732\nRetained earnings (accumulated deficit) (276,521 ) 64,689\nTotal stockholders' equity (deficit) attributable to TIANCI INTERNATIONAL, INC. (270,941 ) 97,571\nNon-controlling interest (7,691 ) 7,188\nTotal stockholders equity (deficit) (278,632 ) 104,759\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY $ 320,204 $ 760,339\n* Shares are presented on a retroactive basis to reflect the reorganization on March 3, 2023\nThe accompanying notes are an integral part of these consolidated financial statements.\nTIANCI INTERNATIONAL, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(EXPRESSED IN UNITED STATES DOLLARS)\nFor the year ended July 31,\nOPERATING REVENUES\nProducts $ 294,880 $ 500,500\nServices 157,529 252,339\nTotal Operating Revenues 452,409 752,839\nCOST OF REVENUES\nProducts 227,660 336,644\nServices (including stock-based compensation of $144,000, $0, $144,000 and $0) 228,834 141,877\nTotal Cost of Revenues 456,494 478,521\nGross profit (loss) (4,085 ) 274,318\nOperating expenses:\nSelling and marketing (including stock-based compensation of $36,000, $0, $36,000 and $0) 54,169 4,912\nGeneral and administrative (including stock-based compensation of $30,000, $0, $30,000 and $0) 285,740 77,590\nTotal operating expenses 339,909 82,502\n(Loss) income from operations (343,994 ) 191,816\nOther income (expense) - -\n(Loss) income before provision for (benefit from) income taxes (343,994 ) 191,816\nProvision for income taxes 12,095 31,650\nNet (loss) income (356,089 ) 160,166\nNet (loss) income attributable to non-controlling interest 14,879 16,017\nNet (loss) income attributable to TIANCI INTERNATIONAL, INC. $ (341,210 ) $ 144,149\nWeighted average number of common shares*\nBasic and diluted 3,314,621 1,500,000\nEarnings (loss) per common share attributable to TIANCI INTERNATIONAL, INC.*\nBasic and diluted $ (0.10 ) $ 0.10\nWeighted average number of preferred shares*\nBasic and diluted 40,659 -\nEarnings (loss) per preferred share attributable to TIANCI INTERNATIONAL, INC.*\nBasic and diluted $ (8.39 ) $ -\n* Shares are presented on a retroactive basis to reflect the reorganization on March 3, 2023\nThe accompanying notes are an integral part of these consolidated financial statements.\nTIANCI INTERNATIONAL, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nFOR THE YEARS ENDED JULY 31, 2023 AND 2022\n(EXPRESSED IN UNITED STATES DOLLARS)\nPreferred Stock Preferred Stock amount* Common stock* Common stock amount* Subscription receivable* Additional Paid-in Capital (Accumulated Deficit) Retained Earnings Noncontrolling interest Total\nBalance at July 31, 2021 - $ - 1,500,000 $ 150 $ (50,000 ) $ 62,686 $ (79,460 ) $ (8,829 ) $ (75,453 )\nPayments of Shenzhen China rent by related parties (Note 3) - - - - - 20,046 - - 20,046\nNet income - - - - - - 144,149 16,017 160,166\nBalance at July 31, 2022 - $ - 1,500,000 $ 150 $ (50,000 ) $ 82,732 $ 64,689 $ 7,188 $ 104,759\nRQS United subscription receivable - - - - 50,000 - - - 50,000\nCapital contribution - - - -\n65,650 - - 65,650\nPayments of Shenzhen China rent by related parties (Note 3) - - - - - 16,580 - - 16,580\nStock compensation issued - - 700,000 - 209,930 - - 210,000\nReverse merger adjustment 80,000 3,703,481 - (369,910 ) - - (369,532 )\nNet (loss) - - - - - - (341,210 ) (14,879 ) (356,089 )\nBalance at July 31, 2023 80,000 $ 8 5,903,481 $ 590 $ - $ 4,982 $ (276,521 ) $ (7,691 ) $ (278,632 )\n* Shares are presented on a retroactive basis to reflect the reorganization on March 3, 2023\nThe accompanying notes are an integral part of these consolidated financial statements.\nTIANCI INTERNATIONAL, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(EXPRESSED IN UNITED STATES DOLLARS)\nFor the year ended July 31,\nCash flows from operating activities:\nNet (loss) income $ (356,089 ) $ 160,166\nAdjustments to reconcile net income (loss) to net cash (used in) provided by operating activities:\nDeferred income tax benefit - 17,447\nStock compensation issued 210,000 -\nChange in operating assets and liabilities:\nAccounts receivable 737,663 (737,620 )\nInventory\n16,700\nPrepaid expense 1,397 -\nAdvance from customers 29,070 -\nAccounts payable (447,292 ) 444,944\nIncome taxes payable 12,096 14,202\nAccrued liabilities and other payables 137,736 -\nNet cash (used in) provided by operating activities 324,581 (84,161 )\nCash flows from financing activities:\nCash received in connection with reverse acquisition 4,186 -\nSubscription receivable collected 50,000 -\nCapital contribution received 65,650 -\nWorking capital advance from related party 31,490 2,007\nRepayment of working capital advance from related party (341,885 ) (14,280 )\nOperating expenses directly paid by shareholders 84,503 77,375\nPayments of Shenzhen China rent by related parties 16,580 20,046\nNet cash (used in) provided by financing activities (89,476 ) 85,148\nNet increase in cash 235,105\nCash, beginning 21,237 20,250\nCash, ending $ 256,342 $ 21,237\nSupplemental disclosure of cash flow information:\nCash paid during the period for:\nInterest $ - $ -\nIncome taxes $ - $ -\nNon-Cash Activities:\nInitial recognition of right-of-use assets and lease liabilities $ 6,436 $ -\nNoncash assets (liabilities) received in connection with reverse acquisition:\nPrepaid expense and other current assets $ 3,250 $ -\nAccounts payable (3,127 ) -\nDue to related parties (253,041 ) -\nAccrued liabilities and other payables (120,800 ) -\nNet $ (373,718 ) $ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nNOTE 1 - NATURE OF BUSINESS AND ORGANIZATION\nTianci International, Inc. (the Company, Tianci) was incorporated under the laws of the State of Nevada as Freedom Petroleum, Inc. on June 13, 2012. In May 2015, the Company changed its name to Steampunk Wizards, Inc. and on November 9, 2016, the Company changed its name to Tianci International, Inc. The Company is a holding company. As of July 31, 2023, the Company had one operating subsidiary, Roshing International Co., Ltd. (Roshing). The Company owns 90% of the capital stock of Roshing through RQS United, a wholly-owned subsidiary. The Companys fiscal year end is July 31.\nOn February 13, 2023, the Company incorporated a wholly owned subsidiary Tianci Group Holding Limited in the Republic of Seychelles.\nReorganization\nOn March 3, 2023 the Company entered into a Share Exchange Agreement with RQS United Group Limited (RQS United) and RQS Capital Limited (RQS Capital), which was the sole shareholder of RQS United (the Exchange Agreement). RQS United owns 90% of the equity in Roshing International Co., Ltd. (Roshing), which is engaged in the business of distributing electronic components and providing software services. Pursuant to the Exchange Agreement, on March 6, 2023 RQS Capital transferred all of the issued and outstanding capital stock of RQS United to the Company, and the Company issued to RQS Capital 1,500,000 shares of our common stock and paid a cash price of $350,000 (the Share Exchange). Pursuant to the Exchange Agreement, the Company also issued a total of 700,000 shares of our common stock to nine employees or affiliates of Roshing to induce continued services to Roshing.\nAs a result of the Share Exchange, RQS United became our wholly-owned subsidiary and the former RQS United stockholder became our controlling stockholder. The share exchange transaction was treated as a reverse acquisition, with RQS United as the acquirer and the Company as the acquired party for accounting purposes. Unless the context suggests otherwise, when we refer in this report to business and financial information for periods prior to the consummation of the reverse acquisition, we are referring to the business and financial information of RQS United and its consolidated subsidiary, Roshing.\nRQS United is a holding company incorporated on November 4, 2022 in the Republic of Seychelles. RQS United has no substantive operations other than holding 90% of the outstanding share capital of its subsidiary, Roshing, which was incorporated on June 22, 2011 in Hong Kong and is principally engaged in sales of electronic device hardware components, development of software and websites, technical consulting, and maintenance support on customized software. Roshings business is primarily carried out in Hong Kong and China.\nPrior to the Share Exchange, the Company was a shell company as defined in Rule 12b-2 under the Exchange Act. As a result of the transactions under the Exchange Agreement, the Company ceased to be a shell company.\nGoing Concern Uncertainty\nThe accompanying consolidated Financial Statements have been prepared applicable to a going concern which contemplates the realization of assets and liquidation of liabilities in the normal course of business. As of July 31, 2023, the Company had cash of $256,342 and negative working capital of $284,542. For the years ended July 31, 2023 and 2022, the Company had total operating revenues of $452,409 and $752,839, respectively, and net income (loss) of $(356,089) and $160,166, respectively. These factors among others raise substantial doubt about the ability of the Company to continue as a going concern for a reasonable period of time. Management plans to seek debt and/or equity financing to operate until such time as the Company has established sufficient ongoing revenues to cover its costs. However, there is no assurance that management will be successful in accomplishing its plans. These financial statements do not include any adjustments relating to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP) and pursuant to the rules and regulations of the Securities and Exchange Commission (SEC).\nPrinciples of consolidation\nThe consolidated financial statements include the financial statements of Tianci and its subsidiaries. All transactions and balances among the Company and its subsidiaries have been eliminated upon consolidation.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements. The estimates and judgments will also affect the reported amounts for certain revenues and expenses during the reporting periods. Actual results could differ from these good faith estimates and judgments.\nForeign currency translation and transactions\nThe Company uses the U.S. dollar as its reporting currency and functional currency. Transaction gains and losses are recognized in the consolidated statement of operations.\nCash and Cash Equivalents\nCash and cash equivalents consist primarily of bank deposits with original maturities of three months or less, which are unrestricted as to withdrawal and use. The Company maintains its bank accounts in United States and Hong Kong.\nAccounts receivable, net\nAccounts receivable include trade accounts due from customers which are generally collected within six months. In establishing the allowance for doubtful accounts, management considers historical collection experience, aging of the receivables, the economic environment, industry trend analysis, and the credit history and financial condition of the customer. Management reviews its receivables on a regular basis to determine if the allowance for doubtful accounts is adequate, and adjusts the allowance when necessary. Delinquent account balances are written-off against the allowance for doubtful accounts after management has determined that the likelihood of collection is not probable. As of July 31, 2023 and 2022, no allowance for doubtful accounts was deemed necessary.\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nFair Value Measurements\nThe accounting standard regarding fair value of financial instruments and related fair value measurements defines financial instruments and requires disclosure of the fair value of financial instruments held by the Company.\nThe accounting standard defines fair value, establishes as a three-level valuation hierarchy for disclosures of fair value measurement and enhances disclosure requirements for fair value measures. The three levels are defined as follow:\n·\nLevel 1 inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets.\n·\nLevel 2 inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, quoted prices for identical assets and liabilities in inactive markets and inputs that are observable for the assets or liabilities, either directly or indirectly, for substantially the full term of the financial instruments.\n·\nLevel 3 inputs to the valuation methodology are unobservable and significant to the fair value measurement.\nFinancial instruments included in current assets and current liabilities (such as cash, accounts receivable, due from related party accounts payable, and due to related parties) are reported in the consolidated balance sheets at cost, which approximates fair value because of the short period of time between the origination of such instruments and their expected realization.\nRevenue recognition\nThe Company follows the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 606. This standard requires the use of a five-step model to recognize revenue from customer contracts. The five-step model requires that the Company (i) identifies the contract with the customer, (ii) identifies the performance obligations in the contract, (iii) determines the transaction price, including variable consideration to the extent that it is probable that a significant future reversal will not occur, (iv) allocates the transaction price to the respective performance obligations in the contract, and (v) recognizes revenue when (or as) the Company satisfies the performance obligations.\nThe Company records revenue net of sales taxes which are subsequently remitted to governmental authorities and are excluded from the transaction price.\nThe Companys revenue recognition policies are as follows:\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\na. Electronic Device Hardware Components Products Sales\nThe Company is a distributor of electronic device hardware components and generates revenue through resale of these components. The Companys products include high performance computer chips, Wi-Fi modules, Bluetooth modules, 4G network modules, LED screens, and touch screens. In accordance with ASC 606, Revenue Recognition: Principal Agent Consideration, an entity is a principal if it controls the specified good or service before that good or service is transferred to a customer. Otherwise, the entity is an agent in the transaction. The Company evaluates three indicators of control in accordance with ASC 606: 1) For hardware sales, the Company is the most visible entity to customers and assumes fulfillment risk and risks related to the acceptability of products, including addressing customer complaints directly and handling of product returns or refunds directly. 2) The Company is exposed to inventory risk before transfer of control to customers 3) The Company determines the resale price of hardware products. After evaluating the above circumstances, the Company considers itself the principal of these arrangements and records hardware sales revenue on a gross basis.\nHardware sales contracts are on a fixed price basis with no separate sales rebate, discount, or other incentive. Revenue is recognized at a point in time when the Company has delivered products that have been accepted by its customer with no future obligations. The Company generally permits returns of products due to product failure; however, returns are historically insignificant.\nb. Software and Website Development Services\nThe Company generates revenue by developing customized freight shipping and related logistic software and websites, which are generally on a fixed-priced basis. The software helps wholesalers, ecommerce retailers, and freight shipping providers to manage complex workflows and improve work efficiency. The Company generally has no enforceable right to payment for performance completed to date and is only entitled to payment after software is fully developed, delivered, tested, and accepted by the customer. As a result, revenues from software development contracts are recognized at a point in time when services are fully rendered, and written acceptances have been received from customers.\nc. Technical Consulting and Training Services\nThe Company provides technical consulting and training services to help customers, generally its existing customers, to better understand and properly use its customized software and related hardware. Services are generally carried out on a per-time fixed rate basis. Revenue is recognized at a point in time when service is rendered and the customer confirms the completion of consulting or training.\nd. Software Maintenance and Business Promotion Services\nThe Company provides software maintenance service to keep customers software up to date and assists customers in promoting business with ongoing marketing support. The Company charges a flat rate for a fixed duration on a subscription basis, generally 12 months. Revenue is recognized ratably each month over the contract period.\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\ne. Business Consulting Services\nThe Company provides business consulting services to help customers apply for immigration and non-immigration visas. The Company is responsible for performing background checks, case analysis, and preparing related application paper works. The Company charges a flat fee for the visa application services. Revenue is recognized at a point in time when an application is submitted with proper authorities.\nCost of revenues\nFor hardware products sales, the cost of revenue consists primarily of the costs of hardware products sold.\nFor software related services, the cost of revenue consists primarily of costs paid to outsourced service providers and compensation expenses paid the Companys software engineers.\nAdvertising costs\nAdvertising costs amounted to $192 and $192 for the year ended July 31, 2023 and 2022, respectively. Advertising costs are expensed as incurred and included in selling and marketing expenses.\nOperating leases\nEffective August 1, 2022, the Company adopted FASB ASU 2016-02, Leases (Topic 842), and elected the practical expedients that does not require the Company to reassess: (1) whether any expired or existing contracts are, or contain, leases, (2) lease classification for any expired or existing leases and (3) initial direct costs for any expired or existing leases. For lease terms of twelve months or less, a lessee is permitted to make an accounting policy election not to recognize lease assets and liabilities. The Company also adopted the practical expedient that allows lessees to treat the lease and non-lease components of a lease as a single lease component. Upon adoption of ASU 2016-02 effective August 1, 2022, the Company recognized a $8,704 right of use (ROU) asset and operating lease liabilities in January 2023 based on the present value of the future minimum rental payments of leases, using an incremental borrowing rate of 5%.\nThe Company determines if a contract contains a lease at inception. US GAAP requires that the Companys leases be evaluated and classified as operating or finance leases for financial reporting purposes. The classification evaluation begins at the commencement date and the lease term used in the evaluation includes the non-cancellable period for which the Company has the right to use the underlying asset, together with renewal option periods when the exercise of the renewal option is reasonably certain and failure to exercise such option would result in an economic penalty. All of the Companys real estate leases are classified as operating leases.\nLease payments for an operating lease transitioning to ASC 842 using the effective date are based on future payments at the transition date and on the present value of lease payments over the remaining lease term. Since the implicit rate for the Companys leases is not readily determinable, the Company uses its incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments. The incremental borrowing rate is the rate of interest that the Company would have to pay to borrow, on a collateralized basis, an amount equal to the lease payments, in a similar economic environment and over a similar term.\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nLease terms used to calculate the present value of lease payments generally do not include any options to extend, renew, or terminate the lease, as the Company does not have reasonable certainty at lease inception that these options will be exercised. The Company generally considers the economic life of its operating lease ROU assets to be comparable to the useful life of similar owned assets. The Company has elected the short-term lease exception; therefore, operating lease ROU assets and liabilities do not include leases with a lease term of twelve months or less. Lease expense is recognized on a straight-line basis over the lease term.\nThe Company reviews the impairment of its ROU assets consistent with the approach applied for its other long-lived assets. The Company reviews the recoverability of its long-lived assets when events or changes in circumstances occur that indicate that the carrying value of the asset may not be recoverable. The assessment of possible impairment is based on its ability to recover the carrying value of the asset from the expected undiscounted future pre-tax cash flows of the related operations.\nIncome taxes\nThe Company accounts for current income taxes in accordance with the laws of the relevant tax authorities. The charge for taxation is based on the results for the fiscal year as adjusted for items which are non-taxable or non-deductible. It is calculated using tax rates that have been enacted or substantively enacted by the balance sheet date.\nDeferred taxes are accounted for using the asset and liability method in respect of temporary differences arising from differences between the carrying amount of assets and liabilities in the unaudited interim consolidated financial statements and the corresponding tax bases used in the computation of taxable income (loss). In principle, deferred tax liabilities are recognized for all taxable temporary differences. Deferred tax assets are recognized to the extent that it is probable that taxable profit will be available against which deductible temporary differences can be utilized. Deferred tax is calculated using tax rates that are expected to apply to the period when the asset is realized or the liability is settled. Deferred tax is charged or credited in the statements of operations, except when it is related to items credited or charged directly to equity, in which case the deferred tax is dealt with in equity. Net deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the net deferred tax asset will not be realized.\nAn uncertain tax position is recognized as a benefit only if it is more likely than not that the tax position would be sustained in a tax examination, with a tax examination being presumed to occur. The amount recognized is the largest amount of tax benefit that has a greater than 50% likely of being realized on examination. For tax positions not meeting the more likely than not test, no tax benefit is recorded. Penalties and interest incurred related to underpayment of income tax for uncertain tax positions are classified as income tax expense in the period incurred.\nThe Hong Kong tax returns filed for 2016 and subsequent years are subject to examination by the applicable tax authorities.\nThe US tax returns filed for 2019 and subsequent years are subject to examination by the applicable tax authorities.\nEarnings (loss) per share\nThe Company computes earnings (loss) per share (EPS) in accordance with FASB ASC 260, Earnings per Share. ASC 260 requires companies to present basic and diluted EPS. Basic EPS is measured as net income (loss) divided by the weighted average ordinary shares outstanding for the period. Diluted EPS presents the diluted effect on a per share basis of the potential ordinary shares (e.g., convertible securities, options and warrants) as if they had been converted at the beginning of the periods presented, or issuance date, if later. Potential ordinary shares that have an anti-dilutive effect (i.e., those that increase income per share or decrease loss per share) are excluded from the calculation of diluted EPS. For the years ended July 31, 2023 and 2022, there were no dilutive shares outstanding.\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nNoncontrolling Interests\nThe Companys noncontrolling interest represents the minority shareholders 10% ownership interest in Roshing. The noncontrolling interest is presented in the consolidated balance sheets separately from stockholders equity attributable to Tianci. Noncontrolling interest in the results of Roshing are presented on the consolidated statements of operations as allocations of the total income or loss of Roshing for the years ended July 31, 2023 and 2022 between the noncontrolling interest holder and the shareholders of RQS United.\nRelated parties\nParties, which can be a corporation, other business entity, or an individual, are considered to be related if one party has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operating decisions. Parties are also considered to be related if they are subject to common control or common significant influence.\nRecently issued accounting pronouncements\nThe Company considers the applicability and impact of all accounting standards updates (ASUs). Management periodically reviews new accounting standards that are issued. Under the Jumpstart Our Business Startups Act of 2012, as amended (the JOBS Act), the Company meets the definition of an emerging growth company and has elected the extended transition period for complying with new or revised accounting standards, which delays the adoption of these accounting standards until they would apply to private companies.\nIn May 2019, the FASB issued ASU 2019-05, which is an update to ASU Update No. 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, which introduced the expected credit losses methodology for the measurement of credit losses on financial assets measured at amortized cost basis, replacing the previous incurred loss methodology. The amendments in Update 2016-13 added Topic 326, Financial Instruments - Credit Losses, and made several consequential amendments to the Codification. Update 2016-13 also modified the accounting for available-for-sale debt securities, which must be individually assessed for credit losses when fair value is less than the amortized cost basis, in accordance with Subtopic 326-30, Financial Instruments - Credit Losses - Available-for-Sale Debt Securities. The amendments in this Update provide an option to irrevocably elect the fair value option for certain financial assets previously measured at amortized cost basis. In November 2019, the FASB issued ASU No. 2019-10, which updates the effective date of ASU No. 2016-13 for private companies, not-for-profit organizations and certain smaller reporting companies. The new effective date for these preparers is for fiscal years beginning after December 15, 2022. ASU 2019-05 is effective for the Company for annual and interim reporting periods beginning August 1, 2023 as the Company is qualified as an emerging growth company. The adoption of this standard on August 1, 2023 is not expected to have a material impact on the Companys future consolidated financial statements.\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. The amendments in this Update simplify the accounting for income taxes by removing certain exceptions to the general principles in Topic 740. The amendments also improve consistent application of and simplify GAAP for other areas of Topic 740 by clarifying and amending existing guidance. For public business entities, the amendments in this Update are effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2020. For all other entities, the amendments are effective for fiscal years beginning after December 15, 2021, and interim periods within fiscal years beginning after December 15, 2022. The adoption of this standard on August 1, 2022 did not have a material impact on the Companys consolidated financial statements.\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nIn October 2020, the FASB issued ASU 2020-08, Codification Improvements to Subtopic 310-20, Receivables - Nonrefundable Fees and Other Costs. The amendments in this Update represent changes to clarify the Codification. The amendments make the Codification easier to understand and easier to apply by eliminating inconsistencies and providing clarifications. ASU 2020-08 is effective for the Company for annual and interim reporting periods beginning August 1, 2021. All entities should apply the amendments in this Update on a prospective basis as of the beginning of the period of adoption for existing or newly purchased callable debt securities. These amendments do not change the effective dates for Update 2017-08. The adoption of this standard on August 1, 2021 did not have a material impact on the Companys consolidated financial statements.\nExcept as mentioned above, the Company does not believe other recently issued but not yet effective accounting standards, if currently adopted, would have a material effect on the Companys consolidated Financial Statements.\nNOTE 3 - RELATED PARTIES BALANCES AND TRANSACTIONS\nDue from related party consists of:\nDue from related party represents a receivable of $54,134 from RQS Capital, which was subsequently collected.\nDue to related parties consist of:\nSchedule of due to related parties\nTransaction July 31, July 31,\nName Relationship Nature\nZhigang Pei Chairman of the Board Working capital advances and operating expenses paid on behalf of the Company $ 220,909 $ -\nRQS Capital 68% shareholder Company cash collection due to RQS Capital 2,132 -\nYing Deng RQS Capital 30% owner and Roshings 10% owner Working capital advances and operating expense paid on behalf of the Company 53,036 194,794\nTOTAL\n$ 276,077 $ 194,794\nThese liabilities are unsecured, non-interest bearing, and due on demand.\nEmployment agreements with officers and director retainer agreements\nTianci currently maintains two employment agreements and six director retainer agreements with its officers and directors. The agreements have terms of 3 years and each provide for monthly compensation in amounts ranging from $1,300 per month to $3,800 per month.\nFor the year ended July 31, 2023, we accrued management compensation expenses of $120,000. These amounts are included in general and administrative expenses in the accompanying consolidated statement of operations.\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nOffice space sharing agreement with related parties\nOn August 28, 2021, Roshing entered into an office space sharing agreement with Shufang Gao, 60% owner of RQS Capital and Ying Deng, 30% owner of RQS Capital, for office space in Shenzhen, China. The agreement provided for Gao and Deng, sub lessees under a separate office space sharing agreement relating to the use of the premises from August 28, 2021 to August 31, 2024, to pay monthly rent to the lessee ranging from RMB 12,320 (approximately $1,726) to RMB 13,583 (approximately $1,903) on behalf of Roshing. The rent expenses paid by Gao and Deng were billed directly to Gao and Deng by the Lessee and the sublease is between Gao and Deng and the Lessee. The Company has no obligation, directly or indirectly, to reimburse or otherwise compensate Gao and Deng for paying these expenses. For the years ended July 31, 2023 and 2022, the Company has accounted for this agreement by charging general and administrative expenses for $16,580 and $20,046, respectively, and crediting additional paid-in capital for $16,580 and $20,046, respectively. The office sharing agreement was terminated on May 31, 2023 when Roshing moved all of its operations to its office in Hong Kong.\nNOTE 4 - STOCKHOLDERS EQUITY\nOn January 26, 2023 the Company filed with the Nevada Secretary of State a Certificate of Amendment of Articles of Incorporation (the Amendment). The Amendment amended Article 3 of the Companys Articles of Incorporation to provide that the authorized capital stock of the Company will be 120,080,000 shares of capital stock consisting of 100,000,000 shares of common stock, $0.0001 par value, 80,000 shares of Series A Preferred Stock, $0.0001 par value, and 20,000,000 shares of undesignated preferred stock, $0.0001 par value.\nThe following table sets forth information, as of July 31, 2023, regarding the classes of capital stock that are authorized by the Articles of Incorporation of Tianci International, Inc.\nSchedule of capital stock authorized\nClass Shares Authorized Shares Outstanding\nCommon Stock, $.0001 par value 100,000,000 5,903,481\nSeries A Preferred Stock, $.0001 par value 80,000 80,000\nUndesignated Preferred Stock, $.0001 par value 20,000,000\nSeries A Preferred Stock\nEach share of Series A Preferred Stock may be converted by the holder of the share into 100 shares of common stock, subject to equitable adjustment of the conversion rate. Each holder of Series A Preferred Stock will have voting rights equal to the holder of the number of shares of common stock into which the Series A Preferred Stock is convertible. Upon liquidation of the Company, each holder of Series A Preferred Stock will be entitled to receive, out of the net assets of the Company, $0.01 per share, then to share in the distribution on an as-converted basis.\nUndesignated Preferred Stock\nThe Board of Directors has the authority, without shareholder approval, to amend the Companys Articles of Incorporation to divide the class of undesignated Preferred Stock into series, and to determine the relative rights and preferences of the shares of each series, including (i) voting power, (ii) the rate of dividend, (iii) the price at which, and the terms and conditions on which, the shares may be redeemed, (iv) the amount payable upon the shares in the event of liquidation, (v) any sinking fund provision for the redemption or purchase of the shares, and (vi) the terms and conditions on which the shares may be converted to shares of another series or class, if the shares of any series are issued with the privilege of conversion.\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nIssuances of Preferred Stock and Common Stock\nOn January 27, 2023, Tianci sold 80,000 shares of its Series A Preferred Stock to RQS Capital for $24,000 cash.\nOn March 1, 2023, Tianci sold a total of 1,253,333 shares of its common stock to 13 non-US persons at a price of $0.30 per share or $376,000 total.\nOn March 6, 2023, Tianci issued 1,500,000 shares of its common stock to RQS Capital pursuant to the Share Exchange Agreement dated March 3, 2023 (see Note 1 above).\nAlso on March 6, 2023 pursuant to the Share Exchange Agreement dated March 3, 2023, Tianci issued a total of 700,000 shares of its common stock to nine employees or affiliates of Roshing to induce continued services to Roshing. For the year ended July 31, 2023, the Company accounted for this issuance by expensing the $210,000 estimated fair value of the 700,000 shares of common stock to (1) cost of revenues-services ($144,000), (2) selling and marketing ($36,000), and (3) general and administrative ($30,000).\nNOTE 5 - INCOME TAXES\nIncome Taxes\nSeychelles\nRQS United is incorporated in Seychelles and is not subject to tax on income generated outside of Seychelles under the current law. In addition, upon payment of dividends, no withholding tax is imposed under current law.\nHong Kong\nRoshing is incorporated in Hong Kong and is subject to Hong Kong Profits Tax on the taxable income as reported in its statutory financial statements adjusted in accordance with relevant Hong Kong tax laws. The applicable tax rate is 16.5% in Hong Kong. Hong Kong income tax expenses for the years ended July 31, 2023 and 2022 amounted to $12,095 and $31,650, respectively.\nFor the year ended July 31, 2023, the loss before provision for income taxes of $(343,994) consisted of United States source loss of $207,297 and Hong Kong source loss of $136,697. For the year ended July 31, 2022, the income before provision for income taxes of $191,816 was all Hong Kong source income.\nSignificant components of the provision for income taxes are as follows:\nSchedule of components of income tax expense\nYear ended\nJuly 31,\nJuly 31,\nCurrent Hong Kong $ 12,095 $ 14,203\nDeferred Hong Kong - 17,447\nProvision (benefit) for income taxes $ 12,095 $ 31,650\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nThe following table reconciles the Hong Kong statutory rates to the Companys Hong Kong effective tax rate:\nSchedule of effective income tax reconciliation\nFor the\nyear ended\nJuly 31,\nFor the\nyear ended\nJuly 31,\nHong Kong statutory income tax rate 16.5% 16.5%\nNon deductible stock compensation expense -25.3% -\nEffective tax rate -8.8% 16.5%\nFor United States income tax purposes, Tianci has a net operating loss carry forward of approximately $967,000 at July 31, 2023. Management has not determined that it is more likely than not that this carryforward will be realized and thus the Company maintained a 100% valuation allowance for the deferred tax asset relating to the United States net operating loss carryforward. Current United States income tax law limits the amount of loss available to offset against future taxable income when a substantial change in ownership occurs.\nUncertain tax positions\nThe Company evaluates each uncertain tax position (including the potential application of interest and penalties) based on the technical merits, and measures the unrecognized benefits associated with the tax positions. As of July 31, 2023 and 2022, the Company did not have any significant unrecognized uncertain tax positions.\nAs of July 31, 2023, tax years 2020 and forward generally remain open for examination for United States Federal and State tax purposes and tax years 2017 and forward generally remain open for examination for foreign tax purposes.\nNOTE 6 - CONCENTRATION OF RISK\nCredit risk\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist primarily of cash held in banks. The cash balance in each financial institution in the United States is insured by the FDIC up to $250,000. As of July 31, 2023, no United States account balance exceeded $250,000. The Hong Kong Deposit Protection Board pays compensation up to a limit of HKD 500,000 (approximately US$64,000) if the bank with which an individual/company holds its eligible deposit fails. As of July 31, 2023, a cash balance of $189,768 was maintained at a financial institution in Hong Kong of which approximately $125,000 was subject to credit risk. Management believes that the financial institution is of high credit quality and continually monitors its credit worthiness.\nCustomer concentration risk\nFor the year ended July 31, 2023, two customers accounted for 40.9% and 11.5% of the Companys total revenues.\nFor the year ended July 31, 2022, five customers accounted for 40.3%, 23.9%, 10.6%, 10.6% and 10.2% of the Companys total revenues.\nAs of July 31, 2023, no customer accounted for over 10% of the Companys total accounts receivable. As of July 31, 2022, five customers accounted for 41.1%, 24.4%, 10.8%, 10.8%, and 10.5% of the Companys total accounts receivable.\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nVendor concentration risk\nFor the year ended July 31, 2023, two vendors accounted for 76% and 16% of the Companys total purchases. For the year ended July 31, 2022, four vendors accounted for 44.5%, 28.1% 16.6%, and 10.8% of the Companys total purchases.\nAs of July 31, 2023, no vendor accounted for over 10% of the Companys total accounts payable. As of July 31, 2022, four vendors accounted for 44.5%, 28.1%, 16.6%, and 10.8% of the Companys total accounts payable.\nNOTE 7- COMMITMENTS AND CONTINGENCIES\nLease commitments\nOn January 1, 2021, Roshing entered into an operating lease agreement for office space in Hong Kong with a third party. The agreement had a term of two years and provided for monthly rent of HKD 2,800 (approximately $360). On January 13, 2023, the Company entered a new operating lease agreement for office space in Hong Kong with a third party for two years with monthly rent of HKD 3,000 (approximately $382). Upon adoption of ASU 2016-02 effective August 1, 2022, the Company recognized a $8,704 right of use (ROU) asset and operating lease liabilities in January 2023 based on the present value of the future minimum rental payments of leases, using an incremental borrowing rate of 5%.\nThe Companys lease agreement does not contain any material residual value guarantees or material restrictive covenants. The lease does not contain an option to extend at the time of expiration.\nAs of July 31, 2023, the Companys operating lease had a remaining lease term of approximately 1.50 years.\nRent expenses were $26,159 and $24,362 for the years ended July 31, 2023 and 2022, respectively.\nThe total future minimum lease payments under the non-cancellable operating lease as of July 31, 2023 are as follows:\nSchedule of operating lease payments\nYear ending July 31, Minimum lease\npayments\n$ 4,586\n2,096\nTotal lease payments 6,682\nLess: Interest (246\nPresent value of lease liabilities $ 6,436\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nFuture amortization of the Companys ROU asset is presented below:\nSchedule of future amortization\nYear ending July 31,\n4,368\n2,068\nTotal $ 6,436\nContingencies\nFrom time to time, the Company may be a party to legal proceedings, as well as certain asserted and un-asserted claims.\nNOTE 8 - ENTERPRISE WIDE DISCLOSURE\nThe Company follows ASC 280, Segment Reporting, which requires companies to disclose segment data based on how management makes decisions about allocating resources to each segment and evaluates their performances. The Companys chief operating decision-makers (i.e., the Companys chief executive officer and his direct assistants, including the Companys chief financial officer) review financial information presented on a consolidated basis, accompanied by disaggregated information about revenues, cost of revenues, and gross profit by business lines and by regions (primarily in Hong Kong and Singapore) for purposes of allocating resources and evaluating financial performance. There are no segment managers who are held accountable for operations, operating results and plans for levels or components below the consolidated unit level. Based on qualitative and quantitative criteria established by ASC 280, the Company considers itself to be operating within one reportable segment.\nDisaggregated information of revenues by business lines are as follows:\nSchedule of information of revenues by business\nFor the year ended\nJuly 31,\nElectronic Device Hardware Components Sales $ 294,880 $ 500,500\nSoftware and Website Development Services 10,000 -\nTechnical Consulting and Training Services 14,470 8,791\nSoftware Maintenance and Business Promotion Services 86,776 243,548\nBusiness Consulting Services 46,283 -\nTotal revenues $ 452,409 $ 752,839\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nDisaggregated information of revenues by regions are as follows:\nSchedule of information of revenues by regions\nFor the year ended\nJuly 31,\nHong Kong $ 395,633 $ 595,719\nSingapore 56,776 157,120\nTotal revenues $ 452,409 $ 752,839\nNOTE 9 - CONDENSED FINANCIAL INFORMATION OF THE PARENT COMPANY (Unaudited)\nThe Company performed a test on the restricted net assets of its consolidated subsidiaries in accordance with Rule 4-08(e)(3) of Regulation S-X promulgated by the SEC, General Notes to Financial Statements and concluded that it was applicable and the Company is required to disclose the required financial statement information for the parent company.\nThe subsidiaries did not pay any dividends to the parent during the periods presented. For the purpose of presenting parent only financial information, the Company records its investment in its subsidiaries under the equity method of accounting. Such investments are presented on the separate parent only balance sheets as investment in subsidiaries and the income (loss) of the subsidiaries is presented as share of income (loss) of subsidiaries. Certain information and footnote disclosures generally included in financial statements prepared in accordance with U.S. GAAP have been condensed or are not required.\nPARENT COMPANY BALANCE SHEET\nSchedule of balance sheets\nJuly 31,\n(Unaudited)\nASSETS\nCash $ 66,553\nPrepaid expense 1,750\nReceivable from subsidiaries 29,487\nInvestment in subsidiaries 95,889\nTotal Assets $ 193,679\nLIABILITIES\nAccounts payable and accrued liabilities $ 241,579\nDue to related parties 223,041\nTotal Liabilities 464,620\nStockholders equity\nSeries A Preferred stock, $0.0001 par value; 80,000 shares authorized; 80,000 shares issued and outstanding as of July 31, 2023\nUndesignated preferred stock, $0.0001 par value; 20,000,000 shares authorized; no shares issued and outstanding -\nCommon stock, $0.0001 par value, 100,000,000 shares authorized; 5,903,481 shares issued and outstanding as of July 31, 2023\nAdditional paid-in capital 4,982\nAccumulated deficit (276,521 )\nTotal stockholders equity (270,941 )\nTotal Liabilities and Stockholders Equity $ 193,679\nTIANCI INTERNATIONAL, INC.\nNotes To Consolidated Financial Statements\nFor the years ended July 31, 2023 and 2022\nPARENT COMPANY STATEMENT OF OPERATIONS\nSchedule of statements of operations\nFrom March 3, 2023\nto\nJuly 31, 2023\n(Unaudited)\nEXPENSES:\nGeneral and administrative $ 207,297\nLoss from investment in subsidiaries 133,913\nTotal expenses 341,210\nNet Loss $ (341,210 )\nPARENT COMPANY STATEMENT OF CASH FLOWS\nSchedule of statements of cash flows\nFrom March 3, 2023\nto\nJuly 31, 2023\n(Unaudited)\nCash flows from operating activities:\nNet loss $ (341,210 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nShare of loss from investment in subsidiaries 133,913\nChange in operating assets and liabilities:\nPrepaid expense 1,500\nAccounts payable and accrued liabilities 117,651\nNet cash (used in) operating activities (88,146 )\nCash flows from financing activities:\nRepayment of working capital advance from related party (30,000 )\nOperating expenses directly paid for subsidiary (29,487 )\nCommon Stock issued to Roshing employees and affiliates for services rendered 210,000\nNet cash provided by financing activities 150,513\nNet increase in cash and cash equivalents 62,367\nCash and cash equivalents at March 3, 2023 4,186\nCash and cash equivalents at July 31, 2023 $ 66,553 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot Applicable. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures.\nWe maintain disclosure controls and procedures, as such term is defined in Rule 13a-15(e) under the Securities Exchange Act of 1934 (the Exchange Act), that are designed to ensure that information required to be disclosed in our Exchange Act reports is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer (\"CEO\")/Chief Financial Officer (\"CFO\"), as appropriate, to allow timely decisions regarding required disclosure. We conducted an evaluation, under the supervision and with the participation of our CEO/CFO of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this report pursuant to Rule 13a-15 of the Exchange Act. Based on this evaluation and the existence of the material weaknesses discussed below in Management's Report on Internal Control over Financial Reporting, our management, including our CEO/CFO concluded that our disclosure controls and procedures were not effective at the reasonable assurance level as of the end of the period covered by this Report.\nChanges in Internal Controls.\nThere was no change in internal control over financial reporting (as defined in Rule 13a-15(f) promulgated under the Securities Exchange Act or 1934) identified in connection with the evaluation described in the preceding paragraph that occurred during Tianci International, Inc.'s fourth fiscal quarter that has materially affected or is reasonably likely to materially affect Tianci International, Inc.'s internal control over financial reporting.\nManagements Report on Internal Control over Financial Reporting\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934. We have assessed the effectiveness of those internal controls as of July 31, 2023 using the Committee of Sponsoring Organizations of the Treadway Commission (COSO) Internal Control - Integrated Framework (1992) as a basis for our assessment.\nBecause of inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nA material weakness in internal controls is a deficiency in internal control, or combination of control deficiencies, that adversely affects the Companys ability to initiate, authorize, record, process, or report external financial data reliably in accordance with accounting principles generally accepted in the United States of America such that there is more than a remote likelihood that a material misstatement of the Companys annual or interim financial statements that is more than inconsequential will not be prevented or detected. In the course of making our assessment of the effectiveness of internal controls over financial reporting, we identified three material weaknesses in our internal control over financial reporting. These material weaknesses consisted of:\n· Because of the Companys limited resources, there are limited controls over information processing.\n· There is an inadequate segregation of duties consistent with control objectives. Our Companys management is limited in number, resulting in a situation where limitations on segregation of duties exist. In order to remedy this situation, we would need to hire additional staff to provide greater segregation of duties. Currently, it is not feasible to hire additional staff to obtain optimal segregation of duties. Management will reassess this matter in the following year to determine whether improvement in segregation of duty is feasible.\n· The Company does not have a sitting audit committee financial expert, and thus the Company lacks the board oversight role within the financial reporting process.\n· There is a lack of formal policies and procedures necessary to adequately review significant accounting transactions. The Company utilizes a third-party independent contractor for the preparation of its financial statements. Although the financial statements and footnotes are reviewed by our management, we do not have a formal policy to review significant accounting transactions and the accounting treatment of such transactions. The third-party independent contractor is not involved in the day to day operations of the Company and may not be provided information from management on a timely basis to allow for adequate reporting/consideration of certain transactions.\nManagement does not believe that the current level of the Companys operations warrants a remediation of the weaknesses identified in this assessment. However, because of the above condition, managements assessment is that the Companys internal controls over financial reporting were not effective as of July 31, 2023.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this annual report. Item 9B Other Information\nNot applicable.\nItem 9C Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe names of our current officers, directors and key employees, as well as certain information about them, are set forth below:\nName Age Position with Tianci Director Since\nZhigang Pei Chairman of the Board\nShufang Gao Director, Chief Executive Officer, Chief Financial Officer\nYing Deng Director, Vice President\nDavid Wei Fang Director\nJack Fan Liu Director\nYee Man Yung Director\nBo Ye Corporate Secretary --\nDirectors hold office until the annual meeting of Tiancis stockholders and the election and qualification of their successors. Officers hold office, subject to removal at any time by the Board, until the meeting of directors immediately following the annual meeting of stockholders and until their successors are appointed and qualified.\nInformation concerning the directors, officers and key employees of Tianci follows:\nZhigang Pei joined Tianci on August 26, 2021 as Chief Executive Officer, Chief Financial Officer, Secretary, and a member of the Board. Mr. Pei resigned from his position as CEO in January 2023 and from his position as CFO in April 2023. Mr. Pei has served as the Executive Director of Anyang Xinrun Investment Co., Ltd. since November 2009. He has also served as the Executive Director and General Manager of Henan Ziwei Real Estate Development Co., Ltd., and Henan Anyang Dahua Commercial and Trading Plaza Development Co., Ltd. since 2015. Mr. Pei graduated from No.2 Middle School Anyang City in 1989. Mr. Pei brings to the Board his deep experience in the real estate and investment industries.\nShufang Gao has worked as CEO of Hong Kong listed groups, president of domestic capital companies, and vice president of A-share listed companies. He is familiar with the A-share capital market and the Hong Kong capital market, and has experience in the strategic development of listed companies. Mr. Gao joined Tianci on August 26, 2021 as a member of our Board and was appointed Chief Executive Officer in January 2023. From October 2020 to August 2021, Mr. Gao served as the Vice President and Director of Sichuan Jinding Group. Prior to that, he was the Vice Chairman of Luoyang Yongning Nonferrous Technology Co., Ltd. from August 2019 to September 2020. From April 2018 to July 2019, Mr. Gao served as the Vice President of Tibet Huayu Mining Co., Ltd., an A-share listed company. He was the Chief Executive Officer of Haotian Development Group Co., Ltd. (Hong Kong Main Board Listed Company 00474) from August 2016 to September 2017. From August 2012 to August 2016, Mr. Gao served as the President of Haihua Group Holdings Co., Ltd., an international container leasing company. Mr. Gao received his Bachelor of Management Degree from Dalian University of Technology in 1999. He received his Masters Degree in Finance and Accounting from the Chinese University of Hong Kong in 2008. Mr. Gao brings to the Board his international experience in the operation and governance of listed companies.\nYing Deng has over fifteen years of experience in corporate finance, asset management and banking. Ms. Deng became Vice President of Tianci and was appointed to Tiancis Board in January 2023. She has been employed by RQS Capital Limited since September 2022 as a Director responsible for business development and financial planning. Since July 2017 Ms. Deng has been employed as Director and Chief Executive Officer by Shenzhen Dandelion Club Investment Development Co., Ltd., where she is responsible for project due diligence and investment management. Since June 2011 Ms. Deng has been employed as a Director by Roshing International Co., Ltd., where she is responsible for strategic planning and daily operations. In 2020 Ms. Deng was awarded a Masters Degree in Business Administration by Nankai University. She earned a Bachelors Degree from Jinan University in 2006. Ms. Deng brings to the Board her extensive experience in business administration.\nDavid Wei Fang has over ten years of experience in the securities and investment industry. He joined Tianci on August 26, 2021 as an executive member of the Board. Mr. Fang served as the Partner of Tiger Securities and the CEO of Tiger Securities International in Hong Kong from May 2018 to July 2019. From January 2017 to April 2018, Mr. Fang served as the CEO of Haotian International Securities in Hong Kong. Mr. Fang was the Head of High Net Worth Individual, Corporate Client and ICBC Global Wealth Management Center of ICBC International in Hong Kong from October 2014 to December 2016. Mr. Fang earned a Bachelors degree in Economics from Anhui University of Finance and Economics in 1994. Mr. Fang obtained his Master of Business Administration Degree from South Georgia University in 2004. Mr. Fang brings to the Board his deep experience in the securities and investment industry.\nJack Fan Liu joined Tianci on August 26, 2021 as a member of our Board. Prior to joining us, Mr. Liu was the Vice President of China Regenerative Medicine International Limited from September 2014 to October 2017. From July 2009 to August 2014, Mr. Liu was the Investment Director of Tian Huan Investment Company. He was a financial analyst at Founder Securities (SSE:601901) from May 2007 to June 2009. Mr. Liu received his B.A. in Engineering from Nanjing Tech University in 2001 and his Master of Economics from Concordia University, Canada in 2006. He brings to the Board his experience and knowledge of investments and mergers and acquisitions of companies in Hong Kong and China.\nYung Yee Man has more than 5 years of experience as a human resources manager for both Hong Kong and NASDAQ listed companies. She also has two years experience as an assistant to board members. Ms. Yung joined Tianci on 26 August, 2021 as a member of our Board. Since 2020 she has served as Human Resources Manager for Link-Asia International Med-Tech Group Limited. Form 2018 to 2019 Ms. Yung was employed as Account Manager by Tiger Brokers (HK) Global Limited. Ms. Yung earned a Masters degree in Corporate Communication from University of Leeds in 2017. Ms. Yung is currently pursuing an MBA Degree at the University of South Australia. Ms. Yung brings to the Board her human resources and public company experience.\nBo Ye joined Tianci as Corporate Secretary in January 2023. Since 2014 Mr. Ye has been employed as Director and Chief Executive Officer by Shenzhen Ouyu Technology Co., Ltd. Since 2018 Mr. Ye has also been employed as Director and Vice President of Shenzhen Renqisheng Investment Development. Mr. Ye was awarded a Bachelor of Arts Degree by Jinan University in 2006.\nFamily Relationships\nThere are no family relationships among any of our officers or directors.\nCorporate Governance\nBoard Committees\nWe presently do not have an audit committee, compensation committee or nominating committee or committee performing similar functions, as our management believes that until this point it has been premature at the early stage of our management and business development to form an audit, compensation or nominating committee. Until these committees are established, these decisions will continue to be made by our Board of Directors.\nDirector Independence\nThe Board of Directors has determined that Jack Fan Liu and Yung Yee Man are independent directors, as the term \"independent\" is defined by the rules of the NYSE American.\nCode of Ethics\nTianci has not adopted a formal code of ethics applicable to its executive officers. The Board of Directors has determined that Tiancis financial operations are not sufficiently complex to warrant adoption of a formal code of ethics.\nSection 16(a) Beneficial Ownership Reporting Compliance\nNot applicable. Item 11. Executive Compensation\nTianci International, Inc.\nTianci has paid no compensation to any officer or director during the past three fiscal years or any subsequent period. Unpaid compensation has been accrued pursuant to the Employment Agreements described below, totaling an aggregate of $240,800 as of July 31, 2023.\nRQS United, Inc.\nRQS United did not pay compensation to any officer or director for services in those roles during its past three fiscal years.\nRoshing International Co., Ltd.\nRoshing pays Ying Deng, its Manager, and Mr. Shufang Gao, the CEO a salary of 2,000 HKD per month (USD $258).\nEmployment Agreements\nOn August 27, 2021, we entered into an Employment Agreement with each of Zhigang Pei, Shufang Gao and Wei Fang and on January 27, 2023 we entered into an Employment Agreement with Ying Deng (collectively, the Employment Agreements), whereby each individual agreed to serve as an Executive Director for a monthly compensation equal to U.S.$3,800. Each Employment Agreement expires after three years, unless earlier terminated by death, resignation or removal.\nWe are entitled to terminate the each Employment Agreement for cause without notice or remuneration (unless otherwise required by law) if: (i) the executive is convicted or pleads guilty to a felony or to an act of fraud, misappropriation or embezzlement; (ii) the executive has been grossly negligent or acted dishonestly to the detriment of the Company; (iii) the executive has engaged in actions amounting to willful misconduct or failed to perform his duties hereunder and such failure continues after the executive is afforded a reasonable opportunity to cure such failure; or (iv) the executive violates the provisions relating to confidentiality, non-competition and non-solicitation of the Employment Agreement. Upon a termination for cause, the executive shall not be entitled to any severance or other benefits under the Employment Agreement but shall be entitled to receive accrued base salary.\nIf the Employment Agreement is terminated due to the executives death or disability, the executive shall be entitled to receive accrued base salary.\nIf the Employment Agreement is terminated by the Company without cause, the executive will receive a lump sum payment equal to 12 months of base salary, a lump sum cash payment equal to a pro-rated amount of his/her target annual bonus for the year immediately preceding the termination, payment of premiums for continued health benefits under the Companys health plans for 12 months following termination, and immediate vesting of 100% of the then-unvested portion of any outstanding equity awards held by the executive, if any.\nIf the Employment Agreement is terminated due to a change in control, the executive will receive a lump sum payment equal to 12 months of base salary, a lump sum cash payment equal to a pro-rated amount of his/her target annual bonus for the year immediately preceding the termination, and immediate vesting of 100% of the then-unvested portion of any outstanding equity awards held by the executive.\nIf the Employment Agreement is terminated by the executive due to (1) a material reduction in the executives authority, duties and responsibilities, or (2) a material reduction in the executives annual salary, the executive will receive a lump sum payment equal to 12 months of base salary.\nGrants of Plan-Based Awards\nDuring the past three fiscal years, there were no grants of plan-based awards to our named executive officers by Tianci, RQS United or Roshing.\nOption Exercises and Stock Vested\nDuring the past three fiscal years, there were no option exercises or vesting of stock awards by our named executive officers.\nOutstanding Equity Awards at Fiscal Year End\nDuring the past three fiscal years, none of our executive officers received any equity awards, including, options, restricted stock or other equity incentives, from either Tianci, RQS United or Roshing.\nCompensation of Directors\nOn August 27, 2021, each of our two independent directors Jack Fan Liu and Yee ManYung, entered into a Director Retainer Agreement agreeing to serve on our Board of Directors for monthly compensation of U.S.$1,300. The Director Retainer Agreements contain normal and customary terms including provisions relating to indemnification and confidentiality. Item 12. Security Ownership of Certain Beneficial Owners and Management\nThe following table sets forth information with respect to the securities holdings of (i) Tiancis officers and directors, and (ii) all persons which, pursuant to filings with the SEC and our stock transfer records, we have reason to believe may be deemed the beneficial owner of more than five percent (5%) of any class of Tianci's voting stock. The securities \"beneficially owned\" by an individual are determined in accordance with the definition of \"beneficial ownership\" set forth in the regulations promulgated under the Exchange Act and, accordingly, may include securities owned by or for, among others, the spouse and/or minor children of an individual and any other relative who resides in the same home as such individual, as well as other securities as to which the individual has or shares voting or investment power or which each person has the right to acquire within 60 days through the exercise of options or otherwise. This table has been prepared based on 80,000 shares of Series A Preferred Stock and 5,903,481 shares of Common Stock outstanding as of the date of filing of this Report. Unless otherwise specified, the address of each of the persons set forth below is in care of Tianci, 20 Holbeche Road, Arndell Park, NSW 2148 Australia.\nCommon Stock Series A Preferred\nName of\nBeneficial Owner\nAmount and Nature of\nBeneficial Ownership(1)\nPercentage\nof Class\nAmount and Nature of\nBeneficial Ownership(1)\nPercentage\nof Class\nTotal Voting Power\nZhigang Pei 1,793,000(2) 40.4% -- -- 12.9%\nShufang Gao 1,500,000(3)(4) 25.4% 80,000(3) 100% 68.3%\nDavid Wei Fang -- -- -- -- --\nYee Man Yung -- -- -- -- --\nJack Fan Liu -- -- -- -- --\nYing Deng 1,500,000(3)(4) 25.4% 80,000(3) 100% 68.3%\nAll officers and directors as a group (7 persons) 1,500,000 25.4% 80,000(3) 100% 68.3%\nRQS Capital Limited 1,500,000(4) 25.4% 80,000 100% 68.3%\n______________________________\n(1) Ownership is of record and beneficial unless otherwise noted.\n(2) Owned of record by Silver Glory Group Limited, of which Zhigang Pei is the beneficial owner.\n(3) All shares of common stock and Series A Preferred Stock attributed to Shufang Gao or Ying Deng are owned of record by RQS Capital Limited. Shufang Gao is Chairman of RQS Capital Limited; Ying Deng is a Director of RQS Capital Limited.\n(4) Does not include 8,000,000 shares of common stock issuable upon conversion of 80,000 shares of Series A Preferred Stock. Item 13. Certain Relationships and Related Transactions and Director Independence\nRelated Party Transactions\nOn January 27, 2023 Tianci sold 80,000 shares of Series A Preferred Stock to RQS Capital Limited. The shares were sold for a cash payment of $24,000, which was contributed to Tiancis capital on behalf of RQS Capital Limited by members of its management. Shufang Gao, a member of Tiancis Board of Directors, is the principal owner of RQS Capital.\nSee the description in Item 1 above regarding the Share Exchange between Tianci and RQS Capital Limited on March 6, 2023.\nAs of July 31, 2023, Roshing was indebted to Zhigang Pei in the amount of $220,909 and to Ying Deng in the amount of $53,035, representing amounts they have advanced to fund Roshings operations. The loans are not interest-bearing and are due on demand.\nExcept as described above, there have been no transactions since August 1, 2022, or any currently proposed transaction, in which Tianci, RQS United or Roshing was or are to be a participant and the amount involved exceeded or exceeds the lesser of $120,000 or one percent of the average of the total assets of Tianci at year-end for the last two completed fiscal years, and in which any related person had or will have a direct or indirect material interest.\nReview, approval or ratification of transactions with related persons\nWe do not have any special committee, policy or procedure related to the review, approval or ratification of related party transactions.\nDirector Independence\nThe Board of Directors has determined that Jack Fan Liu and Yee ManYung are the only members of our Board of Directors who are independent, as independent is defined in the rules of the NYSE American. Item 14. Principal Accountant Fees and Services\nThe Share Exchange between Tianci and RQS United described in Item 1 of this Report has been accounted for as a reverse acquisition effected as a recapitalization, wherein RQS United was considered the acquirer for accounting and financial reporting purposes. Accordingly, Michael T. Studer CPA P.C., which served as the independent auditor of the financial statements of RQS United for the year ended July 31, 2022, has audited the financial statements of Tianci for the years ended July 31, 2023 and 2022 that are included in this Report.\nAudit Fees\nMichael T. Studer CPA P.C. billed $30,000 in connection with the audit of the Company's financial statements for the year ended July 31, 2023. Michael T. Studer CPA P.C. billed $50,000 in connection with the audit of the Company's financial statements for the year ended July 31, 2022.\nAudit-Related Fees\nMichael T. Studer CPA P.C. did not bill the Company for any Audit-Related fees in fiscal 2023 or 2022.\nTax Fees\nMichael T. Studer CPA P.C. did not bill the Company for professional services rendered for tax compliance, tax advice and tax planning in fiscal 2023. Michael T. Studer CPA P.C. did not bill the Company for any professional services rendered for tax compliance, tax advice and tax planning in fiscal 2022.\nAll Other Fees\nMichael T. Studer CPA P.C. did not bill the Company for any other fees in fiscal 2023 or 2022.\nIt is the policy of the Company that all services, other than audit, review or attest services, must be pre-approved by the Board of Directors. Item 15. Exhibits and Financial Statement Schedules\nExhibits\n3.1(a) Articles of Incorporation of Tianci International, Inc.(1)\n3.1(b) Articles of Amendment of Articles of Incorporation of Tianci International, Inc.(2)\n3.2 Bylaws(1)\n10.1 Employment Agreement dated August 27, 2021 between Zhigang Pei and Tianci International, Inc.(3)\n10.2 Employment Agreement dated August 27, 2021 between Shufang Gao and Tianci International, Inc.(3)\n10.3 Employment Agreement dated August 27, 2021 between Wei Fang and Tianci International, Inc.(3)\n10.4 Employment Agreement dated January 23, 2023 between Ying Deng and Tianci International Inc.\nSubsidiaries\n31.1 Rule 13a-14(a) Certification of Principal Executive and Financial Officer\n32.1 Rule 13a-14(b) Certification of Principal Executive and Financial Officer\n101.INS Inline XBRL Instance Document\n101.SCH Inline XBRL Taxonomy Extension Schema Document\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL) and contained in Exhibit 101\n(1)\nFiled as an exhibit to the Registration Statement on Form S-1 filed on September 24, 2012 and incorporated herein by reference.\n(2)\nFiled as Appendix A to the Definitive Information Statement on Schedule 14C filed on June 11, 2015 and incorporated herein by reference.\n(3)\nFiled as an exhibit to the Annual Report on Form 10-K for the year ended July 31, 2022 and incorporated herein by reference.\nItem 16. Form 10-K Summary\nNone.\nSUPPLEMENTAL INFORMATION TO BE FURNISHED WITH REPORTS FILED PURSUANT TO SECTION 15(d) OF THE ACT BY REGISTRANTS WHICH HAVE NOT REGISTERED SECURITIES PURSUANT TO SECTION 12 OF THE ACT.\nTianci International, Inc. did not send any annual report to security holders covering the fiscal year ended July 31, 2023 nor did it send any form of proxy or proxy soliciting material.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the Registrant has caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTIANCI INTERNATIONAL, INC.\nDate: October 20, 2023 /s/ Shufang Gao\nBy: Shufang Gao\nTitle: Chief Executive, Financial and Accounting Officer\nIn accordance with the Exchange Act, this Report has been signed below on October 20, 2023 by the following persons, on behalf of the Registrant and in the capacities and on the dates indicated.\n/s/ Shufang Gao\nShufang Gao, Director,\nChief Executive Officer, Chief Financial Officer\n/s/ Zhigang Pei\nZhigang Pei, Chairman of the Board\n/s/ Ying Deng\nYing Deng, Director\n/s/ David Wei Fang\nDavid Wei Fang, Director\n/s/ Jack Fan Liu\nJack Fan Liu, Director\n/s/ Yee Man Yung\nYee Man Yung, Director"
}