{
    "cik": "1569083",
    "company": "MAKINGORG, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-10-11",
    "period_of_report": "2022-12-31",
    "sic": "3751",
    "state_of_inc": "NV",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1569083/0001640334-23-001799-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1569083/000164033423001799/cqcq_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1569083/0001640334-23-001799.txt",
    "filename": "1569083_10K_2022_0001640334-23-001799.htm",
    "content": "Item 1. Business.\nAs used in this Annual Report on Form 10-K (this Report), references to the Company, the Company, we, our or us refer to MakingORG, Inc., unless the context otherwise indicates.\nForward-Looking Statements\nCertain statements contained in this report, including statements regarding our business, financial condition, our intent, belief or current expectations, primarily with respect to the future operating performance of the Company and other statements contained herein regarding matters that are not historical facts, are forward-looking statements. You can identify forward-looking statements by those that are not historical in nature, particularly those that use terminology such as may, will, should, expects, anticipates, contemplates, estimates, believes, plans, projected, predicts, potential, or continue or the negative of these similar terms. Future filings with the Securities and Exchange Commission, future press releases and future oral or written statements made by us or with our approval, which are not statements of historical fact, may contain forward-looking statements. Because such statements include risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements.\nAll forward-looking statements speak only as of the date on which they are made. We undertake no obligation to update such statements to reflect events that occur or circumstances that exist after the date on which they are made, except as required by federal securities and any other applicable law.\nOverview\nThe Company was incorporated in the State of Nevada on August 10, 2012 to be in the power sports business.\nOn July 29, 2014, Vladimir Nedrygaylo, the principal shareholder of Drimex Inc. consummated the transactions contemplated by the Stock Purchase Agreement dated as of June 24, 2014 which provided for the sale of 5,000,000 shares of common stock (not adjusted for the forward split described below) of the Company (the Shares) to Juanzi Cui. The consideration paid for the Shares, which represented 84.7% of the issued and outstanding share capital of the Company on a fully-diluted basis, was $325,000. The source of the cash consideration for the Shares was the personal funds of Mrs. Cui. In connection with the transaction, Mr. Nedrygaylo released the Company from all debts owed to him. Ms. Cui became the Companys sole officer and director.\nOn August 22, 2014, the Company amended and restated Articles of Incorporation, changed the name of the Company from Drimex, Inc. to MakingORG, Inc. and increased the amount of authorized shares of common stock from 75,000,000 to 150,000,000, with a par value of $0.001 per share.\nEffective August 22, 2014, the Company effected a 6 for 1 forward split on its common stock outstanding in the form of a dividend, under which each stockholder of record on that date received 5 additional shares of the Corporations $0.001 par value common stock for every 1 share owned. All share and per share amounts presented in this Annual Report and the financial statements and notes thereto have been adjusted for the stock split.\nOn September 1, 2016, the Company entered into a Convertible Note Agreement in the principal amount of $200,000 with an unrelated party. The note bears interest at 12% per annum and the holder is able to convert all unpaid interest and principal into common shares at $3.50 per share. The note matures on September 1, 2018. The Company recognized a discount on the note of $38,857 at the agreement date. The interest expense was due every six months commencing of March 1, 2017 until the principal amount of this convertible note was paid in full.\nOn September 1, 2018, the Company entered into an Amended and Restated 12% Convertible Promissory Note. Pursuant to an Amended and Restated 12% Convertible Promissory Note, both parties agreed to extend a Convertible Note Agreement to September 1, 2019 with no additional consideration.\nOn September 1, 2019, the Company entered into an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2020 with no additional consideration. The Company recognized a discount on the note of $54,400 at the amended agreement date. Since the conversion feature of conventional convertible debt provides for a rate of conversion that is below market value, this feature is characterized as a beneficial conversion feature (BCF). A BCF is recorded by the Company as a debt discount pursuant to ASC Topic 470-20 Debt with Conversion and Other Options. In those circumstances, the convertible debt is recorded net of the discount related to the BCF and the Company amortizes the discount to interest expense over the life of the debt using the effective interest method.\nOn October 20, 2017, the Company filed documents registering their intention to transact interstate business in the state of California in the United States. Juanzi Cui, who took control of the Company as described above, intended that the Company open a line of organic food stores or stores-in-stores within the Asian communities in the United States.\nOn November 29, 2016, the Company incorporated HK Feng Wang Group Limited (HKFW) under the laws of Hong Kong. On August 22, 2017, HKFW incorporated Chongqing Beauty Kenner Biotechnology Co., Ltd (CBKB) under the laws of the Peoples Republic of China (PRC).\nThe Company and its subsidiaries purchase Acer truncatum bunge seed oil from China, outsource to third parties to manufacture Acer truncatum bunge related health product, and sell to end users and distributors in the United States and PRC.\nCBKB entered into a Strategic Cooperation Framework Agreement with Hangzhou Life Century Hualian Supermarket Chain Co., Ltd. (HLCH), dated May 25, 2018, pursuant to which the Company agreed to assist HLCH in identifying brand-specific, high tech characteristics products, such as acer truncatum nervonic acid oil, acer truncatum seed oil capsule, acer truncatum edible oil, acer truncatum oil with nervonic acid formula, acer truncatum coffe, acer truncatum tea, canned acer truncatum, acer truncatum cosmetics, acer truncatum skin care products, hair wash products and acer trunncatrum food. At such time, the Company ceased being a shell company.\nCompetition\nThe Company is an insignificant participant among firms which engage in business combinations with development stage enterprises. There are many established management and financial consulting companies and venture capital firms which have significantly greater financial and personnel resources, technical expertise and experience than the Company. In view of the Companys limited financial resources and management availability, the Company will continue to be at a significant competitive disadvantage vis-a-vis the Companys competitors.\nRegulation and Taxation\nThe Investment Company Act of 1940 defines an investment company as an issuer which is or holds itself out as being engaged primarily in the business of investing, reinvesting or trading of securities. While the Company does not intend to engage in such activities, the Company could become subject to regulation under the Investment Company Act of 1940 in the event the Company obtains or continues to hold a minority interest in a number of development stage enterprises. The Company could be expected to incur significant registration and compliance costs if required to register under the Investment Company Act of 1940. Accordingly, management will continue to review the Companys activities from time to time with a view toward reducing the likelihood the Company could be classified as an investment company.\nThe Company intends to structure a merger or acquisition in such manner as to minimize Federal and state tax consequences to the Company and to any target company.\nEmployees\nThe Company currently has two full-time employees. All functions including development, strategy, negotiations and administration are currently being provided by Mrs. Cui, our sole executive officer and director, on a voluntary basis. Item 1A. Risk Factors\nRisk Factor Summary\nThe following are some material risks, any of which could have an adverse effect on our business financial condition, operating results, or prospects.\n·\nRisks Relating to Doing Business in China\no\nChanges in Chinas economic, political or social conditions or government policies could have a material adverse effect on our business and operations;\no\nOur profitability may be seriously affected by fluctuations in exchange rates between the Renminbi and the U.S. dollar;\no\nGovernmental control of currency conversion may limit our ability to use our revenues effectively and our ability to obtain financing;\no\nAdverse changes in political, economic and other policies of the Chinese government could have a material adverse effect on the overall economic growth of China, which could materially and adversely affect the growth of our business and our competitive position;\no\nUncertainties with respect to the PRC legal system could have a material adverse effect on us;\no\nSince our operations and assets are located in China, shareholders may find it difficult to enforce a U.S. judgement against the assets of our Company, our directors and executive officers.\nChanges in Chinas economic, political or social conditions or government policies could have a material adverse effect on our business and operations.\nSubstantially all of our assets and operations are located in China. Accordingly, our business, financial condition, results of operations and prospects may be influenced to a significant degree by political, economic and social conditions in China generally. The Chinese economy differs from the economies of most developed countries in many respects, including the level of government involvement, level of development, growth rate, control of foreign exchange and allocation of resources. Although the Chinese government has implemented measures emphasizing the utilization of market forces for economic reform, the reduction of state ownership of productive assets, and the establishment of improved corporate governance in business enterprises, a substantial portion of productive assets in China is still owned by the government. In addition, the Chinese government continues to play a significant role in regulating industry development by imposing industrial policies. The Chinese government also exercises significant control over Chinas economic growth through allocating resources, controlling payment of foreign currency-denominated obligations, setting monetary policy and providing preferential treatment to particular industries or companies.\nWhile the Chinese economy has experienced significant growth over past decades, growth has been uneven, both geographically and among various sectors of the economy. Any adverse changes in economic conditions in China, in the policies of the Chinese government or in the laws and regulations in China could have a material adverse effect on the overall economic growth of China. Such developments could adversely affect our business and operating results, lead to a reduction in demand for our products and adversely affect our competitive position. The Chinese government has implemented various measures to encourage economic growth and guide the allocation of resources. Some of these measures may benefit the overall Chinese economy, but may have a negative effect on us. For example, our financial condition and results of operations may be adversely affected by government control over capital investments or changes in tax regulations. In addition, in the past the Chinese government has implemented certain measures, including interest rate adjustment, to control the pace of economic growth. These measures may cause decreased economic activity in China, which may adversely affect our business and operating results.\nOur profitability may be seriously affected by fluctuations in exchange rates between the Renminbi and the U.S. dollar.\nAll of our revenue is denominated in Renminbi while our financial reporting is in U.S. dollars. As a result, any significant fluctuation in exchange rates may cause us to incur currency exchange translation and harm our financial condition and results of operations.\nMovements in Renminbi exchange rates are affected by, among other things, changes in political and economic conditions and Chinas foreign exchange regime and policy. The Renminbi has been unpegged from the U.S. dollar since July 2005 and, although the Peoples Bank of China regularly intervenes in the foreign exchange market to limit fluctuations in Renminbi exchange rates, the Renminbi may appreciate or depreciate significantly in value against the U.S. dollar in the medium to long term. Moreover, it is possible that the PRC authorities may lift restrictions on fluctuations in Renminbi exchange rates and lessen intervention in the foreign exchange market in the future.\nTo date, we have not entered into any hedging transactions in an effort to reduce our exposure to foreign currency exchange risk. While we may decide to enter into hedging transactions in the future, the availability and effectiveness of these hedges may be limited and we may not be able to adequately hedge our exposure or at all.\nGovernmental control of currency conversion may limit our ability to use our revenues effectively and our ability to obtain financing.\nThe PRC government imposes control on the convertibility of the Renminbi into foreign currencies and, in certain cases, the remittance of currency out of China. We receive all our revenues in Renminbi, which currently is not a freely convertible currency. Restrictions on currency conversion imposed by the PRC government may limit our ability to use revenues generated in Renminbi to fund our expenditures denominated in foreign currencies or our business activities outside China. Under Chinas existing foreign exchange regulations, Renminbi may be freely converted into foreign currency for payments relating to current account transactions, which include among other things dividend payments and payments for the import of goods and services, by complying with certain procedural requirements.\nAdverse changes in political, economic and other policies of the Chinese government could have a material adverse effect on the overall economic growth of China, which could materially and adversely affect the growth of our business and our competitive position.\nAll of our business operations are conducted in China. Accordingly, our business, financial condition, results of operations and prospects are affected significantly by economic, political and legal developments in China. Although the PRC economy has been transitioning from a planned economy to a more market-oriented economy since the late 1970s, the PRC government continues to exercise significant control over Chinas economic growth through direct allocation of resources, monetary and tax policies, and a host of other government policies such as those that encourage or restrict investment in certain industries by foreign investors, control the exchange between the Renminbi and foreign currencies, and regulate the growth of the general or specific market. While the Chinese economy has experienced significant growth in the past 30 years, growth has been uneven, both geographically and among various sectors of the economy. As the PRC economy has become increasingly linked with the global economy, China is affected in various respects by downturns and recessions of major economies around the world. The various economic and policy measures enacted by the PRC government to forestall economic downturns or bolster Chinas economic growth could materially affect our business. Any adverse change in the economic conditions in China, in policies of the PRC government or in laws and regulations in China could have a material adverse effect on the overall economic growth of China and market demand for our outsourcing services. Such developments could adversely affect our businesses, lead to a reduction in demand for our services and adversely affect our competitive position.\nUncertainties with respect to the PRC legal system could have a material adverse effect on us.\nThe PRC legal system is based on written statutes. Prior court decisions may be cited for reference but have limited precedential value. Since the late 1970s, the PRC government has been building a comprehensive system of laws and regulations governing economic matters in general. The overall effect has been to significantly enhance the protections afforded to various forms of foreign investments in China. We conduct our business primarily through our WFOE, the VIE and its subsidiaries established in China. These companies are generally subject to laws and regulations applicable to foreign investment in China. However, since these laws and regulations are relatively new and the PRC legal system continues to rapidly evolve, the interpretations of many laws, regulations and rules are not always uniform and enforcement of these laws, regulations and rules involves uncertainties, which may limit legal protections available to us. In addition, some regulatory requirements issued by certain PRC government authorities may not be consistently applied by other government authorities (including local government authorities), thus making strict compliance with all regulatory requirements impractical, or in some circumstances impossible. For example, we may have to resort to administrative and court proceedings to enforce the legal protection that we enjoy either by law or contract. However, since PRC administrative and court authorities have discretion in interpreting and implementing statutory and contractual terms, it may be more difficult to predict the outcome of administrative and court proceedings and the level of legal protection we enjoy than in more developed legal systems. These uncertainties may impede our ability to enforce the contracts we have entered into with our business partners, clients and suppliers. In addition, such uncertainties, including any inability to enforce our contracts, together with any development or interpretation of PRC law that is adverse to us, could materially and adversely affect our business and operations. Furthermore, intellectual property rights and confidentiality protections in China may not be as effective as in the United States or other more developed countries. We cannot predict the effect of future developments in the PRC legal system, including the promulgation of new laws, changes to existing laws or the interpretation or enforcement thereof, or the preemption of local regulations by national laws. These uncertainties could limit the legal protections available to us and other foreign investors, including you. In addition, any litigation in China may be protracted and result in substantial costs and diversion of our resources and management attention.\nSince our operations and assets are located in China, shareholders may find it difficult to enforce a U.S. judgement against the assets of our Company, our directors and executive officers.\nOur operation and assets are located in China. In addition, our executive officers and directors are non-residents of the U.S., and substantially all the assets of such persons are located outside the U.S. As a result, it could be difficult for investors to effect service of process in the U.S., or to enforce a judgment obtained in the U.S. against us or any of our officers or directors. Item 1B. Unresolved Staff s\nNone Item 2. Properties\nThe Company signed a lease agreement with a related party in China in June 2020, an entity in which CBKBs supervisor is a shareholder. It calls for a monthly rent of RMB40,000 (approximately $6,200). The lease was for one year and was subject to renewal at the Companys discretion. This lease was classified as operating at inception of the lease. Operating leases result in the recognition of ROU assets and lease liabilities on the balance sheet. ROU assets and operating lease liabilities are recognized based on the present value of lease payments over the lease terms of the commencement date. The leases did not provide an explicit or implicit rate of return, the Company determined incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments on an individual lease basis. The incremental borrowing rate for lease was the rate of interest the Company would have to pay on a collateralized basis to borrow an amount equal to the lease payments for the asset under similar term, which is 5.25%. The lease does not contain any residual value guarantees or material restrictive covenants. The Company keeps leasing the property month by month after the lease term ended. Therefore, based on the lease agreement, we did the recognition of right-of-use (ROU) assets and lease liabilities on the balance sheet. Refer to Note 8 - Lease for details. The Company currently has no finance leases. Item 3. Legal Proceedings\nThere is no pending legal proceeding to which the Company is a party or in which any director, officer or affiliate of the Company, any owner of record or beneficially of more than 5% of any class of voting securities of the Company, or security holder is a party adverse to the Company or has a material interest adverse to the Company. The Companys property is not the subject of any pending legal proceedings. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Companys Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOn April 8, 2014, the Company became listed on the OTCQB under the symbol DRIM. As of August 25, 2014, the trading symbol of the Company became CQCQ. The Company is now quoted on the OTC Pink Sheets. The high and low sales prices as reported on the OTC as of the end of each quarter commencing on January 1, 2021 through December 31, 2021 was $4.20 to $0.75. The quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission, and may not represent actual transactions.\nThe last reported sales price of our common stock on the OTC Markets on October 9, 2023, was $0.75\nDividend Policy\nWe have not declared or paid dividends on our common stock since our formation, and we do not anticipate paying dividends in the foreseeable future. Declaration or payment of dividends, if any, in the future, will be at the discretion of our Board of Directors and will depend on our then current financial condition, results of operations, capital requirements and other factors deemed relevant by the Board of Directors. There are no contractual restrictions on our ability to declare or pay dividends.\nHolders\nAs of September 30, 2023, there were 35,540,000 shares of common stock issued and outstanding, which were held by 312 stockholders of record.\nEquity Compensation Plans\nCurrently the Company does not have any equity compensation plan.\nRecent Sales of Unregistered Securities; Use of Proceeds from Registered Securities\nOn September 1, 2016, the Company entered into a Convertible Note Agreement in the principal amount of $200,000 with an unrelated party. The note bears interest at 12% per annum and the holder is able to convert all unpaid interest and principal into common shares at $3.50 per share. The note matures on September 1, 2018. The Company recognized a discount on the note of $38,857 on the agreement date. The interest expense was due every six months commencing on March 1, 2017 until the principal amount of this convertible note is paid in full.\nOn September 1, 2018, the Company entered into an Amended and Restated 12% Convertible Promissory Note. Pursuant to an Amended and Restated 12% Convertible Promissory Note, both parties agreed to extend a Convertible Note Agreement to September 1, 2019 with no additional consideration.\nOn September 1, 2019, the Company entered into an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2020 with no additional consideration. The Company recognized a discount on the note of $54,400 at the amended agreement date. Since the conversion feature of conventional convertible debt provides for a rate of conversion that is below market value, this feature is characterized as a BCF. A BCF is recorded by the Company as a debt discount pursuant to ASC Topic 470-20 Debt with Conversion and Other Options. In those circumstances, the convertible debt is recorded net of the discount related to the BCF and the Company amortizes the discount to interest expense over the life of the debt using the effective interest method.\nOn September 1, 2020, the Company entered an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2022 with no additional consideration. The Company recognized a discount on the note of $0 at the amended agreement date.\nOn September 1, 2022, the Company signed an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2024 with no additional consideration. No discount is recognized at the amended agreement date.\nThe Company incurred interest expense related to the convertible note of $24,000 and $24,000 for the years ended December 31, 2022 and 2021, respectively. No unamortized debt discount as of December 31, 2022 and 2021, respectively. As of December 31, 2022, and 2021, net balance of the convertible note amounted to $200,000 and $200,000, respectively.\nPurchases of Equity Securities by the Small Business Issuer and Affiliated Purchasers\nNone. Item 6. Selected Financial Data.\nSmaller reporting companies are not required to provide the information required by this Item 6. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion should be read in conjunction with the Companys consolidated financial statements, which are included elsewhere in this Form 10-K.\nOverview\nMakingORG, Inc. (MakingORG) was incorporated under the laws of the State of Nevada on August 10, 2012. The trading symbol of the Company is CQCQ and the fiscal year end is December 31. On October 20, 2016, MakingORG filed documents registering its intention to transact interstate business in the state of California. On November 29, 2016, MakingORG incorporated HK Feng Wang Group Limited (HKFW) under the laws of Hong Kong. On August 22, 2017, HKFW incorporated Chongqing Beauty Kenner Biotechnology Co., Ltd (CBKB) under the laws of the Peoples Republic of China (PRC).\nOn November 29, 2016, the Company incorporated HK Feng Wang Group Limited (HKFW) under the laws of Hong Kong. On August 22, 2017, HKFW incorporated Chongqing Beauty Kenner Biotechnology Co., Ltd (CBKB) under the laws of the Peoples Republic of China (PRC).\nThe Company and its subsidiaries purchase Acer truncatum bunge seed oil from China, outsource to third parties to manufacture Acer truncatum bunge related health product, and sell to distributors in PRC.\nCBKB entered into a Strategic Cooperation Framework Agreement with Hangzhou Life Century Hualian Supermarket Chain Co., Ltd. (HLCH), dated May 25, 2018, pursuant to which the Company agreed to assist HLCH in identifying brand-specific, high tech characteristics products, such as acer truncatum nervonic acid oil, acer truncatum seed oil capsule, acer truncatum edible oil, acer truncatum oil with nervonic acid formula, acer truncatum coffe, acer truncatum tea, canned acer truncatum, acer truncatum cosmetics, acer truncatum skin care products, hair wash products and acer trunncatrum food. This agreement did not continue due to HLCH did not operating well in the year 2019.\nIn December 2019, a novel strain of coronavirus (COVID-19) emerged in Wuhan, Hubei Province, China. While initially the outbreak was largely concentrated in China and caused significant disruptions to its economy, it has now spread to several other countries and infections have been reported globally. China governmental authorities have issued stay-at-home orders, proclamations and/or directives aimed at minimizing the spread of COVID-19. As a result, the Company closed its China operations from the end of January 2020 to the end of March 2020.\nThe ultimate impact of the COVID-19 pandemic on the Companys operations is still unknown and will depend on future developments, which are highly uncertain and cannot be predicted with confidence, including the duration of the COVID-19 outbreak, new information which may emerge concerning the severity of the COVID-19 pandemic, and any additional preventative and protective actions that governments, or the Company, may direct, which may result in an extended period of continued business disruption, reduced customer traffic and reduced operations. Any resulting financial impact cannot be reasonably estimated at this time but is anticipated to have a material adverse impact on our business, financial condition and results of operations.\nPlan of Operation\nOur sole officer and director intends to sell Acer truncatum bunge related health product in the United States and PRC, we might just identify and negotiate with another company for the business combination or merger of that entity with and into our company. We would seek, investigate and, if such investigation warrants, acquire an interest in one or more business opportunities presented to it by persons or firms who or which desire to seek the perceived advantages of a publicly held corporation. At this time, we have no plan, proposal, agreement, understanding or arrangement to acquire or merge with any specific business or company, and the Company has not identified any specific business or company for investigation and evaluation. No member of management or promoter of the Company has had any material discussions with any other company with respect to any acquisition of that company.\nWe will not restrict our search for another target company to any specific business, industry or geographical location, and the Company may participate in a business venture of virtually any kind or nature. The discussion of the proposed plan of operation under this caption and throughout this Annual Report is purposefully general and is not meant to be restrictive of the Companys virtually unlimited discretion to search for and enter into potential business opportunities.\nThe extent of the impact of COVID-19 on our business and financial results will depend on future developments, including the duration and spread of the outbreak within the markets in which we operate, the related impact on our customers and suppliers and the possibility of an economic recession after the virus has subsided, all of which are highly uncertain and ever-changing. Any of these factors could materially increase our costs, negatively impact our sales and damage our results of operations and liquidity. The severity and duration of any such impacts, including after the virus has subsided, cannot be predicted.\nSources of Opportunities\nThe Company anticipates that business opportunities for possible acquisition will be referred by various sources, including its officers and directors, professional advisers, securities broker-dealers, venture capitalists, members of the financial community, and others who may present unsolicited proposals.\nThe Company will seek a potential business opportunity from all known sources but will rely principally on personal contacts of its officer and director and consultants as well as indirect associations between them and other business and professional people. It is not presently anticipated that the Company will engage professional firms specializing in business acquisitions or reorganizations.\nEvaluation of Opportunities\nThe analysis of new business opportunities will be undertaken by or under the supervision of the officer and director of the Company. Management intends to concentrate on identifying prospective business opportunities which may be brought to its attention through present associations with management. In analyzing prospective business opportunities, management will consider such matters as the available technical, financial and managerial resources; working capital and other financial requirements; history of operation, if any; prospects for the future; present and expected competition; the quality and experience of management services which may be available and the depth of that management; the potential for further research, development or exploration; specific risk factors not now foreseeable but which then may be anticipated to impact the proposed activities of the Company; the potential for growth or expansion; the potential for profit; the perceived public recognition or acceptance of products, services or trades; name identification; and other relevant factors. The officer and director of the Company will meet personally with management and key personnel of the firm sponsoring the business opportunity as part of her investigation. To the extent possible, the Company intends to utilize written reports and personal investigation to evaluate the above factors. The Company will not acquire or merge with any company for which audited consolidated financial statements cannot be obtained.\nIt may be anticipated that any opportunity in which the Company participates will present certain risks. Many of these risks cannot be adequately identified prior to selection of the specific opportunity, and the Companys stockholders must, therefore, depend on the ability of management to identify and evaluate such risk. In the case of some of the opportunities available to the Company, it may be anticipated that the promoters thereof have been unable to develop a going concern or that such business is in its development stage in that it has not generated significant revenues from its principal business activities prior to the Companys anticipation. There is a risk, even after the Companys participation in the activity and the related expenditure of the Companys funds that the combined enterprises will still be unable to become a going concern or advance beyond the development stage. Many of the opportunities may involve new and untested products, processes, or market strategies which may not succeed. Such risks will be assumed by the Company and, therefore, its stockholders.\nThe Company will not restrict its search for any specific kind of business but may acquire a venture which is in its preliminary or development stage, which is already in operation, or in essentially any stage of its corporate life. It is currently impossible to predict the status of any business in which the Company may become engaged, in that such business may need additional capital, may merely desire to have its shares publicly traded, or may seek other perceived advantages which the Company may offer.\nAcquisition of Opportunities\nIn implementing a structure for a particular business acquisition, the Company may become a party to a merger, consolidation, reorganization, joint venture, franchise or licensing agreement with another corporation or entity. It may also purchase stock or assets of an existing business. On the consummation of a transaction, it is possible that the present management and shareholders of the Company will not be in control of the Company. In addition, the Companys officer and director may, as part of the terms of the acquisition transaction, resign and be replaced by new officers and directors without a vote of the Companys stockholders.\nIt is anticipated that any securities issued in any such reorganization would be issued in reliance on exemptions from registration under applicable Federal and state securities laws. In some circumstances, however, as a negotiated element of this transaction, the Company may agree to register such securities either at the time the transaction is consummated, under certain conditions, or at specified time thereafter. The issuance of substantial additional securities and their potential sale into any trading market which may develop in the Companys common stock may have a depressive effect on such a market. While the actual terms of a transaction to which the Company may be a party cannot be predicted, it may be expected that the parties to the business transaction will find it desirable to avoid the creation of a taxable event and thereby structure the acquisition in a so called tax free reorganization under Sections 368(a) (1) or 351 of the Internal Revenue Code of 1986, as amended (the Code). In order to obtain tax free treatment under the Code, it may be necessary for the owners of the acquired business to own 80% or more of the voting stock of the surviving entity. In such event, the shareholders of the Company, including investors in this offering, would retain less than 20% of the issued and outstanding shares of the surviving entity, which could result in significant dilution in the equity of such shareholders.\nAs part of the Companys investigation, the officer and director of the Company will meet personally with management and key personnel, may visit and inspect material facilities, obtain independent analysis or verification of certain information provided, check references of management and key personnel, and take other reasonable investigative measures, to the extent of the Companys limited financial resources and management expertise.\nThe manner in which each Company participates in an opportunity will depend on the nature of the opportunity, the respective needs and desires of the Company and other parties, the management of the opportunity, and the relative negotiating strength of the Company and such other management.\nWith respect to any mergers or acquisitions, negotiations with target company management will be expected to focus on the percentage of the Company which target company shareholders would acquire in exchange for their stockholdings in the target company. Depending upon, among other things, the target companys assets and liabilities, the Companys stockholders will in all likelihood hold a lesser percentage ownership interest in the Company following any merger or acquisition. The percentage ownership may be subject to significant reduction in the event the Company acquires a target company with substantial assets. Any merger or acquisition affected by the Company can be expected to have a significant dilutive effect on the percentage of shares held by the Companys then stockholders.\nThe Company will not have sufficient funds (unless it is able to raise funds in a private placement) to undertake any significant development, marketing and manufacturing of any products which may be acquired.\nAccordingly, following the acquisition of any such product, the Company will, in all likelihood, be required to either seek debt or equity financing or obtain funding from third parties, in exchange for which the Company would probably be required to give up a substantial portion of its interest in any acquired product. There is no assurance that the Company will be able either to obtain additional financing or interest third parties in providing funding for the further development, marketing and manufacturing of any products acquired.\nIt is anticipated that the investigation of specific business opportunities and the negotiation, drafting and execution of relevant agreements, disclosure documents and other instruments will require substantial management time and attention and substantial costs for accountants, attorneys and others. If a decision is made not to participate in a specific business opportunity the costs therefore incurred in the related investigation would not be recoverable.\nFurthermore, even if an agreement is reached for the participation in a specific business opportunity, the failure to consummate that transaction may result in a loss to the Company of the related costs incurred.\nManagement believes that the Company may be able to benefit from the use of leverage in the acquisition of a business opportunity. Leveraging a transaction involves the acquisition of a business through incurring significant indebtedness for a large percentage of the purchase price for that business.\nThrough a leveraged transaction, the Company would be required to use less of its available funds for acquiring the business opportunity and, therefore, could commit those funds to the operations of the business opportunity, to acquisition of other business opportunities or to other activities. The borrowing involved in a leveraged transaction would ordinarily be secured by the assets of the business opportunity to be acquired. If the business opportunity acquired is not able to generate sufficient revenues to make payments on the debt incurred by the Company to acquire that business opportunity, the lender would be able to exercise the remedies provided by law or by contract. These leveraging techniques, while reducing the amount of funds that the Company must commit to acquiring a business opportunity, may correspondingly increase the risk of loss to the Company. No assurance can be given as to the terms or the availability of financing for any acquisition by the Company. During periods when interest rates are relatively high, the benefits of leveraging are not as great as during periods of lower interest rates because the investment in the business opportunity held on a leveraged basis will only be profitable if it generates sufficient revenues to cover the related debt and other costs of the financing. Lenders from which the Company may obtain funds for the purposes of a leveraged buy-out may impose restrictions on the future borrowing, distribution, and operating policies of the Company. It is not possible at this time to predict the restrictions, if any, which lenders may impose or the impact thereof on the Company.\nCritical Accounting Policies and Estimates\nRevenue Recognition\nThe Company adopted Topic 606, Revenue from Contracts with Customers, using the modified retrospective transition method on January 1, 2018. In general, the Companys performance obligation is to transfer it products to its end user or distributor. Revenues from product sales are recognized when the customer obtains control of the Companys finished goods product, which occurs at a point in time, typically upon delivery to the customer.\nThe Companys revenue mainly generates from the sale of acer truncatum bunge related health products, such as Nervonic Acid Oil, coffee and tea. The Company evaluates its product sales contracts and determines that those contracts are generally capable of being distinct and accounted for as separate performance obligations. Performance obligation is satisfied when the finished goods product delivered to the customer.\nForeign Currency Transactions\nThe functional currency for MakingORG and HKFW is US dollar. The functional currency for the China subsidiary (CBKB) is the Renminbi (RMB). Assets and liabilities of the China operation are translated from RMB into U.S. dollars at period-end rates, while the statements of operations and cash flows are translated at the weighted-average exchange rates for the period. The related translation adjustments are reflected as a foreign currency translation adjustment in accumulated other comprehensive income/(loss) within shareholders deficit.\nThe Company translates the assets and liabilities into U.S. dollars using the rate of exchange prevailing at the balance sheet date and the statements of operations and cash flows are translated at an average rate during the reporting period. Adjustments resulting from the translation from RMB into U.S. dollars are recorded in stockholders equity as part of accumulated other comprehensive income. The exchange rates used for financial statements are as follows:\nAverage Rate for the Twelve\nMonths Ended December 31,\nChina yuan (RMB)\nRMB\n6.728489\nRMB\n6.452480\nUnited States dollar ($)\n$ 1.000000\n$ 1.000000\nExchange Rate at\nDecember 31,\nDecember 31,\nChina yuan (RMB)\nRMB\n6.909062\nRMB\n6.355095\nUnited States dollar ($)\n$\n1.000000\n$\n1.000000\nLEASE\nThe Company adopted ASC 842 on January 1, 2019. The Company entered an operating lease for its China office with Entity A with monthly rent of RMB40,000 (approximately $5,800). The lease was for one year and the Company has priority to renew it. The Company intended to renew the lease. Leases were classified as operating at the inception of the lease. Operating leases result in the recognition of ROU assets and lease liabilities on the balance sheet. ROU assets and operating lease liabilities are recognized based on the present value of lease payments over the lease terms of the commencement date. Because the leases do not provide an explicit or implicit rate of return, the Company determines incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments on an individual lease basis. The incremental borrowing rate for a lease is the rate of interest the Company would have to pay on a collateralized basis to borrow an amount equal to the lease payments for the asset under a similar term, which is 5.25%. The lease does not contain any residual value guarantees or material restrictive covenants. The remaining term including the renewal term as of September 30, 2021 was 8 months. The Company has no finance lease.\nOn March 1, 2022, the Company entered into a new lease agreement with Entity A for the one-year term from March 1, 2022 to February 28, 2023. The lease was classified as an operating lease at inception, and results in the recognition of ROU assets and lease liabilities on the balance sheet. ROU assets and operating lease liabilities are recognized based on the present value of lease payments over the lease terms of the commencement date. Because the leases do not provide an explicit or implicit rate of return, the Company determines incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments on an individual lease basis. The incremental borrowing rate for a lease is the rate of interest the Company would have to pay on a collateralized basis to borrow an amount equal to the lease payments for the asset under a similar term, which is 5.25%. The lease does not contain any residual value guarantees or material restrictive covenants.\nThe components of lease expense consist of the following:\nYears Ended December 31,\nClassification\nOperating lease cost\nSelling, General & Administrative expenses\n$\n18,873\n$\n70,848\nBalance sheet information related to leases consists of the following:\nClassification\nDecember 31,\nDecember 31,\nAssets\nOperating lease ROU assets\nRight-of-use assets\n$\n24,587\n$\n31,171\nLiabilities\nOperating lease liabilities\nCurrent portion\n$\n23,681\n$\n31,171\nOperating lease liabilities\nLong-term portion\n5,501\n-\nTotal lease liabilities\n$\n29,182\n$\n31,171\nWeighted average remaining lease term\nOperating leases\n1.17\n0.42\nWeighted average discount rate\nOperating leases\n5.25\n%\n5.25\n%\nThe preparation of consolidated financial statements in conformity with generally accepted accounting principles in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosures of contingent assets and liabilities at the date of the consolidated financial statements, and the reported amount of revenues and expenses during the reported period. Actual results could differ from those estimates.\nResults of Operations\nFor the years ended December 31, 2022 and December 31, 2021\nYears Ended\nDecember 31,\nChange\nPercent\nNet Sales\n$ 38,751\n$ 611,328\n$ (572,577 )\n-94 %\nCost of Sales\n31,252\n397,120\n(365,868 )\n-92 %\nGross Profit\n7,499\n214,208\n(206,709 )\n-96 %\nOperating expenses:\nSelling, general and administrative\n62,728\n102,297\n(39,569 )\n-39 %\nProfessional fees\n38,745\n88,248\n(49,503 )\n-56 %\nTotal operating expenses\n101,473\n190,545\n(89,072 )\n-47 %\nOther income (expenses):\nInterest income\n%\nInterest expense\n(24,000 )\n(24,000 )\n-\n0 %\nOther income\n2,297\n1,348\n70 %\nLoss on inventory write-down\n-\n-\n-\n-\n%\nTotal other income (expenses)\n(21,581 )\n(22,650 )\n1,069\n-5 %\nIncome (Loss) before income taxes\n(115,555 )\n1,013\n(116,533 )\n-11507 %\nIncome tax expense\n1,627\n(827 )\n-51 %\nNet loss\n$ (116,355 )\n$ (614 )\n$ (115,741 )\n18850 %\nSales, cost of sales and gross profit\nThe Companys consolidated sales for the year ended December 31, 2022 was $38,751, a decrease of $572,577 or 94% from the sales of $611,328 for the year ended December 31, 2021. Cost of sales for the year ended December 31, 2022 was $31,252, a decrease of $365,868 or 92% from cost of sales of $397,120 for the year ended December 31, 2021. It resulted in a gross profit of $7,499 for the year ended December 31, 2022, a decrease of $206,709 or 96% from the gross profit of $214,208 for the year ended December 31, 2021. The decrease in sales, cost and gross profit was due to the decrease of sales in PRC because the COVID-19 was affecting more in peoples life in 2022 compared to 2021, when it started to burst out.\nTotal operating expenses\nFor the year ended December 31, 2022, total operating expenses were $101,473, which consisted of professional fees of $38,745, China rent expense of $38,554, China salary, office expense and miscellaneous expense of $24,174. For the year ended December 31, 2021, total operating expenses were $190,545, which consisted of professional fees of $88,248, China rent expense of $66,448, China salary, office expense and miscellaneous expense of $35,849. Total operating expenses decreased $89,072, or 47% due to three month rent exemption for the last quarter of 2022 in China, and the reduction of expenses because of the shutdown of business due to COVID19 in China.\nTotal other income (expense)\nFor the year ended December 31, 2022, total other expenses were $21,581, which consisted of interest expense of $24,000, interest income of $122 and other income of $2,297. For the year ended December 31, 2021, total other expenses were $22,650, which consisted of interest expense of $24,000, interest income of $2 and other income of $1,348. Total other expense decreased $1,069, or 5% for the year ended December 31, 2022 from the year ended December 31, 2021, primarily due to the increase in other income, which consists of the local government subsidy in China.\nNet loss\nFor the year ended December 31, 2022, the Company had a net loss of 116,355, an increase of loss of $115,741 or 18850% from the net loss of $614 for the year ended December 31, 2021. The increase of net loss was due to the reasons stated above.\nLiquidity and Capital Resources\nAs of December 31, 2022, the Company had cash and cash equivalents and total assets of $23,852 and $122,087, a decrease of $84,504 or 78% in cash and cash equivalents and a decrease of $98,117 or 45% in total assets compared to the cash and cash equivalents and total assets of $108,356 and $220,204, respectively as of December 31, 2021. As of December 31, 2022, the Company had total liabilities of $786,209, of which $$200,000 was convertible note payable, $152,000 was interest payable, $17,109 was accrued liabilities, $23,681 was lease liabilities and $387,918 was due to our sole officer and director as an unsecured, non-interest-bearing demand loan. As of December 31, 2021, the Company had total liabilities of $756,823, of which $200,000 is convertible note payable and $128,000 is interest payable, $11,234 is accrued liabilities, $31,171 is lease liabilities and $386,418 is due to our sole officer and director as an unsecured, non-interest-bearing demand loan. As of December 31, 2022, and 2021, the Company had negative working capital amount of $458,621 and $336,619, respectively, an increase of negative working capital of $122,002 or $41%.\nOther than an oral agreement with Mrs. Cui to fund the expenses of the Company, we currently have no agreements and arrangements with any party to obtain funds through bank loans, lines of credit or any other sources. Since the Company has no such arrangements or plans currently in effect, its inability to raise funds for the above purposes will have a severe negative impact on its ability to remain a viable company.\nOur operations may be affected by the ongoing COVID-19 pandemic. The ultimate disruption that may result from the virus is uncertain, but it may result in a material adverse impact on our financial position, operations and cash flows.\nCash Flows from Operating Activities\nFor the year ended December 31, 2022, net cash flows used in operating activities is $80,912, resulting from a net loss of $116,355, a net decrease of $110,661 or 372% from the net cash provided by operating activities of $29,748 for the year ended December 31, 2021. It caused by the decrease of loss of $115,741, a net decrease of accounts receivable change of $82,706, a net decrease of lease liabilities of 27,418 and a net decrease of $421 caused by changes in accrued liabilities, offset by the increase of amortization of right-of-use of assets of $4,194 and increase of $111,431 in prepaid expenses and other current assets. For the year ended December 31, 2021, net cash flows provide by operating activities is $29,748, resulting from a net loss of $614, increased by accounts receivable change of $49,504, interest payable of $24,000, lease liabilities of $27,418 and accrued liabilities of $14,579, offset by the decrease caused by Prepaid expenses change of $111,431.\nCash Flows from Investing Activities\nFor the years ended December 31, 2022 and 2021, no cash flow from investing activity.\nCash Flows from Financing Activities\nThe Company financed the operations primarily from the advances from its sole officer and director. For the years ended December 31, 2022 and 2021, cash flows provided by advances from the Companys sole officer and director of $1,500 and $46,132, respectively, a decrease of $44,632 or 97% because of the operation needs reduced due to COVID19.\nGoing Concern Consideration\nThe Company had net losses of $116,355 and $614 for the years ended December 31, 2022 and 2021 respectively. In addition, the Company had accumulated deficits of $1,278,662 and $1,162,307 and generated not enough/negative cash flows from operating activities as of and for the years ended December 31, 2022 and 2021, respectively. These factors raise substantial doubt about the Companys ability to continue as a going concern. The Companys ability to continue as a going concern is dependent on its ability to raise additional capital. The Companys consolidated financial statements do not include any adjustments relating to the recoverability and classification of reported asset amounts or the amount and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nThese consolidated financial statements have been prepared on a going concern basis, which assumes the Company will continue to realize its assets and discharge its liabilities in the normal course of business. The continuation of the Company as a going concern is dependent upon the continued financial support from its shareholders, the ability of the Company to repay its debt obligations, to obtain necessary equity financing to continue operations, and the attainment of profitable operations. Management anticipates that the Company will be dependent, in the near future, on additional investment capital to fund operating expenses. The Company may seek additional funding through additional issuance of common stock and/or borrowings from financial institutions or the majority shareholder to support its normal business operations. In light of managements efforts, there are no assurances that the Company will be successful in this or any of its endeavors or become financially viable and continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nConvertible Note Payable\nOn September 1, 2016, the Company entered into a Convertible Note Agreement in the principal amount of $200,000 with an unrelated party. The note bears interest at 12% per annum and the holder is able to convert all unpaid interest and principal into common shares at $3.50 per share. The note matures on September 1, 2018. The Company recognized a discount on the note of $38,857 at the agreement date. The interest expense was due every six months commencing on March 1, 2017 until the principal amount of this convertible note is paid in full.\nOn September 1, 2018, the Company entered into an Amended and Restated 12% Convertible Promissory Note. Pursuant to an Amended and Restated 12% Convertible Promissory Note, both parties agreed to extend a Convertible Note Agreement to September 1, 2019 with no additional consideration. The Company recognized a discount on the note of $40,000 at the amended agreement date.\nOn September 1, 2019, the Company entered into an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2020 with no additional consideration. The Company recognized a discount on the note of $54,400 at the amended agreement date. Since the conversion feature of conventional convertible debt provides for a rate of conversion that is below market value, this feature is characterized as a beneficial conversion feature (BCF). A BCF is recorded by the Company as a debt discount pursuant to ASC Topic 470-20 Debt with Conversion and Other Options. In those circumstances, the convertible debt is recorded net of the discount related to the BCF and the Company amortizes the discount to interest expense over the life of the debt using the effective interest method.\nOn September 1, 2020, the Company entered an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2022 with no additional consideration. The Company recognized a discount on the note of $0 at the amended agreement date.\nOn September 1, 2022, the Company signed an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note to September 1, 2024 with no additional consideration. No discount on the note was recognized at the amended agreement date.\nThe Company recognized interest expense related to the convertible note of $24,000 and $24,000 for the years ended December 31, 2022 and 2021, respectively. There was no unamortized debt discount as of December 31, 2022 and 2021 respectively. As of December 31, 2022, and 2021, net balances of the convertible note were $200,000.\nOperating Lease\nThe Company has an operating lease for its office space from a third party in the United States. The Company determined if an arrangement is a lease inception of the contract and whether a contract is or contains a lease by determining whether it conveys the right to control the use of identified asset for a period of time. The contract provides the right to substantially all the economic benefits from the use of the identified asset and the right to direct use of the identified asset, we consider it to be, or contain, a lease. Leases are classified as operating at inception of the lease. Operating leases result in the recognition of ROU assets and lease liabilities on the balance sheet. ROU assets and operating lease liabilities are recognized based on the present value of lease payments over the lease term as of the commencement date. Because the leases do not provide an explicit or implicit rate of return, the Company determines incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments on an individual lease basis. The incremental borrowing rate for a lease is the rate of interest the Company would have to pay on a collateralized basis to borrow an amount equal to the lease payments for the asset under a similar term, which is 7.33%. Lease expense for the lease is recognized on a straight-line basis over the lease term. The lease does not contain any residual value guarantees or material restrictive covenants. Leases with a lease term of 12 months or less are not recorded on the balance sheet and lease expense is recognized on a straight-line basis over the lease term. The lease expired on August 31, 2020.\nThe Company signed a lease agreement with a related party in China in June 2020, an entity in which CBKBs supervisor is a shareholder. It called for a monthly rent of RMB40,000 (approximately $5,800). The lease was for one year and was subject to renewal. The lease was classified as operating at inception of the lease. Operating leases result in the recognition of ROU assets and lease liabilities on the balance sheet. ROU assets and operating lease liabilities are recognized based on the present value of lease payments over the lease terms of the commencement date. Because the leases do not provide an explicit or implicit rate of return, the Company determines incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments on an individual lease basis. The incremental borrowing rate for a lease is the rate of interest the Company would have to pay on a collateralized basis to borrow an amount equal to the lease payments for the asset under similar terms, which is 5.25%. The lease did not contain any residual value guarantees or material restrictive covenants. The Company currently has no finance leases.\nOn March 1, 2022, the Company entered into a new lease agreement with Entity A for the one-year term from March 1, 2022 to February 28, 2023. The lease was classified as an operating lease at inception, and results in the recognition of ROU assets and lease liabilities on the balance sheet. ROU assets and operating lease liabilities are recognized based on the present value of lease payments over the lease terms of the commencement date. Because the leases do not provide an explicit or implicit rate of return, the Company determines incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments on an individual lease basis. The incremental borrowing rate for a lease is the rate of interest the Company would have to pay on a collateralized basis to borrow an amount equal to the lease payments for the asset under a similar term, which is 5.25%. The lease does not contain any residual value guarantees or material restrictive covenants.\nAs of December 31, 2022, total future minimum annual lease payments under non-cancellable lease are follows:\nOperating\nLeases\n$ 24,091\n5,354\nTotal lease payments\n29,445\nLess: Interest\n(1,518 )\nPresent value of lease liabilities\n$ 27,927\nMaterial Definitive Agreement\nMakingOrg, Inc.s subsidiary, Chongqing Beauty Kenner Biotechnology Co., Ltd., entered into a Strategic Cooperation Framework Agreement (the Agreement) with Hangzhou Life Century Hualian Supermarket Chain Co., Ltd. (HLCH), dated May 25, 2018, pursuant to which the Company agreed to assist HLCH in identifying brand-specific, high tech characteristics products, such as acer truncatum nervonic acid oil, acer truncatum seed oil capsule, acer truncatum edible oil, acer truncatum oil with nervonic acid formula, acer truncatum coffe, acer truncatum tea, canned acer truncatum, acer truncatum cosmetics, acer truncatum skin care products, hair wash products and acer trunncatrum food. The Company has initiated the marketing effort per agreement, however, the result has not met the expectation and the Company is still finding solutions.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements.\nItem 8. Financial Statements.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of\nMakingORG, Inc.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of MakingORG, Inc. and subsidiaries (the Company) as of December 31, 2022 and 2021, the related consolidated statements of operation, stockholders equity, and cash flows for each of the two years in the period ended December 31, 2022, and the related notes. In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2022 and 2021, and the results of its operations and its cash flows for each of the two years in the period ended December 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt About the Companys Ability to Continue as a Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As described in Note 2 to the consolidated financial statements, the Company has suffered recurring losses from operations, has a net capital deficiency, and has stated that substantial doubt exists about the Companys ability to continue as a going concern. Managements evaluation of the events and conditions and managements plans regarding these matters are also described in Note 3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty. Our opinion is not modified with respect to this matter.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue recognition\nAs described in Note 2 and 6 to the consolidated financial statements, the Company generates its revenue from sales of acer truncatum bunge related health products exclusively from one customer. The Company evaluates its product sales contracts and determines that the contracts with its customer are distinct and contain one performance obligation. Performance obligation is satisfied when finished goods are delivered to the customer.\nWe identified the revenue recognition as a critical audit matter. Auditor judgement is involved in performing our audit procedures to evaluate whether the timing and amount of revenue recognition was appropriately stated.\nThe primary procedures we performed to address this critical audit matter included:\n·\nWe evaluated the relationship between the Company and the customer, and the reasonableness of the key terms of product sales contracts.\n·\nWe evaluated the performance obligations identified by the Company against the five-step model prescribed at ASC 606, Revenue form Contracts with Customers, and evaluated the managements conclusion.\n·\nWe tested the accuracy and cutoff of the revenue recognized by management through verifying the evidence of deliveries and value-added invoices issued.\n/s/ Simon & Edward, LLP\n(PCAOB #2485)\nRowland Heights, California\nOctober 10, 2023\nWe have served as the Companys auditor since 2016.\nMAKINGORG, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\nDecember 31,\nASSETS\nCurrent Assets\nCash and cash equivalents\n$ 23,852\n$ 108,356\nAccounts receivable - related party\n32,334\n-\nAdvances to vendor and others\n41,314\n80,677\nRight-of-use assets - operating lease, current\n24,587\n31,171\nTotal Current Assets\n122,087\n220,204\nTotal Assets\n$ 122,087\n$ 220,204\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent Liabilities\nInterest payable\n$ 152,000\n$ 128,000\nAccrued liabilities\n17,109\n11,234\nLease liabilities - operating lease\n23,681\n31,171\nDue to related party\n387,918\n386,418\nTotal Current Liabilities\n580,708\n556,823\nLong-Term Liabilities\nConvertible note payable, noncurrent\n200,000\n200,000\nLease liabilities - operating lease, noncurrent\n5,501\n-\nTotal Long-term Liabilities\n205,501\n200,000\nTOTAL LIABILITIES\n786,209\n756,823\nCommitment and Contingencies\nStockholders Equity (Deficit)\nPreferred stock, par value $0.001; 50,000,000 shares authorized, zero shares issued and outstanding\n-\n-\nCommon stock, par value $0.001; 150,000,000 shares authorized, 35,540,000 shares issued and outstanding\n35,540\n35,540\nAdditional paid-in capital\n583,882\n583,882\nAccumulated other comprehensive income\n(4,882 )\n6,266\nAccumulated deficit\n(1,278,662 )\n(1,162,307 )\nTotal Stockholders Deficit\n(664,122 )\n(536,619 )\nTotal Liabilities and Stockholders Deficit\n$ 122,087\n$ 220,204\nSee accompanying notes to consolidated financial statements.\nMAKINGORG, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nFor the years ended\nDecember 31,\nREVENUE - RELATED PARTY\n$ 38,751\n$ 611,328\nCost of Revenue\n31,252\n397,120\nGROSS PROFIT\n7,499\n214,208\nOPERATING EXPENSES\nSelling, general and administrative\n62,728\n102,297\nProfessional fees\n38,745\n88,248\nTOTAL OPERATING EXPENSES\n101,473\n190,545\n(LOSS) INCOME FROM OPERATIONS\n(93,974 )\n23,663\nOTHER INCOME (EXPENSE)\nInterest income\nInterest expense\n(24,000 )\n(24,000 )\nOther income, net\n2,297\n1,348\nLoss on inventory write-down\n-\n-\nTOTAL OTHER EXPENSE, NET\n(21,581 )\n(22,650 )\n(LOSS) INCOME BEFORE INCOME TAX\n(115,555 )\n1,013\nIncome tax\n1,627\nNET LOSS\n$ (116,355 )\n$ (614 )\nOTHER COMPREHENSIVE ITEM:\nForeign currency translation income\n(11,148 )\n3,775\nTOTAL COMPREHENSIVE LOSS\n$ (127,503 )\n$ (3,161 )\nNET LOSS PER COMMON SHARE: BASIC AND DILUTED\n$ (0.003 )\n$ (0.000 )\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING: BASIC AND DILUTED\n35,540,000\n35,540,000\nSee accompanying notes to consolidated financial statements.\nMAKINGORG, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS DEFICIT\nAccumulated\nAdditional\nOther\nTotal\nCommon Stock\nPaid-in\nComprehensive\nAccumulated\nStockholders\nShares\nAmount\nCapital\nIncome\nDeficit\nDeficit\nBalance, December 31, 2020\n35,540,000\n$ 35,430\n$ 583,882\n$ 2,491\n$ (1,161,693 )\n$ (539,780 )\nForeign currency translation income\n-\n-\n-\n3,775\n-\n3,775\nNet loss\n-\n-\n-\n-\n(614 )\n(614 )\nBalance, December 31, 2021\n35,540,000\n35,430\n583,882\n6,266\n(1,162,307 )\n(536,619 )\nForeign currency translation loss\n-\n-\n-\n(11,148 )\n-\n(11,148 )\nNet loss\n-\n-\n-\n-\n(116,355 )\n(116,355 )\nBalance, December 31, 2022\n35,540,000\n$ 35,540\n$ 583,882\n$ (4,882 )\n$ (1,278,662 )\n$ (664,122 )\nSee accompanying notes to consolidated financial statements.\nMAKINGORG, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the years ended\nDecember 31,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$ (116,355 )\n$ (614 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nAmortization of right-of-use assets\n4,194\n-\nChanges in assets and liabilities:\nAccounts receivable\n(33,202 )\n49,504\nPrepaid expenses and other current assets\n33,941\n(77,490 )\nInterest payable\n24,000\n24,000\nAccrued liabilities\n5,987\n6,408\nLease liabilities\n27,940\nCASH FLOWS (USED IN) PROVIDED BY OPERATING ACTIVITIES\n(80,912 )\n29,748\nCASH FLOWS FROM FINANCING ACTIVITIES\nLoan from related party\n1,500\n46,132\nCASH FLOWS PROVIDED BY FINANCING ACTIVITIES\n1,500\n46,132\nEFFECT OF EXCHANGE RATE CHANGES ON CASH\n(5,092 )\n1,776\nNET CHANGE IN CASH AND CASH EQUIVALENTS\n(84,504 )\n77,656\nCash and cash equivalents, beginning of period\n108,356\n30,700\nCash and cash equivalents, end of period\n$ 23,852\n$ 108,356\nSUPPLEMENTAL CASH FLOW INFORMATION:\nIncome taxes paid\n$ 800\n$ 800\nSee accompanying notes to consolidated financial statements.\nMAKINGORG, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION AND NATURE OF BUSINESS\nMakingORG, Inc. (MakingORG) was incorporated under the laws of the State of Nevada on August 10, 2012. The trading symbol is CQCQ and the fiscal year end is December 31. On October 20, 2016, MakingORG filed documents registering its intention to transact interstate business in the state of California. On November 29, 2016, MakingORG incorporated HK Feng Wang Group Limited (HKFW) under the laws of Hong Kong. On August 22, 2017, HKFW incorporated Chongqing Beauty Kenner Biotechnology Co., Ltd (CBKB) under the laws of the Peoples Republic of China (PRC).\nMaingORG, Inc. and subsidiaries (the Company) purchase Acer truncatum bunge seed oil from China, outsource to third party to manufacture Acer truncatum bunge related health products, and sell to end user and distributor in the United States and PRC.\nNOTE 2 - GOING CONCERN\nPursuant to ASU 2014-15, the Company has assessed its ability to continue as a going concern for a period of one year from the date of the issuance of these consolidated financial statements. Substantial doubt about an entitys ability to continue as a going concern exists when relevant conditions and events, considered in the aggregate, indicate that it is probable that the entity will be unable to meet its obligations as they become due within one year from the financial statement issuance date. The accompanying consolidated financial statements have been prepared in conformity with generally accepted accounting principle, which contemplate continuation of the Company as a going concern. The Company currently suffered recurring loss from operations, generated negative cash flow from operating activities and has an accumulated deficit and has not completed its efforts to establish a stabilized source of revenues sufficient to cover operating costs over an extended period. These conditions raise substantial doubt as to its ability to continue as a going concern. These consolidated financial statements do not include adjustments relating to the recoverability and classification of reported asset amounts or the amount and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nThe Company had net losses of $116,355 and $614 for the years ended December 31, 2022 and 2021 respectively. In addition, the Company had an accumulated deficit of $1,278,662 and $1,162,307, respectively, and generated not enough/negative cash flows from operating activities as of and for years ended December 31, 2022 and 2021, respectively. These factors raise substantial doubt about the Companys ability to continue as a going concern. The Companys ability to continue as a going concern is dependent on its ability to raise additional capital. The Companys consolidated financial statements do not include any adjustments relating to the recoverability and classification of reported asset amounts or the amount and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nManagement anticipates that the Company will be dependent, for the near future, on additional investment capital to fund operating expenses. The Company may seek additional funding through additional issuance of common stock and/or borrowings from financial institutions or the majority shareholder to support its normal business operations. Considering managements efforts, there is no assurance that the Company will be successful in this or any of its endeavors or become financially viable to continue as a going concern.\nNOTE 3 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation\nThe Companys consolidated financial statements refer to MakingORG, Inc. and its subsidiaries. All intercompany transactions and balances were eliminated in consolidation.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the U.S. requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the Companys consolidated financial statement date and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from these estimates.\nCash and Cash Equivalents\nCash and cash equivalents primarily consist of cash on deposit with banks and financial institutes and petty cash on hands.\nAccounts Receivable and Allowance for Doubtful Accounts\nAccounts receivables are reported realizable value, net of allowance for contractual credits and doubtful accounts, which are recognized in the period the related revenue is recorded. Accounts receivable consists principally of receivables from distributor or end user, arising from the sale of the Companys product. The Company provides an allowance for doubtful accounts equal to the estimated uncollectible amounts. The Management evaluated that there was no allowance for doubtful accounts as of December 31, 2022 and 2021, respectively.\nInventories\nInventories consist of (a) packing materials (b) raw materials and (c) finished goods, which are stated at the lower of cost or net realizable value under the first-in-first-out method. The Company reviews its inventories periodically for possible excess and obsolescence to determine if any reserves are necessary. As of December 31, 2022 and 2021, there were no inventory held on hands.\nRevenue Recognition\nThe Company adopted Topic 606, Revenue from Contracts with Customers, using the modified retrospective transition method on January 1, 2018. In general, the Companys performance obligation is to transfer it products to its end user or distributor. Revenues from product sales are recognized when the customer obtains control of the Companys finished goods product, which occurs at a point in time, typically upon delivery to the customer.\nThe Companys revenue mainly generates from sale of acer truncatum bunge related health products, such as Nervonic Acid Oil, coffee and tea. The Company evaluates its product sales contracts and determines that those contracts are generally capable of being distinct and accounted for as separate performance obligations. Performance obligation is satisfied when the finished goods product delivered to the customer.\nShipping and handling costs paid by the Company are included in cost of sales.\nAdvertising Expenses\nAdvertising costs are expensed as incurred. There were no advertising expenses for the years ended December 31, 2022 and 2021.\nIncome Taxes\nIncome taxes are computed using the asset and liability method. Under the asset and liability method, deferred income tax assets and liabilities are determined based on the differences between the financial reporting and tax bases of assets and liabilities and are using enacted tax rate expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. A valuation allowance is provided for deferred tax assets that, based on available evidence, if more likely than not that the company will not realize tax assets through future operation.\nThe 2017 Tax Reform Act permanently reduces the U.S. corporate income tax rate to a flat 21% rate. In addition, the 2017 Tax Reform Act also creates a new requirement that certain income (i.e., Global Intangible Low-Taxed Income (GILTI)) earned by controlled foreign corporations (CFCs) must be included in the gross income of the CFCs U.S. shareholder income. The tax law in PRC applies an income tax rate of 25% to all enterprises. The Companys subsidiary does not receive any preferential tax treatment from local government. The Company has been in loss position for years and zero balances of tax provisions, deferred tax assets and liabilities as of the reporting periods ended.\nBasic Income (Loss) Per Share\nBasic income (loss) per share is calculated by dividing the Companys net loss applicable to common shareholders by the weighted average number of common shares during the period. Diluted earnings per share is calculated by dividing the Companys net income available to common shareholders by the diluted weighted average number of shares outstanding during the year. The diluted weighted average number of shares outstanding is the basic weighted number of shares adjusted for any potentially dilutive debt or equity.\nForeign Currency Transactions\nThe functional currency for MakingORG and HKFW is US dollar. The functional currency for the China subsidiary (CBKB) is the Renminbi (RMB). Assets and liabilities of the China operation are translated from RMB into U.S. dollars at period-end rates, while the statements of operations and cash flows are translated at the weighted-average exchange rates for the period. The related translation adjustments are reflected as a foreign currency translation adjustment in accumulated other comprehensive income/(loss) within shareholders deficit.\nThe Company translates the assets and liabilities into U.S. dollars using the rate of exchange prevailing at the balance sheet date and the statements of operations and cash flows are translated at an average rate during the reporting period. Adjustments resulting from the translation from RMB into U.S. dollars are recorded in stockholders equity as part of accumulated other comprehensive income. The exchange rates used for financial statements are as follows:\nAverage Rate for the Twelve\nMonths Ended December 31,\nChina yuan (RMB)\nRMB\n6.728489\nRMB\n6.452480\nUnited States dollar (USD)\nUSD\n1.000000\n$\n1.000000\nExchange Rate at\nDecember 31,\nDecember 31,\nChina yuan (RMB)\nRMB\n6.909062\nRMB\n6.355095\nUnited States dollar (USD)\nUSD\n1.000000\n$\n1.000000\nRelated Parties\nThe Company follows ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions.\nLease\nThe Company adopted the new lease accounting - ASC 842 on January 1,2019. The Company determines if an arrangement is or contains a lease at inception. Operating leases with lease terms of more than 12 months are included in operating lease assets, accrued and other current liabilities, and long-term operating lease liabilities on its consolidated balance sheet. Operating lease assets represent its right to use an underlying asset for the lease term and lease liabilities represent its obligation to make lease payments over the lease term. Operating lease assets and liabilities are recognized based on the present value of the remaining lease payments discounted using its incremental borrowing rate. Lease expense is recognized on a straight-line basis over the lease term.\nSegment Reporting\nThe Company follows Financial Accounting Standards Board (FASB) ASC Topic 280, Segment Reporting for its segment reporting. The Company aggregates its operating segments into one reporting segment, as management believes that its operating segments have similar operating characteristics and similar long-term operating performance.\nFair Value of Financial Instruments\nFair value is defined as the price that would be received upon sale of an asset or paid upon transfer of a liability in an orderly transaction between market participants at the measurement date and in the principal or most advantageous market for that asset or liability. The fair value should be calculated based on assumptions that market participants would use in pricing the asset or liability, not on assumptions specific to the entity. In addition, the fair value of liabilities should include consideration of non-performance risk including the Companys own credit risk.\nIn addition to defining fair value, the standard expands the disclosure requirements around fair value and establishes a fair value hierarchy for valuation inputs. The hierarchy prioritizes the inputs into three levels based on the extent to which inputs used in measuring fair value are observable in the market. Each fair value measurement is reported in one of the three levels which are determined by the lowest level input that is significant to the fair value measurement in its entirety. These levels are:\nLevel 1 - inputs are based upon unadjusted quoted prices for identical instruments traded in active markets.\nLevel 2 - inputs are based upon significant observable inputs other than quoted prices included in Level 1, such as quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant assumptions are observable in the market or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - inputs are generally unobservable and typically reflect managements estimates of assumptions that market participants would use in pricing the asset or liability. The fair values are therefore determined using model-based techniques that include option pricing models, discounted cash flow models, and similar techniques.\nThe carrying amounts of financial assets and liabilities in the consolidated balance sheets for cash and cash equivalents, advances to vendor, accrued expenses, interest payable and due to related party approximate their fair value due to the short-term duration of those instruments. Convertible notes payable is recorded at agreed values.\nRecently Issued Accounting Pronouncement Not Yet Adopted\nIn June 2016, the FASB issued ASU No. 2016-13, (FASB ASC Topic 326), Financial Instruments - Credit Losses: Measurement of Credit Losses on Financial Instruments which amends the current accounting guidance and requires the use of the new forward-looking expected loss model, which requires all expected losses to be determined based on historical experience, current conditions and reasonable and supportable forecasts, rather than the incurred loss model. This guidance amends the accounting for credit losses for most financial assets and certain other instruments including trade and other receivables, held-to-maturity debt securities, loans and other instruments. The effective date of ASU No. 2016-13 for smaller reporting companies is postponed to fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. The Company believes the adoption of ASU No. 2016-13 will not have a material impact on its financial position and results of operations.\nThe management does not believe that other than disclosed above, the recently issued but not yet adopted accounting pronouncements will have a material impact on its financial position results of operations or cash flows.\nNOTE 4 - ADVANCES TO VENDOR AND OTHERS\nAdvances to vendors and others was advance for purchasing of packaging materials. There were $41,314 and $nil advances to vendor as of December 31, 2022 and 2021, respectively. No interest bearing for the advances to vendor, which is expecting to use during 2023.\nNOTE 5 - RELATED PARTY TRANSACTIONS\nDue to Related Party\nThe Company lent RMB 80,000 (approximately $12,209) to the Entity A, a related party whose shareholder is a board member of CBKB, and the landlord of the office space CBKB leased in China. The loan has a term of six months and matured on March 31, 2021, with a monthly interest rate of 1%. According to the loan agreement, the loan principal could be applied to the monthly lease payment for two months (RMB 40,000 per month). The related party was not able to pay back the loan on the maturity date and CBKB withheld April and May 2021 lease payments to offset with the loan principal due. Entity A paid the entire interest of RMB 4,800 back on April 1, 2021.\nDue from Related Party\nThe Company borrows from its sole officer when there are business operation needs. For the years ended December 31, 2022 and 2021, the Companys Chief Executive Officer (CEO) lent the Company $1,500 and $46,132, respectively, with the loan balances totaled $387,918 and $386,418 as of December 31,2022 and 2021. The loans were unsecured, non-interest bearing and due on demand.\nRevenue - Related Party\nThe Company sells its product to a related party, Entity A. For the years ended December 31, 2022 and 2021, the Companys total revenue generated from the sales transactions with the related party were $38,751 and $611,328, respectively. As of December 31, 2022 and 2021, accounts receivable due from Entity A were $32,334 and $nil, respectively.\nLease Agreement\nOn June 1, 2020, the Company entered into a lease agreement with Entity A in Chongqing, China for the period from June 1, 2020 to May 31, 2021. Pursuant to the lease agreement, the Company pays a monthly rent of RMB40,000 (approximately $5,800) paid quarterly before the start of each quarter. The lease is for a one-year term and the Company has the priority to renew the lease. The Company tend to keep leasing the property after the lease term ends. Therefore, based on the lease agreement, we did the recognition of right-of-use (ROU) assets and lease liabilities on the balance sheet. Refer to Note 9 - Lease for details.\nOn March 1, 2022, the Company entered into a lease agreement with Entity A for the period from March 1, 2022 to February 28, 2023. Pursuant to the lease agreement, monthly rent is lowered to RMB20,000 (approximately $3,200), payable by the 5th of each month with the first two months rent free. The lease is for a one-year term and the Company has the right of first refusal or renew the lease. The Company recognized right-of-use assets and lease liabilities on the balance sheet upon executed of the lease agreement. Refer to Note 9 - Lease for details.\nNOTE 6 - BUSINES CONCENTRATION AND RISKS\nConcentration of Risk\nThe Company maintains cash with banks in the USA, Peoples Republic of China (PRC or China), and Hong Kong. Should any bank holding cash become insolvent, or if the Company is otherwise unable to withdraw funds, the Company would lose the cash with that bank; however, the Company has not experienced any losses in such accounts and believes it is not exposed to any significant risks on its cash in bank accounts. In China, a depositor has up to RMB 500,000 insured by the Peoples Bank of China Financial Stability Bureau (FSD). In Hong Kong, a depositor has up to HKD 500,000 insured by Hong Kong Deposit Protection Board (DPB). In the United States, the standard insurance amount is $250,000 per depositor in a bank insured by the Federal Deposit Insurance Corporation (FDIC).\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist principally of cash and cash equivalents. As of December 31, 2022 and 2021, the Companys cash and cash equivalents were fully insured.\nMajor customer\nFor the years ended December 31, 2022 and 2021, the Company generated revenues exclusively from one customer - Entity A in the amounts of $38,751 and $611,328, respectively. As of December 31, 2022, the $32,334 accounts receivable due from Entity A accounted 100% of the accounts receivable balance outstanding.\nMajor vendors\nFor the years ended December 31, 2022 and 2021, the Companys purchase from the vendors accounted more than 10% of total purchase were:\nYears Ended December 31,\nAmount\n% of Total Purchase\nAmount\n% of Total Purchase\nVendor A\n$ 30,466\n100 %\n$ 231,280\n52 %\nVendor B\n$ -\n-\n%\n$ 108,770\n25 %\nVendor C\n$ -\n-\n%\n$ 57,071\n13 %\nNOTE 8 - CONVERTIBLE NOTE PAYABLE\nOn September 1, 2016, the Company entered into a Convertible Note Agreement in the principal amount of $200,000 with an unrelated party. The note bears interest at 12% per annum and the holder is able to convert all unpaid interest and principal into common shares at $3.50 per share. The note matures on September 1, 2018. The Company recognized a discount on the note of $38,857 at the agreement date. The interest expense was due every six months commencing on March 1, 2017 until the principal amount of this convertible note is paid in full.\nOn September 1, 2018, the Company entered into an Amended and Restated 12% Convertible Promissory Note. Pursuant to an Amended and Restated 12% Convertible Promissory Note, both parties agreed to extend a Convertible Note Agreement to September 1, 2019 with no additional consideration. The Company recognized a discount on the note of $40,000 at the amended agreement date.\nOn September 1, 2019, the Company entered into an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2020 with no additional consideration. The Company recognized a discount on the note of $54,400 at the amended agreement date. Since the conversion feature of conventional convertible debt provides for a rate of conversion that is below market value, this feature is characterized as a beneficial conversion feature (BCF). A BCF is recorded by the Company as a debt discount pursuant to ASC Topic 470-20 Debt with Conversion and Other Options. In those circumstances, the convertible debt is recorded net of the discount related to the BCF and the Company amortizes the discount to interest expense over the life of the debt using the effective interest method.\nOn September 1, 2020, the Company entered into an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2022 with no additional consideration. The Company recognized a discount on the note of $0 at the amended agreement date.\nOn September 1, 2022, the Company signed an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2024 with no additional consideration. The Company recognized a discount on the note of $0 at the amended agreement date.\nThe Company recognized interest expense related to the convertible note of $24,000 and $24,000, respectively, for the years ended December 31, 2022 and 2021, respectively. As of December 31, 2022, and 2021, the Company had $152,000 and $128,000 interest payable associated with the $200,000 convertible note, respectively.\nNOTE 9 - LEASE\nThe Company adopted ASC 842 on January 1, 2019. The Company entered an operating lease for its China office with Entity A with monthly rent of RMB40,000 (approximately $5,800). The lease was for one year and the Company has the priority to renew it. The Company intended to renew the lease. Leases was classified as operating at the inception of the lease. Operating leases result in the recognition of ROU assets and lease liabilities on the balance sheet. ROU assets and operating lease liabilities are recognized based on the present value of lease payments over the lease terms of the commencement date. Because the leases do not provide an explicit or implicit rate of return, the Company determines incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments on an individual lease basis. The incremental borrowing rate for a lease is the rate of interest the Company would have to pay on a collateralized basis to borrow an amount equal to the lease payments for the asset under similar term, which is 5.25%. The lease does not contain any residual value guarantees or material restrictive covenants. The remaining term including the renewal term as of September 30, 2021 was 8 months. The Company has no finance lease.\nOn March 1, 2022, the Company entered into a new lease agreement with Entity A at the same premise for the one-year term from March 1, 2022 to February 28, 2023 with one year renewal automatically. The lease was classified as an operating lease, and ROU assets and operating lease liabilities are recognized based on the present value of lease payments over the lease terms of the commencement date. Because the leases do not provide an explicit or implicit rate of return, the Company determines the incremental borrowing rate is 5.25%. The lease does not contain any residual value guarantees or material restrictive covenants.\nThe components of lease expense consist of the following:\nYears Ended December 31,\nClassification\nOperating lease cost\nSelling, General & Administrative expenses\n$\n18,873\n$\n70,848\nBalance sheet information related to leases consists of the following:\nClassification\nDecember 31,\nDecember 31,\nAssets\nOperating lease ROU assets\nRight-of-use assets\n$\n24,587\n$\n31,171\nLiabilities\nOperating lease liabilities\nCurrent portion\n$\n23,681\n$\n31,171\nOperating lease liabilities\nLong-term portion\n5,501\n-\nTotal lease liabilities\n$\n29,182\n$\n31,171\nWeighted average remaining lease term\nOperating leases\n1.17\n0.42\nWeighted average discount rate\nOperating leases\n5.25\n%\n5.25\n%\nCash flow information related to leases consists of the following:\nYears Ended\nDecember 31,\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$ 18,873\n$ 37,195\nRight-of-use assets obtained in exchange for lease obligations:\nOperating leases\n15,449\n71,066\nAs previously discussed, the Company adopted Topic 842 by applying the guidance at adoption date, January 1, 2019. As required, the following disclosure is provided for periods prior to adoption, which continue to be presented in accordance with ASC 840.\nFuture minimum lease payment under non-cancellable lease as of December 31, 2022 was as follows:\nOperating Leases\n$ 24,812\n5,514\nTotal lease payments\n30,326\nLess: Interest\n(1,144 )\nPresent value of lease liabilities\n$ 29,182\nNOTE 9 - STOCKHOLDERS DEFICIT\nCommon Stock\nNo common stock was issued in 2022 and 2021. As of December 31, 2022 the Company had 35,540,000 shares of common stock issued and outstanding.\nNOTE 10 - INCOME TAXES\nThe Company accounts for income taxes under ASC 740, Income Taxes. ASC 740 requires the use of an asset and liability approach in accounting for income taxes. Deferred tax assets and liabilities are recorded based on the differences between the financial statement and tax basis of assets and liabilities and the tax rates in effect when these differences are expected to reverse. It also requires the reduction of deferred tax assets by a valuation allowance if, based on the weight of available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized.\nThe Company is subject to taxation in the United States and certain state jurisdictions. The provision for income taxes differs from the amounts which would be provided by applying the statutory federal income tax rate of 21% to the net loss before provision for income taxes. HKFW in Hong Kong are governed by the Inland Revenue Ordinance Tax Law of Hong Kong, and are generally subject to a profits tax at the rate of 16.5% on the estimated assessable profits. CBNB in the PRC is governed by the Income Tax Law of the PRC concerning the private enterprises, which are generally subject to tax at 25% on income reported in the statutory financial statements after appropriate adjustments. PRC also gives tax discount to small enterprises whose annual taxable income is between one million to three million.\nThe Companys income tax expense is mainly contributed by its subsidiary in PRC.\nIn addition, the 2017 Tax Act also creates a new requirement that certain income (i.e., Global Intangible Low-Taxed Income (GILTI)) earned by controlled foreign corporations (CFCs) must be included currently in the gross income of the CFCs U.S. shareholder income. GILTI is the excess of the shareholders net CFC tested income over the net deemed tangible income return, which is currently defined as the excess of (1) 10 percent of the aggregate of the U.S. shareholders pro rata share of the qualified business asset investment of each CFC with respect to which it is a U.S. shareholder over (2) the amount of certain interest expense taken into account in the determination of net CFC-tested income. The Company has elected to recognize the tax on GILTI as a period expense in the period the tax is incurred. For the years ended December 31, 2022 and 2021, no GILTI tax obligation existed and the GILTI tax expense was nil.\nProvision (benefit) for income tax for the year ended December 31, 2022 consisted of:\nYear ended December 31, 2022\nFederal\nState\nForeign\nTotal\nCurrent\n$ -\n$ 800\n$ -\n$ 800\nDeferred\n-\n-\n-\n-\nTotal\n$ -\n$ 800\n$ -\n$ 800\nProvision (benefit) for income tax for the year ended December 31, 2021 consisted of:\nYear ended December 31, 2021\nFederal\nState\nForeign\nTotal\nCurrent\n$ -\n$ 800\n$ 827\n$ 1,627\nDeferred\n-\n-\n-\n-\nTotal\n$ -\n$ 800\n$ 827\n$ 1,627\nNet deferred tax assets consist of the following components as of:\nDecember 31,\nDeferred tax asset:\nNet operating loss carry forwards\n$ 185,149\n$ 182,688\nValuation allowance\n(185,149 )\n(182,688 )\nNet deferred tax asset\n$ -\n$ -\nDue to the change in ownership provisions of the Income Tax laws of United States of America, net operating loss carry forwards of approximately $458,700, will carry indefinitely for federal income tax reporting purposes are subject to annual limitations. When a change in ownership occurs, net operating loss carry forwards may be limited to use in future years. Tax filings for the Company for the years after 2018 is available for examination by state tax jurisdictions and federal tax purposes.\nNOTE 11 - SEGMENT REPORTING\nThe geographical distributions of the Companys financial information for the years ended December 31, 2022 and 2021 were as follows:\nFor the Years ended\nDecember 31,\nGeographic Areas\nRevenue\nPRC\n38,751\n611,328\nUSA\n-\n-\nTotal Revenue\n$ 38,751\n$ 611,328\nIncome (Loss) from Operations\nPRC\n$ (53,000 )\n$ (114,699 )\nUSA\n(40,974 )\n91,036\nTotal Loss from operations\n$ (93,974 )\n$ (23,663 )\nNet Income (Loss)\nPRC\n$ (50,582 )\n$ 115,220\nUSA\n(65,773 )\n(115,834 )\nTotal Net Loss\n$ (116,355 )\n$ (614 )\nThe geographical distribution of the Companys financial information as of December 31, 2022 and 2021 were as follows:\nFor the Years ended\nDecember 31,\nGeographic Areas\nReportable Assets\nPRC\n259,713\n323,893\nUSA\n111,869\n44,498\nElimination\n(25,757 )\n(148,187 )\nTotal Reportable Assets\n$ 122,087\n$ 220,204\nNOTE 12 - SUBSEQUENT EVENT\nThe Company has evaluated all subsequent events through the date the consolidated financial statements were issued and determine that there were no subsequent events or transactions that require recognition or disclosures in the consolidated financial statements.\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nThere were no changes in or disagreements with accountants on accounting and financial disclosure for the year ended December 31, 2022 and 2021.\nItem 9A. Controls and Procedures\nEVALUATION OF DISCLOSURE CONTROLS\nUnder the supervision and with the participation of our management, including our principal executive officer and principal financial officer, the Company conducted an evaluation of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) and Rule 15d-15(e) promulgated under the Securities Exchange Act of 1934, as amended (the Exchange Act), as of December 31, 2019. Based on this evaluation, our principal executive officer and principal financial officer has concluded that, because of the material weaknesses in our internal control over financial reporting due to lack of segregation of duties discussed below, the Companys disclosure controls and procedures were not effective to ensure that information required to be disclosed by the Company in the reports filed or submitted under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Securities and Exchange Commissions rules and forms and that the Companys disclosure and controls are designed to ensure that information required to be disclosed by the Company in the reports that we file or submit under the Exchange Act is accumulated and communicated to management, including our principal executive officer and principal financial officer, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. Notwithstanding the material weaknesses discussed below, our principal executive officer and principal financial officer has concluded that the consolidated financial statements included in this Form 10-K present fairly, in all material respects, our financial position, results of operations and cash flows for the periods presented in conformity with accounting principles generally accepted in the United States.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over our financial reporting. Internal control over financial reporting is a process to provide reasonable assurance regarding the reliability of our financial reporting for external purposes in accordance with generally accepted accounting principles. Internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that in reasonable detail accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements and that receipts and expenditures of company assets are made in accordance with management authorization; and (iii) provide reasonable assurance that unauthorized acquisition, use or disposition of company assets that could have a material effect on our financial statements would be prevented or detected on a timely basis. Because of its inherent limitations, internal control over financial reporting is not intended to provide absolute assurance that a misstatement of our financial statements would be prevented or detected.\nOur management evaluated the effectiveness of our internal control over financial reporting as of December 31, 2022 based on the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. Based on managements assessment, including consideration of the control deficiencies discussed below, management has concluded that the Companys internal control over financial reporting was not effective as of December 31, 2022 due to the fact that there was a material weakness in its internal control over financial reporting. Specifically, through the investigation discussed above, management identified a lack of segregation of duties as well as errors in financial statement presentation and disclosure.\nThe specific material weaknesses identified by our management were as follows:\n·\nLack of Segregation of Duties\n·\nLack of well-established procedures to identify, approve and report related party transaction\nManagement is aware that there is a lack of segregation of duties and lack of well-established procedures to identify, approve and report related party transaction at the Company due to the lack of employees dealing with general administrative and financial matters. However, at this time management has decided that considering the abilities of the employees now involved and the control procedures in place, the risks associated with such lack of segregation are low and the potential benefits of hiring employees to clearly segregate duties do not justify the substantial expenses associated with such increases. Management will periodically reevaluate this situation.\nIn order to mitigate the foregoing material weakness, we have engaged an outside accounting consultant with significant experience in the preparation of financial statements in conformity with U.S. GAAP to assist us in the preparation of our financial statements to ensure that these financial statements are prepared in conformity to U.S. GAAP. Management believes that this will lessen the possibility that a material misstatement of our annual or interim financial statements will be prevented or detected on a timely basis, and we will continue to monitor the effectiveness of this action and make any changes that our management deems appropriate.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to the exemption provided to issuers that are not large accelerated filers nor accelerated filers under the Dodd-Frank Wall Street Reform and Consumer Protection Act.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during our last fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B. Other Information.\nNone.\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance.\nDirectors and Executive Officers\nSet forth below are the names, ages and present principal occupations or employment, and material occupations, positions, offices or employments for the past five years of our current director and executive officer.\nName\nAge\nPosition\nJuanzi Cui\nPresident, Chief Executive Officer, Chief Financial Officer and Secretary and as a director\nJuanzi Cui, age 52, has been the President of the Chongqing Municipal Health Management Association since March of 2014. Since 2011 she has been the Chairman of the Chongqing Huang Xin Technology Limited Liability Corporation. Since 2007 she has been the Vice President and Secretary General of Dietitians Association of Chongqing. Since 2006 she is the Chief Executive Officer and President of the Chongqing City Ziman Nutrition and Health Vocational Training School.\nThe director of the Company serves for a term of one year or until the successor is elected at the Companys annual stockholders meeting and is qualified, subject to removal by the Companys stockholders. The officer serves, at the pleasure of the board of directors, for a term of one year and until the successor is elected at the annual meeting of the board of directors.\nThere are no familial relationships among any of our officers or directors. None of our directors or officers is a director in any other reporting companies. None of our directors or officers has been affiliated with any company that has filed for bankruptcy within the last ten years. The Company is not aware of any proceedings to which any of the Companys officers or directors, or any associate of any such officer or director, is a party adverse to the Company or has a material interest adverse to the Company.\nCode of Ethics; Financial Expert\nBecause of the small size and limited resources of the Company, we do not currently have a Code of Ethics applicable to our principal executive, financial and accounting officers. We do not have a financial expert on the board or an audit committee or nominating committee.\nPotential Conflicts of Interest\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. Thus, there is a potential conflict of interest in that our directors and officers have the authority to determine issues concerning management compensation and audit issues that may affect management decisions. We are not aware of any other conflicts of interest with any of our executives or directors.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934 requires executive officers and directors of the Company and persons who own more than 10% of a registered class of the Companys equity securities to file reports of ownership and changes in their ownership with the Securities and Exchange Commission, and forward copies of such filings to the Company. Our sole executive officer and director complied with the Section 16(a) filing requirements since she acquired control of the Company.\nInvolvement in Certain Legal Proceedings\nThere are no legal proceedings that have occurred within the past ten years concerning our directors, or control persons which involved a criminal conviction, a criminal proceeding, an administrative or civil proceeding limiting ones participation in the securities or banking industries, or a finding of securities or commodities law violations.\nItem 11. Executive Compensation.\nSummary Compensation\nSince our incorporation in August 2012, no compensation has been paid to our directors or executive officers in consideration for their services rendered to our Company in their capacity as such. We have no employment agreements with any of our directors or executive officers. We have no pension, health, annuity, bonus, insurance, stock options, profit sharing or similar benefit plans\nSince our incorporation, no stock options or stock appreciation rights were granted to any of our directors or executive officers. We have no equity incentive plans.\nOutstanding Equity Awards\nSince our incorporation, none of our directors or executive officers has held unexercised options, stock that had not vested, or equity incentive plan awards.\nCompensation of Directors\nSince the incorporation in August 2012, no compensation has been paid to any of our directors in consideration for their services rendered in their capacity as directors. No arrangements are presently in place regarding compensation to directors for their services as directors.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table lists, as of April 11, 2019, the number of shares of common stock of our Company that are beneficially owned by (i) each person or entity known to our Company to be the beneficial owner of more than 5% of the outstanding common stock; (ii) each executive officer and director of our Company; and (iii) all executive officers and directors as a group. Information relating to beneficial ownership of common stock by our principal shareholders and management is based upon information furnished by each person using beneficial ownership concepts under the rules of the Securities and Exchange Commission. Under these rules, a person is deemed to be a beneficial owner of a security if that person has or shares voting power, which includes the power to vote or direct the voting of the security, or investment power, which includes the power to vote or direct the voting of the security. The person is also deemed to be a beneficial owner of any security of which that person has a right to acquire beneficial ownership within 60 days. Under the Securities and Exchange Commission rules, more than one person may be deemed to be a beneficial owner of the same securities, and a person may be deemed to be a beneficial owner of securities as to which he or she may not have any pecuniary beneficial interest. Except as noted below, each person has sole voting and investment power.\nThe percentages below are calculated based on 35,540,000 shares of our common stock issued and outstanding as of July 11, 2023. We do not have any outstanding options, warrants or other securities exercisable for or convertible into shares of our common stock. Unless otherwise indicated, the address of each person listed is c/o Making ORG, Inc., 385 S. Lemon Avenue #E 301, Walnut, CA 91789\nName of Beneficial Owner\nAmount and\nNature of\nBeneficial Ownership\nPercent of\nClass\nJuanzi Cui\n25,421,468\n71.53 %\nDirectors and officers as a group (1 person)\n25,421,468\n71.53 %\nItem 13. Certain Relationships and Related Transactions, and Director Independence.\nDuring the years ended December 31, 2022 and 2021, the Companys sole officer loaned the Company $1,500 and $53,332, respectively. As of December 31, 2022 and 2021, the Company was obligated to the officer, for an unsecured, non-interest bearing demand loan with a balance of $387,918 and $386,418, respectively.\nDirector Independence\nWe are not subject to listing requirements of any national securities exchange or national securities association and, as a result, we are not at this time required to have our board comprised of a majority of independent directors.\nItem 14. Principal Accounting Fees and Services.\nOur principal independent accountant is Simon & Edward, LLP. Their pre-approved fees billed to the Company are set forth below:\nYear Ended\nDecember 31,\nYear Ended\nDecember 31,\nAudit Fees\n$ 24,500\n$ 24,500\nAudit Related Fees\n$ -\n$ -\nTax Fees\n$ 3,500\n$ 3,500\nAll Other Fees\n$ -\n$ -\nAs of December 31, 2022, the Company did not have a formal documented pre-approval policy for the fees of the principal accountant. The Company does not have an audit committee. The percentage of hours expended on the principal accountants engagement to audit our financial statements for the most recent fiscal year that were attributed to work performed by persons other than the principal accountants full-time, permanent employees was 0%.\nPART IV\nItem 15. Exhibits. Financial Statement Schedules.\nExhibits\nExhibit No.\nDescription\n3.1\nAmended and Restated Articles of Incorporation of MakingORG, Inc. (1)\n3.2\nBylaws (2)\n10.1\nService Contract with Anchor Freight Services, Inc. (2)\n10.2\nStrategic Cooperation Framework Agreement, dated May 25, 2018, by and between the MakingORG, Inc. and Hangzhou Life Century Hualian Supermarket Chain Co., Ltd. (3)\n31.1\nRule 13a-14(a)/15d-14(a) Certifications*\n32.1\nSection 1350 Certification, Principal Executive Officer*\n32.2\nSection 1350 Certification, Principal Financial Officer*\n_______\n*\nFiled herewith\n(1)\nIncorporated by reference to the corresponding exhibit to the Companys Current Report on Form 8-K filed on August 22, 2014.\n(2)\nIncorporated by reference to the corresponding exhibit to the Companys registration statement on Form S-1 on filed on February 8, 2013.\n(3)\nIncorporated by reference to the corresponding exhibit to the Companys Current Report on Form 8-K filed on May 29, 2018.\nSIGNATURES\nPurusant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Company has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMAKINGORG, INC.\nDated: October 11, 2023\nBy:\n/s/ Juanzi Cui\nName:\nJuanzi Cui\nTitle:\nPresident, Chief Executive Officer, Chief\nFinancial Officer and Secretary and Director\n(Principal Executive, Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Company and in the capacities and on the dates indicated.\nDated: October 11, 2023\nBy:\n/s/ Juanzi Cui\nName:\nJuanzi Cui\nTitle:\nPresident, Chief Executive Officer, Chief\nFinancial Officer and Secretary and as a director\n(Principal Executive, Financial and Accounting Officer)  Item 8. Financial Statements.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of\nMakingORG, Inc.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of MakingORG, Inc. and subsidiaries (the Company) as of December 31, 2022 and 2021, the related consolidated statements of operation, stockholders equity, and cash flows for each of the two years in the period ended December 31, 2022, and the related notes. In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2022 and 2021, and the results of its operations and its cash flows for each of the two years in the period ended December 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt About the Companys Ability to Continue as a Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As described in Note 2 to the consolidated financial statements, the Company has suffered recurring losses from operations, has a net capital deficiency, and has stated that substantial doubt exists about the Companys ability to continue as a going concern. Managements evaluation of the events and conditions and managements plans regarding these matters are also described in Note 3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty. Our opinion is not modified with respect to this matter.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue recognition\nAs described in Note 2 and 6 to the consolidated financial statements, the Company generates its revenue from sales of acer truncatum bunge related health products exclusively from one customer. The Company evaluates its product sales contracts and determines that the contracts with its customer are distinct and contain one performance obligation. Performance obligation is satisfied when finished goods are delivered to the customer.\nWe identified the revenue recognition as a critical audit matter. Auditor judgement is involved in performing our audit procedures to evaluate whether the timing and amount of revenue recognition was appropriately stated.\nThe primary procedures we performed to address this critical audit matter included:\n·\nWe evaluated the relationship between the Company and the customer, and the reasonableness of the key terms of product sales contracts.\n·\nWe evaluated the performance obligations identified by the Company against the five-step model prescribed at ASC 606, Revenue form Contracts with Customers, and evaluated the managements conclusion.\n·\nWe tested the accuracy and cutoff of the revenue recognized by management through verifying the evidence of deliveries and value-added invoices issued.\n/s/ Simon & Edward, LLP\n(PCAOB #2485)\nRowland Heights, California\nOctober 10, 2023\nWe have served as the Companys auditor since 2016.\nMAKINGORG, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\nDecember 31,\nASSETS\nCurrent Assets\nCash and cash equivalents\n$ 23,852\n$ 108,356\nAccounts receivable - related party\n32,334\n-\nAdvances to vendor and others\n41,314\n80,677\nRight-of-use assets - operating lease, current\n24,587\n31,171\nTotal Current Assets\n122,087\n220,204\nTotal Assets\n$ 122,087\n$ 220,204\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent Liabilities\nInterest payable\n$ 152,000\n$ 128,000\nAccrued liabilities\n17,109\n11,234\nLease liabilities - operating lease\n23,681\n31,171\nDue to related party\n387,918\n386,418\nTotal Current Liabilities\n580,708\n556,823\nLong-Term Liabilities\nConvertible note payable, noncurrent\n200,000\n200,000\nLease liabilities - operating lease, noncurrent\n5,501\n-\nTotal Long-term Liabilities\n205,501\n200,000\nTOTAL LIABILITIES\n786,209\n756,823\nCommitment and Contingencies\nStockholders Equity (Deficit)\nPreferred stock, par value $0.001; 50,000,000 shares authorized, zero shares issued and outstanding\n-\n-\nCommon stock, par value $0.001; 150,000,000 shares authorized, 35,540,000 shares issued and outstanding\n35,540\n35,540\nAdditional paid-in capital\n583,882\n583,882\nAccumulated other comprehensive income\n(4,882 )\n6,266\nAccumulated deficit\n(1,278,662 )\n(1,162,307 )\nTotal Stockholders Deficit\n(664,122 )\n(536,619 )\nTotal Liabilities and Stockholders Deficit\n$ 122,087\n$ 220,204\nSee accompanying notes to consolidated financial statements.\nMAKINGORG, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nFor the years ended\nDecember 31,\nREVENUE - RELATED PARTY\n$ 38,751\n$ 611,328\nCost of Revenue\n31,252\n397,120\nGROSS PROFIT\n7,499\n214,208\nOPERATING EXPENSES\nSelling, general and administrative\n62,728\n102,297\nProfessional fees\n38,745\n88,248\nTOTAL OPERATING EXPENSES\n101,473\n190,545\n(LOSS) INCOME FROM OPERATIONS\n(93,974 )\n23,663\nOTHER INCOME (EXPENSE)\nInterest income\nInterest expense\n(24,000 )\n(24,000 )\nOther income, net\n2,297\n1,348\nLoss on inventory write-down\n-\n-\nTOTAL OTHER EXPENSE, NET\n(21,581 )\n(22,650 )\n(LOSS) INCOME BEFORE INCOME TAX\n(115,555 )\n1,013\nIncome tax\n1,627\nNET LOSS\n$ (116,355 )\n$ (614 )\nOTHER COMPREHENSIVE ITEM:\nForeign currency translation income\n(11,148 )\n3,775\nTOTAL COMPREHENSIVE LOSS\n$ (127,503 )\n$ (3,161 )\nNET LOSS PER COMMON SHARE: BASIC AND DILUTED\n$ (0.003 )\n$ (0.000 )\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING: BASIC AND DILUTED\n35,540,000\n35,540,000\nSee accompanying notes to consolidated financial statements.\nMAKINGORG, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS DEFICIT\nAccumulated\nAdditional\nOther\nTotal\nCommon Stock\nPaid-in\nComprehensive\nAccumulated\nStockholders\nShares\nAmount\nCapital\nIncome\nDeficit\nDeficit\nBalance, December 31, 2020\n35,540,000\n$ 35,430\n$ 583,882\n$ 2,491\n$ (1,161,693 )\n$ (539,780 )\nForeign currency translation income\n-\n-\n-\n3,775\n-\n3,775\nNet loss\n-\n-\n-\n-\n(614 )\n(614 )\nBalance, December 31, 2021\n35,540,000\n35,430\n583,882\n6,266\n(1,162,307 )\n(536,619 )\nForeign currency translation loss\n-\n-\n-\n(11,148 )\n-\n(11,148 )\nNet loss\n-\n-\n-\n-\n(116,355 )\n(116,355 )\nBalance, December 31, 2022\n35,540,000\n$ 35,540\n$ 583,882\n$ (4,882 )\n$ (1,278,662 )\n$ (664,122 )\nSee accompanying notes to consolidated financial statements.\nMAKINGORG, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the years ended\nDecember 31,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$ (116,355 )\n$ (614 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nAmortization of right-of-use assets\n4,194\n-\nChanges in assets and liabilities:\nAccounts receivable\n(33,202 )\n49,504\nPrepaid expenses and other current assets\n33,941\n(77,490 )\nInterest payable\n24,000\n24,000\nAccrued liabilities\n5,987\n6,408\nLease liabilities\n27,940\nCASH FLOWS (USED IN) PROVIDED BY OPERATING ACTIVITIES\n(80,912 )\n29,748\nCASH FLOWS FROM FINANCING ACTIVITIES\nLoan from related party\n1,500\n46,132\nCASH FLOWS PROVIDED BY FINANCING ACTIVITIES\n1,500\n46,132\nEFFECT OF EXCHANGE RATE CHANGES ON CASH\n(5,092 )\n1,776\nNET CHANGE IN CASH AND CASH EQUIVALENTS\n(84,504 )\n77,656\nCash and cash equivalents, beginning of period\n108,356\n30,700\nCash and cash equivalents, end of period\n$ 23,852\n$ 108,356\nSUPPLEMENTAL CASH FLOW INFORMATION:\nIncome taxes paid\n$ 800\n$ 800\nSee accompanying notes to consolidated financial statements.\nMAKINGORG, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION AND NATURE OF BUSINESS\nMakingORG, Inc. (MakingORG) was incorporated under the laws of the State of Nevada on August 10, 2012. The trading symbol is CQCQ and the fiscal year end is December 31. On October 20, 2016, MakingORG filed documents registering its intention to transact interstate business in the state of California. On November 29, 2016, MakingORG incorporated HK Feng Wang Group Limited (HKFW) under the laws of Hong Kong. On August 22, 2017, HKFW incorporated Chongqing Beauty Kenner Biotechnology Co., Ltd (CBKB) under the laws of the Peoples Republic of China (PRC).\nMaingORG, Inc. and subsidiaries (the Company) purchase Acer truncatum bunge seed oil from China, outsource to third party to manufacture Acer truncatum bunge related health products, and sell to end user and distributor in the United States and PRC.\nNOTE 2 - GOING CONCERN\nPursuant to ASU 2014-15, the Company has assessed its ability to continue as a going concern for a period of one year from the date of the issuance of these consolidated financial statements. Substantial doubt about an entitys ability to continue as a going concern exists when relevant conditions and events, considered in the aggregate, indicate that it is probable that the entity will be unable to meet its obligations as they become due within one year from the financial statement issuance date. The accompanying consolidated financial statements have been prepared in conformity with generally accepted accounting principle, which contemplate continuation of the Company as a going concern. The Company currently suffered recurring loss from operations, generated negative cash flow from operating activities and has an accumulated deficit and has not completed its efforts to establish a stabilized source of revenues sufficient to cover operating costs over an extended period. These conditions raise substantial doubt as to its ability to continue as a going concern. These consolidated financial statements do not include adjustments relating to the recoverability and classification of reported asset amounts or the amount and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nThe Company had net losses of $116,355 and $614 for the years ended December 31, 2022 and 2021 respectively. In addition, the Company had an accumulated deficit of $1,278,662 and $1,162,307, respectively, and generated not enough/negative cash flows from operating activities as of and for years ended December 31, 2022 and 2021, respectively. These factors raise substantial doubt about the Companys ability to continue as a going concern. The Companys ability to continue as a going concern is dependent on its ability to raise additional capital. The Companys consolidated financial statements do not include any adjustments relating to the recoverability and classification of reported asset amounts or the amount and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nManagement anticipates that the Company will be dependent, for the near future, on additional investment capital to fund operating expenses. The Company may seek additional funding through additional issuance of common stock and/or borrowings from financial institutions or the majority shareholder to support its normal business operations. Considering managements efforts, there is no assurance that the Company will be successful in this or any of its endeavors or become financially viable to continue as a going concern.\nNOTE 3 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation\nThe Companys consolidated financial statements refer to MakingORG, Inc. and its subsidiaries. All intercompany transactions and balances were eliminated in consolidation.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the U.S. requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the Companys consolidated financial statement date and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from these estimates.\nCash and Cash Equivalents\nCash and cash equivalents primarily consist of cash on deposit with banks and financial institutes and petty cash on hands.\nAccounts Receivable and Allowance for Doubtful Accounts\nAccounts receivables are reported realizable value, net of allowance for contractual credits and doubtful accounts, which are recognized in the period the related revenue is recorded. Accounts receivable consists principally of receivables from distributor or end user, arising from the sale of the Companys product. The Company provides an allowance for doubtful accounts equal to the estimated uncollectible amounts. The Management evaluated that there was no allowance for doubtful accounts as of December 31, 2022 and 2021, respectively.\nInventories\nInventories consist of (a) packing materials (b) raw materials and (c) finished goods, which are stated at the lower of cost or net realizable value under the first-in-first-out method. The Company reviews its inventories periodically for possible excess and obsolescence to determine if any reserves are necessary. As of December 31, 2022 and 2021, there were no inventory held on hands.\nRevenue Recognition\nThe Company adopted Topic 606, Revenue from Contracts with Customers, using the modified retrospective transition method on January 1, 2018. In general, the Companys performance obligation is to transfer it products to its end user or distributor. Revenues from product sales are recognized when the customer obtains control of the Companys finished goods product, which occurs at a point in time, typically upon delivery to the customer.\nThe Companys revenue mainly generates from sale of acer truncatum bunge related health products, such as Nervonic Acid Oil, coffee and tea. The Company evaluates its product sales contracts and determines that those contracts are generally capable of being distinct and accounted for as separate performance obligations. Performance obligation is satisfied when the finished goods product delivered to the customer.\nShipping and handling costs paid by the Company are included in cost of sales.\nAdvertising Expenses\nAdvertising costs are expensed as incurred. There were no advertising expenses for the years ended December 31, 2022 and 2021.\nIncome Taxes\nIncome taxes are computed using the asset and liability method. Under the asset and liability method, deferred income tax assets and liabilities are determined based on the differences between the financial reporting and tax bases of assets and liabilities and are using enacted tax rate expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. A valuation allowance is provided for deferred tax assets that, based on available evidence, if more likely than not that the company will not realize tax assets through future operation.\nThe 2017 Tax Reform Act permanently reduces the U.S. corporate income tax rate to a flat 21% rate. In addition, the 2017 Tax Reform Act also creates a new requirement that certain income (i.e., Global Intangible Low-Taxed Income (GILTI)) earned by controlled foreign corporations (CFCs) must be included in the gross income of the CFCs U.S. shareholder income. The tax law in PRC applies an income tax rate of 25% to all enterprises. The Companys subsidiary does not receive any preferential tax treatment from local government. The Company has been in loss position for years and zero balances of tax provisions, deferred tax assets and liabilities as of the reporting periods ended.\nBasic Income (Loss) Per Share\nBasic income (loss) per share is calculated by dividing the Companys net loss applicable to common shareholders by the weighted average number of common shares during the period. Diluted earnings per share is calculated by dividing the Companys net income available to common shareholders by the diluted weighted average number of shares outstanding during the year. The diluted weighted average number of shares outstanding is the basic weighted number of shares adjusted for any potentially dilutive debt or equity.\nForeign Currency Transactions\nThe functional currency for MakingORG and HKFW is US dollar. The functional currency for the China subsidiary (CBKB) is the Renminbi (RMB). Assets and liabilities of the China operation are translated from RMB into U.S. dollars at period-end rates, while the statements of operations and cash flows are translated at the weighted-average exchange rates for the period. The related translation adjustments are reflected as a foreign currency translation adjustment in accumulated other comprehensive income/(loss) within shareholders deficit.\nThe Company translates the assets and liabilities into U.S. dollars using the rate of exchange prevailing at the balance sheet date and the statements of operations and cash flows are translated at an average rate during the reporting period. Adjustments resulting from the translation from RMB into U.S. dollars are recorded in stockholders equity as part of accumulated other comprehensive income. The exchange rates used for financial statements are as follows:\nAverage Rate for the Twelve\nMonths Ended December 31,\nChina yuan (RMB)\nRMB\n6.728489\nRMB\n6.452480\nUnited States dollar (USD)\nUSD\n1.000000\n$\n1.000000\nExchange Rate at\nDecember 31,\nDecember 31,\nChina yuan (RMB)\nRMB\n6.909062\nRMB\n6.355095\nUnited States dollar (USD)\nUSD\n1.000000\n$\n1.000000\nRelated Parties\nThe Company follows ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions.\nLease\nThe Company adopted the new lease accounting - ASC 842 on January 1,2019. The Company determines if an arrangement is or contains a lease at inception. Operating leases with lease terms of more than 12 months are included in operating lease assets, accrued and other current liabilities, and long-term operating lease liabilities on its consolidated balance sheet. Operating lease assets represent its right to use an underlying asset for the lease term and lease liabilities represent its obligation to make lease payments over the lease term. Operating lease assets and liabilities are recognized based on the present value of the remaining lease payments discounted using its incremental borrowing rate. Lease expense is recognized on a straight-line basis over the lease term.\nSegment Reporting\nThe Company follows Financial Accounting Standards Board (FASB) ASC Topic 280, Segment Reporting for its segment reporting. The Company aggregates its operating segments into one reporting segment, as management believes that its operating segments have similar operating characteristics and similar long-term operating performance.\nFair Value of Financial Instruments\nFair value is defined as the price that would be received upon sale of an asset or paid upon transfer of a liability in an orderly transaction between market participants at the measurement date and in the principal or most advantageous market for that asset or liability. The fair value should be calculated based on assumptions that market participants would use in pricing the asset or liability, not on assumptions specific to the entity. In addition, the fair value of liabilities should include consideration of non-performance risk including the Companys own credit risk.\nIn addition to defining fair value, the standard expands the disclosure requirements around fair value and establishes a fair value hierarchy for valuation inputs. The hierarchy prioritizes the inputs into three levels based on the extent to which inputs used in measuring fair value are observable in the market. Each fair value measurement is reported in one of the three levels which are determined by the lowest level input that is significant to the fair value measurement in its entirety. These levels are:\nLevel 1 - inputs are based upon unadjusted quoted prices for identical instruments traded in active markets.\nLevel 2 - inputs are based upon significant observable inputs other than quoted prices included in Level 1, such as quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant assumptions are observable in the market or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - inputs are generally unobservable and typically reflect managements estimates of assumptions that market participants would use in pricing the asset or liability. The fair values are therefore determined using model-based techniques that include option pricing models, discounted cash flow models, and similar techniques.\nThe carrying amounts of financial assets and liabilities in the consolidated balance sheets for cash and cash equivalents, advances to vendor, accrued expenses, interest payable and due to related party approximate their fair value due to the short-term duration of those instruments. Convertible notes payable is recorded at agreed values.\nRecently Issued Accounting Pronouncement Not Yet Adopted\nIn June 2016, the FASB issued ASU No. 2016-13, (FASB ASC Topic 326), Financial Instruments - Credit Losses: Measurement of Credit Losses on Financial Instruments which amends the current accounting guidance and requires the use of the new forward-looking expected loss model, which requires all expected losses to be determined based on historical experience, current conditions and reasonable and supportable forecasts, rather than the incurred loss model. This guidance amends the accounting for credit losses for most financial assets and certain other instruments including trade and other receivables, held-to-maturity debt securities, loans and other instruments. The effective date of ASU No. 2016-13 for smaller reporting companies is postponed to fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. The Company believes the adoption of ASU No. 2016-13 will not have a material impact on its financial position and results of operations.\nThe management does not believe that other than disclosed above, the recently issued but not yet adopted accounting pronouncements will have a material impact on its financial position results of operations or cash flows.\nNOTE 4 - ADVANCES TO VENDOR AND OTHERS\nAdvances to vendors and others was advance for purchasing of packaging materials. There were $41,314 and $nil advances to vendor as of December 31, 2022 and 2021, respectively. No interest bearing for the advances to vendor, which is expecting to use during 2023.\nNOTE 5 - RELATED PARTY TRANSACTIONS\nDue to Related Party\nThe Company lent RMB 80,000 (approximately $12,209) to the Entity A, a related party whose shareholder is a board member of CBKB, and the landlord of the office space CBKB leased in China. The loan has a term of six months and matured on March 31, 2021, with a monthly interest rate of 1%. According to the loan agreement, the loan principal could be applied to the monthly lease payment for two months (RMB 40,000 per month). The related party was not able to pay back the loan on the maturity date and CBKB withheld April and May 2021 lease payments to offset with the loan principal due. Entity A paid the entire interest of RMB 4,800 back on April 1, 2021.\nDue from Related Party\nThe Company borrows from its sole officer when there are business operation needs. For the years ended December 31, 2022 and 2021, the Companys Chief Executive Officer (CEO) lent the Company $1,500 and $46,132, respectively, with the loan balances totaled $387,918 and $386,418 as of December 31,2022 and 2021. The loans were unsecured, non-interest bearing and due on demand.\nRevenue - Related Party\nThe Company sells its product to a related party, Entity A. For the years ended December 31, 2022 and 2021, the Companys total revenue generated from the sales transactions with the related party were $38,751 and $611,328, respectively. As of December 31, 2022 and 2021, accounts receivable due from Entity A were $32,334 and $nil, respectively.\nLease Agreement\nOn June 1, 2020, the Company entered into a lease agreement with Entity A in Chongqing, China for the period from June 1, 2020 to May 31, 2021. Pursuant to the lease agreement, the Company pays a monthly rent of RMB40,000 (approximately $5,800) paid quarterly before the start of each quarter. The lease is for a one-year term and the Company has the priority to renew the lease. The Company tend to keep leasing the property after the lease term ends. Therefore, based on the lease agreement, we did the recognition of right-of-use (ROU) assets and lease liabilities on the balance sheet. Refer to Note 9 - Lease for details.\nOn March 1, 2022, the Company entered into a lease agreement with Entity A for the period from March 1, 2022 to February 28, 2023. Pursuant to the lease agreement, monthly rent is lowered to RMB20,000 (approximately $3,200), payable by the 5th of each month with the first two months rent free. The lease is for a one-year term and the Company has the right of first refusal or renew the lease. The Company recognized right-of-use assets and lease liabilities on the balance sheet upon executed of the lease agreement. Refer to Note 9 - Lease for details.\nNOTE 6 - BUSINES CONCENTRATION AND RISKS\nConcentration of Risk\nThe Company maintains cash with banks in the USA, Peoples Republic of China (PRC or China), and Hong Kong. Should any bank holding cash become insolvent, or if the Company is otherwise unable to withdraw funds, the Company would lose the cash with that bank; however, the Company has not experienced any losses in such accounts and believes it is not exposed to any significant risks on its cash in bank accounts. In China, a depositor has up to RMB 500,000 insured by the Peoples Bank of China Financial Stability Bureau (FSD). In Hong Kong, a depositor has up to HKD 500,000 insured by Hong Kong Deposit Protection Board (DPB). In the United States, the standard insurance amount is $250,000 per depositor in a bank insured by the Federal Deposit Insurance Corporation (FDIC).\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist principally of cash and cash equivalents. As of December 31, 2022 and 2021, the Companys cash and cash equivalents were fully insured.\nMajor customer\nFor the years ended December 31, 2022 and 2021, the Company generated revenues exclusively from one customer - Entity A in the amounts of $38,751 and $611,328, respectively. As of December 31, 2022, the $32,334 accounts receivable due from Entity A accounted 100% of the accounts receivable balance outstanding.\nMajor vendors\nFor the years ended December 31, 2022 and 2021, the Companys purchase from the vendors accounted more than 10% of total purchase were:\nYears Ended December 31,\nAmount\n% of Total Purchase\nAmount\n% of Total Purchase\nVendor A\n$ 30,466\n100 %\n$ 231,280\n52 %\nVendor B\n$ -\n-\n%\n$ 108,770\n25 %\nVendor C\n$ -\n-\n%\n$ 57,071\n13 %\nNOTE 8 - CONVERTIBLE NOTE PAYABLE\nOn September 1, 2016, the Company entered into a Convertible Note Agreement in the principal amount of $200,000 with an unrelated party. The note bears interest at 12% per annum and the holder is able to convert all unpaid interest and principal into common shares at $3.50 per share. The note matures on September 1, 2018. The Company recognized a discount on the note of $38,857 at the agreement date. The interest expense was due every six months commencing on March 1, 2017 until the principal amount of this convertible note is paid in full.\nOn September 1, 2018, the Company entered into an Amended and Restated 12% Convertible Promissory Note. Pursuant to an Amended and Restated 12% Convertible Promissory Note, both parties agreed to extend a Convertible Note Agreement to September 1, 2019 with no additional consideration. The Company recognized a discount on the note of $40,000 at the amended agreement date.\nOn September 1, 2019, the Company entered into an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2020 with no additional consideration. The Company recognized a discount on the note of $54,400 at the amended agreement date. Since the conversion feature of conventional convertible debt provides for a rate of conversion that is below market value, this feature is characterized as a beneficial conversion feature (BCF). A BCF is recorded by the Company as a debt discount pursuant to ASC Topic 470-20 Debt with Conversion and Other Options. In those circumstances, the convertible debt is recorded net of the discount related to the BCF and the Company amortizes the discount to interest expense over the life of the debt using the effective interest method.\nOn September 1, 2020, the Company entered into an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2022 with no additional consideration. The Company recognized a discount on the note of $0 at the amended agreement date.\nOn September 1, 2022, the Company signed an amended and restated 12% convertible promissory note. Pursuant to the amended convertible promissory note, both parties agreed to extend the convertible note agreement to September 1, 2024 with no additional consideration. The Company recognized a discount on the note of $0 at the amended agreement date.\nThe Company recognized interest expense related to the convertible note of $24,000 and $24,000, respectively, for the years ended December 31, 2022 and 2021, respectively. As of December 31, 2022, and 2021, the Company had $152,000 and $128,000 interest payable associated with the $200,000 convertible note, respectively.\nNOTE 9 - LEASE\nThe Company adopted ASC 842 on January 1, 2019. The Company entered an operating lease for its China office with Entity A with monthly rent of RMB40,000 (approximately $5,800). The lease was for one year and the Company has the priority to renew it. The Company intended to renew the lease. Leases was classified as operating at the inception of the lease. Operating leases result in the recognition of ROU assets and lease liabilities on the balance sheet. ROU assets and operating lease liabilities are recognized based on the present value of lease payments over the lease terms of the commencement date. Because the leases do not provide an explicit or implicit rate of return, the Company determines incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments on an individual lease basis. The incremental borrowing rate for a lease is the rate of interest the Company would have to pay on a collateralized basis to borrow an amount equal to the lease payments for the asset under similar term, which is 5.25%. The lease does not contain any residual value guarantees or material restrictive covenants. The remaining term including the renewal term as of September 30, 2021 was 8 months. The Company has no finance lease.\nOn March 1, 2022, the Company entered into a new lease agreement with Entity A at the same premise for the one-year term from March 1, 2022 to February 28, 2023 with one year renewal automatically. The lease was classified as an operating lease, and ROU assets and operating lease liabilities are recognized based on the present value of lease payments over the lease terms of the commencement date. Because the leases do not provide an explicit or implicit rate of return, the Company determines the incremental borrowing rate is 5.25%. The lease does not contain any residual value guarantees or material restrictive covenants.\nThe components of lease expense consist of the following:\nYears Ended December 31,\nClassification\nOperating lease cost\nSelling, General & Administrative expenses\n$\n18,873\n$\n70,848\nBalance sheet information related to leases consists of the following:\nClassification\nDecember 31,\nDecember 31,\nAssets\nOperating lease ROU assets\nRight-of-use assets\n$\n24,587\n$\n31,171\nLiabilities\nOperating lease liabilities\nCurrent portion\n$\n23,681\n$\n31,171\nOperating lease liabilities\nLong-term portion\n5,501\n-\nTotal lease liabilities\n$\n29,182\n$\n31,171\nWeighted average remaining lease term\nOperating leases\n1.17\n0.42\nWeighted average discount rate\nOperating leases\n5.25\n%\n5.25\n%\nCash flow information related to leases consists of the following:\nYears Ended\nDecember 31,\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$ 18,873\n$ 37,195\nRight-of-use assets obtained in exchange for lease obligations:\nOperating leases\n15,449\n71,066\nAs previously discussed, the Company adopted Topic 842 by applying the guidance at adoption date, January 1, 2019. As required, the following disclosure is provided for periods prior to adoption, which continue to be presented in accordance with ASC 840.\nFuture minimum lease payment under non-cancellable lease as of December 31, 2022 was as follows:\nOperating Leases\n$ 24,812\n5,514\nTotal lease payments\n30,326\nLess: Interest\n(1,144 )\nPresent value of lease liabilities\n$ 29,182\nNOTE 9 - STOCKHOLDERS DEFICIT\nCommon Stock\nNo common stock was issued in 2022 and 2021. As of December 31, 2022 the Company had 35,540,000 shares of common stock issued and outstanding.\nNOTE 10 - INCOME TAXES\nThe Company accounts for income taxes under ASC 740, Income Taxes. ASC 740 requires the use of an asset and liability approach in accounting for income taxes. Deferred tax assets and liabilities are recorded based on the differences between the financial statement and tax basis of assets and liabilities and the tax rates in effect when these differences are expected to reverse. It also requires the reduction of deferred tax assets by a valuation allowance if, based on the weight of available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized.\nThe Company is subject to taxation in the United States and certain state jurisdictions. The provision for income taxes differs from the amounts which would be provided by applying the statutory federal income tax rate of 21% to the net loss before provision for income taxes. HKFW in Hong Kong are governed by the Inland Revenue Ordinance Tax Law of Hong Kong, and are generally subject to a profits tax at the rate of 16.5% on the estimated assessable profits. CBNB in the PRC is governed by the Income Tax Law of the PRC concerning the private enterprises, which are generally subject to tax at 25% on income reported in the statutory financial statements after appropriate adjustments. PRC also gives tax discount to small enterprises whose annual taxable income is between one million to three million.\nThe Companys income tax expense is mainly contributed by its subsidiary in PRC.\nIn addition, the 2017 Tax Act also creates a new requirement that certain income (i.e., Global Intangible Low-Taxed Income (GILTI)) earned by controlled foreign corporations (CFCs) must be included currently in the gross income of the CFCs U.S. shareholder income. GILTI is the excess of the shareholders net CFC tested income over the net deemed tangible income return, which is currently defined as the excess of (1) 10 percent of the aggregate of the U.S. shareholders pro rata share of the qualified business asset investment of each CFC with respect to which it is a U.S. shareholder over (2) the amount of certain interest expense taken into account in the determination of net CFC-tested income. The Company has elected to recognize the tax on GILTI as a period expense in the period the tax is incurred. For the years ended December 31, 2022 and 2021, no GILTI tax obligation existed and the GILTI tax expense was nil.\nProvision (benefit) for income tax for the year ended December 31, 2022 consisted of:\nYear ended December 31, 2022\nFederal\nState\nForeign\nTotal\nCurrent\n$ -\n$ 800\n$ -\n$ 800\nDeferred\n-\n-\n-\n-\nTotal\n$ -\n$ 800\n$ -\n$ 800\nProvision (benefit) for income tax for the year ended December 31, 2021 consisted of:\nYear ended December 31, 2021\nFederal\nState\nForeign\nTotal\nCurrent\n$ -\n$ 800\n$ 827\n$ 1,627\nDeferred\n-\n-\n-\n-\nTotal\n$ -\n$ 800\n$ 827\n$ 1,627\nNet deferred tax assets consist of the following components as of:\nDecember 31,\nDeferred tax asset:\nNet operating loss carry forwards\n$ 185,149\n$ 182,688\nValuation allowance\n(185,149 )\n(182,688 )\nNet deferred tax asset\n$ -\n$ -\nDue to the change in ownership provisions of the Income Tax laws of United States of America, net operating loss carry forwards of approximately $458,700, will carry indefinitely for federal income tax reporting purposes are subject to annual limitations. When a change in ownership occurs, net operating loss carry forwards may be limited to use in future years. Tax filings for the Company for the years after 2018 is available for examination by state tax jurisdictions and federal tax purposes.\nNOTE 11 - SEGMENT REPORTING\nThe geographical distributions of the Companys financial information for the years ended December 31, 2022 and 2021 were as follows:\nFor the Years ended\nDecember 31,\nGeographic Areas\nRevenue\nPRC\n38,751\n611,328\nUSA\n-\n-\nTotal Revenue\n$ 38,751\n$ 611,328\nIncome (Loss) from Operations\nPRC\n$ (53,000 )\n$ (114,699 )\nUSA\n(40,974 )\n91,036\nTotal Loss from operations\n$ (93,974 )\n$ (23,663 )\nNet Income (Loss)\nPRC\n$ (50,582 )\n$ 115,220\nUSA\n(65,773 )\n(115,834 )\nTotal Net Loss\n$ (116,355 )\n$ (614 )\nThe geographical distribution of the Companys financial information as of December 31, 2022 and 2021 were as follows:\nFor the Years ended\nDecember 31,\nGeographic Areas\nReportable Assets\nPRC\n259,713\n323,893\nUSA\n111,869\n44,498\nElimination\n(25,757 )\n(148,187 )\nTotal Reportable Assets\n$ 122,087\n$ 220,204\nNOTE 12 - SUBSEQUENT EVENT\nThe Company has evaluated all subsequent events through the date the consolidated financial statements were issued and determine that there were no subsequent events or transactions that require recognition or disclosures in the consolidated financial statements. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nThere were no changes in or disagreements with accountants on accounting and financial disclosure for the year ended December 31, 2022 and 2021. Item 9A. Controls and Procedures\nEVALUATION OF DISCLOSURE CONTROLS\nUnder the supervision and with the participation of our management, including our principal executive officer and principal financial officer, the Company conducted an evaluation of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) and Rule 15d-15(e) promulgated under the Securities Exchange Act of 1934, as amended (the Exchange Act), as of December 31, 2019. Based on this evaluation, our principal executive officer and principal financial officer has concluded that, because of the material weaknesses in our internal control over financial reporting due to lack of segregation of duties discussed below, the Companys disclosure controls and procedures were not effective to ensure that information required to be disclosed by the Company in the reports filed or submitted under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Securities and Exchange Commissions rules and forms and that the Companys disclosure and controls are designed to ensure that information required to be disclosed by the Company in the reports that we file or submit under the Exchange Act is accumulated and communicated to management, including our principal executive officer and principal financial officer, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. Notwithstanding the material weaknesses discussed below, our principal executive officer and principal financial officer has concluded that the consolidated financial statements included in this Form 10-K present fairly, in all material respects, our financial position, results of operations and cash flows for the periods presented in conformity with accounting principles generally accepted in the United States.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over our financial reporting. Internal control over financial reporting is a process to provide reasonable assurance regarding the reliability of our financial reporting for external purposes in accordance with generally accepted accounting principles. Internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that in reasonable detail accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements and that receipts and expenditures of company assets are made in accordance with management authorization; and (iii) provide reasonable assurance that unauthorized acquisition, use or disposition of company assets that could have a material effect on our financial statements would be prevented or detected on a timely basis. Because of its inherent limitations, internal control over financial reporting is not intended to provide absolute assurance that a misstatement of our financial statements would be prevented or detected.\nOur management evaluated the effectiveness of our internal control over financial reporting as of December 31, 2022 based on the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. Based on managements assessment, including consideration of the control deficiencies discussed below, management has concluded that the Companys internal control over financial reporting was not effective as of December 31, 2022 due to the fact that there was a material weakness in its internal control over financial reporting. Specifically, through the investigation discussed above, management identified a lack of segregation of duties as well as errors in financial statement presentation and disclosure.\nThe specific material weaknesses identified by our management were as follows:\n·\nLack of Segregation of Duties\n·\nLack of well-established procedures to identify, approve and report related party transaction\nManagement is aware that there is a lack of segregation of duties and lack of well-established procedures to identify, approve and report related party transaction at the Company due to the lack of employees dealing with general administrative and financial matters. However, at this time management has decided that considering the abilities of the employees now involved and the control procedures in place, the risks associated with such lack of segregation are low and the potential benefits of hiring employees to clearly segregate duties do not justify the substantial expenses associated with such increases. Management will periodically reevaluate this situation.\nIn order to mitigate the foregoing material weakness, we have engaged an outside accounting consultant with significant experience in the preparation of financial statements in conformity with U.S. GAAP to assist us in the preparation of our financial statements to ensure that these financial statements are prepared in conformity to U.S. GAAP. Management believes that this will lessen the possibility that a material misstatement of our annual or interim financial statements will be prevented or detected on a timely basis, and we will continue to monitor the effectiveness of this action and make any changes that our management deems appropriate.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to the exemption provided to issuers that are not large accelerated filers nor accelerated filers under the Dodd-Frank Wall Street Reform and Consumer Protection Act.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during our last fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nDirectors and Executive Officers\nSet forth below are the names, ages and present principal occupations or employment, and material occupations, positions, offices or employments for the past five years of our current director and executive officer.\nName\nAge\nPosition\nJuanzi Cui\nPresident, Chief Executive Officer, Chief Financial Officer and Secretary and as a director\nJuanzi Cui, age 52, has been the President of the Chongqing Municipal Health Management Association since March of 2014. Since 2011 she has been the Chairman of the Chongqing Huang Xin Technology Limited Liability Corporation. Since 2007 she has been the Vice President and Secretary General of Dietitians Association of Chongqing. Since 2006 she is the Chief Executive Officer and President of the Chongqing City Ziman Nutrition and Health Vocational Training School.\nThe director of the Company serves for a term of one year or until the successor is elected at the Companys annual stockholders meeting and is qualified, subject to removal by the Companys stockholders. The officer serves, at the pleasure of the board of directors, for a term of one year and until the successor is elected at the annual meeting of the board of directors.\nThere are no familial relationships among any of our officers or directors. None of our directors or officers is a director in any other reporting companies. None of our directors or officers has been affiliated with any company that has filed for bankruptcy within the last ten years. The Company is not aware of any proceedings to which any of the Companys officers or directors, or any associate of any such officer or director, is a party adverse to the Company or has a material interest adverse to the Company.\nCode of Ethics; Financial Expert\nBecause of the small size and limited resources of the Company, we do not currently have a Code of Ethics applicable to our principal executive, financial and accounting officers. We do not have a financial expert on the board or an audit committee or nominating committee.\nPotential Conflicts of Interest\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. Thus, there is a potential conflict of interest in that our directors and officers have the authority to determine issues concerning management compensation and audit issues that may affect management decisions. We are not aware of any other conflicts of interest with any of our executives or directors.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934 requires executive officers and directors of the Company and persons who own more than 10% of a registered class of the Companys equity securities to file reports of ownership and changes in their ownership with the Securities and Exchange Commission, and forward copies of such filings to the Company. Our sole executive officer and director complied with the Section 16(a) filing requirements since she acquired control of the Company.\nInvolvement in Certain Legal Proceedings\nThere are no legal proceedings that have occurred within the past ten years concerning our directors, or control persons which involved a criminal conviction, a criminal proceeding, an administrative or civil proceeding limiting ones participation in the securities or banking industries, or a finding of securities or commodities law violations. Item 11. Executive Compensation.\nSummary Compensation\nSince our incorporation in August 2012, no compensation has been paid to our directors or executive officers in consideration for their services rendered to our Company in their capacity as such. We have no employment agreements with any of our directors or executive officers. We have no pension, health, annuity, bonus, insurance, stock options, profit sharing or similar benefit plans\nSince our incorporation, no stock options or stock appreciation rights were granted to any of our directors or executive officers. We have no equity incentive plans.\nOutstanding Equity Awards\nSince our incorporation, none of our directors or executive officers has held unexercised options, stock that had not vested, or equity incentive plan awards.\nCompensation of Directors\nSince the incorporation in August 2012, no compensation has been paid to any of our directors in consideration for their services rendered in their capacity as directors. No arrangements are presently in place regarding compensation to directors for their services as directors. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table lists, as of April 11, 2019, the number of shares of common stock of our Company that are beneficially owned by (i) each person or entity known to our Company to be the beneficial owner of more than 5% of the outstanding common stock; (ii) each executive officer and director of our Company; and (iii) all executive officers and directors as a group. Information relating to beneficial ownership of common stock by our principal shareholders and management is based upon information furnished by each person using beneficial ownership concepts under the rules of the Securities and Exchange Commission. Under these rules, a person is deemed to be a beneficial owner of a security if that person has or shares voting power, which includes the power to vote or direct the voting of the security, or investment power, which includes the power to vote or direct the voting of the security. The person is also deemed to be a beneficial owner of any security of which that person has a right to acquire beneficial ownership within 60 days. Under the Securities and Exchange Commission rules, more than one person may be deemed to be a beneficial owner of the same securities, and a person may be deemed to be a beneficial owner of securities as to which he or she may not have any pecuniary beneficial interest. Except as noted below, each person has sole voting and investment power.\nThe percentages below are calculated based on 35,540,000 shares of our common stock issued and outstanding as of July 11, 2023. We do not have any outstanding options, warrants or other securities exercisable for or convertible into shares of our common stock. Unless otherwise indicated, the address of each person listed is c/o Making ORG, Inc., 385 S. Lemon Avenue #E 301, Walnut, CA 91789\nName of Beneficial Owner\nAmount and\nNature of\nBeneficial Ownership\nPercent of\nClass\nJuanzi Cui\n25,421,468\n71.53 %\nDirectors and officers as a group (1 person)\n25,421,468\n71.53 % Item 13. Certain Relationships and Related Transactions, and Director Independence.\nDuring the years ended December 31, 2022 and 2021, the Companys sole officer loaned the Company $1,500 and $53,332, respectively. As of December 31, 2022 and 2021, the Company was obligated to the officer, for an unsecured, non-interest bearing demand loan with a balance of $387,918 and $386,418, respectively.\nDirector Independence\nWe are not subject to listing requirements of any national securities exchange or national securities association and, as a result, we are not at this time required to have our board comprised of a majority of independent directors. Item 14. Principal Accounting Fees and Services.\nOur principal independent accountant is Simon & Edward, LLP. Their pre-approved fees billed to the Company are set forth below:\nYear Ended\nDecember 31,\nYear Ended\nDecember 31,\nAudit Fees\n$ 24,500\n$ 24,500\nAudit Related Fees\n$ -\n$ -\nTax Fees\n$ 3,500\n$ 3,500\nAll Other Fees\n$ -\n$ -\nAs of December 31, 2022, the Company did not have a formal documented pre-approval policy for the fees of the principal accountant. The Company does not have an audit committee. The percentage of hours expended on the principal accountants engagement to audit our financial statements for the most recent fiscal year that were attributed to work performed by persons other than the principal accountants full-time, permanent employees was 0%.\nPART IV Item 15. Exhibits. Financial Statement Schedules.\nExhibits\nExhibit No.\nDescription\n3.1\nAmended and Restated Articles of Incorporation of MakingORG, Inc. (1)\n3.2\nBylaws (2)\n10.1\nService Contract with Anchor Freight Services, Inc. (2)\n10.2\nStrategic Cooperation Framework Agreement, dated May 25, 2018, by and between the MakingORG, Inc. and Hangzhou Life Century Hualian Supermarket Chain Co., Ltd. (3)\n31.1\nRule 13a-14(a)/15d-14(a) Certifications*\n32.1\nSection 1350 Certification, Principal Executive Officer*\n32.2\nSection 1350 Certification, Principal Financial Officer*\n_______\n*\nFiled herewith\n(1)\nIncorporated by reference to the corresponding exhibit to the Companys Current Report on Form 8-K filed on August 22, 2014.\n(2)\nIncorporated by reference to the corresponding exhibit to the Companys registration statement on Form S-1 on filed on February 8, 2013.\n(3)\nIncorporated by reference to the corresponding exhibit to the Companys Current Report on Form 8-K filed on May 29, 2018.\nSIGNATURES\nPurusant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Company has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMAKINGORG, INC.\nDated: October 11, 2023\nBy:\n/s/ Juanzi Cui\nName:\nJuanzi Cui\nTitle:\nPresident, Chief Executive Officer, Chief\nFinancial Officer and Secretary and Director\n(Principal Executive, Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Company and in the capacities and on the dates indicated.\nDated: October 11, 2023\nBy:\n/s/ Juanzi Cui\nName:\nJuanzi Cui\nTitle:\nPresident, Chief Executive Officer, Chief\nFinancial Officer and Secretary and as a director\n(Principal Executive, Financial and Accounting Officer)"
}