{
    "cik": "1584693",
    "company": "Healthcare Integrated Technologies Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-11-13",
    "period_of_report": "2023-07-31",
    "sic": "7900",
    "state_of_inc": "NV",
    "state_location": "TN",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1584693/0001493152-23-040543-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1584693/000149315223040543/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1584693/0001493152-23-040543.txt",
    "filename": "1584693_10K_2023_0001493152-23-040543.htm",
    "content": "ITEM 1. BUSINESS.\nOverview\nHealthcare Integrated Technologies, Inc. and its subsidiaries (collectively the Company, we, our or us) is a healthcare technology company based in Knoxville, Tennessee. We are creating a diversified spectrum of healthcare technology solutions to integrate and automate the continuing care, home care and professional healthcare spaces.\nOur initial product, SafeSpace™ with AI Vision™, is an ambient fall detection solution designed for continuing care communities and at home use. SafeSpace includes hardware devices utilizing RGB, radar and other sensor technology coupled with our internally developed software to effectively monitor a person remotely. In continuing care communities, SafeSpace detects resident falls and generates alerts to a centralized, intelligent dashboard without the use of wearable devices or any action by the resident. In the home, SafeSpace detects falls and sends alerts directly to designated individuals.\nWe recently introduced and are currently pilot testing two additional products - SafeFace™ and SafeGuard™. SafeFace provides fully automated and ambient time and attendance reporting for facility staff, and an integrated and automatic agency invoice reconciliation feature. SafeGuard is a novel fully ambient elopement detection and alerting system based on our facial recognition technology.\nIn addition to our current product offerings, we are developing a home concierge healthcare service application to provide a virtual assisted living experience for seniors, recently released postoperative patients, and others. The concierge application will enable the consumer to obtain home healthcare services and health and safety monitoring equipment to improve quality of life. We are also working to develop a fully integrated solution for the professional healthcare community that integrates electronic health records, remote patient monitoring, telehealth, and other items where integration is beneficial.\nOur History\nThe Company has had three distinct businesses. First, we were incorporated in the state of Nevada on June 25, 2013 as Tomichi Creek Outfitters, aiming to provide professionally guided big game hunts in Sargents, Colorado which is approximately four hours southwest from Denver. This area of the country is home to trophy size Elk and Mule Deer. Our secondary business included offering guided scenic tours on the western slopes of the Rocky Mountains. Every season offers a diversified plethora of wildlife and stunning scenic views. Our Chief Executive Officer (CEO) and sole director at that time was Jeremy Gindro. These operations were discontinued in 2015.\nSecond, on March 2, 2015, the Company entered into a Business Acquisition Agreement and share exchange under which we acquired the business and assets of Grasshopper Staffing, Inc. (Grasshopper Colorado), formed in the state of Colorado on January 13, 2015. The exchange for $10,651 was represented by 250,000 shares of the Companys common stock in exchange for all the outstanding shares of Grasshopper Colorado. The assets purchased include the trademark and website, office supplies and office furniture. On November 2, 2015 we filed a Certificate of Amendment to our Articles of Incorporation changing the name of our Company from Tomichi Creek Outfitters to Grasshopper Staffing, Inc. Grasshopper Colorado was operating as a wholly owned subsidiary of the Company and was the primary operation of our business until the acquisition of IndeLiving Holdings Inc., on March 13, 2018. Our management consisted of Melanie Osterman as CEO, and Jeremy Gindro who was our sole director. The operations of Grasshopper Colorado were discontinued in February 2019.\nThird, we acquired IndeLiving Holdings, Inc. (IndeLiving) on March 13, 2018 and changed our name to Healthcare Integrated Technologies, Inc. Our current operations are described in the above Overview section. With the acquisition of IndeLiving, we had another change in management, and Scott M. Boruff became our CEO and Chairman of the Board of Directors.\nEmployees and Human Capital\nAt July 31, 2023, we had 4 employees.\nAt July 31, 2022, we had 4 employees.\nNone of our employees are represented by a union or covered by a collective bargaining agreement. We have not experienced any work stoppages and we consider our relationship with our employees to be good.\nOur objectives surrounding human capital resources include, as applicable, identifying, recruiting, retaining, incentivizing and integrating our existing and new employees, advisors and consultants. The principal purposes of our equity incentive plan are to attract, retain and reward personnel through the granting of stock-based compensation awards, in order to increase stockholder value and promote the success of our company by motivating such individuals to perform to the best of their abilities and achieve our objectives.\nAvailable Information\nWe electronically file certain documents with the Securities and Exchange Commission (the SEC). We file annual reports on Form 10-K; quarterly reports on Form 10-Q; and current reports on Form 8-K (as appropriate); along with any related amendments and supplements thereto. From time-to-time, we may also file registration statements and related documents in connection with equity or debt offerings. You may read and copy any materials we file with the SEC at the SECs Public Reference Room at 100 F Street, NE, Washington, DC 20549. You may obtain information regarding the Public Reference Room by calling the SEC at 1-800-SEC-0330. In addition, the SEC maintains an internet website at www.sec.gov that contains reports and other information regarding registrants that file electronically with the SEC. ITEM 1A. RISK FACTORS.\nRisks Related to Economic and Market Conditions\nGeneral Economic and Financial Conditions\nThe success of any investment activity is influenced by general economic and financial conditions, all of which are beyond the control of the Company. These conditions, such as the recent global economic concerns and significant downturns in the financial markets, may materially adversely affect our operating results, financial condition and ability to implement our business strategy and/or meet our return objectives.\nRisks Related to Our Business\nThe Companys industry is highly competitive and we have less capital and resources than many of our competitors, which may give them an advantage in developing and marketing products similar to ours or make our products obsolete\nWe are involved in a highly competitive industry where we may compete with numerous other companies who offer alternative methods or approaches, who may have far greater resources, more experience, and personnel more qualified than we do. Such resources may give our competitors an advantage in developing and marketing products similar to ours or products that make our products obsolete. There can be no assurance that we will be able to successfully compete against these other entities.\nThe Company may be unable to respond to the rapid technological change in its industry and such change may increase costs and competition that may adversely affect its business\nRapidly changing technologies, frequent new product and service introductions and evolving industry standards characterize the Companys market. The continued growth of the internet and intense competition in the Companys industry exacerbate these market characteristics. The Companys future success will depend on its ability to adapt to rapidly changing technologies by continually improving the performance features and reliability of its products and services. The Company may experience difficulties that could delay or prevent the successful development, introduction or marketing of its products and services. In addition, any new enhancements must meet the requirements of its current and prospective users and must achieve significant market acceptance. The Company could also incur substantial costs if it needs to modify its products and services or infrastructures to adapt to these changes.\nThe Company also expects that new competitors may introduce products, systems or services that are directly or indirectly competitive with the Company. These competitors may succeed in developing products, systems and services that have greater functionality or are less costly than the Companys products, systems and services, and may be more successful in marketing such products, systems and services. Technological changes have lowered the cost of operating communications and computer systems and purchasing software. These changes reduce the Companys cost of providing services but also facilitate increased competition by reducing competitors costs in providing similar services. This competition could increase price competition and reduce anticipated profit margins.\nThe Companys services are new and its industry is evolving\nYou should consider the Companys viability by considering the risks, uncertainties and difficulties frequently encountered by companies in their early stage of development. To be successful in this industry, the Company must, among other things:\n● develop and introduce functional and attractive services;\n● attract and maintain a large base of customers;\n● increase awareness of the Company brand and develop consumer loyalty;\n● respond to competitive and technological developments;\n● build an operations structure to support the Company business; and\n● attract, retain and motivate qualified personnel.\nThe Company cannot guarantee that it will succeed in achieving these goals, and its failure to do so would have a material adverse effect on its business, prospects, financial condition and operating results.\nThe Companys products and services are new and are in the early stages of development. The Company is not certain that these products and services will function as anticipated or be desirable to its intended market. Also, some of the Companys products and services may have limited functionalities, which may limit their appeal to consumers and put the Company at a competitive disadvantage. If the Companys current or future products and services fail to function properly or if the Company does not achieve or sustain market acceptance, it could lose customers or could be subject to claims which could have a material adverse effect on the Companys business, financial condition and operating results.\nRisks Related to Our Company\nUncertainty of profitability\nOur business strategy may result in increased volatility of future revenues and earnings. As we will only develop a limited number of products and services at a time, our overall success will depend on a limited number of products and services, which may cause variability and unsteady profits and losses depending on the products and services offered.\nOur potential revenues and our profitability may be adversely affected by economic conditions and changes in the market. Our business is also subject to general economic risks that could adversely impact the results of operations and financial condition.\nBecause of the anticipated nature of the products and services that we will attempt to develop, it is difficult to accurately forecast revenues and operating results and these items could fluctuate in the future due to several factors. These factors may include, among other things, the following:\n● Our ability to raise sufficient capital to take advantage of opportunities and generate sufficient revenues to cover expenses.\n● Our ability to source strong opportunities with sufficient risk adjusted returns.\n● Our ability to manage our capital and liquidity requirements based on changing market conditions.\n● The acceptance of the terms and conditions of our licenses and/or the acceptance of our royalties and fees.\n● The amount and timing of operating costs and other costs and expenses.\n● The nature and extent of competition from other companies that may reduce market share and create pressure on pricing and investment return expectations.\n● Adverse changes in the national and regional economies in which we will participate, including, but not limited to, changes in our performance, capital availability, and market demand.\n● Adverse changes in the projects in which we plan to invest which result from factors beyond our control, including, but not limited to, a change in circumstances, capacity and economic impacts.\n● Changes in laws, regulations, accounting, taxation, and other requirements affecting our operations and business.\n● Our operating results may fluctuate from year to year due to the factors listed above and others not listed. At times, these fluctuations may be significant.\nOur independent auditors report for the fiscal years ended July 31, 2023 and 2022 have expressed doubts about our ability to continue as a going concern\nDue to the uncertainty of our ability to meet our current operating and capital expenses, in our audited annual financial statements as of and for the years ended July 31, 2023 and 2022, our independent auditors included a going concern qualification in their report regarding concerns about our ability to continue as a going concern. We have incurred recurring losses and have generated limited revenue since inception. These factors and our need for additional financing to effectively execute our business plan raise substantial doubt about our ability to continue as a going concern. The presence of the going concern note to our financial statements may have an adverse impact on the relationships we are developing and plan to develop with third parties as we continue the commercialization of our products and could make it challenging and difficult for us to raise additional financing, all of which could have a material adverse impact on our business and prospects and result in a significant or complete loss of your investment.\nManagement of growth will be necessary for us to be competitive\nSuccessful expansion of our business will depend on our ability to effectively attract and manage staff, strategic business relationships, and shareholders. Specifically, we will need to hire skilled management and technical personnel as well as manage partnerships to navigate shifts in the general economic environment. Expansion has the potential to place significant strains on financial, management, and operational resources, yet failure to expand will inhibit our profitability goals.\nWe are entering a potentially highly competitive market\nThe markets for the healthcare and senior monitoring industries are competitive and evolving. We face strong competition from larger companies that may be in the process of offering similar products and services to ours. Many of our current and potential competitors have longer operating histories, significantly greater financial, marketing and other resources and larger client bases than we have or expect to have in the near future.\nGiven the rapid changes affecting the global, national, and regional economies generally, and the healthcare industry specifically, we may not be able to create and maintain a competitive advantage in the marketplace. Our success will depend on our ability to keep pace with any market, legal and regulatory changes as well as competitive pressures. Any failure by us to anticipate or respond adequately to such changes could have a material adverse effect on our financial condition, operating results, liquidity and cash flow.\nIf we fail to establish and maintain an effective system of internal control, we may not be able to report our financial results accurately or prevent fraud, and any inability to report and file our financial results accurately and timely could harm our reputation and adversely impact the future trading price of our common stock\nEffective internal control is necessary for us to provide reliable financial reporting and prevent fraud. If we cannot provide reliable financial reports or prevent fraud, we may not be able to manage our business as effectively as we would if an effective control environment existed, and our business and reputation with investors may be harmed. As a result, our small size and any current internal control deficiencies may adversely affect our financial condition, results of operation and access to capital.\nWe currently have insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and accounting principles generally accepted in the United States of America (U.S. GAAP) and the United States Securities and Exchange Commission (the SEC) disclosure requirements. Additionally, there is a lack of formal process and timeline for closing the books and records at the end of each reporting period and such weaknesses restrict the Companys ability to timely gather, analyze and report information relative to the financial statements.\nBecause of the Companys limited resources, there are limited controls over information processing. There is inadequate segregation of duties consistent with control objectives. Our Companys management is composed of a small number of individuals resulting in a situation where limitations on segregation of duties exist. In order to remedy this situation, we would need to hire additional qualified staff.\nThe Companys failure to continue to attract, train, or retain highly qualified personnel could harm the Companys business\nThe Companys success also depends on the Companys ability to attract, train, and retain qualified personnel, specifically those with management and product development skills. In particular, the Company must hire additional skilled personnel to further the Companys research and development efforts. Competition for such personnel is intense. If the Company fails in attracting new personnel, or retaining and motivating the Companys current personnel, the Companys business could be harmed.\nRisks Related to Our Common Stock\nBecause we will likely issue additional shares of our common stock, investment in our Company could be subject to substantial dilution\nInvestors interests in our company will be diluted and investors may suffer dilution in their net book value per share when we issue additional shares. We are currently authorized to issue 200,000,000 shares of common stock, $0.001 par value per share. As of November 13, 2023, there were 69,298,198 shares of our common stock issued and outstanding. We anticipate that all or at least some of our future funding, if any, will be in the form of equity financing from the sale of our common stock. If we do sell more common stock, investors investment in our company will likely be diluted. Dilution is the difference between what you pay for your stock and the net tangible book value per share immediately after the additional shares are sold by us. If dilution occurs, any investment in the Companys common stock could seriously decline in value.\nTrading in our common stock on the OTC Pink has been subject to wide fluctuations\nOur common stock is currently quoted for public trading on the OTC Pink market. The trading price of our common stock has been subject to wide fluctuations. Trading prices of our common stock may fluctuate in response to several factors, many of which will be beyond our control. The stock market has generally experienced extreme price and volume fluctuations that have often been unrelated or disproportionate to the operating performance of companies with no current business operation. There can be no assurance that trading prices and price earnings ratios previously experienced by our common stock will be matched or maintained. These broad market and industry factors may adversely affect the market price of our common stock, regardless of our operating performance. In the past, following periods of volatility in the market price of a companys securities, securities class-action litigation has often been instituted. Such litigation, if instituted, could result in substantial costs for us and a diversion of managements attention and resources.\nOur Certificate of Incorporation and By-Laws provides for indemnification of officers and directors at our expense and limit their liability, which may result in a major cost to us and hurt the interests of our shareholders due to corporate resources being expended for the benefit of officers and/or directors\nOur Certificate of Incorporation and By-Laws include provisions that fully eliminate the personal liability of our directors for monetary damages to the fullest extent possible under the laws of the State of Nevada or other applicable law. These provisions eliminate the liability of our directors and our shareholders for monetary damages arising out of any violation of a director of his fiduciary duty of due care. Under Nevada law, however, such provisions do not eliminate the personal liability of a director for (i) breach of the directors duty of loyalty, (ii) acts or omissions not in good faith or involving intentional misconduct or knowing violation of law, (iii) payment of dividends or repurchases of stock other than from lawfully available funds, or (iv) any transaction from which the director derived an improper benefit. These provisions do not affect a directors liabilities under the federal securities laws or the recovery of damages by third parties.\nWe do not intend to pay dividends on any investment in the shares of common stock of our Company and any gain on an investment in our Company will need to come through an increase in our stocks price, which may never happen\nWe have never paid any cash dividends on our common stock, and currently do not intend to pay any dividends for the foreseeable future. To the extent that we require additional funding currently not provided for in our financing plan, our funding sources may prohibit the payment of a dividend. Because we do not intend to declare dividends, any gain on an investment in our company will need to come through an increase in the price of our common shares. This may never occur and investors may lose all their investment in our company.\nBecause our securities are subject to penny stock rules, you may have difficulty reselling your shares\nOur shares, as penny stocks, are covered by Section 15(g) of the Securities Exchange Act of 1934 which imposes additional sales practice requirements on broker/dealers who sell our companys securities, including the delivery of a standardized disclosure document; disclosure and confirmation of quotation prices; disclosure of compensation the broker/dealer receives; and furnishing monthly account statements. These rules apply to companies whose shares are not traded on a national stock exchange, trade at less than $5.00 per share, or who do not meet certain other financial requirements specified by the Securities and Exchange Commission.\nThese rules require brokers who sell penny stocks to persons other than established customers and accredited investors to complete certain documentation, make suitability inquiries of investors, and provide investors with certain information concerning the risks of trading in such penny stocks. These rules may discourage or restrict the ability of brokers to sell our shares of common stock and may affect the secondary market for our shares of common stock. These rules could also hamper our ability to raise funds in the primary market for our shares of common stock.\nFINRA sales practice requirements may also limit a stockholders ability to buy and sell our stock\nIn addition to the penny stock rules described above, the Financial Industry Regulatory Authority (known as FINRA) has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common shares, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nThere could be unidentified risks involved with an investment in our securities\nThe foregoing risk factors are not a complete list or explanation of the risks involved with an investment in our securities. Additional risks will likely be experienced that are not presently foreseen by the Company. Prospective investors must not construe this information provided herein as constituting investment, legal, tax or other professional advice. Before making any decision to invest in our securities, you should read this entire Annual Report and consult with your own investment, legal, tax and other professional advisors. An investment in our securities is suitable only for investors who can assume the financial risks of an investment in the Company for an indefinite period and who can afford to lose their entire investment. The Company makes no representations or warranties of any kind with respect to the likelihood of the success or the business of the Company, the value of our securities, any financial returns that may be generated or any tax benefits or consequences that may result from an investment in the Company. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNot applicable. ITEM 2. PROPERTIES.\nNone. ITEM 3. LEGAL PROCEEDINGS.\nThe Company is currently not involved in any litigation that the Company believes could have a materially adverse effect on the Companys financial condition or results of operations. ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable.\nPART II ITEM 5. MARKET FOR OUR COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\n(a) Market Information\nOur common stock is quoted on the OTC Pink market under the symbol HITC. The OTC Pink market is a quotation service that displays real-time quotes, last-sale prices, and volume information in over-the-counter equity securities.\nThe following table shows, for the periods indicated, the high and low bid prices per share of the Companys common Stock as reported by the OTC Pink quotation service. The quotations reflect inter-dealer prices, without retail mark-up, mark-down or commissions, and may not necessarily represent actual transactions.\nHigh Low\nFiscal Year 2022\nFirst quarter ended October 31, 2021 $ 0.48 $ 0.17\nSecond quarter ended January 31, 2022 $ 0.16 $ 0.09\nThird quarter ended April 30, 2022 $ 0.12 $ 0.08\nFourth quarter ended July 31, 2022 $ 0.12 $ 0.05\nFiscal Year 2023\nFirst quarter ended October 31, 2022 $ 0.22 $ 0.05\nSecond quarter ended January 31, 2023 $ 0.23 $ 0.06\nThird quarter ended April 30, 2023 $ 0.16 $ 0.09\nFourth quarter ended July 31, 2023 $ 0.12 $ 0.06\n(b) Holders\nAs of November 13, 2023, there were 69 stockholders of record. Because shares of the Companys common stock are held by depositaries, brokers and other nominees, the number of beneficial holders of the Companys shares is larger than the number of stockholders of record.\n(c) Dividends\nWe have never declared or paid dividends on our common stock. We do not intend to declare dividends in the foreseeable future because we anticipate that we will reinvest any future earnings into the development and growth of our business. Any decision as to the future payment of dividends will depend on our results of operations and financial position and such other factors as our Board of Directors in its discretion deems relevant.\n(d) Securities Authorized for Issuance under Equity Compensation Plan\nThe Company does not have in effect any compensation plans under which the Companys equity securities are authorized for issuance.\nTransfer Agent\nOur transfer agent is VStock Transfer, LLC located at 18 Lafayette Place, Woodmere, NY 11598.\nRecent Sales of Unregistered Securities\nDuring the years ended July 31, 2023 and 2022, we have not issued any securities which were not registered under the Securities Act and not previously disclosed in the Companys Quarterly Reports on Form 10-Q or Current Reports on Form 8-K.\nRule 10B-18 Transactions\nNone. ITEM 6. SELECTED FINANCIAL DATA.\nNot applicable ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nTHE FOLLOWING DISCUSSION OF OUR PLAN OF OPERATIONS AND RESULTS OF OPERATIONS SHOULD BE READ IN CONJUNCTION WITH THE FINANCIAL STATEMENTS AND RELATED NOTES TO THE FINANCIAL STATEMENTS INCLUDED ELSEWHERE IN THIS REPORT. THIS DISCUSSION CONTAINS FORWARD-LOOKING STATEMENTS THAT RELATE TO FUTURE EVENTS OR OUR FUTURE FINANCIAL PERFORMANCE. THESE STATEMENTS INVOLVE KNOWN AND UNKNOWN RISKS, UNCERTAINTIES AND OTHER FACTORS THAT MAY CAUSE OUR ACTUAL RESULTS, LEVELS OF ACTIVITY, PERFORMANCE OR ACHIEVEMENTS TO BE MATERIALLY DIFFERENT FROM ANY FUTURE RESULTS, LEVELS OF ACTIVITY, PERFORMANCE OR ACHIEVEMENTS EXPRESSED OR IMPLIED BY THESE FORWARD-LOOKING STATEMENTS. THESE RISKS AND OTHER FACTORS INCLUDE, AMONG OTHERS, THOSE LISTED UNDER FORWARD-LOOKING STATEMENTS AND RISK FACTORS AND THOSE INCLUDED ELSEWHERE IN THIS REPORT.\nThis discussion summarizes the significant factors affecting the consolidated financial statements, financial condition, liquidity, and cash flows of Healthcare Integrated Technologies, Inc, for the fiscal years ended July 31, 2023 and 2022 and the interim periods included herein. The following discussion and analysis should be read in conjunction with the consolidated financial statements and notes included elsewhere in this Form 10-K.\nExecutive Overview\nHealthcare Integrated Technologies, Inc. and its subsidiaries is a healthcare technology company based in Knoxville, Tennessee. We are creating a diversified spectrum of healthcare technology solutions to integrate and automate the continuing care, home care and professional healthcare spaces.\nOur initial product, SafeSpace™ with AI Vision™, is an ambient fall detection solution designed for continuing care communities and at home use. SafeSpace includes hardware devices utilizing RGB, radar and other sensor technology coupled with our internally developed software to effectively monitor a person remotely. In continuing care communities, SafeSpace detects resident falls and generates alerts to a centralized, intelligent dashboard without the use of wearable devices or any action by the resident. In the home, SafeSpace detects falls and sends alerts directly to designated individuals.\nWe recently introduced and are currently pilot testing two additional products - SafeFace™ and SafeGuard™. SafeFace provides fully automated and ambient time and attendance reporting for facility staff, and an integrated and automatic agency invoice reconciliation feature. SafeGuard is a novel fully ambient elopement detection and alerting system based on our facial recognition technology.\nIn addition to our current product offerings, we are developing a home concierge healthcare service application to provide a virtual assisted living experience for seniors, recently released postoperative patients, and others. The concierge application will enable the consumer to obtain home healthcare services and health and safety monitoring equipment to improve quality of life. We are also working to develop a fully integrated solution for the professional healthcare community that integrates electronic health records, remote patient monitoring, telehealth, and other items where integration is beneficial.\nStrategy\nOur mission is to grow a profitable healthcare technology company by focusing on our core product, continuing the development of our proprietary software, and developing new uses and product lines for our technology. Our management team is focused on maintaining financial flexibility and assembling the right complement of personnel and outside consultants required to successfully execute our mission.\nFinancial and Operating Results\nWe continue to utilize funds raised from the private sales of our common stock, issuance of debt, and short-term advances from related parties to provide cash for our operations, which has allowed us to continue refining our initial product and readying it for pilot testing, developing future product offerings and adding talented individuals to our management team. Highlighted achievements for the fiscal year ended July 31, 2023 include:\n● An independent director was appointed to our Board of Directors. G. Shayne Bench was appointed to our Board of Directors on August 26, 2022. Mr. Bench is co-founder and Chief Financial Officer of Trillium Healthcare Consulting and brings a wealth of experience and knowledge in the senior living industry to the Company.\n● We received $300,000 in net proceeds from the sale of our common stock at an average price of $0.10 per share. The net proceeds were used to pay off existing debt and provide working capital.\n● At the option of the holders, convertible debt with a face amount of $150,000 and related accrued interest of $37,586 was converted into common shares of the Company. The conversion reduced short-term debt and increased equity by $187,586.\n● We issued a new promissory note to Platinum Equity Advisors, LLC, a related party, and received $372,069 in net proceeds. The net proceeds were used to retire the principal balance and related accrued interest under a promissory note to AJB Capital Investments, LLC. The new promissory note allows for greater flexibility and significantly reduces the risk and consequences of a default.\n● Our executive officers agreed to accept common stock as full or partial payment of all compensation owed under their respective compensation agreements as of July 31, 2023. Accrued compensation totaling $2,053,006 was paid in common stock of the Company at a weighted average agreed up value of $0.104 per share. The transaction significantly improved our balance sheet by reducing current liabilities and increasing equity by the $2,053,006 amount.\n● We introduced two new products - SafeFace and SafeGuard. SafeFace provides fully automated and ambient time and attendance reporting for facility staff, and an integrated and automatic agency invoice reconciliation feature. SafeGuard is a novel fully ambient elopement detection and alerting system based on our facial recognition technology.\n● On August 8, 2023, we announced a strategic alliance with Signature HealthCARE (Signature). The alliance aims to implement a series of pilot programs during the coming fiscal year. The collaboration will involve several new proprietary, fully ambient AI-based solutions to be pilot tested and deployed across multiple Signature senior living facilities. Signature is a family-based healthcare company that offers integrated services in 10 states across the continuum of care, including skilled nursing, rehabilitation, assisted living, memory care, home health, cognitive care, and telemedicine.\nResults of Operations\nRevenues\nWe had no revenues in fiscal 2023 or 2022. Our healthcare technology business is not currently producing revenue as we continue to develop, test, evaluate and refine our products.\nOperating Expenses\nThe table below presents a comparison of our operating expenses for the years ended July 31, 2023 and 2022:\nFor the Years Ended July 31,\n$ Variance %Variance\nOfficers salaries $ 496,543 $ 506,443 $ (9,900 ) (2 )%\nProfessional fees 145,017 93,351 51,666 55 %\nAdvertising and marketing 6,184 36,535 (30,351 ) (83 )%\nAmortization 16,885 11,215 5,670 51 %\nOther 9,923 17,010 (7,087 ) (42 )%\nTotal selling, general & administrative 674,552 664,554 9,998 2 %\nStock-based compensation 287,016 473,511 (186,495 ) (39 )%\nTotal Operating Expenses $ 961,568 $ 1,138,065 $ (176,497 ) (16 )%\nOfficers Salaries - Officers salaries, net of capitalized amounts, decreased $9,900 from 2022, or 2%. The decrease resulted from a bonus being paid to our CFO in 2022.\nProfessional Fees - Professional fees increased $51,666, or 55%, over the 2022 amount. In 2023, expense for outside consultants increased $31,860, legal fees increased $17,224, and transfer agent and Edgar/XBRL processing fees increased $4,358. The increases were partially offset by a decrease in accounting fees of $1,776 over the 2022 amount.\nAdvertising and Marketing - Advertising and marketing expense decreased $30,351, or 83%, over 2022. The decrease is primarily due to a contract sales and marketing position in 2022 that was eliminated in 2023.\nAmortization - Amortization expense increased $5,670, or 51%, over the same period in the prior year. The increase primarily results from the abandonment of a patent in 2023.\nOther - Other expense decreased $7,087, or 42%, over the same period in the prior year. The decrease primarily relates to lower travel and entertainment related expenses in 2023.\nStock-based Compensation - Stock-based compensation expense decreased $186,495, or 39%, from the same period in the prior year. The decrease results from a 2023 reduction in the amortization of the grant date fair value of employee stock options granted to our CEO, CFO and CTO, and a restricted stock grant to our CFO. The decreases were partially offset by the expense related to the issuance of new shares and restricted stock grants to outside consultants.\nOther Income (Expense)\nThe table below presents a comparison of our other income (expense) for the years ended July 31, 2023 and 2022:\nFor the Years Ended July 31,\n$ Variance %Variance\nInterest expense $ (417,341 ) $ (447,623 ) $ (30,282 ) (7 )%\nChange in fair value of derivative liability 76,451 224,667 (148,216 ) (66 )%\nTotal Other Income (Expense) $ (340,890 ) $ (222,956 ) $ 117,934 53 %\nInterest Expense - Interest expense decreased $30,282, or 7%, over the same period in the prior year. The decrease primarily resulted from a decrease in the amortization of debt discount related to the AJB Note 2 as it became fully amortized in the third quarter of 2023. The decrease was partially offset by an increase in the monthly coupon interest on the larger principal balance and fees associated with extending the maturity date of the AJB Note 2.\nChange in Fair Value of Derivative Liability - The change in the fair value of the derivative liabilities associated with our AJB Capital notes reflects a current period gain of $76,451 as compared to a gain of $224,667 in the prior year. The current year gain resulted from the elimination of the derivative liability on the AJB Capital note when it was paid off in June of 2023.\nLiquidity and Capital Resources\nWorking Capital\nThe following table summarizes our working capital for the fiscal years ending July 31, 2023 and 2022:\nJuly 31, 2023 July 31, 2022\nCurrent assets $ 34,503 $ 37,667\nCurrent liabilities (1,569,803 ) (3,153,778 )\nWorking capital deficiency $ (1,535,300 ) $ (3,116,111 )\nCurrent assets for the year ended July 31, 2023 decreased $3,164 as compared to the fiscal year ended July 31, 2022. The increase is due to a decrease in cash and cash equivalents and the amortization of prepaid expenses.\nCurrent liabilities for the year ended July 31, 2023 decreased $1,583,975 as compared to the fiscal year ended July 31, 2022. The decrease is primarily due to the reduction in accrued compensation related to executive compensation agreements being wholly or partially paid in common stock during 2023. Additional decreases in accounts payable and accrued expenses, short-term debt, and the elimination of the derivate liability associated with debt that was paid off during the period contributed to the overall decrease.\nNet Cash Used by Operating Activities\nWe currently do not have a revenue source and will continue to have negative cash flow from operations for the near future. The factors in determining operating cash flows are largely the same as those that affect net earnings, except for non-cash expenses such as depreciation and amortization, stock-based compensation, amortization of debt discount, and changes in fair value of assets and liabilities, which affect earnings but do not affect operating cash flow. Net cash used by operating activities was $106,203 for the year ended July 31, 2023 as compared to $212,177 for the year ended July 31, 2022. The $105,974 decrease in cash used by operating activities during 2023 is primarily attributable to accrued interest expense and professional fees and an overall effort by management to reduce operating costs.\nNet Cash Used by Investing Activities\nNet cash used by investing activities was $27,560 and $32,690 for the years ended July 31, 2023 and 2022, respectively. The amount is comprised of cash paid for the filing of patent applications and for the development of software for our internal use.\nNet Cash Provided by Financing Activities\nNet cash provided by financing activities was $133,123 for the year ended July 31, 2023, which represents a $101,352 decrease over the prior year. New loan proceeds decreased $133,317 in 2023 over the 2022 amount and in 2023 we repaid an additional $246,070 in debt over the 2022 debt repayments. The decreases were partially offset by a 2023 increase in cash received from common stock subscriptions of $275,000 over the 2022 amount.\nAt this time, we cannot provide investors with any assurance that we will be able to obtain sufficient funding from debt financings and/or the sale of our equity securities to meet our obligations over the next twelve months. We are likely to continue using short-term loans from management to meet our short-term funding needs. We have no material commitments for capital expenditures as of July 31, 2023.\nGoing Concern Qualification\nWe have a history of losses, an accumulated deficit, negative working capital and have not generated cash from operations to support a meaningful and ongoing business plan. Our Independent Registered Public Accounting Firm has included a Going Concern Qualification in their report for the years ended July 31, 2023 and 2022. The foregoing raises substantial doubt about the Companys ability to continue as a going concern. We intend on financing our future activities and working capital needs largely from the sale of private and/or public equity securities with additional funding from other traditional financing sources, including term notes, until such time that funds provided by operations are sufficient to fund working capital requirements. There is no guarantee that additional capital or debt financing will be available when and to the extent required, or that if available, it will be on terms acceptable to us. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty. The Going Concern Qualification might make it substantially more difficult to raise capital.\nCritical Accounting Policies and Estimates\nOur consolidated financial statements and related public financial information are based on the application of U.S. GAAP. U.S. GAAP requires the use of estimates; assumptions, judgments and subjective interpretations of accounting principles that have an impact on the assets, liabilities, revenues and expense amounts reported. These estimates can also affect supplemental information contained in our external disclosures including information regarding contingencies, risk and financial condition. We believe our use of estimates and underlying accounting assumptions adhere to U.S. GAAP and are consistently and conservatively applied. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances. Actual results may differ materially from these estimates under different assumptions or conditions. We continue to monitor significant estimates made during the preparation of our financial statements.\nOur significant accounting policies are summarized in Note 1 of our consolidated financial statements.\nWe believe the following critical policies impact our more significant judgments and estimates used in the preparation of our consolidated financial statements.\nBusiness Combinations\nWe account for business combinations under the acquisition method of accounting. The acquisition method requires that the acquired assets and liabilities, including contingencies, be recorded at fair value determined on the acquisition date and that changes thereafter be reflected in income (loss). The estimation of fair values of the assets and liabilities assumed involves several estimates and assumptions that could differ materially from the actual amounts recorded. The results of the acquired businesses are included in our results from operations beginning from the day of acquisition.\nRisk and Uncertainties\nFactors that could affect our future operating results and cause actual results to vary materially from managements expectation include, but are not limited to: our ability to maintain and secure adequate capital to fund our operations and fully develop our product(s); our ability to source strong opportunities with sufficient risk adjusted returns; acceptance of the terms and conditions of our licenses and/or the acceptance of our royalties and fees; the nature and extent of competition from other companies that may reduce market share and create pressure on pricing and investment return expectations; changes in the projects in which we plan to invest which result from factors beyond our control, including, but not limited to, a change in circumstances, capacity and economic impacts; changes in laws, regulations, accounting, taxation, and other requirements affecting our operations and business. Negative developments in these or other risk factors could have a significant adverse effect on our financial position, results of operations and cash flows.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. We base our estimates on experience and various other assumptions that are believed to be reasonable under the circumstances. We evaluate our estimates and assumptions on a regular basis and actual results may differ from those estimates.\nFair Value of Financial Instruments\nFair value is defined as the price that would be received to sell an asset, or paid to transfer a liability, in an orderly transaction between market participants. A fair value hierarchy has been established for valuation inputs that gives the highest priority to quoted prices in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The fair value hierarchy is as follows:\nLevel 1 Inputs - Unadjusted quoted prices in active markets for identical assets or liabilities that the reporting entity can access at the measurement date.\nLevel 2 Inputs - Inputs other than quoted prices included in Level 1 that are observable for the asset or liability, either directly or indirectly. These might include quoted prices for similar assets or liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable for the asset or liability (such as interest rates, volatilities, prepayment speeds, credit risks, etc.) or inputs that are derived principally from or corroborated by market data by correlation or other means.\nLevel 3 Inputs - Unobservable inputs for determining the fair values of assets or liabilities that reflect an entitys own assumptions about the assumptions that market participants would use in pricing the assets or liabilities.\nFinancial instruments consist of cash and cash equivalents, accounts receivable, accounts payable and borrowings. The fair value of current financial assets and current financial liabilities approximates their carrying value because of the short-term maturity of these financial instruments.\nIntangible Assets\nIntangible assets consist of patents, our website and the costs of software developed for internal use. Certain payroll and stock-based compensation costs incurred are allocated to the intangible assets. We determine the amount of costs to be capitalized based on the time spent by employees or outside contractors on the projects. Intangible assets are amortized over their expected useful life on a straight-line basis. We evaluate the useful lives of these assets on an annual basis and test for impairment whenever events or changes in circumstances occur that could impact the recoverability of these assets. If the estimate of an intangible assets remaining life is changed, the remaining carrying value of the intangible asset is amortized prospectively over the revised remaining useful life.\nImpairment of Long-Lived Assets\nLong-lived assets such as property, equipment and identifiable intangibles are reviewed for impairment at least annually or whenever facts and circumstances indicate that the carrying value may not be recoverable. When required, impairment losses on assets to be held and used are recognized based on the fair value of the asset. The fair value is determined based on estimates of future cash flows, market value of similar assets, if available, or independent appraisals, if required. If the carrying amount of the long-lived asset is not recoverable, an impairment loss is recognized for the difference between the carrying amount and fair value of the asset.\nDerivative Liability\nOptions, warrants, convertible notes, or other contracts, if any, are evaluated to determine if those contracts, or embedded components of those contracts, qualify as derivatives to be separately accounted for in accordance with Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 815, Derivatives and Hedging, (paragraph 815-10-05-4 and Section 815-40-25). The result of this accounting treatment is that the fair value of the embedded derivative is marked-to-market each balance sheet date and recorded as either an asset or a liability. The change in fair value is recorded in the consolidated statements of operations as other income or expense. Upon conversion, exercise or cancellation of a derivative instrument, the instrument is marked to fair value at the date of conversion, exercise, or cancellation and then the related fair value is reclassified to equity.\nIn circumstances where the embedded conversion option in a convertible instrument is required to be bifurcated, and there are also other embedded derivative instruments in the convertible instrument that are required to be bifurcated, the bifurcated derivative instruments are accounted for as a single, compound derivative instrument.\nThe classification of derivative instruments, including whether such instruments should be recorded as liabilities or as equity, is re-assessed at the end of each reporting period. Equity instruments that are initially classified as equity that become subject to reclassification are reclassified to liability at the fair value of the instrument on the reclassification date. Derivative instrument liabilities will be classified in the balance sheet as current or non-current based on whether or not net-cash settlement of the derivative instrument is expected within 12 months of the balance sheet date.\nThe Company adopted Section 815-40-15 of the FASB ASC (Section 815-40-15) to determine whether an instrument (or an embedded feature) is indexed to the Companys own stock. Section 815-40-15 provides that an entity should use a two- step approach to evaluate whether an equity-linked financial instrument (or embedded feature) is indexed to its own stock, including evaluating the instruments contingent exercise and settlement provisions.\nWe utilize a binomial option pricing model to compute the fair value of the derivative liability and to mark to market the fair value of the derivative at each balance sheet date. We record the change in the fair value of the derivative as other income or expense in the consolidated statements of operations.\nRevenue Recognition\nRevenue is recognized under ASC 606, Revenue from Contracts with Customers using the modified retrospective method. Under this method, the Company follows the five-step model provided by ASC Topic 606 in order to recognize revenue in the following manner: 1) Identify the contract; 2) Identify the performance obligations of the contract; 3) Determine the transaction price of the contract; 4) Allocate the transaction price to the performance obligations; and 5) Recognize revenue. An entity recognizes revenue for the transfer of promised goods or services to customers in an amount that reflects the consideration for which the entity expects to be entitled in exchange for those goods or services. The Companys revenue recognition policies remained unchanged as a result of the adoption of ASC 606, and there were no significant changes in business processes or systems.\nStock-Based Compensation\nThe Company accounts for stock-based compensation in accordance with ASC Topic 718, Compensation - Stock Compensation (ASC 718) which establishes financial accounting and reporting standards for stock-based employee compensation. It defines a fair value-based method of accounting for an employee stock option or similar equity instrument. The Company accounts for compensation cost for stock option plans, if any, in accordance with ASC 718.\nStock-based payments, excluding restricted stock, are valued using a Black-Scholes option pricing model. Grants of stock-based payment awards issued to non-employees for services rendered have been recorded at the fair value of the stock-based payment, which is the more readily determinable value. The grants are amortized on a straight-line basis over the requisite service periods, which is generally the vesting period. If an award is granted, but vesting does not occur, any previously recognized compensation cost is reversed in the period related to the termination of service. Stock-based compensation expenses are included in cost of goods sold or selling, general and administrative expenses, depending on the nature of the services provided, in the consolidated statements of operations. Stock-based payments issued to placement agents are classified as a direct cost of a stock offering and are recorded as a reduction in additional paid in capital.\nThe Company recognizes all forms of stock-based payments, including stock option grants, warrants and restricted stock grants, at their fair value on the grant date, which are based on the estimated number of awards that are ultimately expected to vest.\nCapital Resources\nWe had no material commitments for capital expenditures as of July 31, 2023.\nOff-Balance Sheet Arrangements\nWe had no off-balance sheet arrangements as of July 31, 2023 or 2022. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nWe do not hold any market risk sensitive instruments. We consider our interest rate risk exposure to be minimal as a result of fixing interest rates on 100% of our debt. At July 31, 2023, there was no floating rate debt that would expose us to market fluctuations in interest rates. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nThe financial statements and supplementary financial information required to be filed under this Item 8 are presented in Part IV, Item 15 of this Form 10-K and are incorporated herein by reference. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nDisclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and our Chief Financial Officer, we conducted an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rules 13a-15(e) under the Securities Exchange Act of 1934, as amended, at the end of the period covered by this report (the Evaluation Date). In conducting its evaluation, management considered the material weaknesses described below in Managements Report on Internal Control over Financial Reporting.\nBased on that evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that as of the Evaluation Date we did not maintain disclosure controls and procedures that were effective in providing reasonable assurances that information required to be disclosed in our reports filed under the Securities Exchange act of 1934 was recorded, processed, summarized and reported within the time periods prescribed by SEC rules and regulations, and that such information was accumulated and communicated to our management to allow timely decisions regarding required disclosure.\nOur management, including the Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures will prevent all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of simple error or mistake. The design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Our management assessed the effectiveness of our internal control over financial reporting as of July 31, 2023. Based on the evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of July 31, 2023, our internal controls over financial reporting were not effective.\nIn making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework. Our management has concluded that, as of July 31, 2023, our internal control over financial reporting is not effective based on these criteria. Material weaknesses noted by our management include:\n● Lack of a functioning audit committee;\n● Lack of a majority of outside directors on our board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures;\n● Inadequate segregation of duties consistent with control objectives and affecting the functions of authorization, recordkeeping, custody of assets, and reconciliation;\n● Management dominated by a single individual/small group without adequate compensating controls.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only managements report in this annual report.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act, during our most recently completed fiscal year that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nThe following table sets forth information concerning our officers and directors as of the dates indicated. The directors of the Company serve until their successors are elected and shall qualify. Executive officers are elected by the Board of Directors and serve at the discretion of the directors.\nName\nAge\nTitle\nScott M. Boruff\nChief Executive Officer, Director\nCharles B. Lobetti, III\nChief Financial Officer\nKenneth M. Greenwood\nChief Technology Officer\nSusan A. Reyes\nChief Medical Officer\nG. Shayne Bench\nDirector\nSet forth below is a brief description of the background and business experience of each of our current executive officers and directors.\nScott M. Boruff, Chief Executive Officer, Director, Age 60\nMr. Boruff has served as our Chief Executive Officer and Sole Director since March 13, 2018. Since May 1, 2021, he has served in that capacity as an outsourced, contracted Chief Executive Officer and Director. He has been the sole officer and director of IndeLiving Holdings, Inc. since the companys formation in 2016. He has also served as the Manager of Platinum Equity Advisors, LLC (Platinum Equity) since its formation in 2016. In addition to providing consulting and advisory services, Platinum Equity has interests in a real estate brokerage firm and a luxury real estate auction firm. Mr. Boruff is a proven executive with a diverse business background in investment banking and real estate development. He currently serves as Manager of Own Shares, LLC, a privately held holding company with interests in various entertainment ventures, and Managing Member of Stonewalk Companies, privately held real estate development company. As a professional in investment banking, he specialized in consulting services and strategic planning with an emphasis on companies in the oil and gas field. Mr. Boruff served as a member of the Board of Directors of Miller Energy Resources, Inc., a publicly traded company, from August 2008 until March 2016, serving as Executive Chairman of the Board of Directors from September 2014 until March 2016 and Chief Executive Officer from August 2008 to September 2014. In October 2015, when it was being led by a successor management team, Miller Energy Resources, Inc. filed a voluntary petition for reorganization under chapter 11 of title 11 of the U.S. Code in a pre-packaged bankruptcy. It remained a debtor in possession and emerged from bankruptcy in March 2016. Mr. Boruff was a director and 49% owner of Dimirak Securities Corporation, a broker-dealer and member of FINRA, from April 2009 until July 2012. In July 2012, Mr. Boruff sold his interest in Dimirak. He has more than 30 years of experience in developing commercial real estate projects and from 2006 to 2007 Mr. Boruff successfully led transactions averaging $150 to $200 million in size while serving as a director of Cresta Capital Strategies, LLC. Mr. Boruff received a Bachelor of Science degree in Business Administration from East Tennessee State University.\nCharles B. Lobetti, III, Chief Financial Officer, Age 60\nMr. Lobetti has served as our Chief Financial Officer since October 8, 2019. He holds both Bachelor of Science in Business Administration (1985) and Master of Accountancy (1986) degrees from the University of Tennessee and is a licensed Certified Public Accountant (Inactive) in the State of Tennessee. Upon graduation, Mr. Lobetti accepted a position in the tax department of the Tampa, Florida office of Ernst & Young where he progressed to Senior Tax Consultant before he left the firm in 1989 to return to his hometown of Knoxville, Tennessee as the Tax Manager with a progressive, local accounting firm. In 1990, Mr. Lobetti, along with two co-workers, formed the accounting firm of Lobetti, Ideker & Reel (LIR) where he served as President and Director of Tax Services. LIR was a member of the AICPAs SEC Practice Section and served several SEC registrant clients. In 1998, Mr. Lobetti left LIR to accept a position of Chief Financial Officer of United Petroleum Corporation (UPET), a small cap, SEC registrant oil and natural gas development company and convenience store operator. Following his tenure at UPET, Mr. Lobetti served as Chief Financial Officer for a boutique investment banking/private equity firm specializing in the placement and funding of Regulation D and Regulation S offerings. He spent the next 10-years working in various investment banking, commercial mortgage banking and commercial banking functions before accepting the position of Controller - Alaska Operations with Miller Energy Resources, Inc. (Miller), an SEC registrant oil and gas exploration and production company. Shortly after accepting the position in 2011, Mr. Lobetti was promoted to Corporate Controller and thereafter appointed Treasurer in 2012. Since leaving Miller in 2014, Mr. Lobetti enjoyed spending time with his family and working part-time in commercial mortgage banking until accepting the position of Chief Financial Officer of Healthcare Integrated Resources, Inc.\nKenneth M. Greenwood, Chief Technology Officer, Age 65\nKenneth M. Greenwood has served as our Chief Technology Officer since June 15, 2020. Mr. Greenwood brings over 30-years of experience with large-scale systems programming and implementations to our executive management team. He has provided instruction and consulting, primarily for SAP products, in the areas of architecture, design and implementation of ABAP, big-data warehousing, business intelligence analytics, object-orientation, cloud and systems integration, interfaces, HANA in-memory databases, data security, workflow, and archiving to a variety of companies including Intel, World Bank, HP, Amtrak, IBM, Accenture, Wal-Mart, Home Depot, Nike and Kimberly-Clark. While at Random House implementing a Rights Management module following two previous failed attempts by other contractors, Mr. Greenwood led the 30-developer team to design, code and implement rights management for Random House in an SAP system using a novel approach of OO design, which became the worlds largest SAP module at that time. Mr. Greenwood authored the best-selling Sams Teach Yourself ABAP in 21 Days, published by Macmillan.\nSusan A. Reyes, M.D., Chief Medical Officer, Age 60\nSusan A. Reyes, M.D. has served as our Chief Medical Officer since September 1, 2020. Dr. Reyes brings extensive experience as a practicing Internal Medicine physician in the home care environment. She earned her Doctor of Medicine degree in just six-years and was board certified in Internal Medicine in 1994. Since then, Dr. Reyes has enjoyed expanding her skill set by working with several ground-breaking companies. In 1997, she worked for Hospital Inpatient Management Systems, which was the first hospitalist group that transformed the efficiencies of length of stay of patients in the hospital and in skilled nursing facility settings. In 2000, she was the lead physician for MD to You in Tampa, Florida - the first organization that developed house calls for homebound geriatric patients. In 2009, Dr. Reyes became the first physician to bring house call services to Knoxville, Tennessee and has grown her company to be the largest mobile medical primary care practice covering East Tennessee. She has been an advisor and served as Medical Director to several home health and hospice agencies and assisted living facilities in each community where she has resided.\nG. Shayne Bench, Director, Age 50\nG. Shayne Bench is co-founder and Chief Financial Officer of Trillium Healthcare Consulting. Mr. Bench began his professional career in 1994 with Beverly Enterprises where he held various leadership roles, including Vice President of Finance for all 53 Skilled Nursing Facilities in the state of Florida. In 2001, Mr. Bench joined an executive team to start up Genoa Healthcare Group. As Senior Vice President and Treasurer, he successfully managed the cash flow while the organization grew to 135 Skilled Nursing Facilities in 17 states with nearly one billion dollars in revenue. He managed all aspects of strategic capitalization, established creditor and banking relationships, and managed financial reporting to investors. Mr. Bench is originally from Louisiana and received his Bachelor of Science in Business Administration with a major in accounting from Northeastern State University. He currently resides in Sarasota, Florida where he enjoys golfing, boating, and Saints football.\nFamily Relationships\nThere are no family relationships among any of our directors or executive officers.\nInvolvement in Certain Legal Proceedings\nTo the best of the Companys knowledge, none of the Companys directors or executive officers has, during the past ten years, except as set forth below:\n● been convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n● had any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\n● been the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n● been found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment in such civil action has not been reversed, suspended, or vacated;\n● been the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to (i) an alleged violation of any federal or state securities or commodities law or regulation, (ii) any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or (iii) any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n● been the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nMr. Boruff served as a member of the Board of Directors, as Chief Executive Officer, and as Executive Chairman of Miller Energy Resources, Inc. during the two years preceding Miller Energy Resources, Inc.s filing of a bankruptcy petition in August 2015.\nMr. Lobetti served as Treasurer of Miller Energy Resources, Inc. during the two-year period preceding Miller Energy Resources, Inc.s filing of a bankruptcy petition in August 2015.\nExcept as set forth in the Companys discussion below in Certain Relationships and Related Transactions, and Director Independence, none of the Companys directors or executive officers has been involved in any transactions with the Company or any of the Companys directors, executive officers, affiliates, or associates which are required to be disclosed pursuant to the rules and regulations of the Commission.\nCompliance with Section 16(a) of the Exchange Act\nSection 16(a) of the Exchange Act requires the Companys directors, executive officers and persons who beneficially own 10% or more of a class of securities registered under Section 12 of the Exchange Act to file reports of beneficial ownership and changes in beneficial ownership with the SEC. Directors, executive officers and greater than 10% stockholders are required by the rules and regulations of the SEC to furnish the Company with copies of all reports filed by them in compliance with Section 16(a).\nBased solely on our review of certain reports filed with the Securities and Exchange Commission pursuant to Section 16(a) of the Securities Exchange Act of 1934, as amended, the reports required to be filed with respect to transactions in our common stock during the fiscal year ended July 31, 2023 and 2022, were timely filed.\nTerm of Office\nThe Companys directors are elected by the Companys stockholders for a one-year term until the next annual general meeting of the Companys stockholders, or until removed by the stockholders in accordance with the Companys bylaws. The Companys officers are appointed by the Board and hold office until removed by the Board.\nCode of Ethics\nThe Company does not currently have a code of ethics, and because the Company has only limited business operations and only four officers and one director, the Company believes that a code of ethics would have limited utility. The Company intends to adopt such a code of ethics as the Companys business operations expand and the Company has more employees.\nBoard Committees\nAs we only have two board members and given our limited operations, we do not have separate or independent audit or compensation committees. Our Board of Directors has determined that it does not have an audit committee financial expert, as that term is defined in Item 407(d)(5) of Regulation S-K. In addition, we have not adopted any procedures by which our shareholders may recommend nominees to our Board of Directors. ITEM 11. EXECUTIVE COMPENSATION.\nThe following table summarizes all compensation recorded by us in the past two years for:\n● our principal executive officer or other individual serving in a similar capacity,\n● our three most highly compensated executive officers, other than our principal executive officer, who were serving as executive officers at July 31, 2023 and 2022 as that term is defined under Rule B-7 of the Securities Exchange Act of 1934.\nSummary Compensation Table (in dollars)\nName and Principal Fiscal\nStock Non-Equity Incentive Plan Non-Qualified Deferred Compensation All Other\nPosition Year Salary Bonus Awards Compensation Earnings Compensation Total\nScott B. Boruff - - - - - 323,400 323,400\nChief Executive Officer - - 173,809 - - 323,400 497,209\nDirector (1)\nCharles B. Lobetti, III 104,000 - 15,620 - - 4,800 124,420\nChief Financial Officer (2) 104,000 8,855 52,461 - - 4,800 170,116\nKenneth M. Greenwood 102,800 - 145,917 - - - 248,717\nChief Technology Officer (3) 141,350 - 166,763 - - - 308,113\nSusan A. Reyes MD 52,000 - 80,478 - - - 132,478\nChief Medical Officer (4) 52,000 - 80,478 - - - 132,478\n(1) Mr. Boruff has served as our Chief Executive Officer and as a Director since March 13, 2018.\n(2) Mr. Lobetti has served as our Chief Financial Officer since October 8, 2019.\n(3) Mr. Greenwood has served as our Chief Technology Officer since June 15, 2020.\n(4) Ms. Reyes has served as our Chief Medical Officer since September 1, 2020\nDirector Compensation\nDirector compensation is determined on a case by case basis. On September 8, 2022, G. Shayne Bench was appointed to our board of directors for a term of one (1) year. As compensation for Mr. Benchs service, he received a one (1) year restricted stock grant of 846,093 shares of the Companys common stock. The restricted stock grant shall vest ratably, on a monthly basis, at the end of each month of completed service, and any vested shares shall be issued quarterly in conjunction with the ending of the Companys normal quarterly reporting periods.\nWe do not currently pay any cash fees to our directors, nor do we pay directors expenses to attend board meetings.\nExecutive Compensation Agreements\nScott M. Boruff, CEO\nEffective May 1, 2021, we entered into a Non-Employee Chief Executive Officer Engagement Agreement (the Contract CEO Agreement) with Platinum Equity Advisors, LLC (Platinum) to provide the services of Scott M. Boruff as Chief Executive Officer and Chairman of the Board of Directors of the Company for a term of three (3) years. As compensation for the services, the Company shall pay Platinum an annual base fee of $323,400 and it is entitled to discretionary bonus fee payments as may be awarded by our Board of Directors. During the term of the Contract CEO Agreement, Mr. Boruff is entitled to participate in any employee benefit plans, programs or arrangements of the Company in effect during the engagement period which are generally available to other senior executives of the Company.\nThe Contract CEO Agreement terminates upon the death or disability of Mr. Boruff, and may be terminated by us for cause, or by Platinum without cause or for good reason. If the Contract CEO Agreement is terminated by us for cause, upon the death or disability of Mr. Boruff, at non-renewal or by Platinum without good cause, Platinum is only entitled to receive compensation through the date of termination. If the Contract CEO Agreement is terminated by us without cause or by Platinum for good reason, we are obligated to pay Platinum severance equal to one years base fee and any other earned but unpaid compensation. In addition, if at any time during the term of the Contract CEO Agreement Platinum is terminated by us without cause within two years after a Change in Control of our company, or in the 90 days prior the Change in Control at the request of the acquiror, we are obligated to pay Platinum an amount equal to 2.99 times the annual base fee. Change in Control is defined in the Contract CEO Agreement to mean the acquisition by any person of beneficial ownership of our securities representing greater than 50% of the combined voting power of our then outstanding voting securities. The Contract CEO Agreement contains customary invention assignment, non-compete and non-solicitation provisions.\nCharles B. Lobetti, III, CFO\nCharles B. Lobetti, III and the Company entered into a three-year Employment Agreement dated October 8, 2019, in which Mr. Lobetti agreed to serve as our Chief Financial Officer. As compensation, we agreed to pay him an annual salary of $52,000 and he is entitled to discretionary bonuses as may be awarded from time to time by our Board of Directors. Effective May 1, 2020, Mr. Lobettis base salary was increased to $104,000 to reflect an increased time commitment. As additional compensation we granted him stock options to purchase 600,000 shares of our common stock at an exercise price of $0.15 per share, which was the closing price of common stock as reported on the OTC Markets on the date immediately preceding the date of the Employment Agreement. The options vested 25% immediately upon execution of the Employment Agreement with the remaining vesting equally in annual installments over three (3) years. The vesting date of any unvested options accelerates in the event of a Change in Control (as defined in the Employment Agreement). Mr. Lobetti is also entitled to paid vacation and sick leave, an automobile allowance and participation in any employee benefit plans or programs we may offer. The initial term of the Employment Agreement will automatically renew for an additional one-year term unless either party provides notice of non-renewal. Mr. Lobettis Employment Agreement expired on October 8, 2022 and automatically renewed for the additional one-year term.\nThe Employment Agreement terminates upon the death or disability of Mr. Lobetti, and may be terminated by us for cause, or by Mr. Lobetti for any reason. If the Employment Agreement is terminated by us for cause, upon his death or disability, at non-renewal or by Mr. Lobetti, he is only entitled to receive base salary accrued but not paid through the date of termination, and in the case of termination due to death or disability, a pro rata payment of the annual incentive earned for the year of termination. If the Employment Agreement is terminated by us without cause or by Mr. Lobetti for good reason, we are obligated to pay him severance equal to one years base salary and any unpaid incentive compensation. In addition, if at any time during the term of the Employment Agreement Mr. Lobettis employment is terminated by us without cause within two years after a Change in Control of our company, or in the 90 days prior the Change in Control at the request of the acquiror, we are obligated to pay him an amount equal to 2.99 times his annualized compensation. Change in Control is defined in the Employment Agreement to mean the acquisition by any person of beneficial ownership of our securities representing greater than 50% of the combined voting power of our then outstanding voting securities. The Employment Agreement contains customary invention assignment, non-compete and non-solicitation provisions.\nKenneth M. Greenwood, CTO\nKenneth M. Greenwood and the Company entered into a three-year Employment Agreement dated June 15, 2020, in which Mr. Greenwood agreed to serve as our Chief Technology Officer. As compensation, we agreed to pay him an annual salary of $257,000 and he is entitled to discretionary bonuses as may be awarded from time to time by our Board of Directors. As additional compensation we granted him stock options to purchase 2,000,000 shares of our common stock at an exercise price of $0.30 per share, which was the closing price of common stock as reported on the OTC Markets on the date immediately preceding the date of the Employment Agreement. The options vested 25% immediately upon execution of the Employment Agreement with the remaining vesting equally in annual installments over three (3) years. The vesting date of any unvested options accelerates in the event of a Change in Control (as defined in the Employment Agreement). Mr. Greenwood is also entitled to paid vacation and sick leave, and participation in any employee benefit plans or programs we may offer. The initial term of the Employment Agreement will automatically renew for an additional one-year term unless either party provides notice of non-renewal. Mr. Greenwoods Employment Agreement expired on June 15, 2023 and automatically renewed for the additional one-year term.\nThe Employment Agreement terminates upon the death or disability of Mr. Greenwood, and may be terminated by us for cause, or by Mr. Greenwood for any reason. If the Employment Agreement is terminated by us for cause, upon his death or disability, at non-renewal or by Mr. Greenwood, he is only entitled to receive base salary accrued but not paid through the date of termination, and in the case of termination due to death or disability, a pro rata payment of the annual incentive earned for the year of termination. If the Employment Agreement is terminated by us without cause or by Mr. Greenwood for good reason, we are obligated to pay him severance equal to one years base salary and any unpaid incentive compensation. In addition, if at any time during the term of the Employment Agreement Mr. Greenwoods employment is terminated by us without cause within two years after a Change in Control of our company, or in the 90 days prior the Change in Control at the request of the acquiror, we are obligated to pay him an amount equal to 2.99 times his annualized compensation. Change in Control is defined in the Employment Agreement to mean the acquisition by any person of beneficial ownership of our securities representing greater than 50% of the combined voting power of our then outstanding voting securities. The Employment Agreement contains customary invention assignment, non-compete and non-solicitation provisions.\nSusan A. Reyes, M.D., CMO\nSusan A. Reyes, M.D. and the Company entered into a three-year Employment Agreement dated September 1, 2020, in which Dr. Reyes agreed to serve as our Chief Medical Officer. As compensation, we agreed to pay her an annual salary of $52,000 and she is entitled to discretionary bonuses as may be awarded from time to time by our Board of Directors. As additional compensation we granted her stock options to purchase 1,000,000 shares of our common stock at an exercise price of $0.40 per share, which was the closing price of common stock as reported on the OTC Markets on the date immediately preceding the date of the Employment Agreement. The options vested 150,000 shares immediately upon execution of the Employment Agreement with the remaining vesting equally in annual installments over three (3) years. The vesting date of any unvested options accelerates in the event of a Change in Control (as defined in the Employment Agreement). Dr. Reyes is also entitled to paid vacation and sick leave, and participation in any employee benefit plans or programs we may offer. The initial term of the Employment Agreement will automatically renew for an additional one-year term unless either party provides notice of non-renewal.\nThe Employment Agreement terminates upon the death or disability of Dr. Reyes, and may be terminated by us for cause, or by Dr. Reyes for any reason. If the Employment Agreement is terminated by us for cause, upon her death or disability, at non-renewal or by Dr. Reyes, she is only entitled to receive base salary accrued but not paid through the date of termination, and in the case of termination due to death or disability, a pro rata payment of the annual incentive earned for the year of termination. If the Employment Agreement is terminated by us without cause or by Dr. Reyes for good reason, we are obligated to pay her severance equal to one years base salary and any unpaid incentive compensation. In addition, if at any time during the term of the Employment Agreement Dr. Reyes employment is terminated by us without cause within two years after a Change in Control of our company, or in the 90 days prior the Change in Control at the request of the acquiror, we are obligated to pay her an amount equal to 2.99 times her annualized compensation. Change in Control is defined in the Employment Agreement to mean the acquisition by any person of beneficial ownership of our securities representing greater than 50% of the combined voting power of our then outstanding voting securities. The Employment Agreement contains customary invention assignment, non-compete and non-solicitation provisions. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth certain information as of November 13, 2023 regarding the number and percentage of our Common Stock (being our only voting securities) beneficially owned by each officer, director, each person (including any group as that term is used in Section 13(d)(3) of the Exchange Act) known by us to own 5% or more of our Common Stock, and all officers and directors as a group.\nTitle of Class\nName, Title and Address of\nBeneficial Owner of Shares\nAmount of\nBeneficial\nOwnership (10)\nPercent of\nClass (11)\nCommon Scott M. Boruff, CEO, Director (1)\n1462 Rudder Lane Knoxville, TN 37919 25,867,697 36.03 %\nCommon Charles B. Lobetti, III, CFO (2)\n814 Evolve Way, Knoxville, TN 37915 2,600,000 3.72 %\nCommon Kenneth M. Greenwood, CTO (3)\n404 Citrus Ridge Drive, Davenport, FL 33837 7,002,751 9.82 %\nCommon Susan A. Reyes, MD, CMO (4)\n9901 Sierra Vista Lane, Knoxville, TN 37922 2,516,666 3.58 %\nCommon G. Shayne Bench, Director (5)\n309 Ringling Point Dr., Sarasota, FL 34234 2,346,093 3.39 %\nAll Officers and Directors as a Group 40,333,207 53.49 %\nPrincipal\nShareholders:\nCommon Julie Boruff (6)\n1462 Rudder Lane, Knoxville, TN 37919 23,367,697 33.72 %\nCommon Platinum Equity Advisors, LLC (7)\n1462 Rudder Lane, Knoxville, TN 37919 23,367,697 33.72 %\nCommon Jeremy Gindro (8)\n310 Tanner Avenue, Florence, CO 81226 7,870,000 11.36 %\nAll Principal Shareholders as a Group (9) 7,870,000 11.36 %\n1) The common shares owned by Mr. Boruff include 23,367,697 shares beneficially owned by Julie Boruff, who is the spouse of Mr. Boruff.\n2) Mr. Lobetti directly owned 2,000,000 and 400,000 common shares at July 31, 2023 and 2022, respectively. Pursuant to Mr. Lobettis employment agreement dated October 8, 2019, the shares owned at July 31, 2023 also include options to purchase 600,000 shares of our common stock which are vested and exercisable at $0.15 per share and expire in 2024.\n3)\nMr. Greenwood directly owned 5,002,751 common shares at July 31, 2023. He directly owned no common shares at July 31, 2022. Pursuant to Mr. Greenwoods employment agreement dated June 15, 2020, the shares owned at July 31, 2023 include options to purchase 2,000,000 shares of our common stock which are vested and exercisable at $0.30 per share and expire in 2025.\n4) Susan Reyes, MD directly owned 1,516,666 common shares at July 31, 2023. She directly owned no common shares at July 31, 2022. Pursuant to Dr. Reyes employment agreement dated September 1, 2020, the shares include options to purchase 1,000,000 shares of our common stock which are vested, or will vest within 60-days of the filing date of this report, and are exercisable at $0.40 per share and expire in 2025.\n5) G. Shayne Bench beneficially owned 2,064,062 common shares at July 31, 2023. He owned no shares at July 31, 2022. Mr. Benchs beneficial ownership is derived from common shares directly owned by Bucuti Investments, LLC - and entity owned and controlled by Mr. Bench. Upon Mr. Benchs appointment as a director of the Company on September 12, 2022, he received a one (1) year restricted stock grant of 846,093 shares of the Companys common stock. The restricted stock grant vest ratably, on a monthly basis, at the end of each month of completed service. Mr. Bench also assigned his rights to the restricted stock grant to Bucuti Investments, LLC and the shares beneficially owned at July 31, 2023 include the shares vested under the grant.\n6) Includes shares owned by Platinum Equity Advisors, LLC, which is owned 100% and controlled by Julie Boruff.\n7) Owned 100% and controlled by Julie Boruff.\n8) The total includes 100,000 shares owned by James Gindro, the father of Jeremy Gindro.\n9) Only includes those shares not included in officers and directors as a group.\n10) As used in this table, beneficial ownership means the sole or shared power to vote, or to direct the voting of, a security, or the sole or share investment power with respect to a security (i.e., the power to dispose of, or to direct the disposition of a security). The inclusion of any shares as deemed beneficially owned does not constitute an admission of beneficial ownership by the named stockholder.\n11) Unless otherwise indicated, we have been advised that all individuals or entities listed have the sole power to vote and dispose of the number of shares set forth opposite their names. For purposes of computing the number and percentage of shares beneficially owned by a security holder, any shares which such person has the right to acquire within 60 days of November 13, 2023 are deemed to be outstanding, but those shares are not deemed to be outstanding for the purpose of computing the percentage ownership of any other security holder. We currently do not maintain any equity compensation plans. As of November 13, 2023, there were 75,398,198 shares beneficially owned.\nChanges in Control\nWe are not aware of any arrangements that may result in changes in control as that term is defined by the provisions of Item 403(c) of Regulation S-K. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nOther than compensation arrangements, the following is a description of transactions to which we were a participant or will be a participant to, in which:\n● the amounts involved exceeded or will exceed the lesser of 1% of our total assets or $120,000; and\n● any of our directors, executive officers or holders of more than 5% of our capital stock, or any member of the immediate family of the foregoing persons, had or will have a direct or indirect material interest.\nTo continue operations and meet operating cash requirements, we have periodically relied on advances from related parties, primarily shareholders, until such time as our cash flow from operations meets our cash requirements or we are able to obtain adequate financing through sales of our equity securities and/or traditional debt financing. There is no formal written commitment for continued support by shareholders. Amounts advanced primarily relate to amounts paid to vendors. The advances are considered temporary in nature and have not been formalized by any written agreement. As of July 31, 2023 and 2022, related parties were owed $328,819 and $267,765, respectively. The amounts owed are payable on demand and carry no interest. The amounts and terms of the related party advances may not necessarily be indicative of the amounts and terms that would have been incurred had comparable transactions been entered into with independent third parties.\nEffective May 1, 2021, we entered into a Non-Employee Chief Executive Officer Engagement Agreement (the Contract CEO Agreement) with Platinum Equity Advisors, LLC, a related party, to provide the services of our CEO and Chairman of the Board of Directors. Under the terms of the Contract CEO Agreement, Platinum Equity Advisors, LLC was owed $225,000 and $373,500 at July 31, 2023 and 2022, respectively.\nOn June 12, 2023, we issued a Promissory Note to Platinum Equity Advisors, LLC in the principal amount of $372,069. The note, plus accrued interest, is due on December 12, 2023. At July 31, 2023, the principal amount of the note remained $372,069 and accrued but unpaid interest was $5,064. The amount and terms of the related party note may not necessarily be indicative of the amount and terms that would have been incurred had comparable transactions been entered into with independent third parties.\nDirector Independence\nWe currently have no independent directors. Because our common stock is not currently listed on a national securities exchange, we have used the definition of independence of The NASDAQ Stock Market to make this determination. NASDAQ Listing Rule 5605(a)(2) provides that an independent director is a person other than an officer or employee of the company or any other individual having a relationship that, in the opinion of the companys board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. The NASDAQ listing rules provide that a director cannot be considered independent if:\n● the director is, or at any time during the past three years was, an employee of the Company;\n● the director or a family member of the director accepted any compensation from the Company in excess of $120,000 during any period of 12 consecutive months within the three years preceding the independence determination (subject to certain exclusions, including, among other things, compensation for board or board committee service);\n● a family member of the director is, or at any time during the past three years was, an executive officer of the Company;\n● the director or a family member of the director is a partner in, controlling stockholder of, or an executive officer of an entity to which the Company made, or from which the Company received, payments in the current or any of the past three fiscal years that exceed 5% of the recipients consolidated gross revenue for that year or $200,000, whichever is greater (subject to certain exclusions);\n● the director or a family member of the director is employed as an executive officer of an entity where, at any time during the past three years, any of the executive officers of the Company served on the compensation committee of such other entity; or\n● The director or a family member of the director is a current partner of the Companys outside auditor, or at any time during the past three years was a partner or employee of the Companys outside auditor, and who worked on the Companys audit.\nThe Company does not currently have a separately designated audit, nominating, or compensation committee. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nThe following table sets forth the aggregate fees billed for each of the last two fiscal years for professional services rendered by the principal accountant for the audit of the Companys annual financial statements and review of financial statements included in the Companys quarterly reports or services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years.\nJuly 31, 2023 July 31, 2022\nAudit Fees $ 43,999 $ 45,900\nAudit-Related Fees - -\nTax Fees - -\nAll Other Fees - -\nTotal $ 43,999 $ 45,900\nAudit Committee Pre-Approval of Audit and Permissible Non-Audit Services of Independent Auditors\nGiven the small size of our Board as well as the limited activities of our Company, our Board of Directors acts as our Audit Committee. Our Board pre-approves all audit and permissible non-audit services. These services may include audit services, audit-related services, tax services, and other services. Our Board approves these services on a case-by-case basis.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nExhibit\nNo.\nDescription\n2.1\nBusiness Acquisition Agreement between Tomichi Creek Outfitters and Grasshopper Staffing, Inc., dated March 2, 2015 (as filed by the Company with the Securities and Exchange Commission on Form 8-K dated March 5, 2015 and incorporated herein by reference)\n3.1\nArticles of Incorporation (as filed by the Company with the Securities and Exchange Commission of Form S-1 dated August 20, 2013, and incorporated herein by reference)\n3.2\nCertificate of Amendment to Articles of Incorporation, filed November 2, 2015 (as filed with the Securities and Exchange Commission on Form 10-K dated November 23, 2016 and incorporated herein by reference)\n3.3\nBylaws (as filed by the Company with the Securities and Exchange Commission of Form S-1 dated August 20, 2013, and incorporated herein by reference)\n4.1\nPromissory Note in the principal amount of $360,000 between the Company and AJB Capital Investments, LLC, dated February 2, 2021 (as with the Securities and Exchange Commission on Form 8-K dated February 5, 2021 and incorporated herein by reference).\n4.2\nPromissory Note in the principal amount of $600,000 between the Company and AJB Capital Investments, LLC, dated February 9, 2022 (as with the Securities and Exchange Commission on Form 8-K dated February 14, 2022 and incorporated herein by reference).\n10.1\nAdvisory Agreement dated January 15, 2016 by and between Grasshopper Staffing, Inc. and Platinum Equity Advisors, LLC (as filed with the Securities and Exchange Commission on Form 8-K dated January 22, 2016 and incorporated herein by reference)\n10.2**\nEmployment Agreement between the Company and Charles B. Lobetti, III, dated October 8, 2019 (as filed with the Securities and Exchange Commission on Form 8-K dated January 14, 2020 and incorporated herein by reference)\n10.3**\nEmployment Agreement between the Company and Kenneth M. Greenwood, dated June 15, 2020 (as filed with the Securities and Exchange Commission on Form 8-K dated June 16, 2020 and incorporated herein by reference)\n10.4**\nEmployment Agreement between the Company and Susan A. Reyes, M.D., dated September 1, 2020 (as filed with the Securities and Exchange Commission on Form 8-K dated September 4, 2020 and incorporated herein by reference)\n10.5**\nNon-Employee Chief Executive Officer Engagement Agreement between the Company and Platinum Equity Advisors, LLC, effective May 1, 2021 (as filed with the Securities and Exchange Commission on Form 10-K dated October 28, 2021 and incorporated herein by reference)\n10.6**\nConsulting Agreement between the Company and G. Shayne Bench, effective August 26, 2022 (as filed with the Securities and Exchange Commission on Form 10-K dated September 23, 2022 and incorporated here by reference).\n31.1*\nChief Executive Officer and Chief Financial Officer Certification pursuant to section 302 of the Sarbanes-Oxley Act of 2002*\n32.1*\nChief Executive Officer and Chief Financial Officer Certification pursuant to section 906 of the Sarbanes-Oxley Act of 2002*\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed Herewith **Executive Compensation Agreement\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act of 1934, the registrant has caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nHealthcare Integrated Technologies, Inc.\nDate: November 13, 2023\nBy:\n/s/ Scott M. Boruff\nScott M. Boruff\nPresident, Chief Executive Officer (Principal Executive Officer)\nHealthcare Integrated Technologies, Inc.\nDate: November 13, 2023\nBy:\n/s/ Charles B. Lobetti, III\nCharles B. Lobetti, III\nChief Financial Officer (Principal Financial Officer)\nIn accordance with the Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDate: November 13, 2023 By:\n/s/ Scott M. Boruff\nScott M. Boruff\nPresident, Chief Executive Officer, Director (Principal Executive Officer)\nDate: November 13, 2023 By:\n/s/ Charles B. Lobetti, III\nCharles B. Lobetti, III\nChief Financial Officer (Principal Financial Officer)\nPage\nFiscal Years Ended July 31, 2023 and 2022\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 910)\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Changes in Stockholders Deficit\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements -\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of\nHealthcare Integrated Technologies, Inc.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Healthcare Integrated Technologies, Inc. (the Company) as of July 31, 2023 and 2022, and the related consolidated statements of operations, stockholders deficit and cash flows for each of the years in the two-year period ended July 31, 2023 and the related notes (collectively referred to as the financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of July 31, 2023 and 2022, and the results of its consolidated operations and its consolidated cash flows for each of the years in the two-year period ended July 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has a history of losses, an accumulated deficit, has negative working capital and has not generated cash from operations to support a meaningful and ongoing business plan. Managements evaluation of the events and conditions and managements plans regarding those matters also are described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty. Our opinion is not modified with respect to that matter.\n/s/ Rodefer Moss & Co, PLLC\nWe have served as the Companys auditor since 2019\nBrentwood, Tennessee\nNovember 13, 2023\nHEALTHCARE INTEGRATED TECHNOLOGIES, INC.\nCONSOLIDATED BALANCE SHEETS\nJuly 31, 2023 July 31, 2022\nASSETS\nCURRENT ASSETS:\nCash and cash equivalents $ 411 $ 1,051\nPrepaid expenses 34,092 36,616\nTotal current assets 34,503 37,667\nOTHER ASSETS:\nIntangibles, net 869,432 688,353\nTotal assets $ 903,935 $ 726,020\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCURRENT LIABILITIES:\nAccounts payable and accrued expenses $ 258,708 $ 202,973\nAccounts payable and accrued expenses, related party 558,883 641,315\nPayroll related liabilities 155,143 1,452,434\nNotes payable, related party 372,069 -\nNotes payable, net 50,000 455,605\nConvertible notes 175,000 325,000\nDerivative liability - 76,451\nTotal current and total liabilities 1,569,803 3,153,778\nSTOCKHOLDERS DEFICIT:\nCommon stock par value $0.001; 200,000,000 shares authorized; 68,016,167 and 42,304,673 shares issued and outstanding as of July 31, 2023 and 2022, respectively 68,016 42,305\nAdditional paid-in capital 14,878,282 11,839,645\nAccumulated deficit (15,612,166 ) (14,309,708 )\nTotal stockholders deficit (665,868 ) (2,427,758 )\nTotal liabilities and stockholders deficit $ 903,935 $ 726,020\nSee accompanying notes to the consolidated financial statements.\nHEALTHCARE INTEGRATED TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended July 31,\nOPERATING EXPENSES:\nSelling, general & administrative $ 674,552 $ 664,554\nStock-based compensation 287,016 473,511\nTotal operating expenses 961,568 1,138,065\nOPERATING LOSS (961,568 ) (1,138,065 )\nOTHER INCOME (EXPENSE):\nInterest expense (417,341 ) (447,623 )\nChange in fair value of derivative liability 76,451 224,667\nTotal other income (expense) (340,890 ) (222,956 )\nNET LOSS $ (1,302,458 ) $ (1,361,021 )\nNET LOSS PER COMMON SHARE\nBasic and diluted $ (0.03 ) $ (0.03 )\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING\nBasic and diluted 44,050,535 42,024,810\nSee accompanying notes to the consolidated financial statements.\nHEALTHCARE INTEGRATED TECHNOLOGIES, INC.\nSTATEMENTS OF CHANGES IN STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED JULY 31, 2023 AND 2022\nShares Amount Capital Subscribed Deficit Deficit\nCommon Stock Additional\nPaid-In\nCommon Stock Accumulated Total Stockholders\nShares Amount Capital Subscribed Deficit Deficit\nBalances at July 31, 2021 40,118,007 $ 40,118 $ 11,039,284 $ 100,000 $ (12,948,687 ) $ (1,769,285 )\nNet loss - - - - (1,361,021 ) (1,361,021 )\nReceipt of cash under stock subscription agreement\n(25,000 )\n(25,000 )\nIssuance of shares for services 170,000 25,330\n25,500\nIssuance of shares and settlement of stock subscription 1,250,000 1,250 123,750 (75,000 )\n50,000\nIssuance of shares under debt settlement and amendment agreement 666,666 (667 ) -\n-\nIssuance of warrants with debt recorded as debt discount\n99,905\n99,905\nStock-based compensation 100,000 552,043 - - 552,143\nBalances at July 31, 2022 42,304,673 $ 42,305 $ 11,839,645 $ - $ (14,309,708 ) $ (2,427,758 )\nBalance 42,304,673 $ 42,305 $ 11,839,645 $ - $ (14,309,708 ) $ (2,427,758 )\nNet loss - - - - (1,302,458 ) (1,302,458 )\nIssuance of shares for cash 3,000,000 3,000 297,000\n300,000\nIssuance of shares for services 450,000 28,300\n28,750\nIssuance of shares for conversion of debt and related accrued interest 375,172 187,211\n187,586\nIssuance of shares payment of accrued expenses 19,722,260 19,722 2,033,284\n2,053,006\nIssuance of shares for note amendment fees 1,500,000 1,500 148,500\n150,000\nStock-based compensation 664,062 344,342 - - 345,006\nBalances at July 31, 2023 68,016,167 $ 68,016 $ 14,878,282 $ - $ (15,612,166 ) $ (665,868 )\nBalance 68,016,167 $ 68,016 $ 14,878,282 $ - $ (15,612,166 ) $ (665,868 )\nSee accompanying notes to the consolidated financial statements.\nHEALTHCARE INTEGRATED TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended July 31,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss $ (1,302,458 ) $ (1,361,021 )\nAdjustments to reconcile loss to net cash used in operating activities:\nDepreciation and amortization 16,885 11,215\nStock-based compensation 287,016 473,511\nShares issued for services 28,750 25,500\nShares issued for note amendment fees 150,000 -\nAmortization of debt discount 194,395 374,395\nChange in fair value of derivative liability (76,451 ) (224,667 )\nChanges in operating assets and liabilities:\nPrepaid expenses and other current assets 2,524\nAccounts payable and accrued expenses 91,571 11,431\nAccounts payable and accrued expenses, related party 328,464 323,400\nPayroll related liabilities 173,101 153,100\nNET CASH USED BY OPERATING ACTIVITIES (106,203 ) (212,177 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nCash paid for development of intangible assets (27,560 ) (32,690 )\nNET CASH USED BY INVESTING ACTIVITIES (27,560 ) (32,690 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from sale of common stock 300,000 -\nProceeds from related party loans 584,283 213,600\nPayments of amounts owed to related parties (151,160 ) (148,125 )\nPrincipal payments of short-term debt (600,000 ) (360,000 )\nProceeds from debt issuance - 504,000\nProceeds from common stock subscriptions - 25,000\nNET CASH PROVIDED BY FINANCING ACTIVITIES 133,123 234,475\nNet change in cash and cash equivalents (640 ) (10,392 )\nCash and cash equivalents, beginning of period 1,051 11,443\nCash and cash equivalents, end of period $ 411 $ 1,051\nSUPPLEMENTAL CASH FLOW INFORMATION\nCash paid for interest $ 62,069 $ 51,180\nSIGNIFICANT NON-CASH INVESTING AND FINACING ACTIVITIES\nShares issued for payment of payroll related liabilities $ 1,581,056\nShares issued for payment of items included in accounts payable and accrued expenses $ 37,586\nShares issued for payment of items included in accounts payable and accrued expenses, related party $ 471,950\nShares issued for payment of convertible debt $ 150,000\nCapital expenditures included in payroll related liabilities $ 110,664 $ 147,117\nCapital expenditures stock-based compensation $ 57,990 $ 78,632\nDerivative liability recorded as debt discount\n$ 192,886\nIssuance of warrants with debt recorded as debt discount\n$ 99,905\nSee accompanying notes to the consolidated financial statements.\nHEALTHCARE INTEGRATED TECHNOLOGIES, INC.\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023 and 2022\nNOTE 1 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nHealthcare Integrated Technologies, Inc. and its subsidiaries (collectively the Company, we, our or us) is a healthcare technology company based in Knoxville, Tennessee. We are creating a diversified spectrum of healthcare technology solutions to integrate and automate the continuing care, home care and professional healthcare spaces.\nOur initial product, SafeSpace™ with AI Vision™, is an ambient fall detection solution designed for continuing care communities and at home use. SafeSpace includes hardware devices utilizing RGB, radar and other sensor technology coupled with our internally developed software to effectively monitor a person remotely. In continuing care communities, SafeSpace detects resident falls and generates alerts to a centralized, intelligent dashboard without the use of wearable devices or any action by the resident. In the home, SafeSpace detects falls and sends alerts directly to designated individuals.\nWe recently introduced and are currently pilot testing two additional products - SafeFace™ and SafeGuard™. SafeFace provides fully automated and ambient time and attendance reporting for facility staff, and an integrated and automatic agency invoice reconciliation feature. SafeGuard is a novel fully ambient elopement detection and alerting system based on our facial recognition technology.\nIn addition to our current product offerings, we are developing a home concierge healthcare service application to provide a virtual assisted living experience for seniors, recently released postoperative patients and others. The concierge application will enable the consumer to obtain home healthcare services and health and safety monitoring equipment to improve quality of life. We are also working to develop a fully integrated solution for the professional healthcare community that integrates electronic health records, remote patient monitoring, telehealth, and other items where integration is beneficial.\nBasis of Presentation\nThe accompanying consolidated financial statements include those of Healthcare Integrated Technologies, Inc. and its subsidiaries, after elimination of all intercompany accounts and transactions. We have prepared the accompanying consolidated financial statements in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP) and pursuant to the rules and regulations of the United States Securities and Exchange Commission (the SEC).\nConsolidation Policy\nOur consolidated financial statements are consolidated in accordance with U.S. GAAP and include our accounts and the accounts of our wholly owned subsidiaries. We eliminate all intercompany transactions from our financial results.\nBusiness Combinations\nWe account for business combinations under the acquisition method of accounting. The acquisition method requires that the acquired assets and liabilities, including contingencies, be recorded at fair value determined on the acquisition date and that changes thereafter be reflected in income (loss). The estimation of fair values of the assets and liabilities assumed involves several estimates and assumptions that could differ materially from the actual amounts recorded. The results of the acquired businesses are included in our results from operations beginning from the day of acquisition.\nRisk and Uncertainties\nFactors that could affect our future operating results and cause actual results to vary materially from managements expectation include, but are not limited to: our ability to maintain and secure adequate capital to fund our operations and fully develop our product(s); our ability to source strong opportunities with sufficient risk adjusted returns; acceptance of the terms and conditions of our licenses and/or the acceptance of our royalties and fees; the nature and extent of competition from other companies that may reduce market share and create pressure on pricing and investment return expectations; changes in the projects in which we plan to invest which result from factors beyond our control, including, but not limited to, a change in circumstances, capacity and economic impacts; changes in laws, regulations, accounting, taxation, and other requirements affecting our operations and business. Negative developments in these or other risk factors could have a significant adverse effect on our financial position, results of operations and cash flows.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results may differ from those estimates. We base our estimates on experience and various other assumptions that are believed to be reasonable under the circumstances. We evaluate our estimates and assumptions on a regular basis and actual results may differ from those estimates.\nReclassifications\nCertain prior period amounts have been reclassified to conform to current period presentation with no changes to previously reported net loss or stockholders deficit.\nCash and Cash Equivalents\nWe consider all highly liquid short-term investments with a maturity of three months or less at the time of purchase to be cash equivalents. The Company minimizes its credit risk associated with cash by periodically evaluating the credit quality of its primary financial institution. The balance at times may exceed federally insured limits. No loss has been experienced and management does not believe we are exposed to any significant credit risk.\nAccounts Receivable\nAccounts receivable are stated at their historical carrying amount net of write-offs and allowance for uncollectible accounts. We routinely assess the recoverability of all customer and other receivables to determine their collectability and record a reserve when, based on the judgement of management, it is probably that a receivable will not be collected and the amount of the reserve may be reasonably estimated. When collection is no longer pursued, we charge uncollectable accounts receivable against the reserve.\nConcentration of Credit Risk\nFinancial instruments that potentially expose the Company to credit risk consist of demand deposits with a financial institution. The Company is exposed to credit risk on its cash and cash equivalents in the event of default by the financial institution to the extent account balances exceed the amount insured by the FDIC, which is $250,000.\nFair Value of Financial Instruments\nFair value is defined as the price that would be received to sell an asset, or paid to transfer a liability, in an orderly transaction between market participants. A fair value hierarchy has been established for valuation inputs that gives the highest priority to quoted prices in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The fair value hierarchy is as follows:\nLevel 1 Inputs - Unadjusted quoted prices in active markets for identical assets or liabilities that the reporting entity can access at the measurement date.\nLevel 2 Inputs - Inputs other than quoted prices included in Level 1 that are observable for the asset or liability, either directly or indirectly. These might include quoted prices for similar assets or liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable for the asset or liability (such as interest rates, volatilities, prepayment speeds, credit risks, etc.) or inputs that are derived principally from or corroborated by market data by correlation or other means.\nLevel 3 Inputs - Unobservable inputs for determining the fair values of assets or liabilities that reflect an entitys own assumptions about the assumptions that market participants would use in pricing the assets or liabilities.\nFinancial instruments consist of cash and cash equivalents, accounts receivable, accounts payable and borrowings. The fair value of current financial assets and current financial liabilities approximates their carrying value because of the short-term maturity of these financial instruments.\nProperty and Equipment\nProperty and equipment are stated at cost, net of accumulated depreciation. Expenditures for major additions and improvements are capitalized while minor replacements and maintenance and repairs, which do not improve or extend the life of such assets, are charged to operations as incurred. Disposals are removed at cost less accumulated depreciation, and any resulting gain or loss is reflected in the consolidated statement of operations. Depreciation is calculated using the straight-line method which depreciates the assets over the estimated useful lives of the depreciable assets ranging from five to seven years.\nIntangible Assets\nIntangible assets consist of patents, our website and the costs of software developed for internal use. Certain payroll and stock-based compensation costs incurred are allocated to the intangible assets. We determine the amount of costs to be capitalized based on the time spent by employees or outside contractors on the projects. Intangible assets are amortized over their expected useful life on a straight-line basis. We evaluate the useful lives of these assets on an annual basis and test for impairment whenever events or changes in circumstances occur that could impact the recoverability of these assets. If the estimate of an intangible assets remaining life is changed, the remaining carrying value of the intangible asset is amortized prospectively over the revised remaining useful life. We did not recognize any impairment losses during any of the periods presented.\nImpairment of Long-Lived Assets\nLong-lived assets such as property, equipment and identifiable intangibles are reviewed for impairment at least annually or whenever facts and circumstances indicate that the carrying value may not be recoverable. When required, impairment losses on assets to be held and used are recognized based on the fair value of the asset. The fair value is determined based on estimates of future cash flows, market value of similar assets, if available, or independent appraisals, if required. If the carrying amount of the long-lived asset is not recoverable, an impairment loss is recognized for the difference between the carrying amount and fair value of the asset. The Company did not recognize any impairment losses for any periods presented.\nDerivative Liability\nOptions, warrants, convertible notes, or other contracts, if any, are evaluated to determine if those contracts, or embedded components of those contracts, qualify as derivatives to be separately accounted for in accordance with Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 815, Derivatives and Hedging, (paragraph 815-10-05-4 and Section 815-40-25). The result of this accounting treatment is that the fair value of the embedded derivative is marked-to-market each balance sheet date and recorded as either an asset or a liability. The change in fair value is recorded in the consolidated statements of operations as other income or expense. Upon conversion, exercise or cancellation of a derivative instrument, the instrument is marked to fair value at the date of conversion, exercise, or cancellation and then the related fair value is reclassified to equity.\nIn circumstances where the embedded conversion option in a convertible instrument is required to be bifurcated, and there are also other embedded derivative instruments in the convertible instrument that are required to be bifurcated, the bifurcated derivative instruments are accounted for as a single, compound derivative instrument.\nThe classification of derivative instruments, including whether such instruments should be recorded as liabilities or as equity, is re-assessed at the end of each reporting period. Equity instruments that are initially classified as equity that become subject to reclassification are reclassified to liability at the fair value of the instrument on the reclassification date. Derivative instrument liabilities will be classified in the balance sheet as current or non-current based on whether net-cash settlement of the derivative instrument is expected within 12 months of the balance sheet date.\nThe Company adopted Section 815-40-15 of the FASB ASC (Section 815-40-15) to determine whether an instrument (or an embedded feature) is indexed to the Companys own stock. Section 815-40-15 provides that an entity should use a two- step approach to evaluate whether an equity-linked financial instrument (or embedded feature) is indexed to its own stock, including evaluating the instruments contingent exercise and settlement provisions.\nWe utilize a binomial option pricing model to compute the fair value of the derivative liability and to mark to market the fair value of the derivative liability at each balance sheet date. We record the change in the fair value of the derivative liability as other income or expense in the consolidated statements of operations.\nThe Company had a derivative liability of $-0- and $76,451 as July 31, 2023 and 2022, respectively.\nRevenue Recognition\nRevenue is recognized under ASC 606, Revenue from Contracts with Customers using the modified retrospective method. Under this method, the Company follows the five-step model provided by ASC Topic 606 in order to recognize revenue in the following manner: 1) Identify the contract; 2) Identify the performance obligations of the contract; 3) Determine the transaction price of the contract; 4) Allocate the transaction price to the performance obligations; and 5) Recognize revenue. An entity recognizes revenue for the transfer of promised goods or services to customers in an amount that reflects the consideration for which the entity expects to be entitled in exchange for those goods or services. The Companys revenue recognition policies remained unchanged as a result of the adoption of ASC 606, and there were no significant changes in business processes or systems.\nAdvertising and Marketing\nAdvertising and marketing costs are expensed as incurred in accordance with ASC 720-35, Advertising Costs. We incurred advertising and marketing costs of $6,184 and $36,535 for the years ended July 31, 2023 and 2022, respectively, which are included in selling, general and administrative expenses on the consolidated financial statements.\nStock-Based Compensation\nThe Company accounts for stock-based compensation in accordance with ASC Topic 718, Compensation - Stock Compensation (ASC 718) which establishes financial accounting and reporting standards for stock-based employee compensation. It defines a fair value-based method of accounting for an employee stock option or similar equity instrument. The Company accounts for compensation cost for stock option plans, if any, in accordance with ASC 718.\nStock-based payments, excluding restricted stock, are valued using a Black-Scholes option pricing model. Grants of stock-based payment awards issued to non-employees for services rendered have been recorded at the fair value of the stock-based payment, which is the more readily determinable value. The grants are amortized on a straight-line basis over the requisite service periods, which is generally the vesting period. If an award is granted, but vesting does not occur, any previously recognized compensation cost is reversed in the period related to the termination of service. Stock-based compensation expenses are included in cost of goods sold or selling, general and administrative expenses, depending on the nature of the services provided, in the consolidated statements of operations. Stock-based payments issued to placement agents are classified as a direct cost of a stock offering and are recorded as a reduction in additional paid in capital.\nThe Company recognizes all forms of stock-based payments, including stock option grants, warrants and restricted stock grants, at their fair value on the grant date, which are based on the estimated number of awards that are ultimately expected to vest.\nIncome Taxes\nWe use the asset and liability method of accounting for income taxes in accordance with Topic 740, Income Taxes. Under this method, income tax expense is recognized for the amount of: (1) taxes payable or refundable for the current year and (2) deferred tax consequences of temporary differences resulting from matters that have been recognized in an entitys financial statements or tax returns. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the results of operations in the period that includes the enactment date. A valuation allowance is provided to reduce the deferred tax assets reported if based on the weight of the available positive and negative evidence, it is more likely than not some portion or all of the deferred tax assets will not be realized.\nASC Topic 740-10-30 clarifies the accounting for uncertainty in income taxes recognized in an enterprises financial statements and prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. ASC Topic 740-10-40 provides guidance on de-recognition, classification, interest and penalties, accounting in interim periods, disclosure, and transition. We have no material uncertain tax positions for any of the reporting periods presented.\nNet Loss Per Common Share\nWe determine basic loss per share and diluted income (loss) per share in accordance with the provisions of ASC 260, Earnings Per Share. Basic loss per share excludes dilution and is computed by dividing earnings available to common stockholders by the weighted-average number of common shares outstanding for the period. The calculation of diluted loss per share is similar to that of basic earnings per share, except the denominator is increased, if the earnings are positive, to include the number of additional common shares that would have been outstanding if all potentially dilutive common shares had been exercised.\nRecent Accounting Pronouncements\nManagement has evaluated all recent accounting pronouncements as issued by the FASB in the form of Accounting Standards Updates (ASU) through the date these consolidated financial statements were available to be issued and found no recent accounting pronouncements issued, but not yet effective, that when adopted, will have a material impact on the consolidated financial statements of the Company.\nNOTE 2 - GOING CONCERN\nThe accompanying consolidated financial statements have been prepared in conformity with U.S. GAAP, which contemplates continuation of the Company as a going concern. The Company had a net loss of $1,302,458 for its most recent fiscal year ended July 31, 2023. As of July 31, 2023, the Company has minimal cash and a significant working capital deficit. We have a history of losses, an accumulated deficit, have negative working capital and have not generated cash from our operations to support a meaningful and ongoing business plan. It is managements opinion that these conditions raise substantial doubt about the Companys ability to continue as a going concern.\nIn view of these matters, our ability to continue as a going concern is dependent upon the development, marketing and sales of a viable product to achieve a level of profitability. We intend to finance our future development activities and our working capital needs largely from the sale of private and public equity securities with additional funding from other traditional financing sources, including term notes, until such time that funds provided by operations are sufficient to fund working capital requirements. Although the Company believes in the viability of managements strategy to generate sufficient revenue, control costs and the ability to raise additional capital, there can be no assurances to that effect. Therefore, the accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. The consolidated financial statements do not include any adjustments relating to the recoverability and classification of recorded assets, or the amounts and classifications of liabilities that might be necessary should we be unable to continue as a going concern.\nNOTE 3 - PREPAID EXPENSES\nPrepaid expenses consisted of the following at July 31, 2023 and 2022:\nSCHEDULE OF PREPAID EXPENSES\nJuly 31, 2023 July 31, 2022\nPrepaid legal fees $ 33,932 $ 36,616\nDue to others -\nTotal prepaid expenses $ 34,092 $ 36,616\nNOTE 4 - INTANGIBLES, NET\nIntangibles, net consisted of the following at July 31, 2023 and 2022:\nSCHEDULE OF INTANGIBLES ASSET\nJuly 31, 2023 July 31, 2022\nCapitalized costs of developed software 627,440 -\nCapitalized costs of patents 258,422 137,798\nCapitalized costs of website 8,785 8,785\nIntangible assets under development - 559,103\nIntangibles, gross - 559,103\nLess: accumulated amortization (25,215 ) (17,333 )\nTotal intangibles, net $ 869,432 $ 688,353\nAmortization expense for the years ended July 31, 2023 and 2022 was $16,885 and $10,983, respectively.\nIntangibles are amortized over their estimated useful lives of 2 to 20 years. As of July 31, 2023, the weighted average remaining useful life of intangibles being amortized was approximately seven (7) years. We expect the remaining aggregate amortization expense for each of the five succeeding fiscal years to be as follows:\nSCHEDULE OF FINITE-LIVED INTANGIBLE ASSETS, FUTURE AMORTIZATION EXPENSE\n$ 222,788\n222,788\n222,788\n13,641\n13,641\nThereafter 173,786\nTotal expected amortization expense $ 869,432\nNOTE 5 - ACCOUNTS PAYABLE AND ACCRUED EXPENSES\nAccounts payable and accrued expenses consisted of the following at July 31, 2023 and 2022:\nSCHEDULE OF ACCOUNTS PAYABLE AND ACCRUED EXPENSES\nJuly 31, 2023 July 31, 2022\nAccounts payable $ 197,234 $ 119,725\nAccrued interest expense 61,474 83,248\nAccounts payable and accrued expenses 258,708 202,973\nAccounts payable, related party 328,819 267,765\nAccrued expenses, related party 230,064 373,550\nAccounts payable and accrued expenses, related party 558,883 641,315\nTotal accounts payable and accrued expenses $ 817,591 $ 844,288\nNOTE 6 - PAYROLL RELATED LIABILITIES\nPayroll related liabilities consisted of the following at July 31, 2023 and 2022:\nSCHEDULE OF PAYROLL RELATED LIABILITIES\nJuly 31, 2023 July 31, 2022\nAccrued officers payroll $ 143,073 $ 1,440,364\nPayroll taxes payable 12,070 12,070\nTotal payroll related liabilities $ 155,143 $ 1,452,434\nNOTE 7 - NOTE PAYABLE, RELATED PARTY\nOn June 12, 2023, we issued a Promissory Note to Platinum Equity Advisors, LLC, a related party (the Platinum Note), in the principal amount of $372,069. The Platinum Note is unsecured and bears interest at 10% per annum. The principal amount of the note plus accrued interest of $18,604 is due in a single lump sum payment on December 12, 2023. We incurred no issuance cost on the transaction and the proceeds were used to retire our obligations under the AJB Note 2 (See Note 8 - Notes Payable, Net). At July 31, 2023, the principal balance of the Platinum Note remained $372,069 and accrued but unpaid interest was $5,064. The accrued interest is included in Accounts payable and accrued expenses, related party on our consolidated balance sheets. The amounts and terms of the related party transactions may not necessarily be indicative of the amounts and terms that would have been incurred had comparable transactions been entered into with independent third parties.\nNOTE 8 - NOTES PAYABLE, NET\nWe had the following debt obligations reflected at their respective carrying values on our consolidated balance sheets as of July 31, 2023 and 2022:\nSCHEDULE OF DEBT OBLIGATIONS\nJuly 31, 2023 July 31, 2022\n5% Convertible promissory notes $ 175,000 $ 325,000\nNote payable to Acorn Management Partners, LLC 50,000 50,000\nNote payable to AJB Capital Investments, LLC - 600,000\nTotal debt obligations 225,000 975,000\nLess debt discount - (194,395 )\nNotes payable, net $ 225,000 $ 780,605\n5% Convertible Promissory Notes\nOn various dates during the month of March 2018, we issued a series of 5% Convertible Promissory Notes (collectively, the 5% Notes) totaling $750,000 in net proceeds. We incurred no costs related to the issuance of the 5% Notes. The 5% Notes bear interest at the rate of five percent (5%) per annum, compounded annually and matured one-year from the date of issuance. At July 31, 2023 and 2022, accrued but unpaid interest on the 5% Notes was $52,555 and $77,329, respectively, which is included in Accounts payable and accrued expenses on our consolidated balance sheets.\nThe 5% Notes are convertible into common shares of the Company at a fixed ratio of two shares of common stock per dollar amount of the face value of the note. The principal terms under which the 5% Notes may be converted into common stock of the Company are as follows:\n● At the option of the holder, the outstanding principal amount of the note, and any accrued but unpaid interest due, may be converted into the Companys common stock at any time prior to the maturity date of the note.\n● The outstanding principal amount of the note, and any accrued but unpaid interest due, will automatically be converted into the Companys common stock if at any time prior to the maturity date of the note, the Company concludes a sale of equity securities in a private offering resulting in gross proceeds to the Company of at least $1,000,000.\n5% Notes with a face amount of $150,000 and related accrued interest of $37,586 were converted into shares of our common stock during the year ended July 31, 2023. There were no 5% Notes converted into shares of our common stock during the year ended July 31, 2022. At July 31, 2023, 5% Notes with a face amount of $175,000 and related accrued interest expense of $52,555 are currently in default and are not convertible under the conversion terms. Management is currently negotiating amendments to the notes in default to extend the maturity dates of such notes and to encourage note conversions.\nNote Payable to Acorn Management Partners, LLC\nOn August 11, 2020 we agreed to repurchase 1,000,000 shares of our common stock from Acorn Management Partners, LLC (AMP). As consideration for the share repurchase, we issued a $50,000 promissory note bearing interest a 6.0% per annum and due one-year from the date of issuance (the Acorn Note). In the event we default under the terms of the Acorn Note, we are required to deliver 1,000,000 shares of our common stock back to AMP in full satisfaction of the obligation. The purchased shares were delivered by AMP directly to the transfer agent on September 8, 2020 and immediately cancelled. At July 31, 2023 and 2022, accrued but unpaid interest on the Acorn Note was $8,919 and $5,919, respectively, which is included in Accounts payable and accrued expenses on our consolidated balance sheets.\nNote Payable to AJB Capital Investments, LLC\nOn February 2, 2021, we entered into a Securities Purchase Agreement with AJB Capital Investments, LLC (AJB Capital), pursuant to which AJB Capital purchased a Promissory Note (the AJB Note 1) in the principal amount of $360,000 for an aggregate purchase price of $320,400. The AJB Note 1 accrued interest at the rate of ten percent (10%) per annum and matured on August 2, 2021. At our option, the maturity date of the note was extended for six (6) months. Upon extension of the maturity date, the AJB Note 1 interest rate increased to twelve percent (12%) per annum during the extension period. We recorded a debt discount of $59,300 related to original issue discount and issuance cost of the note. The principal balance of the AJB Note 1 was paid in full on February 9, 2022 with a portion of the net proceeds from the issuance of a new note to AJB Capital on such date.\nOn February 9, 2022, we entered into a Securities Purchase Agreement with AJB Capital, pursuant to which AJB Capital purchased a Promissory Note (the AJB Note 2) in the principal amount of $600,000 for an aggregate purchase price of $534,000. The AJB Note 2 accrues interest at the rate of ten percent (10%) per annum and matures on February 9, 2023. We recorded a debt discount of $96,000 related to original issue discount and issuance cost of the note.\nIn the event of default, the AJB Note 2 may be converted into shares of the Companys common stock at a conversion price equal to the lesser of the lowest trading price (i) during the previous twenty (20) trading day period ending on the issuance date of the note, or (ii) during the previous twenty (20) trading day period ending on the date of conversion of the note. We recorded a debt discount of $192,886 related to the conversion feature of the AJB Note 2.\nAs additional consideration for the purchase of the AJB Note 2, we issued AJB Capital 1,500,000 common stock purchase warrants (the Warrants) giving AJB Capital the option to purchase up to 1,500,000 shares of our common stock at a price of $0.10 per share. At the option of AJB Capital, 1,000,000 of the Warrants may be exercised on a cashless basis pursuant to a formula included in the Warrant. The $99,905 grant date fair value of the Warrants was recorded as a debt discount.\nOn June 12, 2023, we retired the AJB Note 2 in full with proceeds received from the issuance of a new promissory note to a related party (See Note 7 - Notes Payable, Related Party).\nTotal unamortized debt discount related to the AJB Capital notes at July 31, 2023 and 2022 was $-0- and $194,395, respectively. During the years ended July 31, 2023 and 2022, amortization of the debt discount on the AJB Capital notes was $194,395 and $374,395, respectively. Debt discount is included as a component of interest expense in the interim consolidated statements of operations.\nNOTE 9 - DERIVATIVE LIABILITY\nOn February 2, 2021, we entered into a Securities Purchase Agreement with AJB Capital Investments, LLC (AJB Capital), pursuant to which AJB Capital purchased a Promissory Note (the AJB Note 1) in the principal amount of $360,000 for an aggregate purchase price of $320,400. The note was fully repaid on February 9, 2022.\nOn February 9, 2022, we entered into a new Securities Purchase Agreement with AJB Capital, pursuant to which AJB Capital purchased a Promissory Note (the AJB Note 2) in the principal amount of $600,000 for an aggregate purchase price of $534,000. On June 12, 2023, we retired the AJB Note 2 in full with proceeds received from the issuance of a new promissory note to a related party (See Note 7 - Notes Payable, Related Party and Note 8 - Notes Payable, Net).\nUpon issuance, we identified certain conversion features embedded in the AJB Capital notes that represented derivative liabilities.\nThe following table summarizes the changes in fair value, including net transfers in and/or out, of all financial assets and liabilities measured at fair value on a recurring basis using significant unobservable inputs (Level 3) during the years ended July 31, 2023 and 2022:\nSCHEDULE OF FAIR VALUE OF ASSETS AND LIABILITIES\nJuly 31, 2023 July 31, 2022\nBalance at beginning of period $ 76,451 $ 108,232\nDerivative liability on issuance of notes - 192,886\nChange in fair value of derivative liability (76,451 ) (224,667 )\nBalance at end of period $ - $ 76,451\nDuring the years ended July 31, 2023 and 2022, the fair value of the derivative feature of the AJB Capital notes were calculated using the following range of assumptions:\nSCHEDULE OF FAIR VALUE ASSUMPTIONS OF DERIVATIVE FEATURE\nJuly 31, 2023\nJuly 31, 2022\nExpected volatility 94.2 to 126.4 % 70.4 to 101.2 %\nExpected term (in years) 0.02 to .27\n0.01 to 1.00\nRisk-free interest rate 4.06 to 4.58 % 0.04 to 2.91 %\nDividend yield None\nNone\nOn July 31, 2023 and 2022, the derivative liability related to the AJB Capital notes was $-0- and $76,451, respectively. For the years ended July 31, 2023 and 2022, we recorded income of $76,451 and $224,667, respectively, related to the change in fair value of the derivative liability.\nThere was no derivative expense recorded in the years ended July 31, 2023 and 2022.\nNOTE 10 - STOCK-BASED COMPENSATION\nOur stock-based compensation programs are long-term retention awards that are intended to attract, retain, and provide incentives for employees, officers and directors, and to align stockholder and employee interest. We utilize grants of both stock options and warrants and restricted stock to achieve those goals.\nSummary of Stock Options and Warrants\nDuring the year ended July 31, 2023, we recorded $230,834 of compensation expense, net of capitalized expense of $57,990, related to stock options and warrants. During the year ended July 31, 2022, we recorded 466,948 of compensation expense, net of capitalized expense of $78,632, related to stock options and warrants. There were no stock options or warrants issued during the years ended July 31, 2023 and 2022. When applicable, we estimate the grant date fair value of stock options and warrants using the Black-Scholes pricing model.\nThe following table summarizes our options and warrant activity for the years ended July 31, 2023 and 2022:\nSUMMARY OF OPTIONS AND WARRANTS ACTIVITY\nJuly 31, 2023 July 31, 2022\nNumber of Weighted Number of Weighted\nOptions and Average Options and Average\nWarrants Exercise Price Warrants Exercise Price\nBalance at beginning of year 7,350,000 $ 1.21 7,350,000 $ 1.21\nExpired (2,500,000 ) 3.00 - -\nBalance at end of period 4,850,000 $ 0.28 7,350,000 $ 1.21\nOptions and warrants exercisable 4,566,666 $ 0.28 5,800,000 $ 1.45\nSummary of Restricted Stock Grants\nDuring the years ended July 31, 2023 and 2022, we recorded compensation expense related to restricted stock grants of $56,182 and $6,563, respectively.\nThe following table summarizes our restricted stock activity for the years ended July 31, 2023 and 2022:\nSCHEDULE OF RESTRICTED STOCK ACTIVITY\nJuly 31, 2023 July 31, 2022\nBalance at beginning of period 100,000 200,000\nGranted 2,846,093 -\nReleased (664,062 ) (100,000 )\nBalance at end of period 2,282,031 100,000\nNOTE 11 - INCOME TAXES\nA reconciliation of the provision for income taxes as reported, and the amount computed by multiplying net loss by the federal statutory rate of 21% as of July 31, 2023 and 2022 are as follows:\nSCHEDULE OF RECONCILIATION OF PROVISION FOR INCOME TAXES\nJuly 31, 2023 July 31, 2022\nFederal income tax benefit computed at the statutory rate $ (273,516 ) $ (238,994 )\nIncrease (decrease) resulting from:\nStock-based compensation 72,451 115,950\nDerivatives 24,768 31,443\nValuation allowance 176,139 91,095\nOther\nIncome tax benefit, as reported $ - $ -\nThe components of the net deferred tax asset as of July 31, 2023 and 2022 are as follows:\nSCHEDULE OF COMPONENTS OF NET DEFERRED TAX ASSET\nJuly 31, 2023 July 31, 2022\nDeferred tax assets:\nNet operating loss carryovers $ 949,990 $ 773,851\nValuation allowance (949,990 ) (773,851 )\nNet deferred tax asset, as reported $ - $ -\nIn assessing the realizable value of deferred tax assets, management considers whether it is more likely than not that some portion or all the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon generation of future taxable income during the periods in which these temporary differences become tax deductible. Based on managements assessment of objective and subjective evidence, we have concluded at this time it is more likely than not that all of our deferred tax asset will not be realized and we have provided a valuation allowance for the entire amount of the deferred tax asset. At July 31, 2023, we have approximately $4.43 million in federal and state net operating loss carryovers that begin expiring in fiscal 2037.\nWe conduct business solely in the United States and file income tax returns in the United States federal jurisdiction as well as in the states of Tennessee and Colorado. The taxable years ended July 31, 2023 through 2018 remain open to examination by the taxing jurisdictions to which we are subject.\nThe Company evaluated the provisions of ASC 740 related to the accounting for uncertainty in income taxes recognized in an enterprises financial statements. ASC 740 prescribes a comprehensive model for how a company should recognize, present, and disclose uncertain positions that the Company has taken or expects to take in its tax return. For those benefits to be recognized, a tax position must be more-likely-than-not to be sustained upon examination by taxing authorities. Differences between tax positions taken or expected to be taken in a tax return and the net benefit recognized and measured pursuant to the interpretation are referred to as unrecognized benefits. A liability is recognized (or amount of net operating loss carry forward or amount of tax refundable is reduced) for unrecognized tax benefit because it represents an enterprises potential future obligation to the taxing authority for a tax position that was not recognized as a result of applying the provisions of ASC 740.\nIf applicable, interest costs related to the unrecognized tax benefits are required to be calculated and would be classified as Other expenses - Interest expense in the consolidated statements of operations. Penalties would be recognized as a component of General and administrative.\nNo material interest or penalties on unpaid tax were recorded during the years ended July 31, 2023 and 2022. As of July 31, 2023 and 2022, no liability for unrecognized tax benefits was required to be reported. The Company does not expect any significant changes in its unrecognized tax benefits in the next year.\nNOTE 12 - COMMON STOCK\nAt July 31, 2023 and 2022, we had 68,016,167 and 42,304,673 shares of common stock outstanding, respectively. We issued 25,711,494 shares of common stock during the year ended July 31, 2023, of which 19,722,260 were issued for the payment of accrued expenses, 3,000,000 shares were issued for cash, 1,500,000 shares were issued for payment of note extension fees, 664,062 shares were issued upon the vesting of restricted stock grants, 450,000 shares were issued for services, and 375,172 shares were issued for the conversion of debt and related accrued interest. During the year ended July 31, 2022, we issued 2,186,666 shares of common stock, of which 1,250,000 shares were issued upon final settlement of a securities purchase agreement, 666,666 shares were issued pursuant to a debt settlement and amendment agreement, 170,000 shares were issued for services, and 100,000 shares were issued for the vesting of an employee stock grant.\nOn August 26, 2022, we executed a consulting agreement with G. Shayne Bench, individually, and Bucuti Investments, LLC, or assignee (Bench) to provide business advisory services in analyzing, structuring, negotiating and effecting business combinations, and serving on our Board of Directors. Pursuant to the terms of the agreement, we provided Bench a one (1) year restricted stock award of 846,093 shares, which were valued at $0.0135 on the award date. The restricted stock award vest ratably, on a monthly basis, at the end of each month of completed service. Vested common shares are issued on a quarterly basis in accordance with the Companys quarterly reporting periods. During the year ended July 31, 2023, we issued 564,062 shares of our common stock under the restricted stock award.\nOn November 1, 2022, we executed an agreement with a consultant to provide business advisory services on financings, corporate restructuring, strategic alliances and business relationships. Pursuant to the terms of the agreement, we issued 250,000 shares of our common stock to the consultant at an estimated value of $0.055 per share.\nOn January 20, 2023, we issued 120,726 shares of common stock to the holder of a $50,000 5% Convertible Promissory Note (the Note) in exchange for the Note plus accrued interest of $10,363 through the conversion date. Under the terms of the Note, the shares were issued at a conversion price of $0.50 per share.\nOn February 10, 2023, we issued 254,446 shares of common stock to the holder of a $100,000 5% Convertible Promissory Note (the Note) in exchange for the Note plus accrued interest of $27,223 through the conversion date. Under the terms of the Note, the shares were issued at a conversion price of $0.50 per share.\nOn February 28, 2023, we issued 500,000 shares of common stock to AJB Capital Investments, LLC, the holder of a promissory note, as a fee for extending the maturity date of the note. The shares were issued at an agreed upon value of $0.10 per share.\nOn May 11, 2023, we issued 500,000 shares of common stock to AJB Capital Investments, LLC, the holder of a promissory note, as a fee for extending the maturity date of the note. The shares were issued at an agreed upon value of $0.10 per share.\nOn July 16, 2023, we issued 100,000 shares of common stock to an employee upon the vesting of a portion of a restricted stock grant. The grant date fair value of the shares issued was $0.35 per share.\nOn July 31, 2023, we issued 15,002,760 shares of common stock for payment of accrued compensation due to officers of the company pursuant to their employment agreements. The shares were issued at an agreed upon value of approximately $0.107 per shares.\nOn July 31, 2023, we issued 4,719,500 shares to Platinum Equity Advisors, LLC, a related party, for payment of accrued fees due under the Non-Employee Chief Executive Officer Engagement Agreement dated May 1, 2021. The shares were issued at an agreed upon value of $0.10 per share.\nNOTE 13 - COMMON STOCK SUBSCRIBED\nOn April 30, 2021, we entered into a common stock Subscription Agreement (the SPA) with an investor. Under the terms of the SPA, the investor agreed to purchase 2,000,000 shares of our common stock at a purchase price of $0.10 per share through a series of payments. The common stock subscription was recorded as Common stock subscribed and related Stock subscriptions receivable on our consolidated balance sheets. After receipt of $125,000 from the investor, on August 13, 2021 both the Company and the investor mutually agreed to settlement of the SPA for the amounts received and the issuance of the shares at the agreed upon price per share. At July 31, 2023 and 2022, there was no stock subscriptions receivable reflected in our consolidated balance sheet.\nNOTE 14 - RELATED PARTY TRANSACTIONS\nTo continue operations and meet operating cash requirements, we have periodically relied on advances from related parties, primarily shareholders, until such time as our cash flow from operations meets our cash requirements or we are able to obtain adequate financing through sales of our equity securities and/or traditional debt financing. There is no formal written commitment for continued support by shareholders. Amounts advanced primarily relate to amounts paid to vendors. The advances are considered temporary in nature and have not been formalized by any written agreement. As of July 31, 2023 and 2022, related parties were owed $328,819 and $267,765, respectively, which are included in Accounts payable and accrued expenses, related party on the consolidated balance sheets (See Note 5 - Accounts Payable and Accrued Expenses). The amounts owed are payable on demand and carry no interest. The amounts and terms of the related party transactions may not necessarily be indicative of the amounts and terms that would have been incurred had comparable transactions been entered into with independent third parties.\nEffective May 1, 2021, we entered into a Non-Employee Chief Executive Officer Engagement Agreement (the Contract CEO Agreement) with Platinum Equity Advisors, LLC, a related party, to provide the services of our CEO and Chairman of the Board of Directors. Under the terms of the Contract CEO Agreement, Platinum Equity Advisors, LLC was owed $225,000 and $373,500 at July 31, 2023 and 2022, respectively. The amount owed is included in Accounts payable and accrued expenses, related party on the consolidated balance sheets (See Note 5 - Accounts Payable and Accrued Expenses).\nOn June 12, 2023, we issued a Promissory Note to Platinum Equity Advisors, LLC in the principal amount of $372,069. The note, plus accrued interest, is due on December 12, 2023. At July 31, 2023, accrued but unpaid interest on the note was $5,064 (See Note 5 - Accounts Payable and Accrued Expenses and Note 7 - Notes Payable, Related Party). The amount and terms of the related party loan may not necessarily be indicative of the amount and terms that would have been incurred had comparable transactions been entered into with independent third parties.\nNOTE 15 - COMMITMENTS AND CONTINGENCIES\nEmployment and Consulting Agreements\nEffective May 1, 2021, we entered into a Non-Employee Chief Executive Officer Engagement Agreement (the Contract CEO Agreement) with Platinum Equity Advisors, LLC (Platinum) to provide the services of Scott M. Boruff as Chief Executive Officer and Chairman of the Board of Directors of the Company for a term of three (3) years. As compensation for the services, the Company shall pay Platinum an annual base fee of $323,400. If the Contract CEO Agreement is terminated by us without cause or by Platinum for good reason, we are obligated to pay Platinum severance equal to one (1) years base fee and any other earned but unpaid compensation. In addition, if at any time during the term of the Contract CEO Agreement Platinum is terminated by us without cause within two years after a Change in Control of our company, or in the 90 days prior the Change in Control at the request of the acquiror, we are obligated to pay Platinum an amount equal to 2.99 times the annual base fee. Change in Control is defined in the Contract CEO Agreement to mean the acquisition by any person of beneficial ownership of our securities representing greater than 50% of the combined voting power of our then outstanding voting securities. Platinum is eligible for equity awards as approved by the Board of Directors as defined in the agreement.\nOn September 1, 2020, in connection with the appointment of Susan A. Reyes, M.D. as Chief Medical Officer of the Company, the Company and Dr. Reyes entered into an employment agreement (the Reyes Employment Agreement) with an initial term of three (3) years. As compensation for her services, the Company shall pay Dr. Reyes an annual base salary of $52,000. The base salary shall be accrued until the Company obtains funding of at least $1,000,000, or has reported $10,000,000 in revenue, whichever occurs first. In the event Dr. Reyes employment with the Company is terminated without cause, Dr. Reyes shall be entitled to a severance payment equal to her base salary for one (1) full year. If Dr. Reyes is terminated without cause within two (2) years of a change in control upon request of the acquiror, Dr. Reyes shall be entitled to a severance payment in an amount equal to 2.99 times the annualized base salary she is then earning. In addition, Dr. Reyes is eligible for equity awards as approved by the Board of Directors as defined in the agreement.\nOn June 15, 2020, in connection with the appointment of Kenneth M. Greenwood as Chief Technology Officer of the Company, the Company and Mr. Greenwood entered into an employment agreement (the Greenwood Employment Agreement) with an initial term of three (3) years. As compensation for his services, the Company shall pay Mr. Greenwood an annual base salary of $257,000. The base salary shall be accrued until the Company obtains funding of $1,000,000 in excess of funding used for inventory purchases, or has $1,000,000 in revenue, whichever occurs first. In the event Mr. Greenwoods employment with the Company is terminated without cause, Mr. Greenwood shall be entitled to a severance payment equal to his base salary for one (1) full year. If Mr. Greenwood is terminated without cause within two (2) years of a change in control upon request of the acquiror, Mr. Greenwood shall be entitled to a severance payment in an amount equal to 2.99 times the annualized base salary he is then earning. In addition, Mr. Greenwood is eligible for equity awards as approved by the Board of Directors as defined in the agreement. The initial term of the Greenwood Employment Agreement expired on June 15, 2023 and automatically renewed for one year.\nOn October 8, 2019, in connection with the appointment of Charles B. Lobetti, III as Chief Financial Officer of the Company, the Company and Mr. Lobetti entered into an employment agreement (the Lobetti Employment Agreement) with an initial term of three (3) years. Pursuant to a modification of the Lobetti Employment Agreement effective May 1, 2020, the Company shall pay Mr. Lobetti an annual base salary of $104,000 per year as compensation for his services. In the event Mr. Lobettis employment with the Company is terminated without cause, Mr. Lobetti shall be entitled to a severance payment equal to his base salary for one (1) full year. If Mr. Lobetti is terminated without cause within two (2) years of a change in control upon request of the acquiror, Mr. Lobetti shall be entitled to a severance payment in an amount equal to 2.99 times the annualized base salary he is then earning. In addition, Mr. Lobetti is eligible for equity awards as approved by the Board of Directors as defined in the agreement. The initial term of the Lobetti Employment Agreement expired on October 8, 2022 and automatically renewed for one year.\nLitigation\nFrom time to time, the Company may become involved in litigation relating to claims arising in the ordinary course of the business. There are no claims or actions pending or threatened against the Company that, if adversely determined, would in the Companys managements judgment have a material adverse effect on the Company.\nNOTE 16 - SUBSEQUENT EVENTS\nOn September 1, 2023 we received a legal notice of default and demand for payment (the Demand Notice) under an alleged written Payment Guarantee (the Guaranty) related to a Business Loan and Security Agreement dated September 15, 2022 between a lender we have no relationship with and a related party borrower. The legal notice is addressed to us under our former name(s) and to one or both of our inactive subsidiaries. At this time, the facts surrounding the applicability of the Demand Notice and Guaranty to us and/or our subsidiaries is ambiguous. We are currently investigating the circumstances of the Demand Notice and will review and consider applicable accounting standards for recording and disclosure if a lawsuit is ultimately filed against the Company or its subsidiaries.\nWe evaluate subsequent events and transactions that occur after the balance sheet date for the period presented and up to the issuance date of the financial statements. Based on our review, we did not identify any subsequent events other than those listed above that would require adjustment to or disclosure in the consolidated financial statements."
}