{
    "cik": "1591565",
    "company": "BALLY, CORP.",
    "filing_type": "10-K",
    "filing_date": "2023-12-22",
    "period_of_report": "2023-09-30",
    "sic": "5200",
    "state_of_inc": "NV",
    "state_location": "F4",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1591565/0001640334-23-002346-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1591565/000164033423002346/blyq_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1591565/0001640334-23-002346.txt",
    "filename": "1591565_10K_2023_0001640334-23-002346.htm",
    "content": "ITEM 1. BUSINESS\nGeneral Overview\nWe were incorporated under the laws of the State of Nevada on March 13, 2013. From inception, it was our intent to import small farming, household gardening and general small tools directly from manufacturers and market to consumers in the Republic of India. Management of our company is currently evaluating our future strategic business plans.\nOn June 24, 2016, Katiuska Moran our former CEO and Director and Surjeet Singh, our former secretary and a substantial shareholder cancelled any and all loans they made to our company.\nOn June 24, 2016, in connection with the sale of a controlling interest our company, Katiuska Moran our former CEO and Director and Surjeet Singh (individually and collectively the Seller(s)) our company, entered into and closed on certain Share Purchase Agreements (the Agreements) with Aureas Capital Co., Ltd., whereby Aureas purchased from the Sellers a total of 6,918,800 shares of our companys common stock (the Shares) for an aggregate price of $100,000.00. The Shares acquired represented approximately 70.6% of the issued and outstanding shares of common stock of our company.\nConcurrently with the closing of the Agreements, Ming Chun Lung was appointed a director, Chief Executive Officer, President and Secretary and Katiuska Moran and Surjeet Singh resigned from all positions held as an officer and director of our company.\nOn June 8, 2017, Ming Chun Lung resigned as Chief Executive Officer, President, Secretary, and as a director of our company and Kong Nguan Hong was appointed Chief Executive Officer, President, Secretary, Chief Financial Officer, Treasurer, and as a director.\nPursuant to a stock purchase agreement (the Agreement), effective as of April 4, 2018, by and among Aureas Capital Co Ltd, Chen Yi-Dou, Ming-Chun Lung, NYJJ Investments, Ti-Jung Chen, Yi-Fang Lin and Zhiqing Wu (together, the Sellers) and Haiping Hu (the Purchaser), the Sellers sold an aggregate of 9,797,600 shares of Common Stock of our company, to the Purchaser for cash consideration of $360,000 from personal funds of the Purchaser (the Transaction). Of the net proceeds, $7,500 have been held back in escrow for the payment of past due taxes. Following consummation of the Transaction on April 4, 2018, the Purchaser holds 99.5% of the voting securities of our company, based on 9,850,000 shares issued and outstanding as at that date. The Transaction resulted in a change in control of our Company.\nIn connection with the Transaction, Kong Nguan Hong, the sole officer and director of the Company, resigned from all of his officer positions with our company, including Chief Executive Officer, Chief Financial Officer and Secretary, effective immediately upon the consummation of the Transaction, and remained a director of our company until April 16, 2018, which date was ten (10) days following the date on which our company filed a Schedule 14F-1 with the SEC and mailed same to the holders of record of our company, in connection with the Transaction.\nOur address is 986 Dongfang Rd., One Hundred Shanshan Bldg 25th Fl, Pudong, Shanghai, China 200122. Our telephone number is +86 136 1833 3008.\nWe do not have any subsidiaries. We do not have a corporate website.\nWe have not ever declared bankruptcy, been in receivership, or involved in any kind of legal proceeding.\nOur Current Business\nWe are currently seeking new business opportunities with established business entities for merger with or acquisition of a target business. In certain instances, a target business may wish to become our subsidiary or may wish to contribute assets to us rather than merge. We have not yet entered into any definitive agreements for potential new business opportunities, and there can be no assurance that we will be able to enter into any definitive agreements.\nAny new acquisition or business opportunities that we may acquire will require additional financing. There can be no assurance, however, that we will be able to acquire the financing necessary to enable us to pursue our plan of operation. If our company requires additional financing and we are unable to acquire such funds, our business may fail.\nManagement of our company believes that there are benefits to being a reporting company with a class of securities quoted on the OTC Markets, such as: (i) the ability to use registered securities to acquire assets or businesses; (ii) increased visibility in the financial community; (iii) the facilitation of borrowing from financial institutions; (iv) potentially improved trading efficiency; (v) potential stockholder liquidity; (vi) potentially greater ease in raising capital subsequent to an acquisition; (vii) potential compensation of key employees through stock awards or options; (viii) potentially enhanced corporate image; and (ix) a presence in the United States capital market.\nWe may seek a business opportunity with entities that have recently commenced operations, or entities who wish to utilize the public marketplace in order to raise additional capital in order to expand business development activities, to develop a new product or service, or for other corporate purposes. We may acquire assets and establish wholly owned subsidiaries in various businesses or acquire existing businesses as subsidiaries.\nIn implementing a structure for a particular business acquisition or opportunity, we may become a party to a merger, consolidation, reorganization, joint venture, or licensing agreement with another corporation or entity. We may also acquire stock or assets of an existing business.\nAs of the date hereof, we have not entered into any formal written agreements for a business combination or opportunity. When any such agreement is reached, we intend to disclose such an agreement by filing a current report on Form 8-K.\nWe anticipate that the selection of a business opportunity in which to participate will be complex and without certainty of success. Business opportunities may be available in many different industries and at various stages of development, all of which will make the task of comparative investigation and analysis of such business opportunities extremely difficult and complex. Business opportunities that we believe are in the best interests of our company may be scarce, or we may be unable to obtain the ones that we want. We can provide no assurance that we will be able to locate compatible business opportunities.\nCurrently, we do not have a source of revenue. We are not able to fund our cash requirements through our current operations. We have been reliant on loans by affiliated and non-affiliated parties to provide financial contributions and services to keep our company operating. Further, we believe that our company may have difficulties raising capital from other sources until we locate a prospective merger candidate through which we can pursue our plan of operation. If we are unable to secure adequate capital to continue our acquisition efforts, our shareholders may lose some or all of their investment and our business may fail. We currently have no written or oral agreement from our majority shareholder to continue to provide financial contributions.\nResearch and Development\nWe have incurred $ Nil in research and development expenditures over the last two fiscal years.\nIntellectual Property\nWe do not currently have any intellectual property.\nEmployees\nOur company has no employees. Our sole director and officer is donating his time to the development of our company, and intends to do whatever work is necessary to bring us to the point of earning revenues. We estimate that our sole officer and director will be able to complete his required work and complete whatever work is necessary by spending 20 hours per week without lending our company additional funds. If this is not the case and additional time and funds will be required, then he is willing to commit additional time and funds although he has no commitment or contractual obligation to do so. We have no other employees, and do not foresee hiring any additional employees in the near future. We will be engaging independent contractors to design and develop our website and manage our internet marketing efforts. ITEM 1A. RISK FACTORS\nAs a smaller reporting company, we are not required to provide the information required by this Item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot Applicable. ITEM 2. PROPERTIES\nOur principal executive is currently located at 986 Dongfang Rd., One Hundred Shanshan Bldg 25th Fl, Pudong, Shanghai, China 200122. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in litigation relating to claims arising out of our operations in the normal course of business. We are not involved in any pending legal proceeding or litigation, and to the best of our knowledge, no governmental authority is contemplating any proceeding to which we are a party and which would reasonably be likely to have a material adverse effect on our company. To date, our company has never been involved in litigation, as either a party or a witness, nor has our company been involved in any legal proceedings commenced by any regulatory agency against our company. ITEM 4. MINE SAFETY DISCLOSURES\nNot Applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is quoted on the OTC Markets, under the symbol BLYQ. Our stock was approved for quotation on the OTC Markets on November 20, 2014. However, our stock only started trading on October 22, 2018.\nThere is no established current public market for the shares of our common stock. There can be no assurance that a liquid market for our securities will ever develop. Transfer of our common stock may also be restricted under the securities or blue-sky laws of various states and foreign jurisdictions. Consequently, investors may not be able to liquidate their investments and should be prepared to hold the common stock for an indefinite period of time.\nOur shares are issued in registered form. Globex Transfer, LLC, 780 Deltona Blvd., Suite 202, Deltona, FL 32725 (Telephone: (813) 34-4490) is the registrar and transfer agent for our common shares.\nOn December 22, 2023, the shareholders list showed 27 registered shareholders with 9,850,000 shares of common stock outstanding.\nDividend Policy\nWe have not paid any cash dividends on our common stock and have no present intention of paying any dividends on the shares of our common stock. Our current policy is to retain earnings, if any, for use in our operations and in the development of our business. Our future dividend policy will be determined from time to time by our board of directors.\nEquity Compensation Plan Information\nWe do not have any equity compensation plans.\nRecent Sales of unregistered securities\nWe did not sell any equity securities which were not registered under the Securities Act during the year ended September 30, 2023 that were not otherwise disclosed on our quarterly reports on Form 10-Q or our current reports on Form 8-K filed during the year ended September 30, 2023.\nIssuer Purchases of Equity Securities\nWe did not purchase any of our shares of common stock or other securities during the fiscal year ended September 30, 2023. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with our financial statements, including the notes thereto, appearing elsewhere in this annual report. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to such differences include but are not limited to those discussed below and elsewhere in this Annual Report. Our audited financial statements are stated in United States Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles.\nResults of Operations\nYears ended September 30, 2023 and 2022\nThe following summary of our results of operations should be read in conjunction with our financial statements for the years ended September 30, 2023 and 2022, which are included herein.\nOur operating results for the years ended September 30, 2023 and 2022, and the changes between those years for the respective items are summarized as follows:\nYears Ended\nSeptember 30,\nChange\nRevenue\n$ -\n$ -\n$ -\nGeneral and administrative\n35,385\n48,115\n(12,730 )\nNet loss\n$ 35,385\n$ 48,115\n$ (12,730 )\nDuring the years ended September 30, 2023 and 2022, we did not have any revenues.\nOur financial statements report a net loss of $35,385 for the year ended September 30, 2023, compared to a net loss of $48,115 for the year ended September 30, 2022, solely from operating expenses. Operating expenses consist of professional fees of $34,200 and $47,162, and other general and administrative expenses of $1,185 and $953 for the years ended September 30, 2023 and 2022, respectively.\nLiquidity and Capital Resources\nThe following table provides selected financial data about our company as of September 30, 2023 and 2022, respectively.\nWorking Capital\nSeptember 30,\nSeptember 30,\nChanges\nCurrent Assets\n$ 6,750\n$ 750\n$ 6,000\nCurrent Liabilities\n184,082\n142,697\n41,385\nWorking Capital Deficiency\n$ 177,332\n$ 141,947\n$ 35,385\nAs of September 30, 2023 and 2022, our total current assets were $6,750 and $750, respectively, which were all attributed to prepaid expenses.\nAs of September 30, 2023, our current liabilities were $184,082 compared to $142,697 at September 30, 2022. Stockholders deficit was $177,332 as of September 30, 2023 compared to stockholders deficit of $141,947 as of September 30, 2022. The increase in current liabilities is primarily due to an increase in due to shareholder (who is also the Companys sole officer) for payments made for operating expenses on behalf of the Company.\nCash Flows\nYears Ended\nSeptember 30,\nNet cash used in operating activities\n$ -\n$ -\nNet cash used in investing activities\n-\n-\nNet cash provided by financing activities\n-\n-\nNet change in cash\n$ -\n$ -\nOperating Activities\nThe Company did not use any funds for operating activities during the years ended September 30, 2023 and 2022. During the years ended September 30, 2023 and 2022, the Companys shareholder and sole officer paid $40,997 and $48,653, respectively, on behalf of the Company for operating expenses.\nInvesting Activities\nThe Company did not use any funds for investing activities during the years ended September 30, 2023 and 2022.\nFinancing Activities\nThe Company did not have any funds provided by financing activities during the years ended September 30, 2023 and 2022.\nLimited Operating History; Need for Additional Capital\nThere is no historical financial information about us on which to base an evaluation of our performance. We have generated no revenues from operations. We cannot guarantee we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources, possible delays in developing our website, and possible cost overruns due to the price and cost increases in supplies and services.\nAt present, we do not have enough cash on hand to cover operating costs for the next 12 months.\nIf we are unable to meet our needs for cash from either our operations, or possible alternative sources, then we may be unable to continue, develop, or expand our operations.\nWe have no plans to undertake any product research and development during the next twelve months. There are also no plans or expectations to acquire or sell any plant or plant equipment in the next year of operations.\nLiquidity and Capital Resources\nAs of September 30, 2023, we had no cash, and our current assets were $6,750. As of September 30, 2023, our current liabilities were $184,082, and our stockholders deficit was $177,332. We do not have sufficient funds to operate it for the next twelve months. We have to issue debt or equity or enter into a strategic arrangement with a third party in order to finance our operations. There can be no assurance that additional capital will be available to us. We currently have no agreements, arrangements or understandings with any person to obtain funds through bank loans, lines of credit or any other sources.\nContractual Obligations\nAs a smaller reporting company, we are not required to provide tabular disclosure obligations.\nGoing Concern\nFor the year ended September 30, 2023, our company had a net loss of $35,385 and has earned no revenues. In addition, the Company had a working capital deficiency of $177,332 and an accumulated deficit of $356,712 at September 30, 2023. These factors, among others, raise substantial doubt about our companys ability to continue as a going concern. The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nThe continuing operations of the Company are dependent upon its ability to continue to raise adequate financing, shareholder loans and to commence profitable operations in the future and repay its liabilities arising from normal business operations as they become due. Our only source of cash at this time is investment by our shareholder who is also sole director and officer. We must raise cash to stay in business. Our company intends to fund operations through equity financing arrangements, which may be insufficient to fund our capital expenditures, working capital and other cash requirements for the year ending September 30, 2024. The ability of our company to emerge from the development stage is dependent upon, among other things, obtaining additional financing to continue operations, and development of our business plan. We have no assurance that future financing will be available to us on acceptable terms. If financing is not available on satisfactory terms, we may be unable to continue, develop or expand our operations. Equity financing could result in additional dilution to existing shareholders.\nCritical Accounting Policies\nThe discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with the accounting principles generally accepted in the United States of America. Preparing financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, and expenses. These estimates and assumptions are affected by managements application of accounting policies. We believe there are no material estimates or assumptions with levels of subjectivity and judgement necessary to be considered critical accounting policies.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to stockholders. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a smaller reporting company, we are not required to provide the information required by this Item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nBALLY, CORP.\nINDEX TO AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND 2022\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID 273)\nBalance Sheets as of September 30, 2023 and 2022\nStatements of Operations for the years ended September 30, 2023 and 2022\nStatements of Stockholders Deficit for the years ended September 30, 2023 and 2022\nStatements of Cash Flows for the years ended September 30, 2023 and 2022\nNotes to the Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of\nBally, Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Bally, Corp. (the Company) as of September 30, 2023 and 2022, and the related statements of operations, stockholders deficit, and cash flows for the years ended September 30, 2023 and 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for the years ended September 30, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As disclosed in Note 3 to the financial statements, the Company has not generated any revenues since inception. The Company had a net loss of $35,385 for the year ended September 30, 2023, a working capital deficiency of $177,332 and an accumulated deficit of $356,712 as of September 30, 2023. These factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. Managements plans regarding these matters are disclosed in Note 3 to the financial statements. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters for current period.\n/s/ Prager Metis CPAs, LLC\nWe have served as the Companys auditor since 2018\nHackensack, New Jersey\nDecember 22, 2023\nBALLY, CORP.\nBalance Sheets\nSeptember 30,\nSeptember 30,\nASSETS\nCurrent assets:\nCash\n$ -\n$ -\nPrepaid expenses\n6,750\nTotal Current Assets\n6,750\nTotal Assets\n$ 6,750\n$ 750\nLIABILITIES AND STOCKHOLDERS DEFICIT\nLiabilities:\nCurrent liabilities:\nAccounts payable\n$ 1,589\n$ 1,201\nDue to shareholder\n182,493\n141,496\nTotal Current Liabilities and Total Liabilities\n184,082\n142,697\nStockholders Deficit:\nPreferred stock, $0.0001 par value, 20,000,000 shares authorized, 0 shares issued and outstanding\n-\n-\nCommon stock, $0.0001 par value, 100,000,000 shares authorized, 9,850,000 shares issued and outstanding\nAdditional paid-in capital\n178,395\n178,395\nAccumulated deficit\n(356,712 )\n(321,327 )\nTotal Stockholders Deficit\n(177,332 )\n(141,947 )\nTotal Liabilities and Stockholders Deficit\n$ 6,750\n$ 750\nThe accompanying notes are an integral part of these audited financial statements.\nBALLY, CORP.\nStatements of Operations\nYears Ended\nSeptember 30,\nRevenue\n$ -\n$ -\nExpenses:\nGeneral and administrative\n35,385\n48,115\nTotal expenses\n35,385\n48,115\nLoss before income tax provision\n(35,385 )\n(48,115 )\nIncome tax provision\n-\n-\nNet loss\n$ (35,385 )\n$ (48,115 )\nBasic and Diluted Loss per Common Share\n$ (0.00 )\n$ (0.00 )\nBasic and Diluted Weighted Average Number of Common Shares Outstanding\n9,850,000\n9,850,000\nThe accompanying notes are an integral part of these audited financial statements.\nBALLY, CORP.\nStatements of Stockholders Deficit\nFor the Years Ended September 30, 2023 and 2022\nAdditional\nTotal\nPreferred Stock\nCommon Shares\nPaid-In\nAccumulated\nStockholders\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nDeficit\nBalance - September 30, 2021\n-\n$ -\n9,850,000\n$ 985\n$ 178,395\n$ (273,212 )\n$ (93,832 )\nNet loss for the year\n-\n-\n-\n-\n-\n(48,115 )\n(48,115 )\nBalance - September 30, 2022\n-\n-\n9,850,000\n178,395\n(321,327 )\n(141,947 )\nNet loss for the year\n-\n-\n-\n-\n-\n(35,385 )\n(35,385 )\nBalance - September 30, 2023\n-\n$ -\n9,850,000\n$ 985\n$ 178,395\n$ (356,712 )\n$ (177,332 )\nThe accompanying notes are an integral part of these audited financial statements.\nBALLY, CORP.\nStatements of Cash Flows\nYears Ended\nSeptember 30,\nCash Flows from Operating Activities:\nNet loss\n$ (35,385 )\n$ (48,115 )\nChanges in operating assets and liabilities:\nPrepaid expenses\n(6,000 )\n(750 )\nShareholder advances funding operations\n40,997\n48,653\nAccounts payable\nNet Cash used in Operating Activities\n-\n-\nNet change in cash\n-\n-\nCash - beginning of year\n-\n-\nCash - end of year\n$ -\n$ -\nSupplemental Cash Flow Disclosure:\nInterest paid\n$ -\n$ -\nIncome taxes paid\n$ -\n$ -\nThe accompanying notes are an integral part of these audited financial statements.\nBALLY, CORP\nNotes to the Financial Statements\nFor the Years Ended September 30, 2023 and 2022\nNOTE 1 - ORGANIZATION AND DESCRIPTION OF BUSINESS\nBALLY, CORP. (the Company) was incorporated in the State of Nevada on March 13,2013 and it is based in Shanghai. The Company is currently seeking new business opportunities with established business entities for merger with or acquisition of a target business. To date, the Companys activities have been limited to its formation and the raising of equity capital. The Companys fiscal year end is September 30.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe Financial Statements and related disclosures have been prepared pursuant to the rules and regulations of the Securities and Exchange Commission (SEC). The Financial Statements have been prepared using the accrual basis of accounting in accordance with Generally Accepted Accounting Principles (GAAP) of the United States.\nUse of estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amount of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nCash and cash equivalents include cash in banks, money market funds, and certificates of term deposits with maturities of less than three months from inception, which are readily convertible to known amounts of cash and which, in the opinion of management, are subject to an insignificant risk of loss in value.\nFinancial Instruments\nThe Company follows ASC 820, Fair Value Measurements and Disclosures, which defines fair value as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. ASC 820 also establishes a fair value hierarchy that distinguishes between (1) market participant assumptions developed based on market data obtained from independent sources (observable inputs) and (2) an entitys own assumptions about market participant assumptions developed based on the best information available in the circumstances (unobservable inputs). The fair value hierarchy consists of three broad levels, which gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1) and the lowest priority to unobservable inputs (Level 3).\nThe three levels of the fair value hierarchy are described below:\nLevel 1\nLevel 1 applies to assets or liabilities for which there are quoted prices in active markets for identical assets or liabilities.\nLevel 2\nLevel 2 applies to assets or liabilities for which there are inputs other than quoted prices that are observable for the asset or liability such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical assets or liabilities in markets with insufficient volume or infrequent transactions (less active markets); or model-derived valuations in which significant inputs are observable or can be derived principally from, or corroborated by, observable market data.\nLevel 3\nLevel 3 applies to assets or liabilities for which there are unobservable inputs to the valuation methodology that are significant to the measurement of the fair value of the assets or liabilities.\nThe fair value of prepaid expenses, accounts payable and accrued expenses and due to shareholder approximates their carrying amounts because of their immediate or short-term maturity.\nDetermining which category an asset or liability falls within the hierarchy requires significant judgment. The Company evaluates its hierarchy disclosures each quarter. There are no financial instruments measured at fair value on a recurring basis.\nConcentrations of Credit Risks\nThe Companys financial instruments that are exposed to concentrations of credit risk primarily consist of its cash and related party payables it will likely incur in the near future. The Company places its cash and cash equivalents with financial institutions of high credit worthiness. At times, its cash with a particular financial institution may exceed any applicable government insurance limits. The Companys management plans to assess the financial strength and credit worthiness of any parties to which it extends funds, and as such, it believes that any associated credit risk exposures are limited.\nIncome Taxes\nThe Company accounts for income taxes using the asset and liability method in accordance with ASC 740, Accounting for Income Taxes. The asset and liability method provides that deferred tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax bases of assets and liabilities and for operating loss and tax credit carry forwards. Deferred tax assets and liabilities are measured using the currently enacted tax rates and laws that will be in effect when the differences are expected to reverse. The Company records a valuation allowance to reduce deferred tax assets to the amount that is believed more likely than not to be realized.\nAs of September 30, 2023, and 2022, the Company did not have any amounts recorded pertaining to uncertain tax positions.\nLoss per Share\nThe Company has adopted ASC 260, Earnings Per Share, (EPS) which requires presentation of basic and diluted EPS on the face of the income statement for all entities with complex capital structures and requires a reconciliation of the numerator and denominator of the basic EPS computation to the numerator and denominator of the diluted EPS computation. In the accompanying financial statements, basic loss per share is computed by dividing net loss by the weighted average number of shares of common stock outstanding during the year.\nThe Company has no potentially dilutive securities, such as options or warrants, currently issued and outstanding, as of September 30, 2023 and 2022.\nRelated Party Balances and Transactions\nThe Company follows FASB ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions and balances. See Note 6 for additional information.\nRecent Accounting Pronouncements\nManagement has considered all recent accounting pronouncements issued since the last audit of its financial statements. The Companys management believes that these recent pronouncements will not have a material effect on the Companys financial statements.\nNOTE 3 - GOING CONCERN\nThe accompanying financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. The Company has not generated any revenues since inception. The Company had a net loss of $35,385 for the year ended September 30, 2023, a working capital deficiency of $177,332 and an accumulated deficit of $356,712 as of September 30, 2023. These factors, among others, raise substantial doubt about the Companys ability to continue as a going concern for a reasonable period of time. The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nThe continuing operations of the Company are dependent upon its ability to continue to raise adequate financing, shareholder loans and to commence profitable operations in the future and repay its liabilities arising from normal business operations as they become due. The Company intends to fund operations through equity financing arrangements, which may be insufficient to fund its capital expenditures, working capital and other cash requirements for future periods. We have no assurance that future financing will be available to us on acceptable terms. If financing is not available on satisfactory terms, we may be unable to continue, develop or expand our operations. Equity financing could result in additional dilution to existing shareholders.\nNOTE 4 - PREPAID EXPENSES\nAs of September 30, 2023, prepaid expenses included (i) the portion of unamortized annual quotation fee for the OTC Markets Group and (ii) advanced professional fees for maintaining reporting status with the Securities and Exchange Commission (SEC).\nNOTE 5 - INCOME TAXES\nThe Company follows ASC 740. Deferred income taxes reflect the net effect of (a) temporary difference between carrying amounts of assets and liabilities for financial purposes and the amounts used for income tax reporting purposes, and (b) net operating loss carryforwards. No net provision for refundable Federal income tax has been made in the accompanying statements of operations because no recoverable taxes were paid previously. Similarly, no deferred tax asset attributable to the net operating loss carryforwards has been recognized, as it is not deemed likely to be realized.\nThe provisions for federal income tax consist of the following:\nYears Ended\nSeptember 30,\nIncome tax expense (benefit) at statutory rate (21%)\n$ (7,431 )\n$ (10,104 )\nChange in valuation allowance\n7,431\n10,104\nIncome tax expense\n$ -\n$ -\nThe tax effects of temporary differences that give rise to the Companys net deferred tax assets are as follows:\nSeptember 30,\nSeptember 30,\nNet Operating Loss carryforward\n$ 37,051\n$ 29,620\nValuation allowance\n(37,051 )\n(29,620 )\nNet deferred tax asset\n$ -\n$ -\nAs of September 30, 2023, the Company had approximately $176,432 of net operating losses (NOL), generated from April 4, 2018 to September 30, 2023, carried forward to offset taxable income in future years. NOLs generated in tax years prior to September 30, 2018, can be carryforward for twenty years, whereas NOLs generated after September 30, 2018 can be carryforward indefinitely.\nDue to a change of control, the Company will not be able to carryover $180,280 of NOL generated before April 4, 2018 to offset future income.\nA valuation allowance has been established for our deferred tax assets as their use is dependent on the generation of sufficient future taxable income, which cannot be predicted at this time. As of September 30, 2023, we had no material unrecognized tax benefits and no adjustments to liabilities or operations were required. No interest and penalties have been recognized by us to date. Our net operating loss carryforwards are subject to review and possible adjustment by the Internal Revenue Service and are subject to certain limitations in the event of cumulative changes in the ownership interest of significant stockholders over a three-year period in excess of 50%.\nNOTE 6 - RELATED PARTY TRANSACTIONS AND BALANCES\nIn support of the Companys efforts and cash requirements, it may rely on advances from related parties until such a time that the Company can support its operations or attain adequate financing through sales of its equity or traditional debt financing. There is no formal written commitment for continued support by shareholders or directors. Shareholders amounts represent advances or amounts paid on behalf of the Company in satisfaction of liabilities. The advances were considered temporary in nature and were not formalized by a promissory note.\nDuring the years ended September 30, 2023 and 2022, the Companys shareholder and sole officer advanced to the Company an amount of $40,997 and $48,653 respectively by paying for expenses on behalf of the Company.\nAs of September 30, 2023 and 2022, the Company was obligated to the shareholder and sole officer for a balance of $182,493 and $141,496, respectively, which is unsecured, non-interest-bearing and due on demand.\nNOTE 7 - EQUITY\nPreferred Stock\nThe Company has 20,000,000 authorized preferred shares with a par value of $0.0001 per share.\nThere were no shares of preferred stock issued and outstanding as of September 30, 2023 and 2022.\nCommon Stock\nThe Company has 100,000,000 authorized common shares with a par value of $0.0001 per share.\nAs of September 30, 2023 and 2022, there were 9,850,000 shares of common stock issued and outstanding, respectively.\nNOTE 8 - SUBSEQUENT EVENTS\nThe Company has evaluated the existence of events and transactions subsequent to the balance sheet date through the date the financial statements were issued and has determined that there were no significant subsequent events or transactions that would require recognition or disclosure in the financial statements. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nThere were no disagreements related to accounting principles or practices, financial statement disclosure, internal controls or auditing scope or procedure during the two fiscal years and interim periods. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act that are designed to ensure that information required to be disclosed by us in reports that we file under the Exchange Act is recorded, processed, summarized and reported as specified in the SECs rules and forms and that such information required to be disclosed by us in reports that we file under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure. Management, with the participation of our Chief Executive Officer and Chief Financial Officer, performed an evaluation of the effectiveness of our disclosure controls and procedures as of September 30, 2023. Based on that evaluation, our management, including our Chief Executive Officer and Chief Financial Officer, concluded that our disclosure controls and procedures were not effective as of September 30, 2023 due to the material weaknesses discussed below.\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for the preparation of our financial statements and related information. Management uses its best judgment to ensure that the financial statements present fairly, in material respects, our financial position and results of operations in conformity with generally accepted accounting principles.\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as defined in the Exchange Act. These internal controls are designed to provide reasonable assurance that the reported financial information is presented fairly, that disclosures are adequate and that the judgments inherent in the preparation of financial statements are reasonable. There are inherent limitations in the effectiveness of any system of internal controls including the possibility of human error and overriding of controls. Consequently, an ineffective internal control system can only provide reasonable, not absolute, assurance with respect to reporting financial information.\nOur internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that, in reasonable detail, accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements in accordance with generally accepted accounting principles and that the receipts and expenditures of company assets are made in accordance with our management and directors authorization; and (iii) provide reasonable assurance regarding the prevention of or timely detection of unauthorized acquisition, use or disposition of assets that could have a material effect on our financial statements.\nUnder the supervision of management, including our Chief Executive Officer and our Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and subsequent guidance prepared by the Commission specifically for smaller public companies as of September 30, 2023. Based on that evaluation, our management concluded that our internal control over financial reporting was not effective as of September 30, 2023 because it identified the following material weakness:\n●\nMaterial Weakness - The Company did not maintain effective controls over certain aspects of the financial reporting process because we lacked a sufficient complement of personnel with a level of accounting expertise and an adequate supervisory review structure that is commensurate with our financial reporting requirements, nor allowed for adequate segregation of duties.\nA material weakness is a deficiency or a combination of deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the annual or interim consolidated financial statements will not be prevented or detected on a timely basis.\nWe expect to be materially dependent upon third parties to provide us with accounting consulting services for the foreseeable future which we believe mitigates the impact of the material weaknesses discussed above. Until such time as we have a chief financial officer with the requisite expertise in U.S. GAAP and establish an audit committee and implement internal controls and procedures, there are no assurances that the material weaknesses and significant deficiencies in our disclosure controls and procedures will not result in errors in our financial statements which could lead to a restatement of those financial statements.\nOur management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal controls will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our company have been detected.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the companys registered public accounting firm pursuant to SEC rules that permit us to provide only managements report on internal control over financial reporting in this annual report on Form 10-K.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal controls over financial reporting that occurred during the fiscal year ended September 30, 2023 that have materially or are reasonably likely to materially affect, our internal controls over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nAll directors of our company hold office until the next annual meeting of the security holders or until their successors have been elected and qualified. The officers of our company are appointed by our board of directors and hold office until their death, resignation or removal from office. Our directors and executive officers, their ages, positions held, and duration as such, are as follows:\nName\nPosition Held with the Company\nAge\nDate First Elected or Appointed\nHaiping Hu\nChief Executive Officer, Chief Financial Officer,\nSecretary and Director\nApril 4, 2018\nBusiness Experience\nThe following is a brief account of the education and business experience during at least the past five years of each director, executive officer and key employee of our company, indicating the persons principal occupation during that period, and the name and principal business of the organization in which such occupation and employment were carried out.\nHaiping Hu - Chief Executive Officer, Chief Financial Officer, Secretary and director.\nMr. Hu has been serving as president of Global Mentor Board (Beijing) IT Co. Ltd since 2015. In addition, from 2012 until 2015, Mr. Hu served as the president and CEO of Shanshan Commodities Group Corporation. Mr. Hu obtained his bachelors degree in process automation and his masters degree in chemical engineering from Zhejiang University.\nOur company believes that Mr. Hus professional background experience gives him the qualifications and skills necessary to serve as a director of our company.\nTerm of Office\nOur directors are appointed for a one-year term to hold office until the next annual general meeting of our stockholders or until removed from office in accordance with our bylaws. Our officers are appointed by our board of directors and hold office until removed by the board.\nAll officers and directors listed above will remain in office until the next annual meeting of our stockholders, and until their successors have been duly elected and qualified. There are no agreements with respect to the election of directors. We have not compensated our directors for service on our Board of Directors, any committee thereof, or reimbursed for expenses incurred for attendance at meetings of our Board of Directors and/or any committee of our Board of Directors. Officers are appointed annually by our Board of Directors and each Executive Officer serves at the discretion of our Board of Directors. We do not have any standing committees. Our Board of Directors may in the future determine to pay Directors fees and reimburse Directors for expenses related to their activities.\nEmployment Agreements\nThere are no formal employment agreements with our officers and directors.\nFamily Relationships\nThere are no family relationships between any of our directors, executive officers and proposed directors or executive officers.\nInvolvement in certain legal proceedings.\nNone of our directors or executive officers has been involved in any of the following events during the past 10 years:\n●\nany bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n●\nany conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offences);\n●\nbeing subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his or her involvement in any type of business, securities or banking activities; or\n●\nbeing found by a court of competent jurisdiction (in a civil action), the Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\nSection 16(a) Beneficial Ownership Reporting Compliance\nOur common stock is not registered pursuant to Section 12 of the Securities Exchange Act of 1934, as amended (the Exchange Act). Accordingly, our executive officers and directors and persons who own more than 10% of a registered class of our equity securities are not subject to the beneficial ownership reporting requirements of Section 16(1) of the Exchange Act.\nCode of Ethics\nWe have not adopted the Code of Business Conduct and Ethics.\nBoard and Committee Meetings\nOur Board of Directors held no formal meetings during the year ended September 30, 2023. All proceedings of the board of directors were conducted by resolutions consented to in writing by all the directors and filed with the minutes of the proceedings of the directors. Such resolutions consented to in writing by the directors entitled to vote on that resolution at a meeting of the directors are, according to the Nevada General Corporate Law and our Bylaws, as valid and effective as if they had been passed at a meeting of the directors duly called and held.\nNomination Process\nAs of September 30, 2023, we did not affect any material changes to the procedures by which our shareholders may recommend nominees to our board of directors. Our Board of Directors does not have a policy with regards to the consideration of any director candidates recommended by our shareholders. Our Board of Directors has determined that it is in the best position to evaluate our companys requirements as well as the qualifications of each candidate when the board considers a nominee for a position on our board of directors. If shareholders wish to recommend candidates directly to our board, they may do so by sending communications to the president of our company at the address on the cover of this annual report.\nAudit Committee\nCurrently our audit committee consists of our entire board of directors. We do not have a standing audit committee as we currently have limited working capital and minimal revenues. Should we be able to raise sufficient funding to execute our business plan, we will form an audit, compensation committee and other applicable committees utilizing our directors expertise.\nAudit Committee Financial Expert\nWe do not currently have a director who is qualified to act as the head of the audit committee. ITEM 11. EXECUTIVE COMPENSATION\nThe particulars of the compensation paid to the following persons:\n(a)\nour principal executive officer (the Company has no other executive officers)\nSUMMARY COMPENSATION TABLE\nName and Principal Position\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive\nPlan\nCompensa-\ntion($)\nChange in\nPensionValue\nand Nonqualified\nDeferred\nCompensa-tion\nEarnings\n($)\nAll Other\nCompensa-tion\n($)\nTotal\n($)\nHaiping Hu(1)\n-\n-\n-\n-\n-\n-\n-\n-\nCEO, CFO, Secretary, and Director\n-\n-\n-\n-\n-\n-\n-\n-\n(1)\nMr. Hu was appointed CEO, CFO, Secretary and as a director on April 4, 2018.\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. Our directors and executive officers may receive share options at the discretion of our board of directors in the future. We do not have any material bonus or profit-sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that share options may be granted at the discretion of our board of directors.\nGrants of Plan-Based Awards\nDuring the fiscal year ended September 30, 2023 we did not grant any stock options.\nOption Exercises and Stock Vested\nDuring our fiscal year ended September 30, 2023 there were no options exercised by our named officers.\nCompensation of Directors\nWe do not have any agreements for compensating our directors for their services in their capacity as directors, although such directors are expected in the future to receive stock options to purchase shares of our common stock as awarded by our board of directors.\nNo compensation was paid to non-employee directors for the year ended September 30, 2023.\nPension, Retirement or Similar Benefit Plans\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. We have no material bonus or profit-sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that stock options may be granted at the discretion of the board of directors or a committee thereof.\nIndebtedness of Directors, Senior Officers, Executive Officers and Other Management\nNone of our directors or executive officers or any associate or affiliate of our company during the last two fiscal years, is or has been indebted to our company by way of guarantee, support agreement, letter of credit or other similar agreement or understanding currently outstanding. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth, as of December 22, 2023, certain information with respect to the beneficial ownership of our common and preferred shares by each shareholder known by us to be the beneficial owner of more than 5% of our common and preferred shares, as well as by each of our current directors and executive officers as a group. Each person has sole voting and investment power with respect to the shares of common and preferred stock, except as otherwise indicated. Beneficial ownership consists of a direct interest in the shares of common and preferred stock, except as otherwise indicated.\nName and Address of Beneficial Owner\nAmount and Nature of Beneficial Ownership\nPercentage of Class(1)\nHaiping Hu\n986 Dongfang Rd., One Hundred Shanshan Bldg 25th Fl\nPudong, Shanghai, China 200122\n5,023,500 Common / Direct\n51.00%\nGMB Wisdom Sharing Platform Co., Ltd.\nStart Chamber, Wickham'S CAY II, PO BOX 2221, Road Town, Tortola, VI\n4,774,100 Common\n48.47%\nDirectors and Executive Officers as a Group\n9,797,600 Common\n99.47%\n(1)\nUnder Rule 13d-3, a beneficial owner of a security includes any person who, directly or indirectly, through any contract, arrangement, understanding, relationship, or otherwise has or shares: (i) voting power, which includes the power to vote, or to direct the voting of shares; and (ii) investment power, which includes the power to dispose or direct the disposition of shares. Certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire the shares (for example, upon exercise of an option) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares outstanding is deemed to include the amount of shares beneficially owned by such person (and only such person) by reason of these acquisition rights. As a result, the percentage of outstanding shares of any person as shown in this table does not necessarily reflect the persons actual ownership or voting power with respect to the number of shares of common stock actually outstanding on December 22, 2023. As of December 22, 2023, there were 9,850,000 shares of our companys common stock issued and outstanding.\nChanges in Control\nWe are unaware of any contract or other arrangement or provisions of our Articles or Bylaws the operation of which may at a subsequent date result in a change of control of our company. There are not any provisions in our Articles or Bylaws, the operation of which would delay, defer, or prevent a change in control of our company.\nSubsequent to September 30, 2023, the majority shareholders of the Company are in private negotiation for transfer of 9,797,600 shares of common stock to new investors. As of the date of filling this report, the negotiation and agreement was not completed and closed. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nExcept as disclosed herein, no director, executive officer, shareholder holding at least 5% of shares of our common stock, or any family member thereof, had any material interest, direct or indirect, in any transaction, or proposed transaction since the year ended September 30, 2023, in which the amount involved in the transaction exceeded or exceeds the lesser of $120,000 or one percent of the average of our total assets at the year-end for the last three completed fiscal years:\nDuring the years ended September 30, 2023 and 2022, the Companys shareholder and sole officer advanced to the Company an amount of $40,997 and $48,653 respectively by paying for expenses on behalf of the Company. As of September 30, 2023, and 2022, the Company was obligated to the shareholder and sole officer for a balance of $182,493 and $141,496, respectively, which is unsecured, non-interest-bearing and due on demand.\nDirector Independence\nWe currently act with one director, Haiping Hu. We have determined that we do not have an independent director, as that term is used in Rule 4200(a)(15) of the Rules of National Association of Securities Dealers.\nCurrently our audit committee consists of our entire board of directors. We currently do not have nominating, compensation committees or committees performing similar functions. There has not been any defined policy or procedure requirements for shareholders to submit recommendations or nomination for directors.\nFrom inception to present date, we believe that the members of our audit committee and the board of directors have been and are collectively capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe aggregate fees billed for the most recently completed fiscal year ended September 30, 2023 and for fiscal year ended September 30, 2022 for professional services rendered by the principal accountant for the audit of our annual financial statements and review of the financial statements included in our quarterly reports on Form 10-Q and services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for these fiscal periods were as follows:\nFee Category\nYear Ended\nSeptember\n30, 2023\nYear Ended\nSeptember\n30, 2022\nAudit Fees\n$ 25,400\n$ 22,500\nAudit-Related Fees\n-\n-\nAll Other Fees\n-\n-\nTax Fees\n-\n-\nTotal Fees\n$ 25,400\n$ 22,500\nOur board of directors pre-approves all services provided by our independent auditors. All of the above services and fees were reviewed and approved by the board of directors either before or after the respective services were rendered.\nOur board of directors has considered the nature and amount of fees billed by our independent auditors and believes that the provision of services for activities unrelated to the audit is compatible with maintaining our independent auditors independence.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a)\nFinancial Statements\n(1)\nFinancial statements for our company are listed in the index under Item 8 of this document.\n(2)\nAll financial statement schedules are omitted because they are not applicable, not material or the required information is shown in the financial statements or notes thereto.\n(b)\nExhibits\nExhibit\nNumber\nDescription\n(31)\nRule 13a-14 (d)/15d-14d) Certifications\n31.1/31.2*\nSection 302 Certification by the Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer\n(32)\nSection 1350 Certifications\n32.1/32.2**\nSection 906 Certification by the Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer\n101*\nInteractive Data File\n101*\nInline XBRL Document Set for the financial statements and accompanying notes in Part II, Item 8, Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\n104*\nInline XBRL for the cover page of this Annual Report on Form 10-K, included in the Exhibit 101 Inline XBRL Document Set.\n____________\n* Filed herewith.\n** Furnished herewith\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereto duly authorized.\nBALLY, CORP.\nDated: December 22, 2023\nBy:\n/s/ Haiping Hu\nHaiping Hu\nChief Executive Officer, Chief Financial Officer, Secretary and Director\n(Principal Executive Officer, Principal Financial Officer and\nPrincipal Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDated: December 22, 2023\nBy:\n/s/ Haiping Hu\nHaiping Hu\nChief Executive Officer, Chief Financial Officer, Secretary and Director\n(Principal Executive Officer, Principal Financial Officer and\nPrincipal Accounting Officer)"
}