{
    "cik": "1593001",
    "company": "NightFood Holdings, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "2060",
    "state_of_inc": "NV",
    "state_location": "NY",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1593001/0001013762-23-003824-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1593001/000101376223003824/f10k2023_nightfood.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1593001/0001013762-23-003824.txt",
    "filename": "1593001_10K_2023_0001013762-23-003824.htm",
    "content": "ITEM 1. BUSINESS\nNightfood Holdings, Inc. (we, us the Company or Nightfood) is a Nevada corporation organized on October 16, 2013 to acquire all of the issued and outstanding shares of Nightfood, Inc., a New York corporation (Nightfood) from its sole shareholder, Sean Folkson. All of our operations are conducted by our Subsidiaries (Nightfood, Inc. and MJ Munchies, Inc.)\nNightfood, Inc. is in the business of manufacturing, marketing and distributing snacks specially formulated and promoted for evening consumption. A large number of Americans snack at night, and the most common options tend to be high in sugar, fat, sodium, and calories; such snacks can impair sleep quality and also impair health in general. Management believes that our products are unique in the food industry and that there is a substantial market for nighttime specific snacks that are formulated with better sleep in mind. Our corporate address is 520 White Plains Road - Suite 500, Tarrytown, New York 10591 and our telephone number is 888-888-6444. We maintain a web site at www.Nightfood.com, along with many additional web properties. Any information that may appear on our web site should not be deemed to be a part of this report.\nOn January 3, 2018, the Registrant formed a new wholly-owned subsidiary to capitalize on opportunities in the marijuana and CBD edibles space. MJ Munchies, Inc. (Munchies) was formed as a Nevada corporation with a capital structure of 10,000 shares of common stock. Since formation, Munchies has built an intellectual property portfolio that includes protections regarding the use of the Half-Baked mark in the State of California relating to certain cannabis-related products. The Registrant also acquired the HalfBaked.com domain, and several other related domain names and IP. On September 21, 2023, Munchies announced it had entered into an exclusive license agreement for the Half-Baked trademark with Houdini Group, a vertically integrated California-based cannabis company.\nIndustry Overview - Nightfood\nWhat you eat before bed matters.\nNightfood is pioneering the category of sleep-friendly nighttime snacking.\nResearch indicates that humans are biologically hard-wired to load up on sweets and fats at night. Loading a surplus of calories (fuel) into the body before the long nightly fast is believed to be an outdated survival mechanism from our hunter-gatherer days. Unfortunately, while modern consumers know this type of consumption isnt necessary for survival, willpower also weakens at night, so consumers are more likely to succumb to these unhealthy nighttime cravings for excess survival calories.\nAs a result, over 90% of adults report snacking regularly between dinner and bed (according to SleepFoundation.org), resulting in an estimated 1 billion nighttime snack occasions weekly in the United States, and an annual spend on night snacks of over $60 billion. Because of our hard-wired evolutionary preferences at night for calorie-dense foods which increased the odds of short-term survival for our ancestors, the most popular nighttime snacks are ice cream, cookies, chips, and candy. These are all understood to be generally unhealthy. They can also impair sleep quality.\nAnd, because these cravings are biologically hardwired, we believe modern unhealthy nighttime snacking behavior will continue to be a pattern and a problem for a significant portion of the population in developed nations around the world. We believe its a problem that demands a solution.\nIn recent years, billions of dollars of consumer spend have shifted to better-for-you versions of consumers favorite snacks. Nightfood snacks are not only formulated to be better-for-you, but theyre uniquely formulated by sleep experts and nutritionists to provide a better nutritional foundation for quality sleep.\nA significant portion of total snack consumption takes place between dinner and bed. Nutrition is an important part of sleep-hygiene because what one eats at night impacts sleep. Industry surveys indicate that modern consumers seek functional benefits from their snacks, and most consumers would also prefer better sleep.\nAs the pioneers of the nighttime snacking category, Nightfood accepts the responsibility to educate consumers and build the awareness required to grow the nighttime segment of the overall snack market. Along with that responsibility comes the opportunity to be the category king. We envision a future where nighttime specific, sleep-friendly snacks comprise a meaningful subsegment of the estimated $150 billion American snack market.\nManagement believes significant latent consumer demand exists for better nighttime snacking options, and that a new consumer category, consisting of nighttime specific snacks, is set to emerge in the coming years. This belief is supported by research from major consumer goods research firms such as IRI Worldwide, and Mintel, who identified nighttime specific foods and beverages as one of the most compelling and category changing trends for 2017 and beyond. In recent years, CEOs and other executives from major consumer goods conglomerates such as Nestle, PepsiCo, Mondelez, and Kelloggs have commented on consumer nighttime snack habits and alluded to the opportunity that might exist in solving this problem for the marketplace.\nNightfood has established a highly credentialed Scientific Advisory Board consisting of sleep and nutrition experts to drive product formulation decisions and provide consumer confidence in the brand promise. The first member of this advisory board was Dr. Michael Grandner, Director of the Sleep and Health Research Program at the University of Arizona. Dr. Grandner has been conducting research on the link between nutrition and sleep for over fifteen years, and he believes improved nighttime nutritional choices can improve sleep, resulting in many short and long-term health benefits. In March of 2018, the Company added Dr. Michael Breus to their Scientific Advisory Board. Dr. Breus, known to millions as The Sleep Doctor™, is believed to be the Nations most trusted authority on sleep. He regularly appears in the national media to educate and inform consumers so they can sleep better and lead happier, healthier, more productive lives. In July, 2018, we completed our Scientific Advisory Board with the addition of Lauren Broch, Ph.D, M.S. Dr. Broch is a sleep therapist and former Director of Education & Training at the Sleep-Wake Disorders Center at Weill Cornell Medical College. Dr. Broch also has a masters degree in human nutrition. This combination allows her to play an important role in the formulation of Nightfood snacks. These experts work with Company management to ensure Nightfood products deliver on their nighttime-appropriate, and sleep-friendly promises.\nCompared to regular ice cream, Nightfood is formulated with more tryptophan, more vitamin B6, more calcium, magnesium, and zinc, more protein and more prebiotic fiber. Nightfood also contains less fat, less sugar, and fewer calories than traditional ice cream, and is lactose free.\nNightfood cookies offer similar nutritional benefits when compared to conventional cookies. They feature less sugar, less fat, fewer calories, more protein, more prebiotic fiber, and contain added inositol and vitamin B6.\nEach new Nightfood snack format would be expected to deliver sleep-friendly snacking in a way that is appropriate for that format. For example, Nightfood chips would not necessarily contain significantly more tryptophan than other brands of chips but may be more sleep-friendly in other ways.\nIn February of 2019, it was announced that Nightfood had won the 2019 Product of the Year Award in the ice cream category in a Kantar innovation survey of over 40,000 consumers. In June of 2019, it was announced that Nightfood won both the Best New Ice Cream and Best New Dairy Dessert awards at the World Dairy Innovation Awards.\nIn November of 2021, Nightfood won the Real California Milk Excelerator Dairy Innovation competition, with a top prize of $150,000 in marketing support. Executives and judges from the California Milk Advisory Board and corporate entities such as Hersheys, Coca-Cola, and Whole Foods commended the unique problem the Nightfood brand addresses for consumers, and the opportunities and strategic advantages afforded by widespread hotel distribution for a brand pioneering sleep-friendly nighttime snacking.\nNightfood has received media coverage in outlets such as The Today Show, Oprah Magazine, The Rachael Ray Show, Food Network Magazine, The Wall Street Journal, USA Today, The Washington Post, Fox Business News, and many more media outlets.\nOur Products, Present and Proposed\nThe most widely consumed nighttime snacks are cookies, chips, candy, and ice cream. Our goal is to offer consumers sleep-friendly versions of each of those snack formats as well as others.\nCompared to regular ice cream, Nightfood is formulated to contain less sugar, less fat, fewer calories, more tryptophan, more protein, more prebiotic fiber, more vitamin B6, more calcium, magnesium, and zinc.\nNightfood ice cream has been produced in nine flavors. These are Full Moon Vanilla, Midnight Chocolate, Cold Brew Decaf, After Dinner Mint Chip, Milk & Cookie Dough, Cherry Eclipse, Bed and Breakfast, Cookies n Dreams, and Pickles For Two. The Company is currently focused on two of those flavors, Midnight Chocolate and Cookies n Dreams, which are the two flavors in national hotel distribution. Pickles for Two has been discontinued, and the other 6 flavors are not scheduled for additional production in the short term. Management anticipates bringing some or all of those flavors back into production in the future, if and when Nightfood ice cream pints are reintroduced into supermarket distribution.\nNightfood cookies have been manufactured in one flavor (Prime-Time Chocolate Chip), and two other flavors have been developed (Date Night Cherry Oat and Snoozerdoodle). Compared to traditional cookies, Nightfood cookies feature less sugar, less fat, fewer calories, more protein, more prebiotic fiber, and contain added inositol and vitamin B6.\nOur goal is to introduce sleep-friendly versions of additional popular nighttime snack formats subject to available capital and market demand, including chips, single-serve ice cream novelties, candy, and more.\nEach new Nightfood snack format would be expected to deliver sleep-friendly snacking in a way that is appropriate for that format. For example, Nightfood chips would not necessarily contain significantly more tryptophan than other brands of chips but may be more sleep-friendly in other ways.\nDevelopment Plans\nThe Company plans to leverage direct-to-consumer sales and hotel distribution to grow revenue, grow brand awareness, and establish the sleep-friendly snack category we are pioneering. We plan to expand into mainstream retail, including supermarket distribution, when we have built a foundation of revenue and consumer awareness.\nProduction\nTo date, we have utilized contract manufacturers for producing our products and packaging, and third-party logistics for warehousing and order fulfillment. We intend to continue outsourcing in this manner as we add additional snack formats to the Nightfood product lineup.\nMarketing and Distribution\nNightfood ice cream is currently available in hundreds of hotel locations across the United States. In 2023, we announced relationships with major global hotel companies Sonesta International Hotels, Choice Hotels International, and BWH Hotels (Best Western). Weve also received interest from brand and wellness executives at other global hotel companies.\nThese corporate level relationships do not guarantee distribution in the lobby markets of those chains. The final decision-makers are typically the local operators or management groups, who are generally less concerned with brand image and wellness than the brand managers and wellness executives at headquarters.\nThe Company faces distribution challenges which management is addressing. These include the fact that Nightfood is not available in all points of distribution where local hotel operators procure their snacks (which might include national distributors, local distributors, and local retailers such as Walmart, Sams Club, and Costco). In addition, many hotels have contracts with certain group purchasing organizations (GPOs), which restrict or disincentivize the operators from sourcing products from outside that GPO network. Nightfood has active, signed agreements with two of the major hotel industry GPOs, and management is working to secure relationships with others. Typically, the GPOs require significant demand before entering contracts with new suppliers. At the same time, not having a contract is a hurdle in generating demand growth. This loop makes it challenging to grow distribution in the complex hospitality ecosystem, but we believe were making progress and will succeed over time.\nOver the last several quarters, we have built what we believe is a very valuable network and distribution infrastructure, which includes global hospitality companies, GPOs, hotel management groups, and distributors.\nDuring the three-month period ending September 30, 2023, approximately 300 hotels across the United States ordered Nightfood ice cream through our distributor. Hotel brands represented in this group include Holiday Inn , Holiday Inn Express, Crowne Plaza, Homewood Suites, Hampton Inn, Embassy Suites, Hilton Garden Inn, Comfort Inn, Everhome Suites, Sonesta Simply Suites, Sonesta ES Suites, Sonesta Select, Hyatt House, Springhill Suites, Townplace Suites, Residence Inn, Courtyard by Marriott, and many more. Geographic density of our ice cream distribution is heaviest in New England, the Carolinas, Florida, the Mid-Atlantic region, and Texas. There may currently be insufficient established distribution in certain regions of the country to support full national distribution in regional warehouses around the country. Management is working on expanding distribution options for local hotel operators that wish to make Nightfood ice cream available for their guests in those regions, while also focusing on strengthening distribution in those regions where our ice cream has gained more traction.\nNightfood cookies are awaiting a transition to a new copacker, where our goal is to manufacture all three developed flavors simultaneously for the launch of adirect-to-consumer (DTC) online marketing and sales campaign. Light R&D work was quickly completed to improve the taste and texture of our Prime-Time Chocolate Chip. Similar work for Date Night Cherry Oat and Snoozerdoodle is expected to be quickly completed pending the availability of funds to launch DTC. The new copacker has the ability to produce higher volumes of cookies and at a significantly lower cost than the start-up copacker that has produced our cookies to date.\nDuring July and August of 2023, we initiated a direct-to-hotel sales initiative of 25 gram Nightfood Prime-Time Chocolate Chip cookies as a hotel guest check-in amenity. The initiative met with some success but was not self-sustaining and has been paused. We believe a significant opportunity can exist in this space. Once transitioned to the new manufacturing facility, we will revisit this opportunity. At the same time, were exploring opportunities to introduce Nightfood as an amenity at the hotel-brand level with some hotel chains. There are inherent distribution challenges with such initiatives that would need to be overcome, but we believe any hotel chain that is sufficiently motivated to provide sleep-friendly snacks for their guests could do so in partnership with our brand.\nWe plan to expand into mainstream retail, including supermarket distribution, when we have built a foundation of revenue and consumer awareness through direct-to-consumer retail and hotel distribution.\nCompetition\nThe nutritional/snack food business is highly competitive and includes such participants as companies like Mondelez, Nestle S.A., Hersheys, Hormel, Kraft/Heinz, Kelloggs, Ferrero, Campbell Soup Company, Utz, General Mills, Mars, The Simply Good Foods Company, Wells Enterprises, Froneri, Unilever, Hostess, PepsiCo, Post Holdings, and more. Many of these competitors have well established names and products.\nIn 2019, Nestle announced interest in the nighttime snacking space with the introduction of a candy-type product called GoodNight. In 2020, Pepsi announced the launch of a relaxation drink called Driftwell. Moreover, in 2021, Unilever announced they had initiated a year-long research study to identify how nutrition could be used to improve sleep, through impact on the gut microbiome. In September 2021, the Chief Medical Officer of Pepsi stated that Pepsi researchers were examining how foods and beverages affect neurochemical pathways, and that the company was interested in how this research could be used to impact sleep. In 2023, Post Holdings, maker of well-known cereals such as Grape Nuts, HoneyComb, and Fruity and Cocoa Pebbles, launched a cereal called Sweet Dreams which targets the nighttime snack occasion.\nWhile it is not typically the approach of global brands to try to launch products into an unproven category, there is obviously interest in the space from some global players. We believe that launches like those mentioned above from global food companies like Nestlé, Pepsi, and Post indicate an interest from those companies in the nighttime snack opportunity weve identified and are pioneering.\nIn recent years, our Company has been approached by two of the largest food and beverage companies in the world to discuss and explore international partnership and joint venture opportunities relating to the nighttime snack category.\nIn April of 2023, it was announced that Nightfood and Nestlé initiated a proof-of-concept test of Nightfoods sleep-friendly cookies. Through a collaboration established with Nestlé and TAP Air Portugal, Nightfood cookies were made available on TAP flights from Miami to Lisbon for the purpose of collecting data relating to consumer attitudes and behaviors related to the nighttime snack occasion. That data collection process was completed in late September of 2023. We are awaiting an update from Nestlé regarding next discussions and potential next steps together.\nNightfood competes based upon the unique characteristics and positioning of our products and we hope to derive significant leverage from being the pioneer and creator of the emerging night snack category. However, other companies, including those with greater name recognition than us and greater resources may continue to introduce products that could be viewed as competing directly with our products.\nBased on the current acquisition climate in the consumer goods space, Management believes that successful growth of the Nightfood snack line could likely bring acquisition offers from potential competitors as quickly as it might actually bring competition on the shelf from those same potential competitors.\nManagement believes growth via e-commerce and in the lobby shops of the worlds largest hotel chains can provide a unique and powerful competitive advantage within the sleep-friendly nighttime snack category. In the direct-to-consumer and hotel channels, the Nightfood brand can be insulated from potential competition compared to in the supermarket environment. In addition, deep and wide hotel penetration could serve to entrench Nightfood as the leading brand within the category, with a de-facto endorsement by the hotel industry serving as a distinct competitive advantage for Nightfood when competing head to head with competitors in other segments of the marketplace.\nWe believe the very nature of the hotel lobby shops, with small retail footprint and limited selection, can afford Nightfood a protected position in that high-margin vertical during the formative years of the category. Furthermore, management believes widespread hotel rollout of Nightfood snacks would serve to validate the concept of sleep-friendly nutrition and night snacks in the minds of consumers, potentially accelerating its adoption in all relevant retail verticals.\nIntellectual Property Rights\nWe own the registered trademark Nightfood® for the nutrition bar/snack/meal replacement category, and the ice cream category in the United States. In September 2021, the Company also submitted for federal trademark protection for the Nightfood mark in the categories of cookies, chips, and candy in the United States. The Nightfood mark in the ice cream category has also been registered in Australia, Benelux, Canada, Germany, Ireland, Mexico, New Zealand, and the United Kingdom. We believe these marks can prove important and valuable to our business as we continue to pioneer the development of a new category of snacks formulated with a sleep-friendly nutritional profile, specific to consumption at night, between dinner and bedtime.\nWe own the domain Nightfood.com as well as many other relevant domains such as late-night-snack.com, nighttimesnack.com, and nighttimesnacking.com, as well as Nightfood.us, Nightfood.net, TryNightfood.com, GetNightfood.com, NiteFood.com, TryNightfood.com, BuyNightfood.com, NightSnacking.com, and Night-Food.com. We also own the toll-free number 888-888-NIGHT.\nNightfoods formulae and recipes are proprietary, and we have non-disclosure agreements with our suppliers.\nSince formation, Munchies has built an intellectual property portfolio that includes protections regarding the use of the Half-Baked mark in the State of California relating to certain cannabis-related products. The Registrant also acquired the HalfBaked.com domain, and several other related domain names and IP. On September 21, 2023, Munchies announced it had entered into an exclusive license agreement for the Half-Baked trademark with Houdini Group, a vertically integrated California-based cannabis company.\nPersonnel\nNightfood has no employees. Our CEO, Sean Folkson, has a consulting agreement with the Company. Functions within the company such as sales, marketing, production, distribution, sales, accounting, public relations, and more are primarily conducted through vendor and consultant relationships. Should we be successful in executing our business plan, we anticipate potentially hiring employees at some point to assist with various company functions. However, we also expect to continue to strategically outsource to enable growth without unnecessary expense and overhead.\nCustomers\nOur customers consist primarily of distributors that sell snack product to hotels and supermarkets. In FY 2023, we had one customer that accounted for 42% of our Gross Sales. One other customer accounted for 29% and two others each accounted for between 7% and 10%. In FY 2022, we had one customer that accounted for over 20% of our Gross Sales. Two other customers each accounted for 16% and four others each accounted for between 8.5% and 9.9%\nVendors\nDuring the year ended June 30, 2023 three vendors accounted for approximately 72% of our costs of goods sold. In the year ended June 30, 2022, four vendors accounted for 92% of our costs of goods sold, one of which individually accounted for 48% of all purchases. ITEM 1A. RISK FACTORS\nYou should carefully consider the following factors in evaluating our business, operations and financial condition. The occurrence of any the following risks could have a material adverse effect on our business, financial condition and results of operations.\nRisks Related to Our Financial Condition\nWe require substantial additional funds to execute our business plan. We have not yet established significant traction in the marketplace. We generated net revenues of $133,456 and $443,538 for the fiscal years ended June 30, 2023 and 2022, respectively. Our future viability is dependent on our ability to substantially increase our sales revenues. Furthermore, unless we are able to continue to leverage our status as a public company into effective fundraising to fund our capital requirements, we will not be able to execute on our business plan and purchasers of our stock will be likely to lose their investment. Over the next 6-12 months, we believe we will require approximately $500,000 - $750,000 in debt or equity financing to scale our business through the introduction of new products and new distribution points and attain profitability. An additional $2,000,000 - $2,500,000 would be needed to pay off all outstanding debt and payables, assuming no conversions of debt to equity. The Company is continuing to raise capital through the sale of a combination of its common stock, preferred stock and/or convertible notes, as well as the potential cash exercise of outstanding warrants, to finance the Companys operations, of which it can give no assurance of success. We can give no assurance that we will be able to raise the required funds.\nOur independent registered public accounting firm have expressed doubt about our ability to continue as a going concern. We received a report on our financial statements for the years ended June 30, 2023, and June 30, 2022 from our independent registered public accounting firm that includes an explanatory paragraph and a footnote stating that there is substantial doubt about our ability to continue as a going concern due to its losses and negative net worth. Inclusion of a going concern qualification in the report of our independent accountants may have a negative impact on our ability to obtain financing and may adversely impact our stock price in any market that may develop.\nWe might be unable to service our existing debt due to a lack of cash flow and might be subject to declared default. As of June 30, 2023, we had $1,491,719 of convertible notes payable, net of discounts. The majority of that debt is to one noteholder, Mast Hill Fund, L.P., and is secured by a first priority security interest in substantially all of our assets.\nBecause we did not repay the oldest of our notes with Mast Hill when due on September, 22, 2023, the lender retains the option to declare a default and declare all amounts outstanding to be immediately due and payable, along with default penalties and default interest. Should Mast Hill declare a default, they will have a first claim on our assets pledged under the loan agreements. If Mast Hill should attempt to foreclose on the collateral, it is unlikely that there would be any assets remaining after repayment in full of such secured indebtedness.\nWe cannot predict when we will achieve profitability. We have not been profitable and cannot predict when we will achieve profitability, if ever. We have experienced net losses since our inception. Our inability to become profitable may force us to curtail or temporarily discontinue our day-to-day operations. Furthermore, there can be no assurance that profitability, if achieved, can be sustained on an ongoing basis. As of June 30, 2023, we had an accumulated deficit of $34,988,126.\nRisks Related to Our Business\nThe hotel industry may not adopt the concept of nighttime snacks for their guests. Although it has been communicated to management by executives from multiple global hospitality companies that they agree with the premise that any hotel selling snacks for guests should offer sleep-friendly nighttime snacks, the possibility exists that the industry, as a whole, will not adopt the concept and our brand will not be able to scale sufficiently for us to ever reach profitability. Significant competition exists within the hotel industry. While management believes that a few major chains introducing nighttime snacks could trigger a tipping point within the space, it is possible that the brand may fail to reach that level of growth. If management is wrong in its belief that the brand can achieve widespread hotel distribution that could impair our ability to establish the Nightfood brand and/or the nighttime snack category as a whole, potentially causing us to fail if were unable to gain sufficient traction and revenue through other sales channels.\nReduction in future demand for our products would adversely affect our business. Demand for our ice cream, cookies, and other future products depends in part on our ability to anticipate and effectively anticipate and respond to shifts in consumer trends and preferences, including the types of products our consumers want and how they discover, purchase and consume them. Consumer preferences continuously evolve due to a variety of factors, including changes in consumer demographics, consumption patterns and channel preferences; pricing; product quality; concerns or perceptions regarding packaging and its environmental impact; and concerns or perceptions regarding the nutrition profile and health effects of, or location of origin of, ingredients or substances in our products. Concerns with any of the foregoing could lead consumers to reduce or publicly boycott the purchase or consumption of our existing products or other products we may develop in the future. Consumer preferences are also influenced by perception of our brand image or the brand images of our products, the success of our advertising and marketing campaigns, our ability to engage with our consumers in the manner they prefer, including through the use of digital media, and the perception of our use, and the use of social media. Any inability on our part to anticipate or react to changes in consumer preferences and trends can lead to reduced demand for our products, lead to inventory write-offs or erode our competitive and financial position, thereby adversely affecting our business. In addition, our business operations are subject to disruption by natural disasters or other events beyond our control that could negatively impact product availability and decrease demand for our products.\nWe rely in part on third-party distributors to effectively distribute our products. If we cannot maintain positive relationships with our existing and future distributors who wish to, or can, effectively distribute our products to hotels and supermarkets, our operating results and business may suffer.\nWe depend on qualified distributors for the distribution of Nightfood snacks. We are subject to the uncertainty of convincing distributors to accept and distribute our products, which are in the nighttime snaking category, an as-of-yet unproven market we are pioneering. Further, even if we are able to convince distributors to carry our products, we will depend on these distributors support in marketing our products, yet we will be unable to control their efforts completely, and they may cancel our arrangements at any time. These distributors typically would sell a variety of other, competing and non-competing products that may limit the resources they dedicate to selling our products. Identifying and retaining third-party distributors and convincing them of our value requires significant time and resources. To develop and expand our distribution, we may be required to scale and improve our processes and procedures that support our distributors. Further, if our relationship with a successful distributor terminates, we may be unable to replace that distributor without disruption to our business. If we fail to develop or maintain positive relationships with our distributors, including in new markets, fail to manage or incentivize these distributors effectively, or fail to provide distributors with competitive products on attractive terms, or if these distributors are not supportive in their sales efforts, we may not achieve or may have a reduction in revenue and our operating results, reputation and business would be harmed.\nSystem interruptions that impair customer access to our website or other performance failures in our technology infrastructure could damage our business, reputation and brand and substantially harm our business and results of operations.\nThe satisfactory performance, reliability and availability of our website, transaction processing systems and technology infrastructure are important to our reputation and our ability to acquire and retain E-commerce customers, as well as maintain adequate customer service levels. Any compromise of our or our third-party partners security could result in a violation of applicable security, privacy or data protection, consumer and other laws, regulatory or other governmental investigations, enforcement actions, and legal and financial exposure, including potential contractual liability.\nInflation may increase our costs and alter our capital requirements.\nRecently, inflation has increased to historic levels across the U.S. and global economy, driving up the costs of goods and services. Inflation can adversely affect us by increasing the costs of our materials, the development and manufacture of our products, administration, and other costs of doing business. We may experience increases in the prices of labor and other costs of doing business. In an inflationary environment, cost increases may outpace our expectations, causing us to use our cash and other liquid assets faster than forecasted. If this happens, we may need to raise additional capital to fund our operations, which may not be available in sufficient amounts or on reasonable terms, if at all, sooner than expected.\nAdditionally, inflation and related developments could impact consumer and small business spending, including scaling back discretionary purchases of our products, and have other unforeseen consequences. Challenging economic times could cause potential new customers not to purchase or to delay purchasing our products, and could cause our existing customers to discontinue purchasing our products.\nAny of the foregoing may negatively impact our revenues and future financial results.\nDamage to our reputation or brand image can adversely affect our business. We expect that creating and maintaining a positive reputation is critical to selling our products. Our reputation or brand image could be adversely impacted by a variety of factors, including: any failure by us or our contract manufacturer and other business partners to maintain high ethical, social, business and environmental practices; any failure to address health concerns about our products or particular ingredients in our products; our research and development efforts; any product quality or safety issues, including the recall of any of our products; any failure to comply with laws and regulations; consumer perception of our advertising campaigns, sponsorship arrangements, marketing programs and use of social media; or any failure to effectively respond to negative or inaccurate comments about us on social media or otherwise regarding any of the foregoing. Damage to our reputation or brand image could decrease demand for our products, thereby adversely affecting our business.\nIssues or concerns with respect to product quality and safety can adversely affect our business. Product quality or safety issues, whether as a result of failure to comply with food safety laws or otherwise, could in the future reduce consumer confidence and demand for our products, cause production and delivery disruptions, require product recalls and result in increased costs (including payment of fines and/or judgments) and damage our reputation, all of which can adversely affect our business. Failure to maintain adequate oversight over product quality or safety can result in product recalls, litigation, government investigations or inquiries or civil or criminal proceedings, all of which may result in fines, penalties, damages or criminal liability. Our business can also be adversely affected if consumers lose confidence in product quality, safety and integrity generally, even if such loss of confidence is unrelated to our products.\nDisruption of our supply chain may adversely affect our business. Some of the raw materials and supplies used in the production of our products may from time to time be sourced from countries experiencing civil unrest, political instability or unfavorable economic conditions. Additionally, some raw materials and supplies, including packaging materials, are available only from a limited number of suppliers or from a sole supplier or are in short supply. There can be no assurance that we will be able to maintain favorable arrangements and relationships with suppliers. We do not have any contingency plans to prevent disruptions that may arise from shortages or discontinuation of any raw materials and other supplies that we use in the manufacture, production and distribution of our products. The raw materials and other supplies that our contractors use for the manufacturing, production and distribution of our products are subject to price volatility and fluctuations in availability caused by many factors. If price changes result in unexpected or significant increases in the costs of any raw materials or other supplies, we may be unwilling or unable to increase our product prices or unable to effectively hedge against price increases to offset these increased costs without suffering reduced volume, revenue, margins and operating results.\nOur reliance on third-party service providers can have an adverse effect on our business. We rely on third-party service providers for most areas of our business, including procurement of ingredients, manufacturing, transportation, cold storage, sales & marketing, and finance and accounting functions. Failure by these third parties to meet their contractual, regulatory and other obligations to us, or our failure to adequately monitor their performance, could result in additional costs to correct errors made by such service providers. Depending on the function involved, such errors can also lead to business disruption, systems performance degradation, processing inefficiencies or other systems disruptions, the loss of or damage to intellectual property or sensitive data through security breaches or otherwise, incorrect or adverse effects on financial reporting, litigation or remediation costs, damage to our reputation, all of which can adversely affect our business. For example, should the refrigeration system fail at our third-party cold storage facility, we could suffer the loss of some, or all, of our inventory. Should our contract manufacturers go out of business or suffer major equipment failure, we may lose the ability to produce sufficient quantities of our products for a period of time before establishing production with a new copacker. Any number of similar failures on behalf of our service providers could prove damaging to our ongoing operations and our ability to fulfill demand.\nOur ability to hire additional personnel is important to the continued growth of our business. Our continued success depends upon our ability to attract and retain a group of motivated marketing and business support professionals. Our growth may be limited if we cannot recruit and retain a sufficient number of people. We cannot guarantee that we will be able to hire and retain a sufficient number of qualified personnel.\nAlthough we currently do not have any employees, we expect that as and if we continue to grow, we will commence hiring full and part-time employees, all of whom will need to be highly skilled and diverse. We expect that any such employees would also be highly sought after by our competitors and other companies and our ability to compete would effectively depend on our ability to attract, retain, develop and motivate highly skilled personnel for all areas of our organization. Any unplanned turnover or unsuccessful implementation of our succession plans to backfill current leadership positions, including our president and Chief Executive Officer, or failure to attract, develop and maintain a highly skilled and diverse workforce, including with key capabilities such as e-commerce and digital marketing and data analytic skills, would likely deplete our institutional knowledge base, erode any competitive advantage we may have or result in increased costs due to increased competition for employees, higher employee turnover or increased employee benefit costs. Any of the foregoing can adversely affect our business.\nWe face substantial competition. Competition in all aspects of the functional food industry is intense. We compete against both large conglomerates with substantial resources and smaller companies, including new companies that might be formed with resources similar to our own. Accordingly, it is both concentrated and dispersed and we face challenges from numerous competitors as we seek to establish our brand and gain customer loyalty. The success of these efforts is, by its nature, uncertain.\nAdditionally, competitors may seek to duplicate the perceived benefits of our products in ways that do not infringe on any proprietary rights that we can protect. As a result we could find that our entire marketing plan and business model is undercut or made irrelevant by actions of other companies under which we have no control. We cannot promise that we can accomplish our marketing goals and as a result may experience negative impact upon our operating results.\nIf we are able to expand our operations, we may be unable to manage our future growth successfully.\nIf we are able to expand our operations, we may experience periods of rapid growth, which will require additional resources. Any such growth could place substantial strain on our management and our operational, financial, and other resources, and we will need to train, motivate, and manage current employees, as well as attract management, sales, finance and accounting, technical, and other professionals. In addition, we will need to expand the scope of our infrastructure and our physical resources. Any failure to expand these areas and implement appropriate procedures and controls in an efficient manner and at a pace consistent with our business objectives and such growth could have a material adverse effect on our business and results of operations.\nOur focus on a singular daypart could expose us to loss of addressable market.\nOur business is centered on the nighttime snack occasion. The risks associated with focusing on a singular daypart can be substantial. Should consumers around the world discontinue unhealthy nighttime snacking en masse, we may not be financially or operationally capable of introducing alternative products within a short time frame. As a result, such demand decline could cause us to cease operations.\nThe full impact of COVID-19 on our business remains unknown. Reports indicate that consumer behavior has shifted as a result of COVID and the resulting impact on the economy. Some of these reported changes include fewer supermarket visits, consumer reliance on legacy brands in lieu of trying new branded offerings, and increases in at-home snacking. Further, for a period of time, COVID resulted in decreased travel and hotel occupancy, which would have adversely affected any sales of our products in hotels that would have carried our snacks. Additionally, customary marketing tactics such as in-store displays and product sampling have been either impaired or impermissible, which could have a material adverse effect on the introduction of our products in new retail establishments. To date, we have experienced only minor issues regarding supply chain and logistics. Our order processing function has been largely normal to date, and our manufacturers have assured us that their operations are continuing with no or minor interruptions. However, any future changes as a result of COVID-19 could have a material adverse effect on our results of operations and financial condition, including that an uptick in cases and resulting shutdowns in travel could materially adversely affect our projected sales in our new hotel vertical.\nAdditionally, it is possible that the fallout from the pandemic could make it more difficult in the future for the Company to access required growth capital, possibly rendering us unable to meet certain debts and expenses.\nOur success depends to a large extent upon the continued service of key managerial personnel and our ability to attract and retain qualified personnel. We are highly dependent on the ability and experience of Sean Folkson, our CEO. We have a consulting agreement with Mr. Folkson; however, the loss of Mr. Folkson would present a significant setback for us and could impede the implementation of our business plan. There is no assurance that we will be successful in acquiring and retaining qualified personnel to execute our current plan of operations.\nRisks Relating to our Securities and Structure\nThe ability of our sole executive officer and director to control our business will limit minority shareholders ability to influence corporate affairs. As of the date of this filing, Mr. Folkson beneficially owned 17,176,644 shares of our common stock. In addition to his beneficial ownership of the common stock, Mr. Folkson beneficially owns 1,000 shares of our Series A Preferred Stock, which votes with the common stock and has an aggregate of 100,000,000 votes. Accordingly, Mr. Folkson controls the majority of the voting power in the Company. Because of his stock ownership, Mr. Folkson is in a position to continue to elect our board of directors, decide all matters requiring stockholder approval and determine our policies. Mr. Folksons interests may differ from the interests of other shareholders with respect to the issuance of shares, business transactions with or sales to other companies, selection of officers and directors and other business decisions. Other shareholders have no way of overriding decisions made by Mr. Folkson as an officer or a director through their ownership of our common stock. This level of control may also have an adverse impact on the market value of our shares because he may institute or undertake transactions, policies or programs that result in losses, may not take any steps to increase our visibility in the financial community and/ or may sell sufficient numbers of shares to significantly decrease our price per share.\nFailure to establish and maintain an effective system of internal controls could harm our business and could negatively impact the price of our stock. We must review and update our internal controls, disclosure controls and procedures, and corporate governance policies as our company continues to evolve. In addition, we are required to comply with the internal control evaluation and certification requirements of Section 404 of the Sarbanes-Oxley Act and management is required to report annually on our internal control over financial reporting. Our independent registered public accounting firm will not be required to formally attest to the effectiveness of our internal control over financial reporting pursuant to Section 404 of SOX until the date we are no longer a smaller reporting company as defined by applicable SEC rules.\nAny ineffective internal control regarding our financial reporting could have an adverse effect on our business and financial results and the price of our common stock could be negatively affected. This reporting requirement could also make it more difficult or more costly for us to obtain certain types of insurance, including director and officer liability insurance, and we may be forced to accept reduced policy limits and coverage or incur substantially higher costs to obtain the same or similar coverage. Any system of internal controls, however well designed and operated, is based in part on certain assumptions and can provide only reasonable, not absolute, assurances that the objectives of the system are met. Any failure or circumvention of the controls and procedures or failure to comply with regulation concerning control and procedures could have a material effect on our business, results of operation and financial condition. Any of these events could result in an adverse reaction in the financial marketplace due to a loss of investor confidence in the reliability of our financial statements, which ultimately could negatively affect the market price of our shares, increase the volatility of our stock price and adversely affect our ability to raise additional funding. The effect of these events could also make it more difficult for us to attract and retain qualified persons to serve on our board of directors and as executive officers.\nOur managements evaluation of the effectiveness of our internal controls over financial reporting as of June 30, 2022 concluded that our controls were not effective. Management believes there is a possibility that these control deficiencies, if uncorrected, may result in material misstatements in the annual or interim financial statements that might not be prevented or detected in a timely manner. Accordingly, we have determined that these control deficiencies constitute material weaknesses. Although the Company is taking steps to remediate the material weaknesses, it currently has limited resources to do so and there can be no assurance that similar incidents can be prevented in the future.\nWe will need to evaluate our existing internal controls over financial reporting against the criteria set forth in Internal Control - Integrated Framework (2013) (the Framework) issued by the Committee of Sponsoring Organizations of the Treadway Commission. During the course of our ongoing evaluation of the internal controls, we may identify other areas requiring improvement, and may have to design enhanced processes and controls to address issues identified through this review. Remediating any deficiencies, significant deficiencies or material weaknesses that we or our independent registered public accounting firm may identify may require us to incur significant costs and expend significant time and management resources. We cannot assure you that any of the measures we implement to remedy any such deficiencies will effectively mitigate or remedy such deficiencies. The existence of one or more material weaknesses could affect the accuracy and timing of our financial reporting. Investors could lose confidence in our financial reports, and the value of our common stock may be harmed, if our internal controls over financial reporting are found not to be effective by management or by an independent registered public accounting firm or if we make disclosure of existing or potential material weaknesses in those controls.\nEven if we conclude that our internal control over financial reporting provides reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles, because of its inherent limitations, internal control over financial reporting may not prevent or detect fraud or misstatements. Failure to implement required new or improved controls, or difficulties encountered in their implementation, could harm our operating results or cause us to fail to meet our future reporting obligations.\nOur reporting obligations as a public company will place a significant strain on our management, operational and financial resources and systems for the foreseeable future. If we fail to timely achieve and maintain the adequacy of our internal control over financial reporting, we may not be able to produce reliable financial reports or help prevent fraud. Our failure to achieve and maintain effective internal control over financial reporting could prevent us from filing our periodic reports on a timely basis which could result in the loss of investor confidence in the reliability of our financial statements, harm our business and negatively impact the trading price of our common stock.\nOur trading market may be restricted by virtue of state securities Blue Sky laws to the extent they prohibit trading absent compliance with individual state laws. These restrictions may make it difficult or impossible to sell shares in those states. Although trading activity in our stock has increased in recent years, generally there has been a limited public market for our common stock, and there can be no assurance that an active and regular public market will develop in the foreseeable future. Transfer of our common stock may also be restricted under the securities or securities regulations laws promulgated by various states and foreign jurisdictions, commonly referred to as Blue Sky laws. Absent compliance with such individual state laws, our common stock may not be traded in such jurisdictions. Because our securities have not been registered for resale under the Blue Sky laws of any state, the holders of such shares and persons who desire to purchase them in any trading market that might develop in the future, should be aware that there may be significant state Blue Sky law restrictions upon the ability of investors to sell the securities and of purchasers to purchase the securities. These restrictions prohibit the secondary trading of our common stock. Accordingly, investors should consider the secondary market for our securities to be a limited one.\nRecent issuances of convertible preferred stock, convertible notes, and common stock purchase warrants may have a negative impact on the trading prices of our common stock. The resale of shares issued in relation to recent financing transactions can have a negative effect on the market for our common stock and may cause dilution to our common stockholders.\nOur common stock is subject to the penny stock rules of the SEC, which makes transactions in our stock cumbersome and may reduce the value of an investment in our stock. The SEC has adopted regulations which generally define a penny stock as an equity security that has a market price of less than $5.00 per share, subject to specific exemptions. The SECs penny stock rules require a broker-dealer, before a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document that provides information about penny stocks and the risks in the penny stock market. The broker-dealer must also provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and the salesperson in the transaction, and monthly account statements showing the market value of each penny stock held in the customers account. In addition, the penny stock rules generally require that before a transaction in a penny stock occurs, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers agreement to the transaction. If applicable in the future, these rules may restrict the ability of brokers-dealers to sell our common stock and may affect the ability of investors to sell their shares, until our common stock no longer is considered a penny stock.\nGeneral Risks\nThe price of our common stock might fluctuate significantly, and you could lose all or part of your investment. Volatility in the market price of our common stock may prevent you from being able to sell your shares of our common stock at or above the price you paid for your shares. The trading price of our common stock may be volatile and subject to wide price fluctuations in response to various factors, including:\n● actual or anticipated fluctuations in our quarterly financial and operating results;\n● our progress toward developing new or proposed products;\n● publication of research reports about us or our industry or positive or negative recommendations or withdrawal of research coverage by securities analysts, if any;\n● perceptions about the market acceptance of our products and the recognition of our brand;\n● adverse publicity about our products or industry in general;\n● overall performance of the equity markets;\n● introduction of products, or announcements of significant contracts, licenses or acquisitions, by us or our competitors;\n● legislative, political or regulatory developments;\n● additions or departures of key personnel;\n● threatened or actual litigation and government investigations;\n● sale of shares of our common stock by us or members of our management; and\n● general economic conditions.\nThese and other factors might cause the market price of our common stock to fluctuate substantially, which may negatively affect the liquidity of our common stock. In addition, from time to time, the stock market experiences price and volume fluctuations, some of which may be significant. This volatility has had a significant impact on the market price of securities issued by many companies across many industries. The changes frequently appear to occur without regard to the operating performance of the affected companies. Accordingly, the price of our common stock could fluctuate based upon factors that have little or nothing to do with our company, and these fluctuations could materially reduce our share price.\nSecurities class action litigation has often been instituted against companies following periods of volatility in the overall market and in the market price of a companys securities. This litigation, if instituted against us, could result in substantial costs, divert our managements attention and resources, and harm our business, operating results and financial condition.\nThe issuance of shares upon exercise of outstanding warrants and options could cause immediate and substantial dilution to existing stockholders. The issuance of shares upon exercise of warrants and options could result in substantial dilution to the interests of other stockholders.\nFuture sales of our common stock by our stockholders could negatively affect our stock price. Sales of a substantial number of shares of our common stock in the public market by our shareholders, or the perception that these sales might occur, could depress the market price of our common stock and could impair our ability to raise capital through the sale of additional equity securities.\nIN ADDITION TO THE ABOVE RISKS, BUSINESSES ARE OFTEN SUBJECT TO RISKS NOT FORESEEN OR FULLY APPRECIATED BY MANAGEMENT. IN REVIEWING THIS ANNUAL REPORT, POTENTIAL INVESTORS SHOULD KEEP IN MIND THAT THERE MAY BE OTHER POSSIBLE RISKS THAT COULD BE IMPORTANT. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nDescription of Property\nWe do not own or lease any real estate. Our consultants, including Sean Folkson, our president, CEO and chairman, work out of their respective residence or other places of business, as the case may be, in the U.S. and around the world. We are also a member of a network of workspaces that our management uses on an as-needed basis. We believe that these facilities are adequate for our current and short-term needs but would consider long-term leased office space as and when we commence hiring full-time employees. We currently store our inventory in licensed and insured third party warehouses and fulfillment centers. We believe that our warehousing and fulfillment solutions are adequate for our current needs and that alternative similar or additional space could be found at similar cost should the need arise. ITEM 3. LEGAL PROCEEDINGS\nThere are no current, past, pending or threatened legal proceedings or administrative actions either by or against the issuer that could have a material effect on the issuers business, financial condition, or operations. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMARKET INFORMATION\nOur common stock is quoted on the OTCQB Market under the symbol NGTF.\nThe following table sets forth the range of high and low bid quotations for our common stock for each of the periods indicated as reported by OTCMarkets. These quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nThe last reported price was $0.0396 on October 12, 2023.\nPeriod Ending June 30, 2023 High Low\nSeptember 30, 2022 $ .21 .12\nDecember 31, 2022 .19 .0805\nMarch 31, 2023 .135 .0675\nJune 30, 2023 .0925 .0186\nPeriod Ending June 30, 2022:\nSeptember 30, 2021 $ .30 $ .215\nDecember 31, 2021 .255 .151\nMarch 31, 2022 .244 .15\nJune 30, 2022 .21 .131\nHOLDERS\nThe approximate number of holders of record of our common stock at October 12, 2023 was 270. The number of stockholders of record does not include thousands of beneficial owners of our common stock, whose shares are held in the names of various dealers, clearing agencies, banks, brokers and other fiduciaries.\nDIVIDEND POLICY\nNo dividends have ever been declared by the Board of Directors on our common stock. Our losses do not currently indicate the ability to pay any cash dividends, and we do not have the intention of paying cash dividends on our common stock in the foreseeable future.\nRECENT SALES OF UNREGISTERED SECURITIES\nDuring the fiscal year ending June 30, 2023, the Company issued (a) 6,550,000 shares of common stock in regards to the conversion of Series B Preferred Stock , (b) 532,853 shares of common stock for services rendered valued at $77,110,(c) 2,469,697 shares of its common stock as financing cost valued at $104,515, (d) an aggregate of 6,549,128 shares of its common stock for cashless exercise of 4,928,260 original issued stock purchase warrants, (e) an aggregate of 1,871,800 shares of common stock in conjunction with its Regulation A+ Offering for which net proceeds were received of $229,729, (f) 3,800,000 shares of common stock in exchange for the return of 10,869,566 returnable warrants, (g) 2,750,000 shares of its common stock in exchange for the return of 2,750,000 stock purchase warrants, (h) an aggregate of 5,750,000 shares of its common stock for cash exercise of 5,750,000 original issued stock purchase warrants. The Company received net proceeds of $276,066, and (i) 1,500,000 shares of common stock as consideration for convertible debt in the principal amount of $16,088 and in the accrued interest payable of $33,907, with a fair value of $91,500. These shares were issued in private transactions pursuant to Section 4(a)(2) of the Securities Act and/or in offerings under Regulation D, as transactions by an issuer not involving any public offering.\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS.\nAs of June 30, 2023, we had no compensation plans under which our equity securities were authorized for issuance.\nPENNY STOCK REGULATION\nShares of our common stock have been and will likely continue to be subject to rules adopted the SEC that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a price of less than $5.00 (other than securities registered on certain national securities exchanges or quoted on the NASDAQ system, provided that current price and volume information with respect to transactions in those securities is provided by the exchange or system). The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from those rules, deliver a standardized risk disclosure document prepared by the SEC, which contains the following:\n● a description of the nature and level of risk in the market for penny stocks in both public offerings and secondary trading;\n● a description of the brokers or dealers duties to the customer and of the rights and remedies available to the customer with respect to violation to such duties or other requirements of securities laws;\n● a brief, clear, narrative description of a dealer market, including bid and ask prices for penny stocks and the significance of the spread between the bid and ask price;\n● a toll-free telephone number for inquiries on disciplinary actions;\n● definitions of significant terms in the disclosure document or in the conduct of trading in penny stocks; and\n● such other information and is in such form (including language, type, size and format), as the SEC shall require by rule or regulation.\nPrior to effecting any transaction in penny stock, the broker-dealer also must provide the customer the following:\n● the bid and offer quotations for the penny stock;\n● the compensation of the broker-dealer and its salesperson in the transaction;\n● the number of shares to which such bid and ask prices apply, or other comparable information relating to the depth and liquidity of the market for such stock; and\n● monthly account statements showing the market value of each penny stock held in the customers account.\nIn addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from those rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written acknowledgment of the receipt of a risk disclosure statement, a written agreement to transactions involving penny stocks, and a signed and dated copy of a written suitability statement. These disclosure requirements may have the effect of reducing the trading activity in the secondary market for a stock that becomes subject to the penny stock rules. Holders of shares of our common stock may have difficulty selling those shares because our common stock will probably be subject to the penny stock rules. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATION\nThe following discussion and analysis of financial condition and results of operations is based upon, and should be read in conjunction with our audited financial statements and related notes thereto included elsewhere in this report.\nForward Looking Statements\nCertain information contained in this MD&A includes forward-looking statements. Statements which are not historical reflect our current expectations and projections about our future results, performance, liquidity, financial condition and results of operations, prospects and opportunities and are based upon information currently available to us and our management and their interpretation of what is believed to be significant factors affecting our existing and proposed business, including many assumptions regarding future events. In some cases, you can identify forward-looking statements by terminology such as may, will should, expect, intend, plan, anticipate, believe, estimate, predict, potential, continue, or similar terms, variations of such terms or the negative of such terms. These statements are only predictions and involve known and unknown risks, uncertainties, and other factors. Although forward- looking statements, and any assumptions upon which they are based, are made in good faith, and reflect our current judgment, actual results could differ materially from those anticipated in such statements. Actual results, performance, liquidity, financial condition and results of operations, prospects and opportunities could differ materially and perhaps substantially from those expressed in, or implied by, these forward- looking statements as a result of various risks, uncertainties and other factors, including those risks described in detail in the section of this Annual Report on Form 10-K entitled Risk Factors as well as elsewhere in this Annual Report on Form 10-K.\nIn light of these risks and uncertainties, and especially given the nature of our existing and proposed business, there can be no assurance that the forward-looking statements contained in this section and elsewhere in this Annual Report on Form 10-K will in fact occur. Potential investors should not place undue reliance on any forward- looking statements. Except as expressly required by the federal securities laws, there is no undertaking to publicly update or revise any forward-looking statements, whether as a result of new information, future events, changed circumstances or any other reason.\nOVERVIEW\nWhat you eat before bed matters.\nIn solving consumers nighttime snacking problem, Nightfood is pioneering the category of sleep-friendly nighttime snacking.\nRecent Sleep Foundation research indicates that 93% of Americans snack at night at least once a week, and that the average American adult snacks 3.9 times per week. That represents over 1 billion nighttime snack occasions weekly. The most popular choices are ice cream, cookies, chips, and candy. Recent research confirms such snacks, in addition to being generally unhealthy, can impair sleep, partly due to excess fat and sugar consumed before bed.\nNightfoods sleep-friendly snacks are formulated by sleep and nutrition experts to contain less of those sleep-disruptive ingredients, along with a focus on ingredients and nutrients that research suggests can support nighttime relaxation and better sleep quality.\nNightfood plans to pioneer the sleep-friendly nighttime snack category through direct-to-consumer commerce and distribution of our snacks in hotels across the United States. Management believes hotels have an obligation to help guests achieve better sleep, and one important way to do that is through the snacks hotels curate for sale in their grab-and-go lobby shops.\nManagements vision is for Nightfood snacks to be sold by every hotel that sells snacks for their guests. We believe national hotel distribution can lead to profitability, consumer adoption of the nighttime snack category, and a strategically defensible position from which category leadership can be maintained.\nOur snack products are manufactured under contract at third-party manufacturing facilities. We then sell these snacks direct-to-consumer and also sell wholesale to retailers and distributors.\nDEVELOPMENT PLANS\nThe Company plans to leverage direct-to-consumer sales and distribution in the lobby shops of the worlds leading hotel brands to grow revenue, grow brand awareness, and establish the sleep-friendly snack category we are pioneering. We plan to expand into mainstream retail, including supermarket distribution, when we have built a strong foundation of revenue and consumer awareness.\nOur ice cream pints are available for purchase in hundreds of hotel locations across the United States, including select locations of many of the largest hotel chains in the world. This includes chains such as Holiday Inn, Holiday Inn Express, Crowne Plaza, Homewood Suites, Hampton Inn, Embassy Suites, Hilton Garden Inn, Comfort Inn, Everhome Suites, Sonesta Simply Suites, Sonesta ES Suites, Sonesta Select, Hyatt House, Springhill Suites, Townplace Suites, Residence Inn, Courtyard by Marriott, and many more.\nWhile Nightfood may currently only be available in just one or a few locations of certain of these chains, we feel the breadth of our distribution reflects the appeal of our snack products across many segments of the hospitality industry. From select-service to full-service, from short-term to extended stay, we believe every hotel that sells snacks is a potential distribution point for Nightfood.\nIn September, 2022, we announced that independent industry sales data from Impulsify reflected our ice cream pints were selling well relative to more popular brands such as Haagen Dazs and Ben & Jerrys. In the subset of 30 hotels that sold only Nightfood and Haagen Dazs for which Impulsify sales scan data was available, across the six month period from July through December of 2022, Impulsify reports showed Nightfood captured approximately 38% of the total pint sales volume when head-to-head with Haagen Dazs, despite Nightfood carrying a slightly higher average selling price. We believe this sales data is a positive sign that our products can compete effectively in the hotel environment.\nOur plans call for the introduction of Nightfood sleep-friendly versions of many of the most popular nighttime snack formats. In addition to ice cream pints, this includes single-serve ice cream novelties, cookies, chips, candy, and nutrition bars. We believe having snacks in multiple formats will benefit the Company through increased trial, revenue, brand awareness, and category development.\nIn August, 2022, the first commercial production run of Nightfood Prime-Time Chocolate Chip cookies was completed. We have developed two additional flavors (Date Night Cherry Oat and Snoozerdoodle), which have not yet been commercially produced.\nDuring July and August of 2023, we initiated a direct-to-hotel sales initiative of 25 gram Nightfood Prime-Time Chocolate Chip cookies as a hotel guest check-in amenity. The initiative met with some success but was not self-sustaining and has been paused. We believe a significant opportunity can exist in this space. Once transitioned to the new manufacturing facility, we will revisit this opportunity. At the same time, were exploring opportunities to introduce Nightfood as an amenity at the hotel-brand level with some hotel chains. There are inherent distribution challenges with such initiatives that would need to be overcome, but we believe any hotel chain that is sufficiently motivated to provide sleep-friendly snacks for their guests could do so in partnership with our brand.\nManagement believes widespread distribution in the worlds largest and most trusted hotel chains could result in significant increases in gross sales and net revenue and lead to profitability. Doing business in the hotel vertical effectively eliminates three of the major line items that reduce and delay profitability for new food and beverage products in the supermarket vertical. These are slotting fees, advertising, and pricing promotions.\nIn addition to the revenue and contribution margin from the sales of the product in the hotel environment, Management believes hotel distribution can result in important secondary benefits. Consumers encountering and purchasing Nightfood snacks in a trusted and respected hotel outlet could be more likely to seek out Nightfood products online and in local supermarkets than consumers that have not had prior exposure to the brand.\nIn addition, it is believed that securing widespread hotel distribution would serve as a validation of the importance of sleep-friendly nutrition and the entire night snack category. We believe consumers will rightfully interpret the diligence of these leading hotel brands in providing sleep-friendly nutrition for their guests to be a validation of the core point of view of the Nightfood brand which is What you eat before bed matters.\nAs the brand pioneering the sleep-friendly snack category, we believe that anything which advances the overall adoption of the category by consumers is, by extension, beneficial to the Nightfood brand.\nINFLATION\nInflation can be expected to have an impact on our operating costs. Similar to many other industries, we have recently seen increases in the cost of certain ingredients and packaging materials. Such increases will either result in lower gross margins or necessitate an increase in our wholesale pricing. A prolonged period of inflation could cause a general economic downturn and negatively impact our results.\nSEASONALITY\nA certain amount of seasonality is expected related to distribution in hotels. U.S. hotel occupancy has a history of peaking in June and July, with occupancy rates approximately 10% above the average, it is possible that we will experience an increase in hotel sales related to that occupancy peak.\nAs an early-stage and growing brand, with a product mix that is expected to include a variety of snacks such as ice cream, cookies, chips, candy, and more, the full impact of seasonality on our business might not be fully understood for several additional annual cycles.\nCORONAVIRUS (COVID-19)\nThe outbreak of the novel coronavirus (COVID-19), including the measures to reduce its spread, and the impact on the economy, has still not been fully predicted.\nWe have experienced minimal issues with supply chain and logistics, except that there have been recent and significant increases in costs relating to freight and packaging. Order processing function has been normal to date, and our manufacturers have assured us that their operations are business as usual as of the time of this filing.\nIt is possible that the impact of the pandemic could make it more difficult in the future for the Company to access required growth capital, possibly rendering us unable to meet certain debts and expenses.\nIt is impossible to know what the future holds with regard to the virus, both for our company and in the broader sense. There are many uncertainties regarding the current coronavirus pandemic, and the Company is closely monitoring the impact of the pandemic on all aspects of its business, including how it will impact its customers, vendors, and business partners. It is difficult to know if the pandemic has materially impacted the results of operations, and we are unable to predict the impact that COVID-19 will have on our financial position and operating results due to numerous uncertainties. The Company expects to continue to assess the evolving impact of the COVID-19 pandemic and intends to make adjustments accordingly, if necessary.\nCRITICAL ACCOUNTING POLICIES\nOur discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses. On an ongoing basis, we evaluate our estimates, including those related to uncollectible receivables, inventory valuation, deferred compensation, fair valve of derivative liabilities and contingencies. We base our estimates on historical performance and on various other assumptions that we believe to be reasonable under the circumstances. These estimates allow us to make judgments about the carrying values of assets and liabilities that are not readily apparent from other sources.\nWe believe the following accounting policies are our critical accounting policies because they are important to the portrayal of our financial condition and results of operations, and they require critical management judgments and estimates about matters that may be uncertain. If actual results or events differ materially from those contemplated by us in making these estimates, our reported financial condition and results of operations for future periods could be materially affected.\nRevenue Recognition ● The Company generates its revenue by selling its nighttime snack products wholesale and direct to consumer.\n● All sources of revenue are recorded pursuant to FASB Topic 606 Revenue Recognition, to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. This includes a five-step framework that requires an entity to: (i) identify the contract(s) with a customer, (ii) identify the performance obligations in the contract, (iii) determine the transaction price, (iv) allocate the transaction price to the performance obligations in the contract, and (v) recognize revenue when the entity satisfies a performance obligation. In addition, this revenue generation requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers.\n● For accounts within the supermarket space, the Company frequently offers sales discounts and promotions to customers through various programs such as rebates, temporary price reductions, product coupons, and other trade activities. This is standard practice for consumer products in the competitive and price-sensitive supermarket space. The Company records these activities as a reduction of gross sales as part of the calculation to arrive at reported net revenue.\n● The Company incurs costs associated with product distribution, such as freight and handling costs. The Company has elected to treat these costs as fulfillment activities and recognizes these costs at the same time that it recognizes the underlying product revenue. As this policy election is in line with the Companys previous accounting practices, the treatment of shipping and handling activities under FASB Topic 606 did not have any impact on the Companys results of operations, financial condition and/or financial statement disclosures.\nThe adoption of ASC 606 did not result in a change to the accounting for any of the Companys revenue streams that are within the scope of the amendments. The Companys services that fall within the scope of ASC 606 are recognized as revenue as the Company satisfies its obligation to the customer.\nRESULTS OF OPERATIONS\nFiscal Year ended June 30, 2023 Compared to Fiscal Year ended June 30, 2022\nRevenue\nDuring the year ended June 30, 2023, we had Net Revenues of $133,456 on Gross Sales of $182,259 compared to the year ended June 30, 2022 when we had Net Revenues of $443,538 on Gross Sales of $614,125. Gross Sales decreased by 70.4% and Net Revenue decreased by 70% year over year, as a result of our ice cream being rotated out of distribution in Walmart locations and other supermarkets, as we simultaneously pivoted to the higher-margin hospitality vertical where we believe our brand and unique sleep-friendly positioning can deliver a long-term competitive advantage.\nNet Revenues are reported as Gross Sales less Slotting Fees (described below) and other contra-revenue accounts such as those related to manufacturers coupons, in-store specials (such as 2 pints for $8), consumer rebate programs, and more.\nSlotting fees are typically one-time fees customarily charged to brands by supermarkets and distributors to add a new product line into their product assortment. For the year ended June 30, 2023, no Gross Sales were cancelled out due to slotting arrangements with retailers and distributors compared to $22,500 for the year ended June 30, 2022.\nIn situations where the Company agrees to pay slotting and promotional fees to accounts (such as to supermarkets and distributors), the Gross Sales to those customers are reduced on the income statement by these amounts (along with other items, such as early payment discounts), dollar for dollar, to arrive at a Net Revenue number. So, when these customers order product to put on their shelves and sell to consumers, that revenue does not get booked even though the product is moving through the supply chain.\nThese dollar for dollar reductions continue, on a customer-by-customer basis, for any and all sales to each slotting account until the Gross Sales to these accounts exceed the total of these commitments, at which time the remaining Gross Sales amounts are reported as Net Revenue.\nThese slotting fees and other promotional expenses do not appear on the income statement as an expense. Rather, they are applied against Gross Sales, resulting in Net Revenue, as shown below. The netting of Gross Sales against slotting and sales discounts, as described and shown below, results in the Net Revenue number at the top of the income statement. This is not a reflection of the amount of product sold by the Company and shipped to customers, but rather a function of the way certain sales are accounted for when those sales are made to customers who are charging slotting fees. With a focus on the hospitality vertical, we expect slotting expenses and other revenue reductions to decrease significantly as a percentage of Gross Sales.\nThe following tables summarize Gross Sales and Net Revenue for the years ended June 30, 2023 and 2022.\nYear Ended June 30,\nGross sales $ 182,856 $ 614,125\nLess:\nSlotting fees $ 0 $ (22,500 )\nSales discounts and other reductions (49,374 ) (148,087 )\nNet Revenues $ 133,482 $ 443,538\nOperating Expenses\nOur operating expenses for the year ended June 30, 2023 were $1,943,654, compared to $2,372,873 for the year ended June 30, 2022. The decrease in operating expenses is due largely to decreases in Cost of product sold to $279,277 for the year ended June 30, 2023 compared to $486,163, for the year ended June 30, 2022 along with a decrease in advertising and promotional expenses to $166,656 for the year ended June 30, 2023 compared to $596,331, for the year ended June 30, 2022 The decrease in cost of product sold is due to a decrease in pints sold which is offset to some extent by an increase in per-unit freight costs as a proportion of gross sales due to increases in fuel prices. The decrease relating to Advertising and Promotional expenses is a result of reduced supermarket and Walmart distribution.\nSelling, general and administrative expenses increased to $542,803 for the year ending June 30, 2023 compared to $492,713 for the year ending June 30, 2022. This includes items such as web hosting, web marketing services, freight, warehousing, shipping, product liability insurance, research & development of new products. The increase was largely related to an increase in freight and shipping charges period over period Professional fees increased from $797,666 for the year ending June 30, 2022, to $954,918 for the year ending June 30, 2023. This includes legal fees, marketing consulting, accounting and auditor fees, and other paid consultants. The increase is largely related to financing activities during the year ending June 30, 2023 and the fees that tend to accompany such transactions, a significant portion of which do not involve cash expenditures, but are tied to the valuation of shares and warrants.\nWe recorded a loss on operations in each of the years ended June 30, 2023 and 2022 of $1,810,198 and $1,929,335, respectively.\nOther expenses recorded in the fiscal years ended June 30, 2023 and 2022 totaled $3,939,524 and $593,942 respectively. During the year ended June 30, 2023 we recorded amortization of debt discount of $1,265,893, interest expenses on debt of $170,505, financing costs of $2,141,626 and a loss on extinguishment of certain convertible notes of $361,500. During the year ended June 30, 2022, we recorded amortization of debt discount of $275,423, interest expenses on debt of $48,309 and financing costs of $270,210.\nA significant portion of these amounts recorded in both years stems from the accounting treatment applied to financing activities.\nNet Loss\nFor the year ended June 30, 2023, we had a net loss of $5,749,722, compared to the year ended June 30, 2022 when we had a net loss of $2,523,277. A significant portion of the losses recorded in both years stems from the accounting treatment applied to financing activities, and the majority of the increase in net loss is related to amortization of debt discount and interest expenses.\nDeemed Dividend\nThe Company has never declared dividends, however as set out below, during the fiscal year ended June 30, 2022 and 2021, upon issuance of a total of 335 and 4,665 shares of B Preferred, respectively, the Company recorded a deemed dividend as a result of beneficial conversion feature associated with the transaction.\nIn connection with certain conversion terms provided for in the designation of the B Preferred, pursuant to which each share of B Preferred is convertible into 5,000 shares of common stock and 5,000 warrants, the Company recognized a beneficial conversion feature upon the conclusion of the transaction in the amount of $4,431,387 through June 30, 2022. The beneficial conversion feature was treated as a deemed dividend, and fully amortized on the transaction date due to the fact that the issuance of the B Preferred was classified as equity.\nDuring the year ended June 30, 2023 the Company recorded an additional deemed dividend of $1,136,946 in relation to the B Preferred stock and downward price adjustments to certain warrants.\nCustomers\nOur customers consist primarily of distributors that sell snack product to hotels and supermarkets. In FY 2023, we had one customer that accounted for 42% of our Gross Sales. One other customer accounted for 29% and two others each accounted for between 7% and 10%. In FY 2022, we had one customer that accounted for over 20% of our Gross Sales. Two other customers each accounted for 16% and four others each accounted for between 8.5% and 9.9%.\nVendors\nDuring the year ended June 30, 2023 three vendors accounted for approximately 72% of our costs of goods sold. In the year ended June 30, 2022, four vendors accounted for 92% of our costs of goods sold, one of which individually accounted for 48% of all purchases.\nLIQUIDITY AND CAPITAL RESOURCES\nAs of June 30, 2023, we had cash on hand of $44,187, accounts receivable of $33,396, inventory value of $276,202 and other current assets of $92,726. As of June 30, 2022, we had cash on hand of $280,877, accounts receivable of $93,674, inventory value of $331,531 and other current assets of $137,797. The decrease in cash is the result of us funding ongoing operations. The decrease in accounts receivable is due to a decrease in overall sales activity.\nSince June 30, 2023, we raised $103,700 in net proceeds from the sale of promissory notes and warrants to two institutional investors.\nAs of June 30, 2023, we had accounts payable of $604,516 compared to $234,152 on June 30, 2022.The increase to accounts payable is a result of a reduction to available cash to settle expenses as they come due. Accounts payable as of June 30, 2023 includes $120,883 of aged balances incurred in prior years that we believe will be written off during fiscal 2024.\nSince our inception, we have sustained operating losses. During the year ended June 30, 2023, we incurred a net loss of $5,749,722 and had total stockholders deficit of $1,751,600.\nThe Company has limited available cash resources and we do not believe our cash on hand will be sufficient to fund our operations and growth throughout Fiscal 2024 or adequate to satisfy our immediate or ongoing working capital needs. The Company is continuing to raise capital through the sale of its securities, including common stock, preferred stock, and debt (including convertible debt) to finance the Companys operations, of which it can give no assurance of success. In addition, we will receive the proceeds from our outstanding warrants as, if and when such warrants are exercised for cash.\nIf we are unable to raise cash through the sale of our securities, we may be required to severely restrict or cease our operations.\nEven if the Company is successful in raising additional funds, the Company cannot give any assurance that it will, in the future, be able to achieve a level of profitability from the sale of its products to sustain its operations. These conditions raise substantial doubt about the Companys ability to continue as a going concern. The accompanying financial statements do not include any adjustments to reflect the possible future effects on recoverability and reclassification of assets or the amounts and classification of liabilities that may result from the outcome of this uncertainty.\nFrom our inception in January 2010 through June 30, 2023, we have generated an accumulated deficit of approximately $34,988,126. This accumulated deficit is not debt, and there is no obligation or liability associated with it. An accumulated deficit reflects a negative balance of retained earnings and an accumulation of historical losses over time, related to both operations and financing activities. It is not unusual for growing companies to have significant accumulated deficit, even after turning profitable. Many large, fast growing, and successful companies have reported accumulated deficits in recent years, such as Warby Parker, The Honest Company, Beyond Meat, Roblox, Robinhood, Sweetgreen, Oatly, Rivian, Celsius Holdings, Chobani, and Tesla. In our case, like many of these others, an accumulated deficit is a function of losses sustained over time, along with the costs associated with raising operating capital.\nAssuming we raise additional funds and continue operations, it is expected we may incur additional operating losses during the course of Fiscal 2024 and possibly thereafter. We plan to continue to pay or satisfy existing obligation and commitments and finance our operations, as we have in the past, primarily through the sale of our securities and other forms of external financing until such time that we are able to generate sufficient funds from the sale of our products to finance our operations, of which we can give no assurance.\nWe anticipate deriving additional revenue from product sales and new distribution arrangements in Fiscal 2024, but we cannot at this time quantify the amount.\nCASH FLOWS\nDuring the year ended June 30, 2023, net cash used in operating activities totaled $1,173,157, compared to $2,070,030 for the year ended June 30, 2022. This decrease is due largely to a decrease in sales and related operating expenses.\nDuring each of the fiscal years ended June 30, 2023 and 2022, there was net cash provided by investing activities of $0.\nDuring the year ended June 30, 2023, net cash aggregating $936,467 was provided by financing activities, which represents net proceeds of $1,805,800 from the issuance of convertible debt, an offset of $1,375,128 related to the repayment of convertible debt from the year ended June 30, 2022, $229,729 in net proceeds from the sale of Units related to our Regulation A+ offering, and $276,066 from the proceeds of warrants exercised for cash. During the year ended June 30, 2022, net cash aggregating $1,309,008 was provided by financing activities, which represents net proceeds of $984,808 from the issuance of convertible debt, $308,200 from the sale of Series B Preferred Shares, and $16,000 from the proceeds of warrants exercised. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements required by Item 8 are presented in the following order:\nReport of Independent Registered Public Accounting Firm (Gries - PCAOB ID: 6778)\nConsolidated Balance Sheets as June 30, 2023 and 2022\nConsolidated Statements of Operations for years ended June 30, 2023 and 2022\nConsolidated Statements of Changes in Stockholders Equity (Deficit) for years ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for years ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nNightfood Holdings, Inc.\nConsolidated Financial Statements\nFor the years ended June 30, 2023 and 2022\nGries & Associates, LLC\nCertified Public Accountants\n501 S. Cherry Street, Suite 1100\nDenver, Colorado 80246\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nNightfood Holdings, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheet of Nightfood Holdings, Inc. (the Company) as of June 30, 2023 and June 30, 2022, and the related statement of operations, stockholders deficit and cash flows for the period then ended and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and June 30, 2022, and the results of its operations and its cash flows for each of the period then ended in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion\n.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in note 3 to the financial statements, the Company has incurred losses since inception of $34,988,126 and a net loss of $5,749,722. These factors create an uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nEmphasis of Matters-Risks and Uncertainties\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and financial markets of many countries, including the geographical area in which the Company plans to operate.\nWe have served as the Companys auditor since 2022.\nDenver, Colorado\nOctober 13, 2023\nPCAOB ID 6778\nblaze@griesandassociates.com\n400 South Colorado Blvd, Suite 870, Denver, Colorado\n(O)720-464-2875 (M)773-255-5631 (F)720-222-5846\nNightfood Holdings, Inc.\nCONSOLIDATED BALANCE SHEETS\nJune 30, June 30,\nASSETS\nCurrent assets:\nCash $ 44,187 $ 280,877\nAccounts receivable (net of allowance of $0 and $0, respectively) 33,396 93,674\nInventory 276,202 331,531\nOther current asset 92,726 137,797\nTotal current assets 446,511 843,879\nTotal assets $ 446,511 $ 843,879\nLIABILITIES AND STOCKHOLDERS EQUITY (DEFICIT)\nCurrent liabilities:\nAccounts payable and accrued liabilities $ 604,516 $ 234,152\nAccounts payable and accrued liabilities - related party 101,876 -\nConvertible notes payable - net of discounts 1,491,719 344,151\nTotal current liabilities 2,198,111 578,303\nCommitments and contingencies -\n-\nStockholders equity (deficit):\nSeries A Stock, $0.001 par value, 1,000,000 shares authorized 1,000 issued and outstanding as of June 30, 2023 and June 30, 2022, respectively\nSeries B Stock, $0.001 par value, 5,000 shares authorized 1,950 and 3,260 issued and outstanding as of June 30, 2023 and June 30, 2022, respectively\nCommon stock, $0.001 par value, 200,000,000 shares authorized 123,587,968 and 91,814,484 issued and outstanding as of June 30, 2023 and 2022, respectively 123,588 91,814\nAdditional paid in capital 33,112,935 28,275,216\nAccumulated deficit (34,988,126 ) (28,101,458 )\nTotal Stockholders Equity (Deficit) (1,751,600 ) 265,576\nTotal Liabilities and Stockholders Equity (Deficit) $ 446,511 $ 843,879\nThe accompanying notes are an integral part of these consolidated financial statements\nNightfood Holdings, Inc.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the\nYear Ended For the\nYear Ended\nJune 30,\nJune 30,\nRevenues, net of slotting and promotion $ 133,456 $ 443,538\nOperating expenses\nCost of product sold 279,277 486,163\nAdvertising and promotional 166,656 596,331\nSelling, general and administrative 542,803 492,713\nProfessional fees 954,918 797,666\nTotal operating expenses 1,943,654 2,372,873\nLoss from operations 1,810,198 1,929,335\nOther (income) and expenses\nInterest expense - Amortization of debt discount 1,265,893 275,423\nInterest expense - debt 170,505 48,309\nInterest expense - financing cost 2,141,626 270,210\nLoss (Gain) on debt extinguishment 361,500 -\nTotal other (income) and expenses 3,939,524 593,942\nProvision for income tax -\n-\nNet loss $ (5,749,722 ) $ (2,523,277 )\nDeemed dividend on Series B Stock 1,136,946 381,310\nNet loss attributable to common stockholders $ (6,886,668 ) $ (2,904,587 )\nBasic and diluted net loss per common share\n$ (0.07 ) $ (0.03 )\nWeighted average shares of capital outstanding - basic and diluted\n103,889,833 87,521,595\nThe accompanying notes are an integral part of these consolidated financial statements\nNightfood Holdings, Inc.\nSTATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nYears ended June 30, 2023 and 2022\nCommon Stock Preferred\nStock A Preferred\nStock B Additional\nTotal\nShares Par\nValue Shares Par\nValue Shares Par\nValue Paid in\nCapital Accumulated\nDeficit Stockholders\nEquity\nBalance, June 30, 2021 80,707,467 $ 80,707 1,000 $ 1 4,665 $ 5 $ 26,226,159 $ (25,196,871 ) $ 1,110,001\nCommon stock issued for services 848,325\n213,277\n214,125\nCommon stock from conversion 8,700,000 8,700\n(1,740 ) (2 ) (8,698 )\n-\nPreferred B issued from private placement\n-\n335,000\n335,000\nPreferred B issued - financing cost\n(26,800 )\n(26,800 )\nUnissued shares previously allocated for services (41,308 ) (41 )\n-\nDiscount on issuance of convertible notes\n931,272\n931,272\nWarrants issued as financing cost\n170,210\n170,210\nDeemed dividends associated with Preferred B\n289,935 (289,935 ) -\nDeemed dividends associated with warrants related dilutive adjustments\n91,375 (91,375 ) -\nIssuance of warrants\n39,045\n39,045\nExercise of warrants 1,600,000 1,600\n14,400\n16,000\nNet loss\n(2,523,277 ) (2,523,277 )\nBalance, June 30, 2022 91,814,484 $ 91,814 1,000 $ 1 3,260 $ 3 $ 28,275,216 $ (28,101,458 ) $ 265,576\nCommon stock issued for services 532,859\n76,577\n77,110\nUnits issued under Regulation A Offering 1,871,800 1,872\n227,857\n229,729\nCommon stock from conversion 6,550,000 6,550\n(1,310 ) (1 ) (6,549 )\n-\nCommon stock issued as financing cost 2,469,697 2,470\n102,045\n104,515\nWarrants exercise 12,299,128 12,299\n263,767\n276,066\nCommon stock issued under Forbearance and Exchange Agreement 3,800,000 3,800\n338,200\n342,000\nWarrants exchange to common stock 2,750,000 2,750\n(2,750 )\n-\nCommon stock issued under notice of conversion 1,500,000 1,500\n90,000\n91,500\nIssuance of warrants\n62,850\n62,850\nWarrants issued associated with Promissory Notes\n603,689\n603,689\nWarrants issued as financing cost\n1,823,450\n1,823,450\nWarrants dilutive adjustment as consulting fees\n185,669\n185,669\nWarrants dilutive adjustment as consulting fees\n(64,032 )\n(64,032 )\nDeemed dividends associated with warrants related dilutive adjustments\n1,136,946 (1,136,946 ) -\nNet loss\n(5,749,722 ) (5,749,722 )\nBalance, June 30, 2023 123,587,968 $ 123,588 1,000 $ 1 1,950 $ 2 $ 33,112,935 $ (34,988,126 ) $ (1,751,600 )\nThe accompanying notes are an integral part of these consolidated financial statements\nNightfood Holdings, Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years ended\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (5,749,722 ) $ (2,523,277 )\nAdjustments to reconcile net loss to net cash used in operations activities:\nStock issued for services 77,110 214,125\nStock issued for financing cost 104,515\nAmortization of debt discount and deferred financing fees 1,265,893 275,423\nWarrants issued for services 62,850 39,045\nWarrants and returnable warrants issued for financing 1,823,450 170,210\nFinancing cost due to conversion price change (64,033 )\nConsulting due to conversion price change 185,669\nLoss on debt extinguishment upon note conversion, net 361,500 -\nNon cash expense 92,787 15,192\nChange in operating assets and liabilities:\nAccounts receivable 49,867 15,915\nInventories 56,497 56,205\nOther current assets 42,071 (104,317 )\nAccounts payable and accrued liabilities 413,513 (228,551 )\nAccounts payable and accrued liabilities, related parties 64,876 -\nNet cash used in operating activities (1,213,157 ) (2,070,030 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nNet cash provided by investing activities -\n-\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds of loan from related party $ 40,000\nProceeds from the sale of preferred stock B - net -\n308,200\nProceeds from the sale of Reg A 229,729\nProceeds from the issuance of debt-net 1,805,800 984,808\nProceeds from exercise warrants 276,066 16,000\nRepayment of convertible debt (1,375,128 ) -\nNet cash provided by financing activities 976,467 1,309,008\nNET INCREASE IN CASH AND CASH EQUIVALENTS (236,690 ) (761,022 )\nCash and cash equivalents, beginning of year 280,877 1,041,899\nCash and cash equivalents, end of year $ 44,187 $ 280,877\nSupplemental Disclosure of Cash Flow Information:\nCash Paid For:\nInterest $ 39,452 $ -\nIncome taxes $\n$ -\nSummary of Non-Cash Investing and Financing Information:\nDebt and warrants discount accounted on convertible notes $ 864,713 $ 931,272\nCommon stock issued for preferred stock conversion $ 6,550 $ 7,950\nDeemed dividend associated with preferred stock B and warrants dilutive adjustment $ 1,136,946 $ 381,310\nStock issued for conversion of debt $ 16,088 $ -\nStock issued for interest payable $ 33,907\nThe accompanying notes are an integral part of these consolidated financial statements\nNightfood Holdings, Inc.\nNOTES TO UNAUDITED CONDENSED CONSOLIDATED FINANCIAL STATEMENTS\n1. Description of Business\nNightfood Holdings, Inc. (we, us, the Company or Nightfood) is a Nevada corporation organized on October 16, 2013 to acquire all of the issued and outstanding shares of Nightfood, Inc., a New York corporation from its sole shareholder, Sean Folkson. All of our operations are conducted through its subsidiary Nightfood, Inc. We are also the sole shareholder of MJ Munchies, Inc., which owns certain intellectual property but does not have any operations as of the period covered by these financial statements.\nOur corporate address is 520 White Plains Road - Suite 500, Tarrytown, New York 10591 and our telephone number is 888-888-6444. We maintain a web site at www.nightfood.com, along with many additional web properties. Any information that may appear on our web site should not be deemed to be a part of this report.\nThe Companys fiscal year end is June 30.\n2. Summary of Significant Accounting Policies\nManagement is responsible for the fair presentation of the Companys financial statements, prepared in accordance with U.S. generally accepted accounting principles (GAAP).\nThe audited consolidated financial statements include the accounts of Nightfood Holdings, Inc. and its wholly owned subsidiaries, NightFood, Inc. and MJ Munchies, Inc. The Company consolidates all majority-owned and controlled subsidiaries in accordance with applicable standards. All material intercompany accounts and balances have been eliminated in consolidation.\nUse of Estimates\n● The preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. Estimates are used in the determination of depreciation and amortization, the valuation for non-cash issuances of common stock, and the website, income taxes and contingencies, valuing convertible preferred stock for a beneficial conversion feature (BCF) and warrants among others.\nCash and Cash Equivalents\n● The Company classifies as cash and cash equivalents amounts on deposit in the banks and cash temporarily in various instruments with original maturities of three months or less at the time of purchase. The Company places its cash and cash equivalents on deposit with financial institutions in the United States. The Federal Deposit Insurance Corporation (FDIC) covers $250,000 for substantially all depository accounts. The Company from time to time may have amounts on deposit in excess of the insured limits.\nFair Value of Financial Instruments\n● Statement of financial accounting standard FASB Topic 820, Disclosures about Fair Value of Financial Instruments, requires that the Company disclose estimated fair values of financial instruments. The carrying amounts reported in the statements of financial position for assets and liabilities qualifying as financial instruments are a reasonable estimate of fair value.\nInventories\n● Inventories consisting of packaged food items and supplies are stated at the lower of cost (FIFO) or net realizable value, including provisions for spoilage commensurate with known or estimated exposures which are recorded as a charge to cost of sales during the period spoilage is incurred. The Company has no minimum purchase commitments with its vendors.\nAdvertising Costs\n● Advertising costs are expensed when incurred and are included in advertising and promotional expense in the accompanying statements of operations. Although not traditionally thought of by many as advertising costs, the Company includes expenses related to graphic design work, package design, website design, domain names, and product samples in the category of advertising costs. The Company recorded advertising costs of $166,656 and $596,331 for the fiscal years ended June 30, 2023 and 2022, respectively.\nIncome Taxes\n● The Company has not generated any taxable income, and, therefore, no provision for income taxes has been provided. Deferred income taxes are reported for timing differences between items of income or expense reported in the financial statements and those reported for income tax purposes in accordance with FASB Topic 740, Accounting for Income Taxes, which requires the use of the asset/liability method of accounting for income taxes. Deferred income taxes and tax benefits are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases, and for tax loss and credit carry-forwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The Company provides for deferred taxes for the estimated future tax effects attributable to temporary differences and carry-forwards when realization is more likely than not.\n● A valuation allowance has been recorded to fully offset the deferred tax asset even though the Company believes it is more likely than not that the assets will be utilized\n● The Companys effective tax rate differs from the statutory rates associated with taxing jurisdictions because of permanent and temporary timing differences as well as a valuation allowance.\nRevenue Recognition\n● The Company generates its revenue by selling its nighttime snack products wholesale to retailers and wholesalers. All sources of revenue are recorded pursuant to FASB Topic 606 Revenue Recognition, to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. This includes a five-step framework that requires an entity to: (i) identify the contract(s) with a customer, (ii) identify the performance obligations in the contract, (iii) determine the transaction price, (iv) allocate the transaction price to the performance obligations in the contract, and (v) recognize revenue when the entity satisfies a performance obligation. In addition, this revenue generation requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers.\n● The Company revenue from contracts with customers provides that an entity should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services.\n● The Company incurs costs associated with product distribution, such as freight and handling costs. The Company has elected to treat these costs as fulfillment activities and recognizes these costs at the same time that it recognizes the underlying product revenue. As this policy election is in line with the Companys previous accounting practices, the treatment of shipping and handling activities under FASB Topic 606 did not have any impact on the Companys results of operations, financial condition and/or financial statement disclosures.\n● The adoption of ASC 606 did not result in a change to the accounting for any of the Companys revenue streams that are within the scope of the amendments. The Companys services that fall within the scope of ASC 606 are recognized as revenue as the Company satisfies its obligation to the customer.\n● In May 2014, the FASB issued ASU 2014-09, Revenue from Contracts with Customers, which updates revenue recognition guidance relating to contracts with customers. This standard states that an entity should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. This standard is effective for annual reporting periods, and interim periods therein, beginning after July 1, 2018. The Company adopted ASU 2014-09 and its related amendments (collectively known as ASC 606) during the first quarter of fiscal 2019 using the full retrospective method.\n● Management reviewed ASC 606-10-32-25 which states Consideration payable to a customer includes cash amounts that an entity pays, or expects to pay, to the customer (or to other parties that purchase the entitys goods or services from the customer). Consideration payable to a customer also includes credit or other items (for example, a coupon or voucher) that can be applied against amounts owed to the entity (or to other parties that purchase the entitys goods or services from the customer). An entity shall account for consideration payable to a customer as a reduction of the transaction price and, therefore, of revenue unless the payment to the customer is in exchange for a distinct good or service (as described in paragraphs 606-10-25-18 through 25-22) that the customer transfers to the entity. If the consideration payable to a customer includes a variable amount, an entity shall estimate the transaction price (including assessing whether the estimate of variable consideration is constrained) in accordance with paragraphs 606-10-32-5 through 32-13.\n● If the consideration payable to a customer is a payment for a distinct good service, then in accordance with ASC 606-10-32-26, the entity should account for it the same way that it accounts for other purchases from suppliers (expense). Further, if the amount of consideration payable to the customer exceeds the fair value of the distinct good or service that the entity receives from the customer, then the entity shall account for such an excess as a reduction of the transaction price. If the entity cannot reasonably estimate the fair value of the good or service received from the customer, it shall account for all of the consideration payable to the customer as a reduction of the transaction price.\n● Under ASC 606-10-32-27, if the consideration payable to a customer is accounted for as a reduction of the transaction price, an entity shall recognize the reduction of revenue when (or as) the later of either of the following events occurs:\na) The entity recognizes revenue for the transfer of the related goods or services to the customer.\nb) The entity pays or promises to pay the consideration (even if the payment is conditional on a future event). That promise might be implied by the entitys customary business practices.\n● Management reviewed each arrangement to determine if each fee paid is for a distinct good or service and should be expensed as incurred or if the Company should recognize the payment as a reduction of revenue.\n● The Company recognizes revenue upon shipment based on meeting the transfer of control criteria. The Company has made a policy election to treat shipping and handling as costs to fulfill the contract, and as a result, any fees received from customers are included in the transaction price allocated to the performance obligation of providing goods with a corresponding amount accrued within cost of sales for amounts paid to applicable carriers.\nConcentration of Credit Risk\n● Financial instruments that potentially subject the Company to concentrations of credit risk consist principally of cash deposits at financial institutions. At various times during the year, the Company may exceed the federally insured limits. To mitigate this risk, the Company places its cash deposits only with high credit quality institutions. Management believes the risk of loss is minimal. At June 30, 2023 and June 30, 2022, the Company did not have any uninsured cash deposits.\nBeneficial Conversion Feature\n● For conventional convertible debt where the rate of conversion is below market value, the Company records any BCF intrinsic value as additional paid in capital and related debt discount.\n● When the Company records a BCF, the relative fair value of the BCF is recorded as a debt discount against the face amount of the respective debt instrument. The discount is amortized over the life of the debt. If a conversion of the underlying debt occurs, a proportionate share of the unamortized amounts is immediately expensed.\nBeneficial Conversion Feature - Series B Preferred Stock (deemed dividend):\nEach share of the Companys Series B Preferred Stock, par value $0.001 per share (the B Preferred or B Preferred Stock) has a liquidation preference of $1,000 and has no voting rights except as to matters pertaining to the rights and privileges of the B Preferred. Each share of B Preferred is convertible at the option of the holder thereof into (i) 5,000 shares of the Registrants common stock (one share for each $0.20 of liquidation preference) (the Conversion Shares) and (ii) 5,000 common stock purchase warrants, expiring April 16, 2026 (the Warrants). The Warrants carried an initial exercise price of $0.30 per share. Subsequent financing events and debt extinguishment resulted in adjustments to the exercise price of all warrants created from conversion of B Preferred from $0.30 per share to approximately $0.1389 per share through June 30, 2023. The exercise price of these warrants can continue to adjust as the result of subsequent financing events and stock transactions. These adjustments can result in an exercise price that is either higher, or lower, than the price as of June 30, 2023.\nBased on the guidance in ASC 470-20-20, on issuance date the Company determined that a BCF existed, as the effective conversion price for the B Preferred at issuance was less than the fair value of the common stock which the shares of B Preferred are convertible into. A BCF feature based on the intrinsic value of the date of issuances for the B Preferred through June 30, 2022 was approximately $4.4 million. During the year ended June 30, 2023 the Company recorded an additional deemed dividend of approximately $1.1 million in relation to the B Preferred stock and downward price adjustments to certain warrants.\nDebt Issue Costs\n● The Company may pay debt issue costs in connection with raising funds through the issuance of debt whether convertible or not or with other consideration. These costs are recorded as debt discounts and are amortized over the life of the debt to the statement of operations.\nEquity Issuance Costs\n● The Company accounts for costs related to the issuance of equity as a charge to Paid in Capital and records the equity transaction net of issuance costs.\nOriginal Issue Discount\n● If debt is issued with an original issue discount, the original issue discount is recorded to debt discount, reducing the face amount of the note and is amortized over the life of the debt to the statement of operations as interest expense. If a conversion of the underlying debt occurs, a proportionate share of the unamortized amounts is immediately expensed.\nStock Settled Debt\n● In certain instances, the Company will issue convertible notes which contain a provision in which the price of the conversion feature is priced at a fixed discount to the trading price of the Companys common shares as traded in the over-the-counter market. In these instances, the Company records a liability, in addition to the principal amount of the convertible note, as stock-settled debt for the fixed value transferred to the convertible note holder from the fixed discount conversion feature.\nStock-Based Compensation\n● The Company accounts for share-based awards issued to employees in accordance with FASB ASC 718. Accordingly, employee share-based payment compensation is measured at the grant date, based on the fair value of the award, and is recognized as an expense over the requisite service period. Additionally, share-based awards to non-employees are expensed over the period in which the related services are rendered at their fair value. The Company applies ASC 718, Equity Based Payments to Non-Employees, with respect to options and warrants issued to non-employees.\nCustomer Concentration\n● In FY 2023, we had one customer that accounted for 42% of our Gross Sales. One other customer accounted for 29% and two others each accounted for between 7% and 10%. In FY 2022, we had one customer that accounted for over 20% of our Gross Sales. Two other customers each accounted for 16% and four others each accounted for between 8.5% and 9.9%\nVendor Concentration\n● During the year ended June 30, 2023 three vendors accounted for approximately 72% of our costs of goods sold. In the year ended June 30, 2022, four vendors accounted for 92% of our costs of goods sold, one of which individually accounted for 48% of all purchases.\nReceivables Concentration\n● As of June 30, 2023, the Company had receivables due from nine customers, one of who accounted for over 56% of the outstanding balance. Three of the others each accounted for between 10% and 14% of the outstanding balance. As of June 30, 2022, the Company had receivables due from six customers, one of who accounted for over 59% of the outstanding balance. One of the remaining five accounted for 13.5% of the outstanding balance and one accounted for 11% of the outstanding balance.\nIncome/Loss Per Share\n● In accordance with ASC Topic 260 - Earnings Per Share, the basic loss per common share is computed by dividing net loss available to common stockholders by the weighted average number of common stock outstanding. Diluted loss per common share is computed similar to basic loss per common share except that the denominator is increased to include the number of additional shares of common stock that would have been outstanding if the potential common stock had been issued and if the additional shares of common stock were dilutive. Potential common stock consists of the incremental common stock issuable upon convertible notes, stock options and warrants, and classes of shares with conversion features. The computation of basic loss per share for the fiscal years ended June 30, 2023 and 2022 excludes potentially dilutive securities because their inclusion would be antidilutive. As a result, the computations of net loss per share for each period presented is the same for both basic and fully diluted losses per share.\nReclassification\n● The Company may make certain reclassifications to prior period amounts to conform with the current years presentation. Such reclassifications would not have a material effect on its consolidated statement of financial position, results of operations or cash flows.\nRecent Accounting Pronouncements\n● In August 2020, the FASB issued ASU 2020-06 to simplify the current guidance for convertible instruments and the derivatives scope exception for contracts in an entitys own equity. Additionally, the amendments affect the diluted EPS calculation for instruments that may be settled in cash or shares and for convertible instruments. The update also provides for expanded disclosure requirements to increase transparency. For SEC filers, excluding smaller reporting companies, this update is effective for fiscal years beginning after December 15, 2022 including interim periods within those fiscal years. The adoption of this guidance does not materially impact our financial statements and related disclosures.\n● The Company has implemented all new accounting pronouncements that are in effect and that may impact its financial statements and does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations.\n3. Going Concern\n● The Companys financial statements are prepared using generally accepted accounting principles, which contemplate the realization of assets and liquidation of liabilities in the normal course of business. Because the business is new and has limited operating history and relatively few sales, no certainty of continuation can be stated.\n● The accompanying consolidated financial statements have been prepared assuming the Company will continue as a going concern. For the fiscal year ended June 30, 2023, the Company had an operating and net loss of $5,749,722 and cash flow used in operations of $1,173,157 and an accumulated deficit of $34,988,126.\n●\nThe Company has limited available cash resources and we do not believe our cash on hand will be sufficient to fund our operations and growth throughout Fiscal 2024 or adequate to satisfy our immediate or ongoing working capital needs.\nThe Company is continuing to seek to raise capital through the sales of its common stock, preferred stock and/or convertible notes, as well as potentially the exercise of outstanding warrants, to finance the Companys operations, of which it can give no assurance of success. Management has devoted a significant amount of time to the raising of capital from additional debt and equity financing. However, the Companys ability to continue as a going concern is dependent upon raising additional funds through debt and equity financing and generating revenue.\n● Because the Company has limited sales, no certainty of continuation can be stated. The Companys ability to continue as a going concern is dependent upon raising additional funds through debt and equity financing and generating revenue. In addition, the Company will receive the proceeds from its outstanding warrants as, if and when such warrants are exercised for cash. There are no assurances the Company will receive the necessary funding or generate revenue necessary to fund operations.\n● Even if the Company is successful in raising additional funds, the Company cannot give any assurance that it will, in the future, be able to achieve a level of profitability from the sale of its products to sustain its operations. These conditions raise substantial doubt about the Companys ability to continue as a going concern. The accompanying financial statements do not include any adjustments to reflect the possible future effects on recoverability and reclassification of assets or the amounts and classification of liabilities that may result from the outcome of this uncertainty.\n● From both public statements observed, and conversations conducted between Nightfood Management and current and former executives from certain global food and beverage conglomerates, it has been affirmed to Management that there is increased strategic interest in the nighttime nutrition space as a potential high-growth opportunity, partially due to recent declines in consumer sleep quality and increases in at-home nighttime snacking.\n● The Company has experienced no major issues with supply chain or logistics. Order processing function has been normal to date, and its manufacturers have assured the Company that their operations are business as usual as of the time of this filing.\n4. Accounts receivable\n● The Companys accounts receivable arises primarily from the sale of the Companys ice cream. On a periodic basis, the Company evaluates each customer account and based on the days outstanding of the receivable, history of past write-offs, collections, and current credit conditions, writes off accounts it considers uncollectible. With most of our retail and distribution partners, invoices will typically be due in 30 days. The Company does not accrue interest on past due accounts and the Company does not require collateral. Accounts become past due on an account-by-account basis. Determination that an account is uncollectible is made after all reasonable collection efforts have been exhausted. The Company has not provided any accounts receivable allowances for June 30, 2023 and June 30, 2022, respectively.\n5. Inventories\n● Inventory consists of the following at June 30, 2023 and June 30, 2022:\nAs of As of\nJune 30,\nJune 30,\nInventory: Finished Goods $ 163,644 $ 165,470\nInventory: Ingredients 63,734 82,625\nInventory: Packaging 48,824 83,436\nTotal Inventory $ 276,202 $ 331,531\nInventories are stated at the lower of cost or net realizable value. The Company periodically reviews the value of items in inventory and provides write-downs or write-offs of inventory based on its assessment of market conditions and the products relative shelf life. Write-downs and write-offs are charged to loss on inventory write down.\n6. Other current assets\n● Other current assets consist of the following vendor deposits at June 30, 2023 and June 30, 2022.\nJune 30,\nJune 30,\nOther Current Assets\nDeposits $ 92,726 $ 137,797\nTOTAL $ 92,726 $ 137,797\n7. Accounts Payable and Accrued liabilities\nOther current liabilities consist of the following at June 30, 2023 and June 30, 2022:\nJune 30,\nJune 30,\nInterest Payable $ 40,779 $ 4,831\nAccounts payable 563,737 229,321\nTOTAL $ 604,516 $ 234,152\n8. Debt\n● Convertible Notes Payable\nConvertible Notes Issued on December 10, 2021\nOn December 10, 2021, the Company entered into a securities purchase agreement (the Securities Purchase Agreement) with certain accredited and institutional investors (the Purchasers) for the purchase and sale of an aggregate of: (i) $1,086,956.52 in principal amount of Original Issue Discount Senior Secured Convertible Notes (the Notes) for $1,000,000 (representing a 8% original issue discount) (Purchase Price) and (ii) warrants to purchase up to 4,000,000 shares of the Companys common stock (the Warrants) in a private placement (the Offering). Each Note featured an 8% original issue discount, resulting in net proceeds to the Company of $500,000 for each of the two Notes. The Notes had a maturity of December 10, 2022, an interest rate of 8% per annum, and were initially convertible at a fixed price of $0.25 per share, with provisions for conversions at a fixed price of $0.20 per share should the closing trading price of our common stock be below $0.20 per share after June 10, 2022. The conversion price is also subject to further price adjustments in the event of (i) stock splits and dividends, (ii) subsequent rights offerings, (iii) pro-rata distributions, and (iv) certain fundamental transactions, including but not limited to the sale of the Company, business combinations, and reorganizations (v) in the event that the Company issues or sells any additional shares of Common Stock or Common Stock Equivalents at a price per share less than the Exercise Price then in effect or without consideration then the Exercise Price upon each such issuance shall be reduced to the Dilutive Issuance Price. These Notes, for as long as they are outstanding, are secured by all assets of the Company and its subsidiaries, senior secured guarantees of the subsidiaries of the Company, and pledges of the common stock of all the subsidiaries of the Company. The Notes have provisions allowing for repayment at any time at 115% of the outstanding principal and interest within the first three months, and 120% of the outstanding principal and interest at any time thereafter.\nThe Warrants were initially exercisable at $0.25 per share and, are subject to cashless exercise after six months if the shares underlying the Warrants are not subject to an effective resale registration statement. The Warrants are also subject to customary adjustments, including price protections.\nIn connection with Securities Purchase Agreement, the Company issued to the Placement Agent (as defined below), an aggregate of 878,260 Common Stock purchase warrants (PA Warrants). The PA Warrants are substantially similar to the Warrants. The fair value of the PA Warrants at issuance was estimated to be $170,210 based on a risk-free interest rate of 1.25%, an expected term of 5 years, an expected volatility of 142.53% and a 0% dividend yield.\nSpencer Clarke Holdings LLC (Placement Agent) acted as the placement agent, in connection with the sale of the securities pursuant to the Securities Purchase Agreement. Pursuant to an engagement agreement entered into by and between the Company and the Placement Agent, the Company agreed to pay the Placement Agent a cash commission of $100,000. Pursuant to the discussion above, the Company also issued an aggregate of 878,260 PA Warrants to the Placement Agent.\nThe gross proceeds received from the Offering were approximately $1,000,000. The cash Placement Agent fees of $100,000 was paid separately. Also, the Company reimbursed the lead Purchaser $15,192 for legal fees, which was deducted from the required subscription amount to be paid.\nOn or around September 23, 2022, as a result of certain new financing agreements entered into by the Company, as consideration to the Holders, the Company issued to each Holder a common stock purchase warrant for the purchase of 5,434,783 shares of the Companys common stock (as amended from time to time, the Returnable Warrants, further the Placement Agent received 1,086,957 (Ref below, Mast Hill Loan - Promissory Notes Issued on September 23, 2022). The warrants are subject to customary adjustments (including price-based anti-dilution adjustments) and may be exercised on a cashless basis.\nThe Company was required to pay to the Purchasers on December 10, 2022, as extended to December 29, 2022 (as so extended, the Maturity Date) all remaining principal and accrued and unpaid interest on the Maturity Date (the Owed Amount) and the failure to so pay the Owed Amount on the Maturity Date is an event of default. The Owed Amount was not paid by the Company in accordance with the terms of the Notes. Subsequent to December 31, 2022 the Company entered into a forbearance agreement with the Purchasers as set out below.\nForbearance and Exchange Agreement\nOn February 4, 2023, the Company entered into a Forbearance and Exchange Agreement (the Forbearance Agreement) with the Purchasers.\nPursuant to the Forbearance Agreement as amended, among other things:\n● The Company shall pay to each Purchaser in cash the sum of $482,250.00 for the full and complete satisfaction of the Notes, which includes all due and owing principal, interest and penalties notwithstanding anything to the contrary in the Notes, as follows: (i) $250,000.00 on or before February 7, 2023; (ii) $50,000.00 on or before February 28, 2023; (iii) $50,000.00 on or before March 31, 2023; (iv) $50,000.00 on or before April 30, 2023; and (v) $82,250.00 on or before May 31, 2023.\n● The Purchasers shall not convert the Notes so long as an event of default pursuant to the Forbearance Agreement has not occurred.\n● The Company purchased and retired the Returnable Warrants from the Purchasers, in exchange for the Company issuing to each of the Holders 1,900,000 restricted redeemable shares of the Companys common stock (the Exchange Shares).\n● The Purchasers agreed not to transfer the Exchange Shares prior to September 24, 2023, subject to certain exceptions, including that the Company shall have the right to redeem all or any portion of the Exchange Shares from each Purchaser by paying an amount in cash to such Purchaser equal to $0.1109 per share being redeemed. The Purchasers sale of the Exchange Shares on or after September 24, 2023, is subject to a leak-out until all of the Exchange Shares are sold. In addition, the Purchasers sale of any common stock of the Company owned by them other than the Exchange Shares, shall also be subject to a leak-out during the period ending on the six-month anniversary of the date of the Forbearance Agreement.\n● Each Purchaser agrees to forbear from exercising its rights against the Company under its respective Note until and unless the occurrence of any of the following events: (a) the failure of the Company to make a scheduled payment pursuant to the Forbearance Agreement, subject to a five day right to cure; (b) the failure of the Company to observe, or timely comply with, or perform any other covenant or term contained in the Forbearance Agreement, subject to a ten day right to cure; (c) the Company or any subsidiary of the Company commences bankruptcy and/or any insolvency proceedings; or (d) the delivery of any notice of default by Mast Hill Fund, L.P. (Mast Hill) to the Company with respect to indebtedness owed to Mast Hill by the Company.\nThe Company evaluated all of the associated financial instruments in accordance with ASC 815 Derivatives and Hedging. Based on this evaluation, the Company has determined that no provisions required derivative accounting.\nIn accordance with ASC 470- Debt, the Company first allocated the cash proceeds to the loan and the warrants on a relative fair value basis, secondly, the proceeds were allocated to the beneficial conversion feature.\nBelow is a reconciliation of the convertible notes payable as presented on the Companys balance sheet as of June 30, 2023:\nPrincipal\n($) Stock-settled\nDebt\n($) Debt\nDiscount\n($) Net Value\n($)\nBalance at June 30, 2021 -\n-\n-\n-\nConvertible notes payable issued during fiscal year ended June 30, 2022 1,086,957\n1,086,957\nDebt discount associated with new convertible notes\n(1,018,229 ) (1,018,229 )\nConversion price adjusted from $0.25 to $0.20\n217,391 (217,391 ) -\nAmortization of debt discount\n275,423 275,423\nBalance at June 30, 2022 1,086,957 217,391 (960,197 ) 344,151\nCash repayment (362,319 )\n(362,319 )\nGain on extinguish of portion of principal\n(72,464 )\n(72,464 )\nAmortization of debt discount\n960,197 960,197\nPenalty 181,159\n181,159\nConversion price change\n1,843,475\n1,843,475\nUnder forbearance Agreement: 58,703 (1,988,402 )\n(1,929,699 )\nCash repayment (964,500 )\n(964,500 )\nBalance at June 30, 2023 -\n-\n-\n-\nBelow is a reconciliation of the extinguishment of debt relative to the exchange of Returnable Warrants for shares of common stock by the holders:\n3,800,000 shares of common stock issued and exchanged for 10,869,566 returnable warrants $ 342,000\nLoss on conversion price change in December 31, 2022 1,051,801\nStock settled debt (1,988,402 )\nFinancing charges due to returnable warrants issued 987,060\nPrincipal increased due to penalty 58,703\nLoss on extinguishment $ 392,459\nAmortization expense for the fiscal years ended June 30, 2023 and 2022, totaled $960,197 and $275,423, respectively.\nAs of June 30, 2023 and June 30, 2022, the unamortized portion of debt discount was $0 and $960,197, respectively.\nInterest expense including penalty for the fiscal years ended June 30, 2023 and 2022, totaled $93,324 and $48,309, respectively.\nDuring the fiscal years ended June 30, 2023 and 2022, the Company paid $39,452 and $43,478 to interest.\nMast Hill Promissory Notes (MH Notes)\n(a) Promissory Notes Issued on September 23, 2022\nOn September 23, 2022, the Company entered into a Securities Purchase Agreement and issued and sold to Mast Hill, a Promissory Note in the principal sum of $700,000.00, which amount is the $644,000 actual amount of the purchase price plus an original issue discount in the amount of $56,000. In connection with the issuance of the Promissory Note, the Company issued to the investor warrants to purchase 2,800,000 shares of common stock at an exercise price of $0.225, as well as returnable warrants, which may only be exercised in the event that the Company were to default on certain debt obligations, to purchase 7,000,000 shares of common stock at an exercise price of $0.30, in each case subject to adjustment. The Promissory Note may be converted into Company common stock in the event of an event of default under the Promissory Note by the Company.\nAs a result of the transaction, the Purchasers triggered their most favored nation clause which resulted in the Company entering into an MFN Amendment Agreement (the MFN Agreement) with the Purchasers (ref: Convertible Notes Issued on December 10, 2021 above) pursuant to which the Purchasers exercised their options under the most-favored nation terms contained in their existing transaction documents with the Company. Pursuant to the MFN Agreement, among other things, (a) the Company issued to each of the Purchasers 5,434,783 5-year Returnable Warrants which may only be exercised in the event that the Company were to default on certain debt obligations at an initial Exercise Price per share of $0.30, (b) the events of default set forth in the Notes were amended to include certain of the Events of Default reflected in the Promissory Note, (c) the conversion price of the Notes was amended so that upon an event of default, the conversion price equaled $0.10, subject to adjustment, (d) the Purchasers are entitled to deduct $1,750 from conversions to cover associated fees, and $750 shall be added to each prepayment to reimburse the Purchasers for administrative fees and (e) the definition of Exempt Issuance in the note was modified to remove certain clauses of the definition.\nThe Company paid to J.H. Darbie & Co., Inc. $32,200 in fees pursuant to the Companys existing agreement with J.H. Darbie & Co., Inc., in relation to the transactions contemplated by the Purchase Agreement plus warrants to purchase 119,260 shares of common stock at $0.27, subject to adjustment. The Company paid to Spencer Clarke LLC cash fees of $35,000 plus 500,000 shares of common stock.\nThe proceeds received by the Company from the Offering, net of the original issue discount, fees and costs including legal fees of $7,000 and commission fees of $32,200 were $604,800.\nOn May 2, 2023, a debtholder converted a total of $49,995, in which $16,088 of principal and $33,907 of interest payable, in exchange for 1,500,000 shares of common stock.\n(b) Promissory Notes Issued on February 5, 2023\nOn February 5, 2023, the Company entered into a Securities Purchase Agreement and issued and sold to Mast Hill, a Promissory Note in the principal amount of $619,000.00 (actual amount of purchase price of $526,150.00 plus an original issue discount in the amount of $92,850.00). In connection with the issuance of the Promissory Note, the Company issued to the investor warrants to purchase 6,900,000 shares of common stock at an exercise price of $0.10, as well as returnable warrants, which may only be exercised in the event that the Company were to default on certain debt obligations, to purchase 7,000,000 shares of common stock at an exercise price of $0.30, in each case subject to adjustment. The Promissory Note may be converted into Company common stock in the event of an event of default under the Promissory Note by the Company. The Company granted piggy-back registration rights to Mast Hill.\nThe Company paid to J.H. Darbie & Co., Inc. $10,000 in fees pursuant to the Companys existing agreement with J.H. Darbie & Co., Inc., in relation to the transactions contemplated by the Purchase Agreement plus warrants to purchase 219,230 shares of common stock at $0.12, subject to adjustment. The Company paid to Spencer Clarke LLC cash fees of $52,615 plus warrants to purchase 619,000 shares of common stock at $0.10, warrants to purchase 690,000 shares of common stock at $0.10, and warrants to purchase 700,000 shares of common stock at $0.30, in each case subject to adjustment.\n(c) Promissory Notes Issued on February 28, 2023\nOn February 28, 2023, the Company entered into a Securities Purchase Agreement and issued and sold to Mast Hill, a Promissory Note in the principal amount of $169,941 (actual amount of purchase price of $136,800 plus an original issue discount in the amount of $24,141). In connection with the issuance of the Promissory Note, the Company issued to the investor warrants to purchase 1,790,000 shares of common stock at an exercise price of $0.10, as well as returnable warrants, which may only be exercised in the event that the Company were to default on certain debt obligations, to purchase 1,820,000 shares of common stock at an exercise price of $0.10, in each case subject to adjustment. The Promissory Note may be converted into Company common stock in the event of an event of default under the Promissory Note by the Company. The Company granted piggy-back registration rights to Mast Hill.\nThe Company paid to J.H. Darbie & Co., Inc. $6,840.00 in fees pursuant to the Companys existing agreement with J.H. Darbie & Co., Inc., in relation to the transactions contemplated by the Purchase Agreement plus warrants to purchase 57,000 shares of common stock at $0.12, subject to adjustment. The Company paid to Spencer Clarke LLC warrants to purchase 200,000 shares of common stock at $0.08, warrants to purchase 179,000 shares of common stock at $0.10, and returanable warrants to purchase 182,000 shares of common stock at $0.30, in each case subject to adjustment.\n(d) Promissory Notes Issued on March 24, 2023\nOn March 24, 2023, the Company entered into a Securities Purchase Agreement and issued and sold to Mast Hill, a Promissory Note in the principal amount of $169,941 (actual amount of purchase price of $136,800 plus an original issue discount in the amount of $24,141). In connection with the issuance of the Promissory Note, the Company issued to the investor warrants to purchase 1,790,000 shares of common stock at an exercise price of $0.10, as well as returnable warrants, which may only be exercised in the event that the Company were to default on certain debt obligations, to purchase 1,820,000 shares of common stock at an exercise price of $0.10, in each case subject to adjustment. The Promissory Note may be converted into Company common stock in the event of an event of default under the Promissory Note by the Company. The Company granted piggy-back registration rights to Mast Hill.\nThe Company paid to J.H. Darbie & Co., Inc. $6,840.00 in fees pursuant to the Companys existing agreement with J.H. Darbie & Co., Inc., in relation to the transactions contemplated by the Purchase Agreement plus warrants to purchase 57,000 shares of common stock at $0.12, subject to adjustment. The Company paid to Spencer Clarke LLC a cash fee of $13,680 plus warrants to purchase 200,000 shares of common stock at $0.08, warrants to purchase 179,000 shares of common stock at $0.10, and warrants to purchase 182,000 shares of common stock at $.30, in each case subject to adjustment. Such 182,000 warrants, without any further action by either party thereto, may be cancelled and extinguished in its entirety if the MH Note is fully repaid and satisfied on or prior to the Maturity Date, subject further to the terms and conditions of the MH Note.\n(e) Promissory Notes Issued on April 17, 2023\nOn April 17, 2023, the Company entered into a Securities Purchase Agreement and issued and sold to Mast Hill, a Promissory Note in the principal amount of $169,941 (actual amount of purchase price of $136,800 plus an original issue discount in the amount of $24,141). In connection with the issuance of the Promissory Note, the Company issued to the investor warrants to purchase 1,790,000 shares of common stock at an exercise price of $0.10, as well as returnable warrants, which may only be exercised in the event that the Company were to default on certain debt obligations, to purchase 1,820,000 shares of common stock at an exercise price of $0.10, in each case subject to adjustment. The Promissory Note may be converted into Company common stock in the event of an event of default under the Promissory Note by the Company. The Company granted piggy-back registration rights to Mast Hill.\nThe Company paid to J.H. Darbie & Co., Inc. $6,840.00 in fees pursuant to the Companys existing agreement with J.H. Darbie & Co., Inc., in relation to the transactions contemplated by the Purchase Agreement plus warrants to purchase 57,000 shares of common stock at $.12, subject to adjustment. The Company paid to Spencer Clarke LLC a cash fee of $13,680 plus warrants to purchase 200,000 shares of common stock at $.08, warrants to 179,000 shares of common stock at $.10, and returnable warrants to 182,000 shares of common stock at $.10, in each case subject to adjustment.\n(f) Promissory Notes Issued on June 1, 2023\nOn June 1, 2023 the Company entered into a Securities Purchase Agreement and issued and sold to Mast Hill, a Promissory Note in the principal amount of $200,000 (actual amount of purchase price of $170,000 plus an original issue discount in the amount of $30,000). Also pursuant to the Purchase Agreement, in connection with the issuance of the Note: (a) Sean Folkson, the Companys Chairman of the Board and Chief Executive Officer, pursuant to a Pledge Agreement dated the Effective Date (the Pledge Agreement), pledged to Mast Hill, and granted to Mast Hill a security interest in, all common stock and common stock equivalents of the Company owned by Mr. Folkson; (b) the Company, Nightfood Inc. and MJ Munchies, Inc., each wholly-owned subsidiaries of the Company (collectively, the Subsidiaries and with the Company, the Debtors) entered into a Security Agreement dated the Effective Date (the Security Agreement), pursuant to which each of the Debtors granted Mast Hill a perfected security interest in all of their property to secure the prompt payments, performance and discharge in full of all of the Debtors obligations under the Note and the other transaction documents entered into in connection with the Purchase Agreement and the Note (the Transaction Documents); (c) The Subsidiaries entered into a Subsidiary Guarantee dated the Effective Date (the Guarantee), pursuant to which the Subsidiaries unconditionally and irrevocably guaranteed to Mast Hill the prompt and complete payment and performance by the Company and the Subsidiaries when due, of the obligations under the Transaction Documents.\nThe Company paid to (a) J.H. Darbie & Co., Inc. 298,875 warrants at an exercise price of $0.05688 per share pursuant to the Companys existing agreement with J.H. Darbie & Co., Inc., in relation to the transactions contemplated by the Purchase Agreement. The Company paid to (b) Spencer Clarke LLC 1,111,110 warrants at an exercise rice of $.033, in each case subject to adjustment.\nThe maturity date of the MH Notes are the 12-month anniversary of the Issuance Date, and are the date upon which the principal amount, the OID, as well as any accrued and unpaid interest and other fees, shall be due and payable.\nFourth Man, LLC Promissory Notes (Forth Man Notes)\nPromissory Notes Issued on June 29, 2023\nOn June 29, 2023, the Company the Company entered into a Securities Purchase Agreement and issued and sold to Fourth Man, LLC (Fourth Man), a Promissory Note (the Note) in the principal amount of $65,000.00 (actual amount of purchase price of $55,250 plus an original issue discount in the amount of $9,750). In connection with the issuance of the Promissory Note, the Company issued to the investor warrants to purchase 600,000 shares of common stock at an exercise price of $0.10 and 1,969,697 shares of Common Stock as commitment shares, 1,477,272 of which shall be cancelled and returned to the Companys treasury upon repayment of the Note on, or prior to, the date that is 180 calendar days after the date of the Agreement; and (b) granted piggy-back registration rights to Fourth Man.\nThe Company paid to J.H. Darbie & Co., Inc. $2,763 in fees pursuant to the Companys existing agreement with J.H. Darbie & Co., Inc., in relation to the transactions contemplated by the Purchase Agreement plus warrants to purchase 23,021 shares of common stock at $.10, subject to adjustment. The Company issued Spencer Clarke LLC warrants to purchase 618,079 shares of common stock at $.033, in each case subject to adjustment.\nThe maturity date of the Note is the 12-month anniversary of the Effective Date, and is the date upon which the principal amount, the OID, as well as any accrued and unpaid interest and other fees, shall be due and payable.\nThe Company evaluated all of the associated financial instruments in accordance with ASC 815 Derivatives and Hedging. Based on this evaluation, the Company has determined that no provisions required derivative accounting.\nIn accordance with ASC 470- Debt, the proceeds of issuance is first allocated among the convertible instrument and the other detachable instruments based on their relative fair values.\nBelow is a reconciliation of the above debts (Mast Hills Notes and Fourth Mann Notes) as presented on the Companys balance sheet as of June 30, 2023:\nPrincipal\n$ Debt\nDiscount\n$ Net Value\n$\nBalance at June 30, 2022 -\n-\n-\nPromissory notes payable issued 2,066,823\n2,066,823\nPrincipal converted to common stock (16,088 )\n(16,088 )\nDebt discount associated with Promissory notes\n(864,713 ) (864,713 )\nAmortization of debt discount\n305,696 305,696\nBalance at June 30, 2023 $ 2,050,735 $ (559,016 ) $ 1,491,719\nAmortization expense for the fiscal year ended June 30, 2023 and 2022, totaled $305,696 and $0, respectively.\nAs of June 30, 2023 and June 30, 2022, the unamortized portion of debt discount was $559,016 and $0, respectively.\nInterest expense for the fiscal year ended June 30, 2023 and 2022, totaled $74,686 and $0, respectively.\nAs of June 30, 2023 and June 30, 2022, the interest payable was $40,779 and $0, respectively.\nAs a result of dilutive issuances during the period the exercise price of all of the aforementioned convertible notes has been reset subsequent to the period to $0.03333. In addition, certain warrants issued to the noteholders, placement agent and J.H. Darbie have been repriced in accordance with their respective terms and conditions.\n9. Capital Stock Activity\nOn October 16, 2013, Nightfood, Inc. became a wholly-owned subsidiary of Nightfood Holdings, Inc. Accordingly, the stockholders equity has been revised to reflect the share exchange on a retroactive basis.\nCommon Stock\nThe Company is authorized to issue Two Hundred Million (200,000,000) shares of $0.001 par value per share Common Stock. Holders of Common Stock are each entitled to cast one vote for each Share held of record on all matters presented to shareholders. Cumulative voting is not allowed; hence, the holders of a majority of the outstanding Common Stock can elect all directors, subject to the rights of the holder of Series A Stock described below. Holders of Common Stock are entitled to receive such dividends as may be declared by the Board of Directors out of funds legally available therefore and, in the event of liquidation, to share pro-rata in any distribution of the Companys assets after payment of liabilities. The Board of Directors is not obligated to declare a dividend and it is not anticipated that dividends will be paid unless and until the Company is profitable. Holders of Common Stock do not have pre-emptive rights to subscribe to additional shares if issued by the Company. There are no conversion, redemption, sinking fund or similar provisions regarding the Common Stock. All of the outstanding Shares of Common Stock are fully paid and non-assessable and all of the Shares of Common Stock offered thereby will be, upon issuance, fully paid and non-assessable. Holders of Shares of Common Stock will have full rights to vote on all matters brought before shareholders for their approval, subject to preferential rights of holders of any series of Preferred Stock. Holders of the Common Stock will be entitled to receive dividends, if and as declared by the Board of Directors, out of funds legally available, and share pro-rata in any distributions to holders of Common Stock upon liquidation. The holders of Common Stock will have no conversion, pre-emptive or other subscription rights. Upon any liquidation, dissolution or winding-up of the Company, assets, after the payment of debts and liabilities and any liquidation preferences of, and unpaid dividends on, any class of preferred stock then outstanding, will be distributed pro-rata to the holders of the common stock. The holders of the common stock have no right to require the Company to redeem or purchase their shares. Holders of shares of common stock do not have cumulative voting rights, which means that the holders of more than 50% of the outstanding shares, voting for the election of directors, can elect all of the directors to be elected, if they so choose, and, in that event, the holders of the remaining shares will not be able to elect any of our directors.\nOn October 24, 2022, the Company launched a Tier 2 offering pursuant to Regulation A (also known as Regulation A+) with the intent to raise capital through an equity crowdfunding campaign. The Company is offering (this Offering) up to 5,000,000 units, each unit consisting of 4 shares of common stock and 4 common stock purchase warrants (Unit), being offered at a price range to be determined after qualification pursuant to Rule 253(b).\n● The Company had 123,587,968 and 91,814,484 shares of its $0.001 par value common stock issued and outstanding as of June 30, 2023 and June 30, 2022 respectively.\n● The Company had 1,950 and 3,260 shares of its B Preferred issued and outstanding as of June 30, 2023 and June 30, 2022 respectively.\nDuring the Fiscal Year ended June 30, 2023:\n● The Company issued an aggregate of 532,859 shares of its common stock for services valued at $77,110.\n● The Company issued 2,469,697 shares of its common stock as financing cost valued at $104,515.\n● The Company issued an aggregate of 6,549,128 shares of its common stock for cashless exercise of 4,928,260 original issued stock purchase warrants.\n● The Company sold 467,950 units at $0.50 per unit, consisting with 1,871,800 shares of common stock under its Regulation A+ Offering. The Company received net proceeds of $229,729.\n● The Company issued 3,800,000 shares of its common stock in exchange for the return of 10,869,566 returnable warrants.\n● The Company issued 2,750,000 shares of its common stock in exchange for the return of 2,750,000 stock purchase warrants.\n● Holders of the B Preferred converted 1,310 shares of Series B Preferred Stock into 6,550,000 shares of its common stock.\n● The Company issued an aggregate of 5,750,000 shares of its common stock for cash exercise of 5,750,000 original issued stock purchase warrants. The Company received net proceeds of $276,066.\n● The Company issued 1,500,000 shares of common stock as consideration for convertible debt in the principal amount of $16,088 and in the accrued interest payable of $33,907, with a fair value of $91,500.\nDuring the Fiscal Year ended June 30, 2022:\n● The Company issued 848,325 shares of common stock for services with a fair value of $214,125.\n● The Company issued 1,600,000 shares of common stock from the exercise of warrants with a fair value of $16,000\n● The Company issued 8,700,000 as the result of converting Preferred Class B\nPreferred Stock\nSeries A Preferred Stock\nThe Company is authorized to issue 1,000,000 shares of $0.001 par value per share Preferred Stock. Of the 1,000,000 shares, 10,000 shares were designated as Series A Preferred Stock (Series A Stock). Holders of Series A Stock are each entitled to cast 100,000 votes for each Share held of record on all matters presented to shareholders.\nIn addition to his ownership of the common stock, Mr. Folkson owns 1,000 shares of the Series A Stock which votes with the common stock and has an aggregate of 100,000,000 votes.\nThe Company had 1,000 and 1,000 shares of the Series A Stock issued and outstanding as of June 30, 2023, and June 30, 2022, respectively.\nSeries B Preferred Stock\nIn April 2021, the Company designated 5,000 shares of its Preferred Stock as B Preferred, each share of which is convertible into 5,000 shares of common stock and 5,000 non-detachable warrants with an initial exercise price of $0.30.\nDuring the fiscal years ended June 30, 2023 and 2022, the Company sold 0 and 335 shares of its B Preferred for gross cash proceeds of $0 and $335,000, respectively. These proceeds were used for operating capital. The B Preferred meets the criteria for equity classification and is accounted for as equity transactions. Specifically, among other factors, this qualifies as equity because redemption is not invoked at the option of the holder and the B Preferred does not have to be redeemed on a specified date.\nDuring the fiscal year ended June 30, 2023, holders of the B Preferred Stock converted 1,310 shares of B Preferred Stock into 6,550,000 shares of its common stock. During the fiscal year ended June 30, 2022, holders of the B Preferred Stock converted 1,740 shares of B Preferred Stock into 8,700,000 shares of its common stock.\nThe Company had 1,950 and 3,260 shares of its B Preferred Stock issued and outstanding as of June 30, 2023, and June 30, 2022, respectively.\nDividends\nThe Company has never declared dividends, however as set out below, during the fiscal year ended June 30, 2022 and 2021, upon issuance of a total of 335 and 4,665 shares of B Preferred, respectively, the Company recorded a deemed dividend as a result of beneficial conversion feature associated with the transaction.\nIn connection with certain conversion terms provided for in the designation of the B Preferred, pursuant to which each share of B Preferred is convertible into 5,000 shares of common stock and 5,000 warrants, the Company recognized a beneficial conversion feature upon the conclusion of the transaction in the amount of $4,431,387. The beneficial conversion feature was treated as a deemed dividend, and fully amortized on the transaction date due to the fact that the issuance of the B Preferred was classified as equity. During the year ended June 30, 2023 the Company recorded an additional deemed dividend of $1,136,946, fully amortized on the transaction dates, in relation to the B Preferred stock and downward price adjustments to certain warrants.\n10. Warrants\nThe following is a summary of the Companys outstanding common stock purchase warrants.\nDuring the fiscal year ended June 30, 2022, holders of the Companys B Preferred converted 1,740 shares of B Preferred into 8,700,000 shares of its common stock, along with 8,700,000 warrants issued to those holders with an adjusted exercise price of $0.13796 as of June 30, 2023 ($0.2919 per share - June 30, 2022). Said warrants are subject to further exercise price adjustments resulting from certain financing activities and equity transactions which could increase or decrease the exercise price in in the future.\nDuring the fiscal year ended June 30, 2022, 4,000,000 warrants were issued to the holder of outstanding convertible notes with an initial exercise price of $0.25 per share, and 878,260 warrants issued to the placement agent with an initial exercise price of $0.25 per share. The Company valued these warrants using the Black Scholes model utilizing a 143.39% volatility and a risk-free rate of 1.25%. In addition, 167,500 warrants issued to the placement agent with an initial exercise price of $0.20 per share and 167,500 warrants issued to the placement agent with an initial exercise price of $0.30 per share. The Company valued these warrants using the Black Scholes model utilizing a 148.06% volatility and a risk-free rate of 0.83%.\nDuring the fiscal year ended June 30, 2022, the Company entered into a warrant agreement with one of the Companys Directors issuing 100,000 warrants at a strike price of $0.2626 having a term of five years. The Company valued these warrants using the Black Scholes model utilizing a 151.07% volatility and a risk-free rate of 0.79%.\nDuring the fiscal year ended June 30, 2022, the Company entered into an Agreement For Shareholder Lock-Up And Acquisition of Warrants (the Lock-Up Agreement), with Mr. Folkson, issuing 400,000 warrants at a strike price of $0.30 having a term of one year. The Company valued these warrants using the Black Scholes model utilizing a 107.93% volatility and a risk-free rate of 0.50%.\nDuring the fiscal year ended June 30, 2023, holders of the Companys B Preferred converted 1,310 shares of B Preferred into 6,550,00 shares of its common stock, along with 6,550,000 warrants issued to those holders with an adjusted exercise price of $0.13796 as of June 30, 2023. Said warrants are subject to further exercise price adjustments resulting from certain financing activities and equity transactions which could increase or decrease the exercise price in in the future.\nDuring the fiscal year ended June 30, 2023, 2,800,000 warrants were issued to the holder of an outstanding promissory note with an initial exercise price of $0.225 per share, 280,000 warrants were concurrently issued to the Placement Agent with an initial exercise price of $0.225, and a further 119,260 warrants were issued to the Placement Agent with initial exercise price of $0.27 per share. The Company valued these warrants using the Black Scholes model utilizing a 122.42% volatility and a risk-free rate of 3.91%. On October 4, 2022, the Company and the Placement Agent entered into an Addendum to amend their Letter of Engagement to cancel compensatory warrants to purchase 280,000 shares of common stock of the Company and to cancel returnable compensatory warrants to purchase 700,000 shares of Common Stock of the Company for a one time cash payment of $35,000 and the issuance of 500,000 shares of Common Stock in full satisfaction of compensation earned.\nDuring the fiscal year ended June 30, 2023 the Company issued a cumulative 12,870,000 warrants to the holder of outstanding promissory notes, 19,460,000 returnable warrants (which warrants are cancelable in full should the notes be repaid in full on or before maturity), 4,875,189 placement agent warrants, 546,000 returnable placement agent warrants (which warrants are cancelable in full should the notes be repaid in full on or before maturity) and 831,386 warrants to JH Darbie. The warrants were issued at initial exercise prices between $0.033 and $0.12 per share and valued on issuance dates with the Black Scholes model utilizing a volatility from 111.36% and 112.33% and a risk-free rate from 3.41% and 4.18%.\nDuring the fiscal year ended Juen 30, 2023, the Company issued an aggregate of 6,549,128 shares of its common stock for the cashless exercise of 4,928,260 original issued stock purchase warrants.\nDuring the fiscal year ended June 30, 2023, the Company entered into a warrant agreement with one of the Companys Directors for the issuance of 100,000 warrants at a strike price of $0.125 having a term of five years. The Company valued these warrants using the Black Scholes model utilizing a 121.75% volatility and a risk-free rate of 4.06%.\nDuring the fiscal year ended June 30, 2023, the Company entered into an Agreement For Shareholder Lock-Up And Acquisition of Warrants (the Lock-Up Agreement), with Mr. Folkson, issuing 400,000 warrants at a strike price of $0.30 having a term of one year. The Company valued these warrants using the Black Scholes model utilizing a 103.60% volatility and a risk-free rate of 4.30%.\nDuring the fiscal year ended June 30, 2023 the Company issued 1,871,800 warrants to various subscribers under its Tier 2 offering pursuant to Regulation A (also known as Regulation A+) pursuant to which the Company is offering up to 5,000,000 units at a price of $0.50 per unit, each unit consisting of 4 shares of common stock and 4 common stock purchase warrants (Unit) for exercise at at a strike price per Share equal to 125% of the price per share of common stock, or $0.15625 per share with a term of 2 years.\nDuring the fiscal year ended June 30, 2023, the Company issued an aggregate of 5,750,000 shares of its common stock for cash exercise of 5,750,000 original issued stock purchase warrants. The Company received net proceeds of $276,066. In addition, the Company issued an aggregate of 6,900,000 replacement warrants to investors and placement agents in conjunction with the cash exercise of 6,900,000 warrants at $.05, resulting in gross proceeds to the Company of $345,000. The warrants were issued at initial exercise prices between $0.05 and $0.125 per share and valued on issuance dates with the Black Scholes model utilizing a volatility from 110.80% and 111.31% and a risk-free rate from 3.69% and 4.27%.\nDuring the fiscal year ended June 30, 2023, the Company issued to 1,000,000 retainer warrants under Amendment and Addendum to Letter of Engagement agreement at a strike price of $.033. The warrants included a provision for cashless exercise and carried a 5 years term. The Company valued these warrants using the Black Scholes model utilizing a 113.71% volatility and a risk-free rate of 3.69%. The Company recorded the retainer warrants into consulting expenses.\nDuring the fiscal year ended June 30, 2023, the Warrant Exchange Agreement, among other things, SC exchanged an aggregate of 16,181,393 of its existing warrants in the Company issued to it in 2021, originally with exercise prices ranging from $0.2 to $0.3, which had, as per the terms of the original warrants, adjusted to exercise prices of $.0747 as of calculations completed in February 2023 for the Companys 10Q filing for the fiscal quarter ended December 31, 2022, for a like amount of new warrants to purchase Company common stock at a price per share capped at $0.0747 (the New Warrants).\nCertain warrants in the below table include dilution protection for the warrant holders, which could cause the exercise price to be adjusted either higher or lower as a result of various financing events and stock transactions. The result of the warrant exercise price downward adjustment on modification date is treated as a deemed dividend and fully amortized on the transaction date. In addition to the reduction in exercise price, with certain wararnts there is a corresponding increase to the number of warrants to the holder on a prorated basis. Under certain conditions, such as the successful retirement of a convertible note through repayment, it is possible for the exercise price of these warrants to increase and for the number of warrants outstanding to decrease.\nThe aggregate intrinsic value of the warrants as of June 30, 2023 is $4,215,000 The aggregate intrinsic value of the warrants as of June 30, 2022 was $11,650.\nExercise Price June 30,\nIssued Repricing Exercised Others Cancelled Expired Redeemed June 30,\n$ 0.03333\n2,729,189 68,206,752\n70,935,941\n$ 0.0500\n575,000 (575,000 )\n-\n$ 0.05688\n298,875 (298,875 )\n-\n$ 0.0747\n16,181,392\n16,181,392\n$ 0.0800\n600,000 (600,000 )\n-\n$ 0.1000\n14,739,021 (14,139,021 )\n600,000\n$ 0.1200\n390,230 (390,230 )\n-\n$ 0.1250\n6,425,000 (6,325,000 )\n100,000\n$ 0.1380\n23,147,255\n23,147,255\n$ 0.1500 500,000\n(500,000 )\n-\n$ 0.1563\n1,871,800\n1,871,800\n$ 0.2000 2,417,500\n(2,417,500 )\n-\n$ 0.2250\n2,800,000\n(2,800,000 )\n-\n$ 0.2500 4,878,260\n(2,128,260 ) (2,750,000 )\n-\n$ 0.2626 100,000\n100,000\n$ 0.2700\n119,260 (119,260 )\n-\n$ 0.2919 10,950,000\n(8,532,500 )\n(2,417,500 )\n-\n$ 0.3000 400,000 19,606,522 (2,586,956 ) (5,750,000 ) (10,869,566 )\n(400,000 )\n400,000\n$ 0.5000 500,000\n500,000\n19,745,760 50,154,897 57,787,165 (10,678,260 ) (2,273,174 ) -\n(900,000 ) -\n113,836,388\nReturnable Warrants\nA cumulative total of 18,956,523 Returnable Warrants issued in conjunction with a financing agreement dated as of September 23, 2022, and a MFN agreement entered into concurrently on September 23, 2022 (ref: Note 8 above) may only be exercised in the event that the Company were to default on certain debt obligations. The Returnable Warrants have an initial exercise price of $0.30 per share, subject to customary adjustments (including price-based anti-dilution adjustments) and may be exercised at any time after an Event of Default until the five-year anniversary of such date. The Returnable Warrants include a cashless exercise provision as set forth therein. The exercise of the Returnable Warrants are subject to a beneficial ownership limitation of 4.99% of the number of shares of Common Stock outstanding immediately after giving effect to such exercise. In the event of the Companys failure to timely deliver shares of Common Stock upon exercise of the Returnable Warrants, the Company would be obligated to pay a Buy-In amount pursuant to the terms of the Returnable Warrants. On December 29, 2022, upon an event of default as defined under the MFN agreement, 5,434,785 returnable warrants issued to each of the Purchasers under the MFN Agreement, and 1,086,957 returnable warrants issued to the Placement Agent, were triggered and valued using the Black Scholes model with a volatility of 124.14% and a risk-free rate of 3.94% resulting in financing expenses recorded as additional financing costs in the cumulative amount of $1,085,780. In February, the Company issued 3,800,000 shares of its common stock in exchange for the return of 10,869,566 returnable warrants. The warrants issued to the Placement Agent remained available for exercise.\nDuring the fiscal year ended June 30, 2023, the Company issued accumulative 12,460,000 returnable warrants to the Purchasers of certain convertible notes issued after September 2022, and accumulative 546,000 returnable warrants to the Placement Agent. Any expense related to such warrants will be recorded in a future reporting period and only in the event the Company defaults on certain debt obligations. These returnable warrants initially valued using the Black Scholes model with a volatility of between 111.36% and 112.33% and a risk-free rate of between 3.67% and 3,91% resulting in contingent expenses to be recorded as additional financing costs in the cumulative amount of $809.800, which amount will be recorded in a future reporting period, only in the event the Company defaults on certain debt obligations.\n11. Fair Value of Financial Instruments\n● Cash and Equivalents, Receivables, Other Current Assets, Short-Term Debt, Accounts Payable, Accrued and Other Current Liabilities.\n● The carrying amounts of these items approximated fair value.\n● Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. To increase the comparability of fair value measures, Financial Accounting Standards Board (FASB) ASC Topic 820-10-35 establishes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurement) and the lowest priority to unobservable inputs (level 3 measurements).\nLevel 1 - Valuations based on quoted prices for identical assets and liabilities in active markets.\nLevel 2 - Valuations based on observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data.\nLevel 3 - Valuations based on unobservable inputs reflecting our own assumptions, consistent with reasonably available assumptions made by other market participants. These valuations require significant judgment.\nAt June 30, 2023 and June 30, 2022 , the Company had no outstanding derivative liabilities.\n12. Commitments and Contingencies:\n● The Company has entered into certain consulting agreements which carry commitments to pay advisors and consultants should certain events occur. An agreement is in place with one Company Advisor that calls for total compensation over the four-year Advisor Agreement of 500,000 warrants with an exercise price of $0.15 per share, of which all have vested.\n● CEO Sean Folkson has a twelve-month consulting agreement which went into effect on January 1, 2022, and continues on a monthly basis, which will reward him with bonuses earned of 1,000,000 warrants at a strike price of $0.50 when the Company records its first quarter with revenues over $1,000,000, an additional 3,000,000 warrants with a $0.50 strike price when the Company records its first quarter with revenues over $3,000,000, and an additional 3,000,000 warrants with a $1 strike price when the Company records its first quarter with revenues over $5,000,000. Mr. Folkson will also be awarded warrants with a strike price of $0.50 should the Company exceed $500,000 in non-traditional retail channel revenue during the term of the agreement, and should the Company enter into a product development or distribution partnership with a multi-national food & beverage conglomerate during the term of the Agreement. As of June 30, 2023, those conditions were not met and therefore nothing was accrued related to this arrangement.\n● Litigation: From time to time, we may become involved in various lawsuits and legal proceedings, which arise, in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. The Company is not aware of any such legal proceedings that we believe will have, individually or in the aggregate, a material adverse effect on our business, financial condition or operating results.\n13. Related Party Transactions\n● During the third quarter of Fiscal Year 2015, Mr. Folkson began accruing a consulting fee of $6,000 per month which the aggregate of $72,000 is reflected in professional fees for the fiscal years ending June 30, 2023 and 2022. At June 30, 2023 and June 30, 2022 respectively, Mr. Folkson was owed $33,000 and $0 in unpaid consulting fees which amounts are included on the balance sheets in accounts payable and accrued liabilities- related party.\n● On January 20, 2023, the Company entered into the Lock-Up Agreement with Mr. Folkson. For purposes of the Lock-Up Agreement, Mr. Folkson is the direct or indirect owner of 16,776,591 shares of the Companys common stock (the Shares), and Mr. Folkson has agreed to not transfer, sell, or otherwise dispose of any Shares through February 4, 2023. The Lock-Up Agreement is substantially similar to, and serves as an extension of, the lock-up agreement previously in place between the Company and Mr. Folkson, which expired in accordance with its terms on February 4, 2022.\nThe Lock-Up Agreement further provides, in exchange for the agreement to lock up the Shares, that Mr. Folkson shall receive warrants to acquire 400,000 shares of Company common stock at an exercise price of $0.30 per share, which warrants carry a twelve month term and a cashless provision, and will expire if not exercised within the twelve month term.\n● Folkson Loan\nOn February 7, 2023, Sean Folkson, the Chairman and CEO of the Company, loaned $40,000 to the Company, which was evidenced by a promissory note (the Folkson Note). The maturity date under the Folkson Note is February 7, 2024. The Folkson Note bears interest at a fixed rate of 12.0% per annum, and shall be payable on the maturity date. Notwithstanding the foregoing, the Company shall not make any payment to Mr. Folkson under the Folkson Note, whether of principal or interest, and whether or not on the maturity date when due and payable, unless and until all indebtedness of the Company owed or owing to each of Mast Hill, Puritan Partners and Verition has been repaid in full. The Folkson Note has customary events of default.\nMr. Folkson was owed $41,876 which amounts are included on the balance sheets in accounts payable and accrued liabilities- related party.\nThe Company intends to use the proceeds from the Folkson Note for working capital.\n● In addition, at June 30, 2023 and 2022, respectively, there was $27,000 and $0 in unpaid directors fees which amounts are included on the balance sheets n accounts payable and accrued liabilities- related party.\n14. Income Tax\nA reconciliation of the statutory income tax rates and the Companys effective tax rate is as follows:\nJune 30,\nStatutory U.S. federal rate (21.00 )% (21.00 )%\nState income taxes (net of federal tax benefit) (6.50 )% (6.50 )%\nPermanent differences 20.6 % 11.9 %\nValuation allowance (35.1 )% (26.4 )%\n0.0 % 0.0 %\nThe tax effects of the temporary differences and carry forwards that give rise to deferred tax assets consist of the following:\nJune 30,\nDeferred tax assets:\nNet operating loss carry-forwards $ 4,591,840\n2,573,365\nValuation allowance $ (4,591,840\n) (2,573,365 )\nNet deferred tax asset $\n$ -\nAt June 30, 2023 the Company had estimated U.S. federal net operating losses of approximately $21,533,500, for income tax purposes. $2,614,000 will expire between 2031 and 2037 while the balance of the tax operating loss can be carried forward indefinitely, they are limited in any single year to 80% of taxable income. For financial reporting purposes, the entire amount of the net deferred tax assets has been offset by a valuation allowance due to uncertainty regarding the realization of the assets. The net change in the total valuation allowance for the year ended June 30, 2023 was an increase of $2,018,500. The Company follows FASC 740-10-25 P which requires a company to evaluate whether a tax position taken by the company will more likely than not be sustained upon examination by the appropriate tax authority. The Company has analyzed filing positions in all of the federal and state jurisdictions where it is required to file income tax returns, as well as all open tax years in these jurisdictions. The Company believes that its income tax filing positions and deductions would be sustained on audit and does not anticipate any adjustments that would result in a material change to its financial position. Therefore, no reserves for uncertain income tax positions have been recorded.\nThe Company may not be able to utilize the net operating loss carryforwards for its US income taxes in future periods should it experience a change in ownership as defined in Section 382 of the Internal Revenue Code (IRC). Under section 382, should the Company experience a more than 50% change in its ownership over a 3 year period, the Company would be limited based on a formula as defined in the IRC to the amount per year it could utilize in that year of the net operating loss carryforwards.\nAs of June 30, 2023 the Company had not performed an analysis to determine if the Company was subject to the provisions of Section 382. The Company is subject to U.S. federal income tax including state and local jurisdictions. Currently, no federal or state income tax returns are under examination by the respective taxing jurisdictions.\nThe Companys accounting policy is to recognize interest and penalties related to uncertain tax positions in income tax expense. The Company has not accrued interest for any periods.\nThe Company has not filed its federal and state income tax returns for the fiscal years ended June 30, 2023, 2022, 2021, 2020, 2019, 2018, 2017, and 2016, however it believes due to the reported losses there is no material liability outstanding.\n15. Subsequent Events\n● On August 31, 2023, Nightfood Holdings, Inc. (the Company) consummated the transactions pursuant to a Securities Purchase Agreement (the Purchase Agreement) dated as of August 28, 2023 (the Effective Date) and issued and sold to Fourth Man, LLC (Fourth Man), a Promissory Note (the Note) in the principal amount of $60,000.00 (actual amount of purchase price of $51,000 plus an original issue discount (OID) in the amount of $9,000). Also pursuant to the Purchase Agreement, in connection with the issuance of the Note, the Company: (a) issued to Fourth Man (i) returnable common stock purchase warrants (the Warrants) exercisable into an aggregate of 650,000 shares of the common stock, par value $0.001 per share, of the Company (the Common Stock) and (ii) 3,333,333 shares of Common Stock as commitment shares (the Commitment Shares), 1,666,667 of which shall be cancelled and returned to the Companys treasury upon repayment of the Note on, or prior to, the date that is 180 calendar days after the date of the Agreement; and (b) granted piggy-back registration rights to Fourth Man.\nThe Company paid to (a) J.H. Darbie & Co., Inc. $2,550 in cash fees plus 21,250 warrants at an exercise price of $0.10 per share (the Darbie Warrants)) pursuant to the Companys existing agreement with J.H. Darbie & Co., Inc., in relation to the transactions contemplated by the Purchase Agreement.\n● On July 7, 2023, the Company issued 4,800,000 common stock purchase warrants to Spencer Clarke LLC as retainer for Placement Agent services.\n● On October 6, 2023, Nightfood Holdings, Inc. (the Company) consummated the transactions pursuant to a Securities Purchase Agreement (the Purchase Agreement) dated as of October 5, 2023 (the Effective Date) and issued and sold to Mast Hill Fund, L.P. (Mast Hill), a Promissory Note (the Note) in the principal amount of $62,000.00 (actual amount of purchase price of $52,700 plus an original issue discount (OID) in the amount of $9,300).\nMast Hill has the right, at any time on or following the date that an Event of Default occurs to convert all or any portion of the then outstanding and unpaid Principal Amount and interest, to convert all or any portion of the then outstanding and unpaid principal amount and interest (including any default interest) into Common Stock, at a conversion price of $0.033, subject to customary adjustments as provided in the Note for stock dividends and stock splits, rights offerings, pro rata distributions, fundamental transactions and dilutive issuances. ITEM 9. CHANGES AND DISAGREEMENT WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone ITEM 9A. CONTROLS AND PROCEDURES\nThe term disclosure controls and procedures means controls and other procedures of an issuer that are designed to ensure that information required to be disclosed by the issuer in the reports that it files or submits under the Exchange Act (15 U.S.C. 78a, et seq. ) is recorded, processed, summarized and reported, within the time periods specified in the Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to the issuers Chief Executive Officer (principal executive officer and principal financial officer), or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nThe term internal control over financial reporting is defined as a process designed by, or under the supervision of, the issuers Chief Executive Officer, or persons performing similar functions, and effected by the issuers board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\n● Pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the issuer;\n● Provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the issuer are being made only in accordance with authorizations of management and directors of the issuer; and\n● Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the issuers assets that could have a material effect on the financial statements.\nOur Chief Executive Officer does not expect that our disclosure controls and procedures or our internal controls over financial reporting will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of inherent limitations in all control systems, internal control over financial reporting may not prevent or detect misstatements, and no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the registrant have been detected. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nEvaluation of Disclosure Controls and Procedures. Our Chief Executive Officer is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) under the Exchange Act. Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States. We carried out an evaluation, under the supervision and with the participation of our Chief Executive Officer, of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this report. Based on that evaluation, our chief executive officer concluded that our disclosure controls and procedures were not effective at June 30, 2023 due to the lack of full-time accounting and management personnel. We will consider hiring additional employees when we obtain sufficient capital.\nManagements Annual Report on Internal Control over Financial Reporting. Our management is responsible for establishing and maintaining adequate internal control over financial reporting. Our internal control over financial reporting has been designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. GAAP.\nOur internal control over financial reporting includes policies and procedures that pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect transactions and dispositions of our assets; provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP, and that receipts and expenditures are being made only in accordance with authorization of our management and directors; and provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting at June 30, 2022. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework. Based on that assessment under those criteria, our management has determined that, at June 30, 2023, our internal control over financial reporting was not effective due to a lack of resources.\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to the exemption provided to issuers that are not large accelerated filers nor accelerated filers under the Dodd-Frank Wall Street Reform and Consumer Protection Act.\nChanges in Internal Controls over Financial Reporting. There were no changes in the internal controls over our financial reporting that occurred during the period covered by this report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOur officers and directors are as follows:\nName\nAge\nPosition(s)\nSean Folkson\nPresident, Chief Executive Officer and Director\nThanuja Hamilton, MD\nDirector\nNisa Amoils\nDirector\nThomas Morse\nDirector\nSean Folkson was elected president, CEO and a director upon formation of the Company. Sean Folkson has been CEO and President of our subsidiary Nightfood, Inc., a New York corporation, since its formation in January 2010. From 2004 to 2009 he served as president of Specialty Equipment Direct, Inc. which is an online marketer of flooring maintenance equipment which he founded. In 1998 he founded AffiliatePros.com, Inc. a company engaged in assisting its clients with internet marketing which operated through 2008. Mr. Folkson received a B.A. in Business Administration with a concentration in marketing from S.U.N.Y Albany in 1991.\nNisa Amoils was appointed as a director on July 7, 2021. She is Managing Partner at A100x Ventures since January 2021 and an Advisor to Dragonfly Capital where she invests in early stage Blockchain/Crypto/Web 3 companies. She has been in venture capital for 11 years and investing in blockchain since 2016, with multiple unicorns and exits. From March 2016 until 2021, she previously was the Venture Partner at Scout Ventures, an early-stage venture capital firm focused on technology investments, and used to practice securities and corporate law at Anderson Kill. She serves on Boards such as Wharton Entrepreneurship, Global Digital Assets and Crypto Association, and Bubblr Inc. (Nasdaq:BBLR). She has been named one of Business Insiders Women VCs to Watch, 2021, top 100 Women in Fintech, and top 50 global Blockchain thinkers. She is an occasional host and commentator at Defiance Media and Forbes, having previously done anchoring and contributing on air. She holds a business degree from the University of Michigan and a law degree from the University of Pennsylvania. The Company believes that Ms. Amoils is qualified as a Board member of the Company because of her track record of investing in, and guiding and growing, customer-centric companies. The Company believes her perspective, and her startup operational experience, can enhance the Company in areas such as strategic and digital marketing, business development, fundraising, and management.\nThanuja Hamilton, M.D. was appointed as a director on July 7, 2021. Dr. Hamilton is a double Board-Certified Sleep Medicine Specialist. She completed her Fellowship in Sleep Medicine as well as Internal Medicine at Drexel University College of Medicine at Hahnemann University Hospital in Philadelphia, Pennsylvania, where she was Chief Fellow of her program. Dr. Hamilton has been a prominent advocate of healthy sleep. She frequently presents at medical conferences and is actively involved in community health programs. She has been named SJ (South Jersey) Magazines Top Doc and was the featured physician on the cover of Philadelphia Magazines Top Docs issue. From November 2012 through June 2019 she was an employee, and since July 2019 has been the owner, of Advocare Sleep Physicians of South Jersey and its predecessor. Dr. Hamilton is also the Corporate Medical Director of Persante Health Care, a national provider of sleep and balance center management services to hospitals, physician practices and patients, the Medical Director of Jefferson University Health Systems Sleep Lab, and the Medical Director at Virtua Health Sleep Labs, and is on the board of the New Jersey Sleep Society. She is a member of the American Academy of Sleep Medicine, American College of Chest Physicians and the American Medical Association. She has written for and contributed to numerous outlets such as Yahoo Health, Womens World, Good Housekeeping and Health.com, including a column in the Philly Voice. In addition to the Nightfood board, Dr. Hamilton also serves on the board of Avenue of the Arts, a nonprofit which promotes the development, beautification, and marketing of the Avenue of the Arts district of Philadelphia. She has appeared in a number of nationally syndicated and local television programs as an expert in sleep. The Company believes that Dr. Hamilton is qualified as a Board member of the Company because of her being a nationally recognized authority in the sleep field and her understanding of the consumer need for more sleep-friendly nighttime snack options.\nTom Morse was appointed as a director on August 16, 2021. Mr. Morse has served as the manager of Liquid OTC LLC (doing business as LOL), a company specializing in functional candy and oral care products, since January 2011. In addition, he has served since August 2005 as the manager of Alina Healthcare Products, LLC, a consumer packaged goods development and distribution company. From July 2014 through October 2019, Mr. Morse was the Founder and CEO of Strategy & Execution Inc., a consumer packaged goods development and distribution company. From May 1999 through December 2005, Mr. Morse served as the President of Living Essentials LLC, the parent company of both 5-Hour Energy and Chaser. He was responsible for the development and launch of those brands, including implementation of sales & marketing strategies to build brands in new categories, the national retail rollout of the product lines, and the recruitment and development of the core management team. He holds a B.A. from Michigan State University with a major in accounting/business. The Company believes that Mr. Morse is qualified as a Board member of the Company because of his management, marketing and business development skills in the consumer goods industry, and his experience as a founder of 5-Hour Energy.\nTerm and Family Relationships\nOur directors currently have terms which will end at our next annual meeting of the stockholders or until successors are elected and qualify, subject to their prior death, resignation or removal. Officers serve at the discretion of the Board of Directors.\nNo family relationships exist among our officers, directors and consultants.\nLegal Proceedings\nTo the best of our knowledge, no officer, director, or persons nominated for these positions, and no promoter or significant employee of our corporation has been involved in legal proceedings that would be material to an evaluation of our management.\nCode of Ethics\nWe have determined that due to our early stage of development and our small size, the present adoption of a code of ethics is not appropriate. If we grow we will adopt a suitable code of ethics.\nCORPORATE GOVERNANCE\nBoard of Directors\nDuring Fiscal year 2023 there was no change in the composition of our Board of Directors.\nCommittees\nOur board of directors does not currently have an audit committee, compensation committee or nominating and corporate governance committee.\nThe board of directors does not have an audit committee financial expert. The board of directors has not yet recruited an audit committee financial expert to join the board of directors.\nDirector Independence\nWe use the definition of independence of The NASDAQ Stock Market to make this determination. NASDAQ Listing Rule 5605(a)(2) provides that an independent director is a person other than an officer or employee of the company or any other individual having a relationship, which, in the opinion of the Companys Board, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. The NASDAQ listing rules provide that a director cannot be considered independent if:\n● The director is, or at any time during the past three years was, an employee of the company;\n● The director or a family member of the director accepted any compensation from the company in excess of $120,000 during any period of twelve consecutive months within the three years preceding the independence determination (subject to certain exclusions, including, among other things, compensation for board or board committee service);\n● The director or a family member of the director is, or at any time during the past three years was, an executive officer of the company;\n● The director or a family member of the director is a partner in, controlling stockholder of, or an executive officer of an entity to which the company made, or from which the company received, payments in the current or any of the past three fiscal years that exceed 5% of the recipients consolidated gross revenue for that year or $200,000, whichever is greater (subject to certain exclusions);\n● The director or a family member of the director is employed as an executive officer of an entity where, at any time during the past three years, any of the executive officers of the company served on the compensation committee of such other entity; or\n● The director or a family member of the director is a current partner of the companys outside auditor, or at any time during the past three years was a partner or employee of the companys outside auditor, and who worked on the companys audit.\nUnder such definitions, Ms. Amoils, Dr. Hamilton and Mr. Morse are considered independent directors.\nSection 16(a) Beneficial Ownership of Reporting Compliance\nSection 16(a) of the Securities Exchange Act requires the Companys officers and directors, and persons who beneficially own more than ten (10%) percent of a class of equity securities registered pursuant to Section 12 of the Exchange Act, to file reports of ownership and changes in ownership with the Securities and Exchange Commission and the principal exchange upon which such securities are traded or quoted. Reporting Persons are also required to furnish copies of such reports filed pursuant to Section 16(a) of the Exchange Act with the Company.\nBased on our review of the copies of such forms received by us, and to the best of our knowledge, for the fiscal year ended June 30, 2023, each director inadvertently failed to timely file a Form 4, in each case related to a single transaction consisting of nominal equity compensation. ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table\nThe following table sets forth the cash and non-cash annual remuneration of our CEO and director during our past two fiscal years:\nName and Principal Position Year(1) Salary Bonus Stock\nAwards Option\nAwards Non-Equity\nIncentive\nPlan\nCompensation Nonqualified\nDeferred\nCompensation\nEarnings All Other\nCompensation Total\nSean Folkson,* $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 76,800 $ 76,800\nCEO $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 72,000 1 $ 72,000\n(1) 2023 represents the fiscal year ended June 30, 2023 and 2022 represents the fiscal year ended June 30, 2022.\n* Mr.Folksons fee of $6,000 monthly began accruing on January 1, 2015. Prior to that, Mr. Folkson had worked for the Company for several years and had never taken any fees or salary. Although the accrual began on January 1, 2015, the first payment was not made until November 28, 2017, at which time Folkson had worked for 35 months under the Agreement without any payments having been made. For the fiscal year ended June 30, 2023, Mr. Folkson invoiced $72,000 of total compensation, but $33,000 of that remained unpaid as of June 30, 2023. As of the time of this filing, Mr. Folkson has $51,000 in total consulting fees that remain unpaid. On February 4, 2023 Mr. Folkson received a stock purchase warrant for the purchase of 400,000 shares at $0.30 for a term of one year valued at $4,800.\nOutstanding Equity Awards\nNo grants of stock options or stock awards were made during the fiscal year ended June 30, 2023 to our named executive officers. We have no stock options outstanding.\nLong Term Incentive Plans\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. We do not have any material bonus or profit sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers.\nDirector Compensation\nStarting in Fiscal Year 2022, we commenced paying our independent directors a cash fee of $3,000 on a quarterly basis. In addition, upon their appointment, each of our independent directors received a grant of either restricted stock or warrants to purchase common stock, based on the closing price of our common stock on the date of grant. Accordingly, our independent directors were granted different amounts of securities depending on when they were appointment due to fluctuations in our stock price.\nThe following table below sets forth the compensation earned by our non-employee directors for service on our Board of Directors during the year ended June 30, 2023:\nName Fees earned\nor paid in\ncash Stock\nAwards Option\nAwards Non-Equity\nIncentive\nPlan\nCompensation Nonqualified\nDeferred\nCompensation\nEarnings All Other\nCompensation Total\nThanuja Hamilton, MD $ 12,000 $ 14,640 - - - - $ 26,640\nNisa Amoils $ 12,000\n$ - - 10,500 (1) $ 22,500\nThomas Morse $ 12,000 $ 14,962\n- - - $ 26,962\n(1) Represents a 5-year warrant to purchase 100,000 shares of common stock with an exercise price of $0.1250.\nEmployment/Consulting Agreements\nA consulting agreement exists between Mr. Folkson and the Company, whereby Mr. Folkson receives $6,000 in consulting fees each month, beginning January, 2015.\nIn June 2018, the Company entered into a new consulting agreement with Mr. Folkson, which included a modified compensation structure. The new Consulting Agreement contains the identical cash compensation allowance of $6,000 monthly. In addition, Mr. Folkson would earn Warrants with a strike price of $.50 when the Company hit certain revenue milestones. A similar agreement was entered into by the parties with a term starting on July 1, 2019.\nIn exchange for an agreement to lock up Mr. Folksons shares, he received warrants to acquire 400,000 shares of Company common stock on February 4, 2023, at a strike price of $.30, and with a term of 12 months from the date of that agreement. The warrants include a provision for cashless exercise and will expire if not exercised within the twelve-month term.\nIn addition, in December, 2017, Mr. Folkson elected to purchase 80,000 warrants to acquire shares of Company common stock with a strike price of $.20 and a term of 36 months. To acquire these warrants, Mr. Folkson paid $.15 per warrant, totaling $12,000, treated as a $12,000 reduction to the amount owed to Mr. Folkson.\nTermination of Employment\nThere are no compensatory plans or arrangements, including payments to be received from the Company, with respect to any person named in the Summary Compensation Table set forth above that would in any way result in payments to any such person because of his or her resignation, retirement or other termination of such persons employment with us.\nLimits on Liability and Indemnification\nWe provide directors and officers insurance for our current directors and officers.\nOur by-laws provide that our company shall indemnify its officers and directors to the fullest extent allowed by law for any liability including reasonable costs of defense arising out of any act or omission of any officer or director on behalf of the company to the full extent allowed by the laws of the State of Nevada and any amendment to Nevada law, whether effected by the Nevada Revised Statutes or judicial decision or otherwise, which allows for further indemnification of officers or directors after the date of our by-laws automatically adopted by our company without further act. Insofar as indemnification for liabilities under the Securities Act may be permitted to our directors, officers, and controlling persons under the foregoing provisions or otherwise, we have been advised that in the opinion of the Securities and Exchange Commission such indemnification is against public policy as expressed in the Securities Act of 1933 and is therefore unenforceable. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information in the following table sets forth the beneficial ownership of our shares of common stock as of October 13, 2023 by: (i) our officers and directors; (ii) all officers and directors as a group; (iii) each shareholder who beneficially owns more than 5% of any class of our voting securities, including those shares subject to outstanding options.\nThe number of shares beneficially owned by each person, director, director nominee, or named executive officer is determined under rules of the Securities and Exchange Commission; this information is not necessarily indicative of beneficial ownership for any other purpose. Under these rules, beneficial ownership includes any shares for which the individual has sole or shared voting power or investment power and also any shares with respect to which the person has the right to acquire sole or shared voting or investment power on or before December 12, 2023 (60 days after October 13, 2023) through the conversion of shares of convertible preferred stock or the exercise of any stock option, warrant or other right. The percentage of common stock beneficially owned is based on 126,921,301 shares issued and outstanding as of October 13, 2023 Unless we indicate otherwise, each person has sole investment and/or voting power with respect to the shares set forth in the following tables.\nUnless otherwise indicated, the address for each person listed below is:\nc/o Nightfood Holdings, Inc.,\n520 White Plains Road - Suite 500,\nTarrytown, NY 10691.\nName and address of owner Amount\nowned Percent of\nclass\nSean Folkson 17,176,644 (1) 13.53 %\nNisa Amoils 200,000 (2) *\nThanuja Hamilton 149,671 *\nTom Morse 216,494 *\nAll officers and directors as a group (4 person) 17,742,809 13.98 %\n* Less than 1%.\n(1) Does not include 1,000 shares of our Series A Preferred Stock Mr. Folkson beneficially owns, which votes with the common stock and has an aggregate of 100,000,000 votes. Does include 400,000 warrants with a strike price of $0.30, and option for cashless exercise, which expire on February 4, 2023.\n(2) Represents shares underlying common stock purchase warrants.\nChanges in Control\nOur management is not aware of any arrangements which may result in changes in control as that term is defined by the provisions of Item 403(c) of Regulation S-K. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nWe consider related party transactions to be transactions between our Company and (i) a director, officer, director nominee or beneficial owner of greater than five percent of our stock; (ii) the spouse, parents, children, siblings or in-laws of any person named in (i); or (iii) an entity in which one of our directors or officers is also a director or officer or has a material financial interest.\nOur Board of Directors is vested with the responsibility of evaluating and approving any potential related party transaction, unless a special committee consisting solely of independent directors is appointed by the Board of Directors. We do not have any formal policies or procedures for related party transactions.\nTransactions with Related Parties\nThe Company was incorporated on October 16, 2013 and upon our organization we issued 20,000,000 shares of common stock to the Companys founder, President and CEO in exchange for all of the issued and outstanding common stock of Night Food, Inc., a New York corporation. Mr. Folkson had advanced an aggregate of $134,517 to us to fund our operations, and had previously been shown on our financial statements as a Note Payable. This note has since been converted to equity at a valuation of $.25 per share. Mr. Folkson is not deemed independent because he is our single largest shareholder and our CEO.\nA consulting agreement exists between Mr. Folkson and the Company, whereby Mr. Folkson receives $6,000 in consulting fees each month, beginning January, 2015. In June of 2018, the Company entered into a new consulting agreement with Folkson, which included a modified compensation structure. The new Consulting Agreement contains the identical cash compensation allowance of $6,000 monthly. In addition, Folkson would earn Warrants with a strike price of $.50 when the Company hit certain revenue milestones. A similar agreement was entered into by the parties with a term starting on January 1, 2022.\nIn addition, in December, 2017, Folkson elected to purchase 80,000 warrants to acquire shares of NGTF stock with a strike price of $.20 and a term of 36 months. To acquire these warrants Folkson paid $.15 per warrant, totaling $12,000, treated as a $12,000 reduction to the amount owed to Folkson.\nOn January 30, 2023, we entered into an Agreement For Shareholder Lock-Up And Acquisition of Warrants with Mr. Folkson. For purposes of the Lock-Up Agreement, Mr. Folkson is the direct or indirect owner of 16,776,644 shares of the Companys common stock (the Shares), and Mr. Folkson has agreed to not transfer, sell, or otherwise dispose of any Shares through February 4, 2024. The Lock-Up Agreement is substantially similar to, and serves as an extension of, the lock-up agreement previously in place between the Company and Mr. Folkson, which expired in accordance with its terms on February 4, 2023. The Lock-Up Agreement further provides, in exchange for the agreement to lock up the Shares, that Mr. Folkson shall receive warrants to acquire 400,000 shares of Company common stock at an exercise price of $.30 per share, which warrants carry a twelve-month term and a cashless provision, and will expire if not exercised within the twelve month term.\nOther than the above transactions, there have been no related party transactions, or any other transactions or relationships required to be disclosed pursuant to Item 404 Regulation S-K. The Company is currently not a subsidiary of any company. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe Board of Directors has reviewed and discussed the audited consolidated financial statements of the Company for the fiscal year ended June 30, 2023 with management and have reviewed related written disclosures of Gries and Associates LLC, our independent accountants of the matters required to be discussed by SAS 114 with respect to those statements. Based on this review and these discussions, the Board of Directors recommends that the financial statements be included in this Form 10-K for the year ended June 30, 2023.\nWe have also reviewed the various fees that we paid or accrued to Gries and Associates LLC during the years ended June 30, 2023 and 2022, for rendered services in connection with our annual audits and quarterly reviews, as well as for any other non-audit services they rendered.\nAudit Fees\nThe aggregate fees billed for the fiscal years ended June 30, 2023 and 2022 for professional services rendered by the principal accountants for the audit of our annual financial statements and quarterly review of the financial statements included in our Form 10-K or services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years were $35,000 and $28,500 respectively.\nAudit-Related Fees\nDuring the fiscal year ended June 30, 2022, the Company incurred $10,000 in audit-related fees for the review and filing of our Regulation A Offering Statement in June, 2022. During the year ended June 30, 2023 there were no similar costs incurred.\nTax Fees\nFor the fiscal years ended June 30, 2023 and 2022, for professional services related to tax compliance, tax advice, and tax planning work by our principal accountants, we incurred expenses of $0 and $0 respectively.\nAll Other Fees\nNone.\nPre-Approval Policies and Procedures\nOur board of directors does not have an audit committee and has not adopted a policy on pre-approval of audit and permissible non-audit services.\nPART IV ITEM 15. EXHIBIT AND FINANCIAL STATEMENT SCHEDULES\n(a) Financial Statements\nOur financial statements as set forth in the Index to Consolidated Financial Statements attached hereto commencing on page are hereby incorporated by reference.\n(b) Exhibits\nThe following exhibits, which are numbered in accordance with Item 601 of Regulation S-K, are filed herewith or, as noted, incorporated by reference herein.\nExhibit No.\nDescription\n3.1\nArticles of Incorporation (Incorporated by reference to Exhibit 3.1 to the Registrants Registration Statement on Form S-1 (333-193347) filed with the Commission on January 13, 2014)\n3.2\nArticles of Amendment (Incorporated by reference to Exhibit 3.1 to the Registrants Current Report on Form 8-K filed with the Commission on September 20, 2017)\n3.3\nBylaws (Incorporated by reference to Exhibit 3.2 to the Registrants Registration Statement on Form S-1 (333-193347) filed with the Commission on January 13, 2014)\n3.4\nCertificate of Designation - Series A Preferred Stock (Incorporated by reference to Exhibit 3.1 to the Registrants Current Report on Form 8-K filed with the Commission on July 17, 2018 )\n3.5\nCertificate of Designation - Series B Preferred Stock (Incorporated by reference to Exhibit 3.1 to the Registrants Current Report on Form 8-K filed with the Commission on April 23, 2021)\n4.1\nSpecimen Stock Certificate (Incorporated by reference to Exhibit 4.2 to the Registrants Registration Statement on Form S-1 (333-193347) filed with the Commission on January 13, 2014)\n4.2\nForm of Warrant (Incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed with the Commission on April 23, 2021)\n4.3\nCommon Stock Purchase Warrant dated September 23, 2022 (Incorporated by reference to Exhibit 10.3 to the Registrants Current Report on Form 8-K filed with the Commission on September 28, 2022)\n4.4\nCommon Stock Purchase Warrant, Returnable, dated September 23, 2022 (Incorporated by reference to Exhibit 10.4 to the Registrants Current Report on Form 8-K filed with the Commission on September 28, 2022)\n10.1\nLease Receipt and terms and conditions (Incorporated by reference to Exhibit 10.2 the Registrants Annual Report on Form 10-K for Fiscal Year ended June 30, 2017)\n10.2\nForm of Subscription Agreement (Incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K filed with the Commission on April 23, 2021)\n10.3\nSettlement and Exchange Agreement between the Registrant and Eagle (Incorporated by reference to Exhibit 10.3 to the Registrants Current Report on Form 8-K filed with the Commission on April 23, 2021)\n10.4\nLetter of Engagement between the Registrant and SC (Incorporated by reference to Exhibit 10.4 to the Registrants Current Report on Form 8-K filed with the Commission on April 23, 2021)\n10.5\nConsulting Agreement with Sean Folkson (Incorporated by reference to Exhibit 10.3 to the Registrants Current Report on Form 8-K filed with the Commission on December 22, 2020)\n10.6\nAgreement For Shareholder Lock-Up And Acquisition Of Warrants with Sean Folkson (Incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed with the Commission on January 20, 2021)\n10.7\nForm of Securities Purchase Agreement (Incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed with the Commission on December 16, 2021)\n10.8\nForm of 8% Original Issue Discount Senior Secured Promissory Notes (Incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K filed with the Commission on December 16, 2021)\n10.9\nForm of Common Stock Purchase Warrant (Incorporated by reference to Exhibit 10.3 to the Registrants Current Report on Form 8-K filed with the Commission on December 16, 2021)\n10.10\nForm of Security Agreement (Incorporated by reference to Exhibit 10.4 to the Registrants Current Report on Form 8-K filed with the Commission on December 16, 2021)\n10.11\nForm of Pledge Agreement (Incorporated by reference to Exhibit 10.5 to the Registrants Current Report on Form 8-K filed with the Commission on December 16, 2021)\n10.12\nForm of Registration Rights Agreement (Incorporated by reference to Exhibit 10.6 to the Registrants Current Report on Form 8-K filed with the Commission on December 16, 2021)\n10.13\nForm of Guarantee (Incorporated by reference to Exhibit 10.7 to the Registrants Current Report on Form 8-K filed with the Commission on December 16, 2021)\n10.14\nSecurities Purchase Agreement dated September 23, 2022 (Incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed with the Commission on September 28, 2022)\n10.15\nPromissory Note dated September 23, 2022 (Incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K filed with the Commission on September 28, 2022)\nExhibit No.\nDescription\n10.16\nMost Favored Nation Amendment dated September 23, 2022 (Incorporated by reference to Exhibit 10.5 to the Registrants Current Report on Form 8-K filed with the Commission on September 28, 2022)\n10.17\nSubordination Agreement dated September 22, 2022 (Incorporated by reference to Exhibit 10.6 to the Registrants Current Report on Form 8-K filed with the Commission on September 28, 2022)\n10.18\nFinders Fee Agreement with JH Darbie & Co., dated as of August 22, 2022 (Incorporated by reference to Exhibit 10.8 to the Registrants Current Report on Form 8-K filed with the Commission on September 28, 2022 as amended)\n10.19\nLock-Up Agreement (Incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed with the Commission on January 31, 2023)\n10.20\nForbearance and Exchange Agreement dated February 4, 2023 (Incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed with the Commission on February 8, 2023)\n10.21\nSecurities Purchase Agreement dated February 5, 2023 (Incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K filed with the Commission on February 8, 2023)\n10.22\nPromissory Note dated February 5, 2023 (Incorporated by reference to Exhibit 10.3 to the Registrants Current Report on Form 8-K filed with the Commission on February 8, 2023)\n10.23\nFirst Common Stock Purchase Warrant dated February 5, 2023 (Incorporated by reference to Exhibit 10.4 to the Registrants Current Report on Form 8-K filed with the Commission on February 8, 2023)\n10.24\nSecond Common Stock Purchase Warrant dated February 5, 2023 (Incorporated by reference to Exhibit 10.5 to the Registrants Current Report on Form 8-K filed with the Commission on February 8, 2023)\n10.25\nPromissory Note with Sean Folkson dated February 7, 2023 (Incorporated by reference to Exhibit 10.6 to the Registrants Current Report on Form 8-K filed with the Commission on February 8, 2023)\n10.26\nForm of Warrant Amendment and Exercise Agreement (Incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed with the Commission on March 7, 2023)\n10.27\nExchange and Amendment Agreement with Puritan Partners LLC and Verition Multi-Strategy Master Fund Ltd. (Incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K filed with the Commission on March 7, 2023)\n10.28\nSecurities Purchase Agreement with Mast Hill Fund, L.P. (Incorporated by reference to Exhibit 10.3 to the Registrants Current Report on Form 8-K filed with the Commission on March 7, 2023)\n10.29\nPromissory Note dated with Mast Hill Fund, L.P. (Incorporated by reference to Exhibit 10.4 to the Registrants Current Report on Form 8-K filed with the Commission on March 7, 2023)\n10.30\nFirst Common Stock Purchase Warrant with Mast Hill Fund, L.P. (Incorporated by reference to Exhibit 10.5 to the Registrants Current Report on Form 8-K filed with the Commission on March 7, 2023)\n10.31\nSecond Common Stock Purchase Warrant with Mast Hill Fund, L.P. (Incorporated by reference to Exhibit 10.6 to the Registrants Current Report on Form 8-K filed with the Commission on March 7, 2023)\n10.32\nSecurities Purchase Agreement with Mast Hill Fund, L.P. (Incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed with the Commission on April 5, 2023)\n10.33\nPromissory Note with Mast Hill Fund, L.P. (Incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K filed with the Commission on April 5, 2023)\n10.34\nFirst Common Stock Purchase Warrant with Mast Hill Fund, L.P. (Incorporated by reference to Exhibit 10.3 to the Registrants Current Report on Form 8-K filed with the Commission on April 5, 2023)\n10.35\nSecond Common Stock Purchase Warrant with Mast Hill Fund, L.P. (Incorporated by reference to Exhibit 10.4 to the Registrants Current Report on Form 8-K filed with the Commission on April 5, 2023)\nExhibit No.\nDescription\n10.36\nSecurities Purchase Agreement with Mast Hill Fund, L.P. dated April 17, 2023\n10.37\nPromissory Note with Mast Hill Fund, L.P. dated April 17, 2023\n10.38\nFirst Common Stock Purchase Warrant with Mast Hill Fund, L.P. dated April 17, 2023\n10.39\nSecond Common Stock Purchase Warrant with Mast Hill Fund, L.P. dated April 17, 2023\n10.40\nSecurities Purchase Agreement with Mast Hill Fund, L.P. dated April 17, 2023\n10.41\nPromissory Note with Mast Hill Fund, L.P. dated June 1, 2023\n10.42\nPledge Agreement among Sean Folkson, Nightfood Holdings, Inc., and Mast Hill Fund, L.P. dated June 1, 2023\n10.43\nSecurity Agreement with Mast Hill Fund, L.P. dated June 1, 2023\n10.44\nSubsidiary Guarantee with Mast Hill Fund, L.P. dated June 1, 2023\n10.45\nSecurities Purchase Agreement with Fourth Man, LLC dated June 29, 2023\n10.46\nPromissory Note with Fourth Man, LLC dated June 29, 2023\n10.47\nCommon Stock Purchase Warrant issued to Fourth Man, LLC dated June 29, 2023\n10.48\nLetter of Engagement between the Registrant and SC dated July 7, 2023\n10.49\nCommon Stock Purchase Warrant issued to SC dated July 7, 2023\n10.50\nSecurities Purchase Agreement with Fourth Man, LLC dated August 28, 2023\n10.51\nPromissory Note with Fourth Man, LLC dated August 28, 2023\n10.52\nCommon Stock Purchase Warrant issued to Fourth Man, LLC dated August 28, 2023\n10.53\nSecurities Purchase Agreement with Mast Hill, L.P. dated October 6, 2023\n10.54\nPromissory Note with Mast Hill, LP dated October 6, 2023\n21.1\nSubsidiaries of the Registrant (Incorporated by reference to Exhibit 21.1 to the Registrants Registration Statement on Form S-1 (333-256548) filed with the Commission on May 27, 2021)\n31.1\nRule 13a-14(a)/15d-14(a) certification of Chief Executive Officer\n32.1\nSection 1350 certification of Chief Executive Officer\n101.INS\nXBRL Instance Document - The instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\nSIGNATURES\nIn accordance with the requirements of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nNightfood Holdings, Inc.\nOctober 13, 2023 By: /s/ Sean Folkson\nSean Folkson, President and\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons in the capacities and on the date indicated.\nSignature\nTitle\nDate\n/s/ Sean Folkson\nPresident, Chief Executive Officer and Chairman\nOctober 13, 2023\nSean Folkson\n(principal executive, financial and accounting officer)\n/s/ Nisa Amoils\nDirector\nOctober 13, 2023\nNisa Amoils\n/s/ Thanuja Hamilton\nDirector\nOctober 13, 2023\nThanuja Hamilton\n/s/ Tom Morse\nDirector\nOctober 13, 2023\nTom Morse\n0.03 0.07\n3.91\nfalse --06-30 FY 000-55406\n2022-07-01 2023-06-30\n2022-12-31\n2023-10-13\n2023-06-30\n2022-06-30\nus-gaap:SeriesAPreferredStockMember\n2023-06-30\nus-gaap:SeriesAPreferredStockMember\n2022-06-30\nus-gaap:SeriesBPreferredStockMember\n2023-06-30\nus-gaap:SeriesBPreferredStockMember\n2022-06-30\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2021-06-30\nus-gaap:SeriesAPreferredStockMember us-gaap:PreferredStockMember\n2021-06-30\nus-gaap:PreferredClassAMember us-gaap:PreferredStockMember\n2021-06-30\nus-gaap:SeriesBPreferredStockMember us-gaap:PreferredStockMember\n2021-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-06-30\nus-gaap:RetainedEarningsMember\n2021-06-30\n2021-06-30\nus-gaap:CommonStockMember\n2021-07-01 2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-07-01 2022-06-30\nus-gaap:SeriesBPreferredStockMember us-gaap:PreferredStockMember\n2021-07-01 2022-06-30\nus-gaap:RetainedEarningsMember\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2022-06-30\nus-gaap:SeriesAPreferredStockMember us-gaap:PreferredStockMember\n2022-06-30\nus-gaap:PreferredClassAMember us-gaap:PreferredStockMember\n2022-06-30\nus-gaap:SeriesBPreferredStockMember us-gaap:PreferredStockMember\n2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-06-30\nus-gaap:RetainedEarningsMember\n2022-06-30\nus-gaap:CommonStockMember\n2022-07-01 2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-07-01 2023-06-30\nus-gaap:SeriesBPreferredStockMember us-gaap:PreferredStockMember\n2022-07-01 2023-06-30\nus-gaap:RetainedEarningsMember\n2022-07-01 2023-06-30\nus-gaap:CommonStockMember\n2023-06-30\nus-gaap:SeriesAPreferredStockMember us-gaap:PreferredStockMember\n2023-06-30\nus-gaap:PreferredClassAMember us-gaap:PreferredStockMember\n2023-06-30\nus-gaap:SeriesBPreferredStockMember us-gaap:PreferredStockMember\n2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2023-06-30\nus-gaap:RetainedEarningsMember\n2023-06-30\nus-gaap:OtherCustomerMember\n2022-07-01 2023-06-30\nsrt:MinimumMember\n2022-07-01 2023-06-30\nsrt:MaximumMember\n2022-07-01 2023-06-30\nngtf:TwoOthersCustomerMember\n2021-07-01 2022-06-30\nsrt:MinimumMember\n2021-07-01 2022-06-30\nsrt:MaximumMember\n2021-07-01 2022-06-30\nngtf:ThreeVendorMember\n2022-07-01 2023-06-30\nngtf:FourVendorsMember\n2021-07-01 2022-06-30\nngtf:NineCustomersOneMember\n2023-06-30 2023-06-30\nngtf:NineCustomersThreeMember\n2023-06-30 2023-06-30\nngtf:SixCustomersOneMember\n2022-06-30 2022-06-30\nngtf:SixCustomersTwoMember\n2022-06-30 2022-06-30\nngtf:SixCustomersThreeMember\n2022-06-30 2022-06-30\nngtf:SecuritiesPurchaseAgreementMember us-gaap:ConvertibleNotesPayableMember\n2021-12-01 2021-12-10\nngtf:SecuritiesPurchaseAgreementMember us-gaap:ConvertibleNotesPayableMember\n2021-12-10\nngtf:SecuritiesPurchaseAgreementMember us-gaap:ConvertibleNotesPayableMember\n2022-06-01 2022-06-10\nngtf:SecuritiesPurchaseAgreementMember us-gaap:ConvertibleNotesPayableMember\n2022-06-10\n2022-06-10\nngtf:SecuritiesPurchaseAgreementMember\n2022-06-01 2022-06-10\nsrt:MinimumMember ngtf:ConvertiblePromissoryNoteAndSecurityPurchaseAgreementMember us-gaap:ConvertibleNotesPayableMember\n2022-06-10\nsrt:MaximumMember ngtf:ConvertiblePromissoryNoteAndSecurityPurchaseAgreementMember us-gaap:ConvertibleNotesPayableMember\n2021-12-10\nngtf:ConvertiblePromissoryNoteAndSecurityPurchaseAgreementMember us-gaap:ConvertibleNotesPayableMember\n2022-07-01 2023-06-30\nngtf:PAWarrantsMember\n2022-07-01 2023-06-30\nngtf:ClarkeHoldingsLLCMember\n2023-06-30\nngtf:ClarkeHoldingsLLCMember\n2022-07-01 2023-06-30\n2022-09-01 2022-09-23\nngtf:ForbearanceAndExchangeAgreementMember\n2022-07-01 2023-06-30\nngtf:ForbearanceAndExchangeAgreementMember\n2023-06-30\nus-gaap:ConvertibleNotesPayableMember\n2022-07-01 2023-06-30\nus-gaap:ConvertibleNotesPayableMember\n2021-07-01 2022-06-30\nus-gaap:ConvertibleNotesPayableMember\n2023-06-30\nus-gaap:ConvertibleNotesPayableMember\n2022-06-30\nngtf:PromissoryNotesAndSecuritiesPurchaseAgreementMember ngtf:PromissoryNotesMember\n2022-07-01 2023-06-30\nngtf:PromissoryNotesAndSecuritiesPurchaseAgreementMember ngtf:PromissoryNotesMember\n2023-06-30\nngtf:PromissoryNotesAndSecuritiesPurchaseAgreementMember ngtf:JHDarbieCoMember ngtf:PromissoryNotesMember\n2022-07-01 2023-06-30\nngtf:PromissoryNotesAndSecuritiesPurchaseAgreementMember ngtf:JHDarbieCoMember ngtf:PromissoryNotesMember\n2023-06-30\nngtf:PromissoryNotesAndSecuritiesPurchaseAgreementMember ngtf:SpencerClarkeLLCMember ngtf:PromissoryNotesMember\n2023-06-30\n2023-05-02 2023-05-02\n2023-05-02\nngtf:MastHillMember\n2023-02-01 2023-02-05\nngtf:MastHillMember\n2023-02-05\n2023-02-01 2023-02-05\n2023-02-05\nngtf:MastHillMember ngtf:JHDarbieCoMember\n2022-07-01 2023-06-30\nngtf:MastHillMember ngtf:JHDarbieCoMember\n2023-06-30\nngtf:MastHillMember ngtf:SpencerClarkeLLCMember\n2023-06-30\nngtf:FirstWarrantsMember ngtf:MastHillMember ngtf:SpencerClarkeLLCMember\n2023-06-30\nsrt:MinimumMember ngtf:MastHillMember ngtf:SpencerClarkeLLCMember\n2023-06-30\nsrt:MinimumMember ngtf:FirstWarrantsMember ngtf:MastHillMember ngtf:SpencerClarkeLLCMember\n2023-06-30\nsrt:MaximumMember ngtf:MastHillMember ngtf:SpencerClarkeLLCMember\n2023-06-30\nsrt:MaximumMember ngtf:FirstWarrantsMember ngtf:MastHillMember ngtf:SpencerClarkeLLCMember\n2023-06-30\nngtf:MastHillMember\n2023-02-01 2023-02-28\n2023-02-01 2023-02-28\nngtf:MastHillMember\n2023-02-28\n2023-02-28\nngtf:JHDarbieCoMember ngtf:WarrantsMember\n2022-07-01 2023-06-30\nngtf:JHDarbieCoMember\n2022-07-01 2023-06-30\nngtf:JHDarbieCoMember\n2023-06-30\nngtf:SpencerClarkeLLCMember\n2022-07-01 2023-06-30\nngtf:SpencerClarkeLLCMember\n2023-06-30\nsrt:MinimumMember ngtf:SpencerClarkeLLCMember\n2022-07-01 2023-06-30\nsrt:MinimumMember ngtf:SpencerClarkeLLCMember\n2023-06-30\nsrt:MaximumMember ngtf:SpencerClarkeLLCMember\n2022-07-01 2023-06-30\nsrt:MaximumMember ngtf:SpencerClarkeLLCMember\n2023-06-30\nngtf:MastHillMember\n2023-03-24 2023-03-24\n2023-03-24 2023-03-24\n2023-03-24\nngtf:MastHillMember\n2023-03-24\nngtf:JHDarbieCoMember\n2023-03-24 2023-03-24\nus-gaap:CommonStockMember\n2023-03-24\nngtf:SpencerClarkeLLCMember\n2023-03-24\nus-gaap:WarrantMember ngtf:SpencerClarkeLLCMember\n2022-07-01 2023-06-30\nus-gaap:WarrantMember ngtf:MastHillMember\n2023-06-30\nsrt:MinimumMember us-gaap:WarrantMember ngtf:SpencerClarkeLLCMember\n2022-07-01 2023-06-30\nsrt:MaximumMember us-gaap:WarrantMember ngtf:SpencerClarkeLLCMember\n2022-07-01 2023-06-30\nsrt:MaximumMember us-gaap:WarrantMember ngtf:SpencerClarkeLLCMember\n2023-06-30\nngtf:SpencerClarkeLLCMember\n2023-06-30\n2023-04-17 2023-04-17\n2023-04-17\nngtf:MastHillMember\n2023-04-17\nngtf:SpencerClarkeLLCMember\n2022-07-01 2023-06-30\nus-gaap:WarrantMember\n2023-06-30\nngtf:MastHillMember\n2023-06-30\nsrt:MaximumMember us-gaap:WarrantMember\n2023-06-30\nsrt:MinimumMember ngtf:WarrantsMember ngtf:SpencerClarkeLLCMember\n2022-07-01 2023-06-30\nsrt:MinimumMember us-gaap:WarrantMember\n2023-06-30\nsrt:MaximumMember us-gaap:WarrantMember ngtf:SpencerClarkeLLCMember\n2023-06-30\n2023-06-01 2023-06-01\nngtf:FourthManLLCMember\n2023-06-29 2023-06-29\n2023-06-29 2023-06-29\n2023-06-29\nngtf:JHDarbieCoMember\n2023-06-29 2023-06-29\nus-gaap:WarrantMember ngtf:SpencerClarkeLLCMember\n2023-06-29 2023-06-29\nus-gaap:WarrantMember ngtf:SpencerClarkeLLCMember\n2023-06-29\nngtf:PromissoryNotesMember\n2023-06-30\nngtf:PromissoryNotesMember\n2022-06-30\nngtf:PrincipalMember\n2021-06-30\nngtf:StockSettledDebtMember\n2021-06-30\nngtf:DebtDiscountMember\n2021-06-30\nngtf:NetValueMember\n2021-06-30\nngtf:PrincipalMember\n2021-07-01 2022-06-30\nngtf:NetValueMember\n2021-07-01 2022-06-30\nngtf:DebtDiscountMember\n2021-07-01 2022-06-30\nngtf:StockSettledDebtMember\n2021-07-01 2022-06-30\nsrt:MaximumMember ngtf:NetValueMember\n2022-06-30\nsrt:MinimumMember ngtf:NetValueMember\n2022-06-30\nngtf:PrincipalMember\n2022-06-30\nngtf:StockSettledDebtMember\n2022-06-30\nngtf:DebtDiscountMember\n2022-06-30\nngtf:NetValueMember\n2022-06-30\nngtf:CashRepaymentMember ngtf:PrincipalMember\n2022-07-01 2023-06-30\nngtf:CashRepaymentMember ngtf:NetValueMember\n2022-07-01 2023-06-30\nngtf:StockSettledDebtMember\n2022-07-01 2023-06-30\nngtf:NetValueMember\n2022-07-01 2023-06-30\nngtf:DebtDiscountMember\n2022-07-01 2023-06-30\nngtf:PrincipalMember\n2022-07-01 2023-06-30\nngtf:PrincipalMember\n2023-06-30\nngtf:StockSettledDebtMember\n2023-06-30\nngtf:DebtDiscountMember\n2023-06-30\nngtf:NetValueMember\n2023-06-30\nngtf:FourthMannNotesMember ngtf:PrincipalMember\n2022-06-30\nngtf:FourthMannNotesMember ngtf:DebtDiscountMember\n2022-06-30\nngtf:FourthMannNotesMember ngtf:NetValueMember\n2022-06-30\nngtf:FourthMannNotesMember ngtf:PrincipalMember\n2022-07-01 2023-06-30\nngtf:FourthMannNotesMember ngtf:NetValueMember\n2022-07-01 2023-06-30\nngtf:FourthMannNotesMember ngtf:DebtDiscountMember\n2022-07-01 2023-06-30\nngtf:FourthMannNotesMember ngtf:PrincipalMember\n2023-06-30\nngtf:FourthMannNotesMember ngtf:DebtDiscountMember\n2023-06-30\nngtf:FourthMannNotesMember ngtf:NetValueMember\n2023-06-30\nus-gaap:CommonStockMember\n2023-06-30\nus-gaap:CommonStockMember ngtf:CommonStockPurchaseWarrantsMember\n2023-06-30\nus-gaap:CommonStockMember ngtf:CommonStockPurchaseWarrantsMember\n2022-06-30\nus-gaap:PreferredClassBMember\n2023-06-30\nus-gaap:PreferredClassBMember\n2022-06-30\nus-gaap:NoteWarrantMember\n2022-07-01 2023-06-30\nus-gaap:NoteWarrantMember\n2023-06-30\nus-gaap:CommonStockMember ngtf:StockPurchaseWarrantsMember\n2023-06-30\nus-gaap:SeriesBPreferredStockMember\n2022-07-01 2023-06-30\nus-gaap:CommonStockMember\n2022-07-01 2023-06-30\nus-gaap:SeriesAPreferredStockMember\n2022-07-01 2023-06-30\nngtf:ConsultantMember us-gaap:SeriesAPreferredStockMember\n2022-07-01 2023-06-30\nus-gaap:SeriesBPreferredStockMember\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2021-07-01 2022-06-30\nus-gaap:SeriesBPreferredStockMember\n2020-07-01 2021-06-30\nus-gaap:WarrantMember\n2021-07-01 2022-06-30\nus-gaap:WarrantMember ngtf:BlackScholesModelMember\n2023-06-30 2023-06-30\nus-gaap:CommonStockMember us-gaap:WarrantMember\n2022-06-30 2022-06-30\nngtf:PlacementAgentMember\n2021-07-01 2022-06-30\nngtf:BlackScholesModelMember\n2021-07-01 2022-06-30\nus-gaap:WarrantMember ngtf:BlackScholesModelMember\n2021-07-01 2022-06-30\nus-gaap:WarrantMember ngtf:BlackScholesModelMember\n2022-06-30\nus-gaap:WarrantMember ngtf:BlackScholesModelMember\n2021-07-01 2022-06-30\nngtf:WarrantAgreementMember\n2021-07-01 2022-06-30\nngtf:WarrantAgreementMember\n2022-06-30\nngtf:LockUpAgreementMember\n2021-07-01 2022-06-30\nngtf:LockUpAgreementMember\n2022-06-30\nus-gaap:CommonStockMember\n2022-07-01 2023-06-30\nus-gaap:WarrantMember us-gaap:SeriesBPreferredStockMember\n2022-07-01 2023-06-30\nus-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:FirstWarrantsMember\n2022-07-01 2023-06-30\nngtf:SecondWarrantsMember\n2022-07-01 2023-06-30\nsrt:MinimumMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nsrt:MaximumMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:WarrantAgreementMember\n2022-07-01 2023-06-30\nngtf:LockUpAgreementMember\n2022-07-01 2023-06-30\nngtf:LockUpAgreementMember\n2023-06-30\nngtf:InvestorsAndPlacementAgentsMember\n2022-07-01 2023-06-30\nsrt:MinimumMember ngtf:BlackScholesMember\n2023-06-30\nsrt:MaximumMember ngtf:BlackScholesMember\n2023-06-30\nngtf:LetterOfEngagementAgreementMember\n2022-07-01 2023-06-30\nngtf:LetterOfEngagementAgreementMember\n2023-06-30\nngtf:WarrantAgreementExchangeMember\n2022-07-01 2023-06-30\nsrt:MinimumMember ngtf:WarrantAgreementExchangeMember\n2022-07-01 2023-06-30\nsrt:MaximumMember ngtf:WarrantAgreementExchangeMember\n2022-07-01 2023-06-30\nngtf:WarrantAgreementExchangeMember\n2023-06-30\n2023-06-30 2023-06-30\n2022-06-30 2022-06-30\nngtf:ReturnableWarrantsMember\n2022-09-23 2022-09-23\nngtf:ReturnableWarrantsMember\n2022-07-01 2023-06-30\nngtf:OwnershipMember ngtf:ReturnableWarrantsMember\n2022-07-01 2023-06-30\nngtf:ReturnableWarrantsMember ngtf:PlacementAgentMember\n2022-12-29 2022-12-29\nngtf:ReturnableWarrantsMember ngtf:MFNAgreementMember\n2022-12-29 2022-12-29\nngtf:ReturnableWarrantsMember\n2022-12-29\nngtf:ReturnableWarrantsMember\n2022-12-29 2022-12-29\nngtf:ReturnableWarrantsMember us-gaap:CommonStockMember\n2022-07-01 2023-06-30\nngtf:ReturnableWarrantsMember us-gaap:ConvertibleNotesPayableMember\n2022-07-01 2023-06-30\nngtf:ReturnableWarrantsMember ngtf:PlacementAgentMember\n2022-07-01 2023-06-30\nsrt:MinimumMember ngtf:ReturnableWarrantsMember ngtf:BlackScholesMember\n2023-06-30\nsrt:MaximumMember ngtf:ReturnableWarrantsMember ngtf:BlackScholesMember\n2023-06-30\nsrt:MinimumMember ngtf:ReturnableWarrantsMember\n2022-07-01 2023-06-30\nsrt:MaximumMember ngtf:ReturnableWarrantsMember\n2022-07-01 2023-06-30\nngtf:ReturnableWarrantsMember\n2023-06-30\nngtf:ZeroZeroThreeThreeThreeThreeMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroZeroThreeThreeThreeThreeMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroZeroFiveZeroZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroZeroFiveZeroZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroZeroFiveSixEightEightMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroZeroFiveSixEightEightMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroZeroSevenFourSevenMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroZeroSevenFourSevenMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroZeroEightZeroZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroZeroEightZeroZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroOneZeroZeroZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroOneZeroZeroZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroOneTwoZeroZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroOneTwoZeroZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroOneTwoFiveZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroOneTwoFiveZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroOneThreeEightZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroOneThreeEightZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroOneFiveZeroZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroOneFiveZeroZeroMember us-gaap:WarrantMember\n2022-06-30\nngtf:ZeroOneFiveZeroZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroOneFiveSixThreeMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroOneFiveSixThreeMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroTwoZeroZeroZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroTwoZeroZeroZeroMember us-gaap:WarrantMember\n2022-06-30\nngtf:ZeroTwoZeroZeroZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroTwoTwoFiveZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroTwoTwoFiveZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroTwoFiveZeroZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroTwoFiveZeroZeroMember us-gaap:WarrantMember\n2022-06-30\nngtf:ZeroTwoFiveZeroZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroTwoSixTwoSixMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroTwoSixTwoSixMember us-gaap:WarrantMember\n2022-06-30\nngtf:ZeroTwoSixTwoSixMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroTwoSevenZeroZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroTwoSevenZeroZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroTwoNineOneNineMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroTwoNineOneNineMember us-gaap:WarrantMember\n2022-06-30\nngtf:ZeroTwoNineOneNineMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroThreeZeroZeroZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroThreeZeroZeroZeroMember us-gaap:WarrantMember\n2022-06-30\nngtf:ZeroThreeZeroZeroZeroMember us-gaap:WarrantMember\n2023-06-30\nngtf:ZeroFiveZeroZeroZeroMember us-gaap:WarrantMember\n2022-07-01 2023-06-30\nngtf:ZeroFiveZeroZeroZeroMember us-gaap:WarrantMember\n2022-06-30\nngtf:ZeroFiveZeroZeroZeroMember us-gaap:WarrantMember\n2023-06-30\nus-gaap:WarrantMember\n2022-06-30\n2022-01-01\n2022-01-01 2022-01-01\nngtf:MrFolksonMember\n2023-06-30\nngtf:MrFolksonMember\n2022-06-30\nngtf:MrFolksonMember\n2022-01-20 2022-01-20\nngtf:MrFolksonMember us-gaap:CommonStockMember\n2023-06-30\nngtf:MrFolksonMember\n2023-02-07 2023-02-07\n2023-02-07\nsrt:DirectorMember\n2023-06-30\nngtf:OwnershipMember\n2023-06-30\n2023-08-28 2023-08-31\nus-gaap:SubsequentEventMember\n2023-08-28 2023-08-31\n2023-08-31\nngtf:FirstWarrantsMember us-gaap:SubsequentEventMember\n2023-08-28 2023-08-31\nngtf:SecondWarrantsMember us-gaap:SubsequentEventMember\n2023-08-28 2023-08-31\nus-gaap:CommonStockMember\n2023-08-31\nngtf:CompanyTreasuryMember\n2023-08-31\nngtf:JHDarbieCoIncMember\n2022-07-01 2023-06-30\nus-gaap:SubsequentEventMember\n2023-07-07\n2023-10-06 2023-10-06\nsrt:ScenarioForecastMember\n2023-10-06 2023-10-06\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure"
}