{
    "cik": "1594114",
    "company": "ZHRH Corp",
    "filing_type": "10-K",
    "filing_date": "2022-10-11",
    "period_of_report": "2022-06-30",
    "sic": "5020",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1594114/0001520138-22-000452-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1594114/000152013822000452/zhrh-20220630_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1594114/0001520138-22-000452.txt",
    "filename": "1594114_10K_2022_0001520138-22-000452.htm",
    "content": "Item 1. Business.\nHistory and Overview\nZHRH Corporation (we, our, us or the Company) was originally incorporated in the State of Nevada on July 13, 2011, as Ketdarina Corp. On May 7, 2021, the Company amended its Articles of Incorporation in Nevada to change its corporate name to ZHRH Corporation, our current name, which became effective on July 16, 2021.\nUntil November 19, 2014, the Company was in the business of wholesale of bedding products to industrial, commercial and institutional retailers, and other professional business users, or to other wholesalers and related subordinated services. On November 19, 2014, the Companys then principal shareholders sold their shares of the Company to Western Highlands Minerals, Ltd., a Vietnamese corporation (WHM), resigned from all positions with the Company and appointed WHMs designees as new management; WHM then took over the inactive bedding business from the Company, and cancelled all previous debt which was owed to them at that time.\nIn or about 2015, the Company phased out of its prior business and became a shell company, as such term is defined in Rule 12b-2 under the Exchange Act of 1934, as amended (the Exchange Act). The Company is currently a shell company.\nOn December 11, 2020, as a result of a receivership in the Eighth Judicial District Court in Clark County, Nevada, Case Number: A-20-816621-B, the plaintiff creditor in the case, Custodian Ventures LLC (the Custodian) received an order from the Clark County Court appointing David Lazar as the receiver of the Company. On the same date, David Lazar was appointed as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer, Chief Executive Officer and Chairman of the Board of Directors. On December 29, 2020, the Companys Charter was reinstated in the State of Nevada. The receivership was terminated by the Eighth Judicial District Court in Clark County, Nevada, under Case Number: A-20-816621-B on May 10, 2021 and on the same date, the court also discharged Mr. Lazar as the receiver.\nOn March 9, 2021, pursuant to the approval of the board of directors of the Company dated March 9, 2021, the Company issued 71,260,000 shares of common stock, as repayment of debt owed to the Custodian, in the amount of $18,355.\nTable of Content\nOn April 6, 2021, the Custodian entered into a Common Stock Purchase Agreement (the SPA) with Calgary Thunder Bay Limited (Calgary), pursuant to which Calgary purchased 71,260,000 shares of common stock of the Company from the Custodian, representing 95.01% of the total issued and outstanding shares of the Companys common stock. The sale was consummated on April 13, 2021. As a result of the sale, there was a change of control of the Company.\nOn that same date, Mr. David Lazar, who was the Companys then sole officer and director, submitted his resignation from all positions with the Company and appointed Brett Lovegrove as the sole director and officer of the Company.\nOn May 7, 2021, by consent of the Companys sole director and Calgary, as majority shareholder, the Company amended its corporate name to ZHRH Corporation and the name change became effective on July 16, 2021.\nOn July 16, 2021, the Company changed its trading symbol from KTDR to ZHEC.\nOn October 4, 2021, the Board of Directors of the Company increased the size of the Board by two persons and appointed each James Purnell Bond and Aymar de Lencquesaing as directors of the Company effective as of October 4, 2021. On October 4, 2021, the Board of the Company adopted Amended and Restated Bylaws.\nOn October 25, 2021, we entered into an amendment with Blue Oak Advisory Limited (Blue Oak) and Zhonguan Ruiheng Environmental Technology Company Limited (ZHRH China) (the Amendment), which was an amendment to an original agreement between ZHRH China and Blue Oak dated January 6, 2021, (the Original Agreement). The Company was not a party to the Original Agreement between ZHRH China and Blue Oak. The Amendment is effective as of October 25, 2021, and sets forth that Mr. Jean-Michel Doublet is to be appointed as the Companys Chief Executive Officer and Mr. Lionel Therond is to be appointed as the Companys Chief Financial Officer. The Amendment was entered into with the intent to set forth renumeration to be received by Mr. Jean-Michel Doublet and Mr. Lionel Therond in connection with any proposed business combination in which the Company acquires ZHRH China. The Company has not entered into any agreements, letters of intent or any other oral or written agreements in connection with any proposed business combination in which the Company acquires ZHRH China, other than the Amendment. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with any proposed business combination in which the Company acquires ZHRH China, or that any such business combination can occur at all (the Proposed Business Combination).\nPursuant to the Amendment, each Mr. Jean-Michel Doublet and Mr. Lionel Therond are to provide 25% of their working hours each week to their duties to the Company in exchange for the following: (i) Blue Oak is to receive an increased success fee under the Original Agreement upon consummation of the Proposed Business Combination, (ii) Mr. Jean-Michel Doublet and Mr. Lionel Therond are each to receive 0.5% of the Companys common stock on a fully diluted basis upon the occurrence of the Proposed Business Combination to vest 50% upon completion of the Proposed Business Combination and 50% 6 months thereafter and (iii) Mr. Jean-Michel Doublet and Mr. Lionel Therond are each to receive additional shares constituting 1.5% of the Companys then fully diluted common stock to vest upon the Companys uplisting to the OTCQB or Nasdaq.\nOn October 25, 2021, Mr. Brett Lovegrove, who has served as the sole director and officer of the Company since April 13, 2021, resigned from all officer positions with the Company effective on the same date.\nOn October 25, 2021, the Board of Directors of the Company took the following actions: (i) appointed Mr. Jean-Michel Doublet as the Companys Chief Executive Officer, (ii) appointed Mr. Lionel Therond as the Companys Chief Financial Officer and (iii) appointed Mr. Brett Lovegrove as the Chairman of the Board, all effective on the same date.\nMr. Doublet is a beneficial owner of 60% of Blue Oak and is the Chief Executive Officer of Blue Oak. Mr. Lionel Therond is a beneficial owner of 40% of Blue Oak and is a director at Blue Oak.\nBlue Oak is set to receive remuneration from the Company in connection with the Proposed Business Combination pursuant to the Original Agreement.\nOn March 9, 2022, the Board of Directors increased the size of the Board by three (3) persons and appointed each Jean-Michel Doublet, Lionel Therond, and Cindy Zhongye Li, as directors of the Company effective as of March 9, 2022. Mr. Therond is currently the Companys Chief Financial Officer, and Mr. Doublet is currently the Companys Chief Executive Officer.\nTable of Content\nNo Current Operations and Shell Status\nIn or about 2015, the Company phased out of its prior business and became a is a shell company, as such term is defined in Rule 12b-2 under the Exchange Act of 1934, as amended (the Exchange Act). The Company is currently a shell company.\nThe Company has no operations at this time, and currently does not have any principal products or services, customers or intellectual property. As the Company has no current operations, it also currently is not subject to any competitive business conditions. Further, the Company is not subject to any government approvals at this time, other than those applicable to it as a shell company, as such term is defined in Rule 12b-2 under the Exchange Act.\nPrior Receivership\nOn December 11, 2020, as a result of a receivership in the Eighth Judicial District Court in Clark County, Nevada, Case Number: A-20-816621-B, the plaintiff creditor in the case, Custodian Ventures LLC (the Custodian) received an order from the Clark County Court appointing David Lazar as the receiver of the Company. On the same date, David Lazar was appointed as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer, Chief Executive Officer and Chairman of the Board of Directors. On December 29, 2020, the Companys Charter was reinstated in the State of Nevada. The receivership was terminated by the Eighth Judicial District Court in Clark County, Nevada, under Case Number: A-20-816621-B on May 10, 2021 and on the same date, the court also discharged Mr. Lazar as the receiver.\nGoing Concern\nThe Company was only recently released from receivership in Nevada. The Companys financial statements have been presented on the basis that it is a going concern, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. At June 30, 2021, the Company had a accumulated deficit of $812,925 and negative working capital of $753,041. The financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nRecent Developments\nNote Purchase Agreement dated March 7, 2022 and Related Agreements\nOn March 7, 2022, the Company entered into a Note Purchase Agreement (the Note Purchase Agreement) with James Purnell Bond, a member of the Companys Board of Directors. Pursuant to the Note Purchase Agreement, the Company agreed to sell and issue to Mr. Bond, a convertible promissory note in the principal amount of $30,000 (the Note). The Note was issued to Mr. Bond on March 7, 2022. The Note carries an interest rate of 10% per annum and matures on December 31, 2022 (the Maturity Date). The Note converts automatically on the first business day following the completion of a transaction between the Company and Zhonghuan Ruiheng Environmental Technology Co., Ltd. (ZHRH China) pursuant to which the Company shall obtain a controlling interest in ZHRH China, shall have been completed and the Company shall have obtained such controlling interest, as determined by the Company (the ZHRH Transaction), into a number of unregistered and restricted fully paid and nonassessable shares of shares of the Companys common stock equal to (i) the indebtedness under the Note as of such conversion date divided by (ii) the value per share of common stock as determined based on a valuation of the Company of $30,000,000 and the number of issued and outstanding shares of common stock as of such conversion date (the Conversion Shares). In the event that the ZHRH Transaction is not completed prior to the Maturity Date, none of the indebtedness under the Note will convert or be convertible into shares of the Companys common stock and instead the indebtedness under the Note will come due and payable in full. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. In connection with the Note Purchase Agreement and the Note, on March 7, 2022, the Company entered into an Escrow Agreement (the Escrow Agreement) with Mr. Bond, and Anthony L.G., PLLC as the escrow agent (the Escrow Agent). Pursuant to the Escrow Agreement, Mr. Bond agreed to deliver the purchase price for the Note to the escrow account to be held by the Escrow Agent, until such time as the Escrow Agent receives an Escrow Release Notice signed by the Company and Mr. Bond instructing the release of the escrowed funds to the Company. The Escrow Agents fee under the Escrow Agreement is $2,500 to be paid by the Company.\nTable of Content\nSecurities Purchase Agreement dated January 24, 2022 and Related Agreements\nOn January 24, 2022, the Company entered into a Securities Purchase Agreement (the Securities Purchase Agreement) with Badon Partners SAS and Calgary Thunder Bay Limited. Calgary Thunder Bay Limited is the Companys majority shareholder, holding 71,260,000 shares of the Companys common stock at this time which constitutes 95.01% of the Companys issued and outstanding common stock. Xuejiao Fang is the 100% owner of Calgary Thunder Bay Limited and has the power to vote and dispose of the shares held by Calgary Thunder Bay Limited. Badon Partners SAS is 100% owned and controlled by Aymar de Lencquesaing a member of the Companys Board of Directors. Pursuant to the Securities Purchase Agreement, the Company agreed to sell and issue Badon Partners SAS a convertible promissory note in the principal amount of $200,000 (the Note) and to sell and issue to Badon Partners SAS and a number of shares of the Companys common stock equal to (i) $200,000 (the Shares Purchase Price) divided by (ii) the value per share of common stock as determined based on a valuation of the Company of $30,000,000 and the number of issued and outstanding shares of common stock as of the Shares Closing, as such term is defined in the Securities Purchase Agreement (the Shares). The term Share Closing is defined in the Securities Purchase Agreement as the first business day after the completion of the ZHRH Transaction. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the Securities Purchase Agreement, Calgary Thunder Bay Limited agreed that in the event that the ZHRH Transaction does not occur, and the Note becomes due and payable, Calgary Thunder Bay Limited will transfer 50% of the shares it holds in the Company to Badon Partners SAS in full satisfaction of the indebtedness under the Note. Calgary Thunder Bay Limited also agreed in the Securities Purchase Agreement to not directly or indirectly sell or offer to sell the shares of the Companys common stock held by Calgary Thunder Bay Limited until the earlier of, full repayment of the Note by the Company or full conversion of the Note. The Note was issued to Badon Partners SAS on January 24, 2022. The Note carries an interest rate of 10% per annum and matures on December 31, 2022 (the Maturity Date). The Note converts automatically on the first business day following the completion of the ZHRH Transaction, into a number of unregistered and restricted fully paid and nonassessable shares of shares of the Companys common stock equal to (i) the indebtedness under the Note as of such conversion date divided by (ii) the value per share of common stock as determined based on a valuation of the Company of $30,000,000 and the number of issued and outstanding shares of common stock as of such date conversion date (the Conversion Shares). In the event that the ZHRH Transaction is not completed prior to the Maturity Date, none of the indebtedness under the Note will convert or be convertible into shares of the Companys common stock and Calgary Thunder Bay Limited will transfer to Badon Partners SAS 50% of the shares of the Companys common stock held by Calgary Thunder Bay limited in accordance with the terms of the Note and the terms of the Securities Purchase Agreement. In connection with the Securities Purchase Agreement and the Note, on January 24, 2022, the Company entered into an Escrow Agreement (the Escrow Agreement) with Badon Partners SAS and Anthony L.G., PLLC as the escrow agent (the Escrow Agent). Pursuant to the Escrow Agreement, Badon Partners SAS agreed to deliver the purchase price for the Note to the escrow account to be held by the Escrow Agent, until such time as the Escrow Agent receives an Escrow Release Notice signed by the Company and Badon Partners SAS instructing the release of the escrowed funds to the Company. The Escrow Agents fee under the Escrow Agreement is $2,500 to be paid by the Company.\nNew Director Appointments\nOn March 9, 2022, the Board of Directors (the Board) of the Company increased the size of the Board by three (3) persons and appointed each Jean-Michel Doublet, Lionel Therond, and Cindy Zhongye Li, as directors of the Company effective as of March 9, 2022. Mr. Therond is currently the Companys Chief Financial Officer, and Mr. Doublet is currently the Companys Chief Executive Officer.\nEntry into Director Agreements\nOn March 9, 2022, the Board approved the entry of the following directors into director agreements with the Company:\n● Aymar de Lencquesaing\n● Brett Lovegrove\n● Cindy Li\nTable of Content\n● James P. Bond\n● Jean-Michel Doublet\n● Lionel Therond\nas further described in detail below. Brett Lovegrove is currently the Chairman of the Board. Mr. Therond is currently the Companys Chief Financial Officer, and Mr. Doublet is currently the Companys Chief Executive Officer.\nDirector Agreement with Aymar de Lencquesaing\nOn March 9, 2022, the Company entered into a Director Agreement with Aymar de Lencquesaing (the ADL Director Agreement). Pursuant to the ADL Director Agreement, Mr. de Lencquesaing agreed to perform the duties of a director in accordance with the terms of the ADL Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The ADL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. de Lencquesaing as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. de Lencquesaings resignation as a director of the Company (iii) Mr. de Lencquesaing death or (iv) failure of the shareholders of the Company to re-elect Mr. de Lencquesaing at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nPursuant to the ADL Director Agreement, the Company agreed to indemnify Mr. de Lencquesaing, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. de Lencquesaings status as a director in accordance with the terms and conditions set forth in the ADL Director Agreement. Pursuant to the ADL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company, with Mr. de Lencquesaing being named as an insured party under such insurance, following the completion of a transaction between the Company and Zhonghuan Ruiheng Environmental Technology Co., Ltd. (ZHRH China) pursuant to which the Company shall obtain a controlling interest in ZHRH China, shall have been completed and the Company shall have obtained such controlling interest, as determined by the Company (the ZHRH Transaction). There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the ADL Director Agreement, the Company agreed to compensate Mr. de Lencquesaing for such services $80,000 per each full year that he serves as a Director of the Company, to be paid as follows:\n● The deferred cash grant will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. de Lencquesaing service as a director of the Company as of that date at the time of closing (the First Grant), however the cash payment of the First Grant will not occur until the one year anniversary of the date of the First Grant.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. de Lencquesaing continues to serve as a director of the Company, the Company will grant Mr. de Lencquesaing $20,000 (each a Quarterly Grant) with the payment in cash of same to be made on the one year anniversary of each Quarterly Grant.\nDirector Agreement with Brett Lovegrove\nOn March 9, 2022, the Company entered into a Director Agreement with Brett Lovegrove (the BL Director Agreement). Pursuant to the BL Director Agreement, Mr. Lovegrove agreed to perform the duties of a director in accordance with the terms of the BL Director Agreement with a time commitment of 8-10 days per month, with 4 Board meetings per year. The BL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Lovegrove as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Lovegroves resignation as a director of the Company (iii) Mr. Lovegroves death or (iv) failure of the shareholders of the Company to re-elect Mr. Lovegrove at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nTable of Content\nPursuant to the BL Director Agreement, the Company agreed to indemnify Mr. Lovegrove, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Lovegroves status as a director in accordance with the terms and conditions set forth in the BL Director Agreement. Pursuant to the BL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction and Mr. Lovegrove will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the BL Director Agreement, the Company agreed to compensate Mr. Lovegrove for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Lovegroves service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Lovegrove ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Lovegrove continues to serve as a director of the Company, the Company will grant Mr. Lovegrove a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Lovegrove) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Lovegrove ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nDirector Agreement with Cindy Li\nOn March 9, 2022, the Company entered into a Director Agreement with Cindy Li (the CL Director Agreement). Pursuant to the CL Director Agreement, Ms. Li agreed to perform the duties of a director in accordance with the terms of the CL Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The CL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Ms. Li as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Ms. Lis resignation as a director of the Company (iii) Ms. Lis death or (iv) failure of the shareholders of the Company to re-elect Ms. Li at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nPursuant to the CL Director Agreement, the Company agreed to indemnify Ms. Li, if she becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Ms. Lis status as a director in accordance with the terms and conditions set forth in the CL Director Agreement. Pursuant to the CL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Ms. Li will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the CL Director Agreement, the Company agreed to compensate Ms. Li for such services by issuing her shares of the Companys common stock as follows:\n● The intent is that for each full year that she serves as a director of the Company, shell receive a number of shares of the Companys common stock having a total value of $80,000.\nTable of Content\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Ms. Lis service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Ms. Li ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Ms. Li continues to serve as a director of the Company, the Company will grant Ms. Li a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Ms. Li) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Ms. Li ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nDirector Agreement with James P. Bond\nOn March 9, 2022, the Company entered into a Director Agreement with James P. Bond (the JB Director Agreement). Pursuant to the JB Director Agreement, Mr. Bond agreed to perform the duties of a director in accordance with the terms of the JB Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The JB Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Bond as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Bonds resignation as a director of the Company (iii) Mr. Bonds death or (iv) failure of the shareholders of the Company to re-elect Mr. Bond at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nPursuant to the JB Director Agreement, the Company agreed to indemnify Mr. Bond, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Bonds status as a director in accordance with the terms and conditions set forth in the JB Director Agreement. Pursuant to the JB Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Bond will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the JB Director Agreement, the Company agreed to compensate Mr. Bond for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the Closing of the ZHRH Transaction and will be based on the length of Mr. Bonds service as a director of the Company as of that date at the time of Closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Bond ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the Closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Bond continues to serve as a director of the Company, the Company will grant Mr. Bond a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Bond) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Bond ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nTable of Content\nDirector Agreement with Jean-Michel Doublet\nOn March 9, 2022, the Company entered into a Director Agreement with Jean-Michel Doublet (the JD Director Agreement). Pursuant to the JD Director Agreement, Mr. Doublet agreed to perform the duties of a director in accordance with the terms of the JD Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The JD Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Doublet as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Doublets resignation as a director of the Company (iii) Mr. Doublets death or (iv) failure of the shareholders of the Company to re-elect Mr. Doublet at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nPursuant to the JD Director Agreement, the Company agreed to indemnify Mr. Doublet, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Doublets status as a director in accordance with the terms and conditions set forth in the JD Director Agreement. Pursuant to the JD Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Doublet will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the JD Director Agreement, the Company agreed to compensate Mr. Doublet for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a Director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Doublets service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Doublet ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Doublet continues to serve as a director of the Company, the Company will grant Mr. Doublet a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Doublet) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Doublet ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nDirector Agreement with Lionel Therond\nOn March 9, 2022, the Company entered into a Director Agreement with Lionel Therond (the LT Director Agreement). Pursuant to the LT Director Agreement, Mr. Therond agreed to perform the duties of a director in accordance with the terms of the LT Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The LT Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Therond as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Theronds resignation as a director of the Company (iii) Mr. Theronds death or (iv) failure of the shareholders of the Company to re-elect Mr. Therond at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nTable of Content\nPursuant to the LT Director Agreement, the Company agreed to indemnify Mr. Therond, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Theronds status as a director in accordance with the terms and conditions set forth in the LT Director Agreement. Pursuant to the LT Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Therond will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the LT Director Agreement, the Company agreed to compensate Mr. Therond for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a Director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Theronds service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Therond ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Therond continues to serve as a director of the Company, the Company will grant Mr. Therond a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Therond) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Therond ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nNew Secretary Appointment\nOn April 11, 2022, the Company appointed Lionel Therond to serve as secretary of the Company effective immediately.\nEmployees\nThe Company currently has no full time and no part time employees. The Company has been operating under the direction of its officers and directors.\nCovid-19\nThe outbreak of the coronavirus (COVID-19), which the World Health Organization declared in March 2020 to be a pandemic, continues to spread throughout the United States of America and the globe, including the new Omicron variants. The extent of the ultimate impact of the pandemic on the Companys operational and financial performance will depend on various developments, including the duration and spread of the outbreak, all of which cannot be reasonably predicted at this time. While management reasonably expects the COVID-19 outbreak to negatively impact the Companys financial condition, operating results, and timing and amounts of cash flows, the related financial consequences and duration are highly uncertain.\nTable of Content\nReports to Security Holders\nWe intend to furnish our shareholders annual reports containing financial statements audited by our independent registered public accounting firm and to make available quarterly reports containing unaudited financial statements for each of the first three quarters of each year. We file Quarterly Reports on Form 10-Q, Annual Reports on Form 10-K and Current Reports on Form 8-K with the Securities and Exchange Commission in order to meet our timely and continuous disclosure requirements. We may also file additional documents with the Commission if they become necessary in the course of our Companys operations.\nThe public may read and copy any materials that we file with the SEC at the SECs Public Reference Room at 100 F Street, NE, Washington, D.C. 20549. The public may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The address of that site is www.sec.gov. Item 1A. Risk Factors.\nYOU SHOULD CAREFULLY CONSIDER THE RISKS AND UNCERTAINTIES DESCRIBED BELOW AND THE OTHER INFORMATION CONTAINED OR INCORPORATED BY REFERENCE IN THIS ANNUAL REPORT ON FORM 10-K BEFORE DECIDING WHETHER TO INVEST IN THE COMPANYS COMMON STOCK. ADDITIONAL RISKS AND UNCERTAINTIES NOT PRESENTLY KNOWN TO THE COMPANY OR THAT THE COMPANY CURRENTLY DEEMS IMMATERIAL MAY ALSO IMPAIR THE COMPANYS BUSINESS OPERATIONS. IF ANY OF THE FOLLOWING RISKS ACTUALLY OCCUR, THE COMPANYS BUSINESS, FINANCIAL CONDITION OR OPERATING RESULTS COULD BE MATERIALLY ADVERSELY AFFECTED. IN SUCH CASE, THE TRADING PRICE OR THE COMPANYS COMMON STOCK COULD DECLINE AND YOU MAY LOSE PART OR ALL OF YOUR INVESTMENT. THIS ANNUAL REPORT ON FORM 10-K ALSO CONTAINS FORWARD-LOOKING STATEMENTS THAT INVOLVE RISKS AND UNCERTAINTIES. PLEASE SEE CAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS.\nRisks Related to our Company\nWe were previously in receivership.\nOn December 11, 2020, as a result of a receivership in the Eighth Judicial District Court in Clark County, Nevada, Case Number: A-20-816621-B, the plaintiff creditor in the case, Custodian Ventures LLC (the Custodian) received an order from the Clark County Court appointing David Lazar as the receiver of the Company. On the same date, David Lazar was appointed as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer, Chief Executive Officer and Chairman of the Board of Directors. On December 29, 2020, the Companys Charter was reinstated in the State of Nevada. The receivership was terminated by the Eighth Judicial District Court in Clark County, Nevada, under Case Number: A-20-816621-B on May 10, 2021 and on the same date, the court also discharged Mr. Lazar as the receiver.\nWe have a history of operating losses and our auditors have indicated that there is substantial doubt about our ability to continue as a going concern.\nThe Company was only recently released from receivership in Nevada. The Companys financial statements have been presented on the basis that it is a going concern, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. At June 30, 2022, the Company had a retained deficit of $812,925 and negative working capital of $753,041. At June 30, 2021, the Company had a retained deficit of $127,767 and negative working capital of $73,683. The financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern. The Companys continuation as a going concern is solely dependent upon the Companys ability to raise financing from third parties. There is no assurance that the Company will be successful in doing so. For further discussion about our ability to continue as a going concern and our plan for future liquidity, see Managements Discussion and Analysis of Financial Condition and Results of Operations.\nTable of Content\nBecause we are a shell company the holders of our restricted securities will not be able to sell their securities in reliance on Rule 144 and we cannot file registration statements under Section 5 of the Securities Act using a Form S-8, until we cease being a shell company.\nWe are a shell company as that term is defined by the applicable federal securities laws. Applicable provisions of Rule 144 specify that during that time that we are a shell company and for a period of one year thereafter, holders of our restricted securities cannot sell those securities in reliance on Rule 144. This restriction may have potential adverse effects on future efforts to seek additional capital through unregistered offerings. Another implication of us being a shell company is that we cannot file registration statements under Section 5 of the Securities Act using a Form S-8, a short form of registration to register securities issued to employees and consultants under an employee benefit plan. As result, one year after we cease being a shell company, assuming we are current in our reporting requirements with the Securities and Exchange Commission and have filed current Form 10 information with the SEC reflecting our status as an entity that is no longer a shell company for a period of not less than 12 months, holders of our restricted securities may then sell those securities in reliance on Rule 144 (provided, however, those holders satisfy all of the applicable requirements of that rule).\nThe Company may suffer from lack of availability of additional funds.\nWe expect to have ongoing needs for working capital in order to fund operations and to continue to expand our operations. To that end, we will be required to raise additional funds through equity or debt financing. However, there can be no assurance that we will be successful in securing additional capital on favorable terms, if at all. If we are successful, whether the terms are favorable or unfavorable, there is a potential that we will fail to comply with the terms of such financing, which could result in severe liability for our Company. If we are unsuccessful, we may need to (a) initiate cost reductions; (b) forego business development opportunities; (c) seek extensions of time to fund liabilities, or (d) seek protection from creditors. In addition, any future sale of our equity securities would dilute the ownership and control of your shares and could be at prices substantially below prices at which our shares currently trade. Our inability to raise capital could require us to significantly curtail or terminate our operations altogether. We may seek to increase our cash reserves through the sale of additional equity or debt securities. The sale of convertible debt securities or additional equity securities could result in additional and potentially substantial dilution to our shareholders. The incurrence of indebtedness would result in increased debt service obligations and could result in operating and financing covenants that would restrict our operations and liquidity. In addition, our ability to obtain additional capital on acceptable terms is subject to a variety of uncertainties.\nIn addition, if we are unable to generate adequate cash from operations, and if we are unable to find sources of funding, it may be necessary for us to sell all or a portion of our assets, enter into a business combination, or reduce or eliminate operations. These possibilities, to the extent available, may be on terms that result in significant dilution to our shareholders or that result in our shareholders losing all of their investment in our Company.\nOur acquisition strategy creates risks for our business.\nWe expect that we will pursue acquisitions of businesses, assets or technologies. We may fail to identify attractive acquisition candidates or we may be unable to reach acceptable terms for future acquisitions. We might not be able to raise enough cash to compete for attractive acquisition targets. If we are unable to complete acquisitions in the future, our ability to engage in an ongoing business will be impaired.\nWe may pay for acquisitions by issuing additional shares of our common stock, which would dilute our stockholders, or by issuing debt, which could include terms that restrict our ability to operate our business or pursue other opportunities and subject us to meaningful debt service obligations. We may also use significant amounts of cash to complete acquisitions. To the extent that we complete acquisitions in the future, we likely will incur future depreciation and amortization expenses associated with the acquired assets. We may also record significant amounts of intangible assets, including goodwill, which could become impaired in the future. Acquisitions involve numerous other risks, including:\n● difficulties integrating the operations, technologies, services and personnel of the acquired companies;\n● challenges maintaining our internal standards, controls, procedures and policies;\nTable of Content\n● diversion of managements attention from other business concerns;\n● over-valuation by us of acquired companies;\n● litigation resulting from activities of the acquired company, including claims from terminated employees, customers, former stockholders and other third parties;\n● insufficient revenues to offset increased expenses associated with the acquisitions and unanticipated liabilities of the acquired companies;\n● insufficient indemnification or security from the selling parties for legal liabilities that we may assume in connection with our acquisitions;\n● entering markets in which we have no prior experience and may not succeed;\n● risks associated with foreign acquisitions, such as communication and integration problems resulting from geographic dispersion and language and cultural differences, compliance with foreign laws and regulations and general economic or political conditions in other countries or regions;\n● potential loss of key employees of the acquired companies; and\n● impairment of relationships with clients and employees of the acquired companies as a result of the integration of acquired operations and new management personnel.\nThe ongoing outbreak of the coronavirus may cause an overall decline in the economy as a whole and may materially harm our Company.\nThe outbreak of the coronavirus (COVID-19), which the World Health Organization declared in March 2020 to be a pandemic, continues to spread throughout the United States of America and the globe, including the new Omicron variants. The extent of the ultimate impact of the pandemic on the Companys operational and financial performance will depend on various developments, including the duration and spread of the outbreak, all of which cannot be reasonably predicted at this time. While management reasonably expects the COVID-19 outbreak to negatively impact the Companys financial condition, operating results, and timing and amounts of cash flows, the related financial consequences and duration are highly uncertain.\nThe Company may suffer from a lack of liquidity.\nIf we incur indebtedness, the Company subjects itself to increased debt service obligations which could result in operating and financing covenants that would restrict our operations and liquidity. This would impair our ability to hire the necessary senior and support personnel required for our business, as well as carry out its acquisition strategy and other business objectives.\nEconomic conditions could adversely impact our business.\nA downturn in economic conditions in one or more of the Companys future markets could have a material adverse effect on our results of operations, financial condition, business and prospects. The existing federal deficit, as well as deficit spending by the government as the result of adverse developments in the economy or other reasons, can lead to continuing pressure to reduce government expenditures for other purposes. Such actions in turn may adversely affect our results of operations.\nThe requirements of being, a public company may strain our resources and distract our management, which could make it difficult to manage our business.\nWe are a voluntary filer with the SEC, however our choice to voluntarily file reports with the SEC will be time-consuming and expensive and could have a negative effect on our business, results of operations and financial condition.\nTable of Content\nWe are required to comply with certain provisions of Section 404 of the Sarbanes-Oxley Act of 2002, as amended (the Sarbanes-Oxley Act) and if we fail to continue to comply, our business could be harmed, and the price of our securities could decline.\nRules adopted by the SEC pursuant to Section 404 of the Sarbanes-Oxley Act require an annual assessment of internal control over financial reporting, and for certain issuers an attestation of this assessment by the issuers independent registered public accounting firm. The standards that must be met for management to assess the internal control over financial reporting as effective are evolving and complex, and require significant documentation, testing, and possible remediation to meet the detailed standards. We expect to incur significant expenses and to devote resources to Section 404 compliance on an ongoing basis. It is difficult for us to predict how long it will take or costly it will be to complete the assessment of the effectiveness of our internal control over financial reporting for each year and to remediate any deficiencies in our internal control over financial reporting. As a result, we may not be able to complete the assessment and remediation process on a timely basis. In the event that we determine that our internal control over financial reporting is not effective as defined under Section 404, we cannot predict how regulators will react or how the market prices of our securities will be affected; however, we believe that there is a risk that investor confidence and the market value of our securities may be negatively affected.\nRisks Related to Our Common Stock\nOur common stock is currently on the Pink Tier of OTC Markets and there is no active public market for our common stock and an active trading market may not ever develop or, even if developed, may not be available to all shareholders, may not be sustained or may cease to exist.\nOur common stock is currently on the Pink Tier of OTC Market Group LLCs Marketplace under the symbol ZHEC. The OTC Market is a network of security dealers who buy and sell stock. The dealers are connected by a computer network that provides information on current bids and asks, as well as volume information. The trading of securities on the OTC Pink is often sporadic. An active trading market may not ever develop or, even if developed, may not be available to all shareholders, may not be sustained or may cease to exist\nOur common stock is subject to risks arising from restrictions on reliance on Rule 144 by shell companies or former shell companies.\nUnder a regulation of the SEC known as Rule 144, a person who beneficially owns restricted securities of an issuer and who is not an affiliate of that issuer may sell them without registration under the Securities Act provided that certain conditions have been met. One of these conditions is that such person has held the restricted securities for a prescribed period. However, Rule 144 is unavailable for the resale of securities issued by an issuer that is a shell company (other than a business combination related shell company) or, unless certain conditions are met, that has been at any time previously a shell company.\nThe SEC defines a shell company as a company that has (a) no or nominal operations and (b) either (i) no or nominal assets, (ii) assets consisting solely of cash and cash equivalents; or (iii) assets consisting of any amount of cash and cash equivalents and nominal other assets.\nThe Company is currently a shell company as such term is defined in Rule 12b-2 under the Exchange Act.\nRule 144 is available for the resale of securities of former shell companies if and for as long as the following conditions are met:\n(i) the issuer of the securities that was formerly a shell company has ceased to be a shell company,\n(ii) the issuer of the securities is subject to the reporting requirements of Section 13 or 15(d) of the Exchange Act,\n(iii) the issuer of the securities has filed all Exchange Act reports and material required to be filed, as applicable, during the preceding 12 months (or such shorter period that the issuer was required to file such reports and materials), other than Current Reports on Form 8-K; and\n(iv) at least one year has elapsed from the time that the issuer filed current comprehensive disclosure with the SEC reflecting its status as an entity that is not a shell company known as Form 10 Information.\nTable of Content\nAll of our authorized common stock is currently issued and outstanding.\nAs of the date hereof, the authorized capital stock of the Company consists of 75,000,000 shares of common stock, of which all 75,000,000 shares are issued and outstanding. Accordingly, we are unable to issue any additional shares of common stock at this time.\nOur common stock constitutes restricted securities and is subject to limited transferability.\nAll of our common stock shares, should be considered a long-term, illiquid investment. In addition, our common stock, is not registered under any state securities laws that would permit their transfer. Because of these restrictions and the absence of an active trading market for our securities, a stockholder will likely be unable to liquidate an investment even though other personal financial circumstances would dictate such liquidation.\nFINRA sales practice requirements may also limit a stockholders ability to buy and sell our stock.\nIn addition to the penny stock rules, FINRA has adopted FINRA Rule 2111 that requires a broker-dealer to have reasonable grounds for believing that an investment is suitable for a customer before recommending the investment. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nWe do not intend to pay dividends for the foreseeable future.\nWe have never declared or paid any cash dividends on our stock and do not intend to pay any cash dividends in the foreseeable future. We anticipate that we will retain all of our future earnings for use in the development of our business and for general corporate purposes. Any determination to pay dividends in the future will be at the discretion of our Board of Directors.\nIf we are unable to comply with the financial reporting requirements mandated by the SECs regulations, investors may lose confidence in our financial reporting and the price of our common stock, if a market ever does develop for it, could decline.\nIf we fail to maintain effective internal controls over financial reporting, our ability to produce timely, accurate and reliable periodic financial statements could be impaired. If we do not maintain adequate internal control over financial reporting, investors could lose confidence in the accuracy of our periodic reports filed under the Exchange Act. Additionally, our ability to obtain additional financing could be impaired or a lack of investor confidence in the reliability and accuracy of our public reporting could cause our stock price to decline. Item 1B. Unresolved Staff Comments.\nNot applicable. Item 2. Properties.\nThe Companys headquarters are located at 50 West Liberty St. Suite 880, Reno, NV 89501, which is a leased office for the purposes of receive mail for which the Company pays $125 per year. As we currently do not have any operations, we believe that these facilities are adequate at this time and that we will be able to obtain appropriate additional facilities or alternative facilities on commercially reasonable terms if and when necessary.\nTable of Content Item 3. Legal Proceedings.\nThe Company may be involved in certain legal proceedings that arise from time to time in the ordinary course of its business. Legal expenses associated with any contingency are expensed as incurred. The Companys officers and directors are not aware of any threatened or pending litigation to which the Company is a party, or to which any of its property is the subject and which would have any material, adverse effect on the Company. Item 4. Mine Safety Disclosures.\nNot applicable.\nTable of Content\nPart II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nOur common stock is currently on the Pink Tier of OTC Markets with the symbol ZHEC and there is no active public market for common stock and an active trading market may not ever develop or, even if developed, may not be available to all shareholders, may not be sustained or may cease to exist.\nThe OTC Market is a network of security dealers who buy and sell stock. The dealers are connected by a computer network that provides information on current bids and asks, as well as volume information. The trading of securities on the OTC Pink is often sporadic and investors may have difficulty buying and selling our shares or obtaining market quotations for them.\nAs there has been no active trading in our common stock, we are unable to set forth the high and low bid quotations for our common stock on a quarterly basis for the prior two fiscal years or the subsequent periods to date.\nDividends\nThe Company has not declared any dividends since inception and does not anticipate paying any dividends in the foreseeable future on its common stock. The payment of dividends is within the discretion of the Board of Directors and will depend on the Companys earnings, capital requirements, financial condition, and other relevant factors. There are no restrictions that currently limit the Companys ability to pay dividends on its common stock other than those generally imposed by applicable state law.\nEquity Compensation Plans\nNone.\nHolders\nAs of June 30, 2022, and as of the date of this report, there are 75,000,000 shares of our $0.001 par value per share common stock issued and outstanding and approximately 41 record owners of our common stock.\nTransfer Agent and Registrar\nThe Companys transfer agent, West Coast Stock Transfer, is located at 721 N Vulcan Ave #205, Encinitas, CA 92024.\nRecent Sales of Unregistered Securities\nOn March 9, 2021, pursuant to the approval of the board of directors of the Company dated March 9, 2021, the Company issued 71,260,000 shares of common stock, as repayment of debt owed to the Custodian, in the amount of $18,355.\nThese shares were issued in reliance on Section 4(a)(2) of the Securities Act of 1933, as amended and the provisions of Regulation D promulgated thereunder.\nOur Securities\nGeneral\nAs of the date hereof, the authorized capital stock of the Company consists of 75,000,000 shares of common stock, par value $.001 per share, of which all 75,000,000 shares are issued and outstanding. There is no other class of shares of the Company authorized, issued or outstanding.\nTable of Content\nCommon Stock\nEach share of common stock is entitled to one vote with respect to all matters to be acted on by the stockholders.\nPreferred Stock\nNone.\nWarrants\nThere are currently no outstanding warrants of the Company.\nOptions\nThere are currently no options outstanding. Item 6. [Reserved].\nNot applicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis of the results of operations and financial condition of the Company for the years ended June 30, 2022 and 2021, should be read in conjunction with the other sections of this Annual Report, including Description of Business and the Financial Statements and notes thereto of the Company included in this Annual Report. The various sections of this discussion contain forward-looking statements, all of which are based on our current expectations and could be affected by the uncertainties and risk factors described throughout this Annual Report as well as other matters over which we have no control. See Cautionary Note Regarding Forward-Looking Statements. Our actual results may differ materially. The Company does not undertake any obligation to update forward-looking statements to reflect events or circumstances occurring after the date of this Annual Report.\nOrganizational History of the Company and Overview\nZHRH Corporation (we, our, us or the Company) was originally incorporated in the State of Nevada on July 13, 2011, as Ketdarina Corp. On May 7, 2021, the Company amended its Articles of Incorporation in Nevada to change its corporate name to ZHRH Corporation, our current name, which became effective on July 16, 2021.\nUntil November 19, 2014, the Company was in the business of wholesale of bedding products to industrial, commercial and institutional retailers, and other professional business users, or to other wholesalers and related subordinated services. On November 19, 2014, the Companys then principal shareholders sold their shares of the Company to Western Highlands Minerals, Ltd., a Vietnamese corporation (WHM), resigned from all positions with the Company and appointed WHMs designees as new management; WHM then took over the inactive bedding business from the Company, and cancelled all previous debt which was owed to them at that time.\nIn or about 2015, the Company phased out of its prior business and became a shell company, as such term is defined in Rule 12b-2 under the Exchange Act of 1934, as amended (the Exchange Act). The Company is currently a shell company.\nOn December 11, 2020, as a result of a receivership in the Eighth Judicial District Court in Clark County, Nevada, Case Number: A-20-816621-B, the plaintiff creditor in the case, Custodian Ventures LLC (the Custodian) received an order from the Clark County Court appointing David Lazar as the receiver of the Company. On the same date, David Lazar was appointed as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer, Chief Executive Officer and Chairman of the Board of Directors. On December 29, 2020, the Companys Charter was reinstated in the State of Nevada. The receivership was terminated by the Eighth Judicial District Court in Clark County, Nevada, under Case Number: A-20-816621-B on May 10, 2021 and on the same date, the court also discharged Mr. Lazar as the receiver.\nTable of Content\nOn March 9, 2021, pursuant to the approval of the board of directors of the Company dated March 9, 2021, the Company issued 71,260,000 shares of common stock, as repayment of debt owed to the Custodian, in the amount of $18,355.\nOn April 6, 2021, the Custodian entered into a Common Stock Purchase Agreement (the SPA) with Calgary Thunder Bay Limited (Calgary), pursuant to which Calgary purchased 71,260,000 shares of common stock of the Company from the Custodian, representing 95.01% of the total issued and outstanding shares of the Companys common stock. The sale was consummated on April 13, 2021. As a result of the sale, there was a change of control of the Company.\nOn that same date, Mr. David Lazar, who was the Companys then sole officer and director, submitted his resignation from all positions with the Company and appointed Brett Lovegrove as the sole director and officer of the Company.\nOn May 7, 2021, by consent of the Companys sole director and Calgary, as majority shareholder, the Company amended its corporate name to ZHRH Corporation and the name change became effective on July 16, 2021.\nOn July 16, 2021, the Company changed its trading symbol from KTDR to ZHEC.\nOn October 4, 2021, the Board of Directors of the Company increased the size of the Board by two persons and appointed each James Purnell Bond and Aymar de Lencquesaing as directors of the Company effective as of October 4, 2021. On October 4, 2021, the Board of the Company adopted Amended and Restated Bylaws.\nOn October 25, 2021, we entered into an amendment with Blue Oak Advisory Limited (Blue Oak) and Zhonguan Ruiheng Environmental Technology Company Limited (ZHRH China) (the Amendment), which was an amendment to an original agreement between ZHRH China and Blue Oak dated January 6, 2021, (the Original Agreement). The Company was not a party to the Original Agreement between ZHRH China and Blue Oak. The Amendment is effective as of October 25, 2021, and sets forth that Mr. Jean-Michel Doublet is to be appointed as the Companys Chief Executive Officer and Mr. Lionel Therond is to be appointed as the Companys Chief Financial Officer. The Amendment was entered into with the intent to set forth renumeration to be received by Mr. Jean-Michel Doublet and Mr. Lionel Therond in connection with any proposed business combination in which the Company acquires ZHRH China. The Company has not entered into any agreements, letters of intent or any other oral or written agreements in connection with any proposed business combination in which the Company acquires ZHRH China, other than the Amendment. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with any proposed business combination in which the Company acquires ZHRH China, or that any such business combination can occur at all (the Proposed Business Combination).\nPursuant to the Amendment, each Mr. Jean-Michel Doublet and Mr. Lionel Therond are to provide 25% of their working hours each week to their duties to the Company in exchange for the following: (i) Blue Oak is to receive an increased success fee under the Original Agreement upon consummation of the Proposed Business Combination, (ii) Mr. Jean-Michel Doublet and Mr. Lionel Therond are each to receive 0.5% of the Companys common stock on a fully diluted basis upon the occurrence of the Proposed Business Combination to vest 50% upon completion of the Proposed Business Combination and 50% 6 months thereafter and (iii) Mr. Jean-Michel Doublet and Mr. Lionel Therond are each to receive additional shares constituting 1.5% of the Companys then fully diluted common stock to vest upon the Companys uplisting to the OTCQB or Nasdaq.\nOn October 25, 2021, Mr. Brett Lovegrove, who has served as the sole director and officer of the Company since April 13, 2021, resigned from all officer positions with the Company effective on the same date.\nOn October 25, 2021, the Board of Directors of the Company took the following actions: (i) appointed Mr. Jean-Michel Doublet as the Companys Chief Executive Officer, (ii) appointed Mr. Lionel Therond as the Companys Chief Financial Officer and (iii) appointed Mr. Brett Lovegrove as the Chairman of the Board, all effective on the same date.\nMr. Doublet is a beneficial owner of 60% of Blue Oak and is the Chief Executive Officer of Blue Oak. Mr. Lionel Therond is a beneficial owner of 40% of Blue Oak and is a director at Blue Oak.\nTable of Content\nBlue Oak is set to receive remuneration from the Company in connection with the Proposed Business Combination pursuant to the Original Agreement.\nOn March 9, 2022, the Board of Directors increased the size of the Board by three (3) persons and appointed each Jean-Michel Doublet, Lionel Therond, and Cindy Zhongye Li, as directors of the Company effective as of March 9, 2022. Mr. Therond is currently the Companys Chief Financial Officer, and Mr. Doublet is currently the Companys Chief Executive Officer.\nNo Current Operations and Shell Status\nIn or about 2015, the Company phased out of its prior business and became a is a shell company, as such term is defined in Rule 12b-2 under the Exchange Act of 1934, as amended (the Exchange Act). The Company is currently a shell company.\nThe Company has no operations at this time, and currently does not have any principal products or services, customers or intellectual property. As the Company has no current operations, it also currently is not subject to any competitive business conditions. Further, the Company is not subject to any government approvals at this time, other than those applicable to it as a shell company, as such term is defined in Rule 12b-2 under the Exchange Act.\nPrior Receivership\nOn December 11, 2020, as a result of a receivership in the Eighth Judicial District Court in Clark County, Nevada, Case Number: A-20-816621-B, the plaintiff creditor in the case, Custodian Ventures LLC (the Custodian) received an order from the Clark County Court appointing David Lazar as the receiver of the Company. On the same date, David Lazar was appointed as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer, Chief Executive Officer and Chairman of the Board of Directors. On December 29, 2020, the Companys Charter was reinstated in the State of Nevada. The receivership was terminated by the Eighth Judicial District Court in Clark County, Nevada, under Case Number: A-20-816621-B on May 10, 2021 and on the same date, the court also discharged Mr. Lazar as the receiver.\nRecent Developments\nNote Purchase Agreement dated March 7, 2022 and Related Agreements\nOn March 7, 2022, the Company entered into a Note Purchase Agreement (the Note Purchase Agreement) with James Purnell Bond, a member of the Companys Board of Directors. Pursuant to the Note Purchase Agreement, the Company agreed to sell and issue to Mr. Bond, a convertible promissory note in the principal amount of $30,000 (the Note). The Note was issued to Mr. Bond on March 7, 2022. The Note carries an interest rate of 10% per annum and matures on December 31, 2022 (the Maturity Date). The Note converts automatically on the first business day following the completion of a transaction between the Company and Zhonghuan Ruiheng Environmental Technology Co., Ltd. (ZHRH China) pursuant to which the Company shall obtain a controlling interest in ZHRH China, shall have been completed and the Company shall have obtained such controlling interest, as determined by the Company (the ZHRH Transaction), into a number of unregistered and restricted fully paid and nonassessable shares of shares of the Companys common stock equal to (i) the indebtedness under the Note as of such conversion date divided by (ii) the value per share of common stock as determined based on a valuation of the Company of $30,000,000 and the number of issued and outstanding shares of common stock as of such conversion date (the Conversion Shares). In the event that the ZHRH Transaction is not completed prior to the Maturity Date, none of the indebtedness under the Note will convert or be convertible into shares of the Companys common stock and instead the indebtedness under the Note will come due and payable in full. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. In connection with the Note Purchase Agreement and the Note, on March 7, 2022, the Company entered into an Escrow Agreement (the Escrow Agreement) with Mr. Bond, and Anthony L.G., PLLC as the escrow agent (the Escrow Agent). Pursuant to the Escrow Agreement, Mr. Bond agreed to deliver the purchase price for the Note to the escrow account to be held by the Escrow Agent, until such time as the Escrow Agent receives an Escrow Release Notice signed by the Company and Mr. Bond instructing the release of the escrowed funds to the Company. The Escrow Agents fee under the Escrow Agreement is $2,500 to be paid by the Company.\nTable of Content\nSecurities Purchase Agreement dated January 24, 2022 and Related Agreements\nOn January 24, 2022, the Company entered into a Securities Purchase Agreement (the Securities Purchase Agreement) with Badon Partners SAS and Calgary Thunder Bay Limited. Calgary Thunder Bay Limited is the Companys majority shareholder, holding 71,260,000 shares of the Companys common stock at this time which constitutes 95.01% of the Companys issued and outstanding common stock. Xuejiao Fang is the 100% owner of Calgary Thunder Bay Limited and has the power to vote and dispose of the shares held by Calgary Thunder Bay Limited. Badon Partners SAS is 100% owned and controlled by Aymar de Lencquesaing a member of the Companys Board of Directors. Pursuant to the Securities Purchase Agreement, the Company agreed to sell and issue Badon Partners SAS a convertible promissory note in the principal amount of $200,000 (the Note) and to sell and issue to Badon Partners SAS and a number of shares of the Companys common stock equal to (i) $200,000 (the Shares Purchase Price) divided by (ii) the value per share of common stock as determined based on a valuation of the Company of $30,000,000 and the number of issued and outstanding shares of common stock as of the Shares Closing, as such term is defined in the Securities Purchase Agreement (the Shares). The term Share Closing is defined in the Securities Purchase Agreement as the first business day after the completion of the ZHRH Transaction. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the Securities Purchase Agreement, Calgary Thunder Bay Limited agreed that in the event that the ZHRH Transaction does not occur, and the Note becomes due and payable, Calgary Thunder Bay Limited will transfer 50% of the shares it holds in the Company to Badon Partners SAS in full satisfaction of the indebtedness under the Note. Calgary Thunder Bay Limited also agreed in the Securities Purchase Agreement to not directly or indirectly sell or offer to sell the shares of the Companys common stock held by Calgary Thunder Bay Limited until the earlier of, full repayment of the Note by the Company or full conversion of the Note. The Note was issued to Badon Partners SAS on January 24, 2022. The Note carries an interest rate of 10% per annum and matures on December 31, 2022 (the Maturity Date). The Note converts automatically on the first business day following the completion of the ZHRH Transaction, into a number of unregistered and restricted fully paid and nonassessable shares of shares of the Companys common stock equal to (i) the indebtedness under the Note as of such conversion date divided by (ii) the value per share of common stock as determined based on a valuation of the Company of $30,000,000 and the number of issued and outstanding shares of common stock as of such date conversion date (the Conversion Shares). In the event that the ZHRH Transaction is not completed prior to the Maturity Date, none of the indebtedness under the Note will convert or be convertible into shares of the Companys common stock and Calgary Thunder Bay Limited will transfer to Badon Partners SAS 50% of the shares of the Companys common stock held by Calgary Thunder Bay limited in accordance with the terms of the Note and the terms of the Securities Purchase Agreement. In connection with the Securities Purchase Agreement and the Note, on January 24, 2022, the Company entered into an Escrow Agreement (the Escrow Agreement) with Badon Partners SAS and Anthony L.G., PLLC as the escrow agent (the Escrow Agent). Pursuant to the Escrow Agreement, Badon Partners SAS agreed to deliver the purchase price for the Note to the escrow account to be held by the Escrow Agent, until such time as the Escrow Agent receives an Escrow Release Notice signed by the Company and Badon Partners SAS instructing the release of the escrowed funds to the Company. The Escrow Agents fee under the Escrow Agreement is $2,500 to be paid by the Company.\nNew Director Appointments\nOn March 9, 2022, the Board of Directors (the Board) of the Company increased the size of the Board by three (3) persons and appointed each Jean-Michel Doublet, Lionel Therond, and Cindy Zhongye Li, as directors of the Company effective as of March 9, 2022. Mr. Therond is currently the Companys Chief Financial Officer, and Mr. Doublet is currently the Companys Chief Executive Officer.\nEntry into Director Agreements\nOn March 9, 2022, the Board approved the entry of the following directors into director agreements with the Company:\n● Aymar de Lencquesaing\n● Brett Lovegrove\n● Cindy Li\nTable of Content\n● James P. Bond\n● Jean-Michel Doublet\n● Lionel Therond\nas further described in detail below. Brett Lovegrove is currently the Chairman of the Board. Mr. Therond is currently the Companys Chief Financial Officer, and Mr. Doublet is currently the Companys Chief Executive Officer.\nDirector Agreement with Aymar de Lencquesaing\nOn March 9, 2022, the Company entered into a Director Agreement with Aymar de Lencquesaing (the ADL Director Agreement). Pursuant to the ADL Director Agreement, Mr. de Lencquesaing agreed to perform the duties of a director in accordance with the terms of the ADL Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The ADL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. de Lencquesaing as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. de Lencquesaings resignation as a director of the Company (iii) Mr. de Lencquesaing death or (iv) failure of the shareholders of the Company to re-elect Mr. de Lencquesaing at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nPursuant to the ADL Director Agreement, the Company agreed to indemnify Mr. de Lencquesaing, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. de Lencquesaings status as a director in accordance with the terms and conditions set forth in the ADL Director Agreement. Pursuant to the ADL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company, with Mr. de Lencquesaing being named as an insured party under such insurance, following the completion of a transaction between the Company and Zhonghuan Ruiheng Environmental Technology Co., Ltd. (ZHRH China) pursuant to which the Company shall obtain a controlling interest in ZHRH China, shall have been completed and the Company shall have obtained such controlling interest, as determined by the Company (the ZHRH Transaction). There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the ADL Director Agreement, the Company agreed to compensate Mr. de Lencquesaing for such services $80,000 per each full year that he serves as a Director of the Company, to be paid as follows:\n● The deferred cash grant will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. de Lencquesaing service as a director of the Company as of that date at the time of closing (the First Grant), however the cash payment of the First Grant will not occur until the one year anniversary of the date of the First Grant.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. de Lencquesaing continues to serve as a director of the Company, the Company will grant Mr. de Lencquesaing $20,000 (each a Quarterly Grant) with the payment in cash of same to be made on the one year anniversary of each Quarterly Grant.\nDirector Agreement with Brett Lovegrove\nOn March 9, 2022, the Company entered into a Director Agreement with Brett Lovegrove (the BL Director Agreement). Pursuant to the BL Director Agreement, Mr. Lovegrove agreed to perform the duties of a director in accordance with the terms of the BL Director Agreement with a time commitment of 8-10 days per month, with 4 Board meetings per year. The BL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Lovegrove as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Lovegroves resignation as a director of the Company (iii) Mr. Lovegroves death or (iv) failure of the shareholders of the Company to re-elect Mr. Lovegrove at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nTable of Content\nPursuant to the BL Director Agreement, the Company agreed to indemnify Mr. Lovegrove, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Lovegroves status as a director in accordance with the terms and conditions set forth in the BL Director Agreement. Pursuant to the BL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction and Mr. Lovegrove will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the BL Director Agreement, the Company agreed to compensate Mr. Lovegrove for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Lovegroves service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Lovegrove ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Lovegrove continues to serve as a director of the Company, the Company will grant Mr. Lovegrove a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Lovegrove) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Lovegrove ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nDirector Agreement with Cindy Li\nOn March 9, 2022, the Company entered into a Director Agreement with Cindy Li (the CL Director Agreement). Pursuant to the CL Director Agreement, Ms. Li agreed to perform the duties of a director in accordance with the terms of the CL Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The CL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Ms. Li as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Ms. Lis resignation as a director of the Company (iii) Ms. Lis death or (iv) failure of the shareholders of the Company to re-elect Ms. Li at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nPursuant to the CL Director Agreement, the Company agreed to indemnify Ms. Li, if she becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Ms. Lis status as a director in accordance with the terms and conditions set forth in the CL Director Agreement. Pursuant to the CL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Ms. Li will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the CL Director Agreement, the Company agreed to compensate Ms. Li for such services by issuing her shares of the Companys common stock as follows:\n● The intent is that for each full year that she serves as a director of the Company, shell receive a number of shares of the Companys common stock having a total value of $80,000.\nTable of Content\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Ms. Lis service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Ms. Li ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Ms. Li continues to serve as a director of the Company, the Company will grant Ms. Li a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Ms. Li) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Ms. Li ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nDirector Agreement with James P. Bond\nOn March 9, 2022, the Company entered into a Director Agreement with James P. Bond (the JB Director Agreement). Pursuant to the JB Director Agreement, Mr. Bond agreed to perform the duties of a director in accordance with the terms of the JB Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The JB Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Bond as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Bonds resignation as a director of the Company (iii) Mr. Bonds death or (iv) failure of the shareholders of the Company to re-elect Mr. Bond at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nPursuant to the JB Director Agreement, the Company agreed to indemnify Mr. Bond, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Bonds status as a director in accordance with the terms and conditions set forth in the JB Director Agreement. Pursuant to the JB Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Bond will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the JB Director Agreement, the Company agreed to compensate Mr. Bond for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the Closing of the ZHRH Transaction and will be based on the length of Mr. Bonds service as a director of the Company as of that date at the time of Closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Bond ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the Closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Bond continues to serve as a director of the Company, the Company will grant Mr. Bond a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Bond) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Bond ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nTable of Content\nDirector Agreement with Jean-Michel Doublet\nOn March 9, 2022, the Company entered into a Director Agreement with Jean-Michel Doublet (the JD Director Agreement). Pursuant to the JD Director Agreement, Mr. Doublet agreed to perform the duties of a director in accordance with the terms of the JD Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The JD Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Doublet as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Doublets resignation as a director of the Company (iii) Mr. Doublets death or (iv) failure of the shareholders of the Company to re-elect Mr. Doublet at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nPursuant to the JD Director Agreement, the Company agreed to indemnify Mr. Doublet, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Doublets status as a director in accordance with the terms and conditions set forth in the JD Director Agreement. Pursuant to the JD Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Doublet will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the JD Director Agreement, the Company agreed to compensate Mr. Doublet for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a Director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Doublets service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Doublet ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Doublet continues to serve as a director of the Company, the Company will grant Mr. Doublet a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Doublet) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Doublet ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nDirector Agreement with Lionel Therond\nOn March 9, 2022, the Company entered into a Director Agreement with Lionel Therond (the LT Director Agreement). Pursuant to the LT Director Agreement, Mr. Therond agreed to perform the duties of a director in accordance with the terms of the LT Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The LT Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Therond as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Theronds resignation as a director of the Company (iii) Mr. Theronds death or (iv) failure of the shareholders of the Company to re-elect Mr. Therond at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nTable of Content\nPursuant to the LT Director Agreement, the Company agreed to indemnify Mr. Therond, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Theronds status as a director in accordance with the terms and conditions set forth in the LT Director Agreement. Pursuant to the LT Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Therond will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nPursuant to the LT Director Agreement, the Company agreed to compensate Mr. Therond for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a Director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Theronds service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Therond ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Therond continues to serve as a director of the Company, the Company will grant Mr. Therond a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Therond) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Therond ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nNew Secretary Appointment\nOn April 11, 2022, the Company appointed Lionel Therond to serve as secretary of the Company effective immediately.\nResults of Operations\nYear Ended June 30, 2022 Compared to the Year Ended June 30, 2021\nOperating expenses for the year ended June 30, 2022 totaled $578,086, compared to $180,761 for the same period in 2021. The increase is attributable to legal and accounting fees incurred in order to take the Company out of its prior receivership and for the preparation of financials and SEC reports.\nCash flows used in operating activities for the year ended June 30, 2022 totaled $249,921 compared to $0 in 2021.\nGoing Concern\nThe Company was only recently released from receivership in Nevada. The Companys financial statements have been presented on the basis that it is a going concern, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. At June 30, 2022, the Company had a retained deficit of $812,925 and negative working capital of $753,041. The financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nTable of Content\nLiquidity and Capital Resources\nAt June 30, 2022 and 2021, our liquid assets consisted of cash of $180,079 and $0, respectively.\nCritical Accounting Policies and Estimates\nOur managements discussion and analysis of our financial condition and results of operations is based on our consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles, or GAAP. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenue and expenses during the reported period. In accordance with GAAP, we base our estimates on historical experience and on various other assumptions that we believe are reasonable under the circumstances. Actual results may differ from these estimates under different assumptions or conditions.\nOur significant accounting policies are fully described in Note 3 to our consolidated financial statements appearing elsewhere in this Annual Report, and we believe those accounting policies are critical to the process of making significant judgments and estimates in the preparation of our consolidated financial statements.\nIncome Taxes\nDue to the historical operating losses, the inability to recognize an income tax benefit, and the failure to file tax returns for numerous years, there is no provision for current or deferred federal or state income taxes for the period from inception through the period ended June 30, 2021. As of June 30, 2022, the Company had a accumulated deficit of $267,769, however, the amount of that loss that could be carried forward to offset future taxes is indeterminable.\nOff-Balance Sheet Arrangements\nNone. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot required for smaller reporting companies. Item 8. Financial Statements and Supplementary Data.\nThe financial statements required by this Item 8 are included elsewhere in Annual Report on Form 10-K beginning on page. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nAs reported by the Company in its Current Report on Form 8-K filed with the SEC on May 25, 2021, on May 24, 2021, the Board of Directors of the Company approved the appointment of BF Borgers CPA PC (Borgers) to serve as the Companys independent registered public accounting firm for the fiscal years ending June 30, 2019 and June 30, 2020 and dismissed KLJ & Associates LLP (KLJ), which declined to stand for reappointment as the Companys auditor.\nKLJs most recent reports on the financial statements of the Company as of and for the fiscal years ended June 30, 2014 and June 30, 2015 did not contain an adverse opinion or a disclaimer of opinion, nor were they qualified or modified as to uncertainty, audit scope or accounting principles, except that the audit reports on the financial statements of the Company for those two fiscal years contained an uncertainty about the Companys ability to continue as a going concern.\nTable of Content\nDuring the fiscal years ended June 30, 2014 and 2015, and through May 24, 2021, the date of KLJs dismissal, (i) there were no disagreements with KLJ on any matter of accounting principles or practices, financial statement disclosure, or auditing scope or procedure, which disagreements if not resolved to the satisfaction of KLJ would have caused KLJ to make reference thereto in their reports for such fiscal years and (ii) there were no reportable events (as that term is defined in Item 304(a)(1)(v) of Regulation S-K), except for the following reportable events. As disclosed in the Companys Form 10-Ks for the fiscal years ended June 30, 2014, and June 30, 2015, and the last filed Quarterly Report on 10-Q for the quarter ended September 30, 2015, management concluded that the Companys internal controls over financial reporting were not effective due to the existence of material weaknesses in the Companys internal control over financial reporting related to the following:\nThe Company attempted to contact KLJ to get the Exhibit 16.1 letter for the 8-K, but did not receive a reply. The Company will amend the Form 8-K filed on May 25, 2021, if the Exhibit 16.1 letter is received from KLJ.\nDuring the fiscal years ended June 30, 2019 and June 30, 2020, and the subsequent interim period through May 24, 2021, neither the Company, nor anyone acting on the Companys behalf, has consulted with Borgers regarding either (i) the application of accounting principles to a specified transaction, either completed or proposed, or the type of audit opinion that might be rendered on the Companys financial statements, in any case where either a written report or oral advice was provided to the Company by Borgers, that Borgers concluded was an important factor considered by the Company in reaching a decision as to any accounting, auditing or financial reporting issue; or (ii) any matter that was either the subject of a disagreement (within the meaning of Item 304(a)(1)(iv) of Regulation S-K and the related instructions) or a reportable event (as that term is defined in Item 304(a)(1)(v) of Regulation S-K). Item 9A. Controls and Procedures.\nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures.\nWe carried out an evaluation as required by paragraph (b) of Rule 13a-15 and 15d-15 of the Exchange Act, under the supervision and with the participation of our sole officer and director, of the effectiveness of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act as of June 30, 2022. Based upon that evaluation, our sole officer and director concluded that our disclosure controls and procedures were not effective as of June 30, 2022.\nReport of Management on Internal Controls over Financial Reporting.\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. As of June 30, 2022, management has completed an assessment of the Companys internal control over financial reporting based on the 2013 Committee of Sponsoring Organizations (COSO) framework.\nManagement has concluded that as of June 30, 2022, our internal control over financial reporting was not effective to detect the inappropriate application of U.S. GAAP.\nManagement identified the following material weaknesses set forth below in our internal control over financial reporting:\n● We did not perform an effective risk assessment or monitor internal controls over financial reporting.\n● There are insufficient written policies and procedures to ensure the correct application of accounting and financial reporting with respect to the current requirements of generally accepted accounting principles in the United States and SEC disclosure requirements.\n● Limited segregation of duties and oversight of work performed as well as lack of compensating controls in the Companys finance and accounting functions.\n● The Company lacks sufficient in-house expertise and training in complex accounting principles and SEC reporting and disclosure requirements.\nTable of Content\n● The Companys systems that impact financial information and disclosures have ineffective information technology controls.\n● The Company lacks a system of tracking obligations to identify and file income tax and other tax reports on a timely basis.\nA control system, no matter how well-conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Management necessarily applied its judgment in assessing the benefits of controls relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected. The design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions, regardless of how remote. Because of the inherent limitations in a control system, misstatements due to error or fraud may occur and not be detected.\nChanges in Internal Control over Financial Reporting.\nOn April 6, 2021, the Custodian entered into a Common Stock Purchase Agreement (the SPA) with Calgary Thunder Bay Limited (Calgary), pursuant to which Calgary purchased 71,260,000 shares of common stock of the Company from the Custodian, representing 95.01% of the total issued and outstanding shares of the Companys common stock. The sale was consummated on April 13, 2021. As a result of the sale, there was a change of control of the Company. On that same date, Mr. David Lazar, who was the Companys then sole officer and director, submitted his resignation from all positions with the Company and appointed Brett Lovegrove as the sole director and officer of the Company. Additionally, the Companys prior receivership was terminated by the Eighth Judicial District Court in Clark County, Nevada, under Case Number: A-20-816621-B on May 10, 2021 and on the same date, the court also discharged Mr. Lazar as the receiver. On April 13, 2021, Mr. David Lazar, who was the Companys then sole officer and director, submitted his resignation from all positions with the Company and appointed Brett Lovegrove as the sole director and officer of the Company. On October 4, 2021, the Board of Directors of the Company increased the size of the Board by two persons and appointed each James Purnell Bond and Aymar de Lencquesaing as directors of the Company effective as of October 4, 2021. On October 25, 2021, Mr. Brett Lovegrove, who has served as the sole director and officer of the Company since April 13, 2021, resigned from all officer positions with the Company effective on the same date. On October 25, 2021, the Board of Directors of the Company took the following actions: (i) appointed Mr. Jean-Michel Doublet as the Companys Chief Executive Officer, (ii) appointed Mr. Lionel Therond as the Companys Chief Financial Officer and (iii) appointed Mr. Brett Lovegrove as the Chairman of the Board, all effective on the same date.\nOther than the foregoing, there have been no changes in our internal control over financial reporting that occurred during the year ended June 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNone.\nTable of Content\nPart III Item 10. Directors, Executive Officers and Corporate Governance.\nOn December 11, 2020, Custodian appointed David Lazar as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer, Chief Executive Officer and Chairman of the Board of Directors. On April 13, 2021, Mr. David Lazar, who was the Companys then sole officer and director, submitted his resignation from all positions with the Company and appointed Brett Lovegrove as the sole director and officer of the Company. On October 4, 2021, the Board of Directors of the Company increased the size of the Board by two persons and appointed each James Purnell Bond and Aymar de Lencquesaing as directors of the Company effective as of October 4, 2021. On October 25, 2021, Mr. Brett Lovegrove, who has served as the sole director and officer of the Company since April 13, 2021, resigned from all officer positions with the Company effective on the same date. On October 25, 2021, the Board of Directors of the Company took the following actions: (i) appointed Mr. Jean-Michel Doublet as the Companys Chief Executive Officer, (ii) appointed Mr. Lionel Therond as the Companys Chief Financial Officer and (iii) appointed Mr. Brett Lovegrove as the Chairman of the Board, all effective on the same date. On March 9, 2022, the Board of Directors (the Board) of the Company increased the size of the Board by three (3) persons and appointed each Jean-Michel Doublet, Lionel Therond, and Cindy Zhongye Li, as directors of the Company effective as of March 9, 2022. Mr. Therond is currently the Companys Chief Financial Officer, and Mr. Doublet is currently the Companys Chief Executive Officer.\nName\nAge\nPosition/Title\nJean-Michel Doublet\nDirector, Chief Executive Officer\nLionel Therond\nDirector, Chief Financial Officer\nBrett Lovegrove\nChairman of the Board of Directors\nJames Purnell Bond\nDirector\nAymar de Lencquesaing\nDirector\nCindy Zhongye Li\nDirector\nMr. Jean-Michel Doublet, age 61, was appointed as the Companys Chief Executive Officer on October 25, 2021 and as a member of the Companys Board of Directors on March 9, 2022. Mr. Doublet is the co-founder and has served as the Chief Executive Officer of Blue Oak starting from 2016 and continues to serve in such capacity to date. Mr. Doublet is a board member of Wentworth Africa Foundation, a UK registered charity that is active in East Africa. From January 2008 to January 2016, Mr. Doublet served as the founding partner at Clermont Energy Partners. Mr. Doublet received his degree in Engineering from the Institut National Agronomique in 1983 and received his Masters Degree in Economics at Stanford. In 1988, Mr. Doublet became a PhD. Candidate in economics at UC Berkeley.\nMr. Lionel Therond, age 62, was appointed as the Companys Chief Financial Officer on October 25, 2021 and as a member of the Companys Board of Directors on March 9, 2022. Mr. Therond is the co-founder and has served as a director of Blue Oak starting from 2016 and continues to serve in such capacity to date. From April 2011 to September 2016, Mr. Therond served as a Managing Director at Standard Bank. Mr. Therond serves as Chief Financial Officer of ADM Energy PLC since August 2020 to the present. Mr. Therond received his degree in Engineering Geology and Geophysics from ENSG Nancy in France in 1983 and his MBA in Finance in 1995 from INSEAD in France.\nBrett Lovegrove, age 62, has served as the Chairman of the Companys Board of Directors since October 25, 2021. Mr. Brett Lovegrove previously served as the sole director and officer of the Company since April 13, 2021 until October 25, 2021. Mr. Lovegrove served in the Metropolitan Police and the City of London Police for 30 years, until he retired in 2008, as the Head of Counter Terrorism for the City of London with national counter terrorist responsibilities across the UK. Mr. Lovegrove also commanded the British Police Firearms Unit on a nationwide basis for many years. Mr. Lovegrove served as the CEO of City Security and Resilience Networks (CSARN - UK and Australia) from January 2009 until January 2021. From October 2017 to the present, Mr. Lovegrove serves as the Managing Director of Valentis Bridge Ltd., which focuses on defense and resilience consultancy. Mr. Lovegrove has served since August 2018, and to the present as the Chairman of TalonBridge which is a focused on technology development. He is also a Member of the All Party Parliamentary Group on Artificial Intelligence, Chairman of Paratum (Counter Terrorism Infrastructure Engineering), Chairman of the Defense and Security Committee of the London Chamber of Commerce, Senior Lecturer on Resilience to the US military (Germany and the United States), Lecturer at the Geneva Centre for Security Policy and an Ambassador and Member of the London Board of Crimestoppers. Mr. Lovegrove received his Masters Degree in Criminal Justice and Terrorism studies at Reading University in the U.K. in 1992.\nTable of Content\nJames Purnell Bond, age 73, has served as a member of the Companys Board of Directors since October 4, 2021. From 2015 to the present, Mr. Bond has served as a senior advisor at the Centennial Group International where he is focused on policy advice and participates in and manages external consulting assignments. From December 2020 to the present Mr. Bond has been a managing partner at Blue Monsoon Capital where he engages in management and oversight. From 2016 to the present Mr. Bond has been a professor in post-graduate finance at the Sciences Po in Paris. From June 2019 to December 2020 Mr. Bond served as the Chair of OECD, where he managed the board of advisers to the G7. From September 2016 to April 2018, Mr. Bond served as a board member, and for a time as the chair of the audit committee for Adam Smith International (ASI). Mr. Bond received his degree in chemical engineering from the University of Witwatersrand in 1972. Mr. Bond received a masters degree in energy, economics and finance in 1976 from Ecole National Superiure du Petrole et de Moteurs. Mr. Bond received a doctorate degree in economics from the Universite de Patheon-Sarbonne in 1978.\nAymar de Lencquesaing, age 63, has served as a member of the Companys Board of Directors since October 4, 2021. Mr. de Lencquesaing has served as a senior adviser in information technology at Sharp from 2019 to 2022. Mr. de Lencquesaing previously served as a Senior Executive at Lenovo in IT hardware from 2013 to 2018. Mr. de Lencquesaing was previously a chairman in information technology at Motorola from 2013 to 2018. Mr. de Lencquesaing received his masters degree in business from ESSEC in 1981.\nCindy Zhongye Li, age 54, has served as a member of the Companys Board of Directors since March 9, 2022. From December 2018 to the present, Ms. Li serves as the Chairman of the Board of G-Resources Group. From January 2019 to the present Ms. Li serves as a member of the board of directors of HAH. From March 2017 to July 2018, Ms. Li served as a member of the board of directors of Wan Kei Group. Ms. Li earned here Bachelors in Medicine from Capital Medical University in 1992.\nCommittees\nWe do not have a standing nominating, compensation or audit committee. Rather, our sole director performs the functions of these committees. Additionally, because our common stock is not listed for trading or quotation on a national securities exchange, we are not required to have such committees.\nDirector Independence\nWe do not have any independent directors, as such term is defined in the listing standards of The NASDAQ Stock Market, at this time. The Company is not quoted on any exchange that requires director independence requirements.\nCode of Ethics\nWe have not yet adopted a code of ethics that applies to all of our employees, officers and directors, including those officers responsible for financial reporting. We expect that we will adopt a code of ethics in the near future.\nFamily Relationships\nNone.\nInvolvement in Certain Legal Proceedings\nNo executive officer, member of the board of directors or control person of our Company has been involved in any legal proceeding listed in Item 401(f) of Regulation S-K in the past 10 years.\nTable of Content Item 11. Executive Compensation.\nSummary Compensation Table\nName Year Salary\n($) Bonus\n($) All Other Compensation\n($) Total\n($)\nBrett Lovegrove(1) $ - $ - $ -\n$ -\n$ - $ - $ -\n$ -\nDavid Lazar(2) $ - $ - $ -\n$ -\n$ - $ - $ -\n$ -\nJean-Michele Doublet(3) $ - $ - $ -\n$ -\n$ - $ - $ -\n$ -\nLionel Therond(4) $ - $ - $ -\n$ -\n$ - $ - $ -\n$ -\n(1) Mr. Brett Lovegrove previously served as the sole director and officer of the Company since April 13, 2021 until October 25, 2021. Mr. Lovegrove has served as the Chairman of the Companys Board of Directors since October 25, 2021.\n(2) David Lazar served as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer, Chief Executive Officer and Chairman of the Board of Directors from December 11, 2020 to April 13, 2021.\n(3) Mr. Jean-Michel Doublet, was appointed as the Companys Chief Executive Officer on October 25, 2021 and as a member of the Companys Board of Directors on March 9, 2022.\n(4) Mr. Lionel Therond, was appointed as the Companys Chief Financial Officer on October 25, 2021 and as a member of the Companys Board of Directors on March 9, 2022.\nEmployment Agreements\nThe Company is not a party to any employment agreements at this time.\nOutstanding Equity Awards at Fiscal Year-End\nThere were no outstanding equity awards at the 2022 fiscal year-end.\nCompensation Plans\nWe have not adopted any compensation plan to provide for future compensation of any of our directors or executive officers.\nDirector Compensation\nHistorically, our directors have not received compensation for their service.\nTable of Content\nDirector Agreements\nOn March 9, 2022, the Company entered into a Director Agreement with Aymar de Lencquesaing (the ADL Director Agreement). Pursuant to the ADL Director Agreement, Mr. de Lencquesaing agreed to perform the duties of a director in accordance with the terms of the ADL Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The ADL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. de Lencquesaing as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. de Lencquesaings resignation as a director of the Company (iii) Mr. de Lencquesaing death or (iv) failure of the shareholders of the Company to re-elect Mr. de Lencquesaing at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the ADL Director Agreement, the Company agreed to indemnify Mr. de Lencquesaing, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. de Lencquesaings status as a director in accordance with the terms and conditions set forth in the ADL Director Agreement. Pursuant to the ADL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company, with Mr. de Lencquesaing being named as an insured party under such insurance, following the completion of a transaction between the Company and Zhonghuan Ruiheng Environmental Technology Co., Ltd. (ZHRH China) pursuant to which the Company shall obtain a controlling interest in ZHRH China, shall have been completed and the Company shall have obtained such controlling interest, as determined by the Company (the ZHRH Transaction). There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the ADL Director Agreement, the Company agreed to compensate Mr. de Lencquesaing for such services $80,000 per each full year that he serves as a Director of the Company, to be paid as follows:\n● The deferred cash grant will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. de Lencquesaing service as a director of the Company as of that date at the time of closing (the First Grant), however the cash payment of the First Grant will not occur until the one year anniversary of the date of the First Grant.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. de Lencquesaing continues to serve as a director of the Company, the Company will grant Mr. de Lencquesaing $20,000 (each a Quarterly Grant) with the payment in cash of same to be made on the one year anniversary of each Quarterly Grant.\nOn March 9, 2022, the Company entered into a Director Agreement with Brett Lovegrove (the BL Director Agreement). Pursuant to the BL Director Agreement, Mr. Lovegrove agreed to perform the duties of a director in accordance with the terms of the BL Director Agreement with a time commitment of 8-10 days per month, with 4 Board meetings per year. The BL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Lovegrove as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii)Mr. Lovegroves resignation as a director of the Company (iii) Mr. Lovegroves death or (iv) failure of the shareholders of the Company to re-elect Mr. Lovegrove at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the BL Director Agreement, the Company agreed to indemnify Mr. Lovegrove, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Lovegroves status as a director in accordance with the terms and conditions set forth in the BL Director Agreement. Pursuant to the BL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction and Mr. Lovegrove will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the BL Director Agreement, the Company agreed to compensate Mr. Lovegrove for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\nTable of Content\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Lovegroves service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Lovegrove ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Lovegrove continues to serve as a director of the Company, the Company will grant Mr. Lovegrove a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Lovegrove) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Lovegrove ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nOn March 9, 2022, the Company entered into a Director Agreement with Cindy Li (the CL Director Agreement). Pursuant to the CL Director Agreement, Ms. Li agreed to perform the duties of a director in accordance with the terms of the CL Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The CL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Ms. Li as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Ms. Lis resignation as a director of the Company (iii) Ms. Lis death or (iv) failure of the shareholders of the Company to re-elect Ms. Li at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the CL Director Agreement, the Company agreed to indemnify Ms. Li, if she becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Ms. Lis status as a director in accordance with the terms and conditions set forth in the CL Director Agreement. Pursuant to the CL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Ms. Li will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the CL Director Agreement, the Company agreed to compensate Ms. Li for such services by issuing her shares of the Companys common stock as follows:\n● The intent is that for each full year that she serves as a director of the Company, shell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Ms. Lis service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Ms. Li ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Ms. Li continues to serve as a director of the Company, the Company will grant Ms. Li a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Ms. Li) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Ms. Li ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nTable of Content\nOn March 9, 2022, the Company entered into a Director Agreement with James P. Bond (the JB Director Agreement). Pursuant to the JB Director Agreement, Mr. Bond agreed to perform the duties of a director in accordance with the terms of the JB Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The JB Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Bond as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Bonds resignation as a director of the Company (iii) Mr. Bonds death or (iv) failure of the shareholders of the Company to re-elect Mr. Bond at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the JB Director Agreement, the Company agreed to indemnify Mr. Bond, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Bonds status as a director in accordance with the terms and conditions set forth in the JB Director Agreement. Pursuant to the JB Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Bond will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the JB Director Agreement, the Company agreed to compensate Mr. Bond for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the Closing of the ZHRH Transaction and will be based on the length of Mr. Bonds service as a director of the Company as of that date at the time of Closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Bond ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the Closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Bond continues to serve as a director of the Company, the Company will grant Mr. Bond a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Bond) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Bond ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nOn March 9, 2022, the Company entered into a Director Agreement with Jean-Michel Doublet (the JD Director Agreement). Pursuant to the JD Director Agreement, Mr. Doublet agreed to perform the duties of a director in accordance with the terms of the JD Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The JD Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Doublet as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Doublets resignation as a director of the Company (iii) Mr. Doublets death or (iv) failure of the shareholders of the Company to re-elect Mr. Doublet at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the JD Director Agreement, the Company agreed to indemnify Mr. Doublet, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Doublets status as a director in accordance with the terms and conditions set forth in the JD Director Agreement. Pursuant to the JD Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Doublet will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the JD Director Agreement, the Company agreed to compensate Mr. Doublet for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a Director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\nTable of Content\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Doublets service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Doublet ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Doublet continues to serve as a director of the Company, the Company will grant Mr. Doublet a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Doublet) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Doublet ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nOn March 9, 2022, the Company entered into a Director Agreement with Lionel Therond (the LT Director Agreement). Pursuant to the LT Director Agreement, Mr. Therond agreed to perform the duties of a director in accordance with the terms of the LT Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The LT Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Therond as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Theronds resignation as a director of the Company (iii) Mr. Theronds death or (iv) failure of the shareholders of the Company to re-elect Mr. Therond at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the LT Director Agreement, the Company agreed to indemnify Mr. Therond, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Theronds status as a director in accordance with the terms and conditions set forth in the LT Director Agreement. Pursuant to the LT Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Therond will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the LT Director Agreement, the Company agreed to compensate Mr. Therond for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a Director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Theronds service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Therond ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Therond continues to serve as a director of the Company, the Company will grant Mr. Therond a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Therond) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Therond ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nTable of Content Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nAt October 11, 2022 we had 75,000,000 shares of our common stock issued and outstanding. The following table sets forth information regarding the beneficial ownership of our common stock as of October 11, 2022 by:\n● each person known by us to be the beneficial owner of more than 5% of our common stock;\n● each of our directors;\n● each of our named executive officers; and\n● our executive officers and directors as a group.\nUnless otherwise indicated, the business address of each person listed is in care of the Company, at 50 West Liberty St. Suite 880, Reno, NV 89501. The percentages in the table have been calculated on the basis of treating as outstanding for a particular person, all shares of our common stock outstanding on that date and all shares of our common stock issuable to that holder in the event of exercise of outstanding rights or conversion privileges owned by that person at that date which are exercisable within 60 days of that date. Except as otherwise indicated, the persons listed below have sole voting and investment power with respect to all shares of our common stock owned by them, except to the extent that power may be shared with a spouse.\nName of Beneficial Owner: Amount\nand\nNature of\nBeneficial\nOwnership\nPercent\nof Class\nDirectors and Executive Officers\nJean-Michel Doublet - -\nLionel Therond - -\nBrett Lovegrove - -\nJames Purnell Bond - -\nAymar de Lencquesaing - -\nCindy Zhongye Li - -\nAll officers and directors as a group (6 persons) - -\nMore than 5% Holders\nCalgary Thunder Bay Limited(2) 71,260,000 95.01 %\n(2) Xuejiao Fang is the 100% owner of Calgary Thunder Bay Limited and has the power to vote and dispose of the shares held by Calgary Thunder Bay Limited.\nTable of Content Item 13. Certain Relationships and Related Transactions, and Director Independence.\nWe do not have a written policy for the review, approval or ratification of transactions with related parties or conflicted transactions.\nOn December 16, 2020, as a result of a receivership in Clark County, Nevada, Case Number: A-20-816621-B, Custodian Ventures LLC (the Custodian) was appointed receiver of the Company. On that same date, the Custodian appointed David Lazar as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer, Chief Executive Officer and Chairman of the Board of Directors. On May 10, 2021 the Court entered an Order terminating the receivership.\nDuring the fiscal year July 01, 2020 thru April 06, 2021, David Lazar, paid $26,195 of expenses related transfer agent, state registration fees and legal fees on behalf of the Company. On March 09, 2021, the Company issued 71,260,000 shares of common stock issued at par value of $0.001, as repayment of debt owed to the Custodian in the amount of $18,355. On April 12, 2021, Custodian Ventures forgave all amounts owing to them by the Company in the amount of $5,801. As of June 30, 2022 and June 30, 2021, a total of $0 and $5,179, remains outstanding to Custodian Ventures, LLC, respectively.\nDuring the fiscal years ended June 30, 2022, Calgary Thunder Bay, which owns 95.01% of the Companys issued and outstanding common stock, paid $126,163 of expenses related to accounting, audit, legal and consulting fees. As June 30, 2022 and June 30, 2021, a total of $228,382 and $102,219 remains outstanding to Calgary Thunder Bay Limited, respectively.\nOn October 25, 2021, the Company entered into an amendment with Blue Oak Advisory Limited (Blue Oak) and Zhonguan Ruiheng Environmental Technology Company Limited (ZHRH China) (the Amendment), which was an amendment to an original agreement between ZHRH China and Blue Oak dated January 6, 2021, (the Original Agreement). The Company was not a party to the Original Agreement between ZHRH China and Blue Oak. The Amendment is effective as of October 25, 2021, and sets forth that Mr. Jean-Michel Doublet is to be appointed as the Companys Chief Executive Officer and Mr. Lionel Therond is to be appointed as the Companys Chief Financial Officer. The Amendment was entered into with the intent to set forth renumeration to be received by Mr. Jean-Michel Doublet and Mr. Lionel Therond in connection with any proposed business combination in which the Company acquires ZHRH China. The Company has not entered into any agreements, letters of intent or any other oral or written agreements in connection with any proposed business combination in which the Company acquires ZHRH China, other than the Amendment. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with any proposed business combination in which the Company acquires ZHRH China, or that any such business combination can occur at all (the Proposed Business Combination).\nPursuant to the Amendment, each Mr. Jean-Michel Doublet and Mr. Lionel Therond are to provide 25% of their working hours each week to their duties to the Company in exchange for the following: (i) Blue Oak is to receive an increased success fee under the Original Agreement upon consummation of the Proposed Business Combination, (ii) Mr. Jean-Michel Doublet and Mr. Lionel Therond are each to receive 0.5% of the Companys common stock on a fully diluted basis upon the occurrence of the Proposed Business Combination to vest 50% upon completion of the Proposed Business Combination and 50% 6 months thereafter and (iii) Mr. Jean-Michel Doublet and Mr. Lionel Therond are each to receive additional shares constituting 1.5% of the Companys then fully diluted common stock to vest upon the Companys uplisting to the OTCQB or Nasdaq. Mr. Doublet is a beneficial owner of 60% of Blue Oak and is the Chief Executive Officer of Blue Oak. Mr. Lionel Therond is a beneficial owner of 40% of Blue Oak and is a director at Blue Oak.\nTable of Content\nOn March 7, 2022, the Company entered into a Note Purchase Agreement (the Note Purchase Agreement) with James Purnell Bond, a member of the Companys Board of Directors. Pursuant to the Note Purchase Agreement, the Company agreed to sell and issue to Mr. Bond, a convertible promissory note in the principal amount of $30,000 (the Note). The Note was issued to Mr. Bond on March 7, 2022. The Note carries an interest rate of 10% per annum and matures on December 31, 2022 (the Maturity Date). The Note converts automatically on the first business day following the completion of a transaction between the Company and Zhonghuan Ruiheng Environmental Technology Co., Ltd. (ZHRH China) pursuant to which the Company shall obtain a controlling interest in ZHRH China, shall have been completed and the Company shall have obtained such controlling interest, as determined by the Company (the ZHRH Transaction), into a number of unregistered and restricted fully paid and nonassessable shares of shares of the Companys common stock equal to (i) the indebtedness under the Note as of such conversion date divided by (ii) the value per share of common stock as determined based on a valuation of the Company of $30,000,000 and the number of issued and outstanding shares of common stock as of such conversion date (the Conversion Shares). In the event that the ZHRH Transaction is not completed prior to the Maturity Date, none of the indebtedness under the Note will convert or be convertible into shares of the Companys common stock and instead the indebtedness under the Note will come due and payable in full. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. In connection with the Note Purchase Agreement and the Note, on March 7, 2022, the Company entered into an Escrow Agreement (the Escrow Agreement) with Mr. Bond, and Anthony L.G., PLLC as the escrow agent (the Escrow Agent). Pursuant to the Escrow Agreement, Mr. Bond agreed to deliver the purchase price for the Note to the escrow account to be held by the Escrow Agent, until such time as the Escrow Agent receives an Escrow Release Notice signed by the Company and Mr. Bond instructing the release of the escrowed funds to the Company. The Escrow Agents fee under the Escrow Agreement is $2,500 to be paid by the Company.\nOn January 24, 2022, the Company entered into a Securities Purchase Agreement (the Securities Purchase Agreement) with Badon Partners SAS and Calgary Thunder Bay Limited. Calgary Thunder Bay Limited is the Companys majority shareholder, holding 71,260,000 shares of the Companys common stock at this time which constitutes 95.01% of the Companys issued and outstanding common stock. Xuejiao Fang is the 100% owner of Calgary Thunder Bay Limited and has the power to vote and dispose of the shares held by Calgary Thunder Bay Limited. Badon Partners SAS is 100% owned and controlled by Aymar de Lencquesaing a member of the Companys Board of Directors. Pursuant to the Securities Purchase Agreement, the Company agreed to sell and issue Badon Partners SAS a convertible promissory note in the principal amount of $200,000 (the Note) and to sell and issue to Badon Partners SAS and a number of shares of the Companys common stock equal to (i) $200,000 (the Shares Purchase Price) divided by (ii) the value per share of common stock as determined based on a valuation of the Company of $30,000,000 and the number of issued and outstanding shares of common stock as of the Shares Closing, as such term is defined in the Securities Purchase Agreement (the Shares). The term Share Closing is defined in the Securities Purchase Agreement as the first business day after the completion of the ZHRH Transaction. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the Securities Purchase Agreement, Calgary Thunder Bay Limited agreed that in the event that the ZHRH Transaction does not occur, and the Note becomes due and payable, Calgary Thunder Bay Limited will transfer 50% of the shares it holds in the Company to Badon Partners SAS in full satisfaction of the indebtedness under the Note. Calgary Thunder Bay Limited also agreed in the Securities Purchase Agreement to not directly or indirectly sell or offer to sell the shares of the Companys common stock held by Calgary Thunder Bay Limited until the earlier of, full repayment of the Note by the Company or full conversion of the Note. The Note was issued to Badon Partners SAS on January 24, 2022. The Note carries an interest rate of 10% per annum and matures on December 31, 2022 (the Maturity Date). The Note converts automatically on the first business day following the completion of the ZHRH Transaction, into a number of unregistered and restricted fully paid and nonassessable shares of shares of the Companys common stock equal to (i) the indebtedness under the Note as of such conversion date divided by (ii) the value per share of common stock as determined based on a valuation of the Company of $30,000,000 and the number of issued and outstanding shares of common stock as of such date conversion date (the Conversion Shares). In the event that the ZHRH Transaction is not completed prior to the Maturity Date, none of the indebtedness under the Note will convert or be convertible into shares of the Companys common stock and Calgary Thunder Bay Limited will transfer to Badon Partners SAS 50% of the shares of the Companys common stock held by Calgary Thunder Bay limited in accordance with the terms of the Note and the terms of the Securities Purchase Agreement. In connection with the Securities Purchase Agreement and the Note, on January 24, 2022, the Company entered into an Escrow Agreement (the Escrow Agreement) with Badon Partners SAS and Anthony L.G., PLLC as the escrow agent (the Escrow Agent). Pursuant to the Escrow Agreement, Badon Partners SAS agreed to deliver the purchase price for the Note to the escrow account to be held by the Escrow Agent, until such time as the Escrow Agent receives an Escrow Release Notice signed by the Company and Badon Partners SAS instructing the release of the escrowed funds to the Company. The Escrow Agents fee under the Escrow Agreement is $2,500 to be paid by the Company.\nTable of Content\nOn March 9, 2022, the Company entered into a Director Agreement with Aymar de Lencquesaing (the ADL Director Agreement). Pursuant to the ADL Director Agreement, Mr. de Lencquesaing agreed to perform the duties of a director in accordance with the terms of the ADL Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The ADL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. de Lencquesaing as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. de Lencquesaings resignation as a director of the Company (iii) Mr. de Lencquesaing death or (iv) failure of the shareholders of the Company to re-elect Mr. de Lencquesaing at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the ADL Director Agreement, the Company agreed to indemnify Mr. de Lencquesaing, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. de Lencquesaings status as a director in accordance with the terms and conditions set forth in the ADL Director Agreement. Pursuant to the ADL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company, with Mr. de Lencquesaing being named as an insured party under such insurance, following the completion of a transaction between the Company and Zhonghuan Ruiheng Environmental Technology Co., Ltd. (ZHRH China) pursuant to which the Company shall obtain a controlling interest in ZHRH China, shall have been completed and the Company shall have obtained such controlling interest, as determined by the Company (the ZHRH Transaction). There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the ADL Director Agreement, the Company agreed to compensate Mr. de Lencquesaing for such services $80,000 per each full year that he serves as a Director of the Company, to be paid as follows:\n● The deferred cash grant will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. de Lencquesaing service as a director of the Company as of that date at the time of closing (the First Grant), however the cash payment of the First Grant will not occur until the one year anniversary of the date of the First Grant.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. de Lencquesaing continues to serve as a director of the Company, the Company will grant Mr. de Lencquesaing $20,000 (each a Quarterly Grant) with the payment in cash of same to be made on the one year anniversary of each Quarterly Grant.\nOn March 9, 2022, the Company entered into a Director Agreement with Brett Lovegrove (the BL Director Agreement). Pursuant to the BL Director Agreement, Mr. Lovegrove agreed to perform the duties of a director in accordance with the terms of the BL Director Agreement with a time commitment of 8-10 days per month, with 4 Board meetings per year. The BL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Lovegrove as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii)Mr. Lovegroves resignation as a director of the Company (iii) Mr. Lovegroves death or (iv) failure of the shareholders of the Company to re-elect Mr. Lovegrove at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the BL Director Agreement, the Company agreed to indemnify Mr. Lovegrove, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Lovegroves status as a director in accordance with the terms and conditions set forth in the BL Director Agreement. Pursuant to the BL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction and Mr. Lovegrove will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the BL Director Agreement, the Company agreed to compensate Mr. Lovegrove for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Lovegroves service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Lovegrove ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\nTable of Content\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Lovegrove continues to serve as a director of the Company, the Company will grant Mr. Lovegrove a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Lovegrove) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Lovegrove ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nOn March 9, 2022, the Company entered into a Director Agreement with Cindy Li (the CL Director Agreement). Pursuant to the CL Director Agreement, Ms. Li agreed to perform the duties of a director in accordance with the terms of the CL Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The CL Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Ms. Li as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Ms. Lis resignation as a director of the Company (iii) Ms. Lis death or (iv) failure of the shareholders of the Company to re-elect Ms. Li at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the CL Director Agreement, the Company agreed to indemnify Ms. Li, if she becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Ms. Lis status as a director in accordance with the terms and conditions set forth in the CL Director Agreement. Pursuant to the CL Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Ms. Li will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the CL Director Agreement, the Company agreed to compensate Ms. Li for such services by issuing her shares of the Companys common stock as follows:\n● The intent is that for each full year that she serves as a director of the Company, shell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Ms. Lis service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Ms. Li ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Ms. Li continues to serve as a director of the Company, the Company will grant Ms. Li a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Ms. Li) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Ms. Li ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nTable of Content\nOn March 9, 2022, the Company entered into a Director Agreement with James P. Bond (the JB Director Agreement). Pursuant to the JB Director Agreement, Mr. Bond agreed to perform the duties of a director in accordance with the terms of the JB Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The JB Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Bond as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Bonds resignation as a director of the Company (iii) Mr. Bonds death or (iv) failure of the shareholders of the Company to re-elect Mr. Bond at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the JB Director Agreement, the Company agreed to indemnify Mr. Bond, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Bonds status as a director in accordance with the terms and conditions set forth in the JB Director Agreement. Pursuant to the JB Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Bond will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the JB Director Agreement, the Company agreed to compensate Mr. Bond for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the Closing of the ZHRH Transaction and will be based on the length of Mr. Bonds service as a director of the Company as of that date at the time of Closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Bond ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the Closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Bond continues to serve as a director of the Company, the Company will grant Mr. Bond a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Bond) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Bond ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nOn March 9, 2022, the Company entered into a Director Agreement with Jean-Michel Doublet (the JD Director Agreement). Pursuant to the JD Director Agreement, Mr. Doublet agreed to perform the duties of a director in accordance with the terms of the JD Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The JD Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Doublet as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Doublets resignation as a director of the Company (iii) Mr. Doublets death or (iv) failure of the shareholders of the Company to re-elect Mr. Doublet at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the JD Director Agreement, the Company agreed to indemnify Mr. Doublet, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Doublets status as a director in accordance with the terms and conditions set forth in the JD Director Agreement. Pursuant to the JD Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Doublet will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the JD Director Agreement, the Company agreed to compensate Mr. Doublet for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a Director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\nTable of Content\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Doublets service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Doublet ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Doublet continues to serve as a director of the Company, the Company will grant Mr. Doublet a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Doublet) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Doublet ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nOn March 9, 2022, the Company entered into a Director Agreement with Lionel Therond (the LT Director Agreement). Pursuant to the LT Director Agreement, Mr. Therond agreed to perform the duties of a director in accordance with the terms of the LT Director Agreement with a time commitment of 1-2 days per month, with 4 Board meetings per year. The LT Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of Mr. Therond as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii) Mr. Theronds resignation as a director of the Company (iii) Mr. Theronds death or (iv) failure of the shareholders of the Company to re-elect Mr. Therond at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors. Pursuant to the LT Director Agreement, the Company agreed to indemnify Mr. Therond, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Mr. Theronds status as a director in accordance with the terms and conditions set forth in the LT Director Agreement. Pursuant to the LT Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction, and Mr. Therond will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all. Pursuant to the LT Director Agreement, the Company agreed to compensate Mr. Therond for such services by issuing him shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a Director of the Company, hell receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of Mr. Theronds service as a director of the Company as of that date at the time of closing (the First Grant).The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that Mr. Therond ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which Mr. Therond continues to serve as a director of the Company, the Company will grant Mr. Therond a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Therond) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that Mr. Therond ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nDuring the fiscal year ended June 30, 2022, the Company paid its largest shareholder, Calgary Thunder Bay Limited, $5,100 for consulting fees for translation of Chinese documents to English.\nTable of Content Item 14. Principal Accountant Fees and Services.\nThe following table sets forth the fees billed or to be billed to our Company for the years ended June 30, 2022 and June 30, 2021 for professional services rendered by BF Borgers CPA PC (Borgers) our independent registered public accounting firm which was engaged by the Company in such capacity on May 24, 2021.\nFees\nAudit Fees $ 15,000 $ 15,000\nAudit-Related Fees - -\nTax Fees - -\nOther Fees - -\nTotal Fees $ 15,000 $ 15,000\nAudit Fees\nAudit fees to Borgers were for professional services rendered for the audit of our annual financial statements for the years ended June 30, 2022 and 2021.\nAudit-Related Fees\nDuring 2022 and 2021, Borgers did not provide any assurance and related services that are reasonably related to the performance of the audit or review or our financial statements that are not reported under the caption Audit Fees above.\nTax Fees\nAs Borgers did not provide any services to us for tax compliance, tax advice and tax planning during 2022 and 2021, no tax fees were billed or paid during those fiscal years.\nAll Other Fees\nBorgers did not provide any products and services not disclosed in the table above during 2022 and 2021. As a result, there were no other fees billed or paid during 2022 and 2021.\nTable of Content\nPART IV ITEM 15. Exhibit And Financial Statement Schedules.\n(a) Financial Statements.\nIndex to the Consolidated Financial Statements\nContents\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets at June 30, 2022, and 2021\nConsolidated Statements of Operations for the Years Ended June 30, 2022, and 2021\nConsolidated Statements of Stockholders Equity (Deficit) for the Years Ended June 30, 2022, and 2021\nConsolidated Statements of Cash Flows for the Years Ended June 30, 2022, and 2021\nNotes to the Consolidated Financial Statements\nTable of Content\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of ZHRH Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of ZHRH Corporation as of June 30, 2022 and 2021, the related statements of operations, stockholders' equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Company's ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matter\nCritical audit matters are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments.\nWe determined that there are no critical audit matters.\n/S/ BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Company's auditor since 2021\nLakewood, CO\nOctober 11, 2022\nTable of Content\nZHRH Corporation\nformerly known as\nKetdarina Corp.\nBalance Sheets\n(Stated in U.S. Dollars)\nJune 30, June 30,\nASSETS\nCurrent assets\nCash and cash equivalents $ 180,079 $ -\nTotal current assets 180,079 -\nTOTAL ASSETS $ 180,079 $ -\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent liabilities\nAccounts payable and accrued expenses $ 126,135 $ 60,664\nRelated parties loan payable 228,382 108,020\nConvertible note, net of discount 284,545 -\nCommon stock payable 148,603 -\nTotal current liabilities 933,119 168,684\nTOTAL LIABILITIES 933,119 168,684\nCOMMITMENTS & CONTINGENCIES - -\nSTOCKHOLDERS DEFICIT\nCommon stock, no par value; 75,000,000 shares authorized, 75,000,000 shares issued and outstanding, respectively 75,000 75,000\nAdditional paid-in capital (15,115 ) (20,916 )\nAccumulated deficit (812,925 ) (222,768 )\nTOTAL STOCKHOLDERS DEFICIT (753,041 ) (168,684 )\nTOTAL LIABILITIES AND STOCKHOLDERS DEFICIT $ 180,079 $ -\nSee accompanying notes to the financial statements\nTable of Content\nZHRH Corporation\nformerly known as\nKetdarina Corp.\nStatements of Operations and Comprehensive Income\n(Stated in U.S. Dollars)\nFor the\nYears ended\nJune 30, June 30,\nOperating expenses\nConsulting fees 293,811 95,001\nAudit and Accounting fees 115,200 44,000\nLegal fees 151,131 34,304\nTransfer agent fees 16,115 7,238\nRegistration fees -\nGeneral and administrative expenses\nTotal operating expenses 578,086 180,761\nIncome (loss) from operation (578,086 ) (180,761 )\nOther income (expenses)\nGain from discontinued operations - 10,437\nInterest expense (12,071 ) -\nTotal other income (expenses) (12,071 ) 10,437\nLoss before tax (590,157 ) (170,324 )\nIncome tax - -\nNet loss $ (590,170 ) $ (170,324 )\nLoss per share\nBasic\nContinuing operations (0.01 ) -\nDiscontinued operations - -\nEarning per share Basic $ (0.01 ) $ -\nWeighted average shares outstanding\nBasic 75,000,000 19,358,630\nSee accompanying notes to the financial statements\nTable of Content\nZHRH Corporation\nformerly known as\nKetdarina Corp.\nStatements of Stockholders Equity (Deficit)\n(Stated in U.S. Dollars)\nCommon Stock Additional\nPaid In\nTotal\nNumber of\nShares Par\nValue Capital\nDeficiency Accumulated\nDeficit Stockholders\nDeficit\nBalance - June 30, 2020 3,740,000 $ 3,740 $ 31,989 $ (52,444 ) $ (16,715 )\n-\nShares issued to related party 71,260,000 71,260 (52,905 ) - 18,355\nNet loss - -\n(170,324 ) (170,324 )\nBalance - June 30, 2021 75,000,000 $ 75,000 $ (20,916 ) $ (222,768 ) $ (168,684 )\nForgiveness of related party debt\n5,801\n5,801\n-\nNet income\n-\n(590,157 ) (590,157 )\nBalance - June 30, 2022 75,000,000.00 $ 75,000.00 $ (15,115 ) $ (812,925 ) $ (753,041 )\nSee accompanying notes to the financial statements\nTable of Content\nZHRH Corporation\nformerly known as\nKetdarina Corp.\nStatements of Cash Flows\n(Stated in U.S. Dollars)\nFor the\nYears Ended\nJune 30, June 30,\nCash flows from operating activities\nNet loss $ (590,170 ) (170,324 )\nAdjustments to reconcile net income (loss) to net cash provided by (used in) operating activities\nGain from discontinued operations - (10,437 )\nStock based compensation 148,603 -\nChanges in assets and liabilities\nIncrease/(decrease) in accruals and other payables 65,470 59,565\nIncrease/(decrease) in related party payables 126,163 121,196\nNet cash used in operating activities from continuing operations (249,921 ) -\nNet cash (used in) from operating activities from discontinued operations - -\nNet cash used in operating activities (249,921 ) -\nProceeds from Convertible note 430,000 -\nPayments on related party debt - -\nNet cash used in financing activities 430,000 -\nNet increase in cash and cash equivalents 180,079 -\nEffect of foreign currency translation on cash and cash equivalents - -\nCash and cash equivalents-beginning of period - -\nCash and cash equivalents-end of period 180,079 -\nLess cash and cash equivalents of discontinued operations-end of period $ - -\nCash and cash equivalents of continuing operations-end of period $ 180,079 -\nSupplementary cash flow information:\nInterest paid $ - -\nIncome taxes paid $ - -\nNon-Cash Financing and Investing Activities:\nIssuance of common stock as settlement of related debt - (18,355 )\nSee accompanying notes to the financial statements\nTable of Content\nZHRH Corporation\nformerly known as\nKetdarina Corp.\nNotes to Financial Statements\nFor the years ended June 30, 2022 and 2021\nNote 1 - Organization and basis of accounting\nBasis of Presentation and Organization\nKetdarina Corp. was incorporated under the laws of the State of Nevada on July 13, 2011. Until November 19, 2014, we were in the business of wholesale of bedding products to industrial, commercial and institutional retailers, and other professional business users, or to other wholesalers and related subordinated services.\nOn November 19, 2014, as reported in our Form 8-K which was filed with the Securities and Exchange Commission on November 28, 2014, the previous principal shareholders: (a) sold their shares to Western Highlands Minerals, Ltd., a Vietnamese corporation WHM); (b) resigned as our management and appointed WHMs designees as new management, (c) took over the inactive bedding business from us, and (d) cancelled all previous debt which we owed to them.\nSince the change of control in 2014, although engaging in ongoing discussions at that time, WHM and its designees did not enter into any agreements or understandings by which the Company would acquire any assets or a business.\nOn December 16, 2020, as a result of a receivership in Clark County, Nevada, Case Number: A-20-816621-B, Custodian Ventures LLC (the Custodian) was appointed receiver of Ketdarina Corp. (the Company). On that same date, the Custodian appointed David Lazar as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer, Chief Executive Officer and Chairman of the Board of Directors. On May 10, 2021, the Court entered an Order terminating the receivership.\nOn April 6, 2021, the Custodian entered into a Common Stock Purchase Agreement (the SPA) pursuant to which the Custodian agreed to sell to Calgary Thunder Bay Limited (the Purchaser), the 71,260,000 shares of common stock of the Company (the Shares) owned by the Custodian, constituting approximately 95.0% of the Companys 75,000,000 issued and outstanding common shares, for $250,000. The sale was consummated on April 13, 2021. As a result of the sale, there was a change of control of the Company. There is no family relationship or other relationship between the Custodian and the Purchaser, or any of the Purchasers affiliates.\nOn that same date, Mr. David Lazar, who was the Companys sole officer and director, submitted his resignation from all management positions and appointed Brett Lovegrove as the sole director and officer of the Company. As a result thereof, Mr. Lovegrove became the sole director and officer of the Registrant.\nThe accompanying condensed financial statements are prepared on the basis of accounting principles generally accepted in the United States of America (GAAP). The Company is a development stage enterprise devoting substantial efforts to establishing a new business, financial planning, raising capital, and research into products which may become part of the Companys product portfolio. The Company has not realized significant sales through since inception. A development stage company is defined as one in which all efforts are devoted substantially to establishing a new business and, even if planned principal operations have commenced, revenues are insignificant.\nNote 2 - Going Concern\nThe accompanying condensed financial statements have been prepared assuming the continuation of the Company as a going concern. The Company has not yet established an ongoing source of revenues sufficient to cover its operating costs and is dependent on debt and equity financing to fund its operations. Management of the Company is making efforts to raise additional funding until a registration statement relating to an equity funding facility is in effect. While management of the Company believes that it will be successful in its capital formation and planned operating activities, there can be no assurance that the Company will be able to raise additional equity capital or be successful in the development and commercialization of the products it develops or initiates collaboration agreements thereon. The accompanying financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result from the possible inability of the Company to continue as a going concern.\nTable of Content\nNote 3 - Summary of significant accounting policies\nCash and Cash Equivalents\nFor purposes of reporting within the statements of cash flows, the Company considers all cash on hand, cash accounts not subject to withdrawal restrictions or penalties, and all highly liquid debt instruments purchased with a maturity of three months or less to be cash and cash equivalents.\nEmployee Stock-Based Compensation\nThe Company accounts for stock-based compensation in accordance with ASC 718 Compensation - Stock Compensation (ASC 718). ASC 718 addresses all forms of share-based payment (SBP) awards including shares issued under employee stock purchase plans and stock incentive shares. Under ASC 718 awards result in a cost that is measured at fair value on the awards grant date, based on the estimated number of awards that are expected to vest and will result in a charge to operations.\nIncome Taxes\nThe Company accounts for income taxes pursuant to FASB ASC Topic 740, Income Taxes. Under FASB ASC Topic 740, deferred tax assets and liabilities are determined based on temporary differences between the bases of certain assets and liabilities for income tax and financial reporting purposes. The deferred tax assets and liabilities are classified according to the financial statement classification of the assets and liabilities generating the differences.\nThe Company maintains a valuation allowance with respect to deferred tax assets. The Company establishes a valuation allowance based upon the potential likelihood of realizing the deferred tax asset and taking into consideration the Companys financial position and results of operations for the current period. Future realization of the deferred tax benefit depends on the existence of sufficient taxable income within the carry-forward period under the Federal tax laws.\nChanges in circumstances, such as the Company generating taxable income, could cause a change in judgment about the reliability of the related deferred tax asset. Any change in the valuation allowance will be included in income in the year of the change in estimate.\nFair Value Measurement\nThe Company values its amounts due to related partings and short term loans payable under FASB ASC 820 which defines fair value, establishes a framework for measuring fair value, and expands disclosures about fair value measurements.\nFair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (exit price). The Company utilizes market data or assumptions that market participants would use in pricing the asset or liability, including assumptions about risk and the risks inherent in the inputs to the valuation technique. These inputs can be readily observable, market corroborated, or generally unobservable. The Company classifies fair value balances based on the observability of those inputs. ASC 820 establishes a fair value hierarchy that prioritizes the inputs used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurement) and the lowest priority to unobservable inputs (level 3 measurement).\nThe three levels of the fair value hierarchy are as follows:\nLevel 1 - Quoted prices are available in active markets for identical assets or liabilities as of the reporting date. Active markets are those in which transactions for the asset or liability occur in sufficient frequency and volume to provide pricing information on an ongoing basis. Level 1 primarily consists of financial instruments such as exchange-traded derivatives, marketable securities and listed equities.\nLevel 2 - Valuations for assets and liabilities that can be obtained from readily available pricing sources via independent providers for market transactions involving similar assets or liabilities. The Companys principal markets for these securities are the secondary institutional markets, and valuations are based on observable market data in those markets.\nLevel 3 - Pricing inputs include significant inputs that are generally less observable from objective sources. These inputs may be used with internally developed methodologies that result in managements best estimate of fair value. The Company uses Level 3 to value its derivative instruments.\nTable of Content\nSubsequent Event\nThe Company evaluated subsequent events through the date when financial statements are issued for disclosure consideration.\nRecent Accounting Pronouncements\nIn August 2020, the FASB issued Accounting Standards Update (ASU) No. 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging- Contracts in Entitys Own Equity (Subtopic 815-40): Accounting for Convertible Instruments and Contracts in an Entitys Own Equity. ASU No. 2020-06 simplifies the accounting for convertible instruments by removing major separation models required under current U.S. GAAP. Consequently, more convertible debt instruments will be reported as a single liability instrument and more convertible preferred stock will be reported as a single equity instrument, with no separate accounting for embedded conversion features. The ASU also removes certain settlement conditions that are required for equity contracts to qualify for the derivative scope exception, which will permit more equity contracts to qualify for the exception. In addition, ASU No. 2020-06 simplifies the diluted earnings per share (EPS) calculation in certain areas. ASU No. 2020-06 is effective for public business entities that meet the definition of an SEC filer, excluding entities eligible to be smaller reporting companies as defined by the SEC, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. For all other entities, ASU No. 2020-06 will be effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted in fiscal years beginning after December 15, 2020. An entity should adopt the guidance as of the beginning of its annual fiscal year. The Company is currently evaluating the impact of this accounting pronouncement on its financial statements.\nOther recent accounting pronouncements issued by the FASB, including its Emerging Issues Task Force, the American Institute of Certified Public Accountants, and the SEC did not or in managements opinion will not have a material impact on the Companys present or future consolidated financial statements.\nNote 4 - Related Party Transactions\nOn December 16, 2020, as a result of a receivership in Clark County, Nevada, Case Number: A-20-816621-B, Custodian Ventures LLC (the Custodian) was appointed receiver of Ketdarina Corp. (the Company). On that same date, the Custodian appointed David Lazar as the Companys Chief Executive Officer, President, Secretary, Chief Financial Officer, Chief Executive Officer and Chairman of the Board of Directors. On May 10, 2021 the Court entered an Order terminating the receivership.\nDuring the fiscal year July 01, 2020 thru April 06, 2021, David Lazar, paid $26,195 of expenses related transfer agent, state registration fees and legal fees on behalf of the Company. On March 09, 2021, the Company issued 71,260,000 shares of common stock issued at par value of $0.001, as repayment of debt owed to the Custodian in the amount of $18,355. On April 12, 2021, Custodian Ventures forgave all amounts owing to them by the Company in the amount of $5,801. As of June 30, 2022 and June 30, 2021, a total of $0 and $5,179, remains outstanding to Custodian Ventures, LLC, respectively.\nDuring the fiscal years ended June 30, 2022, Calgary Thunder Bay paid $126,163 of expenses related to accounting, audit, legal and consulting fees. As June 30, 2022 and June 30, 2021, a total of $228,382 and $102,219 remains outstanding to Calgary Thunder Bay Limited, respectively.\nNote 5 - Common stock\nOn March 09, 2021, the Company issued 71,260,000 shares of common stock issued at par value of $0.001, as repayment of debt owed to the Custodian, LLC in the amount of $18,355.\nAs of June 30, 2022, 75,000,000 shares of common stock with a par value of $0.001 remain issued and outstanding.\nTable of Content\nNote 6 - Convertible notes\nOn January 24, 2022, the Company received $200,000 in exchange for a January 24, 2021 promissory convertible note in the amount of $200,000 from an unrelated third party. The note matures on December 31, 2022 after the issuance date and bears a 10% interest rate. The note is convertible at any time based on the indebtedness of such conversion divided by the value per share of common stock as determined based on a company valuation of $30,000,000. The will be at a current fixed price of $0.40 Due to these provisions, this convertible notes not qualify for derivative accounting under ASC 815-15, Derivatives and Hedging. In addition, this convertible note was issued pursuant to a share purchase agreement between the Company and the note holder. The Company shall issue and sell to Buyer a number of shares of Common Stock equal to (i) $200,000 (the Shares Purchase Price) divided by (ii) the value per share of Common Stock as determined based on a valuation of the Company of $30,000,000 and the number of issued and outstanding shares of Common Stock as of the Shares Closing (the Shares). By way of example and not limitation, in the event that as of the Shares Closing, there are 75,000,000 shares of Common Stock issued and outstanding, Buyer will acquire 500,000 shares of Common Stock ($200,000 divided by $0.40), at a purchase price of $0.40 per share of Common Stock.\nOn March 07, 2022, the Company received $30,000 in exchange for a promissory convertible note in the amount of $30,000 from an unrelated third party. The note matures on December 31, 2022 after the issuance date and bears a 10% interest rate. The note is convertible at any time based on the indebtedness of such conversion divided by the value per share of common stock as determined based on a company valuation of $30,000,000. The will be at a current fixed price of $0.40 Due to these provisions, this convertible notes not qualify for derivative accounting under ASC 815-15, Derivatives and Hedging.\nOn June 01, 2022, the Company amended the January 24, 2022, to cancel the common stock share purchase equal to $200,000 in exchange for a $200,000 convertible note. On that same date, the Company received $200,000 in exchange for a June 01, 2022 promissory convertible note in the amount of $200,000 from an unrelated third party. The note matures on December 31, 2022 after the issuance date and bears a 10% interest rate. The note is convertible at any time based on the indebtedness of such conversion divided by the value per share of common stock as determined based on a company valuation of $30,000,000. The will be at a current fixed price of $0.40 Due to these provisions, this convertible notes not qualify for derivative accounting under ASC 815-15, Derivatives and Hedging.\nA summary of value changes to the notes for the fiscal year ended June 30, 2022 is as follows:\nSchedule of Convertible notes\nCarrying value of Convertible Notes at July 01, 2021 $ -\nNew principal 430,000\nTotal principal 430,000\nLess: conversion of principal -\nLess: deferred financing fees -\nAdd: amortization of deferred financing fees -\nCarrying value of Convertible Notes at June 30, 2022 $ 430,000\nNote 7 - Income Taxes\nThe Company provides for income taxes under FASB ASC 740, Accounting for Income Taxes. FASB ASC 740 requires the use of an asset and liability approach in accounting for income taxes. Deferred tax assets and liabilities are recorded based on the differences between the financial statement and tax bases of assets and liabilities and the tax rates in effect currently.\nFASB ASC 740 requires the reduction of deferred tax assets by a valuation allowance, if, based on the weight of available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized. In the Companys opinion, it is uncertain whether they will generate sufficient taxable income in the future to fully utilize the net deferred tax asset. Accordingly, a valuation allowance equal to the deferred tax asset has been recorded. The cumulative deferred tax asset for the years June 30, 2022 and 2021 is $267,769 and $170,324, respectively, which is calculated by multiplying the estimated tax rate by the cumulative net operating loss (NOL) adjusted for the following items:\nTable of Content\nSchedule of Deferred Tax Assets\nFor the period ended June 30,\nBook loss for the year $ (170,324 ) $ (170,324 )\nTemporary difference:\nAccounts payable and accrued expense 114,064 59,565\nAccrued interest 12,071 -\nTax loss for the year (464,023 ) (110,759 )\nEstimated effective tax rate 21 % 21 %\nDeferred tax asset $ 97,445 $ 23,259\nDetails of valuation allowance for the last two years are as follows:\nSchedule of Valuation Allowance\nFor the period ended June 30,\nBalances at the beginning of the year $ 24,577 $ 1,318\nAdditions 97,445 23,259\nDeductions\n-\nBalance at the end of the Year $ 122,022 $ 24,577\nUncertain Tax Positions\nUnrecognized income tax benefits represent income tax positions taken on income tax returns but not yet recognized in the financial statements. If recognized, substantially all of the unrecognized tax benefits for the Companys fiscal years ended June 30, 2022 and 2021 would affect the effective income tax rate. There were no unrecognized income tax benefits as of June 30, 2022 and 2021.\nThe Company recognizes the interest and penalties accrued related to unrecognized tax benefits in income tax expense. The Company did not recognize any expenses any interest and penalties as of June 30, 2021 and 2020, respectively.\nNote 8 - Commitments and Contingencies\nDirector Agreement with Aymar de Lencqusaing, Brett Lovegrove, Cindy Li, James P. Bond, Jean-Michel Doublet and Lionel Therond\nOn March 9, 2022, the Company entered into a Director Agreement with Aymar de Lencqusaing, Brett Lovegrove, Cindy Li, James P Bond, Jean-Michel Doublet and Lionel Therond. Pursuant to each Director Agreement, each director agreed to perform the duties of a director in accordance with the terms of the Director Agreement with a time commitment of 8-10 days per month, with 4 Board meetings per year. The Director Agreements term starts on March 9, 2022 and terminates upon the earlier of the following to occur: (i) removal of the individual as a director of the Company upon proper shareholder action in accordance with the Companys articles, bylaws and applicable law (ii)Individuals resignation as a director of the Company (iii) individuals death or (iv) failure of the shareholders of the Company to re-elect the individual at the Companys annual shareholder meeting or any special meeting of the shareholders called for the purpose of electing directors.\nPursuant to the Director Agreement, the Company agreed to indemnify each director, if he becomes a party, or is threatened to become a party, to a proceeding (other than an action by or in the right of the Company) by reason of Each individuals status as a director in accordance with the terms and conditions set forth in the Director Agreement. Pursuant to the Director Agreement, the Company agreed to obtain and maintain director and officer insurance for the Company following the completion of the ZHRH Transaction and each director will be named as an insured party under such insurance. There can be no assurance that the Company will enter into any letters of intent or any other oral or written agreements in connection with the ZHRH Transaction, or that the ZHRH Transaction can occur at all.\nTable of Content\nPursuant to the Director Agreement, the Company agreed to compensate each director for such services by issuing each of them shares of the Companys common stock as follows:\n● The intent is that for each full year that he serves as a director of the Company, theyll receive a number of shares of the Companys common stock having a total value of $80,000.\n● The first grant of shares of common stock will be made on the closing of the ZHRH Transaction and will be based on the length of each individuals service as a director of the Company as of that date at the time of closing (the First Grant). The number of shares of common stock to be issued in the First Grant shall be based on a value of each share of common stock as determined based on the number of shares of common stock issued to the shareholders of ZHRH China in the ZHRH Transaction assuming a pre-money valuation of ZHRH China of USD$30 million. In the event that each individual Ceases to serve as a director of the Company for any reason prior to the vesting of the First Grant shares, such First Grant shares will be automatically forfeited.\n● Following the closing of the ZHRH Transaction, for each calendar quarter thereafter during which each individual continues to serve as a director of the Company, the Company will grant each director a restricted stock award of shares of the Companys common stock having a fair market value (as determined by the Board or a committee thereof, but in any case without the involvement of Mr. Lovegrove) as of the last day of each such calendar quarter of $20,000 (each, a Quarterly Grant). Each Quarterly Grant shall vest, if at all, on the one-year anniversary of the applicable grant date, and, once vested, shall be subject to no additional contractual lock-in period. In the event that a director ceases to serve as a director of the Company for any reason, any Quarterly Grant which has not vested at such time will be automatically forfeited.\nNote 9 - Discontinued operations\nOn November 19, 2014, the previous principal shareholders: (a) sold their shares to Western Highlands Minerals, Ltd., a Vietnamese corporation WHM) and/or Mr. Phap Bui as representative; (b) resigned as management and appointed WHMs designees as new management, (c) took over the inactive bedding business from the previous principal shareholders, and (d) cancelled all previous debt which was owed to them.\nSince that change of control, although engaging in ongoing discussions, WHM and its designees did not enter into any agreements or understandings by which the Company would acquire any assets or a business.\nThe major classes of assets and liabilities of the Company at June 30, 2022 are as follows:\nSchedule of Discontinued Operations\nJune 30, June 30,\nASSETS\nCurrent assets\nCash and cash equivalents $ - $ -\nTotal current assets - -\nNon-current assets\nEquipment, net - -\nAssets of discontinued operations $ - $ -\nLIABILITIES\nCurrent liabilities\nAccrued expenses $ - $ -\nLoan from director - -\nTotal current liabilities - -\nLiabilities of discontinued operations - -\nNet (liabilities) assets of discontinued operations $ - $ -\nTable of Content\nNote 8 - Subsequent Events\nIn accordance with ASC 855 the Companys management reviewed all material events through the date these financial statements were available to be issued, there was only one material subsequent event.\nTable of Content\nItem 15. Exhibit and Financial Statement Schedules.\n(b) The following exhibits are filed as a part of this Annual Report on Form 10-K:\nExhibit No.\nDescription\n3.1\nArticles of Incorporation of the Company. (Incorporated by reference to Exhibit 3.1 of the Companys Form 10-K filed with the Securities and Exchange Commission on September 21, 2021).\n3.2\nCertificate of Amendment to Articles of Incorporation of the Company. (Incorporated by reference to Exhibit 3.1 of the Companys Form 10-K filed with the Securities and Exchange Commission on September 21, 2021).\n3.3\nAmended and Restated Bylaws of the Company. (Incorporated by reference to Exhibit 3.1 of the Companys Form 8-K filed with the Securities and Exchange Commission on October 8, 2021).\n10.1\nZHRH- Blue Oak Advisory Second Agreement dated October 24, 2021. (Incorporated by reference to Exhibit 10.1 of the Companys Form 8-K filed with the Securities and Exchange Commission on October 28, 2021).\n10.2\nForm of Note Purchase Agreement with James Purnell Bond dated March 7, 2022. (Incorporated by reference to Exhibit 10.1 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 9, 2022).\n10.3\nForm of Convertibles Promissory Note issued to James Purnell Bond dated March 7, 2022. (Incorporated by reference to Exhibit 10.2 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 9, 2022).\n10.4\nForm of Escrow Agreement with James Purnell Bond dated March 7, 2022. (Incorporated by reference to Exhibit 10.3 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 9, 2022).\n10.5\nForm of Securities Purchase Agreement with Badon Partners SAS and Calgary Thunder Bay Limited dated January 24, 2022. (Incorporated by reference to Exhibit 10.4 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 9, 2022).\n10.6\nForm of Convertibles Promissory Note issued to Badon Partners SAS and Calgary Thunder Bay Limited dated January 24, 2022. (Incorporated by reference to Exhibit 10.5 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 9, 2022).\n10.7\nForm of Escrow Agreement with Badon Partners SAS dated January 24, 2022. (Incorporated by reference to Exhibit 10.6 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 9, 2022).\n10.8\nDirector Agreement with Aymar de Lencquesaing dated March 9, 2022. (Incorporated by reference to Exhibit 10.1 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 11, 2022).\n10.9\nDirector Agreement with Brett Lovegrove dated March 9, 2022. (Incorporated by reference to Exhibit 10.2 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 11, 2022).\n10.10\nDirector Agreement with Cindy Li dated March 9, 2022. (Incorporated by reference to Exhibit 10.3 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 11, 2022).\n10.11\nDirector Agreement with James P. Bond dated March 9, 2022. (Incorporated by reference to Exhibit 10.4 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 11, 2022).\nTable of Content\n10.12\nDirector Agreement with Jean-Michel Doublet dated March 9, 2022. (Incorporated by reference to Exhibit 10.5 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 11, 2022).\n10.13\nDirector Agreement with Lionel Therond dated March 9, 2022. (Incorporated by reference to Exhibit 10.6 of the Companys Form 8-K filed with the Securities and Exchange Commission on March 11, 2022).\n31.1\nCertification of Chief Executive Officer pursuant to Exchange Act Rule 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n31.2\nCertification of the Chief Financial Officer pursuant to Exchange Act Rule 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n32.1\nCertification of the Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n32.2\nCertification of the Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).*\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.*\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.*\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.*\n101.LAB\nInline XBRL Taxonomy Extension Labels Linkbase Document.*\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.*\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101).*\n* Filed herewith.\nIncludes management contracts and compensation plans and arrangements.\nTable of Content\nItem 16. Form 10-K Summary.\nNone.\nTable of Content\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nZHRH CORPORATION\nDated: October 11, 2022 By: /s/ Jean-Michel Doublet\nJean-Michel Doublet\nChief Executive Officer\n(principal executive officer)\nDated: October 11, 2022 By: /s/ Lionel Therond\nLionel Therond\nChief Financial Officer\n(principal financials and accounting officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDated: October 11, 2022 By: /s/ Jean-Michel Doublet\nJean-Michel Doublet\nChief Executive Officer and Director\nDated: October 11, 2022 By: /s/ Lionel Therond\nLionel Therond\nChief Financial Officer and Director\nDated: October 11, 2022 By: /s/ James Purnell Bond\nJames Purnell Bond\nDirector\nDated: October 11, 2022 By: /s/ Aymar de Lencquesaing\nAymar de Lencquesaing\nDirector"
}