{
    "cik": "1602813",
    "company": "FRONTERA GROUP INC.",
    "filing_type": "10-K",
    "filing_date": "2022-10-05",
    "period_of_report": "2022-06-30",
    "sic": "8742",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1602813/0001549727-22-000089-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1602813/000154972722000089/frtg-10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1602813/0001549727-22-000089.txt",
    "filename": "1602813_10K_2022_0001549727-22-000089.htm",
    "content": "Item 1. BUSINESS\nFrontera Group Inc. (the Company, Frontera, we, our, us) was incorporated under the laws of the State of Nevada on November 21, 2013. Frontera Group Inc. strategically acquires revenue generating companies and intellectual property in low-multiple, mature industries within the technology and human capital spaces. With an aggressive four-tier acquisition and implementation strategy, Fronters overarching goal is to bring substantial increases in profitability to mature industries with traditionally low and stagnant EBITA multiples. Frontera creates revenue streams through subscriptions, licensing agreements and data analytics, while growing EBITA by leveraging synergistic acquisitions that maximize scalability.\nOn May 11, 2022, Immersient IP, LLC (Immersient) was formed and registered in the State of Nevada. Immersient is a wholly-owned subsidiary of Frontera Group, Inc. and was created to hold all intellectual property acquired by Frontera. All operations are derived from Immersient.\nOur Business\nFrontera Group Inc. strategically acquires revenue generating companies and intellectual property in low-multiple, mature industries within the technology and human capital spaces. With an aggressive - acquisition and implementation strategy, Fronters overarching goal is to bring substantial increases in profitability to mature industries with traditionally low and stagnant EBITDA multiples. Frontera creates revenue streams through subscriptions, licensing agreements and data analytics, while growing EBITDA by leveraging synergistic acquisitions that maximize scalability.\nAward Winning Industry Pioneer\nFrontera, through its acquisition of IntelliMedias intellectual property, delivers award-winning solutions that bridge the digital gap between large enterprises and end users. Now under the Immersient brand, Fronteras cloud media platform connects content producers, educational institutions, and event producers with participants and viewers, delivering immersive, personal experiences, interactive engagement, existing device compatibility, familiar user conventions, and reliable, always available service.\nDelivering Proprietary State-of-the-Art Solutions\nFronteras proprietary Immersient cloud media platform enables cloud-based content creation, personalization, monetization, management, distribution, and analytics. With its frictionless device and network independent approach to immersive virtual, augmented, and mixed reality environments, Immersient delivers next-generation group collaboration and communications, interactive distance learning and training, and virtualized events, meetings, expos, conferences, and trade shows.\nHigh Growth Target Markets\nA hallmark of the internet age is the shift to personal, intelligent, monetizable one-to-one media streaming. This shift is accelerating with the pandemic-driven dynamics of remote work, learning, and collaboration, all of which demand enhanced virtualization of in person activities across a wide array of the devices, connections, and applications enabled by the Immersient technology.\nRevenue-focused Acquisition Strategy\nFronteras focus is to accelerate growth and profitability using a disciplined buy and build model growth strategy comprised of acquisitions and optimization of its core Immersient cloud media platform into new opportunities, both with existing clients and future prospects. Frontera has established a purpose-built,\nsuccessfully integrated acquisition platform with a pipeline of transformative and bolt-on targets, which include revenue-generating businesses as well as margin and response enhancing intellectual properties.\nPatent, Trademark, License and Franchise Restrictions and Contractual Obligations and Concessions\nWe believe our success, competitive advantages, and growth prospects depend in part upon our ability to develop and protect our technology and intellectual property rights. We rely upon a combination of patents, trademarks, trade secrets, copyrights, confidentiality agreements, contractual commitments and other legal rights to establish and protect our brands and intellectual property rights.\nResearch and Development Activities\nOur research and development efforts are focused on ensuring our software and services continually adapt to ever-evolving cybersecurity threats, developing new and improved functionality to meet our customers needs, and to enable robust and efficient integration with other industry solutions. Our research and development team is responsible for the design, development, testing and quality of our software and works to ensure that our software is available, reliable and stable. We spent $419,350 on development activities during the year ended June 30, 2022. We did not have any research or development expenses during the year ended June 30, 2021.\nCompliance with Environmental Laws\nWe are not aware of any environmental laws that have been enacted, nor are we aware of any such laws being contemplated for the future, that impact issues specific to our business.\nEmployees\nAs of the date of this Annual Report we have three employees, Andrew De Luna, who is the Vice Chairman, Interim Chief Executive Officer, and Chief Financial Officer of the Company, Darshan Sedani, the Chief Visionary Officer and Teodros Gessesse, the Chief Marketing Officer.\nReports to Securities Holders\nWe are a voluntary SEC filer. This means that our securities are not registered under Section 12(b) of the Securities Exchange Act of 1935 (the Exchange Act). As such, we are not subject to the mandatory reporting requirements of those issuers which have securities registered under the Exchange Act. We voluntarily file Form 10-K annually and form 10-Q quarterly. In addition, we will voluntarily file Form 8-K and other proxy and information statements from time to time as necessary. The public may read and copy any materials that we file with the Securities and Exchange Commission, (SEC), at the SECs Public Reference Room at 100 F Street NE, Washington, DC 20549.\nThe public may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC maintains an Internet site (http://www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. Item 1A. RISK FACTORS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. Item 1B. UNRESOLVED STAFF COMMENTS\nNone. Item 2. PROPERTIES\nWe do not hold ownership or leasehold interest in any property. Item 3. LEGAL PROCEEDINGS\nWe are not currently a party to any legal proceedings, and we are not aware of any pending or potential legal actions. Item 4. MINE SAFETY DISCLOSURES\nNot applicable to our Company.\nPART II Item 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED SHAREHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nThere is a limited public market for our common shares. Our Common Stock has been quoted on the OTCQB Board since April 22, 2015, under the symbol FRTG. Because we are quoted on the OTCQB Board, our securities may be less liquid, receive less coverage by security analysts and news media, and generate lower prices than might otherwise be obtained if they were listed on a national securities exchange.\nHolders\nAs of September 12, 2022, there were approximately 17 record holders of 72,130,148 shares of our Common Stock.\nDividends\nWe have not paid any cash dividends to date and do not anticipate or contemplate paying dividends in the foreseeable future. It is the present intention of management to utilize all available funds for the development of our business.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nNone.\nIssuer Purchases of Equity Securities\nWe did not purchase any of our equity securities during the years ended June 30, 2022 and 2021.\nRecent Sales of Unregistered Securities and Use of Proceeds\nWe did not sell any unregistered securities during the years ended June 30, 2022 and 2021. Item 6. RESERVED\nNot applicable. Item 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with our audited financial statements and notes thereto included herein. In connection with, and because we desire to take advantage of, the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, we caution readers regarding certain forward-looking statements in the following discussion and elsewhere in this report and in any other statement made by, or on our behalf, whether or not in future filings with the Securities and Exchange Commission.\nForward-looking statements are statements not based on historical information and which relate to future operations, strategies, financial results, or other developments. Forward looking statements are necessarily based upon estimates and assumptions that are inherently subject to significant business, economic and competitive uncertainties, and contingencies, many of which are beyond our control and many of which, with respect to future business decisions, are subject to change. These uncertainties and contingencies can affect actual results and could cause actual results to differ materially from those expressed in any forward-looking statements made by, or on our behalf. We disclaim any obligation to update forward-looking statements.\nWe are currently a smaller reporting company, meaning that we are not an investment company, an asset-backed issuer, or a majority-owned subsidiary of a parent company that is not a smaller reporting company and have a public float of less than $75 million and annual revenues of less than $50 million during the most recently completed fiscal year. Smaller reporting companies are able to provide simplified executive compensation disclosures in their filings; are exempt from the provisions of Section 404(b) of the Sarbanes-Oxley Act requiring that independent registered public accounting firms provide an attestation report on the effectiveness of internal control over financial reporting; are not required to conduct say-on-pay and frequency votes until annual meetings occurring on or after January 21, 2013; and have certain other decreased disclosure obligations in their SEC filings, including, among other things, only being required to provide two years of audited financial statements in annual reports.\nResults of operations for the years ended June 30, 2022 and 2021.\nRevenue\nDuring the year ended June 30, 2022, we had $372,690 in revenue from royalties on the IP we purchased in March 2022 and $419,350 in cost of revenue. We had no revenue or cost of revenue for the year ended June 30, 2021. We did not perform any services during the year ended June 30, 2021.\nCosts and Expenses\nWe had the following expenses for the years ended June 30, 2022 and 2021:\nYear Ended June 30,\nAdvertising and marketing $ 30,000 $ -\nDepreciation and amortization 62,500 -\nFacilities expenses 39,168 -\nOffice expenses 18,506 -\nProfessional fees 250,290 -\nTravel and entertainment 11,023 -\n$ 411,487 $ -\nDuring the year ended June 30, 2022, professional fees paid were primarily for investor relations of $90,000, legal fees of $52,750, audit fees of $24,425 and consulting fees of $56,300.\nLiquidity and Capital Resources\nJune 30, 2022 June 30, 2021\nTotal assets $ 5,311,838 $ -\nTotal liabilities (6,452,796 ) (18,357 )\nWorking capital deficiency (1,140,958 ) (18,357 )\nLiquidity\nIf we are not successful in expanding our clientele base, maintaining profitability and positive cash flow, additional capital may be required to maintain ongoing operations. We have explored and are continuing to explore options to provide additional financing to fund future operations as well as other possible courses of action. Such actions include, but are not limited to, securing lines of credit, sales of debt or equity securities (which may result in dilution to existing shareholders), loans and cash advances from our directors or other third parties, and other similar actions. There can be no assurance that we will be able to obtain additional funding (if needed), on acceptable terms or at all, through a sale of our Common Stock, loans from financial institutions, our directors, or other third parties, or any of the actions discussed above. If we cannot sustain profitable operations, and additional capital is unavailable, lack of liquidity could have a material adverse effect on our business viability, financial position, results of operations and cash flows.\nCash Flows\nYear ended June 30,\nCash used in operations $ (485,348 ) $ -\nCash provided by financing 486,996 -\nNet change in cash 1,648 -\nCash at beginning of period - -\nCash at end of period $ 1,648 $ -\nCash Flows from Operating Activities\nDuring the year ended June 30, 2022, we used $485,348 in cash for operations. This was primarily our net loss of $1,320,550 offset by the gain on the value of our derivative liabilities of $1,087,784. We did not use or generate any cash in operating activities for the year ended June 30, 2021.\nCash Flows from Investing Activities\nWe did not use or generate any cash from investing activities during the years ended June 30, 2022 and 2021.\nCash Flows from Financing Activities\nDuring the year ended June 30, 2022, financing activities provided $486,996 in cash due to the issuance of convertible notes for $300,000 and the sale of common stock for $186,996. We did not use or generate any cash from financing activities during the year ended June 30, 2021.\nManagement expects to keep operating costs to a minimum until cash is available through financing or operating activities. Management plans to continue to seek, in addition to equity financing, other sources of financing (e.g., line of credit, shareholder loan) on favorable terms; however, there are no assurances that any such financing can be obtained on favorable terms, if at all.\nIf we are unable to generate profits sufficient to cover our operating costs or to obtain additional funds for our working capital needs, we may need to cease or curtail operations. Furthermore, there is no assurance the net proceeds from any successful financing arrangement will be sufficient to cover cash requirements during the initial stages of our operations.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements. Item 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. Item 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nFRONTERA GROUP INC.\nJune 30, 2022\nIndex to the Financial Statements\nContents\nAudited Balance Sheets as of June 30, 2022 and June 30, 2021\nAudited Statements of Operations for the Years Ended June 30, 2022 and 2021\nAudited Statements of Cash Flows for the Years Ended June 30, 2022 and 2021\nAudited Statements of Shareholders Equity for the Years Ended June 30, 2022 and 2021\nNotes to the Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo: Board of Directors and Shareholders,\nFrontera Group, Inc., and its wholly owned subsidiary Immerscient, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Frontera Group, Inc., and its wholly owned subsidiary Immerscient, Inc. (the Company) as of June 30, 2022, and the related statements of income, comprehensive income, stockholders equity, and cash flows for year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial doubt about the Companys ability to continue as a Going concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has not generated revenues sufficient to cover operating costs over an extended period of time and has an accumulated deficit as of June 30, 2022. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plan in regards to these matters are also described in Note 3 to the financial statements. The financial statements do not include any adjustments that might result from the outcome of this uncertainty. Our opinion is not modified with respect to this matter.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nA critical audit matter is any matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Victor Mokuolu, CPA PLLC\nPCAOB ID: 6771\nWe have served as the Companys auditor since 2021.\nHouston, Texas\nOctober 5, 2022\nFRONTERA GROUP INC.\nBALANCE SHEETS\nJune 30, 2022 June 30, 2021\nCurrent Assets: $ - $ -\nCash 1,648 -\nAccounts receivable 372,690 -\nTotal current assets 374,338 -\nNon-Current Assets:\nPatents, net 4,937,500 -\nTotal Assets $ 5,311,838 $ -\nCurrent Liabilities:\nAccounts payable $ 439,363 $ 18,357\nAccrued liabilities 4,886,612 -\nAccrued interest 3,667 -\nConvertible notes payable 300,000 -\nDiscount on convertible notes (264,630 ) -\nTotal current liabilities 5,365,012 18,357\nNon-Current Liabilities:\nDerivative liabilities 1,087,784 -\nTotal Liabilities $ 6,452,796 $ 18,357\nCommitments and Contingencies\nShareholders (Deficit)\nPreferred stock, par value $0.00001 per share: 5,000,000 shares authorized; Series A Preferred stock, par value $0.00001 per share: none authorized and outstanding at June 30, 2022 and 2021 $ - $ -\nCommon stock, par value $0.00001 per share: 990,000,000 shares authorized; 47,563,483 shares issued and outstanding at June 30, 2022; 307,280,150 shares issued and outstanding at June 30, 2021 3,073\nAdditional paid-in-capital 314,893 125,300\nDeficit (1,456,327 ) (146,730 )\nTotal shareholders (deficit) $ (1,140,958 ) $ (18,357 )\nTotal Liabilities and Shareholders (Deficit) $ 5,311,838 $ -\nSee accompanying notes to the financial statements.\nFRONTERA GROUP INC.\nSTATEMENTS OF OPERATIONS\nYears Ended June 30,\nRevenue $ 372,690 $ -\nCost of revenue 419,350 -\nGross profit (46,660 ) -\nOperating expenses:\nGeneral and administrative expenses 411,487 -\nOther (income) expenses:\nInterest expense 885,229 -\n(Gain) loss on fair value of derivatives (22,825 ) -\nMiscellaneous income (1 ) -\nTotal other (income) expense 862,403 -\nLoss before income tax benefit (1,320,550 ) -\nIncome tax benefit - -\nNet loss $ (1,320,550 ) $ -\nNet loss per common share:\nBasic and Diluted $ (0.01 ) $ -\nWeighted-average common shares outstanding:\nBasic and Diluted 103,579,487 307,280,150\nSee accompanying notes to the financial statements.\nFRONTERA GROUP INC.\nSTATEMENTS OF CASH FLOWS\nYears Ended June 30,\nOperating Activities:\nNet (loss) $ (1,320,550 ) $ -\nAdjustments to reconcile net loss to net cash used in operating activities:\nChange in value of derivative liability 1,704,716 -\nDepreciation and amortization 62,500 -\nNon-cash interest (881,562 ) -\nOther 10,954 -\nChanges in operating assets and liabilities:\nAccounts receivable (372,690 ) -\nAccounts payable 421,005 -\nAccrued liabilities (109,721 ) -\nNet Cash (Used In) Operating Activities $ (485,348 ) $ -\nFinancing Activities:\nProceeds from convertible notes 300,000 -\nIssuance of common shares 186,996 -\nNet Cash (Used In) Financing Activities $ 486,996 $ -\nNet Change in Cash 1,648 -\nCash - Beginning of Period - -\nCash - End of Period $ 1,648 $ -\nSee accompanying notes to the financial statements.\nFRONTERA GROUP INC.\nSTATEMENTS OF SHAREHOLDERS EQUITY\nFor the Years Ended June 30,\nNumber of\nShares Common\nStock Paid-in\nCapital Retained\nEarnings\n(Deficit) Total\nBalance at June 30, 2020 307,280,150 $ 3,073 $ 125,300 $ (146,730 ) $ (18,357 )\nNet Income - - - - -\nBalance at June 30, 2021 307,280,150 $ 3,073 $ 125,300 $ (146,730 ) $ (18,357 )\nBalance at June 30, 2021 307,280,150 $ 3,073 $ 125,300 $ (146,730 ) $ (18,357 )\nCancellation of shares (300,000,000 ) (3,000 ) 3,000 - -\nAdj to Retained Earnings - - - 10,953 10,953\nIssuance of new shares 38,533,333 186,611 - 186,996\nIssuance of new shares - loan inducement 1,750,000 (18 ) - -\nNet Income - - - (1,320,550 ) (1,320,550 )\nBalance at June 30, 2022 47,563,483 $ 476 $ 314,893 $ (1,456,327 ) $ (1,140,958 )\nSee accompanying notes to the financial statements.\nFRONTERA GROUP INC.\nFor the Years Ended June 30, 2022 and 2021\nNotes to the Financial Statements\nNote 1 - Organization and Operations\nFrontera Group Inc. (the Company, Frontera, we, our, us) was incorporated under the laws of the State of Nevada on November 21, 2013. Frontera Group Inc. strategically acquires revenue generating companies and intellectual property in low-multiple, mature industries within the technology and human capital spaces. With an aggressive four-tier acquisition and implementation strategy, Fronters overarching goal is to bring substantial increases in profitability to mature industries with traditionally low and stagnant EBITA multiples. Frontera creates revenue streams through subscriptions, licensing agreements and data analytics, while growing EBITA by leveraging synergistic acquisitions that maximize scalability.\nOn May 11, 2022, Immersient IP, LLC (Immersient) was formed and registered in the State of Nevada. Immersient is a wholly-owned subsidiary of Frontera Group, Inc. Immersient was formed to hold all intellectual property acquired by Frontera. All operations are derived from Immersient.\nNote 2 - Summary of Significant Accounting Policies\nBasis of Presentation and Principles of Consolidation\nThe accompanying financial statements have been prepared using the accrual basis in accordance with accounting principles generally accepted in the United States of America (GAAP) as determined by the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) and pursuant to the regulations of the U.S. Securities and Exchange Commission (SEC). The consolidated financial statements include the accounts of the Company and its controlled subsidiaries. All intercompany transactions and balances have been eliminated.\nUse of Estimates and Assumptions\nThe preparation of the consolidated financial statements in conformity with GAAP requires management to make estimates and assumptions that impact the amounts reported in the consolidated financial statements and accompanying notes. Significant estimates include, but are not limited to, the recognition of revenues and expenses, the valuation of intangible assets, including amortization, the valuation of derivatives, and the valuation of the warrant issued. We base these estimates on historical experience and on various other assumptions that we believe are reasonable under the circumstances, the results of which form the basis for making judgements about the carrying amounts of assets and liabilities. Actual results could differ from those estimates.\nCash and Cash Equivalents\nWe consider all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents.\nAccounts Receivable and Expected Credit Losses\nOur receivables primarily arise from the billing of royalties for the use of our intellectual property (IP). We currently have one royalty agreement in place. We estimate expected credit losses based on factors such as the composition of accounts receivable, the age of the accounts, historical bad debt experience, and our evaluation of the financial condition and past collection history of each customer. Management believes that the historical loss information it has compiled is a reasonable base on which to determine expected credit\nlosses for trade receivables held at June 30, 2022, because the composition of the trade receivables at that date is consistent with that used in developing the historical credit-loss percentages (i.e., the similar risk characteristics of its customers and its credit practices have not changed significantly over time).\nIntangible Assets\nIntangible assets deemed to have finite lives are generally amortized on a straight-line basis over their estimated useful lives, where the useful life is the period over which the asset is expected to contribute directly, or indirectly, to our future cash flows.\nFair Value of Financial Instruments\nWe measure the fair value of financial assets and liabilities based on the guidance of ASC 820 Fair Value Measurements and Disclosures which defines fair value, establishes a framework for measuring fair value, and expands disclosures about fair value measurements.\nASC 820 defines fair value as the price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. ASC 820 also establishes a fair value hierarchy, which requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. ASC 820 describes three levels of inputs that may be used to measure fair value as follows:\n● Level 1 - quoted prices in active markets for identical assets or liabilities\n● Level 2 - inputs other than quoted prices in level 1 that are observable either directly or indirectly.\n● Level 3 - inputs based on prices or valuation techniques that are both unobservable and significant to the fair value markets.\nThe conversion option on the Note and the Warrant are required to be presented at fair value on a recurring basis. Carrying values of non-derivative financial instruments, including cash, accounts receivable, accounts payable, and short-term debt approximated their fair value due to the short maturity of these financial instruments. There were no changes in methods or assumptions during the periods presented.\nDerivative Instruments\nConvertible Note and Common Stock Warrant Liability\nOn March 11, 2022, we issued a convertible note (the Note) with warrant (Warrant) with default and fundamental transaction adjustment; variable rate default provision; and full reset features. The Note is a 10% $300,000 promissory note which is convertible upon an event of default. The Warrant gives the holder the right to purchase 1,000,000 shares of our Common Stock at an exercise price of $0.50. We shall not affect any exercise of this Warrant, and a Holder shall not have the right to exercise any portion of this Warrant, to the extent that after giving effect to issuance of Warrant Shares upon exercise as set forth on the applicable Notice of Exercise, the Holder (together with the Holders Affiliates, and any other persons acting as a group together with the Holder or any of the Holders Affiliates), would beneficially own in excess of 4.99% of the number of shares of Common Stock outstanding immediately after the giving effect to the issuance of shares of Common Stock issuable upon exercise of this Warrant. The Warrant will expire on March 11, 2027 and may be assigned by the holder to a third party, in whole or in part, without the need to obtain our consent thereto. This Warrant remained outstanding as of June 30, 2022.\nWe evaluated the conversion option of the Note and the Warrant under ASC 815, Derivatives and Hedging-Contracts in Entitys Own Equity, and concluded they do not meet the criteria to be classified in shareholders equity. The conversion feature of the Note should be valued as a derivative liability based on the guidance in ASC 815, Derivatives and Hedging-Contracts in Entitys Own Equity, and EITF 07-05, Determining\nWhether an Instrument (or Embedded Feature) is Indexed to an Entitys Own Stock. The Warrant liability is valued to provide a discount for the note at issuance. The occurrence of a default will trigger a tainted equity environment due to market based variable rate conversion prices resulting in an indeterminate number of shares. The warrant will then be treated as tainted derivative liabilities. These derivative liabilities will need to be marked-to-market each period with the change in fair value recorded in the income statement.\nRevenue Recognition\nOur primary source of revenues is from the development and licensing of our IP to our customers. Revenues are presented net of any taxes that are collected from our customers and remitted to governmental authorities. We are the principal in all our relationships with our customers.\nAt contract inception, we assess the goods and services promised in our contracts with customers and identify a performance obligation for each promise to transfer to the customer a good or service (or bundle of goods or services) that is distinct. The performance obligation in all of our contracts with customers is to provide them a license to use our IP. Because our customers are granted a right to access the IP, including new patents, we recognize revenues ratably over the term of the agreement.\nAs of June 30, 2022, we have one customer to whom we license our IP.\nAdvertising and Marketing\nAdvertising and marketing costs for promoting our corporate image as incurred and included in general and administrative expenses.\nIncome Taxes\nWe account accounts for income taxes under ASC 740, Income Taxes. Under the asset and liability method of ASC 740, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statements carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period the enactment occurs. A valuation allowance is provided for certain deferred tax assets if it is more likely than not that the Company will not realize tax assets through future operations.\nTax benefits related to uncertain tax positions are recognized when it is more likely than not that a tax position will be sustained during an audit. Interest and penalties, if any, related to unrecognized tax benefits are included within the provision for income tax.\nEarnings (loss) per Share\nEarnings (loss) Per Share (EPS) is the amount of earnings (loss) attributable to each share of Common Stock. EPS is computed pursuant to section 260-10-45 of the Financial Accounting Standards Board (FASB) Accounting Standards Codification. Pursuant to Accounting Standards Codification (ASC) Paragraphs 260-10-45-10 through 260-10-45-16, basic EPS is computed by dividing net income (loss) available to common shareholders (the numerator) by the weighted-average number of common shares outstanding (the denominator) during the period.\nThe computation of diluted EPS is similar to the computation of basic EPS except that the denominator is increased to include the number of additional common shares that would have been outstanding if the dilutive potential common shares had been issued during the period to reflect the potential dilution that could occur from common shares issuable through contingent shares issuance arrangements, stock options or warrants. When we have a loss, dilutive shares are not included as they would be antidilutive.\nThe following table shows the computation of basic and diluted earnings (loss) per share for the years ended June 30, 2022 and 2021:\nSchedule of Basic and Diluted Earnings (Loss) Per Share\nYears Ended June 30,\nNumerator:\nNet income (loss) $ (1,320,550 ) $ -\nDenominator:\nWeighted-average basic shares outstanding 103,579,487 307,280,150\nBasic and Diluted earnings per share $ (0.01 ) $ -\nWe apply the treasury stock method to determine the dilutive effect of potentially dilute securities. Potentially dilutive securities representing 382,716 shares of our Common Stock were excluded from the computation of diluted earnings per share during the year ended June 30, 2022 because their effect would have been antidilutive due to a loss in that period. There were no potentially dilutive shares during the year ended June 30, 2021.\nRecently Issued Accounting Pronouncements\nConvertible Instruments Beginning with 2022 interim reporting, we early-adopted ASU No. 2020-06, Debt-Debt With Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40): Accounting for Convertible Instruments and Contracts in an Entitys Own Equity (ASU 2020-06). ASU 2020-06 eliminated certain separation models regarding cash conversion and beneficial conversion features to simplify reporting for convertible instruments as a single liability or equity, with no separate accounting for embedded conversion features. Additionally, ASU 2020-06 requires that instruments which may be settled in cash or stock are presumed settled in stock in calculating diluted earnings per share. The adoption of this standard had no effect on our financial statements. We considered the guidance in this standard when we issued a convertible note on March 11, 2022.\nNote 3 - Going Concern\nAs reflected in the accompanying financial statements, we have a deficit of $1,456,327 at June 30, 2022, a net loss of $1,320,550 for the year ended June 30, 2022 and net cash used in operating activities of $485,348 for the year ended June 30, 2022. These factors raise substantial doubt about our ability to continue as a going concern.\nWe are attempting to commence operations and generate sufficient revenue; however, our cash position is not sufficient to support our daily operations. Management intends to raise additional funds by way of a private or public offering. While we believe in the viability of its strategy to commence operations and generate sufficient revenue and in its ability to raise additional funds, there can be no assurances to that effect. Our ability to continue as a going concern is dependent upon our ability to further implement its business plan and generate sufficient revenue and its ability to raise additional funds by way of a public or private offering.\nThe accompanying financial statements have been prepared assuming that we will continue as a going concern. The financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of asset or the amounts and classification of liabilities that might be necessary if we are unable to continue as a going concern.\nNote 4 - Intangible Assets\nIn March 2022, we purchased intellectual property (IP) consisting of patents, trademarks, copyrights and domain names for $5,000,000 from Intellimedia Networks, Inc., a U.S. corporation. Payment of the $5,000,000 will occur over the subsequent twelve months.\nIntellimedia India, an India entity (not related to Intellimedia Networks, Inc.) had licensed the use of this IP to third parties and we receive the benefit of these arrangements through the acquisition of the IP. We will continue to use Intellimedia India for the further development and maintenance of this IP in the future and currently, they are our only vendor for costs of revenue.\nWe began amortizing these patents over their useful life of twenty years during the three months ended June 30, 2022. We will recognize $250,000 of amortization expense in each of the next five years.\nNote 5 - Fair Value Measurements\nOur financial assets and liabilities subject to fair value measurements on a recurring basis and the level of inputs used for such measurements were as follows:\nSchedule of Fair Value Measurement on Recurring Basis\nJune 30, 2022\nLevel 1 Level 2 Level 3\nLiabilities\nWarrant $ - $ - $ 890,603\nTotal Liabilities $ - $ - $ 890,603\nFair values of cash and cash equivalents, accounts receivable, accounts payable, and accrued expenses approximate the recorded value due to the short period of time to maturity. The Companys Warrant is classified within Level 3 of the fair value hierarchy because its fair value is based on significant inputs that are unobservable in the market.\nThe valuation of the Warrant uses assumptions and estimates we believe would be made by a market participant in making the same valuations. We assess these assumptions and estimates on an on-going basis as additional data impacting the assumptions and estimates are obtained.\nWe determined the fair value of the Warrant using Monte Carlo option-pricing models and the quoted price of our Common Stock. The Monte Carlo technique applied generates many possible (but random) price paths for the underlying (or underlyings) via simulation, and then calculates the associated payment value of the derivative features. The price of the underlying Common Stock is modeled such that it follows a geometric Brownian motion with constant drift, and constant volatility. The stock price is determined by a random sampling from a normal distribution. Since the underlying random process is the same, for enough price paths, the value of derivative is derived from path dependent scenarios and outcomes.\nThe features in the notes that were analyzed and incorporated into the model included the only the default provisions. The features in the warrants that were analyzed and incorporated into the model included the exercise features (including a call option) and the full ratchet reset provisions.\n● Based on the instruments features, there are six primary events that could occur: payments are made in cash; payments are made with stock; the Holder converts the note; the Issuer redeems the note; a reset or default event occurs; or we default on the Note.\n● There are four primary events that can occur in the Warrants; the Holder exercises the option at maturity; a reset or default event occurs adjusting the exercise price and the number of options; or the warrant expires.\nThe model simulates the underlying economic factors that influenced which of these events would occur, when they were likely to occur, and the specific terms that would be in effect at the time (i.e., stock price, conversion price, etc.). Probabilities were assigned to each variable such as the timing and pricing of events\n(future financings - potential resets, fundamental transaction, exercise, redemption, and default) over the remaining term of the instruments based on management projections.\nThe following table present significant assumptions utilized in the valuation of the Warrant at the issuance date of March 11, 2022 and June 30, 2022.\nSchedule of Significant Assumptions Utilized in the Valuation\nAs of March 11, 2022 As of June 30, 2022\nRisk-free rate 1.11 % 2.39 %\nVolatility 137.8 % 136.9 %\nContractual term (in years) 1.0 0.7\nExercise price $ 0.050 $ 0.050\nFor the year ended June 30, 2022, the change in the fair value of the Warrant resulted from the change in price of our Common Stock. The changes in fair value are included in the consolidated statements of operations as a component of change in fair value of warrant liabilities and in the consolidated balance sheets as other liabilities.\nNote 6 - Accrued Liabilities\nAccrued liabilities at June 30, 2022 primarily consisted of accrued interest of $3,667 and a liability of $5,000,000 for the patents purchased in March 2022. There were no accrued liabilities at June 30, 2021.\nNote 7 - Convertible Notes Payable and Warrants\nOn March 11, 2022, we entered into a Securities Purchase Agreement (collectively, the Purchase Agreement) with AJB Capital Investments LLC (the Investor), for the sale of a convertible promissory note with a principal amount of $300,000 (the Note) and Warrants to purchase 1,000,000 shares of the Companys common stock (collectively, the Warrants).\nWe entered into an agreement for a convertible note and warrants with AJB Capital Fund for $300,000 with a 6-month maturity due and maturing on September 11, 2022 and 1,000,000 options at $0.50 with the following terms:\n1. Interest rate of 10% increasing to 12% after 6 months; and 18% default rate;\n2. Conversion prices subject to adjustment as the result of a dilutive issuance (a Full Reset provision); and convertible upon default at variable rates.\n3. The Company received $270,000 in cash proceeds, recording an original issue discount of $30,000.\n4. Six months after the issue date, the principal and interest are convertible into our Common Stock at\na. 100% of the 20-day trading low at a 6-month default (the initial default) and\nb. 40% of trading low from issuance at 9 months (the toxic default).\n5. Included is a warrant issued to acquire 1,000,000 common shares at an exercise price of $0.50 per share, (subject to adjustment as the result of a fundamental transaction), and a 5-year maturity.\nNote 8 - Common Stock Warrant Liability\nThe Warrant was recorded at fair value as other long-term liabilities in the consolidated balance sheets. The fair value of the Warrant was remeasured as of June 30, 2022, resulting in a $22,285 non-cash change in fair value gain in the consolidated statements of operations for the three months ended June 30, 2022.\nNote 9- Shareholders Deficit\nShares authorized\nUpon formation, the total number of shares of all classes of stock which the Company was authorized to issue seventy-five million (75,000,000) shares of Common Stock, par value $0.001 per share. On February 23, 2016, the Company increased its authorized common shares to one billion (1,000,000,000) shares and decreased the par value to $0.00001 per share. On March 16, 2022, the Board of Directors of Frontera amended the Articles of Incorporation to change 10,000,000 shares of Common Stock into Preferred Stock. In addition, the Preferred Stock was further split to create 5,000,000 shares of Series A Preferred Stock. The part value of $0.0001 per share did not change for any class of shares.\nCommon Shares\nHolders of Common Stock have no preemptive rights to purchase additional shares of Common Stock or other subscription rights. The Common Stock carries no conversion rights and is not subject to redemption or to any sinking fund provisions. All shares of Common Stock are entitled to share equally in dividends from sources legally available; therefore, when, as and if declared by the Board of Directors, and upon liquidation or dissolution of Frontera, whether voluntary or involuntary, to share equally in the assets of Frontera available for distribution to shareholders.\nThe Board of Directors is authorized to issue additional shares of Common Stock not to exceed the amount authorized by Fronteras Articles of Incorporation, on such terms and conditions and for such consideration as the Board may deem appropriate without further shareholder action.\nVoting Rights of Common Shares\nEach holder of Common Stock is entitled to one vote per share on all matters on which such shareholders are entitled to vote. Since the shares of Common Stock do not have cumulative voting rights, the holders of more than 50% of the shares voting for the election of Directors can elect all the Directors if they choose to do so and, in such event, the holders of the remaining shares will not be able to elect any person to the Board of Directors.\nDividend Policy for Common Shares\nHolders of our Common Stock are entitled to dividends if declared by the Board of Directors out of funds legally available. We do not anticipate the declaration or payment of any dividends in the foreseeable future. We intend to retain earnings, if any, to finance the development and expansion of our business. Future dividend policy will be subject to the discretion of the Board of Directors and will be contingent upon future earnings, if any, our financial condition, capital requirements, general business conditions, and other factors. Therefore, there can be no assurance that any dividends of any kind will ever be paid.\nPreferred Shares\nShares of Preferred Stock may be issued in one or more series. The number of shares included in any series of Preferred Stock and the full or limited voting rights, if any, the cumulative or non-cumulative dividend rights, if any, the conversion, redemption or sinking fund rights, if any and the priorities, preferences and relative, participating, optional and other special rights, if any, in respect of the Preferred Stock, any series of Preferred Stock or any rights pertaining thereto, and the qualification, limitations or restrictions on the Preferred Stock, any series of Preferred Stock or any rights pertaining thereto, shall be those set forth in the resolution or resolutions providing for the issuance of the Preferred Stock or such series of Preferred Stock adopted at any time and from time to time by the board of directors of the Corporation (the Board) and filed with the Secretary of State of the State of Nevada. The holders of Series A Preferred Stock shall have the right to transfer each share of the Series A Preferred Stock to any third party at any time in such holders sole and absolute discretion, subject to compliance with applicable securities laws.\nPreferred Stock is not convertible.\nSeries A Preferred Stock\nVoting Rights of Series A Preferred Stock\nThe holders of Series A Preferred Stock shall be entitle to two hundred (200) votes per share of Series A Preferred Stock.\nDividend Policy for Series A Preferred Stock\nThe holders of Series A Preferred Stock is not entitled to any dividend.\nNote 10 - Income Tax Provision\nDeferred Tax Assets\nWe operate in the United States; accordingly, federal and state income taxes have been provided based upon the tax laws and rates of the United States deferred taxes are determined based on the temporary differences between the financial statement and income tax bases of assets and liabilities as measured by the enacted tax rates, which will be in effect when these differences reverse.\nWe are subject to United States income taxes at a rate of 21%. The reconciliation of the provision for income taxes at the United States statutory rate compared to our income tax expense as reported is as follows:\nSchedule of Income Tax Reconciliation\nFor the Period\nfrom July 1, 2021\nto June 30, 2022\nIncome tax benefit at statutory tax rate (305,829 )\nChange in valuation allowance 305,829\nIncome tax expense (benefit) $ -\nThe following tables set forth the components of deferred income taxes as of June 30, 2022:\nSchedule of Deferred Income Taxes\nDeferred tax assets:\nNet operating loss carryforwards 305,829\nLess: valuation allowance (305,829 )\nTotal deferred tax asset $ -\nAs of June 30, 2022, we had federal, state, and local net operating loss carryforwards of $305,829 that are available to offset future liabilities for income taxes. We have generally established a valuation allowance against these carryforwards based on an assessment that it is more likely than not that these benefits will not be realized in future years.\nWe are currently not subject to examination in federal, state, and local jurisdictions in which we conduct our operations and files tax returns.\nWe have made an assessment of the level of tax authority for each tax position (including the potential application of interest and penalties) based on the technical merits and determined that no unrecognized tax benefits associated with the tax positions exist\nNote 11 - Related Party Transactions\nIn March 2022, we purchased intellectual property (IP) consisting of patents, trademarks, copyrights and domain names for $5,000,000 from Intellimedia Networks, Inc. (IMNI), a U.S. corporation. Mr. Gessesse and Mr. Sedani were employed by IMNI at the time of this purchase. They became employees of Frontera on\nJuly 22, 2022 (see Note 12 - Subsequent Events for more details). The balance due to IMNI is included in accrued liabilities on our Consolidated Balance Sheet as of June 30, 2022.\nMr. De Luna and Mr. Toussaint are co-owners of Bayou Moon Capital (Bayou Moon). Bayou Moon sent Frontera $5,000 on June 30, 2022 for working capital purposes. This balance due to Bayou Moon is included in accrued liabilities on our Consolidated Balance Sheet as of June 30, 2022.\nMr. Toussaint sent Frontera $3,500 on June 30, 2022 for working capital purposes. This balance due to Mr. Toussaint is included in accrued liabilities on our Consolidated Balance Sheet as of June 30, 2022.\nThe following table sets forth certain information regarding beneficial ownership of our Common and Series A Preferred Stock as of June 30, 2022 by each person or entity known by us to beneficially own more than five percent (5%) of any class of our outstanding shares. There are 18,750,000 shares of our Common Stock held by our Chairman of the Board. There are 5,000,000 shares of our Series A Preferred Stock held by a company under direct control of our officers or directors. As of June 30, 2022, there were 47,563,483 shares of our Common Stock outstanding and 5,000,000 shares of our Series A Preferred Stock outstanding:\nTitle of Class Name of Beneficial\nOwners, Directors and\nOfficers: Amount and Nature\nof Beneficial\nOwnership Percentage of\nBeneficial Ownership\n%\nCommon (1) Mann Yam 18,750,000 24.2%\nBin Zhou 18,750,000 24.2%\nTotal\n37,500,000 48.4%\n(1)   Applicable percentage of ownership is based on 77,396,815 shares of Common Stock outstanding on September 19, 2022. Percentage ownership is determined based on shares owned together with securities exercisable or convertible into shares of Common Stock within 60 days of September 19, 2022, for each shareholder. Beneficial ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities.  Shares of Common Stock subject to securities exercisable or convertible into shares of Common Stock that are currently exercisable or exercisable within 60 days of September 19, 2022, are deemed to be beneficially owned by the person holding such securities for the purpose of computing the percentage of ownership of such person but are not treated as outstanding for the purpose of computing the percentage ownership of any other person. Common Stockholders are entitled to 1 voting right per share. We have evaluated all events that occurred after the balance sheet date through the date when the financial statements were issued to determine if they must be reported.\nNote 12 - Subsequent Events\nWe have evaluated all events that occurred after the balance sheet date through the date when the financial statements were issued to determine if they must be reported.\nIn connection with the Purchase Agreement, the Company entered into employment agreements with Mr. Gessesse and Mr. Sedani dated July 22, 2022 (the Employment Agreements) for an initial term of three (3) years (the Initial Term), commencing on the date of execution of the agreement which will automatically renew thereafter for successive terms of one (1) year each (each, a Renewal Term), unless one of the parties gives written notice of termination to the other party at least sixty (60) days prior to the last day of the Initial Term or the then-current Renewal Term, as applicable.\nBoth Mr. Gessesses and Mr. Sedanis initial annual base salary will be $150,000. Each of Mr. Gessesse and Mr. Sedani will be eligible to receive a quarterly bonus as determined by, and within the sole discretion of, the Companys board of directors (the Board) and Mr. Gessesse and Mr. Sedani were granted 23,500,000 and 31,500,000 shares, respectively, of the Companys common stock valued at $0.25 per share.\nWith respect to 2022 and subsequent calendar years, both Mr. Gessesse and Mr. Sedani will be eligible to receive additional equity incentive award grants of the types, in the amounts and on a basis commensurate\nwith the equity incentive awards granted to similarly-situated executive officers of the Company, as determined from time to time by the Companys Board. Mr. Gessesse and Mr. Sedani will both be eligible to participate in the employee benefits plans generally available to other senior executive officers of the Company.\nIf Mr. Gessesses or Mr. Sedanis employment ceases due to a termination by the Company other than for cause or his resignation with good reason (as such terms are defined in the Employment Agreements), then, subject to his timely execution and non-revocation of a release of claims, he will receive: (i) payment of any otherwise earned but unpaid compensation and benefits through the date of termination; (ii) a lump sum cash payment equal to 12 months of his annual base salary, plus all annual bonuses for the period from the date of termination through the end of the initial term or the then-current renewal term, as applicable; (iii) COBRA premiums until the earliest to occur of the expiration of twelve (12) months following the date of termination, the date he becomes eligible for participation in health and dental plans of another employer, or the date he ceases to be eligible for participation under the Companys health and dental plans under COBRA; and (iv) accelerated vesting of all the outstanding and otherwise unvested equity awards.\nNo family relationship exists between Mr. Gessesse or Mr. Sedani and any of the Companys directors or executive officers. There are no arrangements or understandings between Mr. Gessesse or Mr. Sedani and any other person pursuant to which Mr. Gessesse or Mr. Sedani was selected as an officer of the Company, nor are there any transactions to which the Company is or was a participant and in which Mr. Gessesse or Mr. Sedani had or will have a direct or indirect material interest subject to disclosure under Item 404(a) of Regulation S-K.\nThe foregoing description of the Employment Agreements do not purport to be complete and are subject to, and qualified in their entirety by, the full text of each of the employment agreements, a copy of which is filed as Exhibit 10.2 and 10.3 hereto and is incorporated by reference herein. Item 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone Item 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls\nWe evaluated the effectiveness of our disclosure controls and procedures as of the end of the 2021 fiscal year. This evaluation was conducted with the participation of our chief executive officer and our principal accounting officer.\nDisclosure controls are controls and other procedures that are designed to ensure that information that we are required to be disclosed in the reports we file pursuant to the Securities Exchange Act of 1934 is recorded, processed, summarized and reported.\nLimitations on the Effective of Controls\nOur management does not expect that our disclosure controls or our internal controls over financial reporting will prevent all error and fraud. A control system, no matter how well conceived and operated, can provide only reasonable, but no absolute, assurance that the objectives of a control system are met. Further, any control system reflects limitations on resources, and the benefits of a control system must be considered relative to its costs. These limitations also include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people or by management override of a control. A design of a control system is also based upon certain assumptions about potential future conditions; over time, controls may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and may not be detected.\nConclusions\nBased upon their evaluation of our controls, the chief executive officer and principal accounting officer have concluded that, subject to the limitations noted above, the disclosure controls are not effective providing reasonable assurance that material information relating to us is made known to management on a timely basis during the period when our reports are being prepared. There were no changes in our internal controls that occurred during the year covered by this report that have materially affected, or are reasonably likely to materially affect, our internal controls. Item 9B. OTHER INFORMATION\nNone\nItem 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III Item 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table presents information with respect to our officers, directors and significant employees as of the date of this Report:\nName\nPosition\nAndrew De Luna\nInterim Chief Executive Officer, Chief Financial Officer, and Vice Chairman\nTeodros Gessesse\nChief Marketing Officer\nDarshan Sedani\nChief Visionary Officer\nK. Bryce Rick Toussaint\nBoard Member\nMann Yam\nPresident and Chairman of the Board\nEach director serves until our next annual meeting of the shareholders unless they resign earlier. The Board of Directors elects officers and their terms of office are at the discretion of the Board of Directors.\nEach of our directors serves until his or her successor is elected and qualified. Each of our officers is elected by the board of directors to a term of one (1) year and serves until his or her successor is duly elected and qualified, or until he or she is removed from office. At the present time, members of the board of directors are not compensated for their services to the board.\nBiographical Information Regarding Officers and Directors\nAndrew De Luna, 48, is our Vice-Chairman of the Board, Interim Chief Executive Officer and Chief Financial Officer. He has been with Frontera since March 2022. He has varied and deep experience in growth and start-up ventures. He has advised for McKinsey, KPMG, and GulfStar Investment Bank and has served as a Financial Director for Miller Electric at Illinois Tool Works, Inc., a Fortune 100 Company. Andrew was also a co-founder of Energy Funders, a financial technology company acquired by Paleo Resources, Inc. in 2019. Mr. De Luna currently serves on the advisory boards of several private and public companies including Principal Solar, Inc., a company with heavy investments in electric vehicle and automotive technologies. He holds a BBA and MBA from the McCombs Business School at the University of Texas at Austin and is an actively licensed Certified Public Accountant in the State of Texas. We believe that Mr. De Lunas extensive background in start-ups qualifies him to be on our board of directors.\nTeodros Gessesse, 59, is our Chief Marketing Officer. He has been with Frontera since July 2022. Prior to joining Frontera, he was the CEO and co-founder of Intellimedia Networks in Virginia, USA. Mr. Gessesse has extensive experience in managing technology businesses for a diverse customer base including Fortune 1000 companies, U.S. government agencies, financial institutions, large universities and global news broadcasting organizations. Focusing on the delivery of content across a variety of networks, he has had over twenty-five years of experience building businesses around highly scalable cloud platforms for mission critical applications that have educated, informed and entertained large scale audiences globally. As the CEO of Intellimedia Networks he specializes in managing the business strategy, developing sales and marketing strategy and the high-level strategy in the development of cloud and mobile platforms that enable training, education, entertainment distribution, virtual communications, global news broadcasting, and virtual and immersive reality solutions. Prior to Intellimedia, Mr. Gessesse managed the enterprise and public cloud streaming services business of VBrick Systems which was a world leader in Internet based video delivery with customers ranging from the U.S. government, large multinational corporations and the top 200 educational\ninstitutions in the U.S. At the beginning of the Internet video delivery boom, he was also involved in Videoshare, a Cambridge Massachusetts based video streaming company which was the first large scale internet-based video sharing company formed by MIT media lab alums in the late 1990s. Diversifying his reach into the technology sector, he also participates and is a board member in a number of firms that provide innovative solutions for global live news delivery, African entertainment, music publishing, white glove ride sharing platforms, virtual and immersive reality for real estate ventures, and healthcare practice training platforms. In an effort to give back Mr. Gessesse volunteers at People to People - a U.S. based non-profit organization of African diaspora consisting of over 6,000 medical professionals that seek to improve global healthcare. In this capacity he directs the organization on the usage of technology to positively impact the delivery of healthcare services in emerging nations. Mr. Gessesse is an alumnus of the University of Alberta majoring in Economics and minoring in computing science.\nDarshan Sedani, 48, is our Chief Visionary Officer and a Board Member. He has been with Frontera since July 2022. He is a technologist and professional entrepreneur with over 24 years of experience as a technology leader and innovator in media-tech, education-tech, and SaaS platforms. Prior to joining Frontera, he was formerly the President and founder of Intellimedia Networks, responsible for leading the companys ideation, planning, and implementation of new and long-term business strategies. His duties include setting and driving overall organizational vision, operations strategy, directly overseeing operations, defining products and solutions blueprints, managing the companys assets and liabilities and making major decisions in the organization. Prior to working with Intellimedia, Mr. Sedani has worked with California-based MonetizeMedia and Koyo Graphics International in an executive/co-founder position to help them grow from start-ups to their eventual successful exits. He was credited by NASA for developing the worlds first media streaming protocol. His project portfolio includes impressive clientele like NASA, Bandai Inc., Citizen, Pioneer, Vodafone, Disney, ESPN, FOX, VBrick, FIFA, Olympics, ICC Cricket world cup, etc. He has been recognized as an industry and tech leader by MicroAge, Economic time, Asian Age and other publications. He is the recipient of Indias prestigious civilian awards like Vivekanada youth entrepreneur of the year and Gujarat-Ratna in India. We believe that Mr. Sedanis extensive background in the technology industry qualifies him to be on our board of directors.\nK. Bryce Rick Toussaint, 51, is a member of our Board of Directors. He has been a board member since March 2022. He is a highly accomplished, results-driven entrepreneur with more than twenty years of business and public accounting experience, including extensive work in providing merger and acquisition consulting such as raising capital (equity and debt), project and corporate finance, private equity due diligence, and accounting systems integration with an emphasis on the energy (renewable, E&P, and midstream), manufacturing, nutraceutical, and technology industries. Mr. Toussaint has the unparalleled ability to turn-around and transform distressed companies into profitable ventures. He clearly envisions and delineates the opportunity in ‘failed companies where others cannot and is an expert at entering a challenging situation and completely revitalizing the company from the ground up. As a highly experienced M&A consultant, Mr. Toussaint has advised more than 20 American and Asian companies in becoming and remaining publicly listed on the NASDAQ, NYSE, and OTC markets from 2006 to present. He has also advised dozens of cross-border merger/acquisitions, PIPE transactions, and joint ventures. Mr. Toussaint has worked in more than seven countries including the United Kingdom, Spain, France, and throughout Asia and Latin America. He received his Bachelors in Accounting and MBA from Louisiana State University. We believe that Mr. Toussaints experience with public accounting qualifies him to be on our board of directors.\nMann C. Yam, 48, is our Chairman of the Board and President. He has been on the board of directors since March 2021. He is an experienced corporate attorney and investor. He earned the J.D. degree from Touro School of Law and Bachelor of Science from Saint Johns University. He is a duly licensed New York attorney. He founded Bernard & Yam, LLP in 2001. Mr. Yam has extensive experience with representing micro-cap and small-cap public companies. Mr. Yam primarily focuses on all legal aspects of representing publicly traded companies, from assisting them with executing and developing their business plans to listing their securities on a national exchange. Mr. Yam advises a number of publicly traded companies on their regulatory filing requirements with the Securities and Exchange Commission and the national exchanges. Mr. Yam also\nfocuses on all aspects of complex commercial litigations and arbitrations involving securities law, corporate trust law, fraud, complex contractual disputes, and other business-related claims. He has counseled and represented individuals and institutional clients in jurisdictions throughout the United States and across a wide array of industries, including financial services, corporate trust, and real estate. We believe that Mr. Yams extensive background in public companies qualifies him to be on our board of directors.\nCommittees of the Board of Directors\nWe do not currently have any committees.\nInvolvement in Legal Proceedings\nWe are not aware of any of our directors or officers being involved in any legal proceedings in the past ten years relating to any matters in bankruptcy, insolvency, criminal proceedings (other than traffic and other minor offenses) or being subject to any of the items set forth under Item 401(f) of Regulation S-K.\nDelinquent Section 16(a) Reports\nOur common stock is not registered pursuant to Section 12 of the Securities Exchange Act of 1934, as amended (the Exchange Act). Accordingly, our executive officers and directors and persons who own more than 10% of a registered class of our equity securities are not subject to the beneficial ownership reporting requirements of Section 16(1) of the Exchange Act. Item 11: EXECUTIVE COMPENSATION\nCompensation of Officers\nThe Gessesse and Sedani Agreements\nIn connection with the Purchase Agreement, the Company entered into employment agreements with Mr. Gessesse and Mr. Sedani dated July 22, 2022 (the Employment Agreements) for an initial term of three (3) years (the Initial Term), commencing on the date of execution of the agreement which will automatically renew thereafter for successive terms of one (1) year each (each, a Renewal Term), unless one of the parties gives written notice of termination to the other party at least sixty (60) days prior to the last day of the Initial Term or the then-current Renewal Term, as applicable.\nBoth Mr. Gessesses and Mr. Sedanis initial annual base salary will be $150,000. Each of Mr. Gessesse and Mr. Sedani will be eligible to receive a quarterly bonus as determined by, and within the sole discretion of, the Companys board of directors (the Board) and Mr. Gessesse and Mr. Sedani were granted 23,500,000 and 31,500,000 shares, respectively, of the Companys common stock valued at $0.25 per share.\nWith respect to 2022 and subsequent calendar years, both Mr. Gessesse and Mr. Sedani will be eligible to receive additional equity incentive award grants of the types, in the amounts and on a basis commensurate with the equity incentive awards granted to similarly-situated executive officers of the Company, as determined from time to time by the Companys Board. Mr. Gessesse and Mr. Sedani will both be eligible to participate in the employee benefits plans generally available to other senior executive officers of the Company.\nIf Mr. Gessesses or Mr. Sedanis employment ceases due to a termination by the Company other than for cause or his resignation with good reason (as such terms are defined in the Employment Agreements), then, subject to his timely execution and non-revocation of a release of claims, he will receive: (i) payment of any otherwise earned but unpaid compensation and benefits through the date of termination; (ii) a lump sum cash payment equal to 12 months of his annual base salary, plus all annual bonuses for the period from the date of termination through the end of the initial term or the then-current renewal term, as applicable; (iii) COBRA premiums until the earliest to occur of the expiration of twelve (12) months following the date of termination, the date he becomes eligible for participation in health and dental plans of another employer, or the date he\nceases to be eligible for participation under the Companys health and dental plans under COBRA; and (iv) accelerated vesting of all the outstanding and otherwise unvested equity awards.\nNo family relationship exists between Mr. Gessesse or Mr. Sedani and any of the Companys directors or executive officers. There are no arrangements or understandings between Mr. Gessesse or Mr. Sedani and any other person pursuant to which Mr. Gessesse or Mr. Sedani was selected as an officer of the Company, nor are there any transactions to which the Company is or was a participant and in which Mr. Gessesse or Mr. Sedani had or will have a direct or indirect material interest subject to disclosure under Item 404(a) of Regulation S-K.\nThe following summary compensation table sets forth information concerning compensation for services rendered in all capacities during 2022 and 2021 awarded to, earned by or paid to our executive officers.\nSummary Compensation Table\n(a) (b) (c) (d) (e) (f) (g) (h) (i) (j)\nName and Principal\nSalary Bonus Stock\nAwards Option\nAwards Non-Equity\nIncentive Plan\nCompensation Change in\nPension Value\n& Non -\nqualified\nDeferred\nCompensation\nEarnings All Other\nCompensation Totals\nPosition [1] Year ($)* ($) ($) ($) (S) ($) ($) ($)\nAndrew De Luna 37,500 0 37,500\nVice-Chairman, Interim CEO, and CFO 0 0\nTeodros Gessesse 37,500 0 37,500\nCMO 0 0\nDarshan Sedani 37,500 0 37,500\nCVO and Board Member 0 0\nK. Bryce Rick Toussaint 0 0\nBoard Member 0 0\nMann Yam 0 0\nPresident, Chairman 0 0\nRetirement, Resignation or Termination Plans\nWe sponsor no plan, whether written or verbal, that would provide compensation or benefits of any type to an executive upon retirement, or any plan that would provide payment for retirement, resignation, or termination as a result of a change in control of our company or as a result of a change in the responsibilities of an executive following a change in control of our company.\nDirectors Compensation\nThe persons who served as members of our board of directors, including executive officers, did not receive any compensation for services as directors for 2022 and 2021.\nOption Exercises and Stock Vested\nNone.\nPension Benefits and Nonqualified Deferred Compensation\nWe do not maintain any qualified retirement plans or non-nonqualified deferred compensation plans for its employees or directors.\nExecutive Officer Outstanding Equity Awards at Fiscal Year-End\nNone. Item 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED SHAREHOLDER MATTERS\nThe following table sets forth certain information regarding beneficial ownership of our Common Stock as of June 30, 2022: (i) by each of our directors, (ii) by each of the Named Executive Officers, (iii) by all of our executive officers and directors as a group, and (iv) by each person or entity known by us to beneficially own more than five percent (5%) of any class of our outstanding shares. As of June 30, 2022 there were 55,563,482 shares of our Common Stock outstanding:\nTitle of Class Name of Beneficial Owners,\nDirectors and Officers: Amount and\nNature of Beneficial\nOwnership Percentage of\nBeneficial Ownership\n%\nCommon (1) Mann Yam 18,750,000 24.2%\nBin Zhou 18,750,000 24.2%\nTotal\n37,500,000 48.4%\n(1) Applicable percentage of ownership is based on 77,396,815 shares of Common Stock outstanding on September 19, 2022. Percentage ownership is determined based on shares owned together with securities exercisable or convertible into shares of Common Stock within 60 days of September 19, 2022, for each shareholder. Beneficial ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities.  Shares of Common Stock subject to securities exercisable or convertible into shares of Common Stock that are currently exercisable or exercisable within 60 days of September 19, 2022, are deemed to be beneficially owned by the person holding such securities for the purpose of computing the percentage of ownership of such person but are not treated as outstanding for the purpose of computing the percentage ownership of any other person. Common Stockholders are entitled to 1 voting right per share.\nAs of September 19, 2022, there were 77,396,815 shares of Common Stock issued and outstanding. Item 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nDirector Independence\nUnder NASDAQ rule 4200(a)(15), a director is not considered to be independent if he or she is also an executive officer or employee of the corporation.\nOur Vice-Chairman, Andrew De Luna, is also our Interim Chief Executive Officer and Chief Financial Officer and our Director, Darshan Sedani, is also our Chief Visionary Officer. Item 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nYear ended Year ended\nJune 30, 2022 June 30, 2021\nAudit fees $ 13,500 $ 20,000\nAudit - related fees - -\nTax fees - -\nAll other fees - -\nPART IV Item 15. EXHIBITS\nEXHIBIT\nNUMBER\nDESCRIPTION\n3.1\nArticles of Incorporation. Incorporated by reference to the Companys Registration Statement on Form S-1 filed with the SEC on September 3, 2014.\n3.2\nBylaws. Incorporated by reference to the Companys Registration Statement on Form S-1 filed with the SEC on September 3, 2014.\n4.2\nSubscription Agreement. Incorporated by reference to the Companys Registration Statement on Form S-1 filed with the SEC on September 3, 2014.\n10.1*\nExecutive Employment Agreement between Frontera Group, Inc. and Darshan Sedani dated July 22, 2022.\n10.2*\nExecutive Employment Agreement between Frontera Group, Inc. and Teodros Gessesse dated July 22, 2022.\n10.3*\nConsulting Agreement between Frontera Group, Inc. and Stephen Steen.\n10.4*\nConsulting Agreement between Frontera Group, Inc. and Long Side Ventures.\n23.1*\nConsent of Victor Mokuolu, CPA PLLC\n31.1*\nCertification of the Interim Chief Executive Officer and Chief Financial Officer pursuant to Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1*\nCertification of the Interim Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nXBRL Instance Document **\n101.SCH\nXBRL Taxonomy Extension Schema Document **\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document **\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document **\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document **\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document **\n* Filed herewith.\n** XBRL (Extensible Business Reporting Language) information is furnished and not filed or a part of a registration statement or prospectus for purposes of Sections 11 or 12 of the Securities Act of 1933, as amended, is deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, and otherwise is not subject to liability under these sections.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nFrontera Group Inc\n/s/ Mann Yam\nMann Yam\nChairman of the Board\n/s/ Andrew De Luna\nAndrew De Luna\nVice-Chairman of the Board, Interim Chief Executive Officer and Chief Financial Officer\n/s/ Darshan Sedani\nDarshan Sedani\nChief Visionary Officer and Board Member\n/s/ K. Bryce Rick Toussaint\nK. Bryce Rick Toussaint\nBoard Member\nOctober 5, 2022"
}