{
    "cik": "1605331",
    "company": "AB INTERNATIONAL GROUP CORP.",
    "filing_type": "10-K",
    "filing_date": "2023-11-29",
    "period_of_report": "2023-08-31",
    "sic": "6794",
    "state_of_inc": "NV",
    "state_location": "NY",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1605331/0001663577-23-000552-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1605331/000166357723000552/abqq10k_083123.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1605331/0001663577-23-000552.txt",
    "filename": "1605331_10K_2023_0001663577-23-000552.htm",
    "content": "Item 1. Business\nCompany Overview\nThe Company was incorporated under the laws of the State of Nevada on July 29, 2013. The Company's fiscal year end is August 31.\nWe are an intellectual property (IP) and movie investment and licensing firm, focused on acquisitions and development of various intellectual property, including the acquisition and distribution of movies. On June 1, 2017 we acquired a patent license to a video synthesis and release system for mobile communications equipment, in which the technology is the subject of a utility model patent in the People's Republic of China. Our License to the Technology generates revenue through sub-license monthly fees from a smartphone app on Android devices. This smartphone app was already existing and licensed at the time we acquired the Technology of video synthesis. In January, 2021, our sublicensing agreement with Licensee to generate revenues was terminated. As such, there has been no revenues generated from sub-licensing the Technology since the end of December, 2020. On February 2019, we launched a business application (Ai Bian Quan Qiu) through smartphones and official social media accounts utilizing Artificial Intelligence. It is a matching platform for performers, advertiser merchants, and owners for more efficient services. We previously generated revenues through an agency service fee from each matched performance. Due to the quarantine and continuous control imposed by the state and local governments in areas affected by COVID-19, merchant advertising events have been suspended for 7 months. The Company decided to suspend the Ai Bian Quan Qiu platform, which, at the time, created an adverse impact on the business and financial condition and hampered its ability to generate revenue and access sources of liquidity on reasonable terms. As a result, we decided to focus mainly the IP transactions and online video streaming.\nOn April 22, 2020, the Company announced the first phase development of its video streaming service. The online service will be marketed and distributed in the world under the brand name ABQQ.tv. The Company's professional team are sourcing such dramas and films to provide video streaming service on the ABQQ.tv. The video streaming website www.ABQQ.tv was officially launched on December 29, 2020. As of August 31, 2023, the Company acquired 68 movie broadcast rights and a 20-episode TV drama series. The Company will continue marketing and promoting the ABQQ.tv website through Google Ads and acquire additional broadcast rights for movies and TV series, and plan to charge subscription fees once the Company has obtained at least 200 broadcast rights of movie and TV series.\nOn October 21, 2021, the Company entered into a Lease Agreement (the Lease) with Martabano Realty Corp. (the Landlord), pursuant to which the Company agreed to lease approximately 8,375 square feet of in what is known as the Mt. Kisco Theatre at 144 Main Street, Mount Kisco, New York. The term of the Lease is five years plus free rent period. Commencing in month four, the Company's monthly base rent obligation will be approximately $6,979, which amount will increase in year three to $13,260, year four at $13,658 and the final year at $14,067 in accordance with the terms of the Lease. The Lease contains customary provisions for real property leases of this type, including provisions allowing the Landlord to terminate the Lease upon a default by the Company.\nThe space was formerly used as a theatre with a total of 5 screens and 466 sets for screening films. The former theatre opened on December 21, 1962 with Hayley Millsin In Search of the Castaways. It was a replacement for the towns other movie theatre that burned down. It was later twinned and further divided into 5 screens. It was operated for years by Lesser Theaters, then bought by Clearview Cinemas. In June, 2013 it was taken over by Bow-Tie Cinemas when they took most Clearview locations. It lasted until March, 2020 when it was closed by the Covid-19 pandemic. It was announced in September 2020 that the closure would be permanent.\nOn May 5, 2022, the Company incorporated AB Cinemas NY, Inc. in New York, NY, for the purpose of operating Mt. Kisco Theatre located in Mount Kisco, NY. The theatre started operations in October 2022. After a rough two years for movie theatres due to the pandemic, movie theaters are starting to show signs of life again. The Company is intending to shift the business strategy from online only to the combination of online and offline business. The Company expects to generate considerable revenue from its movie theater business line in the following years.\nOn April 27, 2022, the Company purchased a unique Non-Fungible Token (NFT) movie and music marketplace, named as the NFT MMM from Stareastnet Portal Limited, an unrelated party, which including an APP NFTMMM on Google Play, and full right to the website: stareastnet.io. NFTs are digital assets with a unique identifier that is stored on a blockchain, and NFTs are tradable rights of digital assets (pictures, music, films, and virtual creations) where ownership is recorded in blockchain smart contracts. On August 6, 2022, the Company licensed NFT MMM platform to a third party to allow the access of NFTMM platform and platform data on both app and website for one year starting from August 20, 2022 to August 19, 2023 for a monthly license fee of $60,000. Pursuant to the agreement, the Company also charged one time implementation service and consulting fee of $100,000. The Company retained the ownership and copyright of the NFT MMM platform, including the APP NFT MMM on Google Play, and the website: stareastnet.io.\nCOVID-19\nThe full extent of the impact of the COVID-19 pandemic on our business, operations and financial results will depend on numerous evolving factors that we may not be able to accurately predict at the present time. In an effort to contain COVID-19 or slow its spread, governments around the world have enacted various measures, including orders to close all businesses not deemed essential, isolate residents to their homes or places of residence, and practice social distancing when engaging in essential activities. The movie industry in general has changed dramatically as a result of the pandemic restrictions. While movie theaters struggle to stay alive, online streaming programming has increased. We have endeavored to stay with the trend for streaming services to remain competitive. We have experienced the negative impact in our results of operations and in our financial condition for the year ended August, 2020, especially with respect to the movie distribution end of our business. These impacts concern delays in delivering our movies and IP because of health restrictions imposed on certain public events that concern our business, including, among other things, theaters, indoor and outdoor performances, filming restrictions, music festivals, concerts and other such events, Some of these restrictions include pandemic government mandated shutdowns and others restrictions on capacity gathered at these events, with some jurisdictions imposing fines or revocation of business licensing, and other restrictions. As a result of these factors, our revenue was reduced from March to May of 2020. With immediate closures, the resultant industry and business specific delays have negatively affected our company.\nDuring the COVID-19 pandemic, movie theatres have been subject to various governmental orders requiring theatres to take or refrain from certain activities including, but not limited to, suspending operations, reduction in seating capacities, enforcement of social distancing, establishment of enhanced cleaning protocols, restrictions on food and beverage sales, tracking the identity of guests, employee protection protocols, and limitation on operating hours. Although the orders have been modified frequently, we believe our theatre has maintained material compliance with such orders. We currently cannot predict when or if COVID-19 related governmental orders will be fully terminated and whether similar orders will be utilized more frequently during future public health outbreaks.\nSpecific to our company operations, during the pandemic period, we have enacted precautionary measures to protect the health and safety of our employees and partners. These measures include closing our office, having employees work from home, and eliminating all travel. While having employees work from home may have a negative impact on efficiency and may result in negligible increases in costs, it does have an impact on our ability to execute on our agreements to deliver our core products.\nWe will continue to actively monitor the situation and may take further actions that alter our business operations as may be required by federal, state, local or foreign authorities, or that we determine are in the best interests of our employees, customers, partners and stockholders. It is not clear what the potential effects any such alterations or modifications may have on our business, including the effects on our customers, partners, or vendors, or on our financial results.\nCompetition\nFor our movie theatre business, due to relaxing government restrictions, many movies which were delayed due to COVID-19 are expected to be released in the upcoming years, and the movie theater business is starting to show signs of life again. Our theatre is subject to varying degrees of competition in the geographic areas in which it operates. Competition is often intense with respect to attracting patrons, licensing motion pictures and finding new theatre locations. Our online platform ABQQ.tv has not yet generated any revenue, whereas the major competitors in this field, including Netflix, Amazon and Apple, have far superior resources and brand notoriety. We are hoping to capture some market share through pricing, unique media offerings, and marketing campaigns when funds are available. We cannot assure you that we will be successful in these endeavors.\nFor the NFT business, the company recently licensed the software to a third party for a fee and does not yet have any competitors in the market.\nGovernment Regulation\nOur theatres in the United States must comply with Title III of the Americans with Disabilities Act, or ADA. Compliance with the ADA requires that public accommodations, including websites and mobile apps for such accommodations, be accessible to individuals with disabilities and that new construction or alterations are made to conform to accessibility guidelines. Non-compliance with the ADA could result in the imposition of injunctive relief, fines, and awards of damages to private litigants and additional capital expenditures to remedy such noncompliance. As an employer covered by the ADA, we must make reasonable accommodations to the limitations of employees and qualified applicants with disabilities, provided that such reasonable accommodations do not pose an undue hardship on the operation of our business. In addition, many of our employees are covered by various government employment regulations, including minimum wage, overtime and working conditions regulations. In Europe, all territories have similar national regulations relating to disabilities.\nOur operations also are subject to federal, state and local laws regulating such matters as construction, renovation and operation of theatres as well as wages and working conditions, citizenship, health and sanitation requirements, consumer and employee privacy rights, and licensing, including alcoholic beverage sales. We believe our theatres are in material compliance with such requirements.\nDuring the COVID-19 pandemic, our theatres have been subject to various governmental orders requiring us to take or refrain from certain activities including, but not limited to, suspending operations, reduction in seating capacities, enforcement of social distancing, establishment of enhanced cleaning protocols, restrictions on food and beverage sales, tracking the identity of guests, employee protection protocols, and limitation on operating hours. Although the orders have been modified frequently and the restrictions have recently relaxed, we believe our theatres have maintained material compliance with such orders. With adaptations in the virus, we currently cannot predict when or if COVID-19 related governmental orders will be fully terminated and whether similar orders will be utilized more frequently during future public health outbreaks. Any response that would result in a shutdown of or other restrictions on our theatre would be determinantal and we could go out of business.\nEmployees\nWe currently have 9 employees. Item 1A. Risk Factors\nThe following risk factors could materially affect our business, financial condition, and results of operations. These risk factors and other information in this Annual Report on Form 10-K should be carefully considered in evaluating our business. They are provided for investors as permitted by the Private Securities Litigation Reform Act of 1995. It is not possible to identify or predict all such factors and, therefore, the following should not be considered to be a complete statement of all the uncertainties we face.\nOperational Risks\nAB Cinemas theatres\nrisks relating to motion picture production and theatrical performance;\nour lack of control over distributors of films;\nintense competition in the geographic areas in which we operate among exhibitors or from other forms of entertainment;\nincreased use of alternative film delivery methods including premium video on demand or other forms of entertainment;\nshrinking exclusive theatrical release windows or release of movies to theatrical exhibition and streaming platforms on the same date;\nAB Cinemas may not meet anticipated revenue projections, which could result in a negative impact upon operating results;\nfailures, unavailability or security breaches of our information systems;\ndependence on key personnel for current and future performance and our ability to attract and retain senior executives and other key personnel, including in connection with any future acquisitions;\nour ability to achieve expected synergies, benefits and performance from our strategic theatre acquisitions and strategic initiatives;\nthe risk of severe weather events or other events caused by climate change disrupting or limiting operations;\nsupply chain disruptions and labor shortages may negatively impact our operating results; and\noptimizing our theatre circuit through new construction and the transformation of our existing theatres may be subject to delay and unanticipated costs.\nNFT MMM license business\nThe licensee(s) inability to pay license fees to the company for any reason, because they are first time running such business.\nRegulatory Risks\nAB Cinemas theatres\ngeneral and international economic, political, regulatory, social and financial market conditions, economic unrest, terrorism, hostilities, cyber-attacks, war, widespread health emergencies, such as COVID-19 or other pandemics, and other geopolitical risks;\nreview by antitrust authorities in connection with acquisition opportunities;\nrisks relating to the incurrence of legal liability, including costs associated with ongoing securities class action lawsuits;\nincreased costs in order to comply or resulting from a failure to comply with governmental regulation, including the General Data Protection Regulation (GDPR), the California Consumer Privacy Act (CCPA) and pending future domestic privacy laws and regulations;\ngeopolitical events, including the threat of terrorism or cyber-attacks, or widespread health emergencies, such as the novel coronavirus or other pandemics or epidemics, causing people to avoid our theatres or other public places where large crowds are in attendance; and\nother risks referenced from time to time in filings with the SEC.\nRisks Related to Macroeconomics, COVID-19 Restrictions and Other Conditions\nOur operations and performance depend significantly on global and regional economic conditions and adverse economic conditions can materially adversely affect our business, results of operations and financial condition.\nAdverse macroeconomic conditions, including slow growth or recession, high unemployment, inflation, tighter credit, higher interest rates, and currency fluctuations, can adversely impact consumer confidence and spending and materially adversely affect demand for our theater, products and services. In addition, consumer confidence and spending can be materially adversely affected in response to changes in fiscal and monetary policy, financial market volatility, declines in income or asset values, and other economic factors.\nIn addition to an adverse impact on demand for our theater, products and services, uncertainty about, or a decline in, global or regional economic conditions can have a significant impact on our suppliers, contract manufacturers, logistics providers, distributors, and other channel partners, and developers. Potential outcomes include financial instability; inability to obtain credit to finance business operations; and insolvency.\nAdverse economic conditions can also lead to increased credit and collectability risk on our trade receivables; the failure of derivative counterparties and other financial institutions; limitations on our ability to issue new debt; reduced liquidity; and declines in the fair values of our financial instruments. These and other impacts can materially adversely affect our business, results of operations, financial condition and stock price.\nOur business can be impacted by political events, trade and other disputes, war, terrorism, natural disasters, public health issues, riots, accidents, and other business interruptions.\nPolitical events, trade and other international disputes, war, terrorism, natural disasters, public health issues (such as COVID-19), riots, accidents and other business interruptions can harm or disrupt international commerce and the global economy and could have a material adverse effect on us and our customers, licensees, suppliers, distributors, and other channel partners.\nOur theater is in a location that is prone to political events and unrest, accidents and other factors that may affect our financial condition. In addition, our operations are subject to the risk of interruption by fire, power shortages, nuclear power plant accidents and other industrial accidents, terrorist attacks and other hostile acts, ransomware and other cybersecurity attacks, labor disputes, public health issues, including pandemics such as the COVID-19 pandemic, and other events beyond our control. Global climate change is resulting in certain types of natural disasters, such as droughts, floods, hurricanes and wildfires, occurring more frequently or with more intense effects. Such events can make it difficult or impossible for us to maintain operations with our customers, create delays and inefficiencies in our supply and manufacturing chain, and result in slowdowns and outages to our product and service offerings, and negatively impact consumer spending and demand in affected areas. Following an interruption to our business, we can require substantial recovery time, experience significant expenditures to resume operations, and lose significant sales.\nOur operations are also subject to the risks of accidents that may occur on our premises. Despite safety measures, accidents could occur and could result in serious injuries or loss of life, disruption to our business, and harm to our reputation. Major public health issues, including pandemics such as the COVID-19 pandemic, have adversely affected, and could in the future materially adversely affect, us due to their impact on the global economy and demand for consumer products; the imposition of protective public safety measures, such as shutdowns and restrictive mandates; and disruptions in our operations, supply chain and sales and distribution channels, resulting in interruptions to our theater and the supply of current products and offering of existing services, and delays in production ramps of new products and development of new services.\nRisks Related to Our Financial Condition\nBecause we have a limited operating history, you may not be able to accurately evaluate our operations.\nWe have had limited operations to date and have generated limited revenues. Therefore, we have a limited operating history upon which to evaluate the merits of investing in our company. Potential investors should be aware of the difficulties normally encountered by new companies and the high rate of failure of such enterprises. The likelihood of success must be considered in light of the problems, expenses, difficulties, complications and delays encountered in connection with the operations that we plan to undertake. These potential problems include, but are not limited to, unanticipated problems relating to the ability to generate sufficient cash flow to operate our business, and additional costs and expenses that may exceed current estimates. We expect to incur significant losses into the foreseeable future. We recognize that if the effectiveness of our business plan is not forthcoming, we will not be able to continue business operations. There is no history upon which to base any assumption as to the likelihood that we will prove successful, and it is doubtful that we will continue to generate operating revenues or ever achieve profitable operations. If we are unsuccessful in addressing these risks, our business will most likely fail.\nWe are dependent on outside financing for continuation of our operations.\nBecause we have generated limited revenues and currently operate at a loss, we are completely dependent on the continued availability of financing in order to continue our business. There can be no assurance that financing sufficient to enable us to continue our operations will be available to us in the future.\nRisks Related to Legal Uncertainty\nCompliance with changing regulation of corporate governance and public disclosure may result in additional expenses.\nChanging laws, regulations and standards relating to corporate governance and public disclosure, including the Sarbanes-Oxley Act of 2002 and new SEC regulations, are creating uncertainty for companies such as ours. These new or changed laws, regulations and standards are subject to varying interpretations in many cases due to their lack of specificity, and as a result, their application in practice may evolve over time as new guidance is provided by regulatory and governing bodies, which could result in continuing uncertainty regarding compliance matters and higher costs necessitated by ongoing revisions to disclosure and governance practices. We are committed to maintaining high standards of corporate governance and public disclosure. As a result, we intend to invest resources to comply with evolving laws, regulations and standards, and this investment may result in increased general and administrative expenses and a diversion of management time and attention from revenue-generating activities to compliance activities. If our efforts to comply with new or changed laws, regulations and standards differ from the activities intended by regulatory or governing bodies due to ambiguities related to practice, our reputation may be harmed.\nIf we fail to comply with the new rules under the Sarbanes-Oxley Act related to accounting controls and procedures, or if material weaknesses or other deficiencies are discovered in our internal accounting procedures, our stock price could decline significantly.\nWe are exposed to potential risks from legislation requiring companies to evaluate internal controls under Section 404(a) of the Sarbanes-Oxley Act of 2002. As a smaller reporting company we will be exempt from auditor attestation requirements concerning any such report so long as we are a smaller reporting company. We have not yet evaluated whether our internal control procedures are effective and therefore there is a greater likelihood of material weaknesses in our internal controls, which could lead to misstatements or omissions in our reported financial statements as compared to issuers that have conducted such evaluations.\nIf material weaknesses and deficiencies are detected, it could cause investors to lose confidence in our company and result in a decline in our stock price and consequently affect our financial condition. In addition, if we fail to achieve and maintain the adequacy of our internal controls, we may not be able to ensure that we can conclude on an ongoing basis that we have effective internal controls over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act. Moreover, effective internal controls, particularly those related to revenue recognition, are necessary for us to produce reliable financial reports and are important to helping prevent financial fraud. If we cannot provide reliable financial reports or prevent fraud, our business and operating results could be harmed, investors could lose confidence in our reported financial information, and the trading price of our common stock could drop significantly. In addition, we cannot be certain that additional material weaknesses or significant deficiencies in our internal controls will not be discovered in the future.\nRisks Associated with Management and Control Persons\nIf we fail to attract and retain qualified senior executive and key technical personnel, our business will not be able to expand.\nWe are dependent on the continued availability of Chiyuan Deng, and the availability of new employees to implement our business plans. The market for skilled employees is highly competitive, especially for employees in the service industry. Although we expect that our compensation programs will be intended to attract and retain the employees required for us to be successful, there can be no assurance that we will be able to retain the services of all our key employees or a sufficient number to execute our plans, nor can there be any assurance we will be able to continue to attract new employees as required.\nOur personnel may voluntarily terminate their relationship with us at any time, and competition for qualified personnel is intense. The process of locating additional personnel with the combination of skills and attributes required to carry out our strategy could be lengthy, costly and disruptive.\nIf we lose the services of key personnel, or fail to replace the services of key personnel who depart, we could experience a severe negative effect on our financial results and stock price. In addition, there is intense competition for highly qualified bilingual and people friendly personnel in the locations where we principally operate. The loss of the services of any key personnel, marketing or other personnel or our failure to attract, integrate, motivate and retain additional key employees could have a material adverse effect on our business, operating and financial results and stock price.\nMr. Deng owns a significant percentage of the voting power of our stock and will be able to exercise significant influence over the composition of our Board of Directors, matters subject to stockholder approval and our operations.\nAs of the date of this filing, Chiyuan Deng owns 100,000 shares of our Series A Preferred Stock, which has the voting power of 51% of the total vote of shareholders. As a result of his equity ownership interest, voting power and the contractual rights described above, Mr. Deng currently is in a position to influence, subject to our organizational documents and Nevada law, the composition of our Board of Directors and the outcome of corporate actions requiring stockholder approval, such as mergers, business combinations and dispositions of assets, among other corporate transactions. In addition, this concentration of voting power could discourage others from initiating a potential merger, takeover or other change of control transaction that may otherwise be beneficial to us, which could adversely affect the market price of our securities.\nRisks Related to Our Securities and the Over the Counter Market\nIf a market for our common stock does not develop, shareholders may be unable to sell their shares.\nOur common stock is quoted under the symbol ABQQ on the OTCPink operated by OTC Markets Group, Inc, an electronic inter-dealer quotation medium for equity securities. We do not currently have an active trading market. There can be no assurance that an active and liquid trading market will develop or, if developed, that it will be sustained.\nOur securities are very thinly traded. Accordingly, it may be difficult to sell shares of our common stock without significantly depressing the value of the stock. Unless we are successful in developing continued investor interest in our stock, sales of our stock could continue to result in major fluctuations in the price of the stock.\nOur common stock price may be volatile and could fluctuate widely in price, which could result in substantial losses for investors.\nThe market price of our common stock is likely to be highly volatile and could fluctuate widely in price in response to various factors, many of which are beyond our control, including:\n§ technological innovations or new products and services by us or our competitors;\n§ government regulation of our products and services;\n§ the establishment of partnerships with other technology companies;\n§ intellectual property disputes;\n§ additions or departures of key personnel;\n§ sales of our common stock;\n§ our ability to integrate operations, technology, products and services;\n§ our ability to execute our business plan;\n§ operating results below expectations;\n§ loss of any strategic relationship;\n§ industry developments;\n§ economic and other external factors; and\n§ period to period fluctuations in our financial results.\nBecause we have nominal revenues to date, you should consider any one of these factors to be material. Our stock price may fluctuate widely as a result of any of the above.\nIn addition, the securities markets have from time to time experienced significant price and volume fluctuations that are unrelated to the operating performance of particular companies. These market fluctuations may also materially and adversely affect the market price of our common stock.\nAs a new investor, you will experience substantial dilution as a result of future equity issuances.\nIn the event we are required to raise additional capital we may do so by selling additional shares of common stock thereby diluting the shares and ownership interests of existing shareholders.\nOur stock is a penny stock. Trading of our stock may be restricted by the SECs penny stock regulations and FINRAs sales practice requirements, which may limit a stockholders ability to buy and sell our stock.\nOur stock is a penny stock. The Securities and Exchange Commission has adopted Rule 15g-9 which generally defines penny stock to be any equity security that has a market price (as defined) less than $5.00 per share or an exercise price of less than $5.00 per share, subject to certain exceptions. Our securities are covered by the penny stock rules, which impose additional sales practice requirements on broker-dealers who sell to persons other than established customers and accredited investors. The term accredited investor refers generally to institutions with assets in excess of $5,000,000 or individuals with a net worth in excess of $1,000,000 or annual income exceeding $200,000 or $300,000 jointly with their spouse. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document in a form prepared by the SEC which provides information about penny stocks and the nature and level of risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction and monthly account statements showing the market value of each penny stock held in the customers account. The bid and offer quotations, and the broker-dealer and salesperson compensation information, must be given to the customer orally or in writing prior to effecting the transaction and must be given to the customer in writing before or with the customers confirmation. In addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from these rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written agreement to the transaction. These disclosure requirements may have the effect of reducing the level of trading activity in the secondary market for the stock that is subject to these penny stock rules. Consequently, these penny stock rules may affect the ability of broker-dealers to trade our securities. We believe that the penny stock rules discourage investor interest in, and limit the marketability of, our common stock.\nIn addition to the penny stock rules promulgated by the Securities and Exchange Commission, the Financial Industry Regulatory Authority has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, the Financial Industry Regulatory Authority believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. The Financial Industry Regulatory Authority requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock.\nRule 144 sales in the future may have a depressive effect on our stock price as an increase in supply of shares for sale, with no corresponding increase in demand will cause prices to fall.\nAll of the outstanding shares of common stock held by the present officers, directors, and affiliate stockholders are restricted securities within the meaning of Rule 144 under the Securities Act of 1933, as amended. As restricted shares, these shares may be resold only pursuant to an effective registration statement or under the requirements of Rule 144 or other applicable exemptions from registration under the Act and as required under applicable state securities laws. Rule 144 provides in essence that a person who is an affiliate or officer or director who has held restricted securities for six months may, under certain conditions, sell every three months, in brokerage transactions, a number of shares that does not exceed the greater of 1.0% of a companys outstanding common stock. There is no limit on the amount of restricted securities that may be sold by a non-affiliate after the owner has held the restricted securities for a period of six months if the company is a current reporting company under the 1934 Act. A sale under Rule 144 or under any other exemption from the Act, if available, or pursuant to subsequent registration of shares of common stock of present stockholders, may have a depressive effect upon the price of the common stock in any market that may develop.\nFINRA sales practice requirements may also limit a stockholders ability to buy and sell our stock.\nIn addition to the penny stock rules described above, the Financial Industry Regulatory Authority (FINRA) has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nWe do not intend to pay dividends.\nWe do not anticipate paying cash dividends on our common stock in the foreseeable future. We may not have sufficient funds to legally pay dividends. Even if funds are legally available to pay dividends, we may nevertheless decide in our sole discretion not to pay dividends. The declaration, payment and amount of any future dividends will be made at the discretion of the board of directors, and will depend upon, among other things, the results of our operations, cash flows and financial condition, operating and capital requirements, and other factors our board of directors may consider relevant. There is no assurance that we will pay any dividends in the future, and, if dividends are rapid, there is no assurance with respect to the amount of any such dividend.\nWe have the right to issue additional common stock and preferred stock without consent of shareholders. This would have the effect of diluting investors ownership and could decrease the value of their investment\nWe are authorized to issue up to 10,000,000,000 shares of common stock, of which there were 2,567,226,432 shares issued and outstanding as of November 28, 2023. In addition, our articles of incorporation authorizes the issuance of up to 10,000,000 shares of preferred stock, the rights, preferences, designations and limitations of which may be set by the Board of Directors. We have designated and authorized, 100,000 shares of Series A Preferred Stock. As of November 28, 2023, there were issued and outstanding 100,000 shares of our Series A Preferred Stock, 20,000 shares of our Series B Preferred Stock and no shares of our Series C Preferred Stock or Series D Preferred Stock.\nWith respect to designations of preferred stock that have no outstanding shares, we may withdraw these designations as determined by our board of directors.\nWe have designated four series of preferred stock, two of which we have shares issued and outstanding in Series A Preferred Stock and Series B Preferred Stock. The shares of authorized but undesignated preferred stock may be issued upon filing of an amended certificate of incorporation and the payment of required fees; no further shareholder action is required. If issued, the rights, preferences, designations and limitations of such preferred stock would be set by our Board and could operate to the disadvantage of the outstanding common stock. Such terms could include, among others, preferential voting, conversion rights, and preferences as to dividends and distributions on liquidation. Item 1B. Unresolved Staff Comments\nThis information is not required for smaller reporting companies. Item 2. Properties\nWe do not own any real estate or other properties. The Company leased certain office space in Hong Kong from Zestv Studios Limited, a Hong Kong entity 100% owned by the Chief Executive Officer Chiyuan Deng, under operating lease for three years from May 1, 2019 to April 30, 2022 with annual rental of $66,048 (HKD 516,000). On May 1, 2022, the Company signed a new operating lease agreement with Zestv Studios Limited to lease its Hong Kong office premise for two years from May 1, 2022 to April 2024 with annual rental of $66,048 (HKD 516,000). The lease was early terminated as of August 31, 2023.\nThe Company also leased an office space in Singapore under operating lease from April 13, 2021 to March 31, 2022 with monthly rental of $716 (SGD 974), and an office space at 48 Wall Street, New York, under operating lease for one year from September 1, 2021 to August 31, 2022 with annual rental of $20,400. The Company has renewed the lease of its New York office space for one year from September 1, 2022 to August 31, 2023 with renewed annual rental of $22,440. The lease was not renewed subsequent to the year ended August 31, 2023.\nOn October 21, 2021, the Company signed a lease agreement to lease the Mt. Kisco Theatre, a movie theater, for five years plus the free rent period which commences four months from the lease commencement date. The theatre consists of approximately 8,375 square feet, and the total monthly rent is $14,366 for the first two years, including real estate related taxes and landlords insurance.\nTotal lease expense for the years ended August 31, 2023 and 2022 was $291,319 and $289,411, respectively. All leases are on a fixed payment basis. The Companys lease agreements do not contain any material residual value guarantees or material restrictive covenants. Item 3. Legal Proceedings\nWe are not a party to any pending legal proceeding. We are not aware of any pending legal proceeding to which any of our officers, directors, or any beneficial holders of 5% or more of our voting securities are adverse to us or have a material interest adverse to us. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity and Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock is quoted under the symbol ABQQ on the OTC Pink operated by OTC Markets Group, Inc.\nThere is currently no active trading market for our securities. There is no assurance that a regular trading market will develop, or if developed, that it will be sustained. Therefore, a shareholder may be unable to resell his securities in our company.\nPenny Stock\nThe Securities Exchange Commission has adopted rules that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a price of less than $5.00, other than securities registered on certain national securities exchanges or quoted on the NASDAQ system, provided that current price and volume information with respect to transactions in such securities is provided by the exchange or system. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock, to deliver a standardized risk disclosure document prepared by the Commission, that: (a) contains a description of the nature and level of risk in the market for penny stocks in both public offerings and secondary trading;(b) contains a description of the broker's or dealer's duties to the customer and of the rights and remedies available to the customer with respect to a violation to such duties or other requirements of Securities' laws; (c) contains a brief, clear, narrative description of a dealer market, including bid and ask prices for penny stocks and the significance of the spread between the bid and ask price;(d) contains a toll-free telephone number for inquiries on disciplinary actions;(e) defines significant terms in the disclosure document or in the conduct of trading in penny stocks; and;(f) contains such other information and is in such form, including language, type, size and format, as the Commission shall require by rule or regulation.\nThe broker-dealer also must provide, prior to effecting any transaction in a penny stock, the customer with; (a) bid and offer quotations for the penny stock;(b) the compensation of the broker-dealer and its salesperson in the transaction;(c) the number of shares to which such bid and ask prices apply, or other comparable information relating to the depth and liquidity of the market for such stock; and (d) a monthly account statements showing the market value of each penny stock held in the customer's account.\nIn addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from those rules; the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchaser's written acknowledgment of the receipt of a risk disclosure statement, a written agreement to transactions involving penny stocks, and a signed and dated copy of a written suitability statement.\nThese disclosure requirements may have the effect of reducing the trading activity in the secondary market for our stock if it becomes subject to these penny stock rules. Therefore, because our common stock is subject to the penny stock rules, stockholders may have difficulty selling those securities.\nHolders of Our Common Stock\nAs of November 28, 2023, we had 2,567,226,432 shares of our common stock issued and outstanding, held by approximately 544 shareholders of record, with others holding shares in street name.\nDividends\nWe have never paid cash dividends on our common stock and do not anticipate paying cash dividends in the foreseeable future. The payment of cash dividends on our common stock will depend on earnings, financial condition and other business and economic factors at such time as the board of directors may consider relevant. If we do not pay cash dividends, our common stock may be less valuable because a return on your investment will only occur if its stock price appreciates.\nSecurities Authorized for Issuance under Equity Compensation Plans\nWe have no equity compensation plans.\nUnregistered Sales of Equity Securities\nThe Company had the following equity activities during the year ended August 31, 2023:\nCommon shares\nIncreasing authorized number of common shares\nOn October 11, 2022, the Company filed amendment to Articles of Incorporation to increase the authorized number of common shares from 1,000,000,000 shares to 10,000,000,000 shares. This increasing of authorized number of common shares has been retroactively reflected in the consolidated financial statements and notes thereto.\nReverse Split\nOn June 12, 2023, the Board of Directors approved a reverse split for the Companys issued and outstanding common stock, at a ratio of 1 share for every 10,000 shares, contingent upon receiving a market effectiveness date from FINRA.\nOn September 8, 2023, however, the Board of Directors decided to cancel the company's upcoming 10,000 to 1 reverse split. The Board of Directors decided it would not be in the best interest of the shareholders or the Company to execute a reverse split at this time. The Company informed FINRA that it will not be moving forward with the reverse split withdrew its application.\nConversion of Series C preferred shares to common shares\nDuring the year ended August 31, 2023, the Company issued total 700,770,802 common shares as the result of the conversion of total 250,268 Series C preferred shares.\nSubscription of common shares\nPursuant to the common stock purchase agreement signed with Alumni Capital LP on August 2, 2022, for the year ended August 31, 2023, Alumni Capital LP subscribed total of 200,000,000 common shares for total proceeds of $146,475. The agreement expired on December 31, 2022.\nPreferred shares\nOn September 6, 2022, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 90,275 shares of Series C Convertible Preferred Stock of the Company for a gross proceed of $78,500. After deduction of transaction-related expenses, net proceed to the Company was $69,000. The Company intends to use the proceeds from the Preferred Stock for general working capital purposes.\nOn June 21, 2023, 1,436 shares of Series C Convertible Preferred Stock of the Company were waived by the accredited investor.\nThe Company recorded dividend expenses of $31,387 and $36,952 on Series C and D Preferred shares for the year ended August 31, 2023 and 2022, respectively.\nThe Company had the following equity activities during the year ended August 31, 2022:\nCommon shares\nThe Company issued 2,500,000 and 3,000,000 shares of put shares to Peak One for cash at $0.02288, and $0.02719, respectively, per share during Q1 2022.\nThe Company issued 1,800,000 shares of common stock for cash at $0.01548 per share, and 3,000,000 shares of common stock for cash at $0.01716 per share, and 2,300,000 shares of common stock for cash at $0.01729 per share, and 2,300,000 shares of common stock for cash at $0.0110 per share to Peak One during Q2 2022.\nAs stock-based compensation for annual bonus for calendar year of 2021, the Company issued 5,000,000 shares restricted common stock to the Chief Investment Officer and 10,000,000 shares restricted common stock to the Chief Executive Officer which were valuated at market price $0.0138 per share in Q2 2022.\nThe Company issued 30,000,000 shares of restricted stock at market price $0.0138 per share to seven consultants for 6 months to 18 months consulting services of movies and NFT related business in Q2 2022.\nThe Company issued total 85,715,176 of common shares from preferred shares series C conversion during the year.\nThe Company issued total 12,307,672 of common shares from preferred shares series D conversion during the year.\nSubscription of Common shares\nOn August 2, 2022, the Company entered into a common stock purchase agreement with Alumni Capital LP, a Delaware limited partnership. Pursuant to the agreement, Alumni Capital LP shall purchase $1.0 million of common stocks as per the Companys discretions after a Registration Statement is declared effective by the Securities and Exchange Commission. The purchase price is number of common stocks in a Purchase Notice issued by the Company multiplied by 75% of the lowest traded price of the Common Stock five Business Days prior to the Closing, which is no later than five business days after the Purchase Notice Date.\nIn connection with this common stock purchase, Alumni Capital LP is also entitled to purchase up to 50,000,000 shares of Companys common stock (the Warrant Shares). The exercise price is $0.02 per shares with an exercise period commencing on August 2, 2022, and ending on the 5 years anniversary of the issuance date. The aggregated fair value of the warrants is $234,000. The fair value has been estimated using the Black-Scholes pricing model with the following assumptions: market value of underlying common shares of $0.0048; risk free rate of 2.85%; expected term of 5 years; exercise price of $0.02; volatility of 221.4%; and expected future dividends of $Nil. The warrants were recorded in equity.\nThe Company plans to use the proceeds from the sale of the common stocks for general corporate and working capital purposes and acquisitions or assets, businesses or operations or for other purposes that the Board of Directors, in good faith deem to be in the best interest of the Company. The registration of these securities was effective on September 13, 2022.\nPreferred shares\nOn September 3, 2021, the Company entered into a securities purchase agreement with an accredited investor, whereby the investor purchased from the Company 234,300 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $203,500. The closing occurred on September 3, 2021. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $184,000.\nOn October 21, 2021, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 98,325 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $85,450. The closing occurred on October 21, 2021. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $75,390.\nDuring the quarter ended November 30, 2021, the Company issued 153 shares of series D preferred stock to an investor for the purchase price of $153,000. After the payment of transaction-related expenses, net proceeds to the Company from the issuance of the Series D Preferred Stock was $140,760.\nOn December 9, 2021, the Company issued 34 shares of series D preferred stock to an investor for the purchase price of $34,000. After the payment of transaction-related expenses, net proceeds to the Company from the issuance of the Series D Preferred Stock was $31,280.\nOn January 21, 2022, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 89,490 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $78,035. The closing occurred on January 21, 2022. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $68,535.\nOn March 16, 2022, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 96,075 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $83,500. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $73,600.\nOn June 1, 2022, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 147,775 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $128,500. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $115,000.\nOn July 19, 2022, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 92,000 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $80,000. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $70,380.\nThe Company recorded dividend expenses of $36,952 and $25,835 in connection with its preferred stocks for the years ended August 31 2022 and 2021, respectively. The Company also recorded a penalty expense of $141,945 which was in connection with the conversion of Series C preferred stocks due to the fact that the Company was late filing the Form 10-Q for the period ended February 28, 2022.\nThese securities were issued pursuant to Section 4(2) of the Securities Act and/or Rule 506 promulgated thereunder. The holders represented their intention to acquire the securities for investment only and not with a view towards distribution. The investors were given adequate information about us to make an informed investment decision. We did not engage in any general solicitation or advertising. We directed our transfer agent to issue the stock certificates with the appropriate restrictive legend affixed to the restricted stock. Item 6. Selected Financial Data\nA smaller reporting company is not required to provide the information required by this Item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nForward-Looking Statements\nCertain statements, other than purely historical information, including estimates, projections, statements relating to our business plans, objectives, and expected operating results, and the assumptions upon which those statements are based, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These forward-looking statements generally are identified by the words believes, project, expects, anticipates, estimates, intends, strategy, plan, may, will, would, will be, will continue, will likely result, and similar expressions. We intend such forward-looking statements to be covered by the safe-harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995, and are including this statement for purposes of complying with those safe-harbor provisions. Forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties which may cause actual results to differ materially from the forward-looking statements. Our ability to predict results or the actual effect of future plans or strategies is inherently uncertain. Factors which could have a material adverse effect on our operations and future prospects on a consolidated basis include, but are not limited to: changes in economic conditions, legislative/regulatory changes, availability of capital, interest rates, competition, and generally accepted accounting principles. These risks and uncertainties should also be considered in evaluating forward-looking statements and undue reliance should not be placed on such statements. We undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise. Further information concerning our business, including additional factors that could materially affect our financial results, is included herein and in our other filings with the SEC.\nResults of Operations\nRevenues\nOur total revenue reported for the years ended August 31, 2023 and 2022 was $1,473,222 and $2,928,000, respectively.\nThe revenue for the year ended August 31, 2023, was mainly attributable to the license fee received in connection with the licensing of our NFT MMM platform, movie copyrights sales to a third party, as well as the revenue generated from movie tickets and food and beverage sales from our newly operated movie theatre. On the other hand, the revenue for the year ended August 31, 2022, was mainly attributable to the sale of mainland China copyrights and broadcast rights for a number of movies. The decrease in revenue was mainly due to the decrease in copyrights and broadcast rights sold in fiscal 2023 as compared to fiscal 2022.\nWe have started the operation of our movie theatre since October 2022. For the year ended August 31, 2023, we generated total revenue of $525,222, including $345,057 from ticket sales, and $180,165 from food and beverage sales. We expect to have continued growth in our cinema segment with the recovery of movie industry from the impact of the pandemic.\nWe anticipate an increase in revenue in the future by selling movie and TV drama copyrights and broadcast rights, achieving enough customers to start subscriptions for ABQQ.tv and generating movie tickets and related revenues from our Mt. Kisco movie theatre in New York. We also hope to generate more license revenue from our NFT MMM platform.\nOperating Costs and Expenses\nOperating expenses was $5,030,354 for the year ended August 31, 2023, as compared to $4,959,787 for the year ended August 31, 2022. Our operating costs and expenses for the year ended August 31, 2023 consisted of theatre operating costs of $243,635, amortization expenses of $3,048,172, general and administrative expenses of $1,507,988 and related party salary and wages of $230,559. In contrast, our operating costs and expenses for the year ended August 31, 2022 consisted of amortization expenses of $3,221,789, general and administrative expenses of $1,190,360 and related party salary and wages of $547,638.\nWe experienced an increase in theatre operating costs in fiscal 2023 as compared to fiscal 2022, mainly due to the commencement of our move theatre operation since October 2022.\nWe experienced a decrease in amortization expenses in fiscal 2023 as compared to fiscal 2022, mainly due to the increase in fully amortized assets for the year ended August 31, 2023.\nWe experienced an increase in general and administrative expenses in fiscal 2023 as compared to fiscal 2022, mainly as a result of increased non-related party salaries and contractors, professional fees, and utilities expenses, offset partially by decreased depreciation expense in fiscal 2023 as compared with fiscal 2022.\nWe experienced a decrease in related party salary and wages in fiscal 2023 as compared to fiscal 2022 due to the resignation of the Chief Financial Officer and Chief Investment Officer during the year ended August 31, 2023. During the years ended August 31, 2023 and 2022, the Company paid the Chief Executive Officer and Chief Financial Officer total compensation of $198,113 and $393,165, respectively. The Company also paid Chief Investment Officer compensation of $32,446 and $154,473, respectively, for the years ended August 31, 2023 and 2022.\nWe anticipate our operating expenses will increase as we undertake our plan of operations, including increased costs associated with marketing, personnel, and other general and administrative expenses, along with increased professional fees associated with SEC and COVID compliance as our business grows more complex and more expensive to maintain. On the COVID front, we expect that restrictions will ease moving forward, but there may still be setbacks as variants to the virus emerge and governments take lockdown measures in response. These and other costs for COVID expenditures may increase our operational costs in fiscal 2023 at various levels of operation.\nOther Income (Expenses)\nWe had other expenses of $9,578 for the year ended August 31, 2023, as compared with other expenses of $142,184 for the year ended August 31, 2022. Our other expenses for fiscal 2023 was the interest expense - related party, net of bank interest income. Our other expenses for fiscal 2022 was the result of the penalty expenses recorded in connection with the conversion of the Companys Series C preferred stocks due to the fact that the Company was late filing the Form 10-Q for the period ended February 28, 2022.\nNet Loss\nWe incurred a net loss in the amount of $3,566,710 for the year ended August 31, 2023, as compared with a net loss of $2,173,971 for year ended August 31, 2022.\nLiquidity and Capital Resources\nAs of August 31, 2023, we had $117,096 in current assets consisting of cash. Our total current liabilities as of August 31, 2023 were $1,122,943. As a result, we have a working capital deficit of $1,005,847 as of August 31, 2023 as compared with $856,866 as of August 31, 2022.\nOperating activities used $553,489 in cash for the year ended August 31, 2023, as compared with $1,500,168 used in cash for the year ended August 31, 2022.\nOur negative operating cash flow for the year ended August 31, 2023 was mainly the result of our net loss combined with operating changes in the purchase and deposit for acquiring movie copyrights and software, and the decrease in accounts payable and accrued liabilities offset by the amortization of intangible assets, consulting fees paid in stock and the refund of purchase deposits.\nOur negative operating cash flow for the year ended August 31, 2022 was mainly the result of our net loss for the year combined with the purchase and deposit for acquiring movie and TV series copyrights and broadcast rights, and the decrease of related party payable balance, offset by the amortization of intangible assets, and increased account payable and accrued liabilities.\nInvesting activities was $Nil for the years ended August 31, 2023 and 2022.\nFinancing activities provided $586,362 for the year ended August 31, 2023, as compared with $1,452,138 provided in financing activities for the year ended August 31, 2022. Our positive financing cash flow for the years ended August 31, 2023 and 2022 was mainly the result of proceeds from issuance of our common shares, preferred shares, and the loans from the stockholders.\nGoing Concern\nOur consolidated financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates the realization of assets and the discharge of liabilities in the normal course of business for the foreseeable future. As of August 31, 2023, the Company had an accumulated deficit of approximately $12.4 million and a working capital deficit of approximately $1.0 million. For the year ended August 31, 2023, the Company incurred a net loss of approximately $3.6 million and the net cash used in operating activities was approximately $0.6 million. Losses have principally occurred as a result of the substantial resources required for general and administrative expenses associated with our operations.\nThe future operations of the Company depend on its ability to realize forecasted revenues, achieve profitable operations, and depend on whether or not the Company could obtain the continued financial support from its stockholders or external financing. Management believes the existing stockholders will continue to provide the additional cash to meet the Companys obligations as they become due. The Company also intends to fund operations through cash flow generated from the operations, including the expected ticket sales from Mt. Kisco movie theatre, equity financing, debt borrowings, and additional equity financing from outside investors, to ensure sufficient working capital. However, no assurance can be given that additional financing, if required, would be available on favorable terms or at all. If we are not able to secure additional funding, the implementation of our business plan will be impaired.\nThese factors, among others, raise the substantial doubt regarding the Companys ability to continue as a going concern. The financial statements do not include any adjustments to reflect the possible future effect on the recoverability and classification of assets or the amounts and classifications of liabilities that may result from the outcome of these uncertainties. Management believes that the actions presently being taken to obtain additional funding and implement its strategic plan provides the opportunity for the Company to continue as a going concern.\nOff Balance Sheet Arrangements\nAs of August 31, 2023, there were no off-balance sheet arrangements.\nCritical Accounting Policies\nIn December 2001, the SEC requested that all registrants list their most critical accounting polices in the Management Discussion and Analysis. The SEC indicated that a critical accounting policy is one which is both important to the portrayal of a companys financial condition and results, and requires managements most difficult, subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain.\nOur critical accounting policies are set forth in Note 2 to the financial statements.\nRecently Issued Accounting Pronouncements\nWe do not expect the adoption of recently issued accounting pronouncements to have a significant impact on our results of operations, financial position or cash flow. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nA smaller reporting company is not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firm;\nConsolidated Balance Sheets as of August 31, 2023 and 2022;\nConsolidated Statements of Operations for the years ended August 31, 2023 and 2022;\nConsolidated Statements of Changes in Stockholders Equity for the years ended August 31, 2023 and 2022;\nConsolidated Statements of Cash Flows for the years ended August 31, 2023 and 2022; and\n- Notes to Consolidated Financial Statements.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of\nAB International Group Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of AB International Group Corp. (the Company) as of August 31, 2023 and 2022, and the related consolidated statements of operations, changes in stockholders equity, and cash flows for years ended August 31, 2023 and 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2023 and 2022, and the results of its operations and its cash flows for the years ended August 31, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As described in Note 3 to the financial statements, as of August 31, 2023, the Company had an accumulated deficit of approximately $12.4 million and a working capital deficit of approximately $1.0 million. For the year ended August 31, 2023, the Company incurred a net loss of approximately $3.6 million and the net cash used in operating activities was approximately $0.6 million. These factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are described in Note 3 to the financial statements. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. We determined that there are no critical audit matters for current period.\n/s/ Prager Metis CPAs, LLC\nWe have served as the Companys auditor since 2022.\nHackensack, New Jersey\nNovember 29, 2023\nPCAOB ID Number 273\nAB INTERNATIONAL GROUP CORP.\nConsolidated Balance Sheets\nAugust 31,\nAugust 31,\nASSETS\nCurrent Assets\nCash and cash equivalents\n$ 117,096\n$ 84,223\nPrepaid expenses\n-\n13,035\nTotal Current Assets\n117,096\n97,258\nProperty and equipment, net\n8,254\n12,695\nRight of use operating lease assets, net\n696,380\n1,004,018\nIntangible assets, net\n1,455,110\n3,798,282\nPurchase deposits for intangible assets, non-current\n300,000\n881,724\nSecurity deposit\n45,240\n45,240\nTOTAL ASSETS\n$ 2,622,080\n$ 5,839,217\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent Liabilities\nAccounts payable and accrued liabilities\n$ 156,763\n$ 293,786\nAccounts payable and accrued liabilities - related party\n6,388\n15,127\nLoan from related parties\n748,285\n377,398\nCurrent portion of obligations under operating leases\n211,507\n229,813\nDeferred revenue\n-\n38,000\nTotal Current Liabilities\n1,122,943\n954,124\nObligations under operating leases, non-current\n608,149\n863,145\nTotal Liabilities\n1,731,092\n1,817,269\nStockholders Equity\nPreferred stock, $0.001 par value, 10,000,000 preferred shares authorized;\nSeries A preferred stock, 100,000 and 100,000 shares issued and outstanding, as of August 31, 2023 and 2022, respectively\nSeries B preferred stock, 20,000 and 20,000 shares issued and outstanding, as of August 31, 2023 and 2022, respectively\nSeries C preferred stock, 174,421 and 335,850 shares issued and outstanding, as of August 31, 2023 and 2022, respectively\nSeries D preferred stock, 0 and 0 shares issued and outstanding, as of August 31, 2023 and 2022, respectively\n-\n-\nCommon stock, $0.001 par value, 10,000,000,000 shares authorized; 1,285,283,385 and 384,512,583 shares issued and outstanding, as of August 31, 2023 and 2022, respectively\n1,285,283\n384,512\nAdditional paid-in capital\n11,993,408\n12,636,838\nAccumulated deficit\n(12,387,998 )\n(8,789,901 )\nUnearned stock compensation\n-\n(209,957 )\nTotal Stockholders Equity\n890,988\n4,021,948\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY\n$ 2,622,080\n$ 5,839,217\nThe accompanying notes are an integral part of these financial statements.\nAB INTERNATIONAL GROUP CORP.\nConsolidated Statements of Operations\nYears ended\nAugust 31,\nREVENUE\nCopyrights and license\n$ 948,000\n$ 2,928,000\nTheatre admissions and food and beverage sales\n525,222\n-\nTotal revenue\n1,473,222\n2,928,000\nOPERATING COSTS AND EXPENSES\nAmortization expenses\n(3,048,172 )\n(3,221,789 )\nTheatre operating costs\n(243,635 )\n-\nGeneral and administrative expenses\n(1,507,988 )\n(1,190,360 )\nRelated party salary and wages\n(230,559 )\n(547,638 )\nTotal Operating Costs And Expenses\n(5,030,354 )\n(4,959,787 )\nLoss From Operations\n(3,557,132 )\n(2,031,787 )\nOTHER INCOME (EXPENSES)\nInterest income (expenses)\n(239)\nInterest expense - related party\n(10,318 )\n-\nPenalty expenses\n-\n(141,945 )\nTotal Other Expenses\n(9,578 )\n(142,184 )\nLoss Before Income Tax Benefit\n(3,566,710 )\n(2,173,971 )\nIncome tax benefit\n-\n-\nNET LOSS\n$ (3,566,710 )\n$ (2,173,971 )\nPreferred shares dividend expense\n(31,387 )\n(36,952 )\nNET LOSS AVAILABLE TO COMMON STOCK HOLDERS\n$ (3,598,097 )\n$ (2,210,923 )\nNET LOSS PER SHARE: BASIC\n$ (0.00 )\n$ (0.01 )\nNET LOSS PER SHARE: DILUTED\n$ (0.00 )\n$ (0.01 )\nWEIGHTED AVERAGE NUMBER OF SHARES OUTSTANDING: BASIC\n866,520,740\n290,712,023\nWEIGHTED AVERAGE NUMBER OF SHARES OUTSTANDING: DILUTED\n866,520,740\n290,712,023\nThe accompanying notes are an integral part of these financial statements.\nAB INTERNATIONAL GROUP CORP.\nConsolidated Statements of Changes in Stockholders' Equity\nCommon Stock Preferred Stock\nNumber of Shares Amount Number of Shares Amount Additional Paid-in Capital Accumulated Deficit Unearned Compensation Total Equity\nBalance -August 31, 2021 226,589,735 $ 226,590 120,000 $ 120 $ 11,009,517 $ (6,578,978 ) $ (7,473 ) $ 4,649,776\nPut Shares issued for cash 14,900,000 14,900 - - 216,002 - - 230,902\nPreferred shares series C issuance\n-\n-\n757,965\n586,148\n-\n-\n586,906\nPreferred shares series C converted into common shares\n85,715,176\n85,715\n(422,115 )\n(422 )\n(85,293 )\n-\n-\n-\nPenalty and dividend in connection with Preferred shares series C\n-\n-\n-\n-\n174,731\n-\n-\n174,731\nPreferred shares series D issuance\n-\n-\n-\n172,040\n-\n-\n172,040\nPreferred shares series D and dividend shares converted into common shares\n12,307,672\n12,307\n(187 )\n-\n(12,307 )\n-\n-\n-\nCommon shares issued to officers for services 45,000,000 45,000 - - 576,000 - (202,484 ) 418,516\nNet loss\n-\n-\n-\n-\n-\n(2,210,923 )\n-\n(2,210,923)\nBalance at August 31, 2022 384,512,583 $ 384,512 455,850 $ 456 $ 12,636,838 $ (8,789,901 ) $ (209,957 ) $ 4,021,948\nBalance - August 31, 2022 384,512,583 $ 384,512 455,850 $ 456 $ 12,636,838 $ (8,789,901 ) $ (209,957 ) $ 4,021,948\nIssuance of common shares 200,000,000 200,000 - - (53,525 ) - - 146,475\nPreferred shares Series C issuance - - 90,275 68,910 - - 69,000\nPreferred shares series C converted into common shares 700,770,802 700,771 (250,268 ) (250 ) (700,521 ) - - -\nDividend in connection with Preferred shares series C - - - - 31,387 - - 31,387\nStock based compensation - consultants - - - - - - 209,957 209,957\nPreferred shares series C waived - - (1,436 ) (1 ) - - -\nImputed Interest - - - - 10,318 - - 10,318\nNet loss - - - - - (3,598,097 ) - (3,598,097)\nBalance - August 31, 2023 1,285,283,385 $ 1,285,283 294,421 $ 295 $ 11,993,408 $ (12,387,998 ) $ - 890,988\nThe accompanying notes are an integral part of these financial statements.\nAB INTERNATIONAL GROUP CORP.\nConsolidated Statements of Cash Flows\nYears Ended\nAugust 31,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$ (3,598,097 )\n$ (2,210,923 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nExecutive salaries and consulting fees paid in stock\n209,957\n418,516\nDepreciation of fixed asset\n4,441\n41,010\nAmortization of intangible asset\n3,048,172\n3,221,789\nInterest expense\n10,318\n-\nNon-cash penalty and dividend expense for preferred shares\n31,387\n172,897\nNon-cash lease expense\n34,336\n88,541\nChanges in operating assets and liabilities:\nRelated party receivable\n-\n1,439\nPrepaid expenses\n13,035\nRent security & electricity deposit\n-\n(28,732 )\nPurchase deposits refunded (paid)\n120,000\n(881,724 )\nPurchase of movie and TV series broadcast right and copyright\n(243,276 )\n(1,614,881 )\nAccounts payable and accrued liabilities\n(137,023 )\n171,676\nAccounts payable and accrued liabilities - related party\n(8,739)\n(918,307 )\nDeferred revenue\n(38,000 )\n38,000\nNet cash used in operating activities\n(553,489 )\n(1,500,168 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nLoan from related parties\n370,887\n375,051\nProceeds from common stock issuances\n146,475\n318,141\nProceeds from preferred share C issuances\n69,000\n586,906\nProceeds from preferred share D issuances\n-\n172,040\nNet cash provided by financing activities\n586,362\n1,452,138\nNet increase (decrease) in cash and cash equivalents\n32,873\n(48,030 )\nCash and cash equivalents - beginning of year\n84,223\n132,253\nCash and cash equivalents - end of year\n$ 117,096\n$ 84,223\nSupplemental Cash Flow Disclosures\nCash paid for interest\n$ -\n$\nCash paid for income taxes\n$ -\n$ -\nNon-Cash Investing and Financing Activities:\nChange of ROU assets and lease liabilities due to cancellation of leases\n$ 43,489\n$ -\nTransfer from long term prepayment to intangible assets\n$ 461,724\n$ 1,406,385\nAdditions to ROU assets\n$ -\n$ 1,207,789\nThe accompanying notes are an integral part of these consolidated financial statements.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION AND BUSINESS OPERATIONS\nAB International Group Corp. (the Company, we or us) was incorporated under the laws of the State of Nevada on July 29, 2013. The Company is an Intellectual Property (IP) investment and licensing company. The Company, through its subsidiaries, is primarily engaged in the acquisition and distribution of movies, TV shows and music. On December 15, 2014, the Company incorporated APP Board Limited in Hong Kong, with its operation focusing primarily on acquisition and distribution movies and TV Shows.\nOn April 22, 2020, the Company announced the first phase development of its video streaming service. The online service will be marketed and distributed in the world under the brand name ABQQ.tv. The Company's professional team are sourcing such dramas and films to provide video streaming service on the ABQQ.tv. The video streaming website www.ABQQ.tv was officially launched on December 29, 2020. The Company will continue marketing and promoting the ABQQ.tv website through GoogleAds and acquire additional broadcast rights for movies and TV series, and plan to charge subscription fees once the Company has obtained at least 200 broadcast rights of movie and TV series.\nOn April 27, 2022, the Company purchased a unique Non-Fungible Token (NFT) movie and music marketplace, named as the NFT MMM from Stareastnet Portal Limited, an unrelated party, which including an APP NFTMMM on Google Play, and full right to the website: stareastnet.io. NFTs are digital assets with a unique identifier that is stored on a blockchain, and NFTs are tradable rights of digital assets (pictures, music, films, and virtual creations) where ownership is recorded in blockchain smart contracts. The Company has licensed NFT MMM platform to a third party for the operation and obtained license fee starting from August 20, 2022 until August 19, 2023 when the license agreement expired.\nOn May 5, 2022, the Company incorporated AB Cinemas NY, Inc. in New York, NY, for the purpose of operating Mt. Kisco Theatre located at 144 Main Street, Mount Kisco, NY. The Company uses this theatre with a total of 5 screens and 466 seats for screening films. This is the Companys first cinema in the United States and movie theater will become a new business line of the Company. The theatre started operating in October 2022. After a rough two years for movie theatres due to the pandemic, movie theaters are starting to show signs of life again. The Company is intending to shift the business strategy from online only to the combination of online and offline business.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (US GAAP) and have been consistently applied.\nPrinciples of Consolidation\nThe financial statements have been prepared on a consolidated basis, with the Companys wholly owned subsidiary App Board Limited and AB Cinemas NY, Inc. All intercompany balances and transactions have been eliminated in consolidation.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date the financial statements and the reported amount of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid instruments purchased with an original maturity of three months or less to be cash equivalents.\nForeign Currency Transactions\nThe financial risk arises from the fluctuations in foreign exchange rates and the degrees of volatility in these rates. Currently the Company does not use derivative instruments to reduce its exposure to foreign currency risk. Gains and losses from translation of foreign currency into U.S. dollars are included in current results of operations.\nPrepayments\nPrepayments primarily consist of payments made to acquire the copyrights and distribution rights of movies, TV shows and music, etc. Prepayments are classified as either current or non-current based on the nature and the terms of the respective agreements. These prepayments are unsecured and are reviewed periodically to determine whether their carrying value has become impaired. The allowance is also based on managements best estimate of specific losses on individual exposures, as well as a provision on historical trends of collections and utilizations. Actual amounts received or utilized may differ from managements estimate of credit worthiness and the economic environment. Prepayments are written off against the allowances only after exhaustive collection efforts. No allowance was recorded for the years ended August 31, 2023 and 2022.\nProperty and Equipment, net\nProperty, plant and equipment are stated at cost less accumulated depreciation and amortization. Leasehold improvement is related to the enhancements paid by the Company to leased offices. Leasehold improvement represents capital expenditures for direct costs of renovation or acquisition and design fees incurred. The amortization of leasehold improvements commences once the renovation is completed and ready for the Companys intended use.\nThe straight-line depreciation method is used to compute depreciation over the estimated useful lives of the assets, as follows:\nEstimated Useful Life\nFurniture\n7 years\nAppliances\n5 years\nLeasehold improvement\nLesser of useful life and lease term\nExpenditures for maintenance and repairs, which do not materially extend the useful lives of the assets, are charged to expense as incurred. Expenditures for major renewals and betterments that substantially extend the useful life of assets are capitalized. The cost and related accumulated depreciation of assets retired or sold are removed from the respective accounts, and any gain or loss is recognized in the consolidated statements of operations in other income or expenses.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nIntangible Assets\nIntangible assets are recorded at the lower of cost or estimated fair value and amortized as follows:\nMovie copyrights and broadcast rights: straight-line method over the estimated life of the asset, which has been determined by management to be 2 years\nNFT MMM platform: straight-line method over the estimated life of the asset, which has been determined by management to be 2 years\nAmortized costs of the intangible asset are recorded as amortization expenses in the consolidated statements of operations..\nLease property under operating lease\nThe Company adopted ASU No. 2016-02-Leases (Topic 842) since June 1, 2019, using a modified retrospective transition method permitted under ASU No. 2018-11. This transition approach provides a method for recording existing leases only at the date of adoption and does not require previously reported balances to be adjusted. In addition, the Company elected the package of practical expedients permitted under the transition guidance within the new standard, which among other things, allowed us to carry forward the historical lease classification. Adoption of the new standard resulted in the recording of additional lease assets and lease liabilities on the consolidated balance sheets. The standard did not materially impact the Companys consolidated net earnings and cash flows.\nImpairment of Long-lived asset\nThe Company evaluates its long-lived assets or asset group, including intangible assets with indefinite and finite lives, for impairment. Intangible assets with indefinite lives that are not subject to amortization are tested for impairment at least annually or more frequently if events or changes in circumstances indicate that the assets might be impaired in accordance with ASC 350. Such impairment test compares the fair values of assets with their carrying values with an impairment loss recognized when the carrying values exceed fair values. For long-lived assets and intangible assets with finite lives that are subject to depreciation and amortization are tested for impairment whenever events or changes in circumstances (such as a significant adverse change to market conditions that will impact the future use of the assets) indicate that the carrying amount of an asset or a group of long-lived assets may not be recoverable. When these events occur, the Company evaluates impairment by comparing the carrying amount of the assets to future undiscounted net cash flows expected to result from the use of the assets and their eventual disposition. If the sum of the expected undiscounted cash flows is less than the carrying amount of the assets, the Company would recognize an impairment loss based on the excess of the carrying amount of the asset group over its fair value. Impairment losses are included in the general and administrative expense. There was no impairment loss during the year ended August 31, 2023 and 2022, respectively.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nRevenue Recognition\nThe Company adopted ASC Topic 606, Revenue from Contracts with Customers, using the modified retrospective approach. ASC 606 establishes principles for reporting information about the nature, amount, timing and uncertainty of revenue and cash flows arising from the entitys contracts to provide goods or services to customers. The core principle requires an entity to recognize revenue to depict the transfer of goods or services to customers in an amount that reflects the consideration that it expects to be entitled to receive in exchange for those goods or services recognized as performance obligations are satisfied.\nTo determine revenue recognition for contracts with customers, the Company performs the following five steps: (i) identify the contract with the customer, (ii) identify the performance obligations in the contract, (iii) determine the transaction price, including variable consideration to the extent that it is probable that a significant future reversal will not occur, (iv) allocate the transaction price to the respective performance obligations in the contract, and (v) recognize revenue when (or as) the Company satisfies the performance obligation.\nThe Company derives its revenues primarily from three sources: (1) selling copyrights of movies or TV shows; (2) licensing NFT MMM platform and providing technical service; (3) movie theater admissions and food and beverage sales.\nRevenue from selling copyrights of movies or TV shows:\nThe Company recognizes revenue when master copy of movie or TV show is delivered, the IP is authorized and transferred to customers. The Companys contracts with customer are primarily on a fixed-price basis and do not contain cancelable and refund-type provisions.\nRevenue from licensing NFT MMM platform and providing technical service fee:\nThe Company derives revenue from NFTMM platform license fees, which includes accessing the NFTMM platform and platform data on both app and website. The Company's contract has one year term, and is non-cancelable and non-refundable. In accordance with ASC 606, a 'right to access' license is recognized over the license period. Initial technical service fee comprises of installation, implementation and necessary training required by the customer. These services fees are recognized as the services are delivered at a point in time.\nRevenue from movie theater admissions and food and beverage sales:\nThe Company recognizes admissions and food and beverage revenues based on a gross transaction price which are recorded at a point in time when a film is exhibited to a customer and when a customer takes possession of food and beverage offerings. The Company defers 100% of the revenue associated with the sales of gift cards and exchange tickets until such time as the items are redeemed or estimated income from non-redemption is recorded.\nContract Assets and Liabilities\nPayment terms are established on the Companys pre-established credit requirements based upon an evaluation of customers credit quality. Contact assets are recognized for in related accounts receivable. Contract liabilities are recognized for contracts where payment has been received in advance of delivery. The contract liability balance can vary significantly depending on the timing of when an order is placed and when shipment or delivery occurs.\nAs of August 31, 2023 and 2022, other than accounts receivable and deferred revenue, the Company had no material contract assets, contract liabilities or deferred contract costs recorded on its consolidated balance sheets.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nDisaggregation of revenue\nThe Company disaggregates its revenue from contracts by revenue streams, as the Company believes it best depicts how the nature, amount, timing and uncertainty of the revenue and cash flows are affected by economic factors.\nThe following table presents sales by revenue streams for the years ended August 31, 2023 and 2022, respectively:\nAugust 31, 2023 August 31, 2022\nCopyrights sales $ 250,000 $ 2,806,000\nNFT licenses 698,000 122,000\nTheatre admissions 345,057 -\nFood and beverage sales 180,165 -\nTotal revenue $ 1,473,222 $ 2,928,000\nFair Value of Financial Instruments\nASC 820, Fair Value Measurements (ASC 820) and ASC 825, Financial Instruments (ASC 825), requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. It establishes a fair value hierarchy based on the level of independent, objective evidence surrounding the inputs used to measure fair value. A financial instruments categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. It prioritizes the inputs into three levels that may be used to measure fair value:\nLevel 1 - Level 1 applies to assets or liabilities for which there are quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Level 2 applies to assets or liabilities for which there are inputs other than quoted prices that are observable for the asset or liability such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical assets or liabilities in markets with insufficient volume or infrequent transactions (less active markets); or model-derived valuations in which significant inputs are observable or can be derived principally from, or corroborated by, observable market data.\nLevel 3 - Level 3 applies to assets or liabilities for which there are unobservable inputs to the valuation methodology that are significant to the measurement of the fair value of the assets or liabilities.\nASC 820 describes three main approaches to measuring the fair value of assets and liabilities: (1) market approach; (2) income approach; and (3) cost approach. The market approach uses prices and other relevant information generated from market transactions involving identical or comparable assets or liabilities. The income approach uses valuation techniques to convert future amounts to a single present value amount. The measurement is based on the value indicated by current market expectations about those future amounts. The cost approach is based on the amount that would currently be required to replace an asset.\nThe carrying values of cash, accounts payable, and accrued liabilities approximate fair value due to their short-term nature. The fair values of warrant liabilities and derivative liabilities embedded in convertible notes are determined by level 3 inputs.\nNo liabilities measured at fair value on a recurring basis as of August 31, 2023 and 2022.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nBasic and Diluted Earnings (Loss) Per Share\nThe Company computes earnings per share (EPS) in accordance with ASC 260, Earnings per Share (ASC 260). ASC 260 requires companies with complex capital structures to present basic and diluted EPS. Basic EPS is measured as net income (loss) divided by the weighted average common shares outstanding for the period. Diluted EPS presents the dilutive effect on a per share basis of potential common shares (e.g., convertible securities, options and warrants) as if they had been converted at the beginning of the periods presented, or issuance date, if later. Potential common shares that have an anti-dilutive effect (i.e., those that increase income per share or decrease loss per share) are excluded from the calculation of diluted EPS. As of August 31, 2023, the total number of warrants outstanding was 50,000,000 (See Note 9). No warrants were included in the diluted loss per share as they would be anti-dilutive.\nReclassification\nCertain prior period amounts have been reclassified to conform to the current period presentation.\nWarrants\nWarrants are classified as equity and the proceeds from issuing warrants in conjunction with convertible notes are allocated based on the relative fair values of the base instrument of convertible notes and the warrants by following the guidance of ASC 470-20-25-2.\nProceeds from the sale of a debt instrument with stock purchase warrants (detachable call options) shall be allocated to the two elements based on the relative fair values of the debt instrument without the warrants and of the warrants themselves at time of issuance. The portion of the proceeds so allocated to the warrants shall be accounted for as paid-in capital. The remainder of the proceeds shall be allocated to the debt instrument portion of the transaction. This usually results in a discount (or, occasionally, a reduced premium), which shall be accounted for as interest expense under Topic 835 Interest.\nIncome Taxes\nThe Company accounts for current income taxes in accordance with the laws of the relevant tax authorities. Income taxes are accounted for using the asset and liability approach. Under this approach, income tax expense is recognized for the amount of taxes payable or refundable for the current year. Deferred income taxes assets and liabilities are recognized when temporary differences exist between the tax bases of assets and liabilities and their reported amounts in the consolidated financial statements. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the consolidated statement of operations in the period including the enactment date. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized.\nThe Company records uncertain tax positions in accordance with ASC 740 on the basis of a two-step process whereby (1) the Company determines whether it is more likely than not that the tax positions will be sustained on the basis of the technical merits of the position and (2) for those tax positions that meet the more-likely-than-not recognition threshold, the Company recognizes the largest amount of tax benefit that is more than 50 percent likely to be realized upon ultimate settlement with the related tax authority.\nShare-Based Compensation\nThe Company follows the provisions of ASC 718, Compensation - Stock Compensation, which establishes the accounting for employee share-based awards. For employee share-based awards, share-based compensation cost is measured at the grant date based on the fair value of the award and is recognized as expense with graded vesting on a straight-line basis over the requisite service period for the entire award.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (continued)\nRecent Accounting Pronouncements\nIn October 2021, the FASB issued ASU No. 2021-08, ‘Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers (ASU 2021-08). This ASU requires entities to apply Topic 606 to recognize and measure contract assets and contract liabilities in a business combination. The amendments improve comparability after the business combination by providing consistent recognition and measurement guidance for revenue contracts with customers acquired in a business combination and revenue contracts with customers not acquired in a business combination. The amendments are effective for the Company beginning after December 15, 2023, and are applied prospectively to business combinations that occur after the effective date. The Company does not expect the adoption of ASU 2021-04 to have a material effect on the consolidated financial statements.\nIn June 2022, the FASB issued ASU No. 2022-03, \"Fair Value Measurements (Topic 820): Fair Value Measurement of Equity Securities Subject to Contractual Sale Restrictions,\" which clarifies and amends the guidance of measuring the fair value of equity securities subject to contractual restrictions that prohibit the sale of the equity securities. The guidance will be effective for fiscal years beginning after December 15, 2023 and interim periods within those fiscal years. The Company does not expect the adoption to have a material impact on the consolidated financial statements.\nThe Company does not believe other recently issued but not yet effective accounting standards, if currently adopted, would have a material effect on the Companys consolidated balance sheets, statements of operations and statements of cash flows.\nNOTE 3 - GOING CONCERN\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates the realization of assets and the discharge of liabilities in the normal course of business for the foreseeable future.\nAs of August 31, 2023, the Company had an accumulated deficit of approximately $12.4 million and a working capital deficit of approximately $1.0 million. For the year ended August 31, 2023, the Company incurred a net loss of approximately $3.6 million and the net cash used in operating activities was approximately $0.6 million. Losses have principally occurred as a result of the substantial resources required for general and administrative expenses associated with our operations. The continuation of the Company as a going concern is dependent upon the continued financial support from its stockholders or external financing. Management believes the existing stockholders will provide the additional cash to meet the Companys obligations as they become due. However, there is no assurance that the Company will be successful in securing sufficient funds to sustain the operations.\nThese factors, among others, raise the substantial doubt regarding the Companys ability to continue as a going concern. These consolidated financial statements do not include any adjustments to reflect the possible future effect on the recoverability and classification of assets or the amounts and classifications of liabilities that may result from the outcome of these uncertainties. Management believes that the actions presently being taken to obtain additional funding and implement its strategic plan provides the opportunity for the Company to continue as a going concern.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 4 - PROPERTY AND EQUIPMENT\nThe Company capitalized the renovation cost as leasehold improvement and the cost of furniture and appliances as fixed asset. Leasehold improvement relates to renovation and upgrade of the leased office.\nThe depreciation expense was $4,441 and $41,010 for the years ended August 31, 2023 and 2022, respectively.\nAs of August 31, 2023 and 2022, the balance of property and equipment was as follows:\nAugust 31, 2023 August 31, 2022\nLeasehold improvement $ 146,304 $ 146,304\nAppliances and furniture 25,974 25,974\nTotal cost 172,278 172,278\nAccumulated depreciation (164,024 ) (159,583 )\nProperty and equipment, net $ 8,254 $ 12,695\nNOTE 5 - INTANGIBLE ASSETS\nAs of August 31, 2023 and 2022, the balance of intangible assets was as follows:\nAugust 31, 2023\nAugust 31, 2022\nMovie copyrights - Love over the world\n$ 853,333\n$ 853,333\nSitcom copyrights - Chujian\n640,000\n640,000\nMovie copyrights - A story as a picture\n422,400\n422,400\nMovie copyrights - Our treasures 936,960 936,960\nMovie broadcast right- On the way 256,000 256,000\nMovie copyrights - Too simple\n1,271,265 1,271,265\nMovie copyrights - Confusion\n1,024,000 1,024,000\nMovie copyrights - Amazing Data\n300,000 -\nMovie copyrights - Nice to meet you\n300,000 -\nTV drama copyright - 20 episodes\n295,000 190,000\nMovie and TV series broadcast rights\n2,439,840 2,439,840\nNFT MMM platform\n280,000 280,000\nTotal cost 9,018,798 8,313,798\nAccumulated amortization\n(7,563,688 )\n(4,515,516 )\nIntangible assets, net\n$ 1,455,110\n$ 3,798,282\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 5 - INTANGIBLE ASSETS (Continued)\nThe amortization expense for the years ended August 31, 2023 and 2022 was $3,048,172 and $3,221,789, respectively. Estimated future amortization expense is as follows:\nTwelve months ending August 31, 2023\nAmortization expense\n$ 1,362,610\n92,500\nTotal\n$ 1,455,110\nIn March 2022, the Company signed a purchase agreement with All In One Media Ltd to acquire the copyrights and broadcast rights for five movies at a price of $1,500,000. These copyrights and broadcast rights allow the Company to broadcast these movies outside the mainland China. On November 29, 2022, both parties entered into an amended agreement to deliver the copyrights and broadcast rights of two movies (Amazing data and Nice to meet you) to the Company on November 30, 2022 for a total price of $600,000. As of August 31, 2022, $356,724 was paid and recorded as purchase deposit for intangible asset. On November 30, 2022, the company received the copies of two movies. The purchase deposit of $356,724 was transferred to intangible assets and the unpaid balance of $243,276 was recorded as accounts payable and was paid in December 2022. Per amended agreement, the remaining three movies will be delivered upon receiving the payment of minimum $300,000 per movie from the Company before December 31, 2022. The agreement was terminated on December 31, 2022 due to the fact that the Company did not make the payments for the remaining movies.\nIn March 2022, the Company signed a purchase agreement with Anyone Pictures Limited to acquire the copyright for broadcasting a 25-episode TV drama series outside of mainland China, at a price of $525,000. Five standalone episodes were delivered in December 2022. On February 21, 2023, both parties entered into a supplementary agreement to determine the delivery of the remaining 20 standalone episodes. As a result, Anyone Pictures Limited agreed to refund $420,000 to the Company and the Company had received the full amount as of August 31, 2023.\nOn August 6, 2022, the Company licensed NFT MMM platform to a third party to allow the access of NFTMM platform and platform data on both app and website for one year starting from August 20, 2022 for a monthly license fee of $60,000. The Company remains the ownership and copyright of the NFT MMM platform, including the APP NFT MMM on Google Play, and the website: starestnet.io. For the year ended August 31, 2023, the Company recognized license revenue of $698,000.\nOn May 31, 2023, the Company entered into an agreement with Capitalive Holdings Limited to sell the offline broadcast rights of total 59 movies for a price of $250,000. The granted broadcast rights are globally exclusive, with the exception of Mainland China.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 6 - LEASES\nThe Company leased certain office space in Hong Kong from Zestv Studios Limited, a Hong Kong entity 100% owned by the Chief Executive Officer Chiyuan Deng, under operating lease for three years from May 1, 2019 to April 30, 2022 with annual rental of $66,048 (HKD 516,000). On May 1, 2022, the Company signed a new operating lease agreement with Zestv Studios Limited to lease its Hong Kong office premise for two years from May 1, 2022 to April 2024 with annual rental of $66,048 (HKD 516,000). The lease was early terminated as of August 31, 2023.\nThe Company also leased an office space in Singapore under operating lease from April 13, 2021 to March 31, 2022 with monthly rental of $716 (SGD 974), and an office space at 48 Wall Street, New York, under operating lease for one year from September 1, 2021 to August 31, 2022 with annual rental of $20,400. The Company has renewed the lease of its New York office space for one year from September 1, 2022 to August 31, 2023 with renewed annual rental of $22,440. The lease was not renewed subsequent to the year ended August 31, 2023.\nOn October 21, 2021, the Company signed a lease agreement to lease the Mt. Kisco Theatre, a movie theater, for five years plus the free rent period which commences four months from the lease commencement date. The theatre consists of approximately 8,375 square feet, and the total monthly rent is $14,366 for the first two years, including real estate related taxes and landlords insurance.\nTotal lease expense for the years ended August 31, 2023 and 2022 was $291,319 and $289,411, respectively. All leases are on a fixed payment basis. The Companys lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nThe following is a schedule of maturities of lease liabilities:\nTwelve months ending August 31,\n$ 216,364\n250,555\n255,412\n107,275\nTotal future minimum lease payments 829,606\nLess: imputed interest (9,950 )\nTotal $ 819,656\nNOTE 7 - PURCHASE DEPOSITS FOR INTANGIBLE ASSETS\nThe balance of purchase deposits for intangible assets which relates to the acquisition of copyrights and broadcast rights for movies and TV dramas and software was as follows:\nAugust 31, 2023\nAugust 31, 2022\nPurchase deposit for movies and TV dramas\n$ -\n$ 881,724\nPurchase deposit for software\n300,000\n-\nTotal purchase deposits for intangible assets\n$ 300,000\n$ 881,724\nOn June 8, 2023, the Group has entered into software development contract for the creation of the streaming software designed for use on both the website and mobile applications. Pursuant to the contracts terms, the Developer is contractually obliged to deliver the software by September 8, 2024, which corresponds to the upcoming 15-month period. The costs of the software amounts to $1,500,000. As of August 31, 2023, the Group has remitted an initial payment of $300,000 to the Developer.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 8 - RELATED PARTY TRANSACTIONS\nLoan from related parties\nIn support of the Companys efforts and cash requirements, it may rely on advances from stockholders until such time that the Company can support its operations or attains adequate financing through sales of its equity or traditional debt financing. On June 1, 2023, Chiyuan Deng, the Chief Executive Officer, as the Company stockholders, entered into a line of credit agreement with the Company. Chiyuan Deng agreed to provide a line of credit to the Company for a total amount of no more than $1,500,000, including the previous shareholder loan balance of $697,281. The amount under this line of credit is non-interest bearing and due on demand starting from June 1, 2023. The Company has recognized an imputed interest at 5% per annum of the balances as of the year ended August 31, 2023. As of August 31, 2023 and 2022, the Company had loan from Chiyuan Deng balance of $748,285 and $144,516.\nJianli Deng, the former Chief Financial Officer, as the Companys stockholders, make advances periodically to the Company for working capital purpose. These loans are non-interest bearing and due on demand. The amount due to Jianli Deng was fully settled on May 16, 2023. As of August 31, 2023 and 2022, the Company had loan from Jianli Deng balance of $0 and $232,882.\nAccounts payable and accrued liabilities - related party - Youall Perform Services Ltd.\nYouall Perform Services Ltd is owned by Jianli Deng, the former Chief Financial Officer. In September 2019, the Company entered into an agreement with Youall Perform Services Ltd for two transactions. 1) The Company pays Youall Perform Services Ltd. 10% of the revenue generated from the Ai Bian Quan Qiu platform every month to reimburse the valued-added tax, tax surcharges, and foreign transaction fee Youall Perform Services Ltd. has been paying on behalf of the Company. 2) Youall Perform Services Ltd. will provide IT consulting service for Ai Bian Quan Qiu platform upgrade and maintenance at a total cost of $128,000, out of which $108,800 has been paid. As there has been no revenue from the Ai Bian Quan Qiu platform due to COVID-19 since mid-January, 2020, $108,800 prepayment was expensed as research and development expense in FY2020. In July 2020, the Company changed the service scope of this agreement and turned it into a two-year website maintenance contract to maintain the website ABQQ.TV which was launched on December 29, 2020. The website maintenance service began on January 1, 2021 and will end on December 31, 2022. The contract amount remains to be $128,000, out of which $108,800 was previously paid and $19,200 was scheduled to be due on the twenty first month of service term. During the year ended August 31, 2023, the Company made payment of $12,812 with the accounts payable - related party balance to Youall Perform Services Ltd of $6,388 as of August 31, 2023.\nAccounts payable and accrued liabilities - related party - Zestv Studios Limited\nOn December 1, 2020, the Company entered an agreement with Zestv Studios Limited, a Hong Kong entity 100% owned by Chiyuan Deng, the Chief Executive Officer, to grant Zestv Studios Limited the distribution right for the movie Love over the world and charge Zestv Studios Limited movie royalties. The Companys royalty revenue is stipulated to equal 43% of the after-tax movie box office revenue deducting movie issuance costs. The movie box office revenue is tracked by a movie distributor Huaxia Film Distribution Co. Ltd (hereafter Hua Xia) in China as it connects with all movie theaters in China and can track the total movie box office revenue online in real time. Although Zestv Studios Limited has paid royalty revenue to the Company, Zestv Studios Limited failed to collect cash from Hua Xia. As of August 31, 2021, the Company had refund payable of $916,922 for the movie royalty revenue net of the movie distribution commission fee to Zestv Studios Limited.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 8 - RELATED PARTY TRANSACTIONS (continued)\nAccounts payable and accrued liabilities - related party - Zestv Studios Limited (continued)\nOn June 23, 2022, the Company sold the mainland China copyright and broadcast right of the movie Too Simple to Zestv Studios Limited for a price of $750,000. The Company remains to have all copyright of outside of mainland China. The Company used this proceed to off-set the refund payable balance to Zestv Studios Limited with additional payment of $151,795 during the year ended August 31, 2022. The Company made payments of $15,127 during the year ended August 31, 2023.\nAs of August 31, 2023 and 2022, the Company had balance of $0 and $15,127 payable to Zestv Studios Limited, respectively.\nThe Company also rented an office space from Zestv Studios Limited. The lease was early terminated on August 31, 2023 (See Note 6). For the years ended August 31, 2023 and 2022, the Company incurred related party office rent expense of $66,048 and $66,048 respectively.\nExecutives salaries\nOn September 11, 2020 and May 24, 2022, the Company entered into two amended employment agreements with Chiyuan Deng, the Chief Executive Officer. Pursuant the amended agreements, the Company amended the compensation to Mr. Deng to include a salary of $180,000 annually, a reduction in common stock received under his initial employment agreement, a potential for a bonus in cash or shares, and the issuance of 100,000 shares of Series A Preferred Stock at par value $0.001. Mr. Deng returned 266,667 shares common stock to the Company received under his initial employment agreement.\nFor the years ended August 31, 2023 and 2022, the Company incurred total compensation of $198,113 and $393,165, respectively, for Chief Executive Officer and Chief Financial Officer. The Company also incurred total compensation of $32,446 and $154,473, respectively, for Chief Investment Officer for the year ended August 31, 2023 and 2022.\nNOTE 9 - STOCKHOLDERS EQUITY\nCommon shares\nThe Company had the following activities during the year ended August 31, 2023:\nIncreasing authorized number of common shares\nOn October 11, 2022, the Company filed amendment to Articles of Incorporation to increase the authorized number of common shares from 1,000,000,000 shares to 10,000,000,000 shares. This increasing of authorized number of common shares has been retroactively reflected in the consolidated financial statements and notes thereto.\nConversion of Series C preferred shares to common shares\nDuring the year ended August 31, 2023, the Company issued total 700,770,802 common shares as the result of the conversion of total 250,268 Series C preferred shares.\nPursuant to the common stock purchase agreement signed with Alumni Capital LP on August 2, 2022, for the year ended August 31, 2023, Alumni Capital LP subscribed total of 200,000,000 common shares for total proceeds of $146,475. The agreement expired on December 31, 2022.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 9 - STOCKHOLDERS EQUITY (continued)\nCommon shares (continued)\nThe Company had the following equity activities during the year ended August 31, 2022:\nThe Company issued 2,500,000 and 3,000,000 shares of put shares to Peak One for cash at $0.02288, and $0.02719, respectively, per share during Q1 2022.\nThe Company issued 1,800,000 shares of common stock for cash at $0.01548 per share, and 3,000,000 shares of common stock for cash at $0.01716 per share, and 2,300,000 shares of common stock for cash at $0.01729 per share, and 2,300,000 shares of common stock for cash at $0.0110 per share to Peak One during Q2 2022.\nAs stock-based compensation for annual bonus for calendar year of 2021, the Company issued 5,000,000 shares restricted common stock to the Chief Investment Officer and 10,000,000 shares restricted common stock to the Chief Executive Officer which were valuated at market price $0.0138 per share in Q2 2022.\nThe Company issued 30,000,000 shares of restricted stock at market price $0.0138 per share to seven consultants for 6 months to 18 months consulting services of movies and NFT related business in Q2 2022.\nThe Company issued total 85,715,176 of common shares from preferred shares series C conversion during the year.\nThe Company issued total 12,307,672 of common shares from preferred shares series D conversion during the year.\nSubscription of Common shares\nOn August 2, 2022, the Company entered into a common stock purchase agreement with Alumni Capital LP, a Delaware limited partnership. Pursuant to the agreement, Alumni Capital LP shall purchase $1.0 million of common stocks as per the Companys discretions after a Registration Statement is declared effective by the Securities and Exchange Commission. The purchase price is number of common stocks in a Purchase Notice issued by the Company multiplied by 75% of the lowest traded price of the Common Stock five Business Days prior to the Closing, which is no later than five business days after the Purchase Notice Date.\nIn connection with this common stock purchase, Alumni Capital LP is also entitled to purchase up to 50,000,000 shares of Companys common stock (the Warrant Shares). The exercise price is $0.02 per shares with an exercise period commencing on August 2, 2022, and ending on the 5 years anniversary of the issuance date. The aggregated fair value of the warrants is $234,000. The fair value has been estimated using the Black-Scholes pricing model with the following assumptions: market value of underlying common shares of $0.0048; risk free rate of 2.85%; expected term of 5 years; exercise price of $0.02; volatility of 221.4%; and expected future dividends of $0. The warrants were recorded in equity.\nThe Company plans to use the proceeds from the sale of the common stocks for general corporate and working capital purposes and acquisitions or assets, businesses or operations or for other purposes that the Board of Directors, in good faith deem to be in the best interest of the Company. The registration of these securities was effective on September 13, 2022.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 9 - STOCKHOLDERS EQUITY (Continued)\nCommon shares (continued)\nA summary of the status of the Companys warrants as of August 31, 2023 and 2022 is presented below.\nNumber of warrants\nOriginal shares issued\nAnti-dilution Adjusted\nWarrants as of August 31, 2021\n-\n-\nWarrants granted during the year\n50,000,000\n-\nWarrants as of August 31, 2022\n50,000,000\n-\nWarrants granted during the year\n-\n-\nExercisable as of August 31, 2023\n50,000,000\n-\nPreferred shares\nThe Company had the following activities for the year ended August 31, 2023:\nOn September 6, 2022, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 90,275 shares of Series C Convertible Preferred Stock of the Company for a gross proceed of $78,500. After deduction of transaction-related expenses, net proceed to the Company was $69,000. The Company intends to use the proceeds from the Preferred Stock for general working capital purposes.\nOn June 21, 2023, 1,436 shares of Series C Convertible Preferred Stock of the Company were waived by the accredited investor.\nThe Company recorded dividend expenses of $31,387 and $36,952 on Series C and D Preferred shares for the year ended August 31, 2023 and 2022, respectively.\nThe Company had the following equity activities during the year ended August 31, 2022:\nOn September 3, 2021, the Company entered into a securities purchase agreement with an accredited investor, whereby the investor purchased from the Company 234,300 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $203,500. The closing occurred on September 3, 2021. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $184,000.\nOn October 21, 2021, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 98,325 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $85,450. The closing occurred on October 21, 2021. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $75,390.\nDuring the quarter ended November 30, 2021, the Company issued 153 shares of series D preferred stock to an investor for the purchase price of $153,000. After the payment of transaction-related expenses, net proceeds to the Company from the issuance of the Series D Preferred Stock was $140,760.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 9 - STOCKHOLDERS EQUITY (Continued)\nPreferred shares (continued)\nOn December 9, 2021, the Company issued 34 shares of series D preferred stock to an investor for the purchase price of $34,000. After the payment of transaction-related expenses, net proceeds to the Company from the issuance of the Series D Preferred Stock was $31,280.\nOn January 21, 2022, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 89,490 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $78,035. The closing occurred on January 21, 2022. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $68,535.\nOn March 16, 2022, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 96,075 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $83,500. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $73,600.\nOn June 1, 2022, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 147,775 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $128,500. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $115,000.\nOn July 19, 2022, the Company entered into a securities purchase agreement with an accredited investor, whereby investor purchased from the Company 92,000 shares of Series C Convertible Preferred Stock of the Company for a purchase price of $80,000. After payment of transaction-related expenses, net proceeds to the Company from the sale and issuance of the Series C Preferred Stock totaled $70,380.\nThe Company recorded dividend expenses of $36,952 and $25,835 in connection with its preferred stocks for the years ended August 31 2022 and 2021, respectively. The Company also recorded a penalty expense of $141,945 which was in connection with the conversion of Series C preferred stocks due to the fact that the Company was late filing the Form 10-Q for the period ended February 28, 2022.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 10 - INCOME TAXES\nThe Company and its fully owned subsidiary, AB Cinemas NY, Inc, were incorporated in the United States and are subject to a statutory income tax rate at 21%. The Companys fully owned subsidiary, App Board Limited, was registered in Hong Kong and is subject to a statutory income tax rate at 16.5%.\nAs of August 31, 2023 and 2022, the components of net deferred tax assets, including a valuation allowance, were as follows:\nAugust 31, 2023 August 31, 2022\nDeferred tax asset attributable to:\nNet operating loss carry over $ 2,077,213 $ 1,328,204\nLess: valuation allowance (2,077,213 ) (1,328,204 )\nNet deferred tax asset $ - $ -\nThe valuation allowance for deferred tax assets was $2,077,213 and $1,328,204 as of August 31, 2023 and 2022, respectively. In assessing the recovery of the deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income in the periods in which those temporary differences become deductible. Management considers the scheduled reversals of future deferred tax assets, projected future taxable income, and tax planning strategies in making this assessment. As a result, management determined it was more likely than not the deferred tax assets would not be realized as of August 31, 2023 and 2022.\nReconciliation between the statutory rate and the effective tax rate is as follows for the years ended August 31, 2023 and 2022:\nYear ended\nAugust 31,\nFederal statutory tax rate 21 % 21 %\nChange in valuation allowance (21 %) (21 %)\nEffective tax rate 0 % 0 %\nFor the years ended August 31, 2023 and 2022, the Company and its subsidiaries incurred net losses. As a result, the Company and its subsidiaries did not incur any income tax for the years ended August 31, 2023 and 2022.\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 11 - CONCENTRATION RISK\nConcentration\nFor the year ended August 31, 2023, 47% and 17% of the total revenue were generated from two customers, respectively. For the year ended August 31, 2022, 70% and 26% of the total revenue were generated from two customers, including a related party. There were no accounts receivable balances as of August 31, 2023 and 2022.\nCredit risk\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist primarily of cash. The Hong Kong Deposit Protection Board pays compensation up to a limit of HKD 500,000 (approximately $64,000) if the bank with which an individual/a company hold its eligible deposit fails. As of August 31, 2023 and 2022, cash balance of $92,972 and $70,602, respectively, were maintained at financial institutions in Hong Kong, and were subject to credit risk. In the US, the insurance coverage of each bank is $250,000. As of August 31, 2023 and 2022, cash balance of $24,124 and $13,621, respectively, were maintained at financial institutions in the US. While management believes that these financial institutions are of high credit quality, it also continually monitors their creditworthiness.\nNOTE 12 - COMMITMENTS AND CONTINGENCIES\nContingencies\nFrom time to time, the Company may be involved in litigation relating to claims arising out of its operations in the normal course of business. There is no pending or threatened lawsuits that could reasonably be expected to have a material effect on the results of its operations and there are no proceedings in which any of the Companys directors, officers, or affiliates, or any registered or beneficial stockholder, is an adverse party or has a material interest adverse to the Companys interest.\nOperating leases\nThe Company has several lease agreements to rent office spaces and movie theatre with its related party and third-party vendors. (See Note 6)\nAB INTERNATIONAL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 13 - SEGMENT INFORMATION\nThe Company reports information about operating segments in accordance with ASC 280-10, Segment Reporting, which requires financial information to be reported based on the way management organizes segments within a company for making operating decisions and evaluating performance. As the result of business strategic changes, the Company has identified two reportable segments: Copyrights and license (IP) segment and cinema segment.\nThe following table presents summary information by segment for the years ended August 31, 2023 and 2022, respectively.\nNOTE 13 - SEGMENT INFORMATION - Segment Information\nIP Segment Cinema Segment Total\nYear ended Year ended Year ended\nAugust 31 August 31 August 31\n2022\nRevenue $ 948,000 $ 2,928,000 $ 525,222 $ - $ 1,473,222 $ 2,928,000\nOperating costs - - 243,635 - 243,635 -\nDepreciation and Amortization 3,052,613 3,262,799 - - 3,052,613 3,262,799\nInterest expense 9,578 - - 9,578\nSegment assets 2,598,255 5,839,217 23,825 - 2,622,080 5,839,217\nSegment income (loss) $ (3,720,974 ) $ (2,173,971 ) $ 154,264 $ - $ (3,566,710 ) $ (2,173,971 )\nNOTE 14 - SUBSEQUENT EVENTS\nIn accordance with ASC 855-10, the Company has analyzed its operations subsequent to the date these financial statements were issued.\nConversion of Series C preferred stock to common stock\nSubsequent to the year ended August 31, 2023, the Company issued total 1,056,681,936 common shares for the conversion of total 174,421 Series C preferred stock.\nReverse Stock split\nAs previously disclosed in the Companys Form 10-Q for the quarter ended May 31, 2023, on June 12, 2023, the Board of Directors approved a reverse split for the Companys issued and outstanding common stock, at a ratio of 1 share for every 10,000 shares, contingent upon receiving a market effectiveness date from FINRA.\nOn September 8, 2023, however, the Board of Directors decided to cancel the company's upcoming 10,000 to 1 reverse split. The Board of Directors decided it would not be in the best interest of the stockholders or the Company to execute a reverse split at this time. The Company informed FINRA that it will not be moving forward with the reverse split and wthdrew its application.\nInsurance of common shares\nOn October 5, 2023, the Board of Directors resolved to issue 225,000,000 shares of the Companys restricted common stock, par value $0.001 per share, to Chiyuan Deng, the Chief Executive Officer, as executive salaries. Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nAs required by Rule 13a-15 under the Securities Exchange Act of 1934, we have carried out an evaluation of the effectiveness of our disclosure controls and procedures as of the end of the period covered by this annual report, being August 31, 2023. This evaluation was carried out under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer.\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported, within the time periods specified in the Securities and Exchange Commissions rules and forms. Disclosure controls and procedures include controls and procedures designed to ensure that information required to be disclosed in our companys reports filed under the Securities Exchange Act of 1934 is accumulated and communicated to management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure.\nBased upon that evaluation, including our Chief Executive Officer and Chief Financial Officer, we have concluded that our disclosure controls and procedures were ineffective as of the end of the period covered by this annual report.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934). Management has assessed the effectiveness of our internal control over financial reporting as of August 31, 2023 based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. As a result of this assessment, management concluded that, as of August 31, 2023, our internal control over financial reporting was not effective. Our management identified the following material weaknesses in our internal control over financial reporting, which are indicative of many small companies with small staff: (i) inadequate segregation of duties and effective risk assessment; and (ii) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of both US GAAP and SEC guidelines.\nWe plan to take steps to enhance and improve the design of our internal control over financial reporting. During the period covered by this annual report on Form 10-K, we have not been able to remediate the material weaknesses identified above. To remediate such weaknesses, we hope to implement the following changes during our fiscal year ending August 31, 2024: (i) appoint additional qualified personnel to address inadequate segregation of duties and ineffective risk management; and (ii) adopt sufficient written policies and procedures for accounting and financial reporting. The remediation efforts set out in (i) and (ii) are largely dependent upon our securing additional financing to cover the costs of implementing the changes required. If we are unsuccessful in securing such funds, remediation efforts may be adversely affected in a material manner.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to an exemption for non-accelerated filers set forth in Section 989G of the Dodd-Frank Wall Street Reform and Consumer Protection Act.\nRemediation of Material Weakness\nWe are unable to remedy our controls related to the inadequate segregation of duties and ineffective risk management until we receive financing to hire additional employees.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in the Companys internal control over financial reporting during the year ended August 31, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nLimitations on the Effectiveness of Internal Controls\nOur management, including our Chief Executive Officer and our Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal control over financial reporting are or will be capable of preventing or detecting all errors or all fraud. Any control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. The design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Further, because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that misstatements, due to error or fraud will not occur or that all control issues and instances of fraud, if any, within the company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns may occur because of simple error or mistake. Controls can also be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of controls. The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Projections of any evaluation of controls effectiveness to future periods are subject to risk. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions That Prevent Inspections\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nOur current executive officer and director is as follows:\nName\nAge\nPosition\nChiyuan Deng\nChief Executive Officer, Principal Executive Officer\nChiyuan Deng\nMr. Deng is an investor, producer, and director of Chinese films. He has worked as Vice Chairman of the Guangdong Province Film and TV Production Industry Association and Vice Secretary General of the China City Image Project Advancement Committee. He has extensive investment and management experience in China, including in the areas of corporate development and business investment activities. Mr. Deng graduated from Guangzhou Broadcast TV University in 1987. Mr. Deng is Jianli Dengs father.\nMr. Deng does not hold and has not held over the past five years any other directorships in any company with a class of securities registered pursuant to Section 12 of the Exchange Act or subject to the requirements of Section 15(d) of the Exchange Act or any company registered as an investment company under the Investment Company Act of 1940.\nOther Significant Employees\nOther than our executive officer, we do not currently have any significant employees.\nTerm of Office\nOur directors are appointed for a one-year term to hold office until the next annual general meeting of our shareholders or until removed from office in accordance with our bylaws. Our officers are appointed by our board of directors and hold office until removed by the board, subject to their respective employment agreements.\nFamily Relationships\nNone.\nInvolvement in Certain Legal Proceedings\nDuring the past 10 years, none of our current executive officers, nominees for directors, or current directors have been involved in any legal proceeding identified in Item 401(f) of Regulation S-K, including:\n1. Any petition under the Federal bankruptcy laws or any state insolvency law filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he or she was a general partner at or within two years before the time of such filing, or any corporation or business association of which he or she was an executive officer at or within two years before the time of such filing;\n2. Any conviction in a criminal proceeding or being named a subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. Being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him or her from, or otherwise limiting, the following activities:\ni. Acting as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\nii. Engaging in any type of business practice; or\niii. Engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n4. Being subject to any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any type of business regulated by the Commodity Futures Trading Commission, securities, investment, insurance or banking activities, or to be associated with persons engaged in any such activity;\n5. Being found by a court of competent jurisdiction in a civil action or by the SEC to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6. Being found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7. Being subject to, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\ni. Any Federal or State securities or commodities law or regulation; or\nii. Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\niii. Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8. Being subject to, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nAudit Committee\nThe Board of Directors established an audit committee to assist the Board of Directors in the execution of its responsibilities. Our audit committee, under its charter, is to be comprised solely of non-employee, independent directors as defined by NYSE American market listing standards.\nThe Audit Committee was established in October of 2019. As of the year ended August 31, 2023, we only have one director, which has effectively ceased the work of the Audit Committee.\nFor the fiscal year ending August 31, 2023, the Audit Committee did not complete its tasks due to the lack of membership on the committee. Instead, the sole member of the board authorized inclusion of the audited financial statements for the years ended August 31, 2023 and 2022 to be included in this Annual Report.\nCompliance with Section 16(a) Of the Exchange Act\nSection 16(a) of the Exchange Act requires our directors and executive officers and persons who beneficially own more than ten percent of a registered class of the Companys equity securities to file with the SEC initial reports of ownership and reports of changes in ownership of common stock and other equity securities of the Company. Officers, directors and greater than ten percent beneficial shareholders are required by SEC regulations to furnish us with copies of all Section 16(a) forms they file. To the best of our knowledge based solely on a review of Forms 3, 4, and 5 (and any amendments thereof) received by us during or with respect to the year ended August 31, 2023, there have been no late reports, failures to file or transactions not timely reported.\nCode of Ethics\nWe have adopted a Corporate Code of Business Conduct and Ethics and Financial Code of Ethics. These are attached as exhibits to our Annual Report for the year ended August 31, 2019. Item 11. Executive Compensation\nThe table below summarizes all compensation awarded to, earned by, or paid to our former or current executive officers for the fiscal years ended August 31, 2023 and 2022.\nSUMMARY COMPENSATION TABLE\nName\nand\nprincipal\nposition\nYear Salary($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nNonqualified\nDeferred\nCompensation\nEarnings ($)\nAll Other\nCompensation\n($)\nTotal\n($)\nChiyuan Deng President,\nCEO\n180,000\n180,000\n50,000\n138,000\n6,750\n180,000\n374,750\nJimmy Chue\nFormer Chief Investment Officer\n32,446\n78,000\n76,473\n32,446\n154,473\nJianli Deng\nFormer CFO and Director\n18,113\n4,000\n2,250\n18,113\n6,250\nBrandy Gao, Former Chief Financial Officer\n15,000\n15,000\nVella Deng, Former Chief Financial Officer\n12,000\n4,000\n16,000\nOn July 30, 2018, we entered into an employment agreement with Chiyuan Deng to serve as our President. The agreement is for six years and we issued Mr. Deng 400,000 shares for his services. Under the agreement, Mr. Deng is eligible for a bonus if provided by the board, vacation, medical, insurance and other benefits.\nOn February 22, 2021, we entered into an employment agreement with Jimmy Chue to serve as Chief Investment Officer (CIO). The CIO will be compensated with an annual base salary of $78,000. On May 9, 2023 , Jimmy Chue resigned as our CIO.\nOn December 31, 2021, Brandy Gao resigned as Chief Financial Officer of the Company. On December 31, 2021, our board of directors appointed Vella Deng as our Chief Financial Officer. On June 24, 2022, Vella Deng resigned as our Chief Financial Officer. On June 24, 2022, our board of directors appointed Jianli Deng as our Chief Financial Officer and a member of our board of directors.\nOn September 11, 2020 and May 24, 2022, the Company entered into two amended employment agreements with Chiyuan Deng, the Chief Executive Officer. Pursuant the amended agreements, the Company amended the compensation to Mr. Deng to include a salary of $180,000 annually, a reduction in common stock received under his initial employment agreement, a potential for a bonus in cash or shares, and the issuance of 100,000 shares of Series A Preferred Stock at par value $0.001. Mr. Deng returned 266,667 shares common stock to the Company received under his initial employment agreement.\nOn June 24, 2022, our board of directors appointed Jianli Deng as our Chief Financial Officer and a member of our board of directors. The Chief Financial Officer will be compensated with an annual base salary of $24,000. On May 9, 2023 , Jianli Deng resigned as our Chief Financial Officer.\nOn October 5, 2023, the Board of Directors resolved to issue 225,000,000 shares of the Companys restricted common stock, par value $0.001 per share, to Chiyuan Deng, the Chief Executive Officer, as executive salaries.\nOn November 15, 2023, the Company announced that as part of its efforts to mitigate the financial impact on the Company, the Companys sole officer and director, Mr. Chiyuan Deng, has agreed to reductions in his employment compensation.\nEffective as of October 2023, Mr. Deng has agreed to forego his $180,000 yearly salary and other benefits allowed for under his employment agreement, as amended with the Company, until such fees and benefits are reinstated by the Companys board of directors.\nOnce the Company is in a better position financially and profitable, the Company and Mr. Deng plan to amend the employment agreement with changes to Mr. Dengs compensation structure designed to incentivize the Companys CEO to achieve and maintain profitability.\nOUTSTANDING EQUITY AWARDS AT FISCAL YEAR-END\nOPTION AWARDS STOCK AWARDS\nName Number of Securities Underlying Unexercised Options (#) Exercisable Number of Securities Underlying Unexercised Options (#) Unexercisable Equity Incentive Plan Awards: Number of Securities Underlying Unexercised Unearned Options (#) Option Exercise Price ($) Option Expiration Date Number of Shares or Units of Stock That Have Not Vested (#) Market Value of Shares or Units\nof Stock That Have Not Vested ($)\nEquity Incentive Plan Awards: Number of Unearned Shares, Units or Other Rights That Have\nNot Vested (#)\nEquity Incentive Plan Awards: Market or Payout Value of Unearned Shares, Units or Other Rights That Have Not Vested (#)\nChiyuan Deng - - - - - - - - -\nJianli Deng - - - - - - - - -\nJimmy Chue - - - - - - - - -\nDirector Compensation\nOn September 29, 2020, our board of directors approved a change in director compensation from shares to cash compensation.\nFor the year 2019-2020, the Board of Directors approved of the payment of US$9,000 as the fee for each Director.\nFor the year 2020-2021, the Board of Directors approved of the payment of US$9,000 as the fee for each Director.\nFor the year 2021-2022, the Board of Directors approved of the payment of US$9,000 as the fee for each Director.\nFor the year 2022-2023, the Board of Directors approved of the payment of US$9,000 as the fee for each Director. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth, as of November 28, 2023, certain information as to shares of our common stock owned by (i) each person known by us to beneficially own more than 5% of our outstanding common stock, (ii) each of our directors, and (iii) all of our executive officers and directors as a group. Unless otherwise stated, the address for each beneficial owner is at 144 Main Street, Mt. Kisco, NY 10549.\nCommon Stock\nSeries A Preferred Stock\nName and Address of Beneficial Owner\nNumber of Shares Owned\nPercent of Class(1)(2)\nNumber of Shares Owned\nPercent of Class(1)(2)\nChiyuan Deng(3)\n261,620,400\n10%\n100,000\n100%\nAll Directors and Executive Officers as a Group (1 person)\n261,620,400\n10%\n100,000\n100%\n5% Holders\nNone\n-\n-\n(1) Unless otherwise indicated, each person or entity named in the table has sole voting power and investment power (or shares that power with that persons spouse) with respect to all shares of voting stock listed as owned by that person or entity.\n(2) Pursuant to Rules 13d-3 and 13d-5 of the Exchange Act, beneficial ownership includes any shares as to which a shareholder has sole or shared voting power or investment power, and also any shares which the shareholder has the right to acquire within 60 days, including upon exercise of common shares purchase options or warrants. The percent of class is based on 2,567,226,432 shares of common stock issued and outstanding, 100,000 shares of Series A Preferred Stock issued and outstanding and 20,000 shares of Series B Preferred Stock issued and outstanding, as of November 28, 2023.\n(3) Includes 238,020,400 shares held in his name, 2,100,000 shares held in Zestv Features Ltd in which he has voting and disposition authority, 1,400,000 shares held in Bonus Media Investment Limited in which he has voting and disposition authority, 100,000 shares which may be acquired from converting 100,000 Series A shares, and 20,000,000 shares that may be acquired from converting 20,000 shares of Series B Preferred Stock. Item 13. Certain Relationships and Related Transactions, and Director Independence\nExcept as provided in Description of Business and Executive Compensation set forth above, and the related party transactions disclosed in Note 12 of the Companys consolidated financial statements for the years ended August 31, 2023, for the past two fiscal years there have not been, and there is not currently proposed, any other transaction or series of similar transactions to which we were or will be a participant in which the amount involved exceeded or will exceed the lesser of $120,000 or one percent of the average of our total assets at year-end for the last two completed fiscal years, and in which any director, executive officer, holder of 5% or more of any class of our capital stock or any member of the immediate family of any of the foregoing persons had or will have a direct or indirect material interest.\nLoan from related parties\nIn support of the Companys efforts and cash requirements, it may rely on advances from stockholders until such time that the Company can support its operations or attains adequate financing through sales of its equity or traditional debt financing. On June 1, 2023, Chiyuan Deng, the Chief Executive Officer, as the Company stockholders, entered into a line of credit agreement with the Company. Chiyuan Deng agreed to provide a line of credit to the Company for a total amount of no more than $1,500,000, including the previous shareholder loan balance of $697,281. The amount under this line of credit is non-interest bearing and due on demand starting from June 1, 2023. The Company has recognized an imputed interest at 5% per annum of the balances as of the year ended August 31, 2023. As of August 31, 2023 and 2022, the Company had loan from Chiyuan Deng balance of $748,285 and $144,516.\nJianli Deng, the former Chief Financial Officer, as the Companys stockholders, make advances periodically to the Company for working capital purpose. These loans are non-interest bearing and due on demand. The amount due to Jianli Deng was fully settled on May 16, 2023. As of August 31, 2023 and 2022, the Company had loan from Jianli Deng balance of $nil and $232,882.\nAccounts payable and accrued liabilities - related party - Youall Perform Services Ltd.\nYouall Perform Services Ltd is owned by Jianli Deng, the former Chief Financial Officer. In September 2019, the Company entered into an agreement with Youall Perform Services Ltd for two transactions. 1) The Company pays Youall Perform Services Ltd. 10% of the revenue generated from the Ai Bian Quan Qiu platform every month to reimburse the valued-added tax, tax surcharges, and foreign transaction fee Youall Perform Services Ltd. has been paying on behalf of the Company. 2) Youall Perform Services Ltd. will provide IT consulting service for Ai Bian Quan Qiu platform upgrade and maintenance at a total cost of $128,000, out of which $108,800 has been paid. As there has been no revenue from the Ai Bian Quan Qiu platform due to COVID-19 since mid-January, 2020, $108,800 prepayment was expensed as research and development expense in FY2020. In July 2020, the Company changed the service scope of this agreement and turned it into a two-year website maintenance contract to maintain the website ABQQ.TV which was launched on December 29, 2020. The website maintenance service began on January 1, 2021 and will end on December 31, 2022. The contract amount remains to be $128,000, out of which $108,800 was previously paid and $19,200 was scheduled to be due on the twenty first month of service term. During the year ended August 31, 2023, the Company made payment of $12,812 with the accounts payable - related party balance to Youall Perform Services Ltd of $6,388 as of August 31, 2023.\nAccounts payable and accrued liabilities - related party - Zestv Studios Limited\nOn December 1, 2020, the Company entered an agreement with Zestv Studios Limited, a Hong Kong entity 100% owned by Chiyuan Deng, the Chief Executive Officer, to grant Zestv Studios Limited the distribution right for the movie Love over the world and charge Zestv Studios Limited movie royalties. The Companys royalty revenue is stipulated to equal 43% of the after-tax movie box office revenue deducting movie issuance costs. The movie box office revenue is tracked by a movie distributor Huaxia Film Distribution Co. Ltd (hereafter Hua Xia) in China as it connects with all movie theaters in China and can track the total movie box office revenue online in real time. Although Zestv Studios Limited has paid royalty revenue to the Company, Zestv Studios Limited failed to collect cash from Hua Xia. As of August 31, 2021, the Company had refund payable of $916,922 for the movie royalty revenue net of the movie distribution commission fee to Zestv Studios Limited.\nAccounts payable and accrued liabilities - related party - Zestv Studios Limited (continued)\nOn June 23, 2022, the Company sold the mainland China copyright and broadcast right of the movie Too Simple to Zestv Studios Limited for a price of $750,000. The Company remains to have all copyright of outside of mainland China. The Company used this proceed to off-set the refund payable balance to Zestv Studios Limited with additional payment of $151,795 during the year ended August 31, 2022. The Company made payments of $15,127 during the year ended August 31, 2023.\nAs of August 31, 2023 and 2022, the Company had balance of $nil and $15,127 payable to Zestv Studios Limited, respectively.\nThe Company also rented an office space from Zestv Studios Limited. The lease was early terminated on August 31, 2023 (See Note 6). For the years ended August 31, 2023 and 2022, the Company incurred related party office rent expense of $66,048 and $66,048 respectively.\nExecutives salaries\nOn September 11, 2020 and May 24, 2022, the Company entered into two amended employment agreements with Chiyuan Deng, the Chief Executive Officer. Pursuant the amended agreements, the Company amended the compensation to Mr. Deng to include a salary of $180,000 annually, a reduction in common stock received under his initial employment agreement, a potential for a bonus in cash or shares, and the issuance of 100,000 shares of Series A Preferred Stock at par value $0.001. Mr. Deng returned 266,667 shares common stock to the Company received under his initial employment agreement.\nFor the years ended August 31, 2023 and 2022, the Company incurred total compensation of $198,113 and $393,165, respectively, for Chief Executive Officer and Chief Financial Officer. The Company also incurred total compensation of $32,446 and $154,473, respectively, for Chief Investment Officer for the year ended August 31, 2023 and 2022. Item 14. Principal Accounting Fees and Services\nBelow is the table of audit fees billed by our auditors in connection with the audits of the Companys annual financial statements for the years ended:\nFinancial Statements for the\nYear Ended August 31\nAudit Services\nAudit Related Fees\nTax Fees\nOther Fees\nPrager Metis CPAs: $180,000\n$180,000\n$\n$\n$\nRotenbergMeril, CPAs: $58,656\nYu Certified Public\nAccountant PC: $30,000\nPrager Metis CPAs: $50,000\n$138,656\n$\n$\n$\nPART IV Item 15. Exhibits, Financial Statements Schedules\n(a) Financial Statements and Schedules\nThe following financial statements and schedules listed below are included in this Form 10-K.\nFinancial Statements (See Item 8)\nIncorporated by\nReference\nFiled or\nFurnished\nExhibit Number\nExhibit Description\nForm\nExhibit\nFiling Date\nHerewith\n3.1\nArticles of Incorporation\nS-1\n3.1\n10/10/14\n3.2\nBylaws\nS-1\n3.2\n10/10/14\n3.3\nCertificate of Amendment\n8-K\n3.1\n6/7/18\n3.4\nCertificate of Change\n8-K\n3.1\n6/18/19\n4.1\nConvertible Promissory Note\n8-K\n4.1\n11/21/19\n4.2\nConvertible Debenture\n8-K\n4.1\n12/18/19\n.\n4.3\nCommon Stock Purchase Warrant\n8-K\n4.2\n12/18/19\n4.4\nConvertible Promissory Note\n8-K\n4.1\n1/10/20\n4.5\nConvertible Promissory Note\n8-K\n4.2\n1/10/20\n4.6\n10% Convertible Note\n8-K\n4.1\n2/21/20\n4.7\n10% Convertible Note\n8-K\n4.2\n2/21/20\n4.8\nConvertible Promissory Note\n8-K\n4.1\n3/18/20\n4.9\nCommon Stock Purchase Warrant\n8-K\n10.1\n3/18/20\n4.10\n10% Convertible Note\n8-K\n4.1\n7/23/20\n4.11\nConvertible Promissory Note\n8-K\n4.1\n7/28/20\n4.12\nCommon Stock Purchase Warrant\n8-K\n4.1\n8.3.20\n4.13\nConvertible Promissory Note\n8-K\n4.1\n8/24/2020\n4.14\nConvertible Promissory Note\n8-K\n4.1\n9/4/20\n4.15\nConvertible Promissory Note\n8-K\n4.2\n9/4/20\n4.16\nConvertible Promissory Note\n8-K\n4.1\n10/15/20\n4.17\nCommon Stock Purchase Warrant\n8-K\n4.1\n8/2/22\n4.18\nDescription of Registrants Securities\nS-1\nn/a\n8/4/22\n10.1\nPatent License Agreement\n8-K\n10.1\n6/6/17\n10.2\nAgreement for Termination and Release\n8-K\n10.1\n11/1/18\n10.3\nChief Marketing Officer Employment Agreement\n8-K\n10.1\n2/11/19\n10.4\nChief Operating Officer Employment Agreement\n8-K\n10.1\n2/11/19\n10.5\nSecurities Purchase Agreement\n8-K\n10.1\n11/21/19\n10.6\nSecurities Purchase Agreement\n8-K\n10.1\n12/18/19\n10.7\nSecurities Purchase Agreement\n8-K\n10.1\n1/10/20\n10.8\nSecurities Purchase Agreement\n8-K\n10.2\n1/10/20\n10.9\nSecurities Purchase Agreement\n8-K\n10.1\n2/21/20\n10.10\nSecurities Purchase Agreement\n8-K\n10.2\n2/21/20\n10.11\nSecurities Purchase Agreement\n8-K\n4.2\n3/18/20\n10.12\nSecurities Purchase Agreement\n8-K\n10.1\n7/23/20\n10.13\nSecurities Purchase Agreement\n8-K\n10.1\n7/28/20\n10.14\nEquity Purchase Agreement\n8-K\n10.1\n8/3/20\n10.15\nRegistration Rights Agreement\n8-K\n10.2\n8/3/20\n10.16\nSecurities Purchase Agreement\n8-K\n10.1\n8/24/20\n10.17\nSeparation Agreement and Release with Jianli Deng, dated August 29, 2020\n8-K\n10.1\n9/1/20\n10.18\nSeparation Agreement and Release with Lijun Yu, dated August 29, 2020\n8-K\n10.2\n9/1/20\n10.19\nSeparation Agreement and Release with Linqing Ye, dated August 29, 2020\n8-K\n10.3\n9/1/20\n10.20\nSecurities Purchase Agreement\n8-K\n10.1\n9/4/20\n10.21\nSecurities Purchase Agreement\n8-K\n10.2\n9/4/20\n10.22\nSecurities Purchase Agreement\n8-K\n10.1\n10/15/20\n10.23\nSecurities Purchase Agreement\n8-K\n10.1\n10/20/20\n10.24\nTermination and Release Agreement\n8-K\n10.1\n11/25/20\n10.25\nTermination and Release Agreement\n8-K\n10.1\n12/1/20\n10.26\nSeries C Preferred Stock Purchase Agreement\n8-K\n10.1\n1/29/21\n10.27\nEmployment Agreement\n8-K\n10.1\n2/24/21\n10.28\nSeries C Preferred Stock Purchase Agreement\n8-K\n10.1\n3/2/21\n10.29\nSeries C Preferred Stock Purchase Agreement\n8-K\n10.1\n11/3/21\n10.30\nLease Agreement\n8-K\n10.1\n11/2/21\n10.31\nSeries C Preferred Stock Purchase Agreement\n8-K\n10.1\n9/13/21\n10.32\nSeries C Preferred Stock Purchase Agreement\n8-K\n10.1\n1/28/22\n10.33\nSeries C Preferred Stock Purchase Agreement\n8-K\n10.1\n3/21/22\n10.34\nAmendment to Employment Agreement\n8-K\n10.1\n5/24/22\n10.35\nSeries C Preferred Stock Purchase Agreement\n8-K\n10.1\n6/17/22\n10.36\nSeries C Preferred Stock Purchase Agreement\n8-K\n10.1\n8/1/22\n10.37\nCommon Stock Purchase Agreement\n8-K\n10.1\n8/2/22\n31.1\nCertification of Chief Executive Officer pursuant to Securities Exchange Act Rule 13a-14(a)/15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n31.2\nCertification of Chief Financial Officer pursuant to Securities Exchange Act Rule 13a-14(a)/15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n32.1\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101 INS*\nInline XBLR Instance Document\n101 SCH*\nInline XBLR Taxonomy Extension\nSchema Document\n101 CAL*\nInline XBRL Taxonomy Extension\nCalculation Linkbase Document\n101 LAB*\nInline XBRL Taxonomy Extension Label\nLinkbase Document\n101 PRE*\nInline XBRL Taxonomy Extension\nPresentation Linkbase Document\n101 DEF*\nInline XBRL Taxonomy Extension\nDefinition Linkbase Document\n104*\nCover Page Interactive Data File\n(formatted as Inline XBRL and contained\nin Exhibit 101 attachments)\n* These certifications are being furnished solely to accompany this quarterly report pursuant to 18 U.S.C. Section\n1350, and are not being filed for purposes of Section 18 of the Securities Exchange Act of 1934 and are not to be incorporated by reference into any filing of the Registrant, whether made before or after the date hereof, regardless of any general incorporation language in such filing.\nItem 16. Form 10-K Summary\nNone\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAB International Group Corp.\nDATE\nSIGNATURE\nTITLE\nNovember 29, 2023\n/s/ Chiyuan Deng\nChief Executive Officer, Chief Financial Officer and Director\nChiyuan Deng\n(Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer)\nIn accordance with Section 13 or 15(d) of the Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nDATE\nSIGNATURE\nTITLE\nNovember 29, 2023\n/s/ Chiyuan Deng\nChief Executive Officer, Chief Financial Officer and Director\nChiyuan Deng\n(Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer)"
}