{
    "cik": "1610718",
    "company": "Outdoor Specialty Products, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-21",
    "period_of_report": "2022-09-30",
    "sic": "3949",
    "state_of_inc": "UT",
    "state_location": "UT",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1610718/0001213900-22-081765-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1610718/000121390022081765/f10k2022_outdoorspec.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1610718/0001213900-22-081765.txt",
    "filename": "1610718_10K_2022_0001213900-22-081765.htm",
    "content": "Item 1. Business\nCorporate History\nOutdoor Specialty Products, Inc. (the Company, we, or us) was originally incorporated in the state of Utah on January 31, 2014, and changed its domicile to the state of Nevada on February 24, 2021. The Company is and has since its inception been engaged in the business of developing, selling, and marketing products in niche markets within the specialty outdoor products marketplace. We introduced our proprietary Reel Guard product in 2014 and continue to offer it for sale. We license the rights to our SLINKOR product pursuant to a license agreement entered into with the inventor in May 2021. We intend to commence manufacturing, marketing, and selling our SLINKOR product following completion of our redesign of the product to change the sinking weight to a material other than lead and utilize molds to permit increased production. We have no subsidiaries.\nThe Reel Guard\nThe Reel Guard is designed to protect fishing reels from scratching, scuffing, dents, and other damage due to dropping, resting on gravel while servicing the line, being transported with other fishing and outdoor equipment, and general wear and tear. To date, the primary application for the Reel Guard has been fly fishing reels, but we believe the Reel Guard may also be suitable for use with some deep-sea fishing reels. The Reel Guard consists of a thin, rubberized material that is attached to the outer edges of a fishing reel using special adhesive strips that hold the material in place but provide for easy removal with no damage to the reel. The Reel Guard is designed for reels with up to a 4.25-inch diameter that have square to slightly rounded edges, and the custom installation procedure makes the Reel Guard suitable for a variety of different reels. The Reel Guard was invented by Kirk Blosch, the Companys founder and president, in 2014 to fill a need that he believed was not being met by existing products. We filed for and obtained a provisional patent for the Reel Guard in 2014 under the name Reel Bumper Guard and U.S. Patent No. 9,872,485 for the device was issued on January 23, 2018. During 2021, we paid the first (fourth year) maintenance fee for the Reel Guard patent in the amount of $985 to prevent the patent from lapsing. The next maintenance fee will be due on or before July 23, 2025.\nThe SLINKOR\nWe entered into a License and Royalty Agreement (the License Agreement), dated as of May 4, 2021, with Stephen Smith (the Licensor), for another fishing product referred to as the SLINKOR. The SLINKOR is a slow sinking fishing sinker comprised of a smooth, egg-shaped piece of pre-molded foam with lead weights compressed into each end using a guide wire that aligns the weights and allows a fishing line to be threaded through the product. The buoyancy of the foam coupled with the calibrated weight of the lead and the movement of the water causes the SLINKOR to sink slowly to the bottom of a lake or river allowing the fisherman to control the desired depth for the bait. The SLINKOR is designed for use with flies, spinners, flatfish, and other types of bait and the weight of the SLINKOR permits the fisherman to make longer casts. The smooth egg shape of the SLINKOR is designed to let it slide along the bottom of the lake or river while resting on top of moss or bouncing over rocks and greatly reducing snags. The device permits a fisherman to run his line through the SLINKOR, attach a swivel, and run 18 to 30 inches of leader from the swivel to the bait based on the current water conditions, the desired depth, and the presence or absence of moss, rocks, and other obstacles. We anticipate that the SLINKOR will be available in two sizes; the large SLINKOR will be 2 inches long and 1 ¼ inches wide and the small SLINKOR will be 1 ¼ inches long by 1 ¼ inches wide.\nThe License Agreement generally grants us the non-exclusive, world-wide right to use and apply the SLINKOR technology and any intellectual property rights thereto and to make, have made, use, lease, sell, market, or otherwise dispose of the SLINKOR in all markets throughout the world, and the exclusive right to market, sell or otherwise dispose of the SLINKOR in e-commerce markets throughout the world. The License Agreement reserves to the Licensor the non-exclusive right to continue to manufacture and sell the SLINKOR in stores, at trade shows, and in other brick and mortar physical locations and to purchase completed SLINKOR products from us (to the extent available) at our cost plus 10%. In consideration for the rights granted under the License Agreement, we paid the Licensor a one-time license fee in the amount of $500 and agreed to pay the Licensor the following royalties based on our net revenue from sales of the SLINKOR: (i) 20% of net revenue from product sales up to $1 Million, (ii) 15% of net revenue from product sales between $1 Million and $3 Million, and (iii) 10% of net revenue from product sales in excess of $3 Million. We are required to make minimum royalty payments of $1,000 per year to maintain the exclusive nature of the license and prevent it from reverting to a non-exclusive license. During the 2022 year, we paid royalties in the minimum amount of $1,000. This summary description of the License Agreement is qualified in its entirety by reference to the License Agreement, a copy of which is filed as an exhibit to this report.\nWe have postponed the production of the SLINKOR product while we attempt to redesign it to replace the lead weight incorporated in the pre-molded foam ball with a weight made from a non-lead material and to implement a more automated manufacturing process. Over the past several years, there has been an increasing trend by various states to ban the use of lead weights, split shot, and lead-based lures due to potential lead poisoning and damage to waterfowl, other aquatic animals, soil, and water. We believe that lead fishing products are now banned in New Hampshire, New York, Maine, Massachusetts, Vermont, and Washington and that the trend will continue. Our decision to try and move away from the lead weight is motivated by our desire to be a good public citizen by not manufacturing a product that may be harmful to the environment and our belief that lead shot will be outlawed in more locations over the coming years and that it will continue to become more expensive and more difficult to source. We are investigating the replacement of the lead core with a type of steel or resin that would perform in a substantially equivalent manner to the lead shot. We are also investigating the use of two molded capsules for the product, with one capsule housing the weight material and the second housing the first capsule. The use of molds would allow us to accelerate the manufacturing process, which we anticipate would increase production capacity and reduce costs as compared to the manual manufacturing process currently used by the Licensor. No assurances can be given that we will locate a suitable alternative to the lead weight or that any substitute we select will perform as anticipated. We do not plan to commence the manufacturing of the SLINKOR until the redesign has been completed and additional debt or equity funding has been received.\nManufacturing\nWe own our custom injection mold for the Reel Guard, and we contract with a third party to manufacture the Reel Guard in minimum lots of 1,000 on an as needed basis. The adhesive strips used to attach the Reel Guard to the reel are manufactured by a national adhesives manufacturing company and custom ordered in pre-cut lengths from a local distributor in minimum lots of 1,000. We contract with another third party to print the Reel Guard product information card and package the Reel Guard product in sale-ready packages. Our Reel Guard inventory consists of both the raw material adhesive strips and the finished, packaged product units. For the years ended September 30, 2022 and 2021, respectively, we had on hand $2,042 and $2,088 in finished goods and $2,596 and $2,596 in raw materials.\nAs discussed above, the production of the SLINKOR has been postponed pending a redesign of the product, which may change the raw materials utilized and provide for the creation of molds to accelerate the production process. We plan to use our existing printing and packaging contractor to print the SLINKOR product information and package the SLINKOR in sale-ready packages.\nWe maintain an inventory of products which we believe is sufficient to meet demand. If we should underestimate sales and fail to timely manufacture additional quantities of our products, we could face delays in providing our products to our customers which could have a negative effect on our reputation and result in a decline in our product sales. If we should overestimate sales, we will have invested our capital in products that remain in inventory, which will have a negative effect on our financial condition and results of operations. No assurances can be given that we will be able to accurately predict sales and maintain an optimal level of inventory in our system.\nAlthough we have purchased substantially all inventories from one supplier and have been dependent on this supplier for all inventory purchases since we commenced operations, we believe the raw materials for both the Reel Guard and the SLINKOR are available for purchase from several different sources in the open market. We also believe there are several other manufacturing, printing, and packaging services capable of performing the services provided by our current contractors at competitive prices. Our ability to timely obtain raw materials and finished goods may be affected by events beyond our control, such as the inability of suppliers to timely deliver materials due to work stoppages or slowdowns, or significant weather and health conditions (such as COVID-19). Any adverse change in our supply chain and manufacturing, such as our relationship with our third-party contractors, the financial condition of such contractors, and their ability to provide supplies and services to us on a timely basis could have a material adverse effect on our business, results of operations, and financial condition.\nMarketing / Shipping\nWe currently market and sell the Reel Guard through our website at outdoorspecialtyproducts.com, where we also provide access to marketing materials, instructional videos, and installation instructions. We also list the Reel Guard for sale on eBay. To date we have sold the Reel Guard to residents of approximately 25 states and have made one sale outside the U.S. to a resident of Hungary.\nWhen the redesign of the SLINKOR has been completed, we intend to market it on our website and to expand our website to include marketing materials and SLINKOR instructional videos created by the Licensor.\nWe believe our business is affected by seasonality, which historically has resulted in higher sales volume during the spring and summer months.\nWe currently only accept PayPal as the method of payment for our products that are sold on our website and eBays payment processing for our products that are sold on eBay. Our products are shipped via U.S. Mail promptly following confirmation from PayPal that payment for an order has been received. Shipping is included in the product price and a customer pays no additional shipping charges.\nOther Products\nWe have taken initial steps toward the development of a what we believe to be a unique fishing rod product that involves the ability to attach different upper fly rod portions of varying lengths and weights to a single rod butt handle that results in a light weight, multi-purpose fly rod. We have conducted preliminary research regarding the patentability of the proposed product and believe we may be able to obtain patent protection for the product, although no assurances can be given that the product will be developed or that patent protection will be obtained. We have halted our efforts regarding the development of this new product until such time as we have sufficient capital on hand to proceed with its development.\nWe were formed with the belief that there is an underserved marketplace in the outdoor sporting goods space which can be exploited from multiple fronts. In addition to the Reel Guard and the SLINKOR, we intend to investigate opportunities to develop additional products and to market third party products in the outdoor sporting goods space on our website.\nIntellectual Property\nWe hold a U.S. patent on our Reel Guard. We do not hold patents on any other products, and we do not currently hold any trademarks. No assurance can be given that our patent will provide sufficient protection against potential competitors and we may be unable to successfully assert our intellectual property rights, or these rights may be invalidated, circumvented, or challenged. Any such inability or a successful intellectual property challenge or infringement proceeding against us, could have a material adverse effect on our business.\nFacilities\nOur operations are currently conducted from at the residence of our president. Our facilities are furnished to us at no cost and consist of the shared use of approximately 500 square feet of office space and assembly/storage space. In connection with the commencement of manufacturing of the SLINKOR, we may investigate the desirability of leasing a small assembly, storage, and office space from a third party.\nCompetition\nThe outdoor specialty products industry is intensely competitive with respect to price, quality, features, and durability, and it is often difficult to entice customers to try a new product. Many of our competitors are well-established companies with name brand recognition and almost all our competitors have substantially greater financial and other resources than do we. Such competitors include many national and regional companies and most of our competitors have been in existence for a substantially longer period than have we and are better established. As such, there can be no assurance that we will be able to compete effectively in our chosen market. In addition, a change in the pricing, marketing, or promotional strategies or product mix of one or more of these competitors could have a material adverse impact on our sales and earnings.\nGovernment Regulation\nOur operations are subject to numerous federal, state, and local government regulations. The failure to comply with such requirements or increase in the cost of compliance could adversely affect our operations. We are also subject to federal and state environmental regulations, but these have not had a material effect on our operations to date. Our operations are also subject to federal and state laws governing such matters as wages, working conditions, citizenship requirements, and overtime.\nEmployees and Consultants\nWe do not currently have any employees other than our founder and president. The loss of our president, would have a material adverse impact on our business and there is no assurance that we could locate a qualified replacement. We have not entered into an employment agreement with our president and we do not carry key man life insurance on his life.\nFinancing\nFollowing our incorporation in 2014, we completed the private placement of 285,714 shares of our common stock to accredited investors in a private placement at a price of $0.35 per share for total proceeds of $100,011. The proceeds from the private placement together with our limited product sales were sufficient to fund our operations through our fiscal year ended September 30, 2020. On January 4, 2021, we entered into a revolving promissory note agreement with our president and principal stockholder that provided for total loans of up to $40,000 at an interest rate 3.5% per annum, which was repayable on or before December 31, 2021. During December 2021, we amended the revolving promissory note agreement to extend the maturity date to June 30, 2022, and during June 2022, we further amended the agreement to increase the maximum principal indebtedness to $55,200 and extend the maturity date to December 31, 2022. During December 2021, we entered into a revolving promissory note agreement with another principal stockholder which provided for loans of up to $7,000 at an interest rate of 3.5% per annum, which was repayable on or before June 30, 2022. During June 2022, we amended this agreement to increase the maximum principal indebtedness to $9,750 and extend the maturity date to December 31, 2022. We received proceeds under the revolving loan agreements of $30,519 during the year ended September 30, 2022, resulting in a principal balance of $60,769, with accrued interest of $2,088, at September 30, 2022. During November 2022, we amended the revolving promissory note agreements to extend the maturity dates to December 31, 2023 and increase the maximum principal amount of the note agreement with our president and the other principal stockholder to $75,000 and $13,240, respectively. Item 1A. Risk Factors\nNot Applicable. The Company is a smaller reporting company. Item 1B. Unresolved Staff Comments.\nNot Applicable. The Company is a smaller reporting company. Item 2. Properties.\nOur principal office is located at the residence of our President, Kirk Blosch, 3842 Quail Hollow Drive, Salt Lake City, UT 84109, and such space is provided to us on a rent-free basis. We believe our office facilities are sufficient for the foreseeable future, although at the time we commence manufacturing of the SLINKOR we may investigate the desirability of leasing a small assembly, storage, and office space from a third party. Item 3. Legal Proceedings.\nThe Company is not a party to any material legal proceedings, and to our knowledge, no such legal proceedings have been threatened against us. Item 4. Mine Safety Disclosures.\nNot Applicable.\nPart II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock is currently quoted on the OTC PINK tier of the OTC Markets Group under the symbol ODRS. However, quotations for the stock during the 2022 and 2021 years were limited and sporadic and there currently is no established trading market for our common stock.\nThe following table sets forth, for the periods indicated, the high and low bid prices per share of common stock as set forth in the OTC Market Report. The below quotations represent inter-dealer prices without retail mark-up, mark-down, or commission and may not necessarily represent actual transactions.\nPrice Range\nPeriod High Low\nYear Ending September 30, 2022\nFirst Quarter $ 1.79 $ 1.79\nSecond Quarter $ 1.79 $ 1.79\nThird Quarter $ 1.79 $ 1.79\nFourth Quarter $ 1.79 $ 1.75\nYear Ended September 30, 2021:\nFirst Quarter $ 1.75 $ 1.75\nSecond Quarter $ 1.75 $ 1.75\nThird Quarter $ 1.75 $ 1.75\nFourth Quarter $ 1.75 $ 1.75\nAs of December 12, 2022, our shares of common stock were held by 68 stockholders of record as reported by our transfer agent.\nDividends\nHolders of our common stock are entitled to dividends when, as, and if declared by our Board of Directors, out of funds legally available, therefore. We have never declared cash dividends on our common stock and our Board of Directors does not anticipate paying cash dividends in the foreseeable future as it intends to retain any future earnings to finance the growth of our business. There are no restrictions in our articles of incorporation or bylaws that restrict us from declaring dividends.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nAs of the end of the latest fiscal year ended September 30, 2022, the only compensation plans (including individual compensation arrangements) under which our equity securities were authorized for issuance was our 2021 Stock Incentive Plan, adopted on February 8, 2021, which authorizes the issuance of up to 1,000,000 shares of our common stock in awards granted as incentive or non-statutory stock options, restricted stock units, stock appreciation rights, or restricted stock grants. The 10-year plan is administered by our Board of Directors. No awards have been made under the plan to date.\nSpecial Sales Practice Requirements with Regard to Penny Stocks\nIn order to protect investors from patterns of fraud and abuse that have occurred in the market for low priced securities commonly referred to as penny stocks, the SEC has adopted regulations that generally define a penny stock to be any equity security having a market price (as defined) less than $5.00 per share, or an exercise price of less than $5.00 per share, subject to certain exceptions. The price of our stock is currently below $5.00 per share and our stock is subject to the penny stock regulations. As a result, broker-dealers selling our common stock are subject to additional sales practices when they sell our stock to persons other than established clients and accredited investors. For transactions covered by these rules, before the transaction is executed, the broker-dealer must make a special customer suitability determination, receive the purchasers written consent to the transaction and deliver a risk disclosure document relating to the penny stock market. The broker-dealer must also disclose the commission payable to both the broker-dealer and the registered representative taking the order, current quotations for the securities and, if applicable, the fact that the broker-dealer is the sole market maker and the broker-dealers presumed control over the market. Monthly statements must be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks. Such penny stock rules may restrict trading in our common stock and may deter broker-dealers from effecting transactions in our common stock.\nTransfer Agent\nThe transfer agent of our common stock has been Action Stock Transfer Corporation, 2469 Fort Union Blvd #214, Cottonwood Heights, UT 84121; telephone (801) 274-1088. We were recently advised that the accounts of Action Stock Transfer Corporation have been transitioned to Securities Transfer Corporation, 2901 N. Dallas Parkway, Suite 380, Plano, TX 75093; telephone (469) 633-0101.\nRecent Sales of Unregistered Securities\nDuring the three months ended September 30, 2022, we did not sell any unregistered securities. No sales of unregistered securities were made by us within the past two years.\nIssuer Purchases of Equity Securities\nWe have not adopted a stock repurchase plan and we did not purchase any shares of our equity securities during our 2022 fiscal year. Item 6. Reserved. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion in conjunction with our financial statements, which are included elsewhere in this report.\nThe following discussion contains forward-looking statements. Forward-looking statements give our current expectations or forecasts of future events. You can identify these statements by the fact that they do not relate strictly to historical or current facts. They use words such as anticipate, estimate, expect, project, intend, plan, believe, and other words and terms of similar meaning in connection with any discussion of future operating or financial performance. From time to time, we also may provide forward-looking statements in other materials we release to the public.\nOverview\nWe are and have since our inception in 2014 been engaged in the business of developing, selling, and marketing products in niche markets within the specialty outdoor products marketplace. We introduced our proprietary Reel Guard product in 2014 and continue to offer it for sale. We have postponed the production of our SLINKOR product pending completion of a design change in the composition of the weighting component from lead to another material and the use of molded product components.\nThe COVID-19 pandemic has had, and continues to have, a significant impact around the world. The COVID-19 pandemic has resulted in restrictions on travel and business operations, temporary closures of businesses, quarantine and shelter-in-place orders, and greater uncertainty in global financial markets. As a result of COVID-19 mobility restrictions globally, there have been changes in consumer behavior. The extent to which the COVID-19 pandemic will impact our business and financial condition in the future will depend on a number of evolving factors that we cannot predict, including the duration and scope of the pandemic; any resurgence of the pandemic; the availability and distribution of effective treatments and vaccines; governmental, business and individual actions that may be taken in response to the pandemic; the impact of the pandemic on national and global economic activity and financial markets, including the possibility of a national or global recession; and the ability of consumers to pay for products. We expect these changes in behavior to continue to evolve as the pandemic ebbs and flows. The full impact of the COVID-19 pandemic on the Company remains inherently uncertain at the time of this report.\nOur financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. We did not generate sufficient revenue to generate net income, we have negative working capital, and we have a limited operating history. These factors, among others, may indicate that there is substantial doubt that we will be unable to continue as a going concern for a reasonable period of time. Our financial statements do not include any adjustments relating to the recoverability and classification of assets and liabilities that might be necessary should we be unable to continue as a going concern. Our continuation as a going concern is dependent upon our ability to generate sufficient cash flow to meet our obligations on a timely basis and ultimately to attain profitability. We intend to seek additional funding, if and to the extent required, through debt or equity offerings and additional stockholder loans. We also intend to increase our sales through the addition of our SLINKOR product upon the completion of its redesign. There is no assurance that we will be successful in raising additional funds or that the SLINKOR product will result in an increase in sales.\nResults of Operations\nRevenues\nFrom our inception in 2014 through the present, our revenues have resulted solely from sales of our proprietary Reel Guard product and our costs of sales have also related solely to that product. Our Reel Guard product is offered for sale on our website and on eBay and sales vary from quarter to quarter based on the number of customers that become aware of the product and decide to make a purchase. Total sales for the year ended September 30, 2022, were $302, compared to $204 for the year ended September 30, 2021, an increase of $98, or approximately 48%.\nCost of Sales\nCost of sales for 2022 was $46, compared to $18 for 2021, an increase of $28, or approximately 156%. The increase in cost of sales in 2022 is partially attributable to the provision of a limited number of sample/promotional Reel Guard products to fly fishing shops and other potential retail outlets for the product without charge. Such sample/promotional sales reduce inventory and increase the cost of sales but do not generate revenues. Cost of sales as a percentage of sales was approximately 15.2% for 2022 and 8.8% for 2021, with the increase being primarily attributable to the sample/promotional sales described above.\nGeneral and Administrative Expenses\nGeneral and administrative expenses consist primarily of legal, accounting, and Edgar filing expenses. General and administrative expenses were $35,743 for 2022, compared to $39,678 for 2021, a decrease of $3,935 or approximately 9.9%. The decrease is partially attributable to higher legal and accounting expenses in 2021 in connection with our change of domicile merger and the filing of our Form 10 registration statement.\nDepreciation and Amortization Expense\nDepreciation and amortization expenses currently are not material to our business. Depreciation expense was $0 for 2022 and $631 for 2021. Amortization expense was $409 for 2022 and $408 for 2021, resulting from the amortization of our patent over seventeen years, which is its estimated legal life.\nResearch and Development Expenses\nResearch and development expenses are not currently material to our business. We did not incur research and development expenses in either 2022 or 2021.\nLiquidity and Capital Resources\nAs of September 30, 2022, we had total current assets of $6,337, including cash of $1,241, and current liabilities of $62,857, resulting in a working capital deficit of $56,520. Our current liabilities include an outstanding balance of $60,769 under the short-term revolving loan agreements for which the due dates have been extended to December 31, 2022. As of September 30, 2022, we had an accumulated stockholders deficit of $156,446. We have financed our operations from sales of our Reel Guard product, proceeds from our 2014 private placement, and proceeds from the short-term revolving loan agreements.\nFor 2022, net cash used by operating activities was $35,446, as a result of a net loss of $37,166, reduced by depreciation and amortization of $409, a decrease in inventory of $46, and an increase in accrued interest of $1,679, and increased by a decrease in accounts payable of $414. By comparison, for 2021 net cash used by operating activities was $38,062, as a result of a net loss of $39,901, reduced by depreciation and amortization of $1,039, a decrease in inventory of $18, an increase in accounts payable of $414, and an increase in accrued interest of 409, and increased by an increase in prepaid expense of $41.\nIn 2022 and 2021, we had no cash flows used in or provided by investing activities.\nIn 2022, we had net cash provided by financing activities of $30,519 consisting of the proceeds from the revolving loan agreements, and in 2021 we had net cash provided by financing activities of $29,750, consisting of $30,250 in proceeds from the revolving loan agreements, decreased by $500 for our repurchase of shares of common stock pursuant to a stockholders exercise of dissenters rights in connection with our change of domicile merger.\nFollowing our incorporation in 2014, we completed the private placement of 285,714 shares of our common stock to accredited investors in a private placement at a price of $0.35 per share for total proceeds of $100,011. The proceeds from the private placement together with our limited product sales were sufficient to fund our operations through our fiscal year ended September 30, 2020. On January 4, 2021, we entered into a revolving promissory note agreement with our president and principal stockholder that provided for total loans of up to $40,000 at an interest rate 3.5% per annum, which was repayable on or before December 31, 2021. During December 2021, we amended the revolving promissory note agreement to extend the maturity date to June 30, 2022, and during June 2022, we further amended the agreement to increase the maximum principal indebtedness to $55,200 and extend the maturity date to December 31, 2022. During December 2021, we entered into a revolving promissory note agreement with another principal stockholder which provided for loans of up to $7,000 at an interest rate of 3.5% per annum, which was repayable on or before June 30, 2022. During June 2022, we amended this agreement to increase the maximum principal indebtedness to $9,750 and extend the maturity date to December 31, 2022. We received proceeds under the revolving loan agreements of $30,519 during the year ended September 30, 2022, resulting in a principal balance of $60,769, with accrued interest of $2,088, at September 30, 2022. During November 2022, we amended the revolving promissory note agreements to extend the maturity dates to December 31, 2023 and increase the maximum principal amount of the note agreement with our president and the other principal stockholder to $75,000 and $13,240, respectively.\nWe believe we have adequate funds to meet our obligations for the next twelve months from our current cash, the revolving note agreements, and projected cash flows from operations. Cash flow from operations has not historically been sufficient to sustain our operations without the above additional sources of capital. Our future working capital requirements will depend on many factors, including the expansion of our product lines to include the new SLINKOR product. To the extent our cash, cash equivalents, and cash flows from operating activities and the revolving note agreements are insufficient to fund our future activities, we may need to raise additional funds through private equity or debt financing. We also may need to raise additional funds in the event we determine in the future to effect one or more acquisitions of businesses, technologies, and products. If additional funding is required, we may not be able to affect an equity or debt financing on terms acceptable to us or at all.\nIn addition, COVID-19 and related measures to contain its impact have caused material disruptions in both national and global financial markets and economies. The future impact of COVID-19, these containment measures, and recent increases in the rate of inflation cannot be predicted with certainty and may increase our borrowing costs and other costs of capital and otherwise adversely affect our business, results of operations, financial condition and liquidity, and no assurance can be given that we will have access to external financing at times and on terms we consider acceptable, or at all, or that we will not experience other liquidity issues going forward.\nRequirements\nThe Company currently has no lease obligations or requirements and has not entered into any agreements that require a commitment of cash.\nOff-Balance Sheet Arrangements\nAs of September 30, 2022 and 2021, we did not have any off-balance sheet financing arrangements.\nCritical Accounting Policies\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires our management to make assumptions, estimates and judgments that affect the amounts reported in the financial statements, including the notes thereto, and related disclosures of commitments and contingencies, if any. We consider our critical accounting policies to be those that require the more significant judgments and estimates in the preparation of financial statements, including the following:\nAccounting Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nInventories\nInventories, consisting primarily of injection molded Reel Guards and Adhesive Strips, are stated at the lower of cost or net realizable value, with cost determined using primarily the first-in-first-out (FIFO) method. The Company purchased substantially all inventories from one supplier and has been dependent on this supplier for all inventory purchases since we commenced operations. The Company has $2,042 and $2,088 in finished goods and $2,596 and $2,596 in raw materials at September 30, 2022 and 2021, respectively.\nPatents\nPatents consist of the cost of obtaining the patent for the Reel Guard. Our patents are amortized over their legal life (typically 17 years) and analyzed periodically for impairment in accordance with ASC 350, Intangibles - Goodwill and Other.\nRevenue Recognition\nWhen the Company sells a reel protector, it recognizes revenue in accordance with ASC 606, Revenue from Contracts with Customers. Under ASC 606, the Company recognizes revenue upon the transfer of promised goods to customers in amounts that reflect the consideration to which the Company expects to be entitled. The Company considers revenue earned when all the following criteria are met: (i) the contract with the customer has been identified, (ii) the performance obligations have been identified, (iii) the transaction price has been determined, (iv) the transaction price has been allocated to the performance obligations, and (v) the performance obligations have been satisfied. The Company earned $302 and $204 in revenue during the years ended September 30, 2022 and 2021, respectively.\nRecently Enacted Pronouncements\nThe Company has reviewed all recently issued, but not yet adopted, accounting standards in order to determine their effects, if any, on its results of operation, financial position or cash flows. Based on that review, the Company believes that none of these pronouncements will have a significant effect on its current or future earnings or operations. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nNot Applicable. The Company is a smaller reporting company. Item 8. Financial Statements and Supplementary Data\nThe following financial statements are being filed with this report and are located immediately following the signature page.\nReport of Independent Registered Public Accounting Firm (PCAOB ID 6117)\nBalance Sheets as of September 30, 2022 and 2021\nStatements of Operations for the years ended September 30, 2022 and 2021\nStatements of Changes in Stockholders Deficit for the years ended September 30, 2022 and 2021\nStatements of Cash Flows for the years ended September 30, 2022 and 2021\nNotes to Financial Statements Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our President and Treasurer who serves as our principal executive and principal financial officer, we evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934 (the Exchange Act) as of September 30, 2022, the end of the period covered by this report. Based upon that evaluation, our President and Treasurer, concluded that our disclosure controls and procedures as of September 30, 2022 were effective such that the information required to be disclosed by us in reports filed under the Exchange Act is (i) recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and (ii) accumulated and communicated to our management, including our President and Treasurer, as appropriate to allow timely decisions regarding disclosure. A controls system cannot provide absolute assurance that the objectives of the controls system are met, and no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within a company have been detected.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act). Our internal control over financial reporting is a process designed to provide reasonable assurance to our management and board of directors regarding the preparation and fair presentation of published financial statements. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance of achieving their control objectives. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management, including our principal executive officer / principal financial officer, conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on its evaluation under that framework, our management concluded that our internal control over financial reporting was effective as of September 30, 2022.\nChanges in Internal Control over Financial Reporting\nThere was no change in our internal control over financial reporting during the year ended September 30, 2022 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot Applicable.\nPart III Item 10. Directors, Executive Officers and Corporate Governance\nThe following table sets forth the names and ages of the member of our Board of Director and our executive officers and the positions held by each.\nName\nAge\nTitle\nKirk Blosch\nPresident, CEO, and Chairman\nKirk Blosch is the founder of the Company and has been its sole officer and director since its inception in 2014. Since 2008 he has been the owner and principal broker of B&B Real Estate Group LLC, a Salt Lake City, Utah, based real estate firm providing sales, consulting, and development services. Mr. Blosch has over 36 years of experience in evaluating business opportunities, creating business or development plans, funding various projects, and overseeing the construction and development of real estate projects. He received his Bachelor of Science degree in organizational communication from the University of Utah in 1976.\nFamily Relationships\nThere are no family relationships among our directors, executive officers or persons nominated or chosen to become directors or executive officers.\nBoard of Directors\nOur board of directors consists of one person, Kirk Blosch. Such person is not independent within the meaning of Rule 5605(a)(2) of the NASDAQ Marketplace because he is an officer of the Company.\nOur board of directors has not appointed any standing committees, there is no separately designated audit committee and the Companys single, non-independent board member performs the functions that would customarily be performed by an audit committee. The board of directors does not have an independent financial expert because it does not believe the scope of the Companys activities to date has justified the expenses involved in obtaining such a financial expert. In addition, our securities are not listed on a national exchange and we are not subject to the special corporate governance requirements of any such exchange.\nThe Company does not have a compensation committee and the Companys single, non-independent board member participates in the consideration of executive officer and director compensation. To date, the Company has not paid any executive or director compensation and has not engaged independent compensation consultants to determine or recommend the amount or form of executive or director compensation.\nThe Company does not have a standing nominating committee and the Companys single, non-independent board member performs the functions that would customarily be performed by a nominating committee. The board of directors does not believe a separate nominating committee is required at this time due to the limited size of the Companys business operations and the limited resources of the Company that do not permit it to compensate its directors. The board of directors has not established policies with regard to the consideration of director candidates recommended by security holders or the minimum qualifications of such candidates.\nCode of Ethics\nWe have not adopted a Code of Ethics that applies to our executive officers, including our principal executive, financial and accounting officers. We do not believe the adoption of a code of ethics at this time would provide any meaningful additional protection to the Company because we have only one officer and our business operations are not extensive or complex.\nDirector Meetings and Stockholder Meeting Attendance\nThe Board of Directors held no formal meetings during 2022 and the sole director took action by written consent in lieu of meetings. Our policy is to encourage, but not require, members of the Board of Directors to attend annual stockholder meetings. We did not hold an annual stockholder meeting during the 2022 year.\nCommunications with Directors\nShareholders may communicate with the Board of Directors or any individual director by sending written communications addressed to the Board of Directors, or any individual director, to: Outdoor Specialty Products, Inc., Attention: Corporate Secretary, 3842 Quail Hollow Drive, Salt Lake City, Utah 84109. All communications will be compiled by the corporate secretary and forwarded to the Board of Directors or any individual director, as appropriate. In order to facilitate a response to any such communication, the Companys Board of Directors suggests, but does not require, that any such submission include the name and contact information of the shareholder submitting the communication. Item 11. Executive Compensation\nKirk Blosch, our President, Secretary and Treasurer, is our only employee. We did not pay any executive compensation during the fiscal years ended September 30, 2022 and 2021. We have not entered into any employment agreements with our officers and directors. We reimburse our officers for reasonable costs and expenses incurred by them in connection with our business.\nWe have not granted our officers or directors any stock options, stock awards or other forms of equity compensation.\nWe do not have any retirement, pension or profit-sharing plans covering our officers or directors, and we are not contemplating implementing any such plans at this time.\nDirector Compensation\nWe did not pay our sole director any compensation for serving in his capacity as a director during the fiscal years ended September 30, 2022 and 2021. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth information regarding the beneficial ownership of our common stock as of December 12, 2022. The information in this table provides the ownership information for each person known by us to be the beneficial owner of more than 5% of our common stock, each of our directors, each of our executive officers, and our executive officers and directors as a group.\nBeneficial ownership has been determined in accordance with the rules and regulations of the SEC and includes voting or investment power with respect to the shares. Unless otherwise indicated, the persons named in the table below have sole voting and investment power with respect to the number of shares indicated as beneficially owned by them.\nName and Address of Beneficial Owner Common\nStock\nBeneficially\nOwned (1) Percentage of\nCommon\nStock\nOwned (1)\nPrincipal Stockholders\nEd Bailey 760,000 14.4 %\n4685 S. Highland Dr. Salt Lake City, UT 84106\nOfficers and Directors\nKirk Blosch, President and Director (2) 4,250,000 80.4 %\n3842 Quail Hollow Drive\nSalt Lake City, UT 84109\nDirector and Officer (1 person) 4,250,000 80.4 %\n(1) Applicable percentage ownership is based on 5,284,318 shares of common stock outstanding as of December 12, 2022. Beneficial ownership is determined in accordance with the rules of the Securities and Exchange Commission and generally includes voting or investment power with respect to securities.\n(2) Kirk Blosch is the only officer, employee, and director of the Company. He has full voting and investment control of the shares beneficially owned by him. Item 13. Certain Relationships and Related Transactions and Director Independence\nOn January 4, 2021, we entered into a revolving promissory note agreement with our president and principal stockholder that provided for total loans of up to $40,000 at an interest rate 3.5% per annum, which was repayable on or before December 31, 2021. During December 2021, we amended the revolving promissory note agreement to extend the maturity date to June 30, 2022, and during June 2022, we further amended the agreement to increase the maximum principal indebtedness to $55,200 and extend the maturity date to December 31, 2022. During December 2021, we entered into a revolving promissory note agreement with Ed Bailey, another principal beneficial owner, which provided for loans of up to $7,000 at an interest rate of 3.5% per annum, which was repayable on or before June 30, 2022. During June 2022, we amended this agreement to increase the maximum principal indebtedness to $9,750 and extend the maturity date to December 31, 2022. We received proceeds under both revolving loan agreements of $30,519 during the year ended September 30, 2022, resulting in a principal balance of $60,769, with accrued interest of $2,088, at September 30, 2022.\nDuring November 2022, we amended the revolving promissory note agreements to extend the maturity dates to December 31, 2023 and increase the maximum principal amount of the note agreement with our president and the other principal stockholder to $75,000 and $13,240, respectively.\nDirector Independence\nOur board of directors consists of one person, Kirk Blosch. Such person is not independent within the meaning of Rule 5605(a)(2) of the NASDAQ Marketplace because he is an officer of the Company.\nIndemnification\nNevada law expressly authorizes a Nevada corporation to indemnify its directors, officers, employees, and agents against liabilities arising out of such persons conduct as directors, officers, employees, or agents if they acted in good faith, in a manner they reasonably believed to be in or not opposed to the best interests of the company, and, in the case of criminal proceedings, if they had no reasonable cause to believe their conduct was unlawful. Generally, indemnification for such persons is mandatory if such person was successful, on the merits or otherwise, in the defense of any such proceeding, or in the defense of any claim, issue, or matter in the proceeding. In addition, as provided in the articles of incorporation, bylaws, or an agreement, the corporation may pay for or reimburse the reasonable expenses incurred by such a person who is a party to a proceeding in advance of final disposition if such person furnishes to the corporation an undertaking to repay such expenses if it is ultimately determined that he did not meet the requirements. In order to provide indemnification, unless ordered by a court, the corporation must determine that the person meets the requirements for indemnification. Such determination must be made by a majority of disinterested directors; by independent legal counsel; or by a majority of the shareholders.\nArticle X of our Articles of Incorporation provides that we must pay expenses of officers and directors incurred in defending a civil or criminal action, suit or proceeding, involving alleged acts or omissions of such officer or director in his or her capacity as an officer or director as they are incurred and in advance of the final disposition of the action, suit or proceeding, upon receipt of an undertaking by or on behalf of the director or officer to repay the amount if it is ultimately determined by a court of competent jurisdiction that he or she is not entitled to be indemnified by us.\nInsofar as indemnification for liabilities arising under the Securities Act of 1933 (the Act) may be permitted to directors, officers and controlling persons of our company pursuant to the foregoing provisions, or otherwise, we have been advised that in the opinion of the Securities and Exchange Commission, such indemnification is against public policy as expressed in the Act and is, therefore, unenforceable. Item 14. Principal Accountant Fees and Services\nPinnacle Accountancy Group of Utah (a dba of the registered firm Heaton & Company, PLLC) served as the Companys independent registered public accounting firm for the fiscal years ended September 30, 2022 and 2021.\nDuring the fiscal years ended September 30, 2022 and 2021, fees for services provided by Pinnacle Accountancy Group of Utah. were as follows:\nYear Ended\nSeptember 30,\nAudit Fees $ 7,500 $ 8,900\nAudit-Related Fees\nTax Fees - -\nAll Other Fees - -\nTotal $ 7,900 $ 9,300\nAudit Fees consisted of fees billed for services rendered for the audit of the Companys annual financial statements, review of financial statements included in the Companys quarterly reports on Form 10-Q, and other services normally provided in connection with statutory and regulatory filings. Audit-Related Fees consisted of fees billed for due diligence procedures in connection with acquisitions and divestitures and consultation regarding financial accounting and reporting matters. Tax Fees consisted of fees billed for tax payment planning and tax preparation services. All Other Fees consisted of fees billed for services in connection with legal matters and technical accounting research.\nThe Companys Board of Directors functions as its audit committee. It is the policy of the Company for all work performed by our principal accountant to be approved in advance by the Board of Directors. All of the services described above in this Item 14 were approved in advance by our Board of Directors. Item 15. Exhibit and Financial Statement Schedules\n(a) List of all financial statements filed as part of this report.\nIndex of Financial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID 6117)\nBalance Sheets at September 30, 2022 and 2021\nStatements of Operations for the years ended September 30, 2022 and 2021\nStatements of Changes in Stockholders Deficit for the years ended September 30, 2022 and 2021\nStatements of Cash Flows for the years ended September 30, 2022 and 2021\nNotes to Financial Statements\n(b) The following documents are included as exhibits to this report.\n(a) Exhibits\nExhibit\nNumber\nSEC\nReference\nNumber\nTitle of Document\nLocation\n3.1\nArticles of Incorporation\nIncorporated by Reference(1)\n3.2\nArticles of Merger dated February 24, 2021\n3.3\nBylaws\nIncorporated by Reference(1)\n4.1\n2021 Stock Incentive Plan\nIncorporated by Reference(1)\n10.1\nMerger Agreement dated February 24, 2021\nIncorporated by Reference(1)\n10.2\nRevolving Promissory Note Agreement with Kirk Blosch dated January 4, 2021\nIncorporated by Reference(1)\n10.3\nLicense and Royalty Agreement dated May 4, 2021\nIncorporated by Reference(1)\n10.4\nFirst Amendment to Revolving Promissory Note Agreement dated December 1, 2021\nIncorporated by Reference(2)\n10.5\nRevolving Promissory Note Agreement with Ed Bailey dated December 1, 2021\nIncorporated by Reference(2)\n10.6\nSecond Amendment to Revolving Promissory Note Agreement with Kirk Blosch dated as of June 2, 2022\nIncorporated by Reference(3)\n10.7\nFirst Amendment to Revolving Promissory Note Agreement with Ed Bailey dated as of June 2, 2022\nIncorporated by Reference(3)\n21.1\nSchedule of the Registrants Subsidiaries\nThis Filing\n31.1\nSection 302 Certification of Chief Executive and Chief Financial Officer\nThis Filing\n32.1\nSection 1350 Certification of Chief Executive and Chief Financial Office\nThis Filing\n101.INS\nInline XBRL Instance Document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n(1) Incorporated by reference to the Companys Registration Statement on Form 10-12G filed June 24, 2021.\n(2) Incorporated by reference to the Companys Annual Report on Form 10-K for the year ending September 30, 2021, filed on December 29, 2021.\n(3) Incorporated by reference to the Companys Quarterly report on Form 10-Q for the quarter ending June 30, 2022, filed on July 26, 2022.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nOutdoor Specialty Products, Inc.\nDated: December 21, 2022 By /s/ Kirk Blosch\nKirk Blosch\nPresident, Secretary and Treasurer\n(Principal Executive and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDated: December 21, 2022 By /s/ Kirk Blosch\nKirk Blosch\nPresident, Secretary, Treasurer and Director\n(Principal Executive and Accounting Officer)\nReport of Independent Registered Public Accounting Firm (PCAOB ID 6117)\nBalance Sheets as of September 30, 2022 and 2021\nStatements of Operations for the Years Ended September 30, 2022 and 2021\nStatements of Changes in Stockholders Deficit for the Years Ended September 30, 2022 and 2021\nStatements of Cash Flow for the Years Ended September 30, 2022 and 2021\nNotes to Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nOutdoor Specialty Products, Inc.\nSalt Lake City, Utah\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Outdoor Specialty Products, Inc. (the Company) as of September 30, 2022 and 2021, and the related statements of operations, changes in stockholders deficit, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nConsideration of the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. The Company has suffered recurring losses since inception, has a working capital deficit, and has not achieved profitable operations, which raise substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are described in Note 7. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nGoing Concern - Disclosure\nThe financial statements of the Company are prepared on a going concern basis, which assumes that the Company will continue in operation for the foreseeable future and, accordingly, will be able to realize its assets and discharge its liabilities in the normal course of operations. As noted in Going Concern Considerations above, the Company has a history of recurring net losses, a significant accumulated deficit and currently has net working capital deficit. The Company has contractual obligations such as commitments for repayments of accounts payable, accrued interest and line of credit - related party (collectively obligations). Currently managements forecasts and related assumptions illustrate their intent to meet the obligations through management of expenditures, obtaining additional financing through loans from related and unrelated parties, and private placements of capital stock for additional funding to meet its operating needs. Should there be constraints on the ability to access financing through stock issuances, the Company will continue to manage cash outflows and meet the obligations through related and unrelated party loans.\nWe identified managements assessment of the Companys ability to continue as a going concern as a critical audit matter. Management made judgments regarding the Companys intentions and ability to provide the necessary cash flows to fund the Companys obligations as they become due. Specifically, the judgments with the highest degree of impact and subjectivity in determining the Companys ability to manage expenditures, access funding from the capital market, and obtain loans from related and unrelated parties. Auditing the judgments made by management required a high degree of auditor judgment and an increased extent of audit effort.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the financial statements. These procedures included the following, among others, evaluating the Companys ability to: (i) access funding from the capital market; (ii) manage expenditures, and (iii) obtain loans from related and unrelated parties.\n/s/ Pinnacle Accountancy Group of Utah\nWe have served as the Companys auditor since 2018.\nPinnacle Accountancy Group of Utah\n(a dba of Heaton & Company, PLLC)\nFarmington, Utah\nDecember 19, 2022\nOUTDOOR SPECIALTY PRODUCTS, INC.\nBalance Sheets\nSeptember 30,\nSeptember 30,\nAssets:\nCurrent Assets:\nCash $ 1,241 $ 6,168\nPrepaid expense\nInvntory 4,638 4,684\nTotal current assets 6,337 11,310\nProperty, Plant and Equipment, net -\n-\nOther Assets:\nPatents, net 4,591 5,000\nTotal Assets $ 10,928 $ 16,310\nLiabilities and Stockholders Deficit:\nCurrent Liabilities:\nAccounts payable $ -\n$ 414\nAccrued interest 2,088\nLine of credit - related party 60,769 30,250\nTotal Liabilities 62,857 31,073\nStockholders Deficit:\nPreferred stock, $0.001 par value, 10,000,000 shares authorized, none issued and outstanding -\n-\nCommon stock, $0.001 par value, 190,000,000 shares authorized, 5,284,318 shares issued and outstanding 5,285 5,285\nAdditional paid-in capital 99,232 99,232\nAccumulated deficit (156,446 ) (119,280 )\nTotal Stockholders Deficit (51,929 ) (14,763 )\nTotal Liabilities and Stockholders Deficit $ 10,928 $ 16,310\nThe accompanying notes are an integral part of these audited financial statements.\nOUTDOOR SPECIALTY PRODUCTS, INC.\nStatements of Operations\nFor the Year Ended\nSeptember 30,\nRevenue $ 302 $ 204\nCost of sales (46 ) (18 )\nGross Profit\nOperating Expenses:\nGeneral and administrative 35,743 39,678\nTotal Operating Expenses 35,743 39,678\nLoss from Operations (35,487 ) (39,492 )\nOther Expense:\nInterest expense 1,679\nTotal other expense 1,679\nNet Loss $ (37,166 ) $ (39,901 )\nNet loss per share of common stock - basic and diluted $ (0.01 ) $ (0.01 )\nWeighted average number of common shares outstanding - basic and diluted 5,284,318 5,284,318\nThe accompanying notes are an integral part of these audited financial statements.\nOUTDOOR SPECIALTY PRODUCTS, INC.\nStatements of Changes in Stockholders Deficit\nYears Ended September 30, 2022 and 2021\nCommon Stock\nAdditional\nPaid-in\nAccumulated\nTotal\nStock-\nholders\nShares\nAmount\nCapital\nDeficit\nDeficit\nBalance, September 30, 2020\n5,285,747\n$ 5,286\n$ 99,731\n$ (79,379 )\n$ 25,638\nDissenter shares repurchased and cancelled\n(1,429 )\n(1 )\n(499 )\n-\n(500 )\nNet loss\n-\n-\n-\n(39,901 )\n(39,901 )\nBalance September 30, 2021\n5,284,318\n$ 5,285\n$ 99,232\n$ (119,280 )\n$ (14,763 )\nNet loss\n-\n-\n-\n(37,166 )\n(37,166 )\nBalance, September 30, 2022\n5,284,318\n$ 5,285\n$ 99,232\n$ (156,446 )\n$ (51,929 )\nThe accompanying notes are an integral part of these audited financial statements.\nOUTDOOR SPECIALTY PRODUCTS, INC.\nSTATEMENTS OF CASH FLOWS\nFor the Year Ended\nSeptember 30,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet Loss $ (37,166 ) $ (39,901 )\nAdjustments to Reconcile Net Loss\nTo Net Cash Used by Operating Activities\nDepreciation and Amortization 1,039\nChanges in Operating Assets and Liabilities:\nIncrease in prepaid expense -\n(41 )\nDecrease in inventory\nIncrease (decrease) in accounts payable (414 )\nIncrease in accrued interest 1,679\nNet Cash Used by Operating Activities (35,446 ) (38,062 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nNet Cash Used by Investing Activities -\n-\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from line of credit - related party 30,519 30,250\nRepurchase of common shares -\n(500 )\nNet Cash Provided by Financing Activities 30,519 29,750\nNet Decrease in Cash (4,927 ) (8,312 )\nCash at Beginning of Period 6,168 14,480\nCash at End of Period $ 1,241 $ 6,168\nSUPPLEMENTAL DISCLOSURES:\nCash Paid For:\nInterest $ -\n$ -\nIncome taxes $ -\n$ -\nThe accompanying notes are an integral part of these audited financial statements.\nOUTDOOR SPECIALTY PRODUCTS, INC.\nNotes to Financial Statements\nSeptember 30, 2022 and 2021\nNote 1 - Organization and Summary of Significant Accounting Policies\nOrganization - Outdoor Specialty Products, Inc. (the Company) was incorporated in the State of Utah on January 31, 2014 and changed its domicile to the state of Nevada on February 24, 2021. The Company is in the business of developing and selling outdoor products with its first product focused on a reel protector for fishing reels. The Company also will be selling third party products through its website. The Company has elected a September 30 fiscal year end.\nAccounting Estimates - The preparation of financial statements in conformity with generally accepted accounting principles in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents - For the purpose of the financial statements, the Company considers all highly liquid instruments purchased with original maturities of three months or less to be cash equivalents.\nInventories - Inventories, consisting primarily of injection molded Reel Guards and Adhesive Strips, are stated at the lower of cost or net realizable value, with cost determined using primarily the first-in-first-out (FIFO) method. The Company purchased substantially all inventories from one supplier and has been dependent on this supplier for all inventory purchases since we commenced operations. The Company has $2,042 and $2,088 in finished goods and $2,596 and $2,596 in raw materials at September 30, 2022 and 2021, respectively.\nPatents - Patents consist of the cost of obtaining a patent for the Companys reel protector. Our patents are amortized over their legal life (typically 17 years) and analyzed periodically for impairment in accordance with ASC 350, Intangibles - Goodwill and Other.\nRevenue Recognition - When the Company sells a reel protector, it recognizes revenue in accordance with ASC 606, Revenue from Contracts with Customers. Under ASC 606, the Company recognizes revenue upon the transfer of promised goods to customers in amounts that reflect the consideration to which the Company expects to be entitled. The Company considers revenue earned when all the following criteria are met: (i) the contract with the customer has been identified, (ii) the performance obligations have been identified, (iii) the transaction price has been determined, (iv) the transaction price has been allocated to the performance obligations, and (v) the performance obligations have been satisfied.\nThe Company earned $302 and $204 in revenue during the years ended September 30, 2022 and 2021, respectively.\nOUTDOOR SPECIALTY PRODUCTS, INC.\nNotes to Financial Statements\nSeptember 30, 2022 and 2021\nNote 1 - Organization and Summary of Significant Accounting Policies (continued)\nRecently Enacted Pronouncements - The Company has reviewed all recently issued, but not yet adopted, accounting standards in order to determine their effects, if any, on its results of operation, financial position or cash flows. Based on that review, the Company believes that none of these pronouncements will have a significant effect on its current or future earnings or operations.\nBasic and Diluted Loss Per Share - Basic loss per share is computed by dividing net loss attributable to common shares by the weighted average number of common shares outstanding during the period. Diluted loss per share is computed by dividing net income attributable to common shares for the period by the weighted average number of common and potential common shares outstanding during the period. Potential common shares are included in the calculation of diluted net income per share, when they are present in the financial statements, to the extent such shares are dilutive. During the years ended September 30, 2022 and 2021, the Company did not have any stock options, warrants, or other convertible or potentially-dilutive instruments issued and outstanding.\nNOTE 2 - Income Tax\nThe Company follows ASC 740-10, which clarifies the accounting for uncertainty in income taxes recognized in a companys financial statements. This standard requires a company to determine whether it is more likely than not that a tax position will be sustained upon examination based upon the technical merits of the position. If the more-likely-than- not threshold is met, a company must measure the tax position to determine the amount to recognize in the financial statements.\nDeferred taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss, and tax credit carry-forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax basis. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. The Companys corporate tax rate is 21%.\nOUTDOOR SPECIALTY PRODUCTS, INC.\nNotes to Financial Statements\nSeptember 30, 2022 and 2021\nNOTE 2 - Income Tax (continued)\nDeferred tax asset and valuation allowance are as follows at September 30:\nApproximate net operating loss carryforward $ 38,800 $ 31,000\nValuation allowance (38,800 ) (31,000 )\nDeferred tax asset $ -\n$ -\nThe components of income tax expense (benefit) are as follows:\nCurrent federal tax (21%) $ (7,800 ) $ (8,400 )\nCurrent state tax (0% and 5%, respectively) - (2,000 )\nChange in valuation allowance 7,800 10,400\n$ -\n$ -\nAt September 30, 2022, the Company had net operating loss carryforwards of approximately $156,800 that may be offset against future taxable income as long as the continuity of ownership test is met. No tax benefit has been reported in the September 30, 2022 financial statements since the potential tax benefit is offset by a valuation allowance of the same amount. The years 2019-2022 are open to examination by the IRS. No reserves for uncertain tax positions have been recorded.\nThe Company adopted changes issued by FASB which prescribed a recognition threshold and measurement attribute for financial statement recognition and measurement of an uncertain tax position taken or expected to be taken in a tax return. Under the guidance, an uncertain income tax position must be recognized at the largest amount that is more-likely-than-not to be sustained upon audit by the relevant taxing authority.\nOUTDOOR SPECIALTY PRODUCTS, INC.\nNotes to Financial Statements\nSeptember 30, 2022 and 2021\nNOTE 3 - Long Lived Assets\nProperty, Plant, and Equipment\nThe Companys capital asset consists of molding equipment stated at cost. Depreciation is calculated using the straight-line method over the estimated useful life which is determined to be seven years. Expenditures for additions and improvements are capitalized, while repairs and maintenance costs are expensed as incurred. The cost and related accumulated depreciation of any capital assets that are sold or otherwise disposed of are removed from the accounts and any gain or loss is recorded in the year of disposal.\nThe following is a summary of property, plant, and equipment less accumulated depreciation as of September 30:\nMold $ 5,300 $ 5,300\nTotal property, plant and equipment 5,300 5,300\nLess: accumulated depreciation (5,300 ) (5,300 )\nProperty, plant, equipment, net $ -\n$ -\nDepreciation expense for the years ended September 30, 2022 and 2021 was $0 and $631, respectively.\nPatent\nThe following is a summary of patents less accumulated amortization as of September 30:\nPatent $ 6,943 $ 6,943\nTotal patent 6,943 6,943\nLess: accumulated amortization (2,352 ) (1,943 )\nPatent, net $ 4,591 $ 5,000\nAmortization expense for the year ended September 30, 2022 and 2021 was $409 and $408, respectively.\nOUTDOOR SPECIALTY PRODUCTS, INC.\nNotes to Financial Statements\nSeptember 30, 2022 and 2021\nNOTE 3 - Long Lived Assets (continued)\nPatent (continued)\nFuture amortization of patent are as follows:\nYear Ending September 30,\n$ 408\nThereafter 2,551\n$ 4,591\nThe Company has reviewed the patent for impairment and has determined that no impairment loss has been incurred. The cost is being amortized over 17 years, which is the estimated legal life of the patent.\nNOTE 4 - Line of Credit - Related Party\nDuring the year ending September 30, 2022, the Company amended the revolving promissory note agreement with its related party to extend the maturity date to December 31, 2022 and increase the principal indebtedness from $40,000 to $55,200. The revolving promissory note bears interest at the rate of 3.5%. The Company received proceeds under the line of credit of $21,793 during the year ended September 30, 2022, resulting in balances of $52,043 and $30,250, with accrued interest of $1,909 and $409, at September 30, 2022 and 2021, respectively.\nAlso, during the year ended September 30, 2022, the Company entered into a new revolving promissory note agreement with another principal stockholder providing for loans of up to $9,750 at an interest rate of 3.5% per annum, which is repayable on or before December 31, 2022. During the year ended September 30, 2022, we borrowed an aggregate principal amount of $8,726 under this second revolving loan agreement. The balance on this line of credit at September 30, 2022, was $8,726 with accrued interest of $179.\nNOTE 5 - Stockholders Equity\nDuring the year ending September 20, 2021, the Company increased its authorized common shares from 90,000,000 to 190,000,000. Also, during the year ending September 30, 2021, the Company repurchased 1,429 shares of our common stock from a shareholder for $500 upon the shareholders exercise of dissenters rights, which shares were cancelled.\nOUTDOOR SPECIALTY PRODUCTS, INC.\nNotes to Financial Statements\nSeptember 30, 2022 and 2021\nNOTE 6 - Basic and Diluted Loss Per Share\nThe following table sets forth the computation of basic and diluted loss per share for the years ended September 30:\nLoss (numerator) $ (37,166 ) $ (39,901 )\nWeighted average shares (denominator) 5,284,318 5,284,318\nNet loss per share - basic and diluted\n$ (0.01 ) $ (0.01 )\nNOTE 7 - Going Concern\nThe accompanying financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. As shown in the accompanying financial statements, the Company did not generate sufficient revenue to generate net income, has a negative working capital, and has a limited operating history. These factors, among others, indicate that there is substantial doubt that the Company will be able to continue as a going concern for a reasonable period of time.\nThe financial statements do not include any adjustments relating to the recoverability and classification of assets and liabilities that might be necessary should the Company be unable to continue as a going concern. The Companys continuation as a going concern is dependent upon its ability to generate sufficient cash flow to meet its obligations on a timely basis and ultimately to attain profitability. The Company intends to seek additional funding through equity offerings to fund its business plan. There is no assurance that the Company will be successful in raising additional funds.\nNOTE 8 - Subsequent Events\nDuring November 2022, we amended the revolving promissory note agreements to extend the maturity dates to December 31, 2023 and increase the maximum principal amount of the note agreement with our president and the other principal stockholder to $75,000 and $13,240, respectively.\nThe Company has evaluated subsequent events from the balance sheet date through the date of the financial statements were issued and determined that there are no additional events requiring disclosure.\nNV\n0.01 0.01 false FY\n2021-10-01 2022-09-30\n2022-03-31\n2022-12-12\n2022-09-30\n2021-09-30\n2020-10-01 2021-09-30\nus-gaap:CommonStockMember\n2020-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2020-09-30\nus-gaap:RetainedEarningsMember\n2020-09-30\n2020-09-30\nus-gaap:CommonStockMember\n2020-10-01 2021-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2020-10-01 2021-09-30\nus-gaap:RetainedEarningsMember\n2020-10-01 2021-09-30\nus-gaap:CommonStockMember\n2021-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-09-30\nus-gaap:RetainedEarningsMember\n2021-09-30\nus-gaap:CommonStockMember\n2021-10-01 2022-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-10-01 2022-09-30\nus-gaap:RetainedEarningsMember\n2021-10-01 2022-09-30\nus-gaap:CommonStockMember\n2022-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-09-30\nus-gaap:RetainedEarningsMember\n2022-09-30\nus-gaap:PatentsMember\n2021-10-01 2022-09-30\nosp:MoldMember\n2022-09-30\nosp:MoldMember\n2021-09-30\nus-gaap:PatentsMember\n2022-09-30\nus-gaap:PatentsMember\n2021-09-30\nsrt:MinimumMember us-gaap:NotesPayableOtherPayablesMember\n2021-10-01 2022-09-30\nsrt:MaximumMember us-gaap:NotesPayableOtherPayablesMember\n2021-10-01 2022-09-30\nus-gaap:NotesPayableOtherPayablesMember\n2021-10-01 2022-09-30\nus-gaap:NotesPayableOtherPayablesMember\n2020-10-01 2021-09-30\nsrt:MinimumMember\n2021-09-20\nsrt:MaximumMember\n2021-09-20\nus-gaap:SubsequentEventMember\n2022-11-01 2022-11-30\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure"
}