{
    "cik": "1614556",
    "company": "Star Alliance International Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "1040",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1614556/0001683168-23-007158-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1614556/000168316823007158/star_i10k-063023.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1614556/0001683168-23-007158.txt",
    "filename": "1614556_10K_2023_0001683168-23-007158.htm",
    "content": "Item 1. Business\nHistory\nThe Company was incorporated in the State of Nevada on April 17, 2014 under the name Asteriko Corp. Our prior business plan, which generated limited or no earnings, included interior decorating products, and a travel and tourism service. On May 14, 2018, our current Chairman, President and director, Richard Carey, acquired approximately 62.15% ownership of the Company, constituting a change of control transaction. On January 6, 2017, the Company amended its Articles of Incorporation, effecting the change of its name to Star Alliance International Corp. As of the date of this Annual Report, the Company does not have subsidiaries.\nTroy Acquisition\nOn August 13, 2019, the Company acquired the assets of Troy Mining Corp, a Nevada corporation pursuant to the asset purchase agreement dated June 13, 2019 (the Troy Asset Acquisition), which included 78 gold mining claims consisting of approximately 4800 acres, located east/southeast of El Portal, California, in Mariposa County, together with all of Troys rights to related equipment and buildings currently located on the mining claims, including a production processing mill together with associated buildings, all the mining and support equipment at the Troy mine site, all the Troy mining claims, and related geological reports relating to the property, assay reports on the property, and all core drilling samples. In consideration for the Troy Asset Acquisition, the Company issued to Troy a promissory note in principal amount of $500,000 (the Purchase Note), and 1,883,000 shares of a Series B Preferred Stock. The Purchase Note was repaid in full in April, 2022. The Company is currently working with the US Forest Service, National Park Service and BLM to finalize the permits to reopen the mine. No permits have been issued yet. The Company expects to restart mining operations in 2024.\nShare Purchase Agreements with Juan Lemus for the proposed acquisitions of 51% ownership in Commsa and Lion Works.\nOn December 15, 2021, the Company entered into a share purchase agreement (the Share Purchase Agreement) with Juan Lemus, the sole shareholder of Commsa. The Share Purchase Agreement contemplated the acquisition by the Company of 51% of the share capital of Commsa, a newly-formed company, which has the mining rights to five operating mines that run along a 12.5-mile stretch of the Rio Jalan River, in consideration for $1,000,000 in cash and the issuance of 5,000,000 shares of the Companys common stock to Mr. Lemus (the Commsa Acquisition). In addition, the Company has agreed to provide up to $7,500,000 in working capital to expand the mining operations in a gold mining project (Rio Jalan Project) in Olancho state in the highlands of Central Honduras. The Company did not meet its obligations for the consummation of the Commsa Acquisition by March 31, 2022 as set forth in the Share Purchase Agreement; however, the parties did not terminate the Share Purchase Agreement, intending that the Company would be able to obtain the necessary funding later and to consummate the Commsa Acquisition.\nOn August 14, 2023, the Company and Juan Lemus executed an addendum to the Share Exchange Agreement (the which provided for the extension of the Companys obligations to pay $1,000,000 in cash, the issuance of 5,000,000 shares of the Companys common stock to Mr. Lemus and the payment of $7,500,000 in working capital until September 30, 2023. The first addendum provides that if the Company does not comply with these obligations set forth in the Addendum until September 30, 2023, the Share Purchase Agreement will be null and void. On September 28, 2023, the parties executed the second addendum, extending the timing of the Companys payment from September 30, 2023 to December 31, 2023.\nOn March 19, 2023, the Company entered into and executed a share purchase agreement (the Share Purchase Agreement) with Lion Works and Juan Lemus, the sole shareholder of Lion Works, which contemplated the acquisition by the Company, as Buyer, from Mr. Lemus, as Seller, of 51% of the capital stock of Lion Works, including 51% of the intellectual property rights and know-how related to the Genesis extraction system (Genesis), The Share Purchase Agreement superseded the terms of the binding Letter of Intent that the parties entered into on November 21, 2021. Pursuant to the terms of the Share Purchase Agreement, the Companys consideration for the acquisition of 51% of Lion Works consists of the following:\n· The total purchase price of $5,100,000 in cash, with the first minimum payment in the amount of $2,550,000 to be paid by September 30, 2023, and the remaining outstanding balance of $2,550,000 to be paid by September 30, 2024, within 12 months of the first payment.\n· The Company will invest an additional 5,000,000 as a working capital toward the development of the Genesis plants, with $2,000,000 to be paid by July 31, 2023, and the remaining $3,000,000 to be paid by July 31, 2024, within 12 months of the first payment.\n· The Company will engage a patent attorney and pay for the cost of that patent attorney to prepare the patent application related to Genesis and to register that patent, provided that Lion Works will engage an expert to prepare a report on the Genesis system, to be used in this patent application.\nThe parties agreed that the closing of the transactions contemplated by the Share Purchase Agreement will occur on or before March 19, 2023 or at such other time and place as the Buyer and the Seller may agree, provided that (i) the Seller receives the first tranche of working capital funds in the amount of $2,000 prior to the execution and delivery of (i) the paperwork necessary for the attorney to complete the patent submission, (ii) all documentation necessary for the buyer to market the Genesis program, (iii) any other document, certificate or instrument to consummate the transactions contemplated by the Share Purchase Agreement.\nOn July 21, 2023, Juan Lemus and the Company executed the first addendum to the Share Purchase Agreement, pursuant to which the Companys obligations to pay $2,000,000 as working capital was extended until September 30, 2023, and the parties agreed that upon such payment and the first minimum payment in the amount of $2,550,000 toward the total purchase price on or prior to September 30, 2023 by the Company, the parties will close the transactions contemplated by the Share Purchase Agreement, and Lion Works will become a majority-owned subsidiary of the Company. On September 28, 2023, the parties executed the second addendum, which extended the terms of the Companys payments to December 31, 2023.\nPurchase Agreement and Registration Rights Agreement with Keystone.\nOn March 15, 2023, the Company entered into and executed the Purchase Agreement and a Registration Rights Agreement with Keystone, pursuant to which the Company shall have the right, but not the obligation, to direct Keystone, an unrelated third party, to purchase up to 75,000,000 shares of its Common Stock (the Shares), pursuant to separate purchase notices to be delivered by the Company to Keystone from time to time (each, a Purchase Notice). The Purchase Agreement provides that each Purchase Notice may be for not less than $20,000 and not more than $75,000 worth of the Companys Common Stock. The price per share of Common Stock shall be eighty-five percent (85%) of the average of the closing prices per share of the Companys Common Stock for five (5) trading days preceding the purchase.\nOur ability to require Keystone to purchase the Shares under the Purchase Agreement is subject to various limitations and conditions, including but not limited to the following:\n· The Company shall have performed, satisfied and complied in all material respects with all covenants, agreements and conditions required by the Purchase Agreement and the Registration Rights Agreement to be performed, satisfied or complied with by the Company;\n· The Company shall deliver to Keystone on the Commencement Date (as defined in the Purchase Agreement) the compliance certificate executed by the Companys executive officer\n· The initial registration statement, which covers the resale by Keystone of the Registrable Securities (as defined in the Registration Rights Agreement), including the Commitment Shares and the shares to be issued pursuant to the Purchase Notice, shall have been declared effective under the Securities Act by the SEC, and Keystone shall be permitted to utilize the prospectus therein to resell (a) all of the Commitment Shares and (b) all of the Shares included in that prospectus\n· The applicable purchase price for each Purchase Notice must be not less than $0.01 per share\n· At least five (5) trading days must have passed since the last Purchase Notice\n· The Companys Common Stock must be DWAC eligible\n· Keystones beneficial ownership of the Companys common stock is limited such that Keystone may not purchase shares of Stars common stock to the extent that, immediately following such purchase, Keystone would own more than 4.99% of Stars total issued and outstanding common stock.\n· Selling Stockholder shall have received an opinion from our outside legal counsel in the form previously agreed to.\n· Trading of the Companys Common Stock shall not have been suspended by the SEC, the Trading Market or the FINRA\nIn consideration for Keystone entering into the Purchase Agreement and to induce Keystone to execute and deliver the Purchase Agreement, the Company has agreed to issue to Keystone 1,000,000 Commitment Shares (as defined below). In addition, the Company agreed to provide Keystone with certain registration rights with respect to the Commitment Shares, and additional shares, including 500,000 shares of Common Stock to be issued to Keystone on the date the initial registration statement is declared effective, and 2,274,588 shares of the Companys Common Stock having an aggregate dollar value of $75,000 upon the investment by Keystone of more than $500,000 in the Company under the Purchase Agreement (collectively, the Additional Shares). The Commitment Shares issued and the Additional Shares that may be issued to Keystone pursuant to the Purchase Agreement were issued and will be issued pursuant to an exemption from registration under the Securities Act.\nThere is no guarantee that we will be able to meet the foregoing conditions or any other conditions under the Purchase Agreement or that we will be able to draw down any portion of the amounts available under the Purchase Agreement.\nPursuant to the Registration Rights Agreement, on June 15, 2023, we filed the registration statement on Form S-1 (SEC File No. 333-272671), as amended on August 28, 2023, to register for resale by Keystone up to 75,000,000 shares of Common Stock that may purchase under the Purchase Agreement (the Initial Registration Statement). The effectiveness of the Initial Registration Statement is a condition precedent to our ability to sell shares of our Common Stock to Keystone under the Purchase Agreement. The Company will use its commercially reasonable efforts to amend the Initial Registration Statement or file a new registration statement, to cover all of such Registrable Securities, subject to any limits that may be imposed by the SEC pursuant to Rule 415 under the Securities Act.\nSmaller Reporting Company Status\nWe qualify as a smaller reporting company under Rule 12b-2 of the Exchange Act, which is defined as a company with a public equity float of less than $75 million. To the extent that we remain a smaller reporting company at such time as are no longer an emerging growth company, we will still have reduced disclosure requirements for our public filings, some of which are similar to those of an emerging growth company, including not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act and the reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements.\nBusiness Overview\nWe are an exploration-stage company that focuses on acquisition and development of gold mining and other mining properties worldwide, environmentally safe technologies both in mining and other business areas. As of the date of this Annual Report, we have not commenced our mining operations. We anticipate starting our mining operations in 2024. We are also exploring acquisitions of assets or majority interests in companies related to artificial intelligence technology and in the fintech arena acquiring proprietary software technology. At this time, the Company is negotiating the terms of these potential acquisitions and once these terms are finalized, we will enter into one or more definitive agreements.\nThe Company requires substantial funding and additional work to implement its business plan with respect to its mining properties, including the acquisitions of 51% ownership in both (a) Compania Minera Metalurgica Centro Americana, a Honduran Corporation (Commsa). and (b) Lion Works Advertising, SA, a Guatemalan corporation (Lion Works), a company that owns the Genesis ore extraction process, as described below. If we complete these acquisitions and acquire the intellectual property rights to Genesis, we will grow our business and will be able to build a number of Genesis plants that can be placed in customer mining sites including our own Troy mining site. After we complete these acquisitions, we also need to purchase the equipment necessary and obtain a final mining permit, to start operation in Honduras and to use Genesis technology.\nAcquisition Strategy\nOur acquisition strategy is to acquire gold mining and other mining properties worldwide, environmentally safe technologies both in mining and other business areas that will help us to grow and to enhance our overall monetization strategy. Particularly, the Company is focused on the acquisition of companies or majority interests in companies that are employing highly specialized, environmentally safe and patented technologies for the extraction of gold, silver and other metals including lithium and rare earth elements with an additional focus on biodegradable technologies that will dramatically improve many everyday applications.\nAs of the date of this Annual Report, we are also exploring acquisitions of assets and majority interests in companies related to artificial intelligence technology and in the fintech arena. We are currently negotiating the terms of these potential acquisitions and once these terms are final, we will enter into one or more definitive agreements.\nTroy Asset Acquisition\nAs a result of the Troy Asset Acquisition, the Company acquired 78 gold mining claims consisting of approximately 1600 acres, located east/southeast of El Portal, California, in Mariposa County, together with all of Troys rights to related equipment and buildings currently located on the mining claims, including a production processing mill together with associated buildings, all the mining and support equipment at the Troy mine site, all the Troy mining claims, and related geological reports relating to the property, assay reports on the property, and all core drilling samples.\nThe federal government became involved in the gold mine when prosecuting the then owner and made a request of Dr. Robert B. Garcia to place an estimated value upon the project. Mr. Garcia has a long history as a developer, owner and operator of numerous mines and mining companies and a consultant for the mining and precious metal industries. He graduated from Arizona State University with a degree in chemistry, but his vocational experience is mainly as a metallurgist. He also consults within the mining industry as an expert witness in court litigations and has served as an assay referee in large bulk precious metals purchases and evaluations of mine properties for ore values and is a Board of Directors member of a Swiss Bullion License, duly appointed and registered with the Swiss Government which is why the federal government chose him as its consultant for this project. Mr. Garcias testimony under oath to the court on behalf of the federal government were significant and resulted in Stars acquisition of the mine from the current owners.\nThis valuation was prepared on August 5, 2004, and although this area has not been mined since 2002, the Company recognizes that a new Technical Report and Appraisal prepared under US current standards and regulations with extensive core drilling is needed. Management intends to use some of the funds raised from the S 1 registration to complete the drilling and updated valuation.\nThe Company is currently working with the US Forest Service, National Park Service and Bureau of land Management (BLM) to finalize the permits to reopen the mine. No permits have been issued yet. The Company expects to restart mining operations in 2024.\nPrevious Work on the Troy Claims:\nThe history of gold mining in Mariposa County dates back to placer mining by Mexicans or Californians of Spanish descent in 1848. Details concerning work in this time are limited. The discovery of lode gold in Mariposa is generally credited to Kit Carson and the discovery of the Mariposa mine in 1849; however, it is possible that the Mexicans were mining bedrock gold in Mariposa County prior to this discovery.\nSubsequent to this discovery, large portions of Mariposa County were covered by land grants issued to John Fremont (The Las Mariposas Spanish Land Grant) and the Cook Estate. Because these grants and their private administration covered much of the Mother Lode, mining and development of the area was not conducted in the same fashion as claims located on public land.\nThe 78 current mining claims registered to Troy Mining Corporation are located west/southwest of El Portal, California and are located on BLM land. The claims are accessible via California State route 140 with the prime portals located approximately two to two and one-half (2 - 2 ½) miles east of Hwy 140 (based on a direct route). There is a graded dirt road that connects the portals located the greatest distance from Hwy 140 with the highway that is owned and maintained by Star. This road is approximately eight (8) miles in length due to the many required switch-backs in order to build the road into the side of the mountain. With proper maintenance, which can be accomplished by the mining company using the equipment purchased for working the mine, this road is normally passable year-round. The road is shared with the US Forest Service and National Park Service who use it to maintain visual surveillance of the area and for fire fighting access and as part hiking trails. In addition to this road, there are additional roads owned by Star that connect the main portal with additional portals located within the claim area. Further, the claims are located at what is considered to be the east base of what is commonly known as the Mother Lode gold-quartz vein system.\nBackground of the Project:\nThe Project is located at the base of the gold mother lode in one of the three major vein belts where the greatest concentration of minerals settled over the years.\nThe project consists of mining claims located upon land under the control of BLM, US Forest Service and the National Park Service not the state of California with oversight being by these three agencies.\nThis is a hard rock mining project, not an open pit or placer type project resulting in much less oversight for air pollution and visual impact.\nIt is not a start-up project; it is the reopening of an existing, recently worked, project.\nThere is an existing grid of roads and trails that crisscross the project providing access to the prime portals. The roads are graded dirt that can be maintained as passable throughout the year and the trails can be expanded into passable roads. The estimated cost to build these roads and trails today would be in excess of $10 million.\nThere is a gravity flow ball mill installed on the project that is complete from an ore introduction conveyor system and both rough and crushed ore bins with a pneumatic air hammer/blaster system, through the separation portion of the mill including water and other solutions storage tanks and circulating system and separation tables. This equipment has a replacement cost of approximately $1.8 million.\nOn site there are two self-contained generators connected to existing electrical distribution panels with an on-site replacement cost of approximately $30,000. The project has multiple production shafts (portals) that have in-shaft railroad track installed.\nThe project has sufficient timber located within the claim areas to both provide shoring material for new tunneling and if so desired, to sell the excess.\nWhile this is primarily a gold recovery project, geologists and assay reports indicate the amount of recoverable silver available in quantity is equal to that of gold which adds considerable to the bottom-line profit.\nThe company has a large library of mining history of the area and the production shafts located within the project boundaries along with extensive exploration and geology maps, reports.\nOverview of Previous Mining Operations on the Troy Claims:\nThere are three main portals (Hite Mine, Gibbs/Williams Brothers Mine and the Gold Star Mine) located within the area currently included in the Troy mining claims that have been worked from as early as 1849 to as recently as 1996 (Note: in total there are 17 portals on the property). These mines have never been worked with modern equipment but have always been worked with dynamite and pick & shovel with the ore being transported via pack mule prior to the construction of the access road. The roadway system currently in place allows for the ore to be moved via truck either to the processing mill located at the site of the main portal or to off-site locations if it should be desired to do so. All of the mining done in this area is what is known as Hardrock or below-grade, tunnel mining. The past total production from the mines located within this area is considerable. A large portion of this production was done when the price of gold was around $20 per ounce but based on todays prices this would be very significant. During the production years for these mines, the technique followed by the Hardrock miners was known as drift mining where the miner located an external outcropping and then followed the gold vein until it petered out then he moved to another outcropping location. Underground mining extended to 900 feet with development extending down to 1200 feet in depth. Elsewhere on the property, mining and development all occurred within 100 feet of the surface.\nPrevious Work on the Troy Claims:\nThe history of gold mining in Mariposa County dates back to placer mining by Mexicans or Californians of Spanish descent in 1848. Details concerning work in this time are limited. The discovery of lode gold in Mariposa is generally credited to Kit Carson and the discovery of the Mariposa mine in 1849; however, it is possible that the Mexicans were mining bedrock gold in Mariposa County prior to this discovery.\nSubsequent to this discovery, large portions of Mariposa County were covered by land grants issued to John Fremont (The Las Mariposas Spanish Land Grant) and the Cook Estate. Because these grants and their private administration covered much of the Mother Lode, mining and development of the area was not conducted in the same fashion as claims located on public land.\nMINE SUMMARY:\nThe Mother Lode is the most extensive mineral zone in the State of California. It extends from the southern part of Mariposa County to the northern part of El Dorado County, a distance of 300 miles, then extends northeast along the Sierra Nevada foothills. Some of the most famous and productive gold mines in the West are located along the length of this mineral zone. The Mother Lode Gold Belt is a long, narrow strip on the western foothills of the Sierra Nevada mountain range. There is a wall-like mass of quartz that outcrops at intervals along the belt. The wide zone of parallel and discontinuous gold vein deposits is referred to as the Mother Lode System.\nMariposa County, California, has a long history of gold production from small lode and placer mining operations. The county covers part of the Sierra Nevada Mother Lode belt first discovered in the 19th century. The majority of gold production occurred prior to 1900 and was taken from mineralized quartz veins. The gold price at that time was $20.00/ounce compared to approximately $1,900 per ounce currently. The unproven production at that time would have had a value of several billion dollars if current pricing was used.\nFrom the discovery of gold at Sutter's Mill on the American River on January 24, 1848 to the present, the area known as the Mother Lode Region has been one of most prolific gold producing areas in the world. In 1849, Quartz lode mining began on claims that currently make up part of the Troy Mining claims. Later this mine was one of the first to install a stamp mill, which ground the quartz ore to separate out the free gold.\nThe Troy Mining (Troy) property is specifically located geologically, at the southern end of the Mother Lode System in Central East California, Mariposa County, approximately 200 miles east of San Francisco. The property borders on the western the age of Yosemite National Park in the El Portal, California quadrangle, and is three miles southwest of the town of the El Portal, California. The mining property is bounded on the north by the Middle Fork of the Merced River and on the south by the South Fork of the Merced River. The property ranges in elevation from 1,700 feet to 5,500 feet and with workers housed on-site, can be worked year-round. The claims in each of the two main claim groups are contiguous. The maps and mine co-ordinates are included in this report. ….\nThe former AT&E Company controlled approximately 10,500 acres of ground in Mariposa County, California, covering 250 mining claims. The property was acquired from AT&E in the late 90s by USA Mining and then the 79 most important claims were reinstated by Troy Mining in the early 2000s (Note: both these transactions occurred when gold was less than $300/oz). The property includes more than 50 mine portals dating back to the late 1800s or early 1900s most of which have not been located and viewed by the current owner. Because of the existence of historical mining records, nine of these mines have been characterized as former gold producing mines. Included in this list of mines is the Hite Mine. With estimated total production of at least 150,000 ounces, the Hite Mine is ranked as the fifth largest historic gold producing mine in Mariposa County.\nThe property includes the following historic recognized gold mines: Hite, (6) Hite Central, (7) Kaderitas, (8) Mexican II, and Williams Brothers. In addition, there are at least 50 additional mining portals which were, in the last 150 years, actively producing gold in unknown quantities. These mines were actively producing with pick and shovel and pack-mule. No modern equipment or scientific means of geological study have ever been employed.\nThe company has a very excellent working relation with the BLM, US Forest Service and National Park Service officials that will be involved in the projects operation.\n· It has secured a commitment from Mark Payne and Mr. Jon Grossman to become members of its on-site management team along with the same commitment.\n· Mark Payne attended California State University Sacramento, Bachelor of Arts Geological Sciences Program and has been an independent geological consultant since 1985. He is a California Registered Professional Geologist #7067, and a member of the American Institute of Professional Geologists. He specializes in exploration, definition and resource estimation of gold-quartz vein systems and gold deposits dominated by coarse particulate gold and has served as chief geologist for several major companies such as Emgold Mining Corp and Sutter Gold Mining.\n· Mr. Grossman received his BS in Economics from the Wharton School of Finance, University of Pennsylvania and has been involved in the precious metal and various aspects of the mining business for more than 30 years. At one time in his career, he was Director of Investment Banking on Wall Street and has been instrumental in founding and growing several businesses including Florida Bullion Traders, Inc. One of his major assets is the fact he was the General Manager of the mining operation that was owned by Mr. Geiger and that operated the mining project during its productive period and has a hands-on/on-site knowledge of the proper operating methods for this project.\nMINE LOCATION:\nThe list attached includes the mine location sites per the original listing of the claims with the Bureau of Land Management. In addition, each mine is listed with its specific locations.\nMain Mine Site Co-Ordinates (Blue Dot)\n37°3950 North; 119°5231 West\nThis is the area where the mine is located.\nINDIVIDUAL CLAIM CO-ORDINATES\nTROY CLAIM NUMBER\nLOCATION OF MINING CLAIMS\nQuarter-section, section, township, range and Meridian\nTroy 1\nNE1/4 of Section 30, T3S, R20E, M.D.M\n3568 feet north and 1822 feet west from the SE corner of\nSection 30, T3S, R20E M.D.B.M\nClain is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N44°06'E to the S44°06'E\nTroy 2\nNE1/4 of Section 30, T3S, R20E, M.D.M\nSE 1/4 of Section 30, T3S, R20E, M.D.M\n2228 feet north and 649 feet west from the SE corner of\nSection 30, T3S, R20E M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 3\nNE1/4 of Section 30, T3S, R20E, M.D.M\nSE 1/4 of Section 30, T3S, R20E, M.D.M\n1797 feet north and 1067 feet west from the SE corner of\nSection 30, T3S, R20E M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 4\nNE1/4 of Section 30, T3S, R20E, M.D.M\nSE 1/4 of Section 29, T3S, R20E, M.D.M\n1797 feet north and 1067 feet west from the SE corner of\nSection 30, T3S, R20E M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 5\nNE1/4 of Section 30, T3S, R20E, M.D.M\n323 feet north and 407 feet west from the SE corner of\nSection 30, T3S, R20E M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 6\nNE1/4 of Section 31, T3S, R20E, M.D.M\nSE 1/4 of Section 30, T3S, R20E, M.D.M\n108 feet south and 825 feet west from the SE corner of\nSection 30, T3S, R20E M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 7\nNE1/4 of Section 31, T3S, R20E, M.D.M\nSE 1/4 of Section 30, T3S, R20E, M.D.M\nNW 1/4 of Section 32, T3S, R20E, M.D.M\nSW 1/4 of Section 29, T3S, R20E, M.D.M\n288 feet north and 371 feet west from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 8\nNE1/4 of Section 31, T3S, R20E, M.D.M\nSE 1/4 of Section 30, T3S, R20E, M.D.M\nNW 1/4 of Section 32, T3S, R20E, M.D.M\n143 feet north and 789 feet west from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 9\nNE1/4 of Section 31, T3S, R20E, M.D.M\nNW 1/4 of Section 32, T3S, R20E, M.D.M\n1187 feet south and 289 feet east from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 10\nNE1/4 of Section 31, T3S, R20E, M.D.M\nNW 1/4 of Section 32, T3S, R20E, M.D.M\n2035 feet south and 302 feet east from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 11\nNE1/4 of Section 31, T3S, R20E, M.D.M\nSW 1/4 of Section 32, T3S, R20E, M.D.M\n2070 feet south and 338 feet east from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 12\nNE1/4 of Section 31, T3S, R20E, M.D.M\nSE 1/4 of Section 31, t3S, R20E, M.D.M\nNW 1/4 of Section 32, T3S, R20E, M.D.M\n2466 feet south and 116 feet west from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 13\nNE1/4 of Section 31, T3S, R20E, M.D.M\nSE 1/4 of Section 31, T3S, R20E, M.D.M\nNW 1/4 of Section 32, T3S, R20E, M.D.M\nSW 1/4 of Section 32, T3S, R20E, M.D.M\n2501 feet south and 80 feet west from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 14\nNE 1/4 of Section 31, T3S, R20E, M.D.M\nSE 1/4 of Section 31, T3S, R20E, M.D.M\n2897 feet south and 533 feet west of the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\ntroy 15\nSE 1/4 of Section 31, T3S, R20E, M.D.M\nSW 1/4 of Section 32, T3S, R20E, M.D.M\n2932 feet south and 497 feet west of the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 16\nNE 1/4 of Section 31, T3S, R20E, M.D.M\nSE 1/4 of Section 31, T3S, R20E, M.D.M\n3238 feet south and 951 feet west from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 17\nSE 1/4 of Section 31, T3S, R20E, M.D.M\nSW 1/4 of Section 32, T3S, R20E, M.D.M\n3363 feet south and 915 feet west from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 19\nNE1/4 of Section 31, T3S, R20E, M.D.M\nSE 1/4 of Section 31, T3S, R20E, M.D.M\nNW 1/4 of Section 31, T3S, R20E, M.D.M\nSW 1/4 of Section 31, T3S, R20E, M.D.M\n2715 feet south and 2446 feet west from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 20\nNE 1/4 of Section 31, T3S, R20E, M.D.M\nSE 1/4 of Section 31, T3S, R20E, M.D.M\nSW 1/4 of section 31, T3S, R20E, M.D.M\n3759 feet south and 1368 feet west from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 21\nSE 1/4 of Section 31, T3S, R20E, M.D.M\n3794 feet south and 1332 feet west from the SE corner of\nSection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\ngeneral course of the lode is from N45°54'W to the S45°54'E\ndirection\nTroy 48\nNE 1/4 of Section 19, T3S, R20E, M.D.M\n8493 feet north and 2633 feet west from the southeast corner\nof section 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course of lode is N9°24'W to S9°24'E direction\nTroy 49\nNE1/4 of Section 19, T3S, R20E, M.D.M\nSE 1/4 of Section 19, T3S, R20E, M.D.M\nNW 1/4 of Section 19, T3S, R20E, M.D.M.\nSW 1/4 of Section 19, T3S, R20E, M.D.M\n7849 feet north and 3149 feet west from the southeast corner\nof section 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course of lode is N9°24'W to S9°24'E direction\nTroy 50\nNE1/4 of Section 19, T3S, R20E, M.D.M\nSE 1/4 of Section 19, T3S, R20E, M.D.M\n8354 feet north and 2625 feet west from the southeast corner\nof section 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course of lode is N9°24'W to S9°24'E direction\nTroy 51\nNE1/4 of Section 19, T3S, R20E, M.D.M\nSE 1/4 of Section 19, T3S, R20E, M.D.M\nSW 1/4 of Section 19, T3S, R20E, M.D.M\n7799 feet north and 3141 feet west from the southeast corner\nof section 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course of lode is N9°24'W to S9°24'E direction\nTroy 52\nNE1/4 of Section 30, T3S, R20E, M.D.M\nSE 1/4 of Section 19, T3S, R20E, M.D.M\n5443 feet north and 2143 feet west from the southeast corner\nof section 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course of lode is N9°24'W to S9°24'E direction\nTroy 53\nNE1/4 of Section 30, T3S, R20E, M.D.M\nSE 1/4 of Section 19, T3S, R20E, M.D.M\nNW 1/4 of Section 30, T3S, R20E, M.D.M.\nSW 1/4 of Section 19, T3S, R20E, M.D.M\n4889 feet north and 2660 feet west from the southeast corner\nof section 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course of lode is N9°24'W to S9°24'E direction\nNE1/4 of Section 30, T3S, R20E, M.D.M\nTroy 54\nSE 1/4 of Section 19, T3S, R20E, M.D.M\n5394 feet north and 2134 feet west from the Southeast corner\nof section 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course of lode is N9°24'W to S9°24'E direction\nTroy 55\nNE 1/4 of Section 30, T3S, R20E, M.D.M\nNW 1/4 of Section 30, T3S, R20E, M.D.M\n4839 feet north and 2651 ffet west from the SE corner of\nsection 30, T3S, R20E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course of lode is N9°24'W to S9°24'E direction\nTroy 60\nNE1/4 of Section 21 T3S, R19E, M.D.M\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nNW 1/4 of Section 21, T3S, R19E, M.D.M.\nSW 1/4 of Section 21, T3S, R19E, M.D.M\n141 feet north and 997 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 61\nNE1/4 of Section 21 T3S, R19E, M.D.M\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nNW 1/4 of Section 22, T3S, R19E, M.D.M.\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n141 feet north and 947 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 62\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nSW 1/4 of Section 21, T3S, R19E, M.D.M\n459 feet south and 997 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 63\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nSW 1/4 of Section 21, T3S, R19E, M.D.M\n459 feet south and 947 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 64\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nSW 1/4 of Section 21, T3S, R19E, M.D.M\n1059 feet south and 997 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 65\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n1059 feet south and 997 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 66\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nSW 1/4 of Section 21, T3S, R19E, M.D.M\n1659 feet south and 997 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 67\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n1659 feet south and 997 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 68\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n2259 feet south and 997 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 69\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n2259 feet south and 947 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 70\nNE1/4 of Section 28 T3S, R19E, M.D.M\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nNW 1/4 of Section 28, T3S, R19E, M.D.M.\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n2859 feet south and 947 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 71\nNE1/4 of Section 28 T3S, R19E, M.D.M\nSE 1/4 of Section 21, T3S, R19E, M.D.M\nNW 1/4 of Section 27, T3S, R19E, M.D.M.\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n2859 feet south and 947 feet west from the W 1/4 corner\nof section 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 80\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n1059 feet south and 2003 feet east from the w 1/4 corner of\nsection 22, T3S, R16E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 81\nSE 1/4 of Section 22, T3S, R19E, M.D.M\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n1053 feet south and 2053 feet east from the W 1/4 corner\nsection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 82\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n1659 feet south and 2003 feet east from the W 1/4 corner of\nSection 22, T3S, R16E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 83\nSE 1/4 of Section 22, T3S, R19E, M.D.M\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n1659 feet south and 2053 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 84\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n2259 feet south and 2003 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 85\nSE 1/4 of Section 22, T3S, R19E, M.D.M\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n2259 feet south and 2053 feet east from the W 1/4 corenre of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 86\nNW 1/4 of Section 27, T3S, R19E, M.D.M\nSW 1/4 of Section 22, T3S, R19E, M.D.M\n2859 feet south and 2003 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 87\nNE 1/4 of Section 27, T3S, R20E, M.D.M\nSE 1/4 of Section 22, T3S, R20E, M.D.M\nNW 1/4 of Section 27, T3S, R20E, M.D.M.\nSW 1/4 of Section 22, T3S, R20E, M.D.M\n2859 feet south and 2053 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 89\nNE 1/4 of Section 27, T3S, R20E, M.D.M\nNW 1/4 of Section 27, T3S, R20E, M.D.M.\n3459 feet south and 2053 feet east from the W 1/4 corner of\nSection 22, T3S, R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 91\nNE 1/4 of Section 27, TS, R19E, M.D.M\nNW 1/4 of Section 27, T3S, R19E, M.D.M.\n4059 feet south and 2053 feet east from the W 1/4 corner of\nSection 22, t3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 93\nNE 1/4 of Section 27, TS, R19E, M.D.M\nNW 1/4 of Section 27, T3S, R19E, M.D.M.\n4659 feet south and 2053 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 95\nNE 1/4 of Section 27, TS, R19E, M.D.M\nSE 1/4 of Section 27, T3S, R19E, M.D.M\nNW 1/4 of Section 27, T3S, R19E, M.D.M.\nSW 1/4 of Section 27, T3S, R19E, M.D.M\n5259 feet south and 2053 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 97\nSE 1/4 of Section 27, T3S, R19E, M.D.M\nSW 1/4 of Section 27, T3S, R19E, M.D.M.\n5859 feet south and 2053 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 98\nSE 1/4 of Section 22, T3S, R19E, M.D.M\n459 feet south and 5003 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 99\nSE 1/4 of Section 22, T3S, R19E, M.D.M\nSW 1/4 of Section 23, T3S, R19E, M.D.M.\n459 feet south and 5003 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 100\nSE 1/4 of Section 22, T3S, R19E, M.D.M\n1059 feet south and 5003 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 101\nSE 1/4 of Section 22, T3S, R19E, M.D.M\nSW 1/4 of Section 23, T3S, R19E, M.D.M.\n1059 feet south and 5053 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 102\nSE 1/4 of Section 22, T3S, R19E, M.D.M\n1659 feet south and 5003 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 103\nSE 1/4 of Section 22, T3S, R19E, M.D.M\nSW 1/4 of Section 23, T3S, R19E, M.D.M.\n1659 feet south and 5053 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 104\nSE 1/4 of Section 22, T3S, R19E, M.D.M\n2259 feet south and 5003 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 105\nSE 1/4 of Section 22, T3S, R19E, M.D.M\nSW 1/4 of Section 23, T3S, R19E, M.D.M.\n2259 feet south and 5053 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 106\nNE 1/4 of Section 27, TS, R19E, M.D.M\nSE 1/4 of Section 22, T3S, R19E, M.D.M.\n2859 feet south and 5003 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 107\nNE 1/4 of Section 27, TS, R19E, M.D.M\nSE 1/4 of Section 22, T3S, R19E, M.D.M\nNW 1/4 of Section 26, T3S, R19E, M.D.M.\nSW 1/4 of Section 23, T3S, R19E, M.D.M\n2859 feet south and 5053 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 108\nNE 1/4 of Section 27, TS, R19E, M.D.M\n3459 feet south and 5003 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 109\nNE 1/4 of Section 27, TS, R19E, M.D.M\nNW 1/4 of Section 26, T3S, R19E, M.D.M.\n3459 feet south and 5053 feet east from the W 1/4 corner of\nSection 22, T3S, R19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 110\nNE 1/4 of Section 27, TS, R19E, M.D.M\n4059 feet south and 4428 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 111\nNE 1/4 of Section 27, T3S, R19E, M.D.M\nNW 1/4 of Section 26, T3S, R19E, M.D.M.\n4059 feet south and 6503 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTriy 112\nNE 1/4 of Section 27, TS, R19E, M.D.M\n4659 feet south and 3553 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 113\nNE 1/4 of Section 27, T3S, R19E, M.D.M\nNW 1/4 of Section 26, T3S, R19E, M.D.M.\n4659 feet south and 6503 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 114\nNE 1/4 of Section 27, T3S, R19E, M.D.M\nSE 1/4 of Section 27, T3S, R19E, M.D.M.\n5269 feet south and 3553 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 115\nNE 1/4 of Section 27, T3S, R19E, M.D.M\nSE 1/4 of Section 27, T3S, R19E, M.D.M\nNW 1/4 of Section 26, T3S, R19E, M.D.M.\nSW 1/4 of Section 26, T3S, R19E, M.D.M\n5259 feet south and 6503 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 116\nNE 1/4 of Section 26, T3S, R19E, M.D.M\nSE 1/4 of Section 23, T3S, R19E, M.D.M\nNW 1/4 of Section 26, T3S, R19E, M.D.M.\nSW 1/4 of Section 23, T3S, R19E, M.D.M\n2859 feet south and 6553 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 117\nNE 1/4 of Section 26, TS, R19E, M.D.M\nNW 1/4 of Section 26, T3S, R19E, M.D.M.\n3459 feet south and 6553 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 118\nNE 1/4 of Section 26, TS, R19E, M.D.M\nNW 1/4 of Section 26, T3S, R19E, M.D.M.\n4059 feet south and 6553 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 121\nSE 1/4 of Section 23, T3S, R19E, M.D.M\nSW 1/4 of Section 23, T3S, R19E, M.D.M\n459 feet south and 8003 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 122\nSE 1/4 of Section 23, T3S, R19E, M.D.M\nSW 1/4 of Section 23, T3S, R19E, M.D.M\n1059 feet south and 8003 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 123\nSE 1/4 of Section 23, T3S, R19E, M.D.M\nSW 1/4 of Section 23, T3S, R19E, M.D.M\n1659 feet south and 8003 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nTroy 124\nSE 1/4 of Section 23, T3S, R19E, M.D.M\nSW 1/4 of Section 23, T3S, R19E, M.D.M\n2259 feet south and 8003 feet east from the W 1/4 corner of\nSection 22, T3S. R 19E, M.D.B.M\nClaim is approximately 1500 feet long and 600 feet wide\nGeneral course load is from easterly to westerly direction\nThe Troy Mining Zone Location Map - Mariposa County\nLocation of Stars Mining Property\nWithin the Historic California Mother Load\nThere are seven (7) portals. The method Troy used to stake its claims was to land-lock the area surrounding these claims in a way to prevent outside interests to stake the additional original AT&E claims. Since existing roads, trails, etc. may be expanded but no new ones constructed without further government approval, this program proved effective. Troys plan was at such time as it was ready to begin opening the various portals for production to survey and stake the additional 290+ claims facilitated by its road and trail structure that provides access to them. These additional claims together with the existing claims would provide Star with control over ~10,500 acres, 130 miles due East of San Francisco Bay.\nPhotographs of the Troy Mining Zone\nThe Mining Property, showing site buildings\nMining Property\nMining Property\nMine Shaft\nBunker\nMain Road\nMine\nMill\nMill\nMill\nMill\nMill Building\nRock Face Inside the Mine Showing Ore\nBunker\nMine Map\nInside Mine\nInside Mine\nSeveral Pictures Taken at the Mine Site late November 2019 Follow\ncommsa mining rights\nIf the Company consummates the Commsa Acquisition under the Share Purchase Agreement with Mr. Lemus, it will acquire 51% of Commsa, a Honduran Corporation, and as a part of that acquisition the Company will acquire Commsas mining rights to five mines that run near a stretch of the Rio Jalan River and are in the process of being prepared for mining production. Below is the summary of Commsa Mining Rights.\nThe environmental licenses have been obtained and exploration is ongoing. Local small mining operations are producing a minimum of 250 to 300 oz of gold per site per month while losing approximately 50% of the recoverable gold particles. We expect that our expanded operations, using modern equipment and our new Genesis program, recently acquired, should result in up to a 98% rate of recoverable gold, leading to significantly higher quantities of gold per site.\nLocated two hours from the capital city of Choluteca, Honduras, CONNSA owns the concession for unlimited exploitation, land and drill holes. The Potosi area is rugged with elevations ranging from 300m to 1050m ASL. Saprolite and quartz - rich outcrop provide often treacherous footing on steep hills. Outcrop is sparse with topographic highs being capped either by resistant quartz - veined andesites, Padre Miguel group rocks or rhyolite intrusive doming.\nHardy plants and trees populate the regions proportional to altitude, soil, and water supply. Generally, the topographically higher elevations are covered with pine forests and pine needle carpets. Lower regions, especially in stream and river drainages are covered in deciduous single canopy jungle.\nCholuteca, the fourth largest city in Honduras, has a wide range of hotels and rental dwellings as well as good supply, repair, and communications infrastructure. The city and the national capital, Tegucigalpa, are joined by 130km of the paved highway. The highway also provides access from Choluteca to Clavos Road, one of many logging and agricultural roads throughout the area. Potosi is reached by driving 50km east on the highway from Choluteca and taking the dirt road to Porteritos, a total of 1.5 hours driving time. The highway has both passenger and heavy transport capabilities.\nCholuteca is serviced by twelve daily bus runs. Daily international airline service is available to Tegucigalpa from every country while Choluteca is serviced by an airstrip capable of landing 737 sized aircraft.\nA large, skilled labor force with some mining experience, can be mobilized in most Honduran towns. The mining concessions are centered at 13 15N and 87 00Win the area of Choluteca, Honduras.\nMining and exploration history\nAt present, the Potosi area is not being mined by other than small, high-grade operations consisting of one or two local individuals. They focus upon known occurrences such as Tajo, San Antonio and, lately, San Benito with hand tools, cobbing and molinete techniques. The area has seen sporadic gold mining activity since the time of the Spanish colonists 100 hundred years ago. Within the Potosi concession, Rosario Mining performed large scale underground tunneling in the Guadaloupe, San Antonio, Guapinol, El Caballo and Tajo adits using tracked techniques of First World War vintage. Brush-overgrown roads and at least several hundred meters of tunnels, most of them collapsed, are the legacy of this earlier work. An unnamed American company did some small shafts and tunnels at Volcancito, and Jobos. No production records or plans are available.\nGeology Project\nPerhaps ten percent of the Potosi area is rock outcrop. In a macro sense the outcrop available for mapping may be broken up into two Tertiary volcanic rock groups: the Oligocene Matagalpa Formation (mainly andesitic in composition) and the Miocene Padre Miguel Group (mainly rhyolite / dacite). Matagalpa Formation rocks contain andesite flows, crystal tuffs, feldspar porphyries, basalt, and finer grained volcano-sediments unconformably overlain by the Padre Miguel rocks (rhyolitic to dacitic tuffs). Later stage rhyolite doming occurs in the San Antonio Mine area and immediately east of the San Benito occurrence. The Cerro Potosi topographic high is probably correlative to the Padre Miguel group rooks. Later stage mafic, intermediate, and felsic diking crosscut the main units. Padre Miguel rocks are invariably bleached white to pink to grey mass of devitrified and silicified rhyolite to dacite, ignimbrite or silicified breccia. White, angular metamorphosed/altered clasts are diagnostic of this occurrence at Pantaleon. Welding is observable in core.\nAt Potosi, the rock types are variations on the Matagalpa theme, except for Pantaleon, where the prime target was gold bearing epithermal quartz veining within Padre Miguel rocks. It was also hoped that the contact between the Padre Miguel and Matagalpa rocks would be a logical horizon for gold alteration zones.\nThe majority of outcrop mapped on the project is from the Matagalpa group: a flat-lying sequence of medium grained porphyritic tuff breccia of intermediate composition. Markedly porphyritic flows were mapped on surface and logged in drill holes. The size and shape of the light grey/white feldspar phenocrysts varies from millimeter to slightly less than 0,75 cm. More massive, non-porphyritic, fine-grained andesite was identified either as volcanic flow or tuffs. The Matagalpa group is predominantly subaerial with limited sections of banded, lamellar tuffs which may have been subaqueous. Pyroclastic andesite breccias are mapped and logged in all the focus zones. Heterolithic lapilli are common constituents of the lapilli tuff. Heterolithic agglomeratic andesite and medium to coarse tuff breccia is logged in the San Benito drill holes. Fine grained intermediate dykes which may be feeder dykes cut the same drill holes.\nFelsic intrusive domes are subaerial in nature. Flow banding and spherulites are common. The main target of the drilling at San Antonio and Tajo is epithermal quartz veining and attendant alteration and silicification zones.\nStructure: The principal trend mapped at San Antonio dips steeply to the north and is coincident with an east - west striking ridge. The trend is traceable on surface from San Antonio through Corales / Guadaloupe where the strike becomes more northerly, increasing from generally east-west to west-north-west (270 to 310/320). There are indications that the west-north-west striking Corales / Guadaloupe Mines exploit a second structure mirroring the Nicaraguan trough. This trend disrupts the east-west trend hosting the San Antonio structure.\nEpithermal quartz veining is evidently controlled by structurally prepared fault and fracture zones. These zones have provided the conduit for gold bearing siliceous fluids driven by felsic doming as a \"heat engine\".\nAlteration: Feldspar and clay alteration is to moderate intense in the weathering horizon and adjacent to structurally affected areas and/or within the aura of related, epithermally altered, siliceous zones. This alteration is in direct proportion to proximity of structural movement and quartz veining. The near surface feldspar phenocrysts are soft, crumbly and subhedral to anhedral in form. Sausseritization is common in core.\nHematization is ubiquitous in surface rocks due to the weathering profile created by meteoric water circulation and subsequent oxidation. Faulted and fractured rocks are also commonly hematized to varying extents.\nSilicification: All rock units have silicified intersections (usually influenced by epithermal quartz veining) although pervasive silicification has been noted on the metre scales in core and adjacent to quartz breccia zones during the mapping phase. Epidotization is part of a classic zonation especially noticeable at San Benito where pervasive epidote gives way to pyritization and finally to silicification proximal to epithermal quartz veining and associated chalcopyrite, galena, sphalerite, silver minerals and gold.\nSulphides / mineralization: There is a distinct correlation between the presence of sulphide presence, type, and percentages to gold mineralization as noted in zone descriptions and core logs. Sulphides are not consistent as to type or quantity between drilled zones. If indeed there is a gold pathfinder element at Potosi, it is copper. Chalcopyrite, galena, pyrite, sphalerite, silver minerals (acanthite) and their oxide analogues are present in the best mineralized intersections..\nBelow is a mineral resource summary for the Clavos. The report is compiled from internationally validated exploration documentation that meets the standards set by Canadian National Instrument 43-101, (NI 43-101) and National Instrument 43-101CP, and National Instrument 43-101F1.\nClavos\n1996 sampling traverses by Entre Mares personnel (geologists Scoretz, Malfair, Cheng, Fraser and McCarthy at different times) indicated that anomalous gold was present at Clavos zone in structurally and stratigraphically favorable terrain. Then by an independent group of Geologist from Guatemala lead by Ruben Leal in 2005 and then again in 2020 further sampling from Clavos confirmed the ancient mineralized zones, as well as new potential ones and complete economics and metallurgic reports.\nThe Choluteca concessions encompass an area characterized by steep hills, rugged relief interspersed with rounded coast mountains and ridges and domes interspersed with precipitous valleys. Cliffs are not uncommon particularly along zones of structural uplift or downthrow.\nPhysiography and Climate\nClavos is steeper topographically with rhyolite doming and very steep valleys throughout the property.\nTopography varies widely from 60m on the west side to 1190m in the northeast corner of the properties.\nHonduras is subject to temperatures ranging from the low 20's into the 40's (degrees Celsius) dependent upon the season. Climate is logically broken up into extremes: the rainy season (June to October) and the dry season (November to May).\nPotosi\nLocation and access\nThe Potosi Project is in the Municipality of Concepcion de Maria in southern Honduras, Department of Choluteca.\nMap 2855-IV (Concepcion de Maria - Cinco Pinos, 1:50,000 topographic sheet) covers most of the property. The nearest center of commerce is Choluteca, the fourth largest city in Honduras.\nAccess to Potosi is best achieved from the San Francisco turn-off on the Pan American Highway east of Choluteca. A 1.5-hour journey from Choluteca by 4x4 to the village of Porteritos via highway and dirt road is the most efficient means of travel.\nPhysiography\nThe Potosi area is rugged with elevations ranging from 300m to 1050m ASL. Saprolite and quartz - rich outcrop provide often treacherous footing on steep hills. Outcrop is sparse with topographic highs being capped either by resistant quartz - veined andesites, Padre Miguel group rocks or rhyolite intrusive doming.\nHardy plants and trees populate the regions proportional to altitude, soil, and water supply. Generally, the topographically higher elevations are covered with pine forests and pine needle carpets. Lower regions, especially in stream and river drainages are covered in deciduous single canopy jungle.\nGeology\nGeology Project\nPerhaps ten percent of the Potosi area is rock outcrop. In a macro sense the outcrop available for mapping may be broken up into two Tertiary volcanic rock groups: the Oligocene Matagalpa Formation (mainly andesitic in composition) and the Miocene Padre Miguel Group (mainly rhyolite / dacite). Matagalpa Formation rocks contain andesite flows, crystal tuffs, feldspar porphyries, basalt, and finer grained volcano-sediments unconformably overlain by the Padre Miguel rocks (rhyolitic to dacitic tuffs). Later stage rhyolite doming occurs in the San Antonio Mine area and immediately east of the San Benito occurrence. The Cerro Potosi topographic high is probably correlative to the Padre Miguel group rooks. Later stage mafic, intermediate, and felsic diking crosscut the main units. Padre Miguel rocks are invariably bleached white to pink to grey mass of devitrified and silicified rhyolite to dacite, ignimbrite or silicified breccia. White, angular metamorphosed/altered clasts are diagnostic of this occurrence at Pantaleon. Welding is observable in core.\nAt Potosi, the rock types are variations on the Matagalpa theme, except for Pantaleon, where the prime target was gold bearing epithermal quartz veining within Padre Miguel rocks. It was also hoped that the contact between the Padre Miguel and Matagalpa rocks would be a logical horizon for gold alteration zones.\nThe majority of outcrop mapped on the project is from the Matagalpa group: a flat-lying sequence of medium grained porphyritic tuff breccia of intermediate composition. Markedly porphyritic flows were mapped on surface and logged in drill holes. The size and shape of the light grey/white feldspar phenocrysts varies from millimeter to slightly less than 0,75 cm. More massive, non-porphyritic, fine-grained andesite was identified either as volcanic flow or tuffs. The Matagalpa group is predominantly subaerial with limited sections of banded, lamellar tuffs which may have been subaqueous. Pyroclastic andesite breccias are mapped and logged in all the focus zones. Heterolithic lapilli are common constituents of the lapilli tuff. Heterolithic agglomeratic andesite and medium to coarse tuff breccia is logged in the San Benito drill holes. Fine grained intermediate dykes which may be feeder dykes cut the same drill holes.\nThe main target of the drilling at San Antonio and Tajo is epithermal quartz veining and attendant alteration and silicification zones.\nDrilling at the Tajo showing delineated a quartz vein structure striking WNW and dipping moderately to the northeast. Diamond drill holes PT97-05 to PT97-11 intersected the structure along a strike length of 150m over a 125m down dip extension.\nThe Tajo Showing is located on a variably dipping (15-30o) north-east facing slope. The Tajo structure was approached through a series of short drill holes. The structure was pierced repeatedly at anticipated depths based on a 295o strike and -35o N dip; except in PT97-11 where the vein was intercepted 20m higher in the hole. This may be explained by a swing in the strike to the northwest or an offset through faulting. Field evidence indicates that the structure begins to strike 315o on the western end of the grid. The best assay was in PT97-7 (2.29g/T over 8.0m including a core zone of 12.2g/T over 1.4m). it is geometrically demonstrable that the core zone corresponds to the base metal rich sulfide intervals of the Tajo vein.\nSan Antonio\nThe San Antonio zone was the first structure mapped and drilled during the program. The surface mapping showed altered porphyritic and a site overlying a more massive unit of andesite tuff / lapilli tuff. 1:1000 scale surface mapping and diligent sampling of all promising areas was performed on and off the grid. The underground mapping indicated that the San Antonio Mine topographically overlaps the Todos Santos Mine in Rosario Mining's earlier attempt to mine the San Antonio structure.\nFrom 2004 to 2005 12 new drills were performed by Ruben Leal at San Antonio to prove gold reserves and extend the anomalous underground samples and DDH 94-5 mineralization.\nSan Benito\nAn approximately 700 x 350m zone has been sampled with highly anomalous Au values obtained. It is open to both east and west and appears to represent stacked epithermal quartz zones with Au, Ag and Cu mineralization. Another hole to the west of the Vespa Pit, possibly drilling under the chimney zone would be useful in extending mineralization; a hole should be drilled to test the eastward extension of the chalcopyrite-bearing quartz veins mapped there. Surface samples in pits and trenches returned more than 10g/T Au values. A program of at least five, 100m drill holes would be necessary to properly test the very wide and persistent zone of base metal and gold enhancement within silicification and quartz veining identified on the grid.\nCerro Copal\nLithology of Cerro Copal is the same as Tajo.\nFrom 1999 to this day this area is also being mined on a small scale by locals following high gold grades. Ending with complex underground structure that allows us to create a 3D without drilling.\nThis new exploration area follows the Limons trend from Nicaragua Gold belt.\nLion Works, Inc.-Genesis Ore Extraction Process\nOn March 19, 2023, the Company, as Buyer entered into that certain share purchase agreement with J. Lemus, as Seller which contemplated acquisition of 51% of the capital stock of Lion Works, including 51% of the intellectual property rights and know-how related to the Genesis proprietary system (Genesis). This green, environmentally friendly, process, extracts up to 98% of the minerals, including gold and many rare earth elements from Oxide and complex Ores. Furthermore, the process takes 12 - 48 hours which is considerably shorter than the 40 to 120 days other leaching processes take. Furthermore, the heap leaching process, as a general rule only extracts up to 70% of the gold or other minerals from the ore. If left for one to two years it is possible to extract up to 90% of the minerals from the ore using heap leaching methods and compared to CIL plant processing has the same effectiveness without the cost. CIL stands for carbon in leach. This is a gold extraction process called cyanidation where carbon is added to the leach tanks or reaction vessels so that leaching and absorption take place in the same tanks. It is the most commonly used leaching process for the extraction of gold. This process has a higher capital and operating cost but generally has an improved gold recovery of between 20 and 30%. However, this process is still more expensive than our Genesis system, is environmentally unfriendly, is still slow compared to Genesis and in the first 4 to 6 months extracts much less ore than our Genesis system achieves over 12 to 48 hours.\nGenesis is the key process that makes economically unviable deposits around the world viable and profitable again.\nGenesis is a sustainable extraction method, that yields an improved recovery rate in a much shorter time period even where the presence of gold is as little as 0.10 parts per million. There are no emissions, and the system is environmentally friendly.\nUpon the consummation of the transactions contemplated by the Share Purchase Agreement, pursuant to which Lion Works will become the Companys majority-owned subsidiary (the Lion Works Acquisition), the Company intends to have independent geologists and engineers review the two different systems and write reports on the process. This will be another use of the funds raised though the S-1 registration and funding process.\nThe Genesis Oxide System\nThe Genesis system accelerates the rate of dissolution of gold to nearly an immediate rate, therefore reducing the standard time of extraction from approximately 40-120 days to a few hours Consequently, the costs of production are dramatically reduced. The system is scalable and the smaller units are modular and can easily be transported from location to location.\nBeyond the economic advantages it also provides immediate technical solutions to difficulties caused by fine materials and resolves the need to agglomerate. The speed of extraction of gold is up to 400 times faster than conventional heap leaching.\nVersatility\nAt the heart of the Genesis system is a reactor module that makes the system versatile in its relationship with installation, construction, and repositioning. The systems conception, design, and its structural development is the innovative solution to older methods of extraction. In addition to the numerous international collaborations it has resulted in the creation and implementation of Genesis for the provision of a practical and economical solution that is effective, feasible, and reliable; characteristics which the mining industry has always required.\nThe area needed to operate a complete module is merely 2,500 square meters which includes the absorption plant, a convenient reduction in space requirements as compared to Heap leaching.\nThe Genesis Refractory System\nThe Genesis Refractory system works on complex ores. This genesis system has a very significant transformation rate from double refractory lock gold into free oxide gold. The system operates within a processing time of just a few hours, thereby reducing very significantly the time that a heap leaching system would take.\nThe Genesis system is the only economically feasible solution for complex low-grade deposits and the only Cost-effective process to treat double refractory gold and other minerals.\nThis system like the Genesis oxide system is an innovative solution that significantly improves the older methods. It is environmentally safe, has no emissions and its speed of extraction is very cost effective. The true benefits are that it can be used on tailing piles, extracting in most instances more minerals than was originally extracted with the older methods. It also cleans up these tailing piles during the extraction process leaving smaller rocks and gravel that can be used on roads and rail tracks etc. The dirtiest of all tailings are coal tailings and our equipment works very efficiently on these tailings extracting minerals and leaving useable rock residue.\nKey Points:\n· Lower capital investment needs in comparison to the standard processes available in the industry.\n· System is much faster than regular heap leaching methods.\n· Improved rate of extraction.\n· Solution for low gold grade deposits.\n· Solution for economically unviable deposits.\n· Genesis has the same efficiency as a CIL plant without the costs.\n· Reduced cost of production as compared with standard methods of extraction.\n· Environmentally friendly process\n· Modular structure system\n· Easy to scale\n· the smaller units are mobile, designed to be easily transported without any secondary costs\n· Easy to adapt and displace in complicated terrains\n· Option to substitute cyanide for a green chemical agent\n· Lower cost of production per ounce\n· The construction of processing plant from scratch would require under 6 months\n· Capacity for complete automation\n· Precise control and measurement of the recovery of the precious metals.\n· Experience in managing conventional mining plants is not required for setting-up Genesis\n· Eliminates all risk in setting-up production in under a non-explored gold-bearing zones\n· Eliminates the need to grind the mineral ore\n· Genesis is a closed system, eliminating the risk for spillages\n· Considerably reduces the need for water, making it particularly viable for arid sites\n· Water and chemical agents are all reutilized and recycled\n· Machine has no emissions, making it very safe.\nThe Genesis system also solves the problem that mining companies may experience following the decision in 2022 of the U.S. Appellate Court for the 9th Circuit known as the Rosemont decision. In that decision the Court rules that while federal mining law allows companies to mine on federal land where economically valuable minerals are present, they are not guaranteed the right to use federal land without valuable minerals as a dumping site for the mine. The Genesis system resolves any potential issues related to the mining waste/tailings, since it not only extracts minerals from the tailings, but also cleans tailings leaving the residual as usable gravel for roads and railways.\nThe cost effectiveness of our Genesis eco-friendly system means that many closed and unprofitable mines can be operated again, due to the significant increase in profitability with the lower cost of operation than conventional methods.\nFirst Prototype of the GENESIS oxide System\nFirst Industrial Scale GENESIS Refractory System\nOur Growth Strategies\nThe Company is planning to reopen the mining properties it acquired from Troy in 2024. to to complete the Commsa Acquisition and the Lion Works Acquisition, and to purchase the equipment necessary to start operations in Honduras and West Africa and actualize commercial production from the mines. We believe that these activities will generate revenues and profit. The Company is also exploring the acquisitions of assets and majority interests in companies with proprietary software related to artificial intelligence technology and in the fintech arena. To implement this business plan, it will require the full utilization of our management, financial and other resources and raising the funds necessary for the businesses. Our ability to manage growth effectively will depend on our ability to quickly scale-up operations and to recruit, train and manage operations, management, and technical personnel and to retain the current successful management team and adding experienced personnel to the team to enable us to meet our production expansion plan.\nCompetition\nThe mining business is highly competitive. Many of our competitors have greater financial resources than we have. As a result, we may experience difficulty competing with other businesses when conducting development and mining activities. In addition, marketing our new technology will take time to gain traction in the mining industry. Numerous factors beyond our control may affect the marketability of gold recovered from our mining properties. These factors include market fluctuations, the proximity and capacity of natural resource markets and processing equipment, government regulations, including regulations relating to prices, taxes, royalties, land tenure, land use, importing and exporting of minerals and environmental protection. The exact effect of these factors cannot be accurately predicted, but the combination of these factors may result our not receiving an adequate return on invested capital. If we purchase assets and/or majority interests in companies in the fintech arena, it would be even more difficult to compete with other companies that have developed their business in this highly competitive area and have greater financial resources than we have.\nIntellectual Property\nWe currently do not have any patents or trademarks registered in the name of the Company. Upon the acquisition of 51% interest in Lion Works, we will acquire 51% in the proprietary technology owned by Lion Works, called Genesis, however this technology has not been patented, and the Company will need to engage a patent attorney to apply for the patent registration with the United States Patent and Trademark Office. Currently, the Company uses a combination of copyright, non-registered trademark and trade secret laws, as well as confidentiality procedures and licensing arrangements, to establish and protect its intellectual property rights to technologies that the Company may acquire or develop.\nCompliance with U.S. Government Regulation.\nThe General Mining Law of May 10, 1872, as amended (30 U.S.C. §§ 22-54 and §§ 611-615) is the major U.S. federal law governing locatable minerals. This law allows citizens of the United States the opportunity to explore for, discover, and purchase certain valuable mineral deposits on those federal lands that are open to mineral entry. The law sets general standards and guidelines for claiming the possessory right to a valuable mineral deposit discovered during exploration. The General Mining Law allows for the enactment of state laws governing location and recording of mining claims and sites that are consistent with federal law. The federal regulations implementing the General Mining Law are found at Title 43 of the Code of Federal Regulations (CFR) in Groups 3700 and 3800.\nA mining claim is a selected parcel of U.S. federal land, valuable for a specific mineral deposit or deposits, for which the claimant has asserted a right of possession under the General Mining Law. All rights to the Star Alliance International Corp. Claims are restricted to the exploration and extraction of a mineral deposit. The rights granted by a mining claim protect against a challenge by the United States and other claimants only after the discovery of a valuable mineral deposit. The two types of mining claims are lode and placer. The Star Alliance International Corp. Claims are lode claims. Lode claims cover classic veins or lodes having well-defined boundaries and also include other rock in-place bearing valuable mineral deposits. Lode claims are usually located as parallelograms with the side lines parallel to the vein or lode. The end lines of the lode claim must be parallel to qualify for underground extralateral rights. Extralateral rights involve the rights to minerals in vein or lode form that extend at depth outside the vertical boundaries of the claim. The Star Alliance International Corp. Claims are a mixture of patented and unpatented mining claims. A patented mining claim is one for which the federal government has conveyed title, making it private land. Since October 1, 1994, the BLM has been prohibited by acts of Congress from accepting any new mineral patent applications.\nGenerally, all claimants must pay an annual maintenance fee per claim or site to the BLM, or file for a waiver from payment of fees by September 1 of each year. Failure to file for a waiver or pay the fee by September 1 results in the claim or site becoming forfeited by operation of law. Assessment work is work or labor performed that develops the claim for production (43 CFR Part 3836). Geological, geophysical, and geochemical surveys may qualify as assessment work for a limited period. Use of these surveys requires the filing of a detailed report, including basic findings.\nState laws also require the annual filing of an affidavit of assessment work with the proper county if the work is performed. The filing of an affidavit of annual assessment work with both the local county office and the proper BLM State Office is required if the claimant elects to file a waiver from payment of the maintenance fees. The affidavit or proof of labor must be filed no later than December 30 following the filing of a waiver in the proper BLM State Office and in the county or borough recorders office.\nThe performance of assessment work must be within a certain period referred to as the assessment year. The assessment year begins at noon of each September 1. It ends at noon September 1 of the next year (43 CFR Part 3836). Performance of assessment work need not occur during the first assessment year of location.\nExploration and mining activities on BLM-administered land are controlled by the regulations of the Secretary of the Interior contained in 43 CFR, Subparts 3715 and 3809. We are required by these regulations to prevent unnecessary or undue degradation of the land. For activities other than casual use, we will be required to submit either a notice or a plan of operations. A plan of operations, which includes a reclamation plan, is required where activities involve the surface disturbance of more than 5 acres. Notices also require the submission of a reclamation plan and are submitted for exploration activities covering 5 acres or less. There is no requirement for notifying the BLM of casual use activities. Casual use activities are those that cause only negligible disturbance of public lands and resources. For example, activities that do not involve the use of earthmoving equipment or explosives may be considered casual use.\nWe will be required to reclaim any surface disturbing activity, even if the claim or site is declared abandoned and void or forfeited by the BLM. Reclamation will be required if we relinquish the claim or site to the Federal Government. The BLM requires a reclamation bond or other financial security prior to approving a plan of operations or allowing operations under a notice to proceed. Surface Management actions are processed at the local level.\nWe intend to submit a plan of operations for our planned activities on the Star Alliance International Corp. Claims to the BLM district office. The plan of operations must include appropriate environmental protection and reclamation measures and describe either the entire operation proposed or reasonably foreseeable operations and how they would be conducted, including the nature and location of proposed structures and facilities.\nThe public has the conditional right to cross mining claims or sites for recreational and other purposes and to access federal lands beyond the claim boundaries. Although claimants have a right of access to a mining claim or site across federal lands, they are not allowed to cause unnecessary or undue degradation of the surface resources. Claimants may be liable for damages if found responsible for unnecessary loss of or injury to property of the United States. We may not construct permanent structures, mobile structures, or store equipment without the prior approval of an authorized federal official.\nEmployees\nThe Company currently has three employees, Richard Carey, Anthony Anish and Weverson Correia who are our three executive officers. Item 1A. Risk Factors\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 1B. Unresolved Staff Comments\nNot applicable. Item 2. Properties\nWe currently do not own or rent any property. Our Chairman and President, Mr. Carey is using his personal office space at no cost to the Company. Item 3. Legal Proceedings\nThere are no material pending legal proceedings to which we are a party or in which any director, officer or affiliate of ours, any owner of record or beneficially of more than 5% of any class of our voting securities, or security holder is a party adverse to us or has a material interest adverse to us. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur Common Stock is currently quoted on the OTC Pink marketplace of OTC Markets Group, Inc., an inter-dealer quotation system, under the symbol STAL However, there is currently only a limited trading market for our Common Stock and there is no assurance that a regular trading market will ever develop.\nOn October 12, 2023, the last reported closing price of our Common Stock was $0.0013 per share.\nHolders\nAs of October 13, 2023, the Company had 111 stockholders of record.\nDividends\nNo cash dividends have been paid on our shares of common stock during the fiscal years ended June 30, 2022 and 2021. We have not paid any cash dividends since our inception and do not foresee declaring any cash dividends on our common stock in the foreseeable future.\nRecent Sales of Unregistered Securities\nExcept as set forth below, there were no sales of equity securities during the period covered by this Report that were not registered under the Securities Act and were not previously reported in a Quarterly Report on Form 10-Q or a Current Report on Form 8-K filed by the Company.\nOn August 15, 2022, the Company issued 5,000,000 shares of common stock to Fernando Godina, for services as a director.\nOn August 15, 2022, the Company issued 5,000,000 shares of common stock to Bryan Cappelli for his services as a director.\nOn August 15, 2022, the Company issued 5,000,000 shares of common stock to Weverson Correia for this services as CEO.\nOn December 5, 2022, we issued 100,000 shares of common stock to a consultant for accounting services.\nOn December 26, 2022, we issued 1,000,000 shares of common stock to attorneys for legal services.\nOn March 7, 2023, we issued 190,114 shares of common stock to investment bankers as retaining fees.\nOn April 11, 2023, we issued 250,000 shares of common stock to a consultant for marketing advice.\nOn June 2, 2023, we issued 1,358,341 shares of common stock to an investment banker for services\nOn June 13, 2023 and June 15, 2023, the Company issued 3,333,333 and 5,160,606, respectively, shares of common stock to Geneva Roth Holdings, Inc. as a conversion of the convertible promissory note.\nOn November 30, 2022, the Company issued 2,518,892 shares of common stock to Geneva Roth Holdings, Inc. as a conversion of the $100,000 convertible promissory note.\nOn December 6, 2022, the Company issued 1,928,979 Shares of common stock to Geneva Roth Holdings, Inc. as a conversion of the $139,851 convertible promissory note.\nOn December 21, 2022, the Company issued 1,538,461 Shares of common stock to Fast Capital, LLC upon conversion of the $40,000 convertible promissory note.\nOn January 5, 2023, the Company issued 1,539,385 Shares of common stock to Geneva Roth Holdings, Inc. as a conversion of the $30,018 convertible promissory note.\nOn January 11, 2023, the Company issued 2,012,821 Shares of common stock to Geneva Roth Holdings, Inc. as a conversion of the $31,400 convertible promissory note.\nOn January 17, 2023, the Company issued 1,472,372 Shares of common stock were converted to Geneva Roth Holdings, Inc. as a conversion of the $22,969 convertible promissory note.\nOn January 19, 2023, the Company issued 3,424,657 Shares of common stock to Fast Capital, LLC as a conversion of the $50,000 convertible promissory note.\nOn March 3, 2023, the Company issued 1,777,778 Shares of common stock to Geneva Roth Holdings, Inc. as a conversion of the $20,800 convertible promissory note.\nOn March 9, 2023, the Company issued 2,355,556 Shares of common stock to Geneva Roth Holdings, Inc. as a conversion of the $27,560 convertible promissory note.\nOn March 21, 2023, the Company issued 4,087,500 shares of common stock to Fast Capital, LLC as a conversion of the $32,500 convertible promissory note.\nOn March 16, 2023, we issued 1,000,000 shares of common stock as commitment shares to Keystone, pursuant to the Purchase Agreement.\nThe above issuances did not involve any underwriters, underwriting discounts or commissions, or any public offering and are exempt from the registration requirements of the Securities Act of 1933 by virtue of Section 4(2) thereof and/or Regulation D promulgated thereunder.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone.\nOther Stockholder Matters\nNone. Item 6. Selected Financial Data\nNot applicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion of the financial condition and results of operations should be read in conjunction with the financial statements and the notes to those statements and other financial information included elsewhere in this Annual Report. Some of the information contained in this discussion and analysis or set forth elsewhere in this Annual Report, including information with respect to our plans and strategy for our business and related financing, includes forward-looking statements that involve risks and uncertainties. The various sections of this discussion contain forward-looking statements, all of which are based on our current expectations and could be affected by the uncertainties and risk factors described throughout this Annual Report as well as other matters over which we have no control. See Forward-Looking Statements. Our actual results may differ materially. The Company does not undertake any obligation to update forward-looking statements to reflect events or circumstances occurring after the date of this.\nOur cash balance was $4,391 as of June 30, 2023. We believe our cash balance is not sufficient to fund our limited levels of operations for any period of time. We have been utilizing funds raised from the sale of shares and borrowed from our Chairman. The Chairman has no commitment, arrangement or legal obligation to advance or loan funds to the company. The borrowing is non-interest-bearing, unsecured, and due on demand.\nOur independent registered public accountants have issued a going concern opinion. This means that there is substantial doubt that we can continue as an on-going business for the next twelve months unless we obtain additional capital to pay our bills. The accompanying financial statements have been prepared assuming that the Company continues as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business. As shown in the accompanying financial statements, the Company has accumulated deficit of $25,547,794 and working capital of $(1,609,917) as of June 30, 2023, and a net loss of $10,489,394 most of which is a non cash expense. The Company used $461,573 of cash in operating activities for the year ended June 30, 2023. Due to these conditions, it raises substantial doubt about the Companys ability to continue as a going concern.\nWe are a smaller reporting company under Rule 12b-2 of the Exchange Act. To the extent that we remain a smaller reporting company at such time as are no longer an emerging growth company, we may take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies such as that we are not required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act; we can use reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements; we can use exemptions from the requirements of holding an annual non-binding advisory vote on executive compensation and nonbinding stockholder approval of any golden parachute payments not previously approved.\nResults of Operations for the years ended June 30, 2022 and 2021\nOperating expenses\nGeneral and administrative expenses were $978,792 for the year ended June 30, 2022, compared to $94,508 for the year ended June 30, 2021, an increase of $1,815,073. The increase is due to an increase in filing fees and consulting expenses.\nProfessional fees were $142,863 for the year ended June 30, 2023, compared to $144,763 for the year ended June 30, 2022, a decrease of $1,900. Professional fees consist mainly of legal, accounting and audit expense. The decrease is due to lower legal and accounting fees.\nThere was a loss on conversion of common stock for Directors compensation of $3,211,400 and officer compensation of $3,100,500 for the year ended June 30, 2023 compared to $2,111,500 and $952,500 for the year ended June 30, 2022.\nOther income (expense)\nFor the year ended June 30, 2023, we had interest expense of $308,823 and a net loss on conversion of debt of $166,799 compared to interest expense of $297,417 and loss on conversion of debt of $102,403 for the year ended June 30, 2022. In addition, there was a loss on issuance of convertible debt of $0 in 2023 compared to $575,396 in 2022. Interest expense has increased as a result of interest on notes payable that were added to the Companys liabilities and the amortization of debt discount associated with our convertible notes.\nNet Loss\nNet loss for the year ended June 30, 2023 was $10,489,394 compared to $11,885,609 for the year ended June 30, 2022.\nPlan of Operations\nWe expect that working capital requirements will continue to be funded through borrowing from related parties and others. Subsequent to the year end June 30, 2022, the Company acquired the mining claims and equipment assets of Troy Mining Corporation. We also acquired or entered into agreements to acquire other businesses during the year ended June 30, 2023.\nOff Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nMaterial Commitments\nAs of the date of this Annual Report, we do not have any material commitments.\nPurchase of Significant Equipment\nWe do intend to purchase any significant equipment during the next twelve months subject to financing.\nLiquidity and Capital Resources\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business. As shown in the accompanying financial statements, the Company has accumulated deficit of $25,547,794 and negative working capital of $(1,609,917) as of June 30, 2023, and a net loss of $10,489,394 most of which is non cash expense. The Company used $461,573 of cash in operating activities for the year ended June 30, 2023. Due to these conditions, it raises substantial doubt about the Companys ability to continue as a going concern.\nNet cash used in operating activities was $491,573 for the year ended June 30, 2023 as compared to the net cash used in operating activities of $739,630 for the year ended June 30, 2022. The reduction in net cash used in operating activities from 2023 to 2022 is because stock issued for services decreased during the year ended June 30, 2023.\nNet cash provided by financing activities was $394,240 and $1,004,565 for the years ended June 30, 2023 and 2022, respectively.\nOver the next twelve months, we expect our principle source of liquidity may be dependent on borrowings from related and other parties.\nGoing Concern Consideration\nOur auditors have issued a going concern opinion, meaning that there is substantial doubt if we can continue as an on-going business for the next twelve months unless we obtain additional capital. The Companys cash position may not be sufficient to support its daily operations.\nLimited operating history and need for additional capital\nThere is no historical financial information about us upon which to base an evaluation of our performance. We are in start-up stage operations and have not generated any significant revenues. We cannot guarantee we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources and possible cost overruns due to price and cost increases in services and products. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot applicable to smaller reporting companies. Item 8. Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firms\nBalance Sheets as of June 30, 2023 and 2022\nStatements of Operations for the Years Ended June 30, 2023 and 2022\nStatements of Changes in Stockholders Deficit for the Years Ended June 30, 2023 and 2022\nStatements of Cash Flows for the Years Ended June 30, 2023 and 2022\nNotes to the Financial Statements\nGries & Associates, LLC\nCertified Public Accountants\n501 S. Cherry Street, Ste 1100\nDenver, Colorado 80246\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nStar Alliance International Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Star Alliance International Corp. (the Company) as of June 30, 2023 and June 30, 2022, respectively, and the related statement of operations, stockholders deficit and cash flows for the period then ended and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and June 30, 2022, and the results of its operations and its cash flows for each of the period then ended in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in note 3 to the financial statements, the Company has incurred losses since inception of $25,547,794. For the year ended June 30, 2023, the Company had a net loss of $10,489,394. These factors create an uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nblaze@griesandassociates.com\n501 S. Cherry Street, Suite 1100, Denver, Colorado\n(O)720-464-2875 (M)773-255-5631 (F)720-222-5846\nGries & Associates, LLC\nCertified Public Accountants\n501 S. Cherry Street, Ste 1100\nDenver, Colorado 80246\nEmphasis of Matters-Risks and Uncertainties\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and financial markets of many countries, including the geographical area in which the Company plans to operate.\nEmphasis of Matters-Risks and Uncertainties\nThe Company has had significant transactions and relationships with related parties, including the Companys Co-Chairman, which are described in the financial statements. Transactions involving related parties cannot be presumed to be carried out on an arms length basis, as the requisite conditions of competitive, free market dealings may not exist.\n/s/ Gries & Associates, LLC\nWe have served as the Companys auditor since 2021.\nDenver, Colorado\nOctober 12, 2023\nPCAOB# 6778\nblaze@griesandassociates.com\n501 S. Cherry Street, Suite 1100, Denver, Colorado\n(O)720-464-2875 (M)773-255-5631 (F)720-222-5846\nPART I. FINANCIAL INFORMATION\nItem 1. Financial Statements\nSTAR ALLIANCE INTERNATIONAL CORP.\nBALANCE SHEETS\nJune 30,\nJune 30,\nASSETS\nCurrent assets:\nCash $ 4,391 $ 71,724\nPrepaids and other assets 482,500 547,350\nPrepaid stock for services - 1,813,854\nTotal current assets 486,891 2,432,928\nProperty and equipment 450,000 450,000\nMining claims 57,532 57,532\nTotal other assets 507,532 507,532\nTotal Assets $ 994,423 $ 2,940,460\nLIABILITIES AND STOCKHOLDERS EQUITY (DEFICIT)\nCurrent liabilities:\nAccounts payable $ 110,565 $ 52,760\nAccrued expenses 75,681 25,961\nAccrued expenses-related party 13,154 -\nLoan payable - related party 42,500 -\nAccrued compensation 346,060 212,428\nNotes payable 202,051 193,866\nConvertible notes payable, net of discount of $105,354 and $191,248, respectively 396,652 323,752\nDerivative liability 1,010,145 689,231\nTotal current liabilities 2,196,808 1,497,998\nTotal Liabilities 2,196,808 1,497,998\nCOMMITMENTS AND CONTINGENCIES (see footnotes)\nStockholders Equity (Deficit):\nPreferred stock, $0.001 par value, 25,000,000 authorized, none issued and outstanding - -\nSeries A preferred stock, $0.001 par value, 1,000,000 authorized, 1,000,000 shares issued and outstanding 1,000 1,000\nSeries B preferred stock, $0.001 par value, 1,900,000 authorized, 1,833,000 issued and outstanding 1,883 1,883\nSeries C preferred stock, $0.001 par value, 1,000,000 shares authorized, 163,950 and 207,500 shares issued and outstanding, respectively\nCommon stock, $0.001 par value, 500,000,000 shares authorized, 227,097,537 and 162,788,028 shares issued and outstanding, respectively 227,098 162,788\nAdditional paid-in capital 24,171,513 16,384,983\nStock subscription receivable (56,250 ) (50,000 )\nAccumulated deficit (25,547,794 ) (15,058,400 )\nTotal stockholders (deficit) equity (1,202,385 ) 1,442,462\nTotal liabilities and stockholders deficit $ 994,423 $ 2,940,460\nThe accompanying notes are an integral part of these financial statements.\nSTAR ALLIANCE INTERNATIONAL CORP.\nSTATEMENTS OF OPERATIONS\nFor the Years Ended June 30,\nOperating expenses:\nGeneral and administrative $ 978,792 $ 1,897,581\nGeneral and administrative - related party - 12,000\nMine development - 791,500\nProfessional fees 142,863 144,763\nConsulting 1,168,729 4,843,835\nDirector compensation 3,211,400 2,111,500\nOfficer compensation 3,100,500 952,500\nTotal operating expenses 8,602,284 10,753,679\nLoss from operations (8,602,284 ) (10,753,679 )\nOther expense:\nInterest expense (308,823 ) (297,417 )\nChange in fair value of derivative (353,369 ) (136,714 )\nLoss on conversion of debt (166,799 ) (102,403 )\nLoss on issuance of convertible debt - (575,396 )\nOther expense (25,000 ) (20,000 )\nLoss on conversion of preferred stock (1,033,119 ) -\nTotal other expense (1,887,110 ) (1,131,930 )\nLoss before provision for income taxes (10,489,394 ) (11,885,609 )\nProvision for income taxes - -\nNet loss $ (10,489,394 ) $ (11,885,609 )\nNet loss per common share - basic and diluted $ (0.05 ) $ (0.08 )\nWeighted average common shares outstanding - basic and diluted 193,155,882 145,317,205\nThe accompanying notes are an integral part of these financial statements.\nSTAR ALLIANCE INTERNATIONAL CORP.\nSTATEMENT OF CHANGES IN STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED JUNE 30, 2023 AND 2022\nPreferred Stock Series A Preferred Stock Series B Preferred Stock Series C Common Stock Additional\nPaid-in Common Stock\nTo Be\nStock Subscription Accumulated\nShares Amount Shares Amount Shares Amount Shares Amount Capital Issued Receivable Deficit Total\nBalance, June 30, 2021 1,000,000 $ 1,000 1,833,000 $ 1,883 - $ - 124,319,584 $ 124,320 $ 2,793,609 $ 41,633 $ (20,000 ) $ (3,172,791 ) $ (230,346 )\nStock sold for cash - - - - - - 21,955,000 21,955 604,045 (32,000 ) (30,000 ) - 564,000\nPreferred Stock sold for cash - - - - 207,500 - - 207,292 - - - 207,500\nStock issued for services - - - - - - 9,866,444 9,866 9,042,634 (3,000 ) - - 9,049,500\nStock issued for services - related party - - - - - - 4,500,000 4,500 2,757,000 - - - 2,761,500\nStock issued for debt - - - - - - 1,947,000 1,947 680,603 (6,633 ) - - 675,917\nStock issued for acquisition - - - - - - 200,000 299,800 - - - 300,000\nNet loss - - - - - - - - - - - (11,885,609 ) (11,885,609 )\nBalance, June 30, 2022 1,000,000 1,000 1,833,000 1,883 207,500 162,788,028 162,788 16,384,983 - (50,000 ) (15,058,400 ) 1,442,462\nStock sold for cash - - - - - - 50,000 6,200 - (6,250 ) - -\nPreferred stock sold for cash - - - - 268,200\n230,931 - - - 231,199\nStock issued for services - - - - - - 5,109,169 5,109 138,932 - - - 144,041\nStock issued for services - related party - - - - - - 21,000,000 21,000 5,924,000 - - - 5,945,000\nStock issued for debt - - - - - - 16,050,618 16,050 448,180 - - - 464,230\nPreferred stock converted to common stock - - - - (311,750 ) (311 ) 22,099,722 22,101 1,035,298 - - - 1,057,088\nWarrants issued - - - - - - - - 24,092 - - - 24,092\nPreferred dividends - - - - - - - - (21,103 ) - - - (21,103 )\nNet loss - - - - - - - - - - - (10,489,394 ) (10,489,394 )\nBalance, June 30, 2023 1,000,000 $ 1,000 1,833,000 $ 1,883 163,950 $ 165 227,097,537 $ 227,098 $ 24,171,513 $ - $ (56,250 ) $ (25,547,794 ) $ (1,202,385 )\nThe accompanying notes are an integral part of these financial statements.\nSTAR ALLIANCE INTERNATIONAL CORP.\nSTATEMENTS OF CASH FLOWS\nFor the Years Ended\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (10,489,394 ) $ (11,885,609 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nCommon stock issued for services 144,041 7,235,646\nCommon stock issued for services - related party 5,945,000 2,761,500\nPrepaid stock issued for services 1,813,854 -\nLoss on conversion of debt 166,799 102,403\nLoss on conversion of preferred stock 1,033,119 -\nLoss on issuance of convertible debt - 575,396\nOther expense 25,000 20,000\nChange in fair value of derivative 353,369 136,714\nDebt discount amortization 242,200 272,616\nChanges in assets and liabilities:\nPrepaids and other assets 64,850 (47,350 )\nAccounts payable 57,805 34,382\nAccrued expenses 34,998 20,247\nAccrued expenses - related party 13,154 -\nAccrued compensation 133,632 34,425\nNet cash used in operating activities (461,573 ) (739,630 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPrepaids and other assets - (200,000 )\nNet cash used in investing activities - (200,000 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds of borrowings from a related party 42,500 -\nProceeds from the sale of common stock - 544,000\nProceeds from the sale of preferred stock 231,200 207,500\nProceeds from convertible note payable 127,355 501,250\nRepayment of convertible note payable (15,000 ) -\nProceeds from notes payable 42,000 138,971\nPayment on notes payable (33,815 ) (387,156 )\nNet cash provided by financing activities 394,240 1,004,565\nNet change in cash (67,333 ) 64,935\nCash at the beginning of year 71,724 6,789\nCash at the end of year $ 4,391 $ 71,724\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nInterest paid $ - $ -\nIncome taxes paid $ - $ -\nNON-CASH TRANSACTIONS:\nConversion of debt $ 154,300 $ 97,154\nCommon stock issued for investment $ - $ 300,000\nCommon stock issued for prepaid services $ - $ 1,813,854\nThe accompanying notes are an integral part of these financial statements.\nSTAR ALLIANCE INTERNATIONAL CORP.\nNOTES TO FINANCIAL STATEMENTS\nJUNE 30, 2023\nNOTE 1 - NATURE OF BUSINESS\nStar Alliance International Corp. (the Company, we, us) was originally incorporated with the name Asteriko Corp. in the State of Nevada on April 17, 2014 under the laws of the state of Nevada. The primary purpose of the Company is to acquire and develop gold mining as well as certain other mining properties worldwide, finding patented new mining technologies and proprietary technology outside the mining industry.\nNOTE 2 - SIGNIFICANT AND CRITICAL ACCOUNTING POLICIES AND PRACTICES\nBasis of Presentation\nThe accompanying financial statements of the Company have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP) and the rules of the Securities and Exchange Commission (SEC).\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nFair Value of Financial Instruments\nThe Company follows paragraph 825-10-50-10 of the FASB Accounting Standards Codification for disclosures about fair value of its financial instruments and paragraph 820-10-35-37 of the FASB Accounting Standards Codification (Paragraph 820-10-35-37) to measure the fair value of its financial instruments. Paragraph 820-10-35-37 establishes a framework for measuring fair value in accounting principles generally accepted in the United States of America (U.S. GAAP) and expands disclosures about fair value measurements. To increase consistency and comparability in fair value measurements and related disclosures, Paragraph 820-10-35-37 establishes a fair value hierarchy which prioritizes the inputs to valuation techniques used to measure fair value into three broad levels. The fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The three levels of fair value hierarchy defined by Paragraph 820-10-35-37 are described below:\nLevel 1: Quoted market prices available in active markets for identical assets or liabilities as of the reporting date.\nLevel 2: Pricing inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the reporting date.\nLevel 3: Pricing inputs that are generally unobservable inputs and not corroborated by market data.\nThe carrying amount of the Companys financial assets and liabilities, such as cash, prepaid expenses and accrued expenses approximate their fair value because of the short maturity of those instruments. The Companys notes payable approximates the fair value of such instruments as the notes bear interest rates that are consistent with current market rates.\nThe following table classifies the Companys liabilities measured at fair value on a recurring basis into the fair value hierarchy as of June 30, 2023:\nSchedule of liabilities measured at fair value on a recurring basis\nAt June 30, 2023\nDescription\nLevel 1\nLevel 2\nLevel 3\nDerivative\n$ -\n$ -\n$ 1,010,145\nTotal\n$ -\n$ -\n$ 1,010,145\nAt June 30, 2022\nDescription\nLevel 1\nLevel 2\nLevel 3\nDerivative\n$ -\n$ -\n$ 689,231\nTotal\n$ -\n$ -\n$ 689,231\nNOTE 3 - GOING CONCERN\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business. As shown in the accompanying financial statements, the Company has an accumulated deficit of $25,547,794 as of June 30, 2023. For the year ended June 30, 2023, the Company had a net loss of $10,489,394, which did include $9,722,349 of non-cash expense incurred for the issuance of common stock for services, loss on conversion of preferred stock and derivatives associated with convertible debt. We used $461,573 of cash in operating activities. Due to these conditions, it raises substantial doubt about the Companys ability to continue as a going concern.\nThe Company is attempting to commence operations and generate sufficient revenue; however, the Companys cash position may not be sufficient to support its daily operations. While the Company believes in the viability of its strategy to commence operations and generate sufficient revenue and in its ability to raise additional funds, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon its ability to further implement its business plan and generate sufficient revenue and its ability to raise additional funds. The financial statements do not include any adjustments relating to the recoverability and classification of asset carrying amounts or the amount and classification of liabilities that may result should the Company be unable to continue as a going concern.\nNOTE 4 - AGREEMENTS TO ACQUIRE\nOn December 15, 2021, the Company entered into that certain share purchase agreement (the Share Purchase Agreement) with Juan Lemus, the sole shareholder of Compania Minera Metalurgica Centro Americana, a Honduran Corporation (Commsa). The Share Purchase Agreement contemplated the acquisition by the Company of 51% of the share capital of Commsa, a newly-formed company, which has the mining rights to five operating mines that run along a 12.5-mile stretch of the Rio Jalan River, in consideration for $1,000,000 in cash and the issuance of 5,000,000 shares of the Companys common stock to Mr. Lemus (the Commsa Acquisition). In addition, the Company has agreed to provide up to $7,500,000 in working capital to expand the mining operations in a gold mining project (Rio Jalan Project) in Olancho state in the highlands of Central Honduras. The Company did not meet its obligations for the consummation of the Commsa Acquisition by March 31, 2022 as set forth in the Share Purchase Agreement; however, the parties did not terminate the Share Purchase Agreement, intending that the Company would be able to obtain the necessary funding later and to consummate the Commsa Acquisition. No assets other than the cash paid and value of shares issued have been included on the Balance Sheet\nOn August 14, 2023, the Company and Juan Lemus executed a first addendum to the Share Exchange Agreement which provided for the extension of the Companys obligations to pay $1,000,000 in cash, the issuance of 5,000,000 shares of the Companys common stock to Mr. Lemus and the payment of $7,500,000 in working capital until September 30, 2023. As of the date of this Annual Report, the Company issued to Mr. Lemus only 200,000 shares of Common Stock and paid $75,000 toward the required $1,000,000 cash payment. On September 28, 2023, the parties executed a second addendum that extended the time of the Companys payments from September 30, 2023 to December 31, 2023.\nOn March 19, 2023, the Company entered into and executed a share purchase agreement (the Share Purchase Agreement) with Lion Works Advertising, SA, a Guatemalan corporation (Lion Works) and Juan Lemus, the sole shareholder of Lion Works, which contemplated the acquisition by the Company, as Buyer, from Mr. Lemus, as Seller, of 51% of the capital stock of Lion Works, including 51% of the intellectual property rights and know-how related to the Genesis extraction system (Genesis). The Share Purchase Agreement superseded the terms of the binding Letter of Intent that the parties entered into on November 21, 2021. Pursuant to the terms of the Share Purchase Agreement, the Companys consideration for the acquisition of 51% of Lion Works consists of the following:\n· The total purchase price of $5,100,000 in cash, with the first minimum payment in the amount of $2,550,000 to be paid by September 30, 2023, and the remaining outstanding balance of $2,550,000 to be paid by September 30, 2024, within 12 months of the first payment.\n· The Company will invest an additional 5,000,000 as a working capital toward the development of the Genesis plants, with $2,000,000 to be paid by July 31, 2023 and the remaining $3,000,000 to be paid by July 31, 2024, within 12 months of the first payment.\n· The Company will engage a patent attorney and pay for the cost of that patent attorney to prepare the patent application related to Genesis and to register that patent, provided that Lion Works will engage an expert to prepare a report on the Genesis system, to be used in this patent application.\nThe parties agreed that the closing of the transactions contemplated by the Share Purchase Agreement will occur on or before March 19, 2023 or at such other time and place as the Buyer and the Seller may agree, provided that (i) the Seller receives the first tranche of working capital funds in the amount of $2,000 prior to the execution and delivery of (i) the paperwork necessary for the attorney to complete the patent submission, (ii) all documentation necessary for the buyer to market the Genesis program, (iii) any other document, certificate or instrument to consummate the transactions contemplated by the Share Purchase Agreement.\nOn July 21, 2023, Juan Lemus and the Company executed a first addendum to the Share Purchase Agreement, pursuant to which the Companys obligations to pay $2,000,000 as working capital was extended until September 30, 2023, and the parties agreed that upon such payment and the first minimum payment in the amount of $2,550,000 toward the total purchase price on or prior to September 30, 2023 by the Company, the parties will close the transactions contemplated by the Share Purchase Agreement, and Lion Works will become a majority-owned subsidiary of the Company. On September 28, 2023, the parties executed a second addendum extending the time of the Companys payments from September 30, 2023 to December 31, 2023.\nNOTE 5 - PROPERTY AND EQUIPMENT\nLong lived assets, including property and equipment assets to be held and used by the Company are reviewed for impairment whenever events or changes in circumstances indicate that the carrying value of the assets may not be recoverable. Impairment losses are recognized if expected future cash flows of the related assets are less than their carrying values. Measurement of an impairment loss is based on the fair value of the asset. Long-lived assets to be disposed of are reported at the lower of carrying amount or fair value less cost to sell.\nProperty and equipment are first recorded at cost. Depreciation and is computed using the straight-line method over the estimated useful lives of the various classes of assets.\nMaintenance and repair expenses, as incurred, are charged to expense. Betterments and renewals are capitalized in plant and equipment accounts. Cost and accumulated depreciation applicable to items replaced or retired are eliminated from the related accounts with any gain or loss on the disposition included as income.\nAssets stated at cost, less accumulated depreciation consisted of the following:\nSchedule of property, plant and equipment\nJune 30,\nJune 30,\nMine Assets $ 450,000 $ 450,000\nTotal $ 450,000 $ 450,000\nOnce operations utilizing the property and equipment have begun, the Company will begin depreciation of the assets.\nNOTE 6 - RELATED PARTY TRANSACTIONS\nOn August 1, 2019, the Company entered into and executed initial employment agreements with Richard Carey, John Baird and Anthony Anish. Each initial employment agreement provided that the initial term of the employment agreement has the term of 36 months starting from August 1, 2019 and continues until July 31, 2022. Thereafter, such employment agreement may be renewed upon mutual agreement of the parties. The employment agreement also may be terminated by each party upon 30 days notice to the other party, provided that in the event the Executive breaches his material obligations to the Company, the Company may terminate the executive employment immediately. Each executive agreement included the compensation for the executive, including the base and incentive salary.\nThe executive employment agreement with Mr. Carey stated that his annual base salary is $120,000 per annum; the executive employment agreements with each of John Baird and Anthony Anish provided that each executive officer will receive annual base salary of $60,000 per annum. Mr. Baird resigned from his position on August 12, 2020.\nOn January 1, 2021, the Company amended the employment agreements with Mr. Carey and Mr. Anish, which increased the base annual salaries for Richard Carey from $120,000 per annum to $180,000 per annum, and for Anthony Anish from $60,000 per annum to $120,000 per annum. All other terms of the initial employment agreements with Mr. Carey and Mr. Anish remained unchanged.\nOn March 14, 2023, the Company renewed the employment agreements with Mr. Carey and Mr. Anish (the New Employment Agreements), stating that the effective date of the New Employment Agreement is August 1, 2022 and that they have the term of 36 months, the same as the terms of the initial employment agreements. Except for the compensation provisions, the New Employment Agreements contain the same provisions as the initial employment agreement for each executive.\nUnder the terms of the New Employment Agreement, Mr. Carey is entitled to receive the following compensation:\n· For the period from August 1, 2022 to December 31, 2022, Mr. Carey received the base salary equal to $180,000;\n· For the period from January 1, 2023 to July 31, 2024, Mr. Carey will receive the base salary equal to $240,000; and\n· For the period from August 1, 2024 to July 31, 2025, Mr. Carey will receive the base salary equal to $270,000. In addition, Mr. Carey is entitled to receive an equity compensation, as to be determined by the Board of Directors of the Company.\nUnder the terms of the New Employment Agreement, Mr. Anish is entitled to receive s the following compensation:\n· For the period from August 1, 2022 to December 31, 2022, Mr. Anish received the base salary equal to $120,000;\n· For the period from January 1, 2023 to July 31, 2024, Mr. Anish will receive the base salary equal to $180,000; and\n· For the period from August 1, 2024 to July 31, 2025, Mr. Anish will receive the base salary equal to $210,000. In addition, Mr. Anish is entitled to receive an equity compensation, as to be determined by the Board of Directors of the Company.\nAs of the date of this Annual Report, Mr. Anish received an aggregate of 5,000,000 shares of Common Stock granted to him as equity compensation under his New Employment Agreement.\nMr. Carey is using his personal office space at no cost to the Company.\nOn January 10, 2022, the Company issued 1,000,000 shares of common stock to Themis Glatman, director, for services. The shares were valued at $1.40 per share, the closing stock price on the date of grant, for total non-cash expense of $1,400,000.\nOn January 24, 2022, the Board of Directors appointed Mr. Weverson Correia as the Chief Executive Officer and Director of the Company. Mr. Correia was issued 500,000 shares of common stock on December 16, 2021. The shares were valued at $1.55 per share, the closing stock price on the date of grant, for total non-cash expense of $772,500.\nOn June 3, 2022, the Company issued 2,500,000 shares of common stock to Anthony Anish, CFO and director, for services. The shares were valued at $0.22 per share, the closing stock price on the date of grant, for total non-cash expense of $550,000.\nOn August 15, 2022, the Company issued 5,000,000 shares of common stock Fernando Godina, Director, for services. The shares were valued at $0.289 per share, the closing stock price on the date of grant, for total non-cash expense of $1,445,000.\nOn August 15, 2022, the Company issued 5,000,000 shares of common stock Bryan Cappelli, Director, for services. The shares were valued at $0.289 per share, the closing stock price on the date of grant, for total non-cash expense of $1,445,000.\nOn August 15, 2022, the Company issued 5,000,000 shares of common stock to Weverson Correia, CEO and Director, for his services as the CEO. The shares were valued at $0.289 per share, the closing stock price on the date of grant, for total non-cash expense of $1,445,000.\nOn August 15, 2022, the Company issued 5,000,000 shares of common stock to Anthony Anish, CFO and director, for services as CFO. The shares were valued at $0.289 per share, the closing stock price on the date of grant, for total non-cash expense of $1,445,000.\nOn November 17, 2022, Mr. Carey agreed to give 4 million of his own shares of common stock in exchange for $42,000 which was loaned to the Company. The loan is non-interest bearing and due on demand.\nOn December 5, 2022, the Company issued 1,000,000 shares of common stock Themis Caldwell, Director, for services. The shares were valued at $0.165 per share, the closing stock price on the date of grant, for total non-cash expense of $165,000.\nAs of June 30, 2023, the Company owed Ms. Caldwell $2,500, for a short-term advance used to pay for Company expenses.\nNOTE 7 - NOTES PAYABLE\nAs of June 30, 2023 and 2022, the Company owed Kok Chee Lee, the former CEO and Director of the Company, $42,651 and $42,651, respectively for operating expenses he paid on behalf of the Company during the year ended June 30, 2018. The borrowing is unsecured, non-interest-bearing and due on demand.\nOn June 1, 2018, the Company executed a promissory note in the amount of $32,000 with the former Secretary of the Board for $30,128 of accrued expenses for services previously provided and an additional $1,872 for services rendered. The note is unsecured, bears interest at 5% per annum and matures on December 1, 2018. As of June 30, 2023 and 2022, there is $8,162 and $6,562, respectively, of accrued interest due on the note. The note is past due and in default.\nAs of June 30, 2023 and 2022, the Company owes various other individuals and entities $127,400 and $119,215, respectively. All the loans are non-interest bearing and due on demand.\nNOTE 8 - CONVERTIBLE NOTES\nOn March 28, 2022, the Company received short term financing from a private investor under a 10% Fixed Convertible Secured Promissory Note in the principal amount of $400,000 (the Note). The Note bears interest at a fixed rate of 10% per annum with all principal and interest due at maturity on July 31, 2022. The Note is secured by a security interest and lien on all equipment located at our Troy mine in Mariposa County, California. At the option of the investor, and at any time prior to the maturity date, the principal and interest owing under the Note may be converted into shares of our common stock at a conversion price equal to 50% of the lowest closing market price for our common stock during the five trading days preceding the conversion.\nOn February 27, 2023, the Company repaid $15,000 of the Note. On April 28, 2023, $75,000 of the Note was assigned to Rock Bay Partners (Rock Bay). During Q4, Rock Bay converted $39,300 of the $75,000 into 7,000,000 shares of common stock.\nOn June 8, 2022, the Company executed a 10% convertible promissory note with Fast Capital LLC (Fast Capital). The note is convertible at a price per share equal to the 65% of the lowest trading price of the Companys common stock during the 20 consecutive trading days up to the date on which lender elects to convert all or part of the Note.\nOn February 7, 2023, the Company executed a 12% convertible promissory note with Quick Capital LLC (Quick Capital). The note is convertible at the lessor of 1) $0.05, or a price per share equal to the 65% of the lowest trading price of the Companys common stock during the 20 consecutive trading days prior to the date on which lender elects to convert all or part of the Note. In addition the Company issued Quick Capital warrants to purchase up to 1,211,111 shares of common stock. The Warrants are exercisable for shares of the Companys common stock at a price of $0.05 per share and expire 5 five years from the date of issuance.\nOn February 8, 2023, the Company executed a 10% convertible promissory note with AES Capital Management, LLC (AES). The note is convertible at the lessor of 1) $0.02, or a price per share equal to the 65% of the lowest trading price of the Companys common stock during the 20 consecutive trading days prior to the date on which lender elects to convert all or part of the Note.\nOn June 8, 2023, the Company executed a 9% convertible promissory note with 1800 Diagonal Lending, LLC (1800 Diagonal). The note is convertible at a price per share equal to the 65% of the lowest trading price of the Companys common stock during the 20 consecutive trading days prior to the date on which lender elects to convert all or part of the Note.\nThe following table summarizes the convertible notes outstanding as of June 30, 2023:\nSchedule of convertible notes\nNote Holder\nDate\nMaturity Date\nInterest\nBalance\nJune 30,\nAdditions\nPayments / Conversions/Assignment\nBalance\nJune 30, 2023\nPrivate investor\n3/28/2022\n7/31/2022\n14%\n$ 400,000\n$ -\n$ (90,000 )\n$ 310,000\nFast Capital LLC\n6/8/2022\n6/8/2023\n10%\n115,000\n-\n(115,000 )\n-\nQuick Capital LLC\n2/7/2023\n11/8/2023\n12%\n-\n60,556\n-\n60,556\nAES Capital Management, LLC\n2/8/2023\n2/7/2024\n10%\n-\n38,000\n-\n38,000\nRock Bay Partners\n10%\n-\n75,000\n(39,300)\n35,700\n1800 Diagonal Lending, LLC\n6/8/2023\n3/8/2024\n9%\n-\n57,750\n-\n57,750\nTotal\n$ 515,000\n$ 231,306\n$ (244,300 )\n$ 502,006\nLess debt discount\n$ (191,248 )\n$ (105,354 )\nConvertible notes payable, net\n$ 323,752\n$ 396,652\nA summary of the activity of the derivative liability for the notes above is as follows:\nSchedule of derivative liabilities\nBalance at June 30, 2021 $ -\nIncrease to derivative due to new issuances 552,517\nDerivative loss due to mark to market adjustment 136,714\nBalance at June 30, 2022 689,231\nIncrease to derivative due to new issuances 270,062\nDecrease to derivative due to conversion (302,571 )\nDerivative loss due to mark to market adjustment 353,369\nBalance at June 30, 2023 $ 1,010,145\nA summary of quantitative information about significant unobservable inputs (Level 3 inputs) used in measuring the Companys derivative liability that are categorized within Level 3 of the fair value hierarchy as of June 30, 2023, is as follows:\nSchedule of fair value assumptions\nInputs\nJune 30,\nInitial\nValuation\nStock price\n$ 0.012\n$ 0.015 - 0.42\nConversion price\n$ 0.0045 - 0.0052\n$ 0.015 - 0.2995\nVolatility (annual)\n146.07% - 260.45%\n265.91% - 381.28%\nRisk-free rate\n5.4% - 5.47%\n0.59% - 5.12%\nDividend rate\n-\n-\nYears to maturity\n0 - 0.83\n0.34 - 1\nNOTE 9 - PREFERRED STOCK\nOf the 25,000,000 shares of the Company's authorized Preferred Stock, $0.001 par value per share, 1,000,000 are designated Series A preferred stock, 1,900,000 shares are designated as Series B Preferred Stock and 1,000,000 shares are designated Series C preferred stock.\nSeries A Preferred Stock\nEach Share of Series A preferred stock has 500 votes per share and each share can be converted into 500,000,000 shares of common stock. The holders of the Series A preferred stock are not entitled to dividends.\nOn July 2, 2020, the Board granted all 1,000,000 shares of the Series A preferred stock to the Companys Chairman and CEO, Richard Carey, in conversion of $68,556 of accrued compensation.\nSeries B Preferred Stock\nOnly one person or entity, is entitled to be designated as the owner of all of the Series B Preferred Stock (the Holder), in whose name the initial certificates representing the Series B Preferred Stock shall be issued. Any transfer of the Series B Preferred Stock to a different Holder must be approved in advance by the Corporation; provided, however, the Holder shall have the right to transfer the Series B Preferred Stock, or any portion thereof, to any affiliate of Holder or nominee of Holder, without the approval of the Corporation. Each share of Preferred Stock has one vote per share. Holder is not entitled to dividends or distributions and each share of Series B Preferred Stock shall be convertible at the rate of two Common Shares for each one B Preferred stock.\nIn conjunction with the APA with Troy, the company issued 1,883,000 shares of Series B Preferred Stock, the shares were valued at $0.002 or $7,532 as if they had been converted into 3,666,000 shares of common stock.\nOn October 9, 2019, the parties have agreed to extend the date for filing the registration statement relating to the preferred shares of the Company to be issued to the Troy shareholders and that would in turn extend the date that the shares would become free trading. This extension will be for 150 days for filing the registration statement and obtaining approval for the shares to become free trading. All the remaining terms included in the contract will remain the same.\nSeries C Preferred Stock\nOn March 30, 2022, the Company created and designated 1,000,000 shares of Series C Preferred Stock (Series C) with a stated value of $1.00. The Series C has an annual cumulative dividend of 8%, has no voting rights. The Series C is convertible into shares of common stock at 65% of the lowest trading price for the ten days prior to the conversion date.\nDuring the year ended June 30, 2023, the Company sold 268,200 shares of Series C to Geneva Roth Remark Holdings Inc for total proceeds of $268,200.\nDuring the year ended June 30, 2023, Geneva Roth converted 311,750 shares of Series C preferred stock into 22,099,722 shares of common stock. The Company recognized a loss on conversion of $1,057,088.\nNOTE 10 - COMMON STOCK\nOn August 1, 2021, the Company granted 4,444 shares of common stock for services. The shares were valued at $4.50 per share, based on the value of the services as provided by the services providers invoice, for total non-cash expense of $20,000. The $20,000 is being amortized over the one-year service term for the services being provided.\nOn November 11, 2021, the Company granted 4,000,000 shares of common stock for services. The shares were valued at $0.50 per share, based on the value of the services as provided by the services providers invoice, for total non-cash expense of $2,000,000. The $2,000,000 is being amortized over the one-year service term for the services being provided.\nOn December 16, 2021, the Company granted 1,500,000 shares of common stock for services. The shares were valued at $1.55 per share, the closing stock price on the date of grant, for total non-cash expense of $2,317,500. The $2,317,500 is being amortized over the one-year service term for the services being provided.\nDuring the year ended June 30, 2022, the Company issued 4,362,000 shares of common stock for various consulting and professional fees. The shares were issued at the closing stock price on the date of grant for total non-cash expense of $4,712,000.\nDuring the year ended June 30, 2022, the Company issued 1,947,000 shares of common stock in conversion of $97,154 of debt. A loss of $575,396 was recognized on the conversions.\nDuring the year ended June 30, 2022, the Company sold 21,955,000 shares of common stock for total cash proceeds of $564,000. Of the stock sold $50,000 is still to be received. The Company also issued 4,770,000 shares that were sold in the prior year.\nDuring the year ended June 30, 2023, the Company sold 50,000 shares of common stock for total cash proceeds of $6,250. The funds have not been received as of June 30, 2023.\nDuring the year ended June 30, 2023, Fast Capital converted $115,000 of its note payable along with $7,414 of accrued interest into 9,050,618 shares of common stock.\nDuring the year ended June 30, 2023, the Company issued 5,109169 shares of common stock for services. The shares were valued at the closing price on the date of grant, for total non-cash expense of $144,041.\nOn March 15, 2023, pursuant to the terms Common Stock Purchase Agreement and a Registration Rights Agreement with Keystone Capital Partners, LLC (Keystone) the Company issued 1,000,000 commitment shares to Keystone. The shares were valued at $0.016, the price on the date of grant, for total non-cash expense of $16,000.\nDuring the year ended June 30, 2023, Rock Bay converted $39,300 of its note payable into 7,000,000 shares of common stock.\nRefer to Note 5 for shares issued to related parties.\nNOTE 11 - INCOME TAX\nDeferred taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. The Company has evaluated Staff Accounting Bulletin No. 118 regarding the impact of the decreased tax rates of the Tax Cuts & Jobs Act. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment. The U.S. federal income tax rate of 21% is being used due to the new tax law recently enacted.\nNet deferred tax assets consist of the following components as of June 30:\nSchedule of deferred tax assets\nDeferred Tax Assets:\nNOL Carryover $ 991,300 $ 830,300\nLess valuation allowance (991,300 ) (830,300 )\nNet deferred tax assets $ - $ -\nAt June 30, 2023, the Company had net operating loss carry forwards of approximately $991,300 that may be offset against future taxable income. No tax benefit has been reported in the June 30, 2023 or 2022 financial statements; any tax benefit is offset by a valuation allowance of the same amount.\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cut and Jobs Act (the Tax Act). The Tax Act establishes new tax laws that affects 2018 and future years, including a reduction in the U.S. federal corporate income tax rate to 21% effective January 1, 2018.\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry forwards for federal income tax reporting purposes are subject to annual limitations. Should a change in ownership occur, net operating loss carry forwards may be limited as to use in future years.\nASC Topic 740 provides guidance on the accounting for uncertainty in income taxes recognized in a companys financial statements. Topic 740 requires a company to determine whether it is more likely than not that a tax position will be sustained upon examination based upon the technical merits of the position. If the more-likely-than-not threshold is met, a company must measure the tax position to determine the amount to recognize in the financial statements.\nThe Company includes interest and penalties arising from the underpayment of income taxes in the statements of operations in the provision for income taxes. As of June 30, 2023, the Company had no accrued interest or penalties related to uncertain tax positions.\nWith few exceptions, the Company is no longer subject to U.S. federal, state and local income tax examinations by tax authorities for years before 2016.\nNOTE 12 - SUBSEQUENT EVENTS\nManagement has evaluated subsequent events pursuant to the requirements of ASC Topic 855, from the balance sheet date through the date the financial statements were issued and has determined that no material subsequent events exist. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nManagements Conclusions Regarding Effectiveness of Disclosure Controls and Procedures\nAs required by Rule 13a-15 under the Securities Exchange Act of 1934, as of June 30, 2022, the end of the year covered by this report, our management concluded its evaluation of the effectiveness of the design and operation of our disclosure controls and procedures.\nDisclosure controls and procedures refer to controls and other procedures designed to ensure that information required to be disclosed in the reports we file or submit under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC and that such information is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating our disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating and implementing possible controls and procedures.\nOur management does not expect that our disclosure controls and procedures will prevent all error and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of simple error or mistake. The design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nWith respect to the fiscal year ending June 30, 2022, under the supervision and with the participation of our management, we conducted an evaluation of the effectiveness of the design and operations of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) promulgated under the Securities Exchange Act of 1934. Based upon our evaluation regarding the fiscal year ending June 30, 2022, our management, including our principal executive officer and principal financial officer, has concluded that our disclosure controls and procedures were ineffective.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act. Our management is also required to assess and report on the effectiveness of our internal control over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act of 2002 (Section 404). Management assessed the effectiveness of our internal control over financial reporting as of June 30, 2022. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework. Based on that evaluation, our management concluded that our internal controls over financial reporting were not effective as of such date to ensure that information required to be disclosed in the reports that we file or submit under the Exchange Act, is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms. We note the following deficiencies that management believes to be material weaknesses:\n· The Companys lack of segregation of duties.\n· Lack of an audit committee and independent directors\n· Management has not established appropriate and rigorous procedures for evaluating internal controls over financial reporting. Due to limited resources and lack of segregation of duties, documentation of the limited control structure has not been accomplished.\n· We employ policies and procedures for reconciliation of the financial statements and note disclosures, however, these processes are not appropriately documented.\n· Management has not established methodical and consistent data back-up procedures to ensure loss of data will not occur.\nThe Company is evaluating the necessity of implementing an independent board of directors to rectify these weaknesses.\nA material weakness (within the meaning of PCAOB Auditing Standard No. 5) is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis. A significant deficiency is a deficiency, or a combination of deficiencies, in internal control over financial reporting that is less severe than a material weakness, yet important enough to merit attention by those responsible for oversight of the companys financial reporting.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit us to provide only managements report in this annual report.\nChanges in Internal Controls\nThere have been no changes in our internal control over financial reporting during the year ended June 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal controls over financial reporting. Item 9B. Other Information\nWe have no other information to disclose that was required to be disclosed in a report on Form 8-K during the fourth quarter of fiscal year ended June 30, 2023 that was not reported.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nBelow are the names of and certain information regarding the Companys current executive officers and directors:\nName\nAge\nPosition\nRichard Carey\nChief Executive Officer, Co Chairman of the Board\nAnthony L. Anish\nChief Financial officer, Company Secretary, Director\nWeverson Correia\nChief Executive Officer, Director\nBryan Cappelli\nDirector\nFranz Allmayer\nVice President Finance, Director\nThemis Glatman\nTreasurer, Director\nFernando Godina\nVice President, Board member\nRichard Carey\nPresident, Director and Chairman of the Board\nRichard Carey, 84, has served as the Companys director since May 14, 2018, and as President and Chairman of the Board of Directors since May 17, 2018. He devotes 100% of his time toward the Companys business operations. He has several decades of experience in a wide range of industries, including finance, diamond and gold mining operations, oil and gas exploration. Mr. Carey began his career in 1958 when he received a congressional appointment to the US Naval Academy as the son of Congressional Medal of Honor recipient Charles Francis Carey Jr. Upon honorable discharge from the US Navy in 1964, Mr. Carey began a career in finance as a NYLIC underwriter for New York Life. From 1967 to 1973, Mr. Carey worked as a stockbroker and principal of a brokerage firm. In 1973 he began structuring oil and gas limited partnerships for developmental drilling programs. These programs included hundreds of successful oil and gas wells, and a lucrative Geo-Thermal project in Colorado as a general partner with AMEX (an American Stock Exchange listed company).\nIn the subsequent 40 years, Mr. Carey has founded and co-founded multiple companies in a wide range of industries including diamond and gold mining operations, oil and gas exploration, energy resellers, entertainment, specialty finance and tax offset programs. With his broad experience and an extensive personal and business network, Mr. Careys financial acumen has added significant value to every project in which he has participated. With his unique understanding of the diversity of business structures and an ongoing commitment to innovate and adapt to new practices, he continues to build upon the depth of knowledge and success gained throughout his career.\nAnthony L. Anish - Chief Financial Officer and Corporate Secretary\nAnthony (Tony) Anish has served as a director and Chief Financial Officer of the Company since May 2019. He devotes 100% of his time toward the Companys business operations. Mr. Anish has been involved in public companies in the US for over 20 years.\nMr. Anish became a Member of the Institute of Chartered Accountants (England) in 1972. Mr. Anish ran his own firm of Chartered Accountants from 1973 until 1978 when he sold his share in the firm to his partners.\nHe moved to the United States in 1979 to run a subsidiary of a UK Company, Performance Tire Ltd. and led a huge expansion increasing sales from $2 million to over $28 million. He left them in 1982 and ran his own group of stores in the car repair and tire business expanding to 9 locations before selling and returning to his accounting and finance background.\nFrom 1985 until 2009, Mr. Anishs operations provided business financing programs including equipment leasing and asset based financing programs. During this time Mr. Anish consulted on a number of reverse merger transactions.\nIn 2010, Mr. Anish became a Director of M Line Holdings, Inc. a small public company in the aerospace business and continued with M Line and another public entity Square Chain Corporation until joining Star Alliance International on a temporary consulting position in March 2019.\nWeverson Correia\nWeverson Correia, has served as Chief Executive Officer and a Director of the Company since January 24, 2022. Mr. Correia has extensive experience in management and international business, analyzing new product requirements, developing sales forecasts, and pricing structure. Mr. Correia devotes approximately 30% of his time toward the Companys business operations. He currently spends time in Guatemala at the testing facility related to the contemplated acquisition of Commsas mines. Once the acquisition of Commsa and Lion Works is complete, Mr. Correia, who speaks fluent Spanish and Portuguese, will spend more time at these facilities.\nPrior to joining the Company, from 2021 until January 2022, Mr. Correia was working as Vice President sales at Mode Chicago, a company that develops software for mobile phones and sale mobile phone, where he performed market analysis, customer/distributor education, and was finding new distribution channels. From 2018 to 2019, Mr. Correia has worked for are ROKiT in Malibu California as SVP Sales; and prior to that position, between 2017 and 2018, he was serving Intelligent Technologies Co. Ltd. as CEO managing that company, improving its productivity and enhancing customer service.\nMr. Correia received his Bachelor of Business Administration in Management & International Business from Florida International University, Landon School of Business in 2005 and his MBA, from Nova Southeastern University, H. Wayne Huizenga School of Business, Miami, FL in 2008, We believe that Mr. Correias qualifications, including strategic initiatives for sales, marketing, and new product launches in global markets helps develop new business; and his proficient in SAP, MAS 200, Solomon, POS, Salesforce, and MS Office and his fluency in English, Spanish, and Portuguese makes him a valuable member of our Board and Chief Executive Officer.\nFranz Allmayer\nFranz Allmayer has served as Vice President of Finance and a director since May, 2018. Franz is located in Austria and has strong connections in Guatemala. Mr. Allmayer has strong connections to innovative technology which led him to introduce Star to the genesis system in Guatemala.\nMr. Allmayer obtained a Bachelor of Science in 2010 from the Applied Sciences Technikum in Vienna, Austria as well as a Master of Science from the London School of Economics in London, England obtained in 2014.\nHe worked as a coordinator for the Advanced development for Africa (ADA) from June 2010 until April 2012 and then worked to harness soft loan financing for eligible countries to finance hospital projects for Vamed Engineering. He continued as an independent contractor for the Clinton health Access Initiative (CHAI) working to leverage CHAIs existing capabilities and in in 2015 worked with AFAQ Group to develop an strategy for a portfolio of innovative technologies to serve the UAE and middle eastern markets also representing the Royal Family of Dubai.\nSince 2018 Mr. Allmayer founded and manages Integrity Earth a digital venture co-operative for applied regenerative development combining proven frameworks of best practices in ecological restoration. In 2019 he also founded SEEDS, a financial ecosystem that gives value to financial contributions in multiple forms of capital bringing together people and organizations worldwide.\nThemis Glatman - Treasurer, Director\nMrs. Glatman, serves as a director and Treasurer, since May, 2018. She supports the management team in relation to the cash flow and use of cash for investments.\nMrs. Glatman was born in Brazil where she studied Chemistry at the Federal University of Parana. She is a highly decorated athlete, having achieved an athletic scholarship that allowed her to come to the United States. There she attended Brigham Young University in Utah, studying Chemical Engineering for three years. She is fluent in English, Spanish, Portuguese with some French and Italian.\nIn 1981 she moved to Los Angeles pursuing a seventeen-year career in construction including commercial, residential, multi-family as well as smaller remodeling projects. After receiving her accreditation by the California Contactors License Board, she founded Gotham Design and Construction, which allowed her to acquire homes for her own remodeling projects, as well as projects for companies and individual clients. She is well versed in reading blueprints and understands architectural, engineering, and financial requirements of projects from their financing through excavation, grading, paving, and concrete work through final finishes. Her experience will be of great benefit once Star starts developing land after cleaning tailings with the Genesis System.\nShe has served on many boards and is currently a director of SCYA (Southern California Yachting Association), SMWYC (Santa Monica Windjammers Yacht Club) and for RBOC ( Recreational Boaters of California, a Lobbying firm based in Sacramento).\nFernando Godina - Vice President and Director\nMr. Fernando Godina became a director and Vice President of the Company in 2021. His has an extensive experience managing various types of business and ventures and will take a significant role managing our mining operations.\nIn 1998 Mr. Godina started with Ashley furniture as a furniture representative. By 2001 he increased the territory he managed from $538 K to over $10 million a year.\nIn 2002, Fernando and his partners opened their first Ashley home store in Oahu Hawaii and then a second store in Reno Nevada in 2003. In 2005, the two stores generated over 43 million revenue for that year. The Reno store is still open today.\nIn 2003, Mr. Godina went into the mortgage business. He and his partner started with one office and expanded to four Mortgage offices with Pinnacle Financial growing that business substantially to over 85 million in loans per annum. That business continued to operate until mid 2008.\nFrom 2008 until 2013 Mr. Godina was working as a financial broker introducing business and other transactions to funding sources. To approve and fund.\nIn 2013, Mr. Godina formed FMG Investment LLC. This business is a private lending venture capital business that he still operates with his wife currently.\nIn 2018, Mr. Godina formed FMG Corp, a company that provides financial services, including financial consulting, business finance programs and investor referrals. which he still operates today. FMG has been instrumental in introducing a number of investors to the Company as well as doing multiple transactions for other businesses.\nBryan Cappelli - Director\nBryan Cappelli has served as our director since April 20, 2022. Mr. Capelli has financed, developed and/or acquired more than $3.0 billion of real estate projects in the New York Tri State area and has 18 years of development and capital markets experience.\nFrom 2007-2014, Mr. Cappelli served as Chief Operating Officer of the Cappelli Organization overseeing ~$1B of mixed-use developments in Westchester and Fairfield Counties, including The Ritz Carlton Hotel and Condominiums, City Center White Plains, and Trump Parc Residences.\nFrom 2014-2020, Mr. Cappelli served as Co-President of Development for Ceruzzi Holdings and was a member of the investment committee. He oversaw the acquisition and development of the Centrale and Hayworth condominium projects and the Lipstick Building, totaling over 1 million square feet and $1B in value.\nIn 2017 Mr. Cappelli founded Blue Line Real Estate Ventures, a dynamic real estate investment vehicle which has served as co-general partner in multiple large scale development and acquisitions across all asset classes in addition to making significant angel investments in various emerging development technologies and operating companies.\nMr. Cappelli earned a B.S. in Economics and a Minor in Philosophy from Duke University.\nTerm of Office\nOur directors are appointed for a one-year term and hold office until the next annual general meeting of our shareholders or until removed from office in accordance with our bylaws. Our officers are appointed by our board of directors and hold office until removed by the board.\nFamily Relationships\nThere are no family relationships between or among the directors, executive officers, or persons nominated or chosen by us to become directors or executive officers.\nInvolvement in Certain Legal Proceedings\nNo executive officer or director has been involved in the last ten years in any of the following:\n· Any bankruptcy petition filed by or against any business or property of such person, or of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n· Any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n· Being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities;\n· Being found by a court of competent jurisdiction (in a civil action), the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n· Being the subject of or a party to any judicial or administrative order, judgment, decree or finding, not subsequently reversed, suspended or vacated relating to an alleged violation of any federal or state securities or commodities law or regulation, or any law or regulation respecting financial institutions or insurance companies, including but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail, fraud, wire fraud or fraud in connection with any business entity; or\n· Being the subject of or a party to any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act, any registered entity (as defined in Section 1(a) (29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nBoard Committees and Audit Committee Financial Expert\nWe do not currently have a standing audit, nominating or compensation committee of the Board of Directors, or any committee performing similar functions. Our Board of Directors performs the functions of audit, nominating and compensation committees. As of the date of this annual report, no member of our Board of Directors qualifies as an audit committee financial expert as defined in Item 407(d) (5) of Regulation S-K promulgated under the Securities Act.\nDirector Nominations\nAs of June 30, 2022, there have not been any material changes to the procedures by which our shareholders may recommend nominees to our Board of Directors. We have not established formal procedures by which security holders may recommend nominees to the Companys Board of Directors.\nCode of Ethics\nWe have adopted a code of ethics that applies to our principal executive officers, principal financial officer, principal accounting officer or controller, or persons performing similar functions. A copy of our code of ethics may be obtained free of charge by contacting us at the address or telephone number listed on the cover page hereof. Item 11. Executive Compensation\nThe table below sets forth certain information about the compensation awarded to, earned by or paid to our Chief Executive Officer and our other two most highly compensated executive officers whose total compensation exceeded $100,000 during the period ended June 30, 2023 (each, a Named Executive Officer ).\nNon-Equity\nNonqualified\nIncentive\nDeferred\nName and\nStock\nOption\nPlan\nCompensation\nAll Other\nPrincipal\nSalary\nBonus\nAwards\nAwards\nCompensation\nEarnings\nCompensation\nTotal\nPosition\nYear\nUS$\nUS$\nUS$\nUS$\nUS$\nUS$\nUS$\nUS$\nRichard Carey\n210,000\n210,000\nChairman\n180,000\n180,000\nAnthony L. Anish\n150,000\n1,445,000\n1,445,000\nCFO and Co. Secretary\n120,000\n550,000\n120,000\nWeverson Correia\n772,500\n772,500\nCEO\nGrants of Plan-Based Awards Table\nNone of our named executive officers received any grants of stock, option awards or other plan-based awards during the year ended June 30, 2023 or 2022. The Company has no activity with respect to these awards.\nOptions Exercised and Stock Vested Table\nNone of our named executive officers exercised any stock options, and no restricted stock units, if any, held by our named executive officers vested during the year ended June 30, 2023 or 2022. The Company has no activity with respect to these awards.\nOutstanding Equity Awards at Fiscal Year-End Table\nNone of our named executive officers had any outstanding stock or option awards as of June 30, 2023 that would be compensatory to the officer. The Company has not issued any awards to its named executive officers. The Company and its Board of Directors may grant awards as it sees fit to its employees as well as key consultants.\nCompensation of Directors\nWe do not have any formal agreements or arrangements with our non-employee directors to pay for their services. We currently have no formal plan for compensating our directors for their services in their capacity, although we may elect to issue stock options to such persons from time to time. Directors are entitled to reimbursement for reasonable travel and other out-of-pocket expenses incurred in connection with attendance at meetings of our board of directors. Our board of directors may award special remuneration to any director undertaking any special services on our behalf other than services ordinarily required of a director. Our non-employee directors received the following compensation for service to the Board during the fiscal year ended June 30, 2023 and June 30, 2022:\nName Year Paid in Cash Stock Awards Total\nThemis Glatman 1,000,000 $ 165,000\n1,000,000 $ 1,400,000\nBryan Cappelli 5,000,000 $ 1,445,000\nFranz Allmayer\nFernando Godina 5,000,000 $ 1,445,000\n500,000 $ 39,000 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth, as of October 13, 2023, the beneficial ownership of our common stock by each executive officer and director, by each person known by us to beneficially own more than 5% of our common stock and by the executive officers and directors as a group. Except as otherwise indicated, all shares are owned directly, and the percentage shown is based on 308,156,163 shares of common stock issued and outstanding.\nTitle of Class\nName of Beneficial Owner\nAmount and\nNature of\nBeneficial Ownership\nPercentage\nCommon Stock\nRichard Carey\n57,265,500\n18.583%\nCommon Stock\nAnthony L. Anish\n10,000,000\n3.245%\nCommon Stock\nWeverson Correia\n5,500,000\n1.785%\nCommon Stock\nFranz Allmayer\n250,000\n0.008%\nCommon Stock\nThemis Gladman\n3,000,000\n0.974%\nCommon Stock\nBryan Cappelli\n5,000,000\n1.623%\nCommon Stock\nFernando Godina\n5,552,000\n1.802%\nCommon Stock\nTotal all executive officers and directors (7 persons)\n86,567,500\n28.02% Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe following is a description of transactions since July 1, 2022 to which we have been a party, in which the amount involved exceeded or will exceed $120,000, and in which any of our directors, executive officers or holders of more than 5% of our capital stock, or an affiliate or immediate family member thereof, had or will have a direct or indirect material interest.\nOn August 15, 2022, the Company issued 5,000,000 shares of common stock to Fernando Godina, for services as a director. The shares were valued at $0.289 per share, the closing stock price on the date of grant, for total non-cash expense of $1,445,000.\nOn August 15, 2022, the Company issued 5,000,000 shares of common stock to Bryan Cappelli for his services as a director. The shares were valued at $0.289 per share, the closing stock price on the date of grant, for total non-cash expense of $1,445,000.\nOn August 15, 2022, the Company issued 5,000,000 shares of common stock to Weverson Correia, CEO and a director, for services. The shares were valued at $0.289 per share, the closing stock price on the date of grant, for total non-cash expense of $1,445,000.\nOn November 17, 2022, Our Chairman, Mr. Carey sold 4 million of his own shares of common stock in exchange for $42,000 which was loaned to the Company. The loan to the Company is non-interest bearing and due on demand.\nOn January 10, 2022 and December 5, 2022, the Company issued a total of 1,000,000 shares of common stock (total of 2,000,000 shares) to Themis Glatman as compensation for her services as a director. The shares were valued at $0.165 per share, the closing stock price on the date of grant, for total non-cash expense of $165,000.\nOn March 14, 2023, the Company renewed the initial employment agreements for Mr. Carey and Mr. Anish, entering into New Employment Agreements, commencing from August 1, 2022 (the Effective Date) until July 31, 2025. For the period from August 1, 2022 through December 31, 2022, Mr. Carey received a base salary equal to $180,000. From August 1, 2022, through December 31, 2022, Mr. Anish received the base salary equal to $120,000. In addition, Mr. Anish received 2,500,000 shares issued on June 3, 2022, under his initial agreement, and 5,000,000 shares issued on August 15, 2022, as equity compensation under Mr. Anishs New Employment Agreement. The 5,000,000 shares were valued at $0.289 per share, the closing stock price on the date of grant, for total non-cash expense of $1,445,000. Item 14. Principal Accounting Fees and Services\nAudit Fees\nDuring fiscal years ended June 30, 2023 and 2022, we incurred $38,500\t and $30,000, respectively, in fees to our principal independent accountants for professional services rendered in connection with the audit of our financial statements and for the reviews of our financial statements.\nTax Fees\nDuring the years ended June 30, 2023 and 2022, our principal accountant did not render services to us for tax compliance, tax advice or tax planning.\nAll Other Fees\nDuring the years ended June 30, 2023 and 2022, there were no fees billed for products and services provided by the principal accountant other than those set forth above.\nCurrently, we have no independent audit committee. Our full board of directors functions as our audit committee and is comprised of one director who is not considered to be independent in accordance with the requirements of Rule 10A-3 under the Exchange Act. Our audit committees pre-approval policies and procedures described in paragraph (c)(7)(i) of Rule 2-01 of Regulation S-X were that the audit committee pre-approve all accounting related activities prior to the performance of any services by any accountant or auditor.\nPART IV Item 15. Exhibits, Financial Statement Schedules\nThe following exhibits are filed as part of this Annual Report.\nExhibit\nDescription\n3.1\nArticles of Incorporation (incorporated by reference to the Registration Statement on Form S-1 filed with the SEC on July 20, 2014)\n3.2\nBylaws (incorporated by reference to the Registration Statement on Form S-1 filed with the SEC on July 20, 2014)\n3.3\nArticles of Amendment to Articles of Incorporation dated January 6, 2017 with respect to the change of the name of the Company to Star Alliance International Corp.\n3.4\nArticles of Amendment to Articles of Incorporation dated June 16, 2019 increasing the authorized capital of the Registrant\n3.5\nCertificate of Designations of Series A Preferred Stock dated July 27, 2020 (incorporated by reference to the Registration Statement on Form S-1 filed with the SEC on August 14, 2020)\n3.6\nArticles of Designations of Series B Preferred Stock dated November 16, 2019 (incorporated by reference to Exhibit 3.1 to Current Report on Form 8-K filed with the SEC on August 19, 2019)\n3.7\nCertificate of Designations of Series C Preferred Stock, dated March 28, 2022 (incorporated by reference to Exhibit 3.7 to Form S-1 filed with the SEC on June 15, 2023)\n3.8\nArticles of Amendment to the Articles of Incorporation, dated May 30, 2022, increasing the authorized capital of the Registrant (incorporated by reference to Exhibit 3.7 to Form S-1 filed with the SEC on June 15, 2023)\n10.1\nAsset Purchase Agreement dated June 13, 2019 between the Registrant and Troy (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K dated August 19, 2019)\n10.2\nShare Exchange Agreement dated December 15, 2021 by and between the Registrant and Juan Lemus (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K dated December 22, 2021).\n10.3\nCommon Stock Purchase Agreement by and between Keystone and the Registrant dated March 15, 2023 (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K dated March 20, 2023)\n10.4\nRegistration Rights Agreement by and between Keystone and the Registrant dated March 15, 2023 (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K dated March 20, 2023)\n10.5\nShare Purchase Agreement dated March 19, 2023 by and among the Registrant, Lion Works and Juan Lemus (incorporated by reference to Exhibit 10.5 to the Registration Statement on Form S-1 filed with the SEC on June 15, 2023)\n10.6\n12% Convertible promissory note issued to Quick Capital LLC on February 7, 2023 (incorporated by reference to Exhibit 10.6 to the Registration Statement on Form S-1 filed with the SEC on June 15, 2023)\n10.7\n10% Convertible promissory note issued to AES Capital Management, LLC on February 8, 2023 (incorporated by reference to Exhibit 10.7 to the Registration Statement on Form S-1 filed with the SEC on June 15, 2023)\n10.8\nEmployment Agreement between the Registrant and Richard Carey, effective as of August 1, 2022 (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q dated May 22, 2023)\n10.9\nEmployment Agreement between the Registrant and Anthony Anish, effective as of August 1, 2022 (incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q dated May 22, 2023)\n10.10\nSeries C Preferred Purchase Agreement by and between the Registrant and Geneva Roth Remark Holdings, Inc. dated January 17, 2023 (incorporated by reference to Exhibit 10.10 to the Registration Statement on Form S-1 filed with the SEC on June 15, 2023)\n10.11\nSeries C Preferred Purchase Agreement by and between the Registrant and Geneva Roth Remark Holdings, Inc. dated February 16, 2023 (incorporated by reference to Exhibit 10.11 to the Registration Statement on Form S-1 filed with the SEC on June 15, 2023)\n10.12\nAddendum to the Share Exchange Agreement by and between the Registrant and Juan Lemus dated August 14, 2023 (incorporated by reference to Exhibit 10.12 to Form S-1/A filed with the SEC on August 28, 2023)\n10.13\nFirst Addendum to the Share Purchase Agreement by and between Lion Works (incorporated by reference to Exhibit 10.13 to Form S-1/A filed with the SEC on August 28, 2023)\n10.14*\nSecond Addendum to the Share Exchange Agreement by and between the Registrant and Juan Lemus dated September 28, 2023\n10.15*\nSecond Addendum to the Shares Purchase Agreement by and between The Registrant and Compañia Minera Metalurgica Centro Americana dated September 28, 2023\nExhibit\nDescription\n31.1 *\nCertification by the Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act\n31.2 *\nCertification by the Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act\n32.1 *\nCertification by the Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act\n101.INS *\nXBRL Instance Document\n101.SCH *\nXBRL Taxonomy Extension Schema Document\n101.CAL *\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF *\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB *\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE *\nXBRL Taxonomy Extension Presentation Linkbase Document\n______________\n* Filed herewith\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunder duly authorized.\nStar Alliance International Corp.\nDated: October 13, 2023 By: /s/ Richard Carey\nRichard Carey\nPresident and Chairman\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nCapacity\nDate\n/s/ Richard Carey\nPresident, Chairman and Director\nOctober 13, 2023\nRichard Carey\n(Principal Executive Officer)\n/s/ Anthony Anish\nChief Financial Officer, Corporate Secretary and Director\nOctober 13, 2023\nAnthony Anish\n(Principal Financial and Accounting Officer)\n/s/ Weverson Correia\nChief Executive Officer and Director\nOctober 13, 2023\nWeverson Correia\n/s/ Franz Allmayer\nVice President Finance and Director\nOctober 13, 2023\nFranz Allmayer\n/s/ Themis Glatman\nTreasurer and Director\nOctober 13, 2023\nThemis Glatman\n/s/ Fernando Godina\nVice President and Director\nOctober 13, 2023\nFernando Godina\n/s/ Bryan Cappelli\nDirector\nOctober 13, 2023\nBryan Cappelli"
}