{
    "cik": "1614556",
    "company": "Star Alliance International Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-11-22",
    "period_of_report": "2022-06-30",
    "sic": "1040",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1614556/0001683168-22-007985-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1614556/000168316822007985/star_i10k-063022.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1614556/0001683168-22-007985.txt",
    "filename": "1614556_10K_2022_0001683168-22-007985.htm",
    "content": "Item 1. Business\nStar Alliance International Corp. (the Company, we, us) was originally incorporated with the name Asteriko Corp. in the State of Nevada on April 17, 2014 under the laws of the State of Nevada. Our prior business plans, which generated limited or no earnings, included interior decorating products, and a travel and tourism service.\nOn May 14, 2018, Richard Carey our President and Chairman of the Board, acquired 22,000,000 shares of common stock of the Company, representing 62.15% ownership of the Company which constitutes control. Mr. Carey accepted the positions of President and Chairman of the Board on the same day.\nIn August 14, 2018, the Company entered into an Exclusive Option Agreement (the Agreement) with Starving Lion, Inc. (Lion). Under the Agreement, the Company has been granted the exclusive option, for a period of six (6) months, to acquire the assets from Starving Lion, Inc. specified under the June 4, 2018 Letter of Intent. The assets pertain mainly to two mines located in Guatemala; one is a magnesium mine in El Progresso, and the other is a gold mine in Livingston.\nThe required purchase price for the Starving Lion, Inc. assets will be $1,000,000 cash, together with the issuance to Lion of new common and/or preferred stock to represent fifty-eight percent (58%) of the Companys issued and outstanding common stock on a fully-diluted, post-closing basis. The Company decided not to proceed with this potential acquisition at this time.\nOn October 25, 2018, Star entered into a Letter of Intent (the LOI) with Troy Mining Corporation, a Nevada corporation (Troy) and its two majority shareholders and on March 25, 2019 and on August 5th this LOI was extended. Troy is the owner of 78 gold mining claims consisting of approximately 4800 acres, located east/southeast of El Portal, California, in Mariposa County. Troy also owns a production processing mill together with related equipment and buildings. On August 13th, 2019, the Company closed the transaction making the first payment on the acquisition of all the assets of Troy Mining Corporation.\nOn June 12, 2019, the Board approved the issuance of 48 million shares of common stock to Richard Carey, reducing his loan by $48,000.\nOn July 2, 2020, the Board granted all 1,000,000 shares of the Series A preferred stock to the Companys Chairman and CEO, Richard Carey, in conversion of $68,556 of accrued compensation.\nThe Companys business focus will be the pursuit of mining, mining technology businesses and other business with significant patented technology.\nOn November 22, 2021, a binding Letter of Intent was signed for the acquisition of 49% of Genesis. Genesis is a patented technology for extracting gold from Oxide and other complex ore, in a sustainable method, that also yields a vastly improved recovery rate even where the presence of gold is as little as 0.25 parts per million. This is a clean, green and ecofriendly method with up to a 98% recovery rate. This project will be owned by a newly formed wholly owned subsidiary of Star Alliance International Corp. Since the original letter of Intent was signed the terms have now been renegotiated and Stars new subsidiary will acquire 51% of Genesis. This is expected to close early in 2023.\nOn December 17, 2021, the Company agreed to purchase 51% of Compania Minera Metalurgica Centro Americana (Commsa), a Honduran Corporation. Commsa owns the mining rights to five operating mines that run along a 12.5 mile stretch of the Rio Jalan River. This acquisition becomes effective in January 2022. The Company has issued to date 250,000 shares of Common stock and paid $75,000 towards the purchase price.\nOn May 9, 2022, a binding letter of intent was signed for the acquisition of 51% of NSM USA, a Wyoming corporation that owns 100% of four lithium mines in West Africa. The cost of these mines is $2 million most of which is to be used for the growth of the four mines. These mines that are already producing small amounts of Lithium will be greatly expanded with the purchase of equipment. This transaction is due to close early 2023 with full production expected in the second quarter of 2023.\nOn May 11, 2022, a binding letter of intent was signed for the acquisition of 51% of NGM USA, a Wyoming corporation that owns 100% of three gold mines in West Africa. The cost of this acquisition is $2 million, most of which will be used for equipment and growth of the mines. This transaction is due to close early 2023. All exploration work has been completed and production is anticipated to start in the second quarter of 2023.\nOn May 23, 2022, a binding letter of intent was signed for the acquisition of 75% of Magma International Inc. (MII). This acquisition for stock and cash will result in MII owning the Intellectual property, Building, equipment and significant inventory as well as the know how to produce Barotex. Mr. Lilo Benzicron the original inventor of this product will join Barotex as CEO and will be driving the innovation of new products for MII. This transaction is expected to close early 2023.\nEmployees\nThe management of the Company expects to use consultants, attorneys and accountants as necessary, and does not anticipate a need to engage any full-time employees so long as it is seeking and evaluating business opportunities. The need for employees and their availability will be addressed in connection with the decision whether or not to acquire or participate in specific business opportunities.\nSmaller Reporting Company Status\nWe qualify as a smaller reporting company under Rule 12b-2 of the Exchange Act, which is defined as a company with a public equity float of less than $75 million. To the extent that we remain a smaller reporting company at such time as are no longer an emerging growth company, we will still have reduced disclosure requirements for our public filings, some of which are similar to those of an emerging growth company, including not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act and the reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements. Item 1A. Risk Factors\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 1B. Unresolved Staff Comments\nNot applicable. Item 2. Properties\nWe currently do not own or rent any property. Item 3. Legal Proceedings\nManagement is not aware of any legal proceedings contemplated by any governmental authority or any other party involving us or our properties. As of the date of this year-end report, no director, officer or affiliate is (i) a party adverse to us in any legal proceeding, or (ii) has an adverse interest to us in any legal proceedings. Management is not aware of any other legal proceedings pending or that have been threatened against us or our properties. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nThere is a limited public market for our common shares. Our common shares are quoted on the OTC Bulletin Board at this time. Trading in stocks quoted on the OTC Bulletin Board is often thin and is characterized by wide fluctuations in trading prices due to many factors that may be unrelated to a companys operations or business prospects. We cannot assure you that there will be a market in the future for our common stock.\nOTC Bulletin Board securities are not listed or traded on the floor of an organized national or regional stock exchange. Instead, OTC Bulletin Board securities transactions are conducted through a telephone and computer network connecting dealers in stocks. OTC Bulletin Board issuers are traditionally smaller companies that do not meet the financial and other listing requirements of a regional or national stock exchange.\nOur shares of our common stock have been trading on OTC Markets since 2020.\nNumber of Holders\nAs of June 30, 2022, the 162,788,028 issued and outstanding shares of common stock were held by a total of 159 shareholders of record.\nDividends\nNo cash dividends have been paid on our shares of common stock during the fiscal years ended June 30, 2022 and 2021. We have not paid any cash dividends since our inception and do not foresee declaring any cash dividends on our common stock in the foreseeable future.\nRecent Sales of Unregistered Securities\nDuring the year ended June 30, 2022, the Company sold 21,955,000 shares of common stock for total cash proceeds of $564,000.\nDuring the fiscal year the Company has sold 2 tranches of Preferred C shares totaling 207,500 to an investor at $1.00 per share with total cash proceeds of $207,500.. These may be converted to common shares at the end of a six month hold period at a 35% discount to market.\nPurchase of our Equity Securities by Officers and Directors\nOn July 2, 2020, the Board granted all 1,000,000 shares of the Series A preferred stock to the Companys Chairman and CEO, Richard Carey, in conversion of $68,556 of accrued compensation.\nOther Stockholder Matters\nNone. Item 6. Selected Financial Data\nNot applicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion and analysis of our financial condition and results of operations together with our financial statements and the related notes and other financial information included elsewhere in this Form 10-K. Some of the information contained in this discussion and analysis or set forth elsewhere in this Form 10-K, including information with respect to our plans and strategy for our business and related financing, includes forward-looking statements that involve risks and uncertainties.\nOur cash balance was $71,724 as of June 30, 2022. We believe our cash balance is not sufficient to fund our limited levels of operations for any period of time. We have been utilizing funds raised from the sale of shares and borrowed from our Chairman. The Chairman has no commitment, arrangement or legal obligation to advance or loan funds to the company. The borrowing is non-interest-bearing, unsecured, and due on demand.\nOur independent registered public accountants have issued a going concern opinion. This means that there is substantial doubt that we can continue as an on-going business for the next twelve months unless we obtain additional capital to pay our bills. The accompanying financial statements have been prepared assuming that the Company continues as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business. As shown in the accompanying financial statements, the Company has accumulated deficit of $15,058,400 and working capital of $1,034,930 as of June 30, 2022, and a net loss of $11,885,609 most of which is a non cash expense. The Company used $739,630 of cash in operating activities for the year ended June 30, 2022. Due to these conditions, it raises substantial doubt about the Companys ability to continue as a going concern.\nWe are an emerging growth company as defined in the JOBS Act, and we may take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies including, but not limited to: not required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act; reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements; exemptions from the requirements of holding an annual non-binding advisory vote on executive compensation and nonbinding stockholder approval of any golden parachute payments not previously approved. In addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We are choosing to opt out of such extended transition period, and as a result, we will comply with new or revised accounting standards on the relevant dates on which adoption of such standards is required for non-emerging growth companies. Section 107 of the JOBS Act provides that our decision to opt out of the extended transition period for complying with new or revised accounting standards is irrevocable.\nResults of Operations for the years ended June 30, 2022 and 2021\nOperating expenses\nGeneral and administrative expenses were $1,909,581 for the year ended June 30, 2022, compared to $94,508 for the year ended June 30, 2021, an increase of $1,815,073. The increase is due to an increase in filing fees and consulting expenses.\nProfessional fees were $144,763 for the year ended June 30, 2022, compared to $57,029 for the year ended June 30, 2021, increase of $87,734. Professional fees consist mainly of legal, accounting and audit expense. The increase is due to an increase in legal and audit fees.\nThere was a loss on conversion of common stock for Directors compensation of $2,111,500 and officer compensation of $952,500 for the year ended June 30, 2022 compared to $90,000 and $155,000 for the year ended June 30, 2021\nOther income (expense)\nFor the year ended June 30, 2022, we had interest expense of $297,417 and a net loss on conversion of debt of $102,403 compared to interest expense of $10,800 and loss on conversion of debt of $46,200 for the year ended June 30, 2021. In addition, there was a loss on issuance of convertible debt of $575,396 compared to $0 in 2021. . Interest expense has increased as a result of interest on notes payable that were added to the Companys liabilities and the amortization of debt discount associated with our convertible notes.\nNet Loss\nNet loss for the year ended June 30, 2022 was $11,885,609 compared to $503,017 for the year ended June 30, 2021.\nPlan of Operations\nWe expect that working capital requirements will continue to be funded through borrowing from related parties and others. Subsequent to the year end the Company acquired the mining claims and equipment assets of Troy Mining Corporation. We also acquired or entered into binding letters of intent to acquire other businesses during the year ended June 30, 2022.\nOff Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nMaterial Commitments\nAs of the date of this Annual Report, we do not have any material commitments.\nPurchase of Significant Equipment\nWe do not intend to purchase any significant equipment during the next twelve months.\nLiquidity and Capital Resources\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business. As shown in the accompanying financial statements, the Company has accumulated deficit of $15,058,400 and working capital of $1,034,930 as of June 30, 2022, and a net loss of $11,885,609 most of which is non cash expense. The Company used $739,630 of cash in operating activities for the year ended June 30, 2022. Due to these conditions, it raises substantial doubt about the Companys ability to continue as a going concern.\nNet cash used in operating activities was $739,630 for the year ended June 30, 2022 as compared to the net cash used in operating activities of $355,574 for the year ended June 30, 2021. The increase in net cash used in operating activities from 2022 to 2021 is because expenses increased during the year ended June 30, 2022.\nNet cash provided by financing activities was $1,004,565 and $342,305 for the years ended June 30, 2022 and 2021, respectively.\nOver the next twelve months, we expect our principle source of liquidity may be dependent on borrowings from related and other parties.\nGoing Concern Consideration\nOur auditors have issued a going concern opinion, meaning that there is substantial doubt if we can continue as an on-going business for the next twelve months unless we obtain additional capital. The Companys cash position may not be sufficient to support its daily operations.\nLimited operating history and need for additional capital\nThere is no historical financial information about us upon which to base an evaluation of our performance. We are in start-up stage operations and have not generated any significant revenues. We cannot guarantee we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources and possible cost overruns due to price and cost increases in services and products. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot applicable to smaller reporting companies. Item 8. Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firms\nBalance Sheets as of June 30, 2022 and 2021\nStatements of Operations for the Years Ended June 30, 2022 and 2021\nStatements of Changes in Stockholders Deficit for the Years Ended June 30, 2022 and 2021\nStatements of Cash Flows for the Years Ended June 30, 2022 and 2021\nNotes to the Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nStar Alliance International Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Star Alliance International Corp. (the Company) as of June 30, 2022 and the related statement of operations, stockholders deficit and cash flows for the period then ended and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and its cash flows for each of the period then ended in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion\n.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in note 3 to the financial statements, the Company has incurred losses since inception of $15,058,400. For the year ended June 30, 2022, the Company had a net loss of $11,885,609. These factors create an uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nEmphasis of Matters-Risks and Uncertainties\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and financial markets of many countries, including the geographical area in which the Company plans to operate.\nEmphasis of Matters-Risks and Uncertainties\nThe Company has had significant transactions and relationships with related parties, including the Companys Co-Chairman, which are described in the financial statements. Transactions involving related parties cannot be presumed to be carried out on an arms length basis, as the requisite conditions of competitive, free market dealings may not exist.\n/s/ Gries & Associates, LLC\nWe have served as the Companys auditor since 2021.\nDenver, Colorado\nNovember 22, 2022\nPCAOB# 6778\nSTAR ALLIANCE INTERNATIONAL CORP.\nBALANCE SHEETS\nJune 30,\nJune 30,\nASSETS\nCurrent assets:\nCash $ 71,724 $ 6,789\nPrepaids and other assets 547,350 -\nPrepaid stock for services 1,813,854 -\nTotal current assets 2,432,928 6,789\nProperty and equipment 450,000 450,000\nMining claims 57,532 57,532\nTotal other assets 507,532 507,532\nTotal Assets $ 2,940,460 $ 514,321\nLIABILITIES AND STOCKHOLDERS EQUITY (DEFICIT)\nCurrent liabilities:\nAccounts payable $ 52,760 $ 18,378\nAccrued expenses 25,961 12,888\nAccrued compensation 212,428 171,370\nNotes payable 119,215 467,380\nConvertible notes payable, net of discount of $191,248 323,752 -\nDerivative liability 689,231 -\nNote payable - former related party 32,000 32,000\nDue to former related party 42,651 42,651\nTotal current liabilities 1,497,998 744,667\nTotal liabilities 1,497,998 744,667\nCOMMITMENTS AND CONTINGENCIES (see footnotes) - -\nStockholders Equity (Deficit):\nPreferred stock, $0.001 par value, 25,000,000 authorized, none issued and outstanding - -\nSeries A preferred stock, $0.001 par value, 1,000,000 authorized, 1,000,000 shares issued and outstanding 1,000 1,000\nSeries B preferred stock, $0.001 par value, 1,900,000 authorized, 1,833,000 issued and outstanding 1,883 1,883\nSeries C preferred stock, $0.001 par value, 1,000,000 shares authorized, 207,500 and 0 shares issued and outstanding, respectively -\nCommon stock, $0.001 par value, 500,000,000 shares authorized, 162,788,028 and 124,319,584 shares issued and outstanding, respectively 162,788 124,320\nAdditional paid-in capital 16,384,983 2,793,609\nCommon stock to be issued - 41,633\nStock subscription receivable (50,000 ) (20,000 )\nAccumulated deficit (15,058,400 ) (3,172,791 )\nTotal stockholders equity (deficit) 1,442,462 (230,346 )\nTotal liabilities and stockholders deficit $ 2,940,460 $ 514,321\nThe accompanying notes are an integral part of these financial statements.\nSTAR ALLIANCE INTERNATIONAL CORP.\nSTATEMENTS OF OPERATIONS\nFor the Years Ended June 30,\nOperating expenses:\nGeneral and administrative $ 1,897,581 $ 94,508\nGeneral and administrative - related party 12,000 15,000\nMine development 791,500 -\nProfessional fees 144,763 57,029\nConsulting 4,843,835 38,350\nDirector compensation 2,111,500 90,000\nOfficer compensation 952,500 155,000\nTotal operating expenses 10,753,679 449,887\nLoss from operations (10,753,679 ) (449,887 )\nOther expense:\nInterest expense (297,417 ) (10,800 )\nChange in fair value of derivative (136,714 ) -\nLoss on conversion of debt (102,403 ) (46,200 )\nLoss on issuance of convertible debt (575,396 ) -\nOther expense (20,000 ) -\nGain on forgiveness of debt - 3,870\nTotal other expense (1,131,930 ) (53,130 )\nLoss before provision for income taxes (11,885,609 ) (503,017 )\nProvision for income taxes - -\nNet loss $ (11,885,609 ) $ (503,017 )\nNet loss per common share - basic and diluted $ (0.08 ) $ (0.00 )\nWeighted average common shares outstanding - basic and diluted 145,317,205 114,938,142\nThe accompanying notes are an integral part of these financial statements.\nSTAR ALLIANCE INTERNATIONAL CORP.\nSTATEMENT OF CHANGES IN STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\nPreferred Stock Series A Preferred Stock Series B Preferred Stock Series C Common Stock Additional\nPaid-in Common Stock\nTo Be\nStock Subscription Accumulated\nShares Amount Shares Amount Shares Amount Shares Amount Capital Issued Receivable Deficit Total\nBalance, June 30, 2020 - $ - 1,833,000 $ 1,883 - $ - 107,313,334 $ 107,314 $ 2,382,859 $ 8,633 $ (9,900 ) $ (2,669,774 ) $ (178,985 )\nStock issued for services - - - - - - 1,250,000 1,250 23,750 - - - 25,000\nStock issued for debt - - - - - - 6,375,000 6,375 222,325 - - - 228,700\nStock sold for cash - - - - - - 9,381,250 9,381 97,119 33,000 (10,100 ) - 129,400\nStock issued for accrued officer compensation 1,000,000 1,000 - - - - - - 67,556 - - - 68,556\nNet loss - - - - - - - - - - - (503,017 ) (503,017 )\nBalance, June 30, 2021 1,000,000 1,000 1,833,000 1,883 - - 124,319,584 124,320 2,793,609 41,633 (20,000 ) (3,172,791 ) (230,346 )\nStock sold for cash - - - - - - 21,955,000 21,955 604,045 (32,000 ) (30,000 ) - 564,000\nPreferred Stock sold for cash - - - - 207,500 - - 207,292 - - - 207,500\nStock issued for services - - - - - - 9,866,444 9,866 9,042,634 (3,000 ) - - 9,049,500\nStock issued for services - related party - - - - - - 4,500,000 4,500 2,757,000 - - - 2,761,500\nStock issued for debt - - - - - - 1,947,000 1,947 680,603 (6,633 ) - - 675,917\nStock issued for acquisition - - - - - - 200,000 299,800 - - - 300,000\nNet loss - - - - - - - - - - - (11,885,609 ) (11,885,609 )\nBalance, June 30, 2022 1,000,000 $ 1,000 1,833,000 $ 1,883 207,500 $ 208 162,788,028 $ 162,788 $ 16,384,983 $ - $ (50,000 ) $ (15,058,400 ) $ 1,442,462\nThe accompanying notes are an integral part of these financial statements.\nSTAR ALLIANCE INTERNATIONAL CORP.\nSTATEMENTS OF CASH FLOWS\nFor the Years Ended\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (11,885,609 ) $ (503,017 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nCommon stock issued for services 7,235,646 25,000\nCommon stock issued for services - related party 2,761,500 -\nLoss on conversion of debt 102,403 46,200\nLoss on issuance of convertible debt 575,396 -\nOther expense 20,000 -\nChange in fair value of derivative 136,714 -\nDebt discount amortization 272,616 -\nGain of forgiveness of debt - (3,870 )\nChanges in assets and liabilities:\nPrepaids and other assets (47,350 ) -\nAccounts payable 34,382 (22,253 )\nAccrued expenses 20,247 6,800\nAccrued compensation 34,425 95,566\nNet cash used in operating activities (739,630 ) (355,574 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPrepaids and other assets (200,000 ) -\nNet cash used in investing activities (200,000 ) -\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds of borrowings from a related party - 53,433\nRepayment to related party - (31,008 )\nProceeds from the sale of common stock 544,000 129,400\nProceeds from the sale of preferred stock 207,500 -\nProceeds from convertible note payable 501,250 -\nProceeds from notes payable 138,971 288,500\nPayment on notes payable (387,156 ) (98,020 )\nNet cash provided by financing activities 1,004,565 342,305\nNet change in cash 64,935 (13,269 )\nCash at the beginning of period 6,789 20,058\nCash at the end of period $ 71,724 $ 6,789\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nInterest paid $ - $ -\nIncome taxes paid $ - $ -\nNON-CASH TRANSACTIONS:\nConversion of debt $ 97,154 $ 182,500\nAccrued compensation converted to common shares $ - $ 68,556\nCommon stock issued for investment $ 300,000 $ -\nCommon stock issued for prepaid services $ 1,813,854 $ -\nThe accompanying notes are an integral part of these financial statements.\nSTAR ALLIANCE INTERNATIONAL CORP.\nNOTES TO FINANCIAL STATEMENTS\nJUNE 30, 2022\nNOTE 1 - NATURE OF BUSINESS\nStar Alliance International Corp. (the Company, we, us) was originally incorporated with the name Asteriko Corp. in the State of Nevada on April 17, 2014 under the laws of the state of Nevada, for the purpose of acquiring and developing gold mining as well as certain other mining properties worldwide.\nNOTE 2 - SIGNIFICANT AND CRITICAL ACCOUNTING POLICIES AND PRACTICES\nBasis of Presentation\nThe accompanying financial statements of the Company have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP) and the rules of the Securities and Exchange Commission (SEC).\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash equivalents\nThe Company considers all highly liquid investments with a maturity of three months or less when purchased to be cash equivalents. There were no cash equivalents for the years ended June 30, 2022 or 2021.\nLong Lived Assets\nProperty consists of mining equipment not yet used. Our company assesses the impairment of long-lived assets whenever events or changes in circumstances indicate that the carrying value may not be recoverable. When we determine that the carrying value of long-lived assets may not be recoverable based upon the existence of one or more indicators of impairment and the carrying value of the asset cannot be recovered from projected undiscounted cash flows, we record an impairment charge. Our company measures any impairment based on a projected discounted cash flow method using a discount rate determined by management to be commensurate with the risk inherent in the current business model. Significant management judgment is required in determining whether an indicator of impairment exists and in projecting cash flows.\nStock-based Compensation\nThe Company records stock-based compensation in accordance with FASB ASC Topic 718, Compensation - Stock Compensation. FASB ASC Topic 718 requires companies to measure compensation cost for stock-based employee compensation at fair value at the grant date and recognize the expense over the employees requisite service period. The Company recognizes in the statement of operations the grant-date fair value of stock options and other equity-based compensation issued to employees and non-employees. The Company accounts for stock-based compensation in accordance with the provision of ASC 505-50, Equity Based Payments to Non-Employees, which requires that such equity instruments are recorded at their fair value on the measurement date. The measurement of stock-based compensation is subject to periodic adjustment as the underlying equity instruments vest.\nNet income (loss) per common share\nNet loss per common share is computed pursuant to section 260-10-45 of the FASB Accounting Standards Codification. Basic net loss per common share is computed by dividing net loss by the weighted average number of shares of common stock outstanding during the period. Diluted net loss per common share is computed by dividing net loss by the weighted average number of shares of common stock and potentially dilutive outstanding shares of common stock during the period to reflect the potential dilution that could occur from common shares issuable through contingent share arrangements, stock options and warrants. The diluted loss per share is the same as the basic loss per share for the years ended July 31, 2022 and 2021, as the inclusion of any potential shares would have had an antidilutive effect due to our loss from operations.\nFair Value of Financial Instruments\nThe Company follows paragraph 825-10-50-10 of the FASB Accounting Standards Codification for disclosures about fair value of its financial instruments and paragraph 820-10-35-37 of the FASB Accounting Standards Codification (Paragraph 820-10-35-37) to measure the fair value of its financial instruments. Paragraph 820-10-35-37 establishes a framework for measuring fair value in accounting principles generally accepted in the United States of America (U.S. GAAP) and expands disclosures about fair value measurements. To increase consistency and comparability in fair value measurements and related disclosures, Paragraph 820-10-35-37 establishes a fair value hierarchy which prioritizes the inputs to valuation techniques used to measure fair value into three broad levels. The fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The three levels of fair value hierarchy defined by Paragraph 820-10-35-37 are described below:\nLevel 1: Quoted market prices available in active markets for identical assets or liabilities as of the reporting date.\nLevel 2: Pricing inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the reporting date.\nLevel 3: Pricing inputs that are generally unobservable inputs and not corroborated by market data.\nThe carrying amount of the Companys financial assets and liabilities, such as cash, prepaid expenses and accrued expenses approximate their fair value because of the short maturity of those instruments. The Companys notes payable approximates the fair value of such instruments as the notes bear interest rates that are consistent with current market rates.\nThe following table classifies the Companys liabilities measured at fair value on a recurring basis into the fair value hierarchy as of June 30, 2022:\nSchedule Of Fair Value, Liabilities Measured on Recurring Basis\nDescription Level 1 Level 2 Level 3\nDerivative $ - $ - $ 689,231\nTotal $ - $ - $ 689,231\nNOTE 3 - GOING CONCERN\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business. As shown in the accompanying financial statements, the Company has an accumulated deficit of $15,058,400 as of June 30, 2022. For the year ended June 30, 2022, the Company had a net loss of $11,885,609, which did include $11,104,275 of non-cash expense incurred for the issuance of common stock for services and derivatives associated with convertible debt. We used $739,630 of cash in operating activities. Due to these conditions, it raises substantial doubt about the Companys ability to continue as a going concern.\nThe Company is attempting to commence operations and generate sufficient revenue; however, the Companys cash position may not be sufficient to support its daily operations. While the Company believes in the viability of its strategy to commence operations and generate sufficient revenue and in its ability to raise additional funds, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon its ability to further implement its business plan and generate sufficient revenue and its ability to raise additional funds. The financial statements do not include any adjustments relating to the recoverability and classification of asset carrying amounts or the amount and classification of liabilities that may result should the Company be unable to continue as a going concern.\nNOTE 4 - ACQUISITION\nOn August 13, 2019, The Company closed an Asset Purchase Agreement (the APA) with Troy Mining Corporation (Troy). Under the APA, the company acquired 78 gold mining claims consisting of approximately 4,800 acres, located east/southeast of El Portal, California, in Mariposa County, together with all of Troys rights to related equipment and buildings currently located on the mining claims. In exchange for the mining claims and related assets, the company agreed to issue 1,883,000 shares of a new class of preferred stock designated Series B Preferred Stock; and agreed to make total cash payments in the amount of $500,000 under a Promissory Note (the Purchase Note).\nUnder the Purchase Note, we paid $50,000 at the time of the closing, and are required to pay an additional $50,000 within sixty days of the closing, and $25,000 every other month thereafter, with the entire remaining amount due no later than March 31, 2020. In the event of default under the Purchase Note, all assets acquired under the APA will be forfeited back to Troy. We are current on all the terms of the agreement.\nOn October 9, 2019, a contract extension was agreed between Star Alliance International Corporation and Troy Mining Corporation. The agreement gives the Company 150 days to file an S-1 registration statement and obtain approval for the shares that are to be issued to the Troy shareholders to become free trading. The S-1 registration was filed on August 14, 2020.\nOn July 14, 2020 a contract extension was agreed between Star Alliance International Corporation and Troy Mining Corporation. The agreement provides for a sixty-day extension on the loan agreement with Troy mining Corporation and also an extension to file the S-1 registration.\nOn February 16, 2021, a contract extension for ninety (90) days was signed between Troy Mining Corporation and Star Alliance International Corporation.\nOn October 21, 2021, a contract extension for ninety (90) days was signed between Troy Mining Corporation and Star Alliance International Corporation and the remaining balance due under the note was paid.\nOn November 22, 2021, a binding Letter of Intent was signed for the acquisition of 49% of Genesis. Genesis is a patented technology for extracting gold from Oxide and other complex ore, in a sustainable method, that also yields a vastly improved recovery rate even where the presence of gold is as little as 0.25 parts per million. This is a clean, green and ecofriendly method with up to a 98% recovery rate. This project will be owned by a newly formed wholly owned subsidiary of Star Alliance International Corp. Since the original letter of Intent was signed the terms have now been renegotiated and Stars new subsidiary will acquire 51% of Genesis. This is expected to close early in 2023.\nOn December 17, 2021, the Company agreed to purchase 51% of Compania Minera Metalurgica Centro Americana (Commsa), a Honduran Corporation. Commsa owns the mining rights to five operating mines that run along a 12.5 mile stretch of the Rio Jalan River. This acquisition becomes effective in January, 2022. The Company has issued to date 250,000 shares of Common stock and paid $75,000 towards the purchase price.\nOn May 9, 2022, a binding letter of intent was signed for the acquisition of 51% of NSM USA a Wyoming corporation that owns 100% of four lithium mines in West Africa. The cost of these mines is $2 million, most of which is to be used for the growth of the four mines. These mines that are already producing small amounts of Lithium will be greatly expanded with the purchase of equipment. This transaction is due to close early 2023 with full production expected in the second quarter of 2023.\nOn May 11, 2022, a binding letter of intent was signed for the acquisition of 51% of NGM USA a Wyoming corporation that owns 100% of three gold mines in West Africa. The cost of this acquisition is $2 million, most of which will be used for equipment and growth of the mines. This transaction is due to close early 2023. All exploration work has been completed and production is anticipated to start in the second quarter of 2023.\nOn May 23, 2022, a binding letter of intent was signed for the acquisition of 75% of Magma International Inc. (MII). This acquisition for stock and cash will result in MII owning the Intellectual property, Building, equipment and significant inventory as well as the know how to produce Barotex. Mr. Lilo Benzicron the original inventor of this product will join Barotex as CEO and will be driving the innovation of new products for MII. This transaction is expected to close early 2023.\nNOTE 5 - RELATED PARTY TRANSACTIONS\nOn January 1, 2021, the employment agreements for Richard Carey and Anthony Anish were updated to include salaries of $180,000 and $120,000 per annum respectively. As of June 30, 2022, the Company has accrued compensation due to Mr. Carey of $52,600 and Mr. Anish of $99,828. As of June 30, 2021, the Company has accrued compensation due to Mr. Carey of $48,628 and Mr. Anish of $126,778. In addition, the Company has accrued salary to Mr. Baird (a former officer) of $60,000. Mr. Baird resigned his position on August 12, 2020.\nMr. Carey is using his personal office space at no cost to the Company.\nOn January 10, 2022, the Company issued 1,000,000 shares of common stock to Themis Glatman, director, for services. The shares were valued at $1.40 per share, the closing stock price on the date of grant, for total non-cash expense of $1,400,000.\nOn January 24, 2022, the Board of Directors appointed Mr. Weverson Correia as the Chief Executive Officer and Director of the Company. Mr. Correia was issued 500,000 shares of common stock on December 16, 2021. The shares were valued at $1.55 per share, the closing stock price on the date of grant, for total non-cash expense of $772,500.\nOn June 3, 2022, the Company issued 2,500,000 shares of common stock to Anthony Anish, CFO and director, for services. The shares were valued at $0.22 per share, the closing stock price on the date of grant, for total non-cash expense of $550,000.\nNOTE 6 - NOTES PAYABLE\nAs of June 30, 2022 and 2021, the Company owed Kok Chee Lee, the former CEO and Director of the Company, $42,651 and $42,651, respectively for operating expenses he paid on behalf of the Company during the year ended June 30, 2018. The borrowing is unsecured, non-interest-bearing and due on demand.\nOn June 1, 2018, the Company executed a promissory note in the amount of $32,000 with the former Secretary of the Board for $30,128 of accrued expenses for services previously provided and an additional $1,872 for services rendered. The note is unsecured, bears interest at 5% per annum and matures on December 1, 2018. As of June 30, 2022 and 2021, there is $6,562 and $6,159, respectively, of accrued interest due on the note. The note is past due and in default.\nOn June 11, 2019, the company executed a promissory note with Troy for $500,000. The Company paid the initial $50,000 due on the note on August 13, 2019. As of June 30, 2022, there is $0 due on this note (Note 4).\nOn June 26, 2020, an individual loaned the Company $25,000, $6,000 of which was converted into 600,000 shares of common stock on July 27, 2020. On February 24, 2021, he loaned an additional $20,000 to the Company. During April 2021, another $14,000 was converted into 1,400,000 shares of common stock. On June 3, 2022, the remaining balance of principal and interest was fully converted into 750,000 shares of common stock.\nAs of June 30, 2022 and 2021, the Company owes various other individuals and entities $119,215 and $467,380, respectively. All the loans are non-interest bearing and due on demand.\nNOTE 7 - CONVERTIBLE NOTES\nOn March 28, 2022, we received short term financing from a private investor under a 10% Fixed Convertible Secured Promissory Note in the principal amount of $400,000 (the Note). The Note bears interest at a fixed rate of 10% per annum with all principal and interest due at maturity on July 31, 2022. The Note is secured by a security interest and lien on all equipment located at our Troy mine in Mariposa County, California. At the option of the investor, and at any time prior to the maturity date, the principal and interest owing under the Note may be converted into shares of our common stock at a conversion price equal to 50% of the lowest closing market price for our common stock during the five trading days preceding the conversion.\nOn June 8, 2022, the Company executed a 10% convertible promissory note with Fast Capital LLC. The note is convertible at a price per share equal to the 65% of the lowest trading price of the Companys common stock during the 20 consecutive trading days up to the date on which lender elects to convert all or part of the Note.\nA summary of the activity of the derivative liability for the notes above is as follows:\nSchedule of derivative liabilities\nBalance at June 30, 2021 $ -\nIncrease to derivative due to new issuances 552,517\nDerivative loss due to mark to market adjustment 136,714\nBalance at June 30, 2022 $ 689,231\nA summary of quantitative information about significant unobservable inputs (Level 3 inputs) used in measuring the Companys derivative liability that are categorized within Level 3 of the fair value hierarchy as of June 30, 2022, is as follows:\nSchedule of fair value assumptions\nInputs\nJune 30,\nInitial\nValuation\nStock price\n$ .1791\n$ .24 - .42\nConversion price\n$ .1061 - .0816\n$ .03 - .2995\nVolatility (annual)\n199.87% - 369.39%\n256.36% - 381.28%\nRisk-free rate\n1.28 - 2.8%\n0.59% - 2.29%\nDividend rate\n-\n-\nYears to maturity\n.08 - .94\n.34 - 1\nNOTE 8 - PREFERRED STOCK\nOf the 25,000,000 shares of the Company's authorized Preferred Stock, $0.001 par value per share, 1,000,000 are designated Series A preferred stock, 1,900,000 shares are designated as Series B Preferred Stock and 1,000,000 shares are designated Series C preferred stock.\nSeries A Preferred Stock\nEach Share of Series A preferred stock shall have 500 votes per share and each share can be converted into 500 shares of common stock. The holders of the Series A preferred stock are not entitled to dividends.\nOn July 2, 2020, the Board granted all 1,000,000 shares of the Series A preferred stock to the Companys Chairman and CEO, Richard Carey, in conversion of $68,556 of accrued compensation.\nSeries B Preferred Stock\nOnly one person or entity, is entitled to be designated as the owner of all of the Series B Preferred Stock (the Holder), in whose name the initial certificates representing the Series B Preferred Stock shall be issued. Any transfer of the Series B Preferred Stock to a different Holder must be approved in advance by the Corporation; provided, however, the Holder shall have the right to transfer the Series B Preferred Stock, or any portion thereof, to any affiliate of Holder or nominee of Holder, without the approval of the Corporation. Each share of Preferred Stock shall have one vote per share. Holder is not entitled to dividends or distributions and each share of Series B Preferred Stock shall be convertible at the rate of two Common Shares for each one B Preferred stock.\nIn conjunction with the APA with Troy, the company issued 1,883,000 shares of Series B Preferred Stock, the shares were valued at $0.002 or $7,532 as if they had been converted into 3,666,000 shares of common stock.\nOn October 9, 2019, the parties have agreed to extend the date for filing the registration statement relating to the preferred shares of the Company to be issued to the Troy shareholders and that would in turn extend the date that the shares would become free trading. This extension will be for 150 days for filing the registration statement and obtaining approval for the shares to become free trading. All the remaining terms included in the contract will remain the same.\nSeries C Preferred Stock\nOn March 30, 2022, the Company created and designated 1,000,000 shares of Series C Preferred Stock (Series C) with a stated value of $1.00. The Series C has an annual cumulative dividend of 8%, has no voting rights. The Series C is convertible into shares of common stock at 65% of the lowest trading price for the ten days prior to the conversion date.\nDuring the quarter ended June 30, 2022, the Company sold 207,500 shares of Series C to Geneva Roth Remark Holdings Inc for total proceeds of $207,500.\nNOTE 9 - COMMON STOCK\nDuring the year ended June 30, 2021, the Company granted 1,250,000 shares of common stock for services. The shares were valued at $0.02 per share for total non-cash expense of $25,000.\nDuring the year ended June 30, 2021, the Company issued 1,375,000 shares of common stock in conversion of a $83,500 of principal. The Company recognized a $46,200 loss on the conversion.\nDuring the year ended June 30, 2021, the Company sold 9,381,000 shares of common stock for total cash proceeds of $129,400, $20,000 of which is a receivable as of June 30, 2021. In addition, the Company has common stock be issued from the sale of $41,633.\nOn August 1,2021, the Company granted 4,444 shares of common stock for services. The shares were valued at $4.50 per share, based on the value of the services as provided by the services providers invoice, for total non-cash expense of $20,000. The $20,000 is being amortized over the one-year service term for the services being provided.\nOn November 11, 2021, the Company granted 4,000,000 shares of common stock for services. The shares were valued at $0.50 per share, based on the value of the services as provided by the services providers invoice, for total non-cash expense of $2,000,000. The $2,000,000 is being amortized over the one-year service term for the services being provided.\nOn December 16, 2021, the Company granted 1,500,000 shares of common stock for services. The shares were valued at $1.55 per share, the closing stock price on the date of grant, for total non-cash expense of $2,317,500. The $2,317,500 is being amortized over the one-year service term for the services being provided.\nDuring the year ended June 30, 2022, the Company issued 4,362,000 shares of common stock for various consulting and professional fees. The shares were issued at the closing stock price on the date of grant for total non-cash expense of $4,712,000.\nDuring the year ended June 30, 2022, the Company issued 1,947,000 shares of common stock in conversion of $97,154 of debt. A loss of $575,396 was recognized on the conversions. The shares were valued on the closing stock price on the date of grant for total non-cash expense of\nDuring the year ended June 30, 2022, the Company sold 21,955,000 shares of common stock for total cash proceeds of $564,000. Of the stock sold $50,000 is still to be received. The Company also issued 4,770,000 shares that were sold in the prior year.\nRefer to Note 5 for shares issued to related parties.\nNOTE 10 - SIGNIFICANT TRANSACTIONS\nOn December 15, 2021, the Company signed a definitive agreement to purchase 51% of Compania Minera Metalurgica Centro Americana SA. (Commsa) for $1,000,000 in cash and 5,000,000 in restricted shares of common stock. In addition, the Company has agreed to provide up to $7,500,000 working capital to expand the mining operations in a gold mining project (Rio Jalan Project) in Olancho state in the highlands of Central Honduras. This transaction has become effective as of January 1, 2022.\nThis project, that runs along a 12.5 mile stretch of the Rio Jalan River, is a peaceful agrarian area, with only farmers and ranchers in the nearby five villages.\nThe environmental licenses have been obtained and exploration is ongoing. The mines will be producing gold early in 2022 and will be expanded early next year. Local small mining operations are producing a minimum of 250 to 300 oz of gold per site per month while losing approximately 50% of the recoverable gold particles. Our expanded operations, using modern equipment and our new Genesis program, should result in up to a 98% rate of recoverable gold, leading to significantly higher quantities of gold per site.\nAs an important part of this transaction, STAR has agreed to continue the distribution of aid to the five local villages with 2% of mining profits per village to be used for expanded school facilities, a medical center, college scholarships and a community center to be used by adults and kids alike. Additional projects, beneficial to the community, may be considered in the future.\nGold resources are in excess of 1 million oz. This estimate came from a limited appraisal of the area in which the mines are located.\nThis acquisition become effective in January, 2022. The Company has issued to date 250,000 shares of Common stock and paid $75,000 towards the purchase price.\nOn May 9, 2022, a binding letter of intent was signed for the acquisition of 51% of NSM USA a Wyoming corporation that owns 100% of four lithium mines in West Africa. The cost of these mines is $2 million, most of which is to be used for the growth of the four mines. These mines that are already producing small amounts of Lithium will be greatly expanded with the purchase of equipment. This transaction is due to close early 2023 with full production expected in the second quarter of 2023.\nOn May 11, 2022, a binding letter of intent was signed for the acquisition of 51% of NGM USA a Wyoming corporation that owns 100% of three gold mines in West Africa. The cost of this acquisition is $2 million, most of which will be used for equipment and growth of the mines. This transaction is due to close early 2023. All exploration work has been completed and production is anticipated to start in the second quarter of 2023.\nOn May 23, 2022, a binding letter of intent was signed for the acquisition of 75% of Magma International Inc. (MII). This acquisition for stock and cash will result in MII owning the Intellectual property, Building, equipment and significant inventory as well as the know how to produce Barotex. Mr. Lilo Benzicron the original inventor of this product will join Barotex as CEO and will be driving the innovation of new products for MII. This transaction is expected to close early 2023.\nNOTE 11 - INCOME TAX\nDeferred taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. The Company has evaluated Staff Accounting Bulletin No. 118 regarding the impact of the decreased tax rates of the Tax Cuts & Jobs Act. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment. The U.S. federal income tax rate of 21% is being used due to the new tax law recently enacted.\nNet deferred tax assets consist of the following components as of June 30:\nSchedule of deferred tax assets\nDeferred Tax Assets:\nNOL Carryover $ 830,300 $ 666,300\nLess valuation allowance (830,300 ) (666,300 )\nNet deferred tax assets $ - $ -\nAt June 30, 2022, the Company had net operating loss carry forwards of approximately $830,300 that may be offset against future taxable income. No tax benefit has been reported in the June 30, 2022 or 2021 financial statements; any tax benefit is offset by a valuation allowance of the same amount.\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cut and Jobs Act (the Tax Act). The Tax Act establishes new tax laws that affects 2018 and future years, including a reduction in the U.S. federal corporate income tax rate to 21% effective January 1, 2018.\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry forwards for federal income tax reporting purposes are subject to annual limitations. Should a change in ownership occur, net operating loss carry forwards may be limited as to use in future years.\nASC Topic 740 provides guidance on the accounting for uncertainty in income taxes recognized in a companys financial statements. Topic 740 requires a company to determine whether it is more likely than not that a tax position will be sustained upon examination based upon the technical merits of the position. If the more-likely-than-not threshold is met, a company must measure the tax position to determine the amount to recognize in the financial statements.\nThe Company includes interest and penalties arising from the underpayment of income taxes in the statements of operations in the provision for income taxes. As of June 30, 2022, the Company had no accrued interest or penalties related to uncertain tax positions.\nWith few exceptions, the Company is no longer subject to U.S. federal, state and local income tax examinations by tax authorities for years before 2015.\nNOTE 12 - SUBSEQUENT EVENTS\nManagement has evaluated subsequent events pursuant to the requirements of ASC Topic 855, from the balance sheet date through the date the financial statements were available to be issued, and has determined that no material subsequent events exist other than the following.\nSubsequent to June 30, 2022, the Company issued 20,050,000 shares of common stock for services.\nOn August 31, 2022, the Company sold 46,500 shares of Series C Preferred shares to Geneva Roth Remark Holdings Inc.\nOn November 17, 2022, the Chairman, Richard Carey agreed to give 4 million of his own shares of common stock in exchange for $42,000 which was loaned to the Company Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nManagements Conclusions Regarding Effectiveness of Disclosure Controls and Procedures\nAs required by Rule 13a-15 under the Securities Exchange Act of 1934, as of June 30, 2022, the end of the year covered by this report, our management concluded its evaluation of the effectiveness of the design and operation of our disclosure controls and procedures.\nDisclosure controls and procedures refer to controls and other procedures designed to ensure that information required to be disclosed in the reports we file or submit under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC and that such information is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating our disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating and implementing possible controls and procedures.\nOur management does not expect that our disclosure controls and procedures will prevent all error and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of simple error or mistake. The design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nWith respect to the fiscal year ending June 30, 2022, under the supervision and with the participation of our management, we conducted an evaluation of the effectiveness of the design and operations of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) promulgated under the Securities Exchange Act of 1934. Based upon our evaluation regarding the fiscal year ending June 30, 2022, our management, including our principal executive officer and principal financial officer, has concluded that our disclosure controls and procedures were ineffective.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act. Our management is also required to assess and report on the effectiveness of our internal control over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act of 2002 (Section 404). Management assessed the effectiveness of our internal control over financial reporting as of June 30, 2022. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework. Based on that evaluation, our management concluded that our internal controls over financial reporting were not effective as of such date to ensure that information required to be disclosed in the reports that we file or submit under the Exchange Act, is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms. We note the following deficiencies that management believes to be material weaknesses:\n· The Companys lack of segregation of duties.\n· Lack of an audit committee and independent directors\n· Management has not established appropriate and rigorous procedures for evaluating internal controls over financial reporting. Due to limited resources and lack of segregation of duties, documentation of the limited control structure has not been accomplished.\n· We employ policies and procedures for reconciliation of the financial statements and note disclosures, however, these processes are not appropriately documented.\n· Management has not established methodical and consistent data back-up procedures to ensure loss of data will not occur.\nThe Company is evaluating the necessity of implementing an independent board of directors to rectify these weaknesses.\nA material weakness (within the meaning of PCAOB Auditing Standard No. 5) is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis. A significant deficiency is a deficiency, or a combination of deficiencies, in internal control over financial reporting that is less severe than a material weakness, yet important enough to merit attention by those responsible for oversight of the companys financial reporting.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit us to provide only managements report in this annual report.\nChanges in Internal Controls\nThere have been no changes in our internal control over financial reporting during the year ended June 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal controls over financial reporting. Item 9B. Other Information\nWe have no other information to disclose that was required to be disclosed in a report on Form 8-K during the fourth quarter of fiscal year ended June 30, 2022 that was not reported.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nName\nAge\nPosition\nRichard Carey\nChief Executive Officer, Co Chairman of the Board\nAnthony L. Anish\nChief Financial officer, Company Secretary, Director\nWeverson Correia\nChief Executive Officer, Director\nBryan Cappelli\nDirector\nFranz Allmayer\nVice President Finance, Director\nThemis Glatman\nTreasurer, Director\nFernando Godina\nVice President, Board member\nBiographical Information and Background of officer and director\nRichard Carey -Chairman, and Director\nRichard Carey is our President. Mr. Carey began his career in 1958 when he received congressional appointment to the US Naval Academy as the son of Congressional Medal of Honor recipient Charles Francis Carey Jr. Upon honorable discharge from the US Navy in 1964, Mr. Carey began a career in finance as a NYLIC underwriter for New York Life. From 1967 to 1973, Mr. Carey worked as a stockbroker and principal of a brokerage firm. In 1973 he began structuring oil and gas limited partnerships for developmental drilling programs. These programs included hundreds of successful oil and gas wells, and a lucrative Geo-Thermal project in Colorado as a general partner with AMEX (an American Stock Exchange listed company).\nIn the subsequent 40 years, Mr. Carey has founded and co-founded multiple companies in a wide range of industries including diamond and gold mining operations, oil and gas exploration, energy resellers, entertainment, specialty finance and tax offset programs. With his broad experience and an extensive personal and business network, Mr. Careys financial acumen has added significant value to every project in which he has participated. With his unique understanding of the diversity of business structures and an ongoing commitment to innovate and adapt to new practices, he continues to build upon the depth of knowledge and success gained throughout his career.\nAnthony L. Anish Corporate Secretary, and Chief Financial Officer\nMr. Anish, as Corporate Secretary, is responsible for board minutes and implementing board decisions, advising directors, handling share issuances and transactions, legal requirements, auditors, lawyers, tax advisers, bankers and shareholders on governance issues, and ensuring compliance of relevant laws and regulatory matters. Mr. Anish serves as a principal officer of M Line Holdings, Inc. and Square Chain Corporation where he is responsible for meeting all the SEC requirements. Previously, he successfully founded and expanded the London-based Anish and Co., chartered accountants, Mr. Anish sold his interest to two junior partners to join as CFO his accounting client, Performance Tire, Ltd. A year later he joined Performance Tire, Inc. where he led an expansion into the U.S. that took sales from $2MM to $28MM in 2 years. He later purchased the company's 9 retail stores, which he later sold to return to his accounting and finance background. Mr. Anish provided business finance for companies through equipment leasing and asset-based lending from its Orange County office. Prior to joining M-Line he consulted on a number of reverse mergers, provided business finance to private and public companies, and assisted taking a private company public through the full registration process. Mr. Anish received his Chartered Accounting degree after articling with Percy Phillips and Co., a London based Chartered Accounting firm.\nWeverson Correia, Chief Executive Officer, Director\nWeverson Correia has over his career expanded international markets for the companies he has worked for using his skills and fluency in Spanish and Portuguese to expand revenue generating business. His strategic initiatives for sales, marketing, and new product launches in Global markets helped develop new business. He consistently exceeds expectations through market analysis, customer/distributor education, negotiating program buy-in, and finding new distribution channels. His extensive experience brings innovative ideas to increase margins, improve productivity, and enhance customer service. He analyzes new product requirements, developing sales forecasts, and pricing structure. He can build, train, and manage high performance teams. Weverson develops long-term relationships with strategic partners to improve market position and expand opportunities. As well as having a BA and MBA in business he is proficient in SAP, MAS 200, Solomon, POS, Salesforce, and MS Office and is fluent in English, Spanish, and Portuguese\nFranz Allmayer - Vice President Finance and Director\nFranz Allmayer as Vice President Mergers & Acquisitions is responsible for sourcing and evaluating investment opportunities including joint ventures and negotiating and closing investments. Mr. Allmayer has held positions with companies such as SIMGO Mobile since September 2015 as their Business Developer and Global Advisor, the Clinton Health Initiative from November 2014 to September 2015 as a consultant, LMM General trading from October 2015 to October 2016 as a Strategic Research & Development Innovation Scout and Vamed Engineering GmbH & CO KG from April 2012 to September 2014 as a Project Engineer. Mr. Allmayer graduated in September 2014 from the London School of Economics and Political Science with a Master of Science degree in Health Policy, Planning and Financing with merit. In addition, he has a Bachelor of Science degree in Biomedical Engineering with distinction from the University of Applied Sciences Techniku, Vienna.\nThemis Gladman - Treasurer and Director\nMrs. Gladman was born in Brazil where she achieved an athletic scholarship that allowed her to come to the United States where she attended Brigham Young University in Utah, studying Chemical Engineering for three years. She is fluent in English, Spanish, Portuguese with some French and Italian. Having moved to Los Angeles in 1981 she pursued a seventeen-year career in construction including commercial, residential, multi-family as well as smaller remodeling projects. Remodeling included acquisitions of homes for her own remodeling projects. She is well versed in reading blueprints and understands architectural and engineering requirements of projects from excavation, grading to paving and concrete work through final finishes.\nFernando Godina - Vice President and Director\nMr. Godina began his career working for Levitz Furniture from 1986 until 1994. He left Levitz to start his first business in automotive Detailing and light repair. After four years, in 1998, he had the opportunity to get back into the furniture business that he knew so well and worked for Ashley Furniture, significantly growing the territory he was given. In one year alone he opened ten new Ashley Homestore locations. in 2001 and 2002 he with partners opened Ashley stores in Hawaii and in Nevada. In 2003 he became a partner in a mortgage company and then joined Pinnacle Financial opening a store with a partner and produced $86 million dollars in new loans in 2005 This led him into the loans and venture capital raising market which he has now been doing for many years. In 2013, he opened a salon business with his wife and in 2016 a Pawn shop as well. Mr. Godina has assisted the company in raising capital.\nBryan Cappelli, Director\nBryan Cappelli has financed, developed and/or acquired more than $3.0 billion of real estate projects in the New York Tri State area and has 18 years of development and capital markets experience. From 2007-2014, Mr. Cappelli served as Chief Operating Officer of the Cappelli Organization overseeing ~$1B of mixed-use developments in Westchester and Fairfield Counties, including The Ritz Carlton Hotel and Condominiums, City Center White Plains, and Trump Parc Residences. From 2014-2020, Mr. Cappelli served as Co-President of Development for Ceruzzi Holdings and was a member of the investment committee. He oversaw the acquisition and development of the Centrale and Hayworth condominium projects and the Lipstick Building, totaling over 1 million square feet and $1B in value. In 2017 Mr. Cappelli founded Blue Line Real Estate Ventures, a dynamic real estate investment vehicle which has served as co-general partner in multiple large scale development and acquisitions across all asset classes in addition to making significant angel investments in various emerging development technologies and operating companies. Mr. Cappelli is currently the CEO of XKCappelli, a division of the Cappelli Organization which is currently developing a $800m mixed use project at 790 7th Avenue in Manhattan, NY. Mr. Cappelli earned a B.S. in Economics and a Minor in Philosophy from Duke University.\nTerm of Office\nOur directors are appointed for a one-year term and hold office until the next annual general meeting of our shareholders or until removed from office in accordance with our bylaws. Our officers are appointed by our board of directors and hold office until removed by the board.\nFamily Relationships\nThere are no family relationships between or among the directors, executive officers, or persons nominated or chosen by us to become directors or executive officers.\nInvolvement in Certain Legal Proceedings\nNo executive officer or director has been involved in the last ten years in any of the following:\n· Any bankruptcy petition filed by or against any business or property of such person, or of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n· Any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n· Being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities;\n· Being found by a court of competent jurisdiction (in a civil action), the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n· Being the subject of or a party to any judicial or administrative order, judgment, decree or finding, not subsequently reversed, suspended or vacated relating to an alleged violation of any federal or state securities or commodities law or regulation, or any law or regulation respecting financial institutions or insurance companies, including but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail, fraud, wire fraud or fraud in connection with any business entity; or\n· Being the subject of or a party to any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act, any registered entity (as defined in Section 1(a) (29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nBoard Committees and Audit Committee Financial Expert\nWe do not currently have a standing audit, nominating or compensation committee of the Board of Directors, or any committee performing similar functions. Our Board of Directors performs the functions of audit, nominating and compensation committees. As of the date of this annual report, no member of our Board of Directors qualifies as an audit committee financial expert as defined in Item 407(d) (5) of Regulation S-K promulgated under the Securities Act.\nDirector Nominations\nAs of June 30, 2022, there have not been any material changes to the procedures by which our shareholders may recommend nominees to our Board of Directors. We have not established formal procedures by which security holders may recommend nominees to the Companys Board of Directors.\nCode of Ethics\nWe have adopted a code of ethics that applies to our principal executive officers, principal financial officer, principal accounting officer or controller, or persons performing similar functions. A copy of our code of ethics may be obtained free of charge by contacting us at the address or telephone number listed on the cover page hereof. Item 11. Executive Compensation\nNon-Equity Nonqualified\nIncentive Deferred\nName and\nStock Option Plan Compensation All Other\nPrincipal\nSalary Bonus Awards Awards Compensation Earnings Compensation Total\nPosition Year US$ US$ US$ US$ US$ US$ US$ US$\nRichard Carey 180,000 0 180,000\nChairman 155,000 0 155,000\nAnthony L. Anish 120,000 550,000 0\nCFO and Co. Secretary 90,000 0 90,000\nWeverson Correia 772,500 0 772,500\nCEO 0 0\nThemis Glatman 1,400,000 0 1,400,000\nTreasurer 0 0\nFranz Allmayer 0 0\nVice President 0 0\nFernando Godina 39,000 0 39,000\nVice President 0 0\nBryan Cappelli 0 0\nDirector 0 0\nGrants of Plan-Based Awards Table\nNone of our named executive officers received any grants of stock, option awards or other plan-based awards during the year ended June 30, 2022 or 2021. The Company has no activity with respect to these awards.\nOptions Exercised and Stock Vested Table\nNone of our named executive officers exercised any stock options, and no restricted stock units, if any, held by our named executive officers vested during the year ended June 30, 2022 or 2021. The Company has no activity with respect to these awards.\nOutstanding Equity Awards at Fiscal Year-End Table\nNone of our named executive officers had any outstanding stock or option awards as of June 30, 2022 that would be compensatory to the officer. The Company has not issued any awards to its named executive officers. The Company and its Board of Directors may grant awards as it sees fit to its employees as well as key consultants.\nCompensation of Directors\nDuring the fiscal year ended June 30, 2022, we did provide stock compensation for some of our directors for serving as a director. We currently have no formal plan for compensating our directors for their services in their capacity, although we may elect to issue stock options to such persons from time to time. Directors are entitled to reimbursement for reasonable travel and other out-of-pocket expenses incurred in connection with attendance at meetings of our board of directors. Our board of directors may award special remuneration to any director undertaking any special services on our behalf other than services ordinarily required of a director. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth, as of November 18, 2022, the beneficial ownership of our common stock by each executive officer and director, by each person known by us to beneficially own more than 5% of our common stock and by the executive officers and directors as a group. Except as otherwise indicated, all shares are owned directly, and the percentage shown is based on 182,838,028 shares of common stock issued and outstanding.\nTitle of Class Name of Beneficial Owner Amount and\nNature of\nBeneficial Ownership\nPercentage\nCommon Stock Richard Carey 57,265,500 31.32%\nCommon Stock Anthony L. Anish 5,000,000 0.027%\nCommon Stock Weverson Correia 500,000 0.003%\nCommon Stock Franz Allmayer 250,000 0.002%\nCommon Stock Themis Gladman 2,000,000 0.011%\nCommon Stock Bryan Cappelli 0%\nCommon Stock Fernando Godina 552,000 0.003%\nCommon Stock Total all executive officers and directors (7 persons) 65,567,500 31.366% Item 13. Certain Relationships and Related Transactions, and Director Independence\nAs of June 30, 2022, the amount due to a related party was $42,651 as operating expenses of $42,651 were paid by Kok Chee Lee, CEO and Director of the Company during the year ended June 30, 2018, on behalf of the Company. The borrowing is unsecured, non-interest-bearing and due on demand.\nOn January 1, 2021, the employment agreements for Richard Carey and Anthony Anish were updated to include salaries of $180,000 and $120,000 per annum respectively. All other terms of the new agreements remained the same as previously.\nMr. Carey is using his personal office space at no cost to the Company.\nOn January 1, 2021, the employment agreements for Richard Carey and Anthony Anish were updated to include salaries of $180,000 and $120,000 per annum respectively. All other terms of the new agreements remained the same as previously. Item 14. Principal Accounting Fees and Services\nAudit Fees\nDuring fiscal years ended June 30, 2022 and 2021, we incurred $30,000 and $32,560, respectively, in fees to our principal independent accountants for professional services rendered in connection with the audit of our financial statements and for the reviews of our financial statements.\nTax Fees\nDuring the years ended June 30, 2022 and 2021, our principal accountant did not render services to us for tax compliance, tax advice or tax planning.\nAll Other Fees\nDuring the years ended June 30, 2022 and 2021, there were no fees billed for products and services provided by the principal accountant other than those set forth above.\nCurrently, we have no independent audit committee. Our full board of directors functions as our audit committee and is comprised of one director who is not considered to be independent in accordance with the requirements of Rule 10A-3 under the Exchange Act. Our audit committees pre-approval policies and procedures described in paragraph (c)(7)(i) of Rule 2-01 of Regulation S-X were that the audit committee pre-approve all accounting related activities prior to the performance of any services by any accountant or auditor.\nPART IV Item 15. Exhibits, Financial Statement Schedules\nThe following exhibits are filed as part of this Annual Report.\nExhibit\nExhibit Description\n3.1\nArticles of Incorporation (1)\n3.2\nBylaws (1)\n10.1\nExclusive Option Agreement with Starving Lion, Inc. (2)\n31.1\nCertification by the Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act\n31.2\nCertification by the Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act\n32.1\nCertification by the Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\n_____________\n(1) Incorporated by reference to Registration Statement on Form S-1 filed July 29, 2014\n(2) Incorporated by reference to Current Report on Form 8-K filed August 17, 2018\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nStar Alliance International Corp.\nBy: /s/ Richard Carey\nRichard Carey\nChairman\nDate November 22, 2022\nBy: /s/ Anthony L. Anish\nAnthony L. Anish\nChief Financial Officer\nDate November 22, 2022\nBy: /s/ Weverson Correia\nWeverson Correia\nCEO/Director\nDate November 22, 2021\nBy: /s/ Themis Glatman\nThemis Glatman\nTreasurer/Director\nDate November 22, 2022"
}