{
    "cik": "1624140",
    "company": "Coretag Holdings, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-08",
    "period_of_report": "2023-09-30",
    "sic": "3100",
    "state_of_inc": "NV",
    "state_location": "NY",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1624140/0001017386-23-000407-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1624140/000101738623000407/jmkj_2023sept30-10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1624140/0001017386-23-000407.txt",
    "filename": "1624140_10K_2023_0001017386-23-000407.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\nCoretag, Inc. (Coretag, We, or the Company) was incorporated in the State of Nevada on September 12, 2014, under the name Paramount Supply Inc. The Company then known as Paramount Supply Inc. last filed a financial report with the SEC on August 25, 2017. On September 29, 2017, our name was changed to Nine Alliance Science & Technology Group. On August 27, 2020, a motion and application was made to appoint a Custodian of the Company based on prior management abandoning its responsibilities to continue making filings at the Nevada Secretary of States office and for failing to hold a shareholders meeting in over 3 years and otherwise failing to keep current in its obligations to the Company. Upon motion and application to the District Court, Clark County Nevada, the Court granted the request for Custodian for the Company (Custodian). Upon granting the motion, the Court issued an Order acknowledging that the Custodian has performed all of the duties that had been required of it and the management of the Company will revert exclusively to the officers and directors appointed by the Custodian. In the Revival of the Company, Investment Reserves Series, as the Custodian of the Company, appointed Joseph Passalaqua as CEO, CFO and Secretary. On June 2, 2023, the Company filed a Certificate of Amendment with the State of Nevada to changing the name from Nine Alliance Science and Technology Group to Coretag Holdings, Inc.\nThe Company is a blank check company, as that term is defined in Rule 419(a)(2) of Regulation C of the Securities Act of 1933, as amended. We have not had preliminary contact or discussions with, nor do we have any present plans, proposals, arrangements, or understandings with, any representatives of the owners of any business or company regarding the possibility of an acquisition or merger. We are a shell company within the meaning of Rule 405, promulgated pursuant to Securities Act, because we do have no hard assets and real business operations.\nFrom inception until the date of this filing we have had limited operating activities, primarily consisting of the incorporation of our company and the initial equity funding by our sole officer and director. We received our initial funding of $4,000 from a previous sole officer and director at that time who purchased 4,000,000 shares of common stock at $0.001 per share. Our independent auditor has issued an audit opinion for our Company which includes a statement expressing substantial doubt as to our ability to continue as a going concern.\nPrevious business operations of the Company generated limited revenues and the Company currently has no business operations.\nNo revenue has been generated in the last two years ended September 30, 2023 and September 30, 2022.\nOn June 2, 2021, we voluntarily filed a termination of our registration statement on Form 15-15D pursuant to Rule 15d-6 and our termination becomes effective 90 days thereafter. The Company has since been seeking a merger target and has been evaluating various opportunities.\nWe never sold any securities under the offering statement, so there was no need to keep the prospectus and Form S-1 filing current.\nThe Company filed a Registration Statement; Form-10-12g on June 16, 2021 and was effective 60 days post filing.\nWe are subject to the requirements of Regulation 13A under the Exchange Act, which require us to file annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, and we are required to comply with all other obligations of the Exchange Act applicable to issuers filing registration statements pursuant to Section 12(g) of the Exchange Act.\nWe are not currently engaged in any business operations. We are, however, in the process of attempting to identify, locate, and if warranted, acquire new commercial opportunities. The Company is currently attempting to locate and negotiate with eligible portfolio companies to acquire an interest in them. In addition to acquiring an interest in them, the Company intends to assist these portfolio companies with raising capital and offer them substantial managerial assistance needed to succeed.\nThe authorized capital stock of Coretag Holdings, Inc. (formerly Nine Alliance Science & Technology Group) consists of 290,000,000 shares of Common Stock, $0.0001 par value per share (the Common Stock) and 10,000,000 shares of Preferred Stock, $0.0001 par value per share (the Preferred).\nAs of September 30, 2023, there were 225,000,000 shares of Common Stock issued and outstanding and no shares of Preferred Stock issued and outstanding.\nGENERAL\nCoretag Holdings, inc. (the Company) was incorporated as Paramount Supply Inc . and established under the Corporation Laws of the State of Nevada on September 12, 2014. On September 29, 2017, the Company filed a Certificate of Amendment changing the name from Paramount Supply. to Nine Alliance Science and Technology Group. The Company was formed for the purpose of marketing and distributing ladies fashion handbags. At the end of 2017 the Company became dormant and ceased all business operations.\nOn August 27, 2020, a motion and application was made to appoint a Custodian of the Company based on prior management abandoning its responsibilities to continue making filings at the Nevada Secretary of States office and for failing to hold a shareholders meeting in over 3 years and otherwise failing to keep current in its obligations to the Company. Upon motion and application to the District Court, Clark County Nevada, the Court granted the request for Custodian for the Company (Custodian). Upon granting the motion, the Court issued an Order acknowledging that the Custodian has performed all of the duties that had been required of it and the management of the Company will revert exclusively to the officers and directors appointed by the Custodian. In the Revival of the Company, Investment Reserves Series, as the Custodian of the Company, appointed Joseph Passalaqua as CEO, CFO and Secretary.\nOn June 2, 2023, the Company filed a Certificate of Amendment with the State of Nevada to changing the name from Nine Alliance Science and Technology Group to Coretag Holdings, Inc.\nWe are currently considered a shell company Rule 405 defines a shell company as a company with 1) no or nominal operations, and either 2)no or nominal assets, 3) assets consisting solely of cash and cash equivalents, or 4) assets consisting of any amount of cash and cash equivalents and nominal other assets. We will remain classified as a shell company until we qualify for an exemption pursuant to Rule 144 (i)(2) by meeting the following requirements: Coretag Holdings, Inc. will no longer be a shell company when it mandatorily files reports with the SEC, it has filed all required reports during the past 12 months, and it has been over a year since the current Form 10 information was filed. Security holders will not be able to rely on Rule 144 for the resale of restricted and/or control securities as long as JMKJ remains classified as a shell corporation.\nOur current business address is: 7325 Oswego Road, Liverpool, NY 13090 .\nOur telephone number is (315) 451-7515.\nThis location serves as our primary office for planning and implementing our business plan. Management believes the current premises arrangements are sufficient for its needs for at least the next 12 months.\nEMPLOYEES AND EMPLOYMENT AGREEMENTS\nThe Company does not have employment agreements with any of its officers or directors and there are no other employees.\nREPORTS TO STOCKHOLDERS\nWe are required to file reports with the SEC pursuant to the Securities Exchange Act of 1934, as amended (the Exchange Act). These reports include annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K. You may obtain copies of these reports from the SECs Public Reference Room at 100 F Street, N.E., Washington, D.C. 20549, on official business days during the hours of 10 A.M. to 3 P.M. or on the SECs website, at www.sec.gov. You may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. ITEM 1A. RISK FACTORS.\nWe are a smaller reporting company and therefore not required to provide this information in our Form 10K Annual filings. ITEM 1 B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nNone. ITEM 3. LEGAL PROCEEDINGS\nNone. ITEM 4. SUBMISSION OF MATTERS TO A VOTE OF SECURITY HOLDERS\nNone.\nPART II ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS\nOur common stock trades currently over the counter under the ticker symbol \"JMKJ\" and there is no established public trading market for our shares on the OTC PINK Exchange under the ticker symbol \"JMKJ\". On June 3, 2023 the Company changed the name to CORETAG HOLDINGS, INC and requested a new symbol to trade on the OTC Pink market. OTC Markets Groups is a company that provides financial market information involving price and liquidity for OTC securities on its website OTCMarkets.com and is designed to provide investors with information and risks pertaining to OTC securities. JMKJ is currently designated as a \"Limited information\" company by OTCMarkets.com which is delineated with a \"YIELD\" sign on OTCMarkets.com. This means that OTCMarkets.com has determined that JMKJ has posted limited information on OTCMarkets.com or is late on its filings with the SEC and Investors should use caution when considering this company.\nThe following table sets forth, for the periods indicated, the high and low closing sales prices of our common stock (where the end of the quarter was on a weekend or holiday and in cases where there was otherwise no trading activity, the high and low prices nearest and prior to the date have been used):\nHigh Low\nFISCAL YEAR ENDED SEPTEMBER 30, 2022:\nDecember 31, 2021 $ 5.00 $ 5.00\nMarch 31, 2022 $ 5.00 $ 5.00\nJune 30, 2022 $ 5.00 $ 5.00\nSeptember 30, 2022 $ 5.00 $ 5.00\nFISCAL YEAR ENDING SEPTEMBER 30, 2023:\nDecember 31, 2022 $ 5.00 $ 5.00\nMarch 31, 2023 $ 5.00 $ 5.00\nJune 30, 2023 $ 5.00 $ 5.00\nSeptember 30, 2023 $ 5.00 $ 5.00\nHolders\nAs of September 30, 2023, there were approximately 40 holders of record of our common stock, not including holders who hold their shares in street name and as of the same date 500 shares are held in street name, largely from the Companys initial registration.\nDividends\nThe Company has never declared or paid any cash dividends. It is the present policy of the Company to retain earnings to finance the growth and development of the business and, therefore, the Company does not anticipate paying dividends on its Common Stock in the foreseeable future.\nEquity Compensation Plan Information\nThe Company does not currently have an equity compensation plan but intends to adopt one in the future. In lieu of an equity compensation plan the Company has granted shares of restricted stock to its officers, directors and others for services periodically and as part of some of the officers employment agreements.\nInformation Related to Outstanding Shares\nAs of September 30, 2023, there were 225,000,000 shares of our common stock issued and outstanding.\nAll of our issued and outstanding common shares (of which 220,000,000 shares are owned by our sole officer, and director) were issued and have been paid for and held for a period in excess of six months and are eligible to be resold pursuant to Rule 144 promulgated under the Securities Act when the Company has been reporting for 1 year and has ceased being a shell company as defined by Rule 144(i).\nThe resale of our shares of common stock owned by officers, directors and affiliates is subject to the volume limitations of Rule 144. In general, Rule 144 permits our affiliate shareholders who have beneficially owned restricted shares of common stock for at least six months to sell without registration, within a three-month period, a number of shares not exceeding one percent of the then outstanding shares of common stock. Furthermore, if such shares are held for at least six months by a person not affiliated with the company (in general, a person who is not one of our executive officers, directors or principal shareholders during the three-month period prior to resale), such restricted shares can be sold without any volume limitation, provided all of the other requirements for resale under Rule 144 are applicable.\nRecent Sales of Unregistered Securities\nOn October 31, 2020, the Company issued 70,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for debt in the amount of $2,000 paid to the Companys Transfer Agent. The securities issued by the Company as described above are deemed \"restricted securities\" within the meaning of that term as defined in Rule 144 of the Securities Act and have been issued pursuant to the \"private placement\" exemption under Section 4(2) of the Securities Act. This transaction did not involve a public offering of securities.\nOn December 7, 2021, the Company issued 150,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for debt in the amount of $28,694, paid for Company expenses in 2020 and 2021. The securities issued by the Company as described above are deemed \"restricted securities\" within the meaning of that term as defined in Rule 144 of the Securities Act and have been issued pursuant to the \"private placement\" exemption under Section 4(2) of the Securities Act. This transaction did not involve a public offering of securities.\nDescription of Securities\nThe authorized capital stock of Coretag Holdings, Inc. (formerly Nine Alliance Science and Technology Group) consists of 290,000,000 shares of Common Stock, $0.0001 par value per share (the Common Stock) and 10,000,000 shares of Preferred Stock, $0.0001 par value per share (the Preferred). As of September 30, 2022, there were 225,000,000 shares of Common Stock issued and outstanding and no shares of Preferred Stock issued and outstanding.\nThe following description of certain matters relating to Coretag Holdings, Inc. securities is a summary and is qualified in its entirety by the provisions of Coretag Holdings, Inc. Articles of Incorporation, the Amendment to the Articles of Incorporation and Bylaws.\nCommon Stock\nThe holders of our common stock are entitled to one vote per share on all matters submitted to a vote of our stockholders. The holders of the common stock have the sole right to vote, except as otherwise provided by law, by our articles of incorporation, or in a statement by our board of directors in a Preferred Stock Designation.\nIn addition, such holders are entitled to receive ratably such dividends, if any, as may be declared from time to time by our board of directors out of legally available funds.\nThe holders of the common stock do not have cumulative voting rights or preemptive rights to acquire or subscribe for additional, unissued or treasury shares in accordance with the laws of the State of Delaware. Accordingly, the holders of more than 50 percent of the issued and outstanding shares of the common stock voting for the election of directors can elect all of the directors if they choose to do so, and in such event, the holders of the remaining shares of the common stock voting for the election of the directors will be unable to elect any person or persons to the board of directors. All outstanding shares of the common stock are fully paid and nonassessable.\nThe laws of the State of Nevada provide that the affirmative vote of a majority of the holders of the outstanding shares of our common stock and is required to authorize any amendment to our articles of incorporation, any merger or consolidation of Coretag Holdings, Inc. with any corporation, or any liquidation or disposition of any substantial assets of Coretag Holdings, Inc..\nJoseph C. Passalaqua is the sole officer and director. He also is the beneficial owner of Heat and Friction LLC which controls 97.78% of the issued and outstanding common stock. As such, he is the controlling shareholder of the company. By controlling 97.78% of the common stock, Mr. Passalaqua can take actions on behalf of the company without input from any other shareholder. He can, by himself, take actions such as amending the articles of incorporation, appointing new officers and directors, setting his compensation, increasing the number of authorized shares, issuing new shares, approving mergers and acquisitions, and disposing of company assets. Each shareholder should take note of this potential conflict of Mr. Passalaqua when reviewing these securities.\nOn June 2, 2023, the Company filed a Certificate of Amendment with the State of Nevada for a 1 for 2,500 Reverse Stock Split of common stock issued, with any fractional shares rounded up. The result would be 90,000 Post-Reverse shares issued and outstanding from 225,000,000. This is pending approval with FINRA.\nPreferred Stock\nThe Company has 10,000,000 authorized shares of Preferred Stock, none are issued and outstanding.\nOptions\nThe Company has not issued any options to purchase shares of its common stock, although it may establish a qualified option plan at some point in the future. ITEM 6. SELECTED FINANCIAL DATA.\nNot Applicable. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATION\nOverview\nThe following discussion and analysis of our financial condition and results of operations (MD&A) should be read in conjunction with our financial statements and the accompanying notes to the financial statements included in this Form 10K Annual filing.\nThe MD&A is based on our financial statements, which have been prepared in accordance with U.S. GAAP. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities and expenses and related disclosure of contingent assets and liabilities. Management bases its estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nBackground\nWe are not currently engaged in any business operations. We are, however, in the process of attempting to identify, locate, and if warranted, acquire new commercial opportunities.\nPrevious business operations of the Company generated limited revenues and the Company currently has no business operations. No revenue has been generated in the last two years ended September 30, 2023 and September 30, 2022, it is unlikely the Company will have any future revenues unless it is able to effect an acquisition or merger with an operating company, of which there can be no assurance. The Companys plan of operation for the remainder of the fiscal year shall be to continue its efforts to locate suitable acquisition candidates. Our principal business objective for the next 12 months and beyond such time will be to achieve long-term growth potential through a combination with a business rather than immediate, short-term earnings. The Company will not restrict our potential candidate target companies to any specific business, industry or geographical location and, thus, may acquire any type of business.\nThe Company does not currently engage in any business activities that provide cash flow. The costs of investigating and analyzing business combinations for the next 12 months and beyond such time will be paid with funds to be loaned to or invested in us by our stockholders, management or other investors.\nDuring the next 12 months we anticipate incurring costs related to:\n(i) filing of Exchange Act reports, and\n(ii)\ninvestigating, analyzing and consummating an acquisition.\nWe believe we will be able to meet these costs through use of funds to be loaned by or invested in us by our stockholders, management or other investors. There are no assurances that such funds will be advanced or that the Company will be able to secure any additional funding as needed.\nResults of Operations\nWorking Capital September 30, September 30\nCurrent Assets $ - $ 68\nCurrent Liabilities 69,670 39,557\nWorking Capital (Deficit) $ (69,670 ) $ (39,489 )\nCash Flows September 30, September 30,\nCash Flows from (used in) Operating Activities $ (32,061 ) $ (43,050 )\nCash Flows from (used in) Financing Activities 31,993 43,118\nNet Decrease (increase) in Cash During Year $ (68 ) $ 68\nYear Ended September 30, 2023 Compared to Year Ended September 30, 2022\nOperating Revenues\nWe have generated revenues of $0 and $0 for the years ended September 30, 2022 and September 30, 2023.\nOperating Expenses and Net Loss\nOperating expenses for the year ended September 30, 2023, were $30,181 compared with $33,890 for the year ended September 30, 2022. The decrease in operating expenses were primarily attributable to a decrease in professional fees from $27,254 for the year ended September 30, 2022 to $16,487 for the year ended September 30, 2023. Professional fees include Auditor and Attorney fees. There was an increase in general and administrative expenses from $6,636 for the year ended September 30, 2022 to $13,694 for the year ended September 30, 2023.\nDuring the year ended September 30, 2023, the Company recorded a net loss of $30,181, compared with net loss of $33,890 for the year ended September 30, 2022.\nLiquidity and Capital Resources\nAs of September 30, 2023 the Company's cash balance was $0 compared to cash balance of $68 as of September 30, 2022. As of September 30, 2023, the Company's total assets were $0 compared to total assets of $68 as of September 30, 2022.\nAs of September 30, 2023, the Company had total liabilities of $69,670 compared with total liabilities of $39,557 as of September 30, 2022. The increase in total liabilities is primarily attributed to an increase in Notes Payable - Related Party from $14,424 on September 30, 2022 to $46,417 on September 30, 2023. There was also an increase in Accounts payable - Related Party from $7,000 on September 30, 2022 to $12,500 on September 30, 2023. There was decrease in Accounts Payable from $15,830 on September 30, 2022 to $8,450 on September 30, 2023.\nAs of September 30, 2023, the Company has a working capital deficit of $69,670 compared with working capital deficit of $39,489 at September 30, 2022. This is primarily attributed to an increase in Notes Payable - Related Party from $14,424 on September 30, 2022 to $46,417 on September 30, 2023. There was also an increase in Accounts payable - Related Party from $7,000 on September 30, 2022 to $12,500 on September 30, 2023. There was decrease in Accounts Payable from $15,830 on September 30, 2022 to $8,450 on September 30, 2023.\nCash Flows from Operating Activities\nDuring the year ended September 30, 2023, the Company used $32,061 cash for operating activities compared to the use of $43,050 cash for operating activities during the year ended September 30, 2022.\nCash Flows from Financing Activities\nDuring the year ended September 30, 2023 the company received $31,993 in cash from financing activities compared to receiving $43,118 in cash from financing activity for the year ended September 30, 2022.\nGoing Concern\nThe financial statements have been prepared on a going concern basis which assumes the Company will be able to realize its assets and discharge its liabilities in the normal course of business for the foreseeable future. The Company has incurred a loss since Inception (March 25, 2008) resulting in an accumulated deficit of $144,364 as of September 30, 2023 and further losses are anticipated in the development of its business. Further, the Company has current liabilities in excess of current assets and has a stockholders deficit at September 30, 2023. These factors raise substantial doubts about the Companys ability to continue as a going concern for a period of one year from the issuance of these financial statements.\nFurther, the effects of Covid-19 could also impact our ability to operate under the going concern and maintain sufficient liquidity to continue operations. The impact of COVID-19 on companies is evolving rapidly and its future effects are uncertain. There are material uncertainties from Covid-19 that cast significant doubt on the companys ability to operate under the going concern. It is possible that our company will have issues relating to the current situation that will need to be considered by management in the future. There will be a wide range of factors to take into account in going concern judgments and financial projections including travel bans, restrictions, government assistance and potential sources of replacement financing, financial health of suppliers and customers and their effect on expected profitability and other key financial performance ratios including information that shows whether there will be sufficient liquidity to continue to meet obligations when they are due.\nThe Company filed a Registration Statement; Form-10-12g on June 16, 2021 was effective 60 days post filing. The Company has continuing to remain current with filing annual and quarterly filings with the SEC. Management believes that this plan provides an opportunity for the Company to continue as a going concern. The ability to continue as a going concern is dependent upon the Company generating profitable operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management intends to finance operating costs over the next twelve months with existing cash on hand and loans from directors and/or private placement of common stock. The failure to achieve the necessary levels of profitability or obtaining additional funding would be detrimental to the Company.\nThe Company continues to rely on borrowings and financings either arranged by the Companys President or through entities controlled by the President. In the next 12 months we expect to incur expenses equal to approximately $20,000 related to legal, accounting, audit, and other professional service fees incurred in relation to the Companys Exchange Act filing requirements. The costs related to the acquisition of a business combination target company vary widely and are dependent on a variety of factors including, but not limited to, the amount of time it takes to complete a business combination, the location of the target company, the size and complexity of the business of the target company, whether stockholders of the Company prior to the transaction will retain equity in the Company, the scope of the due diligence investigation required, the involvement of the Companys auditors in the transaction, possible changes in the Companys capital structure in connection with the transaction, and whether funds may be raised contemporaneously with the transaction. Therefore, we believe such costs are unascertainable until the Company identifies a business combination target. These conditions raise substantial doubt about our ability to continue as a going concern. The Company is currently devoting its efforts to locating merger candidates. The Companys ability to continue as a going concern is dependent upon our ability to develop additional sources of capital, locate and complete a merger with another company, and ultimately, achieve profitable operations.\nThe Company may consider a business which has recently commenced operations, is a developing company in need of additional funds for expansion into new products or markets, is seeking to develop a new product or service, or is an established business which may be experiencing financial or operating difficulties and is in need of additional capital. Our management believes that the public company status that results from a combination with the Company will provide such company greater access to the capital markets, increase its visibility in the investment community, and offer the opportunity to utilize its stock to make acquisitions. There is no assurance that we will in fact have access to additional capital or financing as a public company. In the alternative, a business combination may involve the acquisition of, or merger with, a company which does not need substantial additional capital, but which desires to establish a public trading market for its shares, while avoiding, among other things, the time delays, significant expense, and loss of voting control which may occur in a public offering.\nOur officer and director has not had any preliminary contact or discussions with any representative of any other entity regarding a business combination with us. Any target business that is selected may be a financially unstable company or an entity in its early stages of development or growth, including entities without established records of sales or earnings. In that event, we will be subject to numerous risks inherent in the business and operations of financially unstable and early stage or potential emerging growth companies.\nIn addition, we may effect a business combination with an entity in an industry characterized by a high level of risk, and, although our management will endeavor to evaluate the risks inherent in a particular target business, there can be no assurance that we will properly ascertain or assess all significant risks.\nOur management anticipates that it will likely be able to effect only one business combination, due primarily to our limited financing and the dilution of interest for present and prospective stockholders, which is likely to occur as a result of our managements plan to offer a controlling interest to a target business in order to achieve a tax-free reorganization. This lack of diversification should be considered a substantial risk in investing in us, because it will not permit us to offset potential losses from one venture against gains from another.\nThe Company anticipates that the selection of a business combination will be complex and extremely risky. While the Company is in a competitive market with a small number of business opportunities, through information obtained from industry professionals including attorneys, investment bankers, and other consultants with experience in the reverse merger industry, our management believes that there are opportunities for a business combination with firms seeking the perceived benefits of becoming a publicly traded corporation. Such perceived benefits of becoming a publicly traded corporation include, among other things, facilitating or improving the terms on which additional equity financing may be obtained, providing liquidity for the principals of and investors in a business, creating a means for providing incentive stock options or similar benefits to key employees, and offering greater flexibility in structuring acquisitions, joint ventures and the like through the issuance of stock. Potentially available business combinations may occur in many different industries and at various stages of development, all of which will make the task of comparative investigation and analysis of such business opportunities extremely difficult and complex.\nWe do not currently intend to retain any entity to act as a finder to identify and analyze the merits of potential target businesses.\nWe have not established a specific timeline nor have we created a specific plan to identify an acquisition target and consummate a business combination. We expect that our management and the Company, through its various contacts and affiliations with other entities will locate a business combination target. We expect that funds in the amount of approximately $20,000 will be required in order for the Company to satisfy its Exchange Act reporting requirements during the next 12 months, in addition to any other funds that will be required in order to complete a business combination. Such funds can only be estimated upon identifying a business combination target. Our management and stockholders have indicated an intent to advance funds on behalf of the Company as needed in order to accomplish its business plan and comply with its Exchange Act reporting requirements, however, there are no agreements in effect between the Company and our management or stockholders specifically requiring they provide any funds to the Company. Therefore, there are no assurances that the Company will be able to obtain the required financing as needed in order to consummate a business combination transaction.\nSummary of Significant Accounting Polices\nBasis of Presentation\nThe financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America and are presented in US dollars. The Company has adopted a September 30 fiscal year end.\nUse of Estimates and Assumptions\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nThe Company has no business operations and has not had to make material assumptions or estimates other than the assumption that the Company is a going concern.\nCash and Cash Equivalents\nThe Company considers all highly liquid instruments purchased with a maturity of three months or less to be cash equivalents to the extent the funds are not being held for investment purposes.\nFair Value of Financial Instruments\nThe Companys financial instruments consist of accounts payable and loans to shareholders. The carrying amount of financial instruments approximates fair value because of the short-term nature of these items.\nStock-Based Compensation\t\nAs of September 30, 2023 & September 30, 2022, the Company has not issued any stock-based payments to its employees Stock-based compensation is accounted for at fair value in accordance with ASC 718, when applicable. To date, the Company has not adopted a stock option plan and has not granted any stock options.\nIncome Taxes\nThe Company follows the asset and liability method of accounting for income taxes. Under this method, deferred income tax assets and liabilities are recognized for the estimated tax consequences attributable to differences between the financial statement carrying values and their respective income tax basis (temporary differences). The effect on deferred income tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Future tax benefits which arise as result of accumulated losses have not be recognized in these financial statements, as their realization is not likely to occur.\nBasic Income (Loss) Per Share\nThe Company computes loss per share in accordance with ASC-260, Earnings per Share which requires presentation of both basic and diluted earnings per share on the face of the statement of operations. Basic loss per share is computed by dividing net loss available to common shareholders by the weighted average number of outstanding common shares during the period. Diluted loss per share gives effect to all dilutive potential common shares outstanding during the period. Dilutive loss per share excludes all potential common shares if their effect is anti-dilutive.\nFor the years ended September 30, 2023 and September 30, 2022 there were no potentially dilutive debt or equity instruments issued or outstanding and any such shares would have been excluded from the computation because they would have been anti-dilutive as the Company incurred losses in this period.\nCommitments and Contingencies\nThe Company follows ASC 440 & ASC 450, subtopic 450-20 of the FASB Accounting Standards Codification to report accounting for contingencies and commitments respectively. Certain conditions may exist as of the date the financial statements are issued, which may result in a loss to the Company, but which will only be resolved when one or more future events occur or fail to occur.\nThe Company assesses such contingent liabilities, and such assessment inherently involves an exercise of judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or un-asserted claims that may result in such proceedings, the Company evaluates the perceived merits of any legal proceedings or un-asserted claims as well as the perceived merits of the amount of relief sought or expected to be sought therein.\nIf the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Companys financial statements. If the assessment indicates that a potentially material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed.\nLoss contingencies considered remote are generally not disclosed unless they involve guarantees, in which case the guarantees would be disclosed. Management does not believe, based upon information available at this time, that these matters will have a material adverse effect on the Companys consolidated financial position, results of operations or cash flows. However, there is no assurance that such matters will not materially and adversely affect the Companys business, financial position, and results of operations or cash flows.\nRecent Accounting Pronouncements\nThe Company reviewed all the recently issued, but not yet effective, accounting pronouncements and we do not believe any of these pronouncements will have a material impact on the Company.\nITEM 7. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot Applicable.\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders\nof Coretag Holdings, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheet of Coretag Holdings, Inc. (the Company) as of September 30, 2023, and the related statements of operations, statement of stockholders equity, and statement of cash flows for the year then ended, and the related notes (collectively referred to as the financial statements).\nIn our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023, and the results of its operations and its cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nGoing concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has a working capital deficit and accumulated deficit, which raises substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there were no critical audit matters.\n/s/ GreenGrowth CPAs\nDecember 08, 2023\nWe have served as the Companys auditor since\nLos Angeles, California\nPCAOB ID Number 6580\nGries & Associates, LLC\nCertified Public Accountants\nS. Cherry Street Suite 1100\nDenver, Colorado 80246\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Shareholders\nNine Alliance Science & Technology Group\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Nine Alliance Science & Technology Group (the Company) as of September 30, 2022, and the related consolidated statement of operations, statement of stockholders deficit, and cash flows for the year then ended, and the related notes and schedules (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022, and the results of its operations and its cash flows for each of the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in note 3 to the financial statements, the Company has incurred losses since inception of $114,183, negative working capital of $39,489. These factors create an uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 6. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nEmphasis of Matters-Risks and Uncertainties\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and\nfinancial markets of many countries, including the geographical area in which the Company plans to operate.\n/s/ Gries & Associates, LLC\nWe have served as the Companys auditor since 2023.\nDenver, CO\nJanuary 13, 2023\nPCAOB# 6778\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nCORETAG HOLDINGS, INC.\nBALANCE SHEETS\n(Audited)\nFor the Years Ended\nSeptember 30, September 30,\nASSETS\nCurrent Assets:\nCash $ - $ 68\nTotal Current Assets -\nTOTAL ASSETS $ - $ 68\nLIABILITIES & STOCKHOLDER'S EQUITY (DEFICIT)\nCurrent Liabilities:\nAccounts Payable $ 8,450 $ 15,830\nAccounts Payable - Related Party 12,500 7,000\nIncome Tax Payable 2,303 2,303\nNote Payable - Related Party 46,417 14,424\nTotal Current Liabilities 69,670 39,557\nTotal Liabilities $ 69,670 $ 39,557\nStockholder's Equity\nPreferred Stock; Blank Check, par value $0.0001,\n10,000,000 shares Authorized, 0 shares Issued and Outstanding\nPreferred Stock; Blank Check, par value $0.0001, 10,000,000 shares Authorized, 0 shares Issued and Outstanding as of September 30, 2023 and September 30, 2022\nCommon Stock, par value $0.0001,\n290,000,000 shares Authorized, 225,000,000 shares Issued and Outstanding\nCommon Stock, par value $0.0001, 290,000,000 shares Authorized, 225,000,000 shares Issued and Outstanding as of September 30, 2023 and September 30, 2022 22,500 22,500\nAdditional Paid-In Capital 52,194 52,194\nAccumulated Deficit (144,364 ) (114,183 )\nTotal Stockholder's Deficit (69,670 ) (39,489 )\nTOTAL LIABILITIES AND STOCKHOLDER'S EQUITY (DEFICIT) $ - $ 68\nThe accompanying notes are an integral part of these unaudited financial statements\nCORETAG HOLDINGS, INC.\nSTATEMENTS OF OPERATIONS\n(Audited)\nFor the Years Ended\nSeptember 30,\nRevenues: $ - $ -\nOperating Expenses\nGeneral and Administrative Expenses 13,694 6,636\nProfessional Fees 16,487 27,254\nTotal Operating Expenses 30,181 33,890\nLoss From Operations (30,181 ) (33,890 )\nIncome Tax Provision $ - $ -\nNet Loss $ (30,181 ) $ (33,890 )\nBasic & Diluted Loss per Common Share $ (0.00 ) $ (0.00 )\nWeighted Average Common Shares\nWeighted Average Common Shares Outstanding 225,000,000 225,000,000\nThe accompanying notes are an integral part of these audited financial statements\nCORETAG HOLDINGS, INC.\nSTATEMENT OF STOCKHOLDERS' EQUITY (DEFICIT)\nFor the Years Ended September 30, 2023 and September 30, 2022\n(Audited)\nCommon Stock\nShares Par Value Additional Paid-In Capital Accumulated Deficit Total Stockholders' Equity (Deficit)\nBalance as of September 30, 2021 75,000,000 $ 7,500 $ 38,500 $ (80,293 ) $ (34,293 )\nIssuance of Common Stock 150,000,000 $ 15,000 $ 13,694 $ - $ 28,694\nNet Loss for the Year Ended September 30 2022 - $ -\n$ (33,890 ) $ (33,890 )\nBalance as of September 30, 2022 225,000,000 $ 22,500 $ 52,194 $ (114,183 ) $ (39,489 )\nNet Loss for the Year Ended September 30 2023 - $ - $ - $ (30,181 ) $ (30,181 )\nBalance as of September 30, 2023 225,000,000 $ 22,500 $ 52,194 $ (144,364 ) $ (69,670 )\nThe accompanying notes are an integral part of these audited financial statements\nCORETAG HOLDINGS, INC.\nSTATEMENT OF CASH FLOWS\n(Audited)\nFor the Years Ended\nSeptember 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet Loss $ (30,181 ) $ (33,890 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nChanges In:\nAccounts Payable (7,380 ) 8,983\nAccounts Payable - Related Party 5,500 (18,143 )\nNet Cash Used in Operating Activities $ (32,061 ) $ (43,050 )\nCASH FLOWS FROM FINANCING\nIssuance of Shares for Capital - 28,694\nNotes Payable - Related Party 31,993 14,424\nNet Cash Provided by Financing Activities $ 31,993 $ 43,118\nNet Increase (Decrease) in Cash $ (68 ) $ 68\nCash at the Beginning of Year $ 68 $ -\nCash at the End of Year $ - $ 68\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid during the year for:\nInterest $ - $ -\nTaxes $ - $ -\nSUPPLEMENTAL DISCLOSURE OF NON-CASH INVESTING AND FINANCING ACTIVITIES\nIssuance of 150,000,000 shares of Common Stock in Exchange for $28,694 in Debt Paid by a Related Party. $ - $ 28,694\nThe accompanying notes are an integral part of these audited financial statements\nCORETAG HOLDINGS, INC.\n(FORMERLY NINE ALLIANCE SCIENCE AND TECHNOLOGY GROUP)\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND SEPTEMBER 30, 2022.\nNOTE 1 - NATURE OF OPERATIONS\nNine Alliance Science and Technology Group (the Company) was incorporated as Paramount Supply Inc. and established under the Corporation Laws of the State of Nevada on September 12, 2014. On September 29, 2017, the Company filed a Certificate of Amendment changing the name from Paramount Supply Inc. to Nine Alliance Science and Technology Group. The Company was formed for the purpose of marketing and distributing ladies fashion handbags. At the end of 2017 the Company became dormant and ceased all business operations.\nOn August 27, 2020, a motion and application was made to appoint a Custodian of the Company based on prior management abandoning its responsibilities to continue making filings at the Nevada Secretary of States office and for failing to hold a shareholders meeting in over 3 years and otherwise failing to keep current in its obligations to the Company. Upon motion and application to the District Court, Clark County Nevada, the Court granted the request for Custodian for the Company (Custodian). Upon granting the motion, the Court issued an Order acknowledging that the Custodian has performed all of the duties that had been required of it and the management of the Company will revert exclusively to the officers and directors appointed by the Custodian. In the Revival of the Company, Investment Reserves Series, as the Custodian of the Company, appointed Joseph Passalaqua as CEO, CFO and Secretary.\nOn June 2, 2023, the Company filed a Certificate of Amendment with the State of Nevada to changing the name from Nine Alliance Science and Technology Group to Coretag Holdings, Inc.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n2.1 Basis of Presentation\nThe financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America and are presented in US dollars. The Company has adopted a September 30 fiscal year end.\n2.2 Use of Estimates and Assumptions\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nDue to the limited level of operations, the Company has not had to make material assumptions or estimates other than the assumption that the Company is a going concern.\n2.3 Cash and Cash Equivalents\nThe Company considers all highly liquid instruments purchased with a maturity of three months or less to be cash equivalents to the extent the funds are not being held for investment purposes.\n2.4 Fair Value of Financial Instruments\nAs defined in (Financial Accounting Standards Board ASC 820), fair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (exit price). The Company will utilize the market data of similar entities in its industry or assumptions that market participants would use in pricing the asset or liability, including assumptions about risk and the risks inherent in the inputs to the valuation technique. These inputs can be readily observable, market corroborated, or generally unobservable. The Company classifies fair value balances based on the observability of those inputs. FASB ASC 820 establishes a fair value hierarchy that prioritizes the inputs used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurement) and the lowest priority to unobservable inputs (level 3 measurement).\nThe Company's financial instruments consist of cash and cash equivalents, accounts payable and related party loans. The carrying amount of these financial instruments approximates fair value due either to length of maturity or interest rates that approximate prevailing market rates unless otherwise disclosed in these financial statements.\nFinancial assets and liabilities recorded at fair value in our balance sheet, are categorized based upon a fair value hierarchy established by GAAP, which prioritizes the inputs used to measure fair value into the following levels:\nLevel 1 - Quoted market prices in active markets for identical assets or liabilities at the measurement date.\nLevel 2 - Quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets and liabilities in markets that are not active; or other inputs that are observable and can be corroborated by observable market data.\nLevel 3 - Inputs reflecting management's best estimates and assumptions of what market participants would use in pricing assets or liabilities at the measurement date. The inputs are unobservable in the market and significant to the valuation of the instruments.\nCORETAG HOLDINGS, INC.\n(FORMERLY NINE ALLIANCE SCIENCE AND TECHNOLOGY GROUP)\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND SEPTEMBER 30, 2022\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\n2.5 Stock-Based Compensation\nAs of September 30, 2023 & September 30, 2022, the Company has not issued any stock-based payments to its employees Stock-based compensation is accounted for at fair value in accordance with ASC 718, when applicable. To date, the Company has not adopted a stock option plan and has not granted any stock options.\n2.6 Income Taxes\nThe Company follows the asset and liability method of accounting for income taxes. Under this method, deferred income tax assets and liabilities are recognized for the estimated tax consequences attributable to differences between the financial statement carrying values and their respective income tax basis (temporary differences). The effect on deferred income tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Future tax benefits which arise as result of accumulated losses have not be recognized in these financial statements, as their realization is not likely to occur.\n2.7 Basic Income (Loss) Per Share\nThe Company computes loss per share in accordance with ASC-260, Earnings per Share which requires presentation of both basic and diluted earnings per share on the face of the statement of operations.\nBasic loss per share is computed by dividing net loss available to common shareholders by the weighted average number of outstanding common shares during the period. Diluted loss per share gives effect to all dilutive potential common shares outstanding during the period. Dilutive loss per share excludes all potential common shares if their effect is anti-dilutive.\nFor the years ended September 30, 2023 and September 30, 2022 there were no potentially dilutive debt or equity instruments issued or outstanding and any such shares would have been excluded from the computation because they would have been anti-dilutive as the Company incurred losses in this period.\n2.8 Commitments and Contingencies\nThe Company follows ASC 440 & ASC 450, subtopic 450-20 of the FASB Accounting Standards Codification to report accounting for contingencies and commitments respectively. Certain conditions may exist as of the date the financial statements are issued, which may result in a loss to the Company, but which will only be resolved when one or more future events occur or fail to occur.\nThe Company assesses such contingent liabilities, and such assessment inherently involves an exercise of judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or un-asserted claims that may result in such proceedings, the Company evaluates the perceived merits of any legal proceedings or un-asserted claims as well as the perceived merits of the amount of relief sought or expected to be sought therein.\nIf the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Companys financial statements. If the assessment indicates that a potentially material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed.\nLoss contingencies considered remote are generally not disclosed unless they involve guarantees, in which case the guarantees would be disclosed. Management does not believe, based upon information available at this time, that these matters will have a material adverse effect on the Companys consolidated financial position, results of operations or cash flows. However, there is no assurance that such matters will not materially and adversely affect the Companys business, financial position, and results of operations or cash flows.\n2.9 Recent Accounting Pronouncements\nThe Company reviewed all the recently issued, but not yet effective, accounting pronouncements and we do not believe any of these pronouncements will have a material impact on the Company.\nCORETAG HOLDINGS, INC.\n(FORMERLY NINE ALLIANCE SCIENCE AND TECHNOLOGY GROUP)\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND SEPTEMBER 30, 2022\nNOTE 3 - GOING CONCERN\nThe financial statements have been prepared on a going concern basis which assumes the Company will be able to realize its assets and discharge its liabilities in the normal course of business for the foreseeable future. The Company has incurred a loss since Inception (March 25, 2008) resulting in an accumulated deficit of $144,364 as of September 30, 2023 and further losses are anticipated in the development of its business. Further, the Company has current liabilities in excess of current assets and has a stockholders deficit at September 30, 2023. These factors raise substantial doubts about the Companys ability to continue as a going concern for a period of one year from the issuance of these financial statements.\nFurther, the effects of Covid-19 could also impact our ability to operate under the going concern and maintain sufficient liquidity to continue operations. The impact of COVID-19 on companies is evolving rapidly and its future effects are uncertain. There are material uncertainties from Covid-19 that cast significant doubt on the companys ability to operate under the going concern. It is possible that our company will have issues relating to the current situation that will need to be considered by management in the future. There will be a wide range of factors to take into account in going concern judgments and financial projections including travel bans, restrictions, government assistance and potential sources of replacement financing, financial health of suppliers and customers and their effect on expected profitability and other key financial performance ratios including information that shows whether there will be sufficient liquidity to continue to meet obligations when they are due.\nThe Company filed a Registration Statement; Form-10-12g on June 16, 2021 and was effective 60 days post filing. Management believes that this plan provides an opportunity for the Company to continue as a going concern. The ability to continue as a going concern is dependent upon the Company generating profitable operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management intends to finance operating costs over the next twelve months with existing cash on hand and loans from directors and/or private placement of common stock. The failure to achieve the necessary levels of profitability or obtaining additional funding would be detrimental to the Company.\nNOTE 4 - COMMON STOCK\nOn February 25, 2021, the Company filed a Certificate of Amendment through which the par value has been changed from $0.001 to $0.0001. This change in par value has been applied retroactively in the financial statements presented for the year ended September 30, 2020 and September 30, 2019. The Company changed the par value to increase the possibility of attracting a merger candidate.\nThrough this amendment (effective February 25, 2021) Company also increased the authorized shares from 75,000,000 to 300,000,000, of which 290,000,000 will be Common Stock with a par value of $0.0001 and 10,000,000 will be Blank Check Preferred Stock with a par value of $0.0001. Before this amendment, Company did not have any authorized Preferred Stock.\nOn December 7, 2021, the Company issued 150,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for debt in the amount of $28,694, paid for Company expenses in 2020 and 2021.\nOn June 2, 2023, the Company filed a Certificate of Amendment with the State of Nevada for a 1 for 2,500 Reverse Stock Split of common stock issued, with any fractional shares rounded up. The result would be 90,000 Post-Reverse shares issued and outstanding from 225,000,000. This is pending approval with FINRA.\nAs of the years ended September 30, 2022 and September 30, 2023, the Company had 290,000,000 shares of Common Stock Authorized and 225,000,000 shares of Common Stock Issued and Outstanding.\nAs of the year ended September 30, 2022 and September 30, 2023, the Company had 10,000,000 shares of Blank Check Preferred Stock Authorized and 0 Issued and Outstanding.\nCORETAG HOLDINGS, INC.\n(FORMERLY NINE ALLIANCE SCIENCE AND TECHNOLOGY GROUP)\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND SEPTEMBER 30, 2022\nNOTE 5 - RELATED PARTY TRANSACTIONS\nIn support of the Companys efforts and cash requirements, it may rely on advances from related parties until such time that the Company can support its operations or attains adequate financing through sales of its equity or traditional debt financing. There is no formal written commitment for continued support by shareholders or directors. Amounts represent advances or amounts paid in satisfaction of liabilities. The advances were considered temporary in nature and were not formalized by a signed promissory note.\nOn October 14, 2020, Joseph Passalaqua, an officer and Related Party of the Company advanced the Company $2,000 to cover the Companys Transfer Agent fees. The amount was non-interest bearing, payable on demand and unsecured. On October 31, 2020, the Company issued 70,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for debt in the amount of $2,000 paid to the Companys Transfer Agent. This amount is paid in full.\nFrom July 2020 - November 2021, Joseph Passalaqua, an officer and Related Party, advanced the Company $23,444 to cover the Companys expenses, that included Auditor fees, Legal fees, Stock Transfer Agent, State of Nevada corporation fees. This amount was included in a Convertible Note dated November 30, 2021 and was non-interest bearing, payable on demand and unsecured. On December 7, 2021, the Company issued 150,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for $28,694 debt conversion, which included this amount. This amount is paid in full.\nDuring the years September 30, 2019 - September 30, 2021, Lyboldt-Daly, Inc; its sole officer is Joseph Passalaqua, who is also an officer and Related Party of Nine Alliance Science and Technology Group, Inc., provided the internal accounting for the Company. The amount of $5,250 was included in a Convertible Note owed to Joseph Passalaqua, dated November 30, 2021 and was non-interest bearing, payable on demand and unsecured. On December 7, 2021, the Company issued 150,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for $28,694 in debt conversion, which included this amount. This amount is paid in full.\nIn the twelve months ended September 30, 2022, Joseph Passalaqua, an officer and Related Party, advanced the Company $14,424 to cover the Companys expenses that included Stock Transfer Agent and EDGAR/XBRL Agent fees. This amount is held in a Convertible Promissory Note that is non-interest bearing, payable on demand and unsecured.\nIn the twelve months ended September 30, 2023, Joseph Passalaqua, an officer and Related Party, advanced the Company $31,993 to cover the Companys expenses that included Stock Transfer Agent and EDGAR/XBRL Agent fees. This amount is held in a Convertible Promissory Note that is non-interest bearing, payable on demand and unsecured.\nAs of September 30, 2023, $46,417 is outstanding and included in Note Payable - Related Party - due to to Joseph Passalaqua, Sole Officer and Director.\nIn the twelve months ended September 30, 2022, Lyboldt-Daly, Inc; its sole officer is Joseph Passalaqua, who is also an officer and Related Party of Nine Alliance Science and Technology Group, Inc., provided the internal accounting for the Company in the amount of $7,000. This amount is non-interest bearing, payable on demand and unsecured.\nIn the twelve months ended September 30, 2023, Lyboldt-Daly, Inc; its sole officer is Joseph Passalaqua, who is also an officer and Related Party of Nine Alliance Science and Technology Group, Inc., provided the internal accounting for the Company in the amount of $5,500. This amount is non-interest bearing, payable on demand and unsecured.\nAs of September 30, 2022, $12,500 is outstanding and included in Related Party Payable - due to Lyboldt-Daly Inc.\nThe Company currently operates out of an office of a related party free of rent.\nCORETAG HOLDINGS, INC.\n(FORMERLY NINE ALLIANCE SCIENCE AND TECHNOLOGY GROUP)\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND SEPTEMBER 30, 2022\nNOTE 6 - INCOME TAXES\nAs of September 30, 2023, the Company had net operating loss carry forwards of approximately $144,364 that may be available to reduce future years' taxable income in varying amounts through 2043.\nAs of September 30, 2022, the Company had net operating loss carry forwards of approximately $114,183 that may be available to reduce future years' taxable income in varying amounts through 2042.\nFuture tax benefits which arise as a result of these losses have not been recognized in these financial statements, as their realization is determined not likely to occur and accordingly, the Company has recorded a valuation allowance for the deferred tax asset relating to these tax loss carry-forwards.\nThe 21% tax rate provision for Federal income tax consists of the following:\nSeptember 30,\nSeptember 30,\nFederal income tax benefit attributable to:\nCurrent operations $ 30,316 $ 23,873\nLess: change in valuation allowance (30,316 ) (23,873 )\nNet provision for Federal income taxes $ - $ -\nThe cumulative tax effect at the expected rate of 35% of significant items comprising our net deferred tax amount is as follows:\nSeptember 30,\nSeptember 30,\nDeferred tax asset attributable to:\nNet operating loss carry over $ 50,527 $ 39,789\nLess: valuation allowance (50,527 ) (39,789 )\nNet deferred tax asset $ - $ -\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry forwards of approximately $144,364 for Federal income tax reporting purposes are subject to annual limitations. Should a change in ownership occur net operating loss carry forwards may be limited as to use in future years. The Companys returns are open to examination by the Internal Revenue Services for all tax years since inception.\nNOTE 7 - SUBSEQUENT EVENTS\nThe Company filed a Certificate of Amendment with the State of Nevada for a 1 for 2,500 reverse stock split of common stock issued, with any fractional shares rounded up. The result would be 90,000 Post-Reverse shares issued and outstanding from 225,000,000. It was filed on June 2, 2023 and currently being reviewed and pending approval with FINRA.\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone.\nITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nAs of the end of the period covered by this report, the Company carried out, under the supervision and with the participation of the Companys management, including its Chief Executive Officer and Chief Financial Officer, an evaluation of the effectiveness of the design and operation of the Companys disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934) in ensuring that information required to be disclosed by the Company in its reports is recorded, processed, summarized and reported within the required time periods. In carrying out that evaluation, management identified a material weakness (as defined in Public Company Accounting Oversight Board Standard No. 2) in our internal control over financial reporting regarding a lack of adequate segregation of duties. Accordingly, based on his evaluation of our disclosure controls and procedures as of the date of this report September 30, 2023 and the date of filing December 8, 2023, Joseph C. Passalaqua, the Companys Chief Executive Officer and its Chief Financial Officer have concluded that, as of that date, the Companys controls and procedures were not effective for the purposes described above.\nThere was no change in the Companys internal control over financial reporting (as defined in Rule 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934) during the year ended September 30, 2023 that has materially affected or is reasonably likely to materially affect the Companys internal control over financial reporting.\nManagements Report on Internal Control over Financial Reporting\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934. We have assessed the effectiveness of those internal controls as of September 30, 2022, using the Committee of Sponsoring Organizations of the Treadway Commission (COSO) Internal Control - Integrated Framework (2013) as a basis for our assessment.\nBecause of inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. A material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. In its assessment of the effectiveness of internal control over financial reporting as of September 30, 2023, the Company determined that there were control deficiencies that constituted material weaknesses under COSO and SEC rules are, as described below:\n(1) lack of a functioning audit committee and lack of a majority of independent directors on the Companys board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (2) inadequate segregation of duties consistent with control objectives; and (3) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements. The aforementioned potential material weaknesses were identified by the Companys Chief Financial Officer in connection with the preparation of our financial statements as of September 30, 2023 and communicated the matters to our management and board of directors.\nManagement is currently evaluating remediation plans for the above control deficiency.\nAccordingly, the Company concluded that this control deficiency resulted in a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis by the companys internal controls.\nBecause of the above condition, the sole officer, Joseph Passalaqua determined that, as of the date of this report, September 30, 2023 and the date of filing, December 8, 2023, Companys internal controls over financial reporting were not effective.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to the rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this annual report.\nITEM 9B. OTHER INFORMATION.\nNone.\nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table sets forth information regarding our current directors and each director nominee, as of September 30, 2023 and the date of filing.\nName Position Age Director Since\nJoseph C. Passalaqua Director\nJoseph C. Passalaqua\nMr. Passalaqua, 74, has been the president of Lyboldt-Daly, Inc., a real estate management company, since February 1996. He worked in sales for Summit Automotive from 2012 to 2016. He became President, Secretary and a Director of Plantation Lifecare Developers, Inc. in February 2015 until it merged into Plantation Corp. effective July 27, 2017. He was President, Secretary, Treasurer and Director of Plantation Corp. from April 27, 2017 until May 18, 2017 when he became Executive Vice-president and Director. He resigned as Executive Vice-president and Director on September 14, 2018. Mr. Passalaqua is serving as President and Director of Petro USA, previously All State Properties Holdings, Inc. (PBAJ) since February 2017. Mr. Passalaqua is now currently serving as President and Director of Coretag Holdings, inc. (formerly Nine Alliance Science and Technology Group) since August 2020.\nOur Executive Officers\nWe designate persons serving in the following positions as our named executive officers: our chief executive officer, chief financial officer. The following table sets forth information regarding our executive officers as of September 30, 2022 and the date of this filing.\nName Principal Occupation Age Office\nJoseph C. Passalaqua Chief Executive Officer, Chief Financial Officer\nand Secretary Since 2019\nJoseph C. Passalaquas biographical summary is included under Our Board of Directors.\nITEM 11. EXECUTIVE COMPENSATION.\nThe following table sets forth information regarding each element of compensation that we paid or awarded to our named executive officers from as of the years ended September 30, 2022 and September 30, 2023:\nName and Principal Position\nFiscal\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNonequity\nIncentive\nPlan\nCompen-\nsation ($)\nNon-\nQualified\nDeferred\nCompen-\nsation\nEarnings\n($)\nAll\nOther\nCompen-\nsation\n($)\nTotal\n($)\nJoseph C. Passalaqua\n$\n$\n$\n$\n$\n$\n$\n$\n(Principal Chief Executive Officer, Chief Financial Officer, Secretary and Director)\n$\n$\n$\n$\n$\n$\n$\n$\nEmployment Agreements\nThe Company does not have employment agreements with any of its officers or directors and there are no other employees.\nDirectors Compensation\nNo director received compensation for services rendered in any capacity to us during the fiscal years ended September 30, 2022 and September 30, 2023.\nIndemnification of Directors and Officers\nOur Articles of Incorporation, as amended and restated, and our Bylaws provide for mandatory indemnification of our officers and directors, except where such person has been adjudicated liable by reason of his negligence or willful misconduct toward the Company or such other corporation in the performance of his duties as such officer or director. Our Bylaws also authorize the purchase of director and officer liability insurance to insure them against any liability asserted against or incurred by such person in that capacity or arising from such person's status as a director, officer, employee, fiduciary, or agent, whether or not the corporation would have the power to indemnify such person under the applicable law.\nCompensation Committee Interlocks and Insider Participation\nWe have not established a compensation committee. We are not currently subject to any law, rule or regulation requiring that we establish a compensation committee.\nInvolvement in Certain Legal Proceedings\nNo director, person nominated to become a director, executive officer, promoter or control person of our company has, during the last ten years: (i) been convicted in or is currently subject to a pending a criminal proceeding (excluding traffic violations and other minor offenses); (ii) been a party to a civil proceeding of a judicial or administrative body of competent jurisdiction and as a result of such proceeding was or is subject to a judgment, decree or final order enjoining future violations of, or prohibiting or mandating activities subject to any federal or state securities or banking or commodities laws including, without limitation, in any way limiting involvement in any business activity, or finding any violation with respect to such law, nor (iii) any bankruptcy petition been filed by or against the business of which such person was an executive officer or a general partner, whether at the time of the bankruptcy or for the two years prior thereto.\nAudit Committee and Conflicts of Interest\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. The Board of Directors has not established an audit committee and does not have an audit committee financial expert, nor has the Board of Directors established a nominating committee. The Board is of the opinion that such committees are not necessary since the Company is a start-up company and has only one director, and to date, such directors have been performing the functions of such committees. Thus, there is a potential conflict of interest in that our directors and officers have the authority to determine issues concerning management compensation, nominations, and audit issues that may affect management decisions.\nOther than as described above, we are not aware of any other conflicts of interest with any of our executive officers or directors.\nStock Option Grants\nWe had no outstanding equity awards from inception through the year ended September 30, 2023. The following table sets forth certain information concerning outstanding stock awards held by our officers and our directors as of the fiscal year ended September 30, 2023:\nOption Awards\nStock Awards\nName\nNumber of\nSecurities Underlying Unexercised\nOptions\n(#)\nExercisable\nNumber of\nSecurities Underlying Unexercised\nOptions\n(#)\nUnexercisable\nEquity\nIncentive\nPlan\nAwards:\nNumber of\nSecurities Underlying Unexercised Unearned\nOptions\n(#)\nOption\nExercise\nPrice\n($)\nOption\nExpiration\nDate\nNumber of\nShares or\nUnits of\nStock That\nHave Not\nVested\n(#)\nMarket\nValue of\nShares or\nUnits of\nStock That\nHave Not\nVested\n($)\nEquity\nIncentive\nPlan\nAwards:\nNumber of\nUnearned\nShares,\nUnits or\nOther Rights\nThat Have\nNot Vested\n(#)\nEquity\nIncentive\nPlan\nAwards:\nMarket or Payout\nValue of\nUnearned Shares,\nUnits or\nOther\nRights\nThat Have\nNot Vested\n($)\nJoseph C. Passalaqua (1)\nN/A\n(1) Appointed President, Chief Executive Officer, Chief Financial Officer, Secretary, Treasurer and Director September 12, 2019.\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nPrincipal Stockholders\nThe following table sets forth, as of September 30, 2023, the number of shares of Common Stock owned of record and beneficially by executive officers, directors and persons who beneficially own more than 5% of the outstanding shares of Common Stock of the Company.\nBeneficial Owner Number of Shares Beneficially Owned Percent\nFriction & Heat, LLC\nBeneficial Owner - Joseph C. Passalaqua\n106 Glenwood Drive S.\nLiverpool, NY 13090-3340\n220,000,000 97.78 %\nNamed Executive Officers and Directors:\nJoseph C. Passalaqua - owns Friction & Heat LLC\n106 Glenwood Drive S.\nLiverpool, NY 13090-3340 220,000,000 97.78 %\nAll executive officers and directors as a group (1 person) 220,000,000 97.78 %\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nMr. Passalaqua is considered to be a promoter, and currently is the only promoter, of Coretag Holdings, Inc. Inc., as that term is defined in the rules and regulations promulgated under the Securities and Exchange Act of 1933.\nOn October 14, 2020, the Company issued 7,000,000 shares of Common Stock to to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for $2,000 debt conversion of amounts due Joseph Passalaqua as a Related Party. This amount was held in a Convertible Promissory Note, non-interest bearing, payable upon demand and unsecured. It is paid in full.\nOn December 7, 2021, the Company issued 150,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for $28,694 debt conversion. This amount was held in a Convertible Promissory Note, non-interest bearing, payable upon demand and unsecured. It is paid in full.\nIn the years ended September 30, 2022 and September 30, 2023, Joseph Passalaqua, an officer and Related Party, advanced the Company $46,417 to cover the Companys expenses. This amount is held in a Convertible Promissory Notes that are non-interest bearing, payable on demand and unsecured. As of September 30, 2023, $46,417 is outstanding and included in Note Payable - Related Party to Joseph Passalaqua.\nIn the years ended September 30, 2022 and September 30, 2023, Lyboldt-Daly, Inc; its sole officer is Joseph Passalaqua, who is also an officer and Related Party of Coretag Holdings Inc. (Formerly Nine Alliance Science and Technology Group, Inc.), provided the internal accounting for the Company in the amount of $12,500. This amount is non-interest bearing, payable on demand and unsecured.\nAs of September 30, 2023, $12,500 is outstanding and included in Related Party Payable to Lyboldt-Daly Inc.\nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nDuring the year ended September 30, 2022, the total fees billed for audit-related services were $19,470, $0 for tax services and $0 for all other services\nDuring the year ended September 30, 2023, the total fees billed for audit-related services were $9,000, $0 for tax services and $0 for all other services.\nPART IV\nITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nThe following exhibits are included with this registration statement:\nExhibit\nNumber\nDescription\n3.1\nArticles of Incorporation (filed as an exhibit to our Form S-1 Registration Statement and subsequent amendments)\n3.2\nBylaws (filed as an exhibit to our Form S-1 Registration Statement and subsequent amendments)\n31.1*\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1*\nCertification of Chief Executive Officer and Chief Financial Officer pursuant Section 906 Certifications under Sarbanes-Oxley Act of 2002\n101*\nInteractive data files pursuant to Rule 405 of Regulation S-T\n__________\n* Filed herewith.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCORETAG HOLDINGS, INC.\nDate: December 8, 2023 By: /s/ Joseph C. Passalaqua\nJoseph C. Passalaqua\nPresident, Secretary, Treasurer, Chief Executive Officer and Chief Financial Officer\n(Principal Executive Officer, Principal Accounting Officer and Principal Financial Officer)  ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nCORETAG HOLDINGS, INC.\nBALANCE SHEETS\n(Audited)\nFor the Years Ended\nSeptember 30, September 30,\nASSETS\nCurrent Assets:\nCash $ - $ 68\nTotal Current Assets -\nTOTAL ASSETS $ - $ 68\nLIABILITIES & STOCKHOLDER'S EQUITY (DEFICIT)\nCurrent Liabilities:\nAccounts Payable $ 8,450 $ 15,830\nAccounts Payable - Related Party 12,500 7,000\nIncome Tax Payable 2,303 2,303\nNote Payable - Related Party 46,417 14,424\nTotal Current Liabilities 69,670 39,557\nTotal Liabilities $ 69,670 $ 39,557\nStockholder's Equity\nPreferred Stock; Blank Check, par value $0.0001,\n10,000,000 shares Authorized, 0 shares Issued and Outstanding\nPreferred Stock; Blank Check, par value $0.0001, 10,000,000 shares Authorized, 0 shares Issued and Outstanding as of September 30, 2023 and September 30, 2022\nCommon Stock, par value $0.0001,\n290,000,000 shares Authorized, 225,000,000 shares Issued and Outstanding\nCommon Stock, par value $0.0001, 290,000,000 shares Authorized, 225,000,000 shares Issued and Outstanding as of September 30, 2023 and September 30, 2022 22,500 22,500\nAdditional Paid-In Capital 52,194 52,194\nAccumulated Deficit (144,364 ) (114,183 )\nTotal Stockholder's Deficit (69,670 ) (39,489 )\nTOTAL LIABILITIES AND STOCKHOLDER'S EQUITY (DEFICIT) $ - $ 68\nThe accompanying notes are an integral part of these unaudited financial statements\nCORETAG HOLDINGS, INC.\nSTATEMENTS OF OPERATIONS\n(Audited)\nFor the Years Ended\nSeptember 30,\nRevenues: $ - $ -\nOperating Expenses\nGeneral and Administrative Expenses 13,694 6,636\nProfessional Fees 16,487 27,254\nTotal Operating Expenses 30,181 33,890\nLoss From Operations (30,181 ) (33,890 )\nIncome Tax Provision $ - $ -\nNet Loss $ (30,181 ) $ (33,890 )\nBasic & Diluted Loss per Common Share $ (0.00 ) $ (0.00 )\nWeighted Average Common Shares\nWeighted Average Common Shares Outstanding 225,000,000 225,000,000\nThe accompanying notes are an integral part of these audited financial statements\nCORETAG HOLDINGS, INC.\nSTATEMENT OF STOCKHOLDERS' EQUITY (DEFICIT)\nFor the Years Ended September 30, 2023 and September 30, 2022\n(Audited)\nCommon Stock\nShares Par Value Additional Paid-In Capital Accumulated Deficit Total Stockholders' Equity (Deficit)\nBalance as of September 30, 2021 75,000,000 $ 7,500 $ 38,500 $ (80,293 ) $ (34,293 )\nIssuance of Common Stock 150,000,000 $ 15,000 $ 13,694 $ - $ 28,694\nNet Loss for the Year Ended September 30 2022 - $ -\n$ (33,890 ) $ (33,890 )\nBalance as of September 30, 2022 225,000,000 $ 22,500 $ 52,194 $ (114,183 ) $ (39,489 )\nNet Loss for the Year Ended September 30 2023 - $ - $ - $ (30,181 ) $ (30,181 )\nBalance as of September 30, 2023 225,000,000 $ 22,500 $ 52,194 $ (144,364 ) $ (69,670 )\nThe accompanying notes are an integral part of these audited financial statements\nCORETAG HOLDINGS, INC.\nSTATEMENT OF CASH FLOWS\n(Audited)\nFor the Years Ended\nSeptember 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet Loss $ (30,181 ) $ (33,890 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nChanges In:\nAccounts Payable (7,380 ) 8,983\nAccounts Payable - Related Party 5,500 (18,143 )\nNet Cash Used in Operating Activities $ (32,061 ) $ (43,050 )\nCASH FLOWS FROM FINANCING\nIssuance of Shares for Capital - 28,694\nNotes Payable - Related Party 31,993 14,424\nNet Cash Provided by Financing Activities $ 31,993 $ 43,118\nNet Increase (Decrease) in Cash $ (68 ) $ 68\nCash at the Beginning of Year $ 68 $ -\nCash at the End of Year $ - $ 68\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid during the year for:\nInterest $ - $ -\nTaxes $ - $ -\nSUPPLEMENTAL DISCLOSURE OF NON-CASH INVESTING AND FINANCING ACTIVITIES\nIssuance of 150,000,000 shares of Common Stock in Exchange for $28,694 in Debt Paid by a Related Party. $ - $ 28,694\nThe accompanying notes are an integral part of these audited financial statements\nCORETAG HOLDINGS, INC.\n(FORMERLY NINE ALLIANCE SCIENCE AND TECHNOLOGY GROUP)\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND SEPTEMBER 30, 2022.\nNOTE 1 - NATURE OF OPERATIONS\nNine Alliance Science and Technology Group (the Company) was incorporated as Paramount Supply Inc. and established under the Corporation Laws of the State of Nevada on September 12, 2014. On September 29, 2017, the Company filed a Certificate of Amendment changing the name from Paramount Supply Inc. to Nine Alliance Science and Technology Group. The Company was formed for the purpose of marketing and distributing ladies fashion handbags. At the end of 2017 the Company became dormant and ceased all business operations.\nOn August 27, 2020, a motion and application was made to appoint a Custodian of the Company based on prior management abandoning its responsibilities to continue making filings at the Nevada Secretary of States office and for failing to hold a shareholders meeting in over 3 years and otherwise failing to keep current in its obligations to the Company. Upon motion and application to the District Court, Clark County Nevada, the Court granted the request for Custodian for the Company (Custodian). Upon granting the motion, the Court issued an Order acknowledging that the Custodian has performed all of the duties that had been required of it and the management of the Company will revert exclusively to the officers and directors appointed by the Custodian. In the Revival of the Company, Investment Reserves Series, as the Custodian of the Company, appointed Joseph Passalaqua as CEO, CFO and Secretary.\nOn June 2, 2023, the Company filed a Certificate of Amendment with the State of Nevada to changing the name from Nine Alliance Science and Technology Group to Coretag Holdings, Inc.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n2.1 Basis of Presentation\nThe financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America and are presented in US dollars. The Company has adopted a September 30 fiscal year end.\n2.2 Use of Estimates and Assumptions\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nDue to the limited level of operations, the Company has not had to make material assumptions or estimates other than the assumption that the Company is a going concern.\n2.3 Cash and Cash Equivalents\nThe Company considers all highly liquid instruments purchased with a maturity of three months or less to be cash equivalents to the extent the funds are not being held for investment purposes.\n2.4 Fair Value of Financial Instruments\nAs defined in (Financial Accounting Standards Board ASC 820), fair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (exit price). The Company will utilize the market data of similar entities in its industry or assumptions that market participants would use in pricing the asset or liability, including assumptions about risk and the risks inherent in the inputs to the valuation technique. These inputs can be readily observable, market corroborated, or generally unobservable. The Company classifies fair value balances based on the observability of those inputs. FASB ASC 820 establishes a fair value hierarchy that prioritizes the inputs used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurement) and the lowest priority to unobservable inputs (level 3 measurement).\nThe Company's financial instruments consist of cash and cash equivalents, accounts payable and related party loans. The carrying amount of these financial instruments approximates fair value due either to length of maturity or interest rates that approximate prevailing market rates unless otherwise disclosed in these financial statements.\nFinancial assets and liabilities recorded at fair value in our balance sheet, are categorized based upon a fair value hierarchy established by GAAP, which prioritizes the inputs used to measure fair value into the following levels:\nLevel 1 - Quoted market prices in active markets for identical assets or liabilities at the measurement date.\nLevel 2 - Quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets and liabilities in markets that are not active; or other inputs that are observable and can be corroborated by observable market data.\nLevel 3 - Inputs reflecting management's best estimates and assumptions of what market participants would use in pricing assets or liabilities at the measurement date. The inputs are unobservable in the market and significant to the valuation of the instruments.\nCORETAG HOLDINGS, INC.\n(FORMERLY NINE ALLIANCE SCIENCE AND TECHNOLOGY GROUP)\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND SEPTEMBER 30, 2022\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\n2.5 Stock-Based Compensation\nAs of September 30, 2023 & September 30, 2022, the Company has not issued any stock-based payments to its employees Stock-based compensation is accounted for at fair value in accordance with ASC 718, when applicable. To date, the Company has not adopted a stock option plan and has not granted any stock options.\n2.6 Income Taxes\nThe Company follows the asset and liability method of accounting for income taxes. Under this method, deferred income tax assets and liabilities are recognized for the estimated tax consequences attributable to differences between the financial statement carrying values and their respective income tax basis (temporary differences). The effect on deferred income tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Future tax benefits which arise as result of accumulated losses have not be recognized in these financial statements, as their realization is not likely to occur.\n2.7 Basic Income (Loss) Per Share\nThe Company computes loss per share in accordance with ASC-260, Earnings per Share which requires presentation of both basic and diluted earnings per share on the face of the statement of operations.\nBasic loss per share is computed by dividing net loss available to common shareholders by the weighted average number of outstanding common shares during the period. Diluted loss per share gives effect to all dilutive potential common shares outstanding during the period. Dilutive loss per share excludes all potential common shares if their effect is anti-dilutive.\nFor the years ended September 30, 2023 and September 30, 2022 there were no potentially dilutive debt or equity instruments issued or outstanding and any such shares would have been excluded from the computation because they would have been anti-dilutive as the Company incurred losses in this period.\n2.8 Commitments and Contingencies\nThe Company follows ASC 440 & ASC 450, subtopic 450-20 of the FASB Accounting Standards Codification to report accounting for contingencies and commitments respectively. Certain conditions may exist as of the date the financial statements are issued, which may result in a loss to the Company, but which will only be resolved when one or more future events occur or fail to occur.\nThe Company assesses such contingent liabilities, and such assessment inherently involves an exercise of judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or un-asserted claims that may result in such proceedings, the Company evaluates the perceived merits of any legal proceedings or un-asserted claims as well as the perceived merits of the amount of relief sought or expected to be sought therein.\nIf the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Companys financial statements. If the assessment indicates that a potentially material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed.\nLoss contingencies considered remote are generally not disclosed unless they involve guarantees, in which case the guarantees would be disclosed. Management does not believe, based upon information available at this time, that these matters will have a material adverse effect on the Companys consolidated financial position, results of operations or cash flows. However, there is no assurance that such matters will not materially and adversely affect the Companys business, financial position, and results of operations or cash flows.\n2.9 Recent Accounting Pronouncements\nThe Company reviewed all the recently issued, but not yet effective, accounting pronouncements and we do not believe any of these pronouncements will have a material impact on the Company.\nCORETAG HOLDINGS, INC.\n(FORMERLY NINE ALLIANCE SCIENCE AND TECHNOLOGY GROUP)\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND SEPTEMBER 30, 2022\nNOTE 3 - GOING CONCERN\nThe financial statements have been prepared on a going concern basis which assumes the Company will be able to realize its assets and discharge its liabilities in the normal course of business for the foreseeable future. The Company has incurred a loss since Inception (March 25, 2008) resulting in an accumulated deficit of $144,364 as of September 30, 2023 and further losses are anticipated in the development of its business. Further, the Company has current liabilities in excess of current assets and has a stockholders deficit at September 30, 2023. These factors raise substantial doubts about the Companys ability to continue as a going concern for a period of one year from the issuance of these financial statements.\nFurther, the effects of Covid-19 could also impact our ability to operate under the going concern and maintain sufficient liquidity to continue operations. The impact of COVID-19 on companies is evolving rapidly and its future effects are uncertain. There are material uncertainties from Covid-19 that cast significant doubt on the companys ability to operate under the going concern. It is possible that our company will have issues relating to the current situation that will need to be considered by management in the future. There will be a wide range of factors to take into account in going concern judgments and financial projections including travel bans, restrictions, government assistance and potential sources of replacement financing, financial health of suppliers and customers and their effect on expected profitability and other key financial performance ratios including information that shows whether there will be sufficient liquidity to continue to meet obligations when they are due.\nThe Company filed a Registration Statement; Form-10-12g on June 16, 2021 and was effective 60 days post filing. Management believes that this plan provides an opportunity for the Company to continue as a going concern. The ability to continue as a going concern is dependent upon the Company generating profitable operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management intends to finance operating costs over the next twelve months with existing cash on hand and loans from directors and/or private placement of common stock. The failure to achieve the necessary levels of profitability or obtaining additional funding would be detrimental to the Company.\nNOTE 4 - COMMON STOCK\nOn February 25, 2021, the Company filed a Certificate of Amendment through which the par value has been changed from $0.001 to $0.0001. This change in par value has been applied retroactively in the financial statements presented for the year ended September 30, 2020 and September 30, 2019. The Company changed the par value to increase the possibility of attracting a merger candidate.\nThrough this amendment (effective February 25, 2021) Company also increased the authorized shares from 75,000,000 to 300,000,000, of which 290,000,000 will be Common Stock with a par value of $0.0001 and 10,000,000 will be Blank Check Preferred Stock with a par value of $0.0001. Before this amendment, Company did not have any authorized Preferred Stock.\nOn December 7, 2021, the Company issued 150,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for debt in the amount of $28,694, paid for Company expenses in 2020 and 2021.\nOn June 2, 2023, the Company filed a Certificate of Amendment with the State of Nevada for a 1 for 2,500 Reverse Stock Split of common stock issued, with any fractional shares rounded up. The result would be 90,000 Post-Reverse shares issued and outstanding from 225,000,000. This is pending approval with FINRA.\nAs of the years ended September 30, 2022 and September 30, 2023, the Company had 290,000,000 shares of Common Stock Authorized and 225,000,000 shares of Common Stock Issued and Outstanding.\nAs of the year ended September 30, 2022 and September 30, 2023, the Company had 10,000,000 shares of Blank Check Preferred Stock Authorized and 0 Issued and Outstanding.\nCORETAG HOLDINGS, INC.\n(FORMERLY NINE ALLIANCE SCIENCE AND TECHNOLOGY GROUP)\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND SEPTEMBER 30, 2022\nNOTE 5 - RELATED PARTY TRANSACTIONS\nIn support of the Companys efforts and cash requirements, it may rely on advances from related parties until such time that the Company can support its operations or attains adequate financing through sales of its equity or traditional debt financing. There is no formal written commitment for continued support by shareholders or directors. Amounts represent advances or amounts paid in satisfaction of liabilities. The advances were considered temporary in nature and were not formalized by a signed promissory note.\nOn October 14, 2020, Joseph Passalaqua, an officer and Related Party of the Company advanced the Company $2,000 to cover the Companys Transfer Agent fees. The amount was non-interest bearing, payable on demand and unsecured. On October 31, 2020, the Company issued 70,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for debt in the amount of $2,000 paid to the Companys Transfer Agent. This amount is paid in full.\nFrom July 2020 - November 2021, Joseph Passalaqua, an officer and Related Party, advanced the Company $23,444 to cover the Companys expenses, that included Auditor fees, Legal fees, Stock Transfer Agent, State of Nevada corporation fees. This amount was included in a Convertible Note dated November 30, 2021 and was non-interest bearing, payable on demand and unsecured. On December 7, 2021, the Company issued 150,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for $28,694 debt conversion, which included this amount. This amount is paid in full.\nDuring the years September 30, 2019 - September 30, 2021, Lyboldt-Daly, Inc; its sole officer is Joseph Passalaqua, who is also an officer and Related Party of Nine Alliance Science and Technology Group, Inc., provided the internal accounting for the Company. The amount of $5,250 was included in a Convertible Note owed to Joseph Passalaqua, dated November 30, 2021 and was non-interest bearing, payable on demand and unsecured. On December 7, 2021, the Company issued 150,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for $28,694 in debt conversion, which included this amount. This amount is paid in full.\nIn the twelve months ended September 30, 2022, Joseph Passalaqua, an officer and Related Party, advanced the Company $14,424 to cover the Companys expenses that included Stock Transfer Agent and EDGAR/XBRL Agent fees. This amount is held in a Convertible Promissory Note that is non-interest bearing, payable on demand and unsecured.\nIn the twelve months ended September 30, 2023, Joseph Passalaqua, an officer and Related Party, advanced the Company $31,993 to cover the Companys expenses that included Stock Transfer Agent and EDGAR/XBRL Agent fees. This amount is held in a Convertible Promissory Note that is non-interest bearing, payable on demand and unsecured.\nAs of September 30, 2023, $46,417 is outstanding and included in Note Payable - Related Party - due to to Joseph Passalaqua, Sole Officer and Director.\nIn the twelve months ended September 30, 2022, Lyboldt-Daly, Inc; its sole officer is Joseph Passalaqua, who is also an officer and Related Party of Nine Alliance Science and Technology Group, Inc., provided the internal accounting for the Company in the amount of $7,000. This amount is non-interest bearing, payable on demand and unsecured.\nIn the twelve months ended September 30, 2023, Lyboldt-Daly, Inc; its sole officer is Joseph Passalaqua, who is also an officer and Related Party of Nine Alliance Science and Technology Group, Inc., provided the internal accounting for the Company in the amount of $5,500. This amount is non-interest bearing, payable on demand and unsecured.\nAs of September 30, 2022, $12,500 is outstanding and included in Related Party Payable - due to Lyboldt-Daly Inc.\nThe Company currently operates out of an office of a related party free of rent.\nCORETAG HOLDINGS, INC.\n(FORMERLY NINE ALLIANCE SCIENCE AND TECHNOLOGY GROUP)\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 AND SEPTEMBER 30, 2022\nNOTE 6 - INCOME TAXES\nAs of September 30, 2023, the Company had net operating loss carry forwards of approximately $144,364 that may be available to reduce future years' taxable income in varying amounts through 2043.\nAs of September 30, 2022, the Company had net operating loss carry forwards of approximately $114,183 that may be available to reduce future years' taxable income in varying amounts through 2042.\nFuture tax benefits which arise as a result of these losses have not been recognized in these financial statements, as their realization is determined not likely to occur and accordingly, the Company has recorded a valuation allowance for the deferred tax asset relating to these tax loss carry-forwards.\nThe 21% tax rate provision for Federal income tax consists of the following:\nSeptember 30,\nSeptember 30,\nFederal income tax benefit attributable to:\nCurrent operations $ 30,316 $ 23,873\nLess: change in valuation allowance (30,316 ) (23,873 )\nNet provision for Federal income taxes $ - $ -\nThe cumulative tax effect at the expected rate of 35% of significant items comprising our net deferred tax amount is as follows:\nSeptember 30,\nSeptember 30,\nDeferred tax asset attributable to:\nNet operating loss carry over $ 50,527 $ 39,789\nLess: valuation allowance (50,527 ) (39,789 )\nNet deferred tax asset $ - $ -\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry forwards of approximately $144,364 for Federal income tax reporting purposes are subject to annual limitations. Should a change in ownership occur net operating loss carry forwards may be limited as to use in future years. The Companys returns are open to examination by the Internal Revenue Services for all tax years since inception.\nNOTE 7 - SUBSEQUENT EVENTS\nThe Company filed a Certificate of Amendment with the State of Nevada for a 1 for 2,500 reverse stock split of common stock issued, with any fractional shares rounded up. The result would be 90,000 Post-Reverse shares issued and outstanding from 225,000,000. It was filed on June 2, 2023 and currently being reviewed and pending approval with FINRA. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nAs of the end of the period covered by this report, the Company carried out, under the supervision and with the participation of the Companys management, including its Chief Executive Officer and Chief Financial Officer, an evaluation of the effectiveness of the design and operation of the Companys disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934) in ensuring that information required to be disclosed by the Company in its reports is recorded, processed, summarized and reported within the required time periods. In carrying out that evaluation, management identified a material weakness (as defined in Public Company Accounting Oversight Board Standard No. 2) in our internal control over financial reporting regarding a lack of adequate segregation of duties. Accordingly, based on his evaluation of our disclosure controls and procedures as of the date of this report September 30, 2023 and the date of filing December 8, 2023, Joseph C. Passalaqua, the Companys Chief Executive Officer and its Chief Financial Officer have concluded that, as of that date, the Companys controls and procedures were not effective for the purposes described above.\nThere was no change in the Companys internal control over financial reporting (as defined in Rule 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934) during the year ended September 30, 2023 that has materially affected or is reasonably likely to materially affect the Companys internal control over financial reporting.\nManagements Report on Internal Control over Financial Reporting\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934. We have assessed the effectiveness of those internal controls as of September 30, 2022, using the Committee of Sponsoring Organizations of the Treadway Commission (COSO) Internal Control - Integrated Framework (2013) as a basis for our assessment.\nBecause of inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. A material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. In its assessment of the effectiveness of internal control over financial reporting as of September 30, 2023, the Company determined that there were control deficiencies that constituted material weaknesses under COSO and SEC rules are, as described below:\n(1) lack of a functioning audit committee and lack of a majority of independent directors on the Companys board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (2) inadequate segregation of duties consistent with control objectives; and (3) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements. The aforementioned potential material weaknesses were identified by the Companys Chief Financial Officer in connection with the preparation of our financial statements as of September 30, 2023 and communicated the matters to our management and board of directors.\nManagement is currently evaluating remediation plans for the above control deficiency.\nAccordingly, the Company concluded that this control deficiency resulted in a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis by the companys internal controls.\nBecause of the above condition, the sole officer, Joseph Passalaqua determined that, as of the date of this report, September 30, 2023 and the date of filing, December 8, 2023, Companys internal controls over financial reporting were not effective.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to the rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this annual report. ITEM 9B. OTHER INFORMATION.\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table sets forth information regarding our current directors and each director nominee, as of September 30, 2023 and the date of filing.\nName Position Age Director Since\nJoseph C. Passalaqua Director\nJoseph C. Passalaqua\nMr. Passalaqua, 74, has been the president of Lyboldt-Daly, Inc., a real estate management company, since February 1996. He worked in sales for Summit Automotive from 2012 to 2016. He became President, Secretary and a Director of Plantation Lifecare Developers, Inc. in February 2015 until it merged into Plantation Corp. effective July 27, 2017. He was President, Secretary, Treasurer and Director of Plantation Corp. from April 27, 2017 until May 18, 2017 when he became Executive Vice-president and Director. He resigned as Executive Vice-president and Director on September 14, 2018. Mr. Passalaqua is serving as President and Director of Petro USA, previously All State Properties Holdings, Inc. (PBAJ) since February 2017. Mr. Passalaqua is now currently serving as President and Director of Coretag Holdings, inc. (formerly Nine Alliance Science and Technology Group) since August 2020.\nOur Executive Officers\nWe designate persons serving in the following positions as our named executive officers: our chief executive officer, chief financial officer. The following table sets forth information regarding our executive officers as of September 30, 2022 and the date of this filing.\nName Principal Occupation Age Office\nJoseph C. Passalaqua Chief Executive Officer, Chief Financial Officer\nand Secretary Since 2019\nJoseph C. Passalaquas biographical summary is included under Our Board of Directors. ITEM 11. EXECUTIVE COMPENSATION.\nThe following table sets forth information regarding each element of compensation that we paid or awarded to our named executive officers from as of the years ended September 30, 2022 and September 30, 2023:\nName and Principal Position\nFiscal\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNonequity\nIncentive\nPlan\nCompen-\nsation ($)\nNon-\nQualified\nDeferred\nCompen-\nsation\nEarnings\n($)\nAll\nOther\nCompen-\nsation\n($)\nTotal\n($)\nJoseph C. Passalaqua\n$\n$\n$\n$\n$\n$\n$\n$\n(Principal Chief Executive Officer, Chief Financial Officer, Secretary and Director)\n$\n$\n$\n$\n$\n$\n$\n$\nEmployment Agreements\nThe Company does not have employment agreements with any of its officers or directors and there are no other employees.\nDirectors Compensation\nNo director received compensation for services rendered in any capacity to us during the fiscal years ended September 30, 2022 and September 30, 2023.\nIndemnification of Directors and Officers\nOur Articles of Incorporation, as amended and restated, and our Bylaws provide for mandatory indemnification of our officers and directors, except where such person has been adjudicated liable by reason of his negligence or willful misconduct toward the Company or such other corporation in the performance of his duties as such officer or director. Our Bylaws also authorize the purchase of director and officer liability insurance to insure them against any liability asserted against or incurred by such person in that capacity or arising from such person's status as a director, officer, employee, fiduciary, or agent, whether or not the corporation would have the power to indemnify such person under the applicable law.\nCompensation Committee Interlocks and Insider Participation\nWe have not established a compensation committee. We are not currently subject to any law, rule or regulation requiring that we establish a compensation committee.\nInvolvement in Certain Legal Proceedings\nNo director, person nominated to become a director, executive officer, promoter or control person of our company has, during the last ten years: (i) been convicted in or is currently subject to a pending a criminal proceeding (excluding traffic violations and other minor offenses); (ii) been a party to a civil proceeding of a judicial or administrative body of competent jurisdiction and as a result of such proceeding was or is subject to a judgment, decree or final order enjoining future violations of, or prohibiting or mandating activities subject to any federal or state securities or banking or commodities laws including, without limitation, in any way limiting involvement in any business activity, or finding any violation with respect to such law, nor (iii) any bankruptcy petition been filed by or against the business of which such person was an executive officer or a general partner, whether at the time of the bankruptcy or for the two years prior thereto.\nAudit Committee and Conflicts of Interest\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. The Board of Directors has not established an audit committee and does not have an audit committee financial expert, nor has the Board of Directors established a nominating committee. The Board is of the opinion that such committees are not necessary since the Company is a start-up company and has only one director, and to date, such directors have been performing the functions of such committees. Thus, there is a potential conflict of interest in that our directors and officers have the authority to determine issues concerning management compensation, nominations, and audit issues that may affect management decisions.\nOther than as described above, we are not aware of any other conflicts of interest with any of our executive officers or directors.\nStock Option Grants\nWe had no outstanding equity awards from inception through the year ended September 30, 2023. The following table sets forth certain information concerning outstanding stock awards held by our officers and our directors as of the fiscal year ended September 30, 2023:\nOption Awards\nStock Awards\nName\nNumber of\nSecurities Underlying Unexercised\nOptions\n(#)\nExercisable\nNumber of\nSecurities Underlying Unexercised\nOptions\n(#)\nUnexercisable\nEquity\nIncentive\nPlan\nAwards:\nNumber of\nSecurities Underlying Unexercised Unearned\nOptions\n(#)\nOption\nExercise\nPrice\n($)\nOption\nExpiration\nDate\nNumber of\nShares or\nUnits of\nStock That\nHave Not\nVested\n(#)\nMarket\nValue of\nShares or\nUnits of\nStock That\nHave Not\nVested\n($)\nEquity\nIncentive\nPlan\nAwards:\nNumber of\nUnearned\nShares,\nUnits or\nOther Rights\nThat Have\nNot Vested\n(#)\nEquity\nIncentive\nPlan\nAwards:\nMarket or Payout\nValue of\nUnearned Shares,\nUnits or\nOther\nRights\nThat Have\nNot Vested\n($)\nJoseph C. Passalaqua (1)\nN/A\n(1) Appointed President, Chief Executive Officer, Chief Financial Officer, Secretary, Treasurer and Director September 12, 2019. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nPrincipal Stockholders\nThe following table sets forth, as of September 30, 2023, the number of shares of Common Stock owned of record and beneficially by executive officers, directors and persons who beneficially own more than 5% of the outstanding shares of Common Stock of the Company.\nBeneficial Owner Number of Shares Beneficially Owned Percent\nFriction & Heat, LLC\nBeneficial Owner - Joseph C. Passalaqua\n106 Glenwood Drive S.\nLiverpool, NY 13090-3340\n220,000,000 97.78 %\nNamed Executive Officers and Directors:\nJoseph C. Passalaqua - owns Friction & Heat LLC\n106 Glenwood Drive S.\nLiverpool, NY 13090-3340 220,000,000 97.78 %\nAll executive officers and directors as a group (1 person) 220,000,000 97.78 % ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nMr. Passalaqua is considered to be a promoter, and currently is the only promoter, of Coretag Holdings, Inc. Inc., as that term is defined in the rules and regulations promulgated under the Securities and Exchange Act of 1933.\nOn October 14, 2020, the Company issued 7,000,000 shares of Common Stock to to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for $2,000 debt conversion of amounts due Joseph Passalaqua as a Related Party. This amount was held in a Convertible Promissory Note, non-interest bearing, payable upon demand and unsecured. It is paid in full.\nOn December 7, 2021, the Company issued 150,000,000 shares of Common Stock to Friction & Heat LLC; Joseph Passalaqua as Managing Member, in exchange for $28,694 debt conversion. This amount was held in a Convertible Promissory Note, non-interest bearing, payable upon demand and unsecured. It is paid in full.\nIn the years ended September 30, 2022 and September 30, 2023, Joseph Passalaqua, an officer and Related Party, advanced the Company $46,417 to cover the Companys expenses. This amount is held in a Convertible Promissory Notes that are non-interest bearing, payable on demand and unsecured. As of September 30, 2023, $46,417 is outstanding and included in Note Payable - Related Party to Joseph Passalaqua.\nIn the years ended September 30, 2022 and September 30, 2023, Lyboldt-Daly, Inc; its sole officer is Joseph Passalaqua, who is also an officer and Related Party of Coretag Holdings Inc. (Formerly Nine Alliance Science and Technology Group, Inc.), provided the internal accounting for the Company in the amount of $12,500. This amount is non-interest bearing, payable on demand and unsecured.\nAs of September 30, 2023, $12,500 is outstanding and included in Related Party Payable to Lyboldt-Daly Inc. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nDuring the year ended September 30, 2022, the total fees billed for audit-related services were $19,470, $0 for tax services and $0 for all other services\nDuring the year ended September 30, 2023, the total fees billed for audit-related services were $9,000, $0 for tax services and $0 for all other services.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nThe following exhibits are included with this registration statement:\nExhibit\nNumber\nDescription\n3.1\nArticles of Incorporation (filed as an exhibit to our Form S-1 Registration Statement and subsequent amendments)\n3.2\nBylaws (filed as an exhibit to our Form S-1 Registration Statement and subsequent amendments)\n31.1*\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1*\nCertification of Chief Executive Officer and Chief Financial Officer pursuant Section 906 Certifications under Sarbanes-Oxley Act of 2002\n101*\nInteractive data files pursuant to Rule 405 of Regulation S-T\n__________\n* Filed herewith.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCORETAG HOLDINGS, INC.\nDate: December 8, 2023 By: /s/ Joseph C. Passalaqua\nJoseph C. Passalaqua\nPresident, Secretary, Treasurer, Chief Executive Officer and Chief Financial Officer\n(Principal Executive Officer, Principal Accounting Officer and Principal Financial Officer)"
}