{
    "cik": "1626644",
    "company": "Odyssey Health, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-10-30",
    "period_of_report": "2023-07-31",
    "sic": "3841",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1626644/0001683168-23-007508-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1626644/000168316823007508/odyssey_i10k-073123.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1626644/0001683168-23-007508.txt",
    "filename": "1626644_10K_2023_0001683168-23-007508.htm",
    "content": "Item 1. Business\nThis Annual Report on Form 10-K contains forward-looking statements based on expectations, estimates, and projections as of the date of this filing. Actual results may differ materially from those expressed in forward-looking statements. See Item 1A. Risk Factors\nRISK FACTORS\nAn investment in our securities has a high degree of risk. Before you invest you should carefully consider the risks and uncertainties described below and the other information in this prospectus. Any of the risks and uncertainties set forth herein could materially and adversely affect our business, results of operations and financial condition, which in turn could materially and adversely affect the trading price or value of our securities. Additional risks not currently known to us or which we consider immaterial based on information currently available to us may also materially adversely affect us. As a result, you could lose all or part of your investment.\nRisks Related to Our Financial Position and Need for Capital\nWe are a development stage company with little operating history, a history of losses and we cannot assure profitability.\nWe have been incurring operating losses and cash flow deficits since the inception of such operations. Our lack of operating history, and the lack of historical pro forma combined financial information, makes it difficult for investors to evaluate our prospects for success. Prospective investors should consider the risks and difficulties we might encounter, especially given our lack of an operating history or historical pro forma combined financial information. There is no assurance that we will be successful, and the likelihood of success must be considered in light of our relatively early stage of operations. As we have not begun to generate revenue, it is extremely difficult to make accurate predictions and forecasts of our finances. There is no guarantee that our products or services will be attractive to potential consumers.\nThere is substantial doubt about our ability to continue as a going concern.\nWe are in the development stage and are currently seeking additional capital, mergers, acquisitions, joint ventures, partnerships and other business arrangements to expand our product offerings and generate revenue. Our ability to continue as a going concern is dependent upon our future ability to generate revenue and achieve profitable operations and, in the meantime, to obtain the necessary financing to meet our obligations and repay our liabilities when they become due. External financing, predominantly by the issuance of equity and debt, will be sought to finance our operations; however, there can be no certainty that such funds will be available at terms acceptable to us. These conditions indicate the existence of material uncertainties that may cast significant doubt about our ability to continue as a going concern.\nWe have not generated any revenue or profit from operations since our inception. We expect that our operating expenses will increase over the next twenty-four months in order to continue our development activities. Based on our average monthly expenses and current burn rate, we estimate that our cash on hand will not be able to support our operations through the balance of this calendar year. This amount could increase if we encounter difficulties that we cannot anticipate at this time or if we acquire other businesses. Should this amount not be sufficient to support our continuing operations, we do not expect to be able to raise any additional capital through debt financing from traditional lending sources since we are not currently generating a profit from operations. Therefore, we only expect to raise money through equity financing via the sale of our common stock or equity-linked securities such as convertible debt. We are currently in discussions with a number of institutional investors who could provide the capital required for our ongoing operations. If we cannot raise the money that we need in order to continue to operate our business beyond the period indicated above, we will be forced to delay, scale back or eliminate some or all of our proposed operations. If any of these were to occur, there is a substantial risk that our business would fail. If we are unsuccessful in raising additional financing, we may need to curtail, discontinue, or cease operations.\nOur actual financial position and results of operations may differ materially from managements expectations.\nWe have experienced some changes in our operating plans and certain delays in our plans. As a result, our revenue, net loss and cash flow may differ materially from our projections. The process for estimating our revenue, net loss and cash flow requires the use of estimates and assumptions. These estimates and assumptions may be revised as additional information becomes available and as additional analyses are performed. In addition, the assumptions used in planning may prove to be inaccurate, and other factors may affect our financial condition or results of operations.\nWe expect to incur significant ongoing costs and obligations related to our investment in infrastructure and growth and for regulatory compliance, which could have a material adverse impact on our results of operations, financial condition and cash flows. In addition, future changes in regulations, more vigorous enforcement thereof or other unanticipated events could require extensive changes to our operations, increased compliance costs or give rise to material liabilities, which could have a material adverse effect on our business, results of operations and financial condition. Our efforts to grow our business may be costlier than we expect, and we may not be able to increase our revenue enough to offset our higher operating expenses. We may incur significant losses in the future for a number of reasons, including unforeseen expenses, difficulties, complications and delays, and other unknown events. If we are unable to achieve and sustain profitability, the market price of our Common Shares may significantly decrease.\nOur limited operating history creates substantial uncertainty about future results.\nWe have limited operating history and operations on which to base expectations regarding our future results and performance. To succeed, we must do most, if not all, of the following:\n· raise corporate equity to support our operating costs and to have sufficient funds to develop, market and sell our products;\n· locate strategic licensing and commercialization partners;\n· obtain proper regulatory clearances domestically and abroad;\n· attract, integrate, retain and motivate qualified management and sales personnel;\n· successfully execute our business strategies;\n· respond appropriately and timely to competitive developments; and\n· develop, enhance, promote and carefully manage our corporate identity.\nOur business will suffer if we are unable to accomplish these and other important business objectives. We are uncertain as to when, or whether, we will fully implement our contemplated business plan and strategy or become profitable.\nBecause we may never have net income from our operations, our business may fail.\nWe have no history of profitability from operations. There can be no assurance that we will ever operate profitably. Our success is significantly dependent on uncertain events, including successful development of our products, establishing satisfactory manufacturing arrangements and processes, and the sale and distribution of our products. If we are unable to generate significant revenues from sales of our products, we will not be able to earn profits or continue operations. We can provide no assurance that we will generate any revenues or ever achieve profitability. If we are unsuccessful in addressing these risks, our business will fail, and investors may lose all of their investment in our Company.\nOur ability to generate positive cash flows is uncertain.\nTo develop and expand our business, we will need to make significant up-front investments in our manufacturing capacity and incur research and development, sales and marketing, and general and administrative expenses. In addition, our growth will require a significant investment in working capital. Our business will require significant amounts of working capital to meet our project requirements and support our growth. We cannot provide any assurance that we will be able to raise the capital necessary to meet these requirements. If adequate funds are not available or are not available on satisfactory terms, we may be required to significantly curtail our operations and may not be able to fund our current production requirements, let alone fund expansion, take advantage of unanticipated acquisition opportunities, develop or enhance our products, and respond to competitive pressures. Any failure to obtain such additional financing could have a material adverse effect on our business, results of operations, and financial condition.\nWe need to raise additional funds, and such funds may not be available on acceptable terms.\nWe may consider issuing additional debt or equity securities in the future to fund our business plan, for general corporate purposes or for potential acquisitions or investments. If we issue equity or convertible debt securities to raise additional funds, our existing stockholders may experience dilution, and the new equity or debt securities may have rights, preferences, and privileges senior to those of our existing stockholders. If we incur additional debt, it may increase our leverage relative to our earnings or to our equity capitalization, requiring us to pay additional interest expenses. We may not be able to obtain financing on favorable terms, in which case, we may not be able to develop or enhance our products, execute our business plan, take advantage of future opportunities, or respond to competitive pressures.\nWe may have difficulty raising additional capital, which could deprive us of the resources necessary to implement our business plan, which would adversely affect our business, results of operation and financial condition.\nWe expect to continue devoting significant capital resources to fund research and development and marketing. In order to support the initiatives envisioned in our business plan, we will need to raise additional funds through the sale of assets, public or private debt or equity financing, collaborative relationships or other arrangements. If our operations expand faster or at a higher rate than currently anticipated, we may require additional capital sooner than we expect. We are unable to provide any assurance or guarantee that additional capital will be available when needed by our company or that such capital will be available under terms acceptable to our company or on a timely basis.\nOur ability to raise additional financing depends on many factors beyond our control, including the state of capital markets, the market price of our common stock and the development or prospects for development of competitive products by others. Because our common stock is not listed on a major stock market, many investors may not be willing or allowed to purchase it or may demand steep discounts. If additional funds are raised through the issuance of equity, convertible debt or similar securities of our company, the percentage of ownership of our company by our companys stockholders will be reduced, our companys stockholders may experience additional dilution upon conversion, and such securities may have rights or preferences senior to those of our common stock. The preferential rights granted to the providers of such additional financing may include preferential rights to payments of dividends, super voting rights, a liquidation preference, protective provisions preventing certain corporate actions without the consent of the fund providers, or a combination thereof. We are unable to provide any assurance that additional financing will be available on terms favorable to us or at all.\nIf adequate funds are not available or are not available on acceptable terms, our ability to fund our expansion, take advantage of potential opportunities, would be limited significantly. We will also scale back or delay implementation of research and development of new products. Thus, the unavailability of capital could substantially harm our business, results of operations and financial condition.\nThe capital requirements necessary to implement our business plan initiatives could pose additional risks to our business and stockholders.\nWe require additional debt or equity financing to implement our business plan and marketing strategy. Since the terms and availability of such financing depend, to a large degree, on general economic conditions and third parties over which we have no control, we can give no assurance that we will obtain the needed financing or that we will obtain such financing on attractive terms. In addition, our ability to obtain financing depends on a number of other factors, many of which also are beyond our control, such as interest rates and national and local economic conditions. If the cost of obtaining needed financing is too high or the terms of such financing are otherwise unacceptable in relation to the strategic opportunity we are presented with, then we may decide to forego that opportunity. Additional indebtedness could increase our leverage and make us more vulnerable to economic downturns and may limit our ability to withstand competitive pressures. Additional equity financing could result in dilution to our stockholders.\nOur independent registered public accounting firm has included an explanatory paragraph relating to our ability to continue as a going concern in its report on our audited financial statements.\nOur independent registered public accounting firm has issued its audit opinion on our consolidated financial statements appearing in our Annual Report on Form 10-K for the fiscal year ended July 31, 2023, including an explanatory paragraph as to substantial doubt with respect to our ability to continue as a going concern. The accompanying consolidated financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America, assuming we will continue as a going concern, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. For the fiscal year ended July 31, 2023, our net loss was $5,919,421, and we had an accumulated deficit of $60,097,375 at July 31, 2023. As of July 31, 2023, we had current liabilities of $6,611,722, current assets of $405,888 and a working capital deficit of $6,205,834. These factors raise substantial doubt about our ability to continue as a going concern which is dependent on our ability to raise the required additional capital or debt financing to meet short- and long-term operating requirements. We may also encounter business endeavors that require significant cash commitments or unanticipated problems or expenses that could result in a need for additional cash. Our ability to continue as a going concern is dependent upon raising capital from financing transactions. To stay in business, we will need to raise additional capital through public or private sales of our securities or debt financing. In the past, we have financed our operations by issuing secured and unsecured convertible debt and equity securities in private placements, in some cases with equity incentives for the investor in the form of warrants to purchase our common stock, and we have borrowed from related parties. We have sought, and will continue to seek, various sources of financing. If we raise additional funds through the issuance of equity or convertible debt securities, the percentage ownership of our current stockholders could be reduced, and such securities might have rights, preferences, or privileges senior to our common stock. Additional financing may not be available upon acceptable terms, or available at all. If adequate funds are not available on acceptable terms, we may not be able to take advantage of prospective business endeavors or opportunities, which could significantly and materially restrict our operations. If we are unable to obtain necessary capital, we may have to cease operations. There are no additional commitments from anyone to provide us with financing. We can provide no assurance as to whether our capital raising efforts will be successful or as to when, or if, we will be profitable in the future. Even if we achieve profitability, we may not be able to sustain such profitability. If we are unable to obtain financing or achieve and sustain profitability, we may have to suspend operations or sell assets, making us unable to execute our business plan. Failure to become and remain profitable may adversely affect the market price of our common stock and our ability to raise capital and continue operations. For additional information, see Managements Discussion and Analysis of Financial Condition and Results of Operations - Going Concern.\nRaising additional capital by issuing securities or through debt financings or licensing arrangements may cause dilution to our existing stockholders, restrict our operations or require us to relinquish rights to our technologies or product candidate on terms unfavorable to us.\nTo the extent that we raise additional capital through the sale of equity or convertible debt securities, your ownership interest will be diluted, and the terms of such securities may include liquidation or other preferences that adversely affect your rights as a stockholder. Debt financing, if available, may involve agreements that include covenants limiting or restricting our ability to take certain actions, such as incurring additional debt, making capital expenditures or declaring dividends. If we raise additional funds through strategic partnerships with third parties, we may have to relinquish valuable rights to our technologies or product candidate, future revenue streams, research programs or product candidate, or otherwise grant licenses on terms that are not favorable to us. If we are unable to raise additional capital when needed, we may be required to delay, limit, reduce or terminate our product development or commercialization efforts for our product candidate or our preclinical product candidates, or grant rights to develop and market potential future product candidates that we would otherwise prefer to develop and market ourselves. Any of these events could adversely affect our ability to achieve our product development and commercialization goals and have a material adverse effect on our business, financial condition and results of operations.\nRisks Related to the Sale of the Purchased Assets\nWe may not be able to successfully consummate the Odyssey Asset Purchase Agreement with Oragenics.\nThe closing of the Odyssey Asset Purchase Agreement is subject to various closing conditions, including without limitation the following: (1) Odyssey shall have obtained all required consents to the Odyssey Asset Purchase; (2) Odyssey shall have obtained its shareholders approval to the Odyssey Asset Purchase; (3) Oragenics shareholders shall have approved (a) the increase in the its authorized Common Stock from Four Million One Hundred Sixty Six Thousand Six Hundred Sixty Six (4,166,666) shares to Three Hundred Fifty Million (350,000,000) and (b) the conversion of Nineteen and Nine Tenths Percent (19.9%) of the Series F Preferred Stock into Common Stock; (4) no material adverse change shall have occurred to the Purchased Assets; (5) Oragenics must have at least Five Million dollars ($5,000,000) in cash at Closing; and (6) the Oragenics must have completed its due diligence of the Purchased Assets to its satisfaction. There can be no assurances that such conditions will be satisfied.\nOragenics may have difficulty raising additional capital, which could deprive them of the resources necessary to implement our business plan, which would adversely affect the equity position in Oragenics.\nWhether or not we successfully consummate the Asset Purchase, Oragenics will need to raise additional capital to fund the development and commercialization of our product candidates and to operate their business. The Oragenics need to raise additional capital is expected to increase if we successfully consummate the Oragenics Asset Purchase. If Oragenics consummates the Asset Purchase, Oragenics expect their operating expenses to increase, both due to additional employment costs and operating costs required to pursue the development of the Odysseys assets. In order to support the initiatives envisioned in the business plan, Oragenics will need to raise additional funds through the sale of assets, public or private debt or equity financing, collaborative relationships or other arrangements. If Oragenics operations expand faster or at a higher rate than currently anticipated, Oragenics may require additional capital sooner than they expect. We are unable to provide any assurance or guarantee that additional capital will be available when needed by Oragenics or that such capital will be available under terms acceptable to Oragenics or on a timely basis.\nOragenics ability to raise additional financing depends on many factors beyond our control, including the state of capital markets, the market price of their common stock and the development or prospects for development of competitive products by others. If additional funds are raised through the issuance of equity, convertible debt or similar securities of their company, the percentage of ownership in Oragenics by Odyssey stockholders will be reduced, our stockholders may experience additional dilution upon conversion, and such securities may have rights or preferences senior to those of Oragenics common stock. The preferential rights granted to the providers of such additional financing may include preferential rights to payments of dividends, super voting rights, a liquidation preference, protective provisions preventing certain corporate actions without the consent of the fund providers, or a combination thereof. We are unable to provide any assurance that additional financing will be available on terms favorable to Oragenics or at all.\nIf adequate funds are not available or are not available on acceptable terms, Oragenics ability to take advantage of the potential of assets acquired from us will be limited significantly. With limited capital, Oragenics expects to continue to scale back or delay implementation of research and development of all protocols. By implication, the unavailability of capital could substantially harm our investment in Oragenics.\nOragenics success with regard to the Purchased Assets depends on the viability of Oragenics business strategy with regard to those assets, which is unproven and may be unfeasible.\nOragenics revenue and income potential with regard to the Purchased Assets, in particular the concussion asset, are unproven, and Oragenics continues to develop our strategy for such assets. Oragenics anticipated business model is based on a variety of assumptions based on a growing trend in the healthcare systems in the United States and many other countries. These assumptions may not reflect the business and market conditions Oragenics actually faces. As a result, Oragenics operating results could differ materially from those projected under Oragenics business model, and Oragenics business model may prove to be unprofitable.\nThe product candidate ONP-002 (the concussion asset) being developed by us, which development under Oragenics will continue if we successfully consummate the Asset Purchase, is in its early stages and will require extensive testing and clinical trials before it is commercialized. There is no guarantee that ONP-002 will be approved for commercial use. The product candidate ONP-001 (the potential treatment for Niemann Pick Disease Type C) Oragenics is acquiring from us, is in its early stages and will require extensive testing and clinical trials before it is commercialized. There is no guarantee that ONP-001 will be approved for commercial use. We currently own only 50% of the intellectual property related thereto. The other 50% is owned by Prevacus. The joint venture with that third party has not been finalized.\nIf we fail to obtain marketing authorization for these product candidates, our business, financial condition, and results of operations will be materially adversely affected.\nThere are substantial inherent risks in attempting to commercialize newly developed products, and, as a result, we may not be able to successfully develop the new products acquired from Odyssey.\nIf we successfully consummate the Asset Purchase, Oragenics hopes to conduct research and development of the purchased technologies. However, commercial feasibility and acceptance of such product candidates are unknown. Scientific research and development require significant amounts of capital and takes an extremely long time to reach commercial viability, if at all. During the research and development process, we may experience technological barriers that we may be unable to overcome. Because of these uncertainties, it is possible that some of Oragenics future product candidates will never be successfully developed. If Oragenics is unable to successfully develop new products, Oragenics may be unable to generate new revenue sources or build a sustainable or profitable business.\nAdditionally, if we successfully consummate the Asset Purchase, since Oragenics operates with limited resources and staff, Oragenics attention and resources will be diverted away from other protocols which may result in further delays in the development and commercialization of such programs and the diminution of our investment.\nWe will need to achieve commercial acceptance of our products, if cleared or approved, to generate revenues and achieve profitability.\nIf we successfully consummate the Asset Purchase, superior products may be introduced that compete with the Purchased Assets, which would diminish or extinguish the uses for the products candidates acquired by Oragenics, if cleared or approved. We cannot predict when significant commercial market acceptance for such products, if cleared or approved, will develop, if at all, and we cannot reliably estimate the projected size of any such potential market. If markets fail to accept such products, then Oragenics may not be able to generate revenue from them. Oragenics revenue growth and achievement of profitability will depend substantially on Oragenics ability to introduce new products that are accepted by customers. Oragenics competitors in the industry are predominantly large companies with longer operating histories, with significantly easier access to capital and other resources and an established product pipeline than Oragenics. There can be no assurance that Oragenics will be able to establish ourselves in their targeted markets, or, if established, that Oragenics will be able to maintain market position, if any. Oragenics commercial opportunity may be reduced if their competitors develop new or improved products that are more convenient, more effective or less expensive than our product candidates are. Competitors may also obtain FDA or other regulatory marketing authorization for their products more rapidly or earlier than Oragenics may obtain marketing authorization, which could result in their competitors establishing a strong market position before Oragenics is able to enter the market. If Oragenics is unable to cost-effectively achieve acceptance of their products by customers, or if Oragenics products do not achieve wide market acceptance, then their business, and consequently our investment in Oragenics business will be materially and adversely affected.\nThe products candidates Oragenics hopes to acquire from Odyssey are still in development, and Odyssey has not obtained authorization from any regulatory agency to commercially distribute such products in any country and we may never obtain such authorizations.\nOragenics currently has no products authorized for commercial distribution in either the United States, Europe, or any other country. Similarly, the products candidates Oragenics hopes to acquire from us are still in development. Like the product candidates Oragenics is developing, the Purchased Assets require regulatory clearance or approvals. Oragenics cannot begin marketing and selling product candidates until they obtain applicable authorizations from the applicable regulatory agencies. The process of obtaining regulatory authorization is expensive and time-consuming and can vary substantially based upon, among other things, the type, complexity, and novelty of a product candidate. Changes in regulatory policy, changes in or the enactment of additional statutes or regulations, or changes in regulatory review for each submitted product application may cause delays in the authorization of a product candidate or rejection of a regulatory application altogether.\nThe FDA has substantial discretion in the review process and may refuse to accept Oragenics application or may decide that data are insufficient to grant the request and require additional pre-clinical, clinical, or other studies. In addition, varying interpretations of the data obtained from pre-clinical and clinical testing could delay, limit, or prevent marketing authorization from the FDA or other regulatory authorities. Any marketing authorization from the FDA Oragenics ultimately obtains may be limited or subject to restrictions or post-market commitments that render the product candidate not commercially viable. If Oragenics attempts to obtain marketing authorization are unsuccessful, Oragenics may be unable to generate sufficient revenue to sustain and grow their business, and Oragenics business, financial condition, and results of operations, and consequently, the value of our equity will be materially adversely affected.\nOragenics is, and will continue to be, dependent in significant part on outside scientists and third-party research institutions for research and development in order to be able to commercialize product candidates.\nOragenics currently has a limited number of employees and resources available to perform the research and development necessary to commercialize their product candidates and potential future product candidates. Oragenics therefore relies, and will continue to rely, on third-party research institutions, collaborators and consultants for this capability. This will remain the case if we successfully consummate the Asset Purchase.\nOragenics is heavily dependent upon the ability and expertise of our management team and a very limited number of employees, and the loss of such individuals could have a material adverse effect on Oragenics business, operating results or financial condition.\nOragenics currently has a very small management team. Oragenics success is dependent upon the ability, expertise, and judgment of Oragenics senior management. While employment agreements are customarily used as a primary method of retaining the services of key employees, these agreements cannot assure the continued services of such employees. Any loss of the services of such individuals could have a material adverse effect on Oragenics business, operating results or financial condition.\nThe loss of the services of any of these individuals could harm Oragenics ability to successfully pursue the development of the Purchased Assets. If any of Oragenics executive officers or key employees left or seriously injured and unable to work and they were unable to find a qualified replacement and/or to obtain adequate compensation for such loss, Oragenics may be unable to manage our business, which could harm their operating results and financial condition.\nIf we successfully consummate the Asset Purchase, Oragenics anticipates growth in their business and increased costs, and any inability to manage such growth could harm Oragenics business. Oragenics success will depend, in part, on their ability to effectively manage their growth and expansion. Any growth in, or expansion of, Oragenics business is likely to continue to place a significant strain on their management and administrative resources, infrastructure, and systems. In order to succeed, Oragenics will need to continue to implement management information systems and improve our operating, administrative, financial and accounting systems and controls. Oragenics will also need to train new employees and maintain close coordination among our executive, accounting, finance, and operations organizations. These processes are time-consuming and expensive, will increase management responsibilities and will divert management attention. Their inability or failure to manage such growth and expansion effectively could substantially harm their business and adversely affect their operating results and financial condition, and, consequently, the value of our equity in Oragenics.\nRisks Related to Our Technology, Development and Commercialization of our Product Candidates\nOur success depends on the viability of our business model, which is unproven and may be unfeasible.\nOur revenue and income potential are unproven, and the business model of Odyssey is new. Our new business model is based on a variety of assumptions based on a growing trend in the healthcare systems in the United States and many other countries, where we are seeing a movement towards preventative medicine that is directly decreasing general healthcare costs.\nThe CardioMap®, through its screening and predictive values, is a tool, if approved or cleared, might be implemented in this preventative approach. Considering heart disease-caused deaths are still the number one cause of death and one of the most important healthcare costs factors, the CardioMap® device has potential value in any medical practice. If approved or cleared for marketing, it could be an ideal device, allowing insurance companies to potentially cut costs through early diagnostic and preventative care. These assumptions may not reflect the business and market conditions we actually face. As a result, our operating results could differ materially from those projected under our business model, and our business model may prove to be unprofitable. There is no guarantee that the device will be approved or cleared for commercial use.\nThe Save a Life choking rescue device is in the development stage and has not been approved or cleared for commercial use. Further development is required, and the final product will require FDA approval or clearance. There is no guarantee that the device will be approved or cleared for commercial use.\nThe product candidate ONP-001, for which we own 50% of the intellectual property, is in its early stages and will require extensive testing and clinical trials before it is commercialized. There is no guarantee that ONP-001 will be approved for commercial use. The Joint Venture contemplated in the agreement has not been formed.\nThe product candidate ONP-002 being developed by us and is in its early stages and will require extensive testing and clinical trials before it is commercialized. There is no guarantee that ONP-002 will be approved for commercial use.\nIf we fail to obtain marketing authorization for our product candidates, our business, financial condition, and results of operations will be materially adversely affected.\nThere are substantial inherent risks in attempting to commercialize newly developed products, and, as a result, we may not be able to successfully develop new products.\nWe plan to conduct research and development of health-related technologies. However, commercial feasibility and acceptance of such product candidates are unknown. Scientific research and development require significant amounts of capital and takes an extremely long time to reach commercial viability, if at all. During the research and development process, we may experience technological barriers that we may be unable to overcome. Because of these uncertainties, it is possible that some of our future product candidates will never be successfully developed. If we are unable to successfully develop new products, we may be unable to generate new revenue sources or build a sustainable or profitable business.\nWe will need to achieve commercial acceptance of our products, if cleared or approved, to generate revenues and achieve profitability.\nSuperior competitive products may be introduced, or customer needs may change, which would diminish or extinguish the uses for our products, if cleared or approved. We cannot predict when significant commercial market acceptance for our products, if cleared or approved, will develop, if at all, and we cannot reliably estimate the projected size of any such potential market. If markets fail to accept our products, then we may not be able to generate revenue from them. Our revenue growth and achievement of profitability will depend substantially on our ability to introduce new products that are accepted by customers. If we are unable to cost-effectively achieve acceptance of our products by customers, or if our products do not achieve wide market acceptance, then our business will be materially and adversely affected.\nWe currently only have four product candidates, which are still in development, and we have not obtained authorization from any regulatory agency to commercially distribute the products in any country and we may never obtain such authorizations.\nWe currently have no products authorized for commercial distribution in either the United States, Europe or any other country. We are developing the devices and pharmaceutical drugs which require regulatory clearance or approvals, we cannot begin marketing and selling our product candidates until we obtain applicable authorizations from the respective regulatory agency. The process of obtaining regulatory authorization is expensive and time-consuming and can vary substantially based upon, among other things, the type, complexity and novelty of a product candidate. Changes in regulatory policy, changes in or the enactment of additional statutes or regulations, or changes in regulatory review for each submitted product application may cause delays in the authorization of a product candidate or rejection of a regulatory application altogether.\nThe FDA has substantial discretion in the review process and may refuse to accept our application or may decide that our data are insufficient to grant the request and require additional pre-clinical, clinical, or other studies. In addition, varying interpretations of the data obtained from pre-clinical and clinical testing could delay, limit, or prevent marketing authorization from the FDA or other regulatory authorities. Any marketing authorization from the FDA we ultimately obtain may be limited or subject to restrictions or post-market commitments that render the product candidate not commercially viable. If our attempts to obtain marketing authorization are unsuccessful, we may be unable to generate sufficient revenue to sustain and grow our business, and our business, financial condition, and results of operations will be materially adversely affected.\nWe face significant competition in an environment of rapid technological change, and our competitors may develop products that are more advanced or more effective than ours are which may adversely affect our financial condition and our ability to successfully market our products.\nOur competitors in the industry are predominantly large companies with longer operating histories, with significantly easier access to capital and other resources and an established product pipeline than us. There can be no assurance that we will be able to establish ourselves in our targeted markets, or, if established, that we will be able to maintain our market position, if any. Our commercial opportunity may be reduced if our competitors develop new or improved products that are more convenient, more effective or less expensive than our product candidates are. Competitors also may obtain FDA or other regulatory marketing authorization for their products more rapidly or earlier than we may obtain marketing authorization for ours, which could result in our competitors establishing a strong market position before we are able to enter the market.\nRisks Related to Our Reliance on Third Parties\nWe expect to rely on third parties for the worldwide marketing and distribution of our product candidates, who may not be successful in selling our products, if cleared or approved.\nWe currently do not have adequate resources to market and distribute any of our products, if cleared or approved, worldwide and expect to engage third-party marketing and distribution companies to perform these tasks. While we believe that distribution partners will be available, we cannot assure you that the distribution partners, if any, will succeed in marketing our products on a global basis. We may not be able to maintain satisfactory arrangements with our marketing and distribution partners, who may not devote adequate resources to selling our products. If this happens, we may not be able to successfully market our products, which would decrease or eliminate our ability to generate revenues.\nOur products, if cleared or approved, may be displaced by superior products developed by third parties.\nThe healthcare industry is constantly undergoing rapid and significant change. Third parties may succeed in developing or marketing products that are more effective than those developed or marketed by us or that would make our products obsolete or non-competitive. Additionally, researchers could develop new procedures and medications that replace or reduce the use of our products. Accordingly, our success will depend, in part, on our ability to respond quickly to medical and technological changes through the development and introduction of new products. We may not have the resources to do this. If our products become obsolete and our efforts to develop new products do not result in commercially successful products, then our sales and revenues will decline.\nWe are, and will continue to be, significantly dependent, in-part, on outside scientists and third-party research institutions for our research and development in order to be able to commercialize our product candidates.\nWe currently have a limited number of employees and resources available to perform the research and development necessary to commercialize our product candidates and potential future product candidates. We therefore rely, and will continue to rely, on third-party research institutions, collaborators and consultants for this capability.\nWe will depend on third parties for the manufacture and distribution of our product candidates and products, if cleared or approved, and the loss of our third-party manufacturer and distributor could harm our business.\nWe will depend on our third-party contract manufacturing partner to manufacture and supply our devices and drugs for clinical and commercial purposes. Additionally, we will depend on a different third-party distribution partner to warehouse and ship our products, if cleared or approved, to customers. Our reliance on a third-party manufacturer and a distribution provider to supply us with our drug and devices and to provide such other distribution services exposes us to risks that could delay our sales or result in higher costs or lost product revenues. In addition, manufacturers could encounter difficulties, including, but not limited to, those caused by the COVID-19 pandemic, in securing long-lead time components, achieving volume production, quality control and quality assurance or suffer shortages of qualified personnel, which could result in their inability to manufacture sufficient quantities of our commercially available product, if cleared or approved, to meet market demand. Our third-party manufacturer or distributor may also fail to follow and remain in compliance with FDA regulations which could lead to significant delays in the availability of materials for our product candidates or products, if cleared or approved and/or FDA enforcement actions against them and/or us.\nIf we are unable to obtain adequate supplies of our product candidates and products that meet our specifications and quality standards, it will be difficult for us to compete effectively.\nWe may be unable to build an effective distribution network for our products, if cleared or approved.\nWe currently have very few employees and we may either build internal capabilities or rely on distributors to sell our products, if cleared or approved. We cannot assure you that we will succeed in building an internal team or entering into and maintaining productive arrangements with an adequate number of distributors that are sufficiently committed to selling our products, if cleared or approved. The establishment of a distribution network is expensive and time consuming. As we launch new products and increase our marketing effort with respect to existing products, we will need to continue to hire, train, retain and motivate skilled resources with significant technical knowledge. In addition, the commissions we pay for product sales could increase over time, which would result in higher sales and marketing expenses. Furthermore, if we were to rely on distributors, the current and potential distributors may market and sell the products of our competitors. Even if the distributors market and sell our products, our competitors may be able, by offering higher commission payments or other incentives, to persuade these distributors to reduce or terminate their sales and marketing efforts related to our products. The distributors may also help competitors solicit business from our existing customers. Some of our independent distributors may likely account for a significant portion of our sales volume, and, if we were to lose them, our sales could be adversely affected. Even if we engage and maintain suitable relationships with an adequate number of distributors, they may not generate revenue as quickly as we expect them to, commit the necessary resources to effectively market and sell our products, or ultimately succeed in selling our products.\nRisks Related to Intellectual Property\nWe may be unable to adequately protect its proprietary and intellectual property rights.\nOur ability to compete may depend on the superiority, uniqueness and value of any intellectual property and technology that we may develop in the future. We intend to protect our proprietary rights by relying on a combination of patent, trademark, copyright and trade secret laws, confidentiality agreements with its employees and third parties, and protective contractual provisions. Despite these efforts, any of the following occurrences may reduce the value of any of our intellectual property:\n· The market for our products and services may depend to a significant extent upon the goodwill associated with its trademarks and trade names, and its ability to register its intellectual property under U.S. federal and state law.\n· Patents in the medical device industry involve complex legal and scientific questions and patent protection may not be available for some or any products;\n· Our applications for trademarks and copyrights relating to our business may not be granted and, if granted, may be challenged or invalidated.\n· Issued patents, trademarks and registered copyrights may not provide us with competitive advantages.\n· Our efforts to protect our intellectual property rights may not be effective in preventing misappropriation of any of our products or intellectual property.\n· Our efforts may not prevent others from the development and design of products similar to, competitive with, or superior to, those we develop.\n· Another party may obtain a blocking patent and we would need to either obtain a license or design around the patent in order to continue to offer the contested feature or service in our products.\n· The expiration of patent or other intellectual property protections for any assets owned by us could result in significant competition, potentially at any time and without notice, resulting in a significant reduction in sales. The effect we will experience from the loss of these protections on us and our financial results will depend, among other things, upon the nature of the market and the position of our products in the market from time to time, the growth of the market, the complexities and economics of manufacturing a competitive product and regulatory approval requirements, which could cause a material and adverse impact on our business. We may be forced to litigate to defend our intellectual property rights, or to defend against claims by third parties against us relating to intellectual property rights.\nWe may not be able to protect intellectual property that we hope to acquire, which could adversely affect our business.\nThe companies that we hope to acquire may rely on patent, trademark, trade secret, and copyright protection to protect their technology. We believe that technological leadership can be achieved through additional factors such as the technological and creative skills of our personnel, new product developments, frequent product enhancements, name recognition, and reliable product maintenance. Nevertheless, our ability to compete effectively depends in part on our ability to develop and maintain proprietary aspects of our technology, such as patents. We may not secure future patents; and patents that we may secure may become invalid or may not provide meaningful protection for our product innovations. In addition, the laws of some foreign countries do not protect intellectual property rights to the same extent as the United States. Furthermore, there can be no assurance that competitors will not independently develop similar products, reverse engineer our products, or, if patents are issued to us, design around such patents. We also expect to rely upon a combination of copyright, trademark, trade secret, and other intellectual property laws to protect our proprietary rights by entering into confidentiality agreements with our employees, consultants, and vendors, and by controlling access to and distribution of our technology, documentation and other proprietary information. There can be no assurance, however, that the steps to be taken by us will not be challenged, invalidated, or circumvented, or that the rights granted thereunder will provide a competitive advantage to us. Any such circumstance could have a material adverse effect on our business, financial condition and results of operations. While we are not currently engaged in any intellectual property litigation or proceedings, there can be no assurance that we will not become so involved in the future or that our products do not infringe any intellectual property or other proprietary right of any third party. Such litigation could result in substantial costs, the diversion of resources and personnel, and significant liabilities to third parties, any of which could have a material adverse effect on our business.\nWe may not be able to protect our trade names and domain names.\nWe may not be able to protect our trade names and domain names against all infringers, which could decrease the value of our brand name and proprietary rights. We currently hold the Internet domain name Odyssey Health, Inc. Domain names are generally regulated by Internet regulatory bodies, are subject to change, and, in some cases, may be superseded, in some cases by by-laws, rules and regulations governing the registration of trade names and trademarks with the United States Patent and Trademark Office as well as ascertain other common law rights. If the domain registrars are changed, if new ones are created, or if we are deemed to be infringing upon anothers trade name or trademark, we may be unable to prevent third parties from acquiring or using, as the case may be, our domain name, trade names or trademarks, which could adversely affect our brand name and other proprietary rights.\nWe may be forced to litigate to enforce or defend our intellectual property rights, to protect our trade secrets or to determine the validity and scope of other parties proprietary rights.\nAny such litigation could be very costly and could distract management from focusing on operating our business. The existence and/or outcome of any such litigation could harm our business. We may become subject to litigation, including for possible product liability claims, which may have a material adverse effect on our reputation, business, results from operations, and financial condition. We may be named as a defendant in a lawsuit or regulatory action. We may also incur uninsured losses for liabilities which arise in the ordinary course of business, or which are unforeseen, including, but not limited to, employment liability and business loss claims. Any such losses could have a material adverse effect on our business, results of operations, sales, cash flow or financial condition. Further, the administration of medical substances to humans can result in product liability claims by consumers. Product liability claims can be expensive, difficult to defend and may result in large judgments or settlements against us. We may not be able to obtain or maintain adequate insurance or other protection against potential liabilities arising from product sales. Product liability claims could also result in negative perception of our products or other reputational damage which could have a material adverse effect on our business, results of operations, sales, cash flow or financial condition.\nIf our intellectual property protection is inadequate, competitors may gain access to our technology and undermine our competitive position.\nWe regard our intended and future intellectual property as important to our success, and we intend to rely on patent law to protect our proprietary rights. Despite our precautions, unauthorized third parties may copy certain portions of our devices or products or reverse engineer or obtain and use information that we regard as proprietary. We may seek additional patents in the future. We do not know if any future patent application will be issued with the scope of the claims, we seek, if at all or whether any patents we receive will be challenged or invalidated. Thus, we cannot assure you that any intellectual property rights that we may receive can be successfully asserted in the future or that they will not be invalidated, circumvented or challenged. In addition, the laws of some foreign countries do not protect proprietary rights to the same extent, as do the laws of the United States. Our means of protecting any proprietary rights we may receive in the United States or abroad may not be adequate and competitors may independently develop a similar technology. Any failure to protect our proprietary information and any successful intellectual property challenges or infringement proceedings against us could have a material adverse effect on our business, financial condition and results of operations.\nWe may be subject to various litigation claims and legal proceedings, including intellectual property litigation, such as patent infringement claims, which could adversely affect our business.\nWe, as well as, our directors and officers, may be subject to claims or lawsuits. These lawsuits may result in significant legal fees and expenses and could divert managements time and other resources. If the claims contained in these lawsuits are successfully asserted against us, we could be liable for damages and be required to alter or cease portions of our business practices or product lines. Any of these outcomes could cause our business, financial performance and cash position to be negatively impacted.\nAdditionally, our commercial success will also depend, in part, on not infringing on the patents or proprietary rights of others. There can be no assurance that the technologies and products used or developed by us will not infringe such rights. If such infringement occurs and we are not able to obtain a license from the relevant third party, we will not be able to continue the development, manufacture, use, or sale of any such infringing technology or product. There can be no assurance that necessary licenses to third-party technology will be available at all or on commercially reasonable terms. In some cases, litigation or other proceedings may be necessary to defend against or assert claims of infringement or to determine the scope and validity of the proprietary rights of third parties. Any potential litigation could result in substantial costs to, and diversion of, our resources and could have a material and adverse impact on us.\nAn adverse outcome in any such litigation or proceeding could subject us to significant liabilities, require us to cease using the subject technology or require us to license the subject technology from the third party, all of which could have a material adverse effect on our business.\nRisks Related to Government Regulation\nOur products are subject to substantial federal and state regulations.\nOur research and development activities and the manufacturing and marketing of our product candidates and products, if cleared or approved, are subject to the laws, regulations, and guidelines in the United States and other countries in which the products will be marketed, if cleared or approved. Specifically, in the United States, the FDA regulates, among other areas, new medical device clearances and approvals and the development and commercialization of prescription drugs.\nObtaining FDA marketing authorization will be costly, may result in time-consuming delays and will subject us to ongoing compliance costs and regulatory risk for non-compliance.\nObtaining FDA marketing authorization, through clearance, or pre-market approval (PMA) for medical devices and approval of drugs can be expensive and uncertain, can take years, and require detailed and comprehensive scientific and clinical data. Notwithstanding the expense, these efforts may never result in FDA authorization. Even if we were to obtain regulatory authorization, it may not be for the uses we intended or which are commercially attractive, in which case we would not be permitted to market our product for those uses.\nThe FDA can delay, limit or deny authorization of a device or drug for many reasons, including:\n· our inability to demonstrate to the FDAs satisfaction that our product candidate is safe and effective for its intended users;\n· the data from our pre-clinical studies and clinical trials may be insufficient to support authorization, where required; and\n· the manufacturing process or facilities we use may not meet applicable requirements.\nIn addition, the FDA may change its authorization policies, adopt additional regulations or revise existing regulations, or take other actions, which may prevent or delay marketing authorization of our product candidates under development. Any delay in, or failure to receive or maintain clearance or approval for our product candidates, could prevent us from generating revenue from our products, if cleared or approved, and could adversely affect our business operations and financial results.\nEven if granted, a 510(k) clearance, de novo classification and clearance, or pre-market approval for any future product may place substantial restrictions on how our device or drug is marketed or sold, and FDA will continue to place considerable restrictions on our products and operations. The manufacture, distribution and sale of medical devices and drugs must comply with extensive laws and regulations, including those relating to registration and listing, labeling, marketing, complaint handling, adverse event and medical device reporting, reporting of corrections and removals, and import and export. If we or our facilities or those of our manufacturers or suppliers are found to be in violation of applicable laws and regulations, or if we or our manufacturers or suppliers fail to take satisfactory corrective action in response to an adverse inspection, the regulatory authority could take enforcement action, including any of the following sanctions:\n· untitled letters, warning letters, fines, injunctions, consent decrees and civil penalties;\n· customer notifications of repair, replacement, refunds, detention or seizure of our products;\n· product recalls;\n· operating restrictions, partial suspension or total shutdown of production;\n· refusing or delaying requests for marketing authorization of new products or modified products;\n· withdrawing marketing authorizations that have already been granted;\n· refusing to provide Certificates for Foreign Governments;\n· refusing to grant export approval for our products; or\n· pursuing criminal prosecution.\nAdditionally, the FDA and other regulatory authorities have broad enforcement powers. Regulatory enforcement or inquiries, or other increased scrutiny on us, could affect the perceived safety and efficacy of our product candidate and dissuade our customers from using our product candidate, if and when it is authorized for marketing.\nWe have and may continue to encounter substantial delays in planned clinical trials, or our planned clinical trials for other indications may fail to demonstrate the safety and efficacy of our product candidates to the satisfaction of applicable regulatory authorities.\nWhile we currently have no ongoing clinical trials, we will need to conduct further clinical trials. Clinical trials are complex, expensive, time consuming, uncertain as to outcome and are subject to substantial and unanticipated delays. Before we may begin clinical trials, if required, for one of our medical device product candidates and if the clinical trial is determined to present a significant risk, we will be required to submit and obtain approval for an investigational device exemption, or IDE, that describes, among other things, the manufacture of, and controls for, the device and a complete investigational plan. Clinical trials generally involve a substantial number of patients in a multi-year study.\nFor our pharmaceutical product candidates, we are required to submit an Investigational New Drug Application, or IND, the contents of which are subject to discussions with the FDA and include, among other things, results of preclinical studies and other testing, manufacturing information, proposed clinical trial protocols and a general investigational plan. We cannot begin any clinical trials in the United States until 30 days after the IND has been accepted by FDA. Clinical trials involve the administration of the investigational product to human subjects under the supervision of qualified investigators in accordance with current Good Clinical Practices, or cGCPs, which include the requirement that all research subjects provide their informed consent for their participation in any clinical study. Clinical trials are conducted under protocols detailing, among other things, the objectives of the study, the parameters to be used in monitoring the safety and the effectiveness, of criteria to be evaluated. A separate submission to the existing IND must be made for each successive clinical trial conducted during product development and for any subsequent protocol amendments. Furthermore, an independent Investigational Review Board, or IRB, for each site proposing to conduct the clinical trial must review and approve the plan for any clinical trial and its informed consent form before the clinical trial begins at that site and must monitor the study until completed. Regulatory authorities, the IRB or the sponsor may suspend a clinical trial at any time on various grounds, including a finding that the subjects are being exposed to an unacceptable health risk or that the clinical trial is unlikely to meet its stated objectives. Some studies also include oversight by an independent group of qualified experts organized by the clinical study sponsor, known as a data safety monitoring board, which may review data and endpoints at designated check points, make recommendations and/or halt the clinical trial if it determines that there is an unacceptable safety risk for subjects or other grounds, with respect to the foregoing, such as an inadequate demonstration of efficacy. There are also requirements governing the reporting of ongoing clinical studies and clinical study results to public registries.\nHuman clinical trials are typically conducted in three sequential phases that may overlap or be combined:\n· Phase One: The product candidate is initially introduced into healthy human subjects or patients with the target disease or condition. These studies are designed to test the safety, dosage tolerance, absorption, metabolism, and distribution of the investigational product in humans, the side effects associated with increasing doses, and, if possible, to gain early evidence on effectiveness;\n· Phase Two: The product candidate is administered to a limited patient population with a specified disease or condition to evaluate the preliminary efficacy, optimal dosages, and dosing schedule and to identify possible adverse side effects and safety risks. Multiple Phase 2 clinical trials may be conducted to obtain information prior to beginning;\n· Phase Three: The product candidate is administered to an expanded patient population to further evaluate dosage, to provide statistically significant evidence of clinical efficacy and to further test for safety, generally at multiple geographically dispersed clinical trial sites. These clinical trials are intended to establish the overall risk.\n· Post-approval clinical trials, sometimes referred to as Phase 4 studies, may be conducted after initial marketing approval. These clinical trials are used to gain additional experience from the treatment of patients in the intended therapeutic indication. In certain instances, the FDA may mandate the performance of Phase 4 clinical trials as a condition of approval of an NDA.\nBecause we do not have the infrastructure necessary to conduct clinical trials, we will have to hire one or more contract research organizations, or CROs, to conduct trials on our behalf. CRO contract negotiations may be costly and time consuming and we will rely heavily on the CRO to ensure that our trials are conducted in accordance with regulatory and industry standards. We may encounter problems with our clinical trials and any of those problems could cause us or the FDA to suspend those trials or delay the analysis of the data derived from them. Moreover, any failure to abide by the applicable regulatory requirements by us, our CROs, and/or clinical trial sites may result in regulatory enforcement action against such third parties or us.\nWe cannot guarantee that clinical trials will be conducted as planned or completed on schedule, if at all. A failure of one or more clinical trials can occur at any stage of testing. Delays, including, but not limited to those caused by the COVID-19 pandemic, can be costly and could negatively affect our ability to complete a clinical trial and may allow our competitors to bring products to market before we do, which could impair our ability to receive marketing authorization and successfully commercialize our products. If we are unable to complete such planned clinical trials, or are unsuccessful in doing so, we may be unable to advance our product candidates to regulatory authorization and commercialization, which would harm our business, financial condition, and results of operations.\nWe may be substantially dependent on third parties to conduct our clinical trials.\nSince we may conduct clinical trials to obtain FDA marketing authorization, we will need to rely heavily on third parties over the course of our clinical trials, and as a result will have limited control over the clinical investigators and limited visibility into their day-to-day activities. Nevertheless, we are responsible for ensuring that each of our studies is conducted in accordance with the applicable protocol and legal, regulatory and scientific standards, and our reliance on third parties does not relieve us of our regulatory responsibilities. We and the foregoing third parties are required to comply with current good clinical practices, or cGCPs, which are regulations and guidelines enforced by the FDA and comparable foreign regulatory authorities for product candidates in clinical development. Regulatory authorities enforce these cGCPs through periodic inspections of trial sponsors, principal investigators, and trial sites. If we or any of these third parties fail to comply with applicable cGCP regulations, the clinical data generated in our clinical trials may be deemed unreliable and the FDA or comparable foreign regulatory authorities may require us to perform additional nonclinical or clinical trials before approving our marketing applications or may subject them or us to regulatory enforcement actions. We cannot be certain that, upon inspection, such regulatory authorities will determine that any of our clinical trials comply with the cGCP regulations. In addition, our clinical trials may be required to be conducted with a large number of test patients. Our failure or any failure by these third parties to comply with these regulations, or to recruit a sufficient number of patients may require us to repeat clinical trials, which would delay the regulatory marketing authorization process. Moreover, our business may be implicated if any of these third parties violates federal or state fraud and abuse or false claims laws and regulations or healthcare privacy and security laws.\nAny third parties conducting our clinical trials are not and will not be our employees and, except for remedies available to us under our agreements with such third parties, we cannot control whether or not they devote sufficient time and resources to our ongoing preclinical, clinical, and nonclinical programs. These third parties may also have relationships with other commercial entities, including our competitors, for whom they may also be conducting clinical studies or other development activities, which could affect their performance on our behalf. If these third parties do not successfully carry out their contractual duties or obligations or meet expected deadlines, if they need to be replaced, or if the quality or accuracy of the clinical data they obtain is compromised due to the failure to adhere to our clinical protocols or regulatory requirements or for other reasons, our clinical trials may be extended, delayed, or terminated and we may not be able to complete development of, obtain regulatory marketing authorization of or successfully commercialize our product candidate. As a result, our financial results and the commercial prospects for our product candidate would be harmed, our costs could increase, and our ability to generate revenue could be delayed.\nIf any of our relationships terminate with these third-party CROs, we may not be able to enter into arrangements with alternative CROs or do so on commercially reasonable terms. Switching or adding additional CROs involves additional cost and requires management time and focus. In addition, there is a natural transition period when a new CRO begins work. As a result, delays occur, which can materially affect our ability to meet our desired clinical development timelines. Though we carefully manage our relationships with our CROs, there can be no assurance that we will not encounter similar challenges or delays in the future or that these delays or challenges will not have a material adverse impact on our business, financial condition, and prospects.\nWe may be required to suspend or discontinue clinical trials due to side effects or other safety risks that could preclude approval of our products.\nOur clinical trials may be suspended at any time for a number of reasons. We may voluntarily suspend or terminate our clinical trials if at any time we believe that they present an unacceptable risk to participants. In addition, regulatory agencies may order the temporary or permanent discontinuation of our clinical trials at any time if they believe that the clinical trials are not being conducted in accordance with applicable regulatory requirements or that they present an unacceptable safety risk to participants.\nIf we are unable to obtain a reimbursement code from the U.S. Department of Health and Human Services so that our devices or drugs, following receipt of marketing authorization are covered under Medicare and Medicaid, this could have a negative impact on our intended sales and would have a material adverse effect on our business, financial condition and operating results.\nWe plan to submit an application to the U.S. Department of Health and Human Services for a reimbursement code so that our devices and drugs are covered under Medicare and Medicaid following receipt of marketing authorization. However, there can be no assurance that our application will be successful, or that we will be able to obtain a reimbursement code in a timely manner. In the event that we do not obtain a reimbursement code, our customers may be unable to obtain reimbursement for their purchases under private or government-sponsored insurance plans, which could have a negative impact on our sales and have a material adverse effect on our business, financial condition and operating results.\nIf we fail to comply with healthcare laws, we could face substantial penalties and financial exposure, and our business, operations and financial condition could be adversely affected.\nWe do not have a product available for sale in the United States. If, however, we achieve this goal, the availability of payments from Medicare, Medicaid or other third-party payers would mean that many healthcare laws would place limitations and requirements on the manner in which we conduct our business, including our sales and promotional activities and interactions with healthcare professionals and facilities. In some instances, our interactions with healthcare professionals and facilities that occurred prior to commercialization (e.g., the granting of stock options) could have implications at a later date. The laws that may affect our ability to operate include, among others: (i) the federal healthcare programs Anti-Kickback Statute, which prohibits, among other things, persons from knowingly and willfully soliciting, receiving, offering or paying remuneration, directly or indirectly, in exchange for or to induce either the referral of an individual for, or the purchase, order or recommendation of, any good or service for which payment may be made under federal healthcare programs such as Medicare or Medicaid, (ii) federal false claims laws which prohibit, among other things, individuals or entities from knowingly presenting, or causing to be presented, claims for payment from Medicare, Medicaid, or other third-party payers that are false or fraudulent, and which may apply to entities like us if we provide coding and billing advice to customers, or under theories of implied certification where the government and qui tam relators may allege that device companies are liable where a product that was paid for by the government in whole or in part was promoted off-label, lacked necessary marketing authorization, or failed to comply with good manufacturing practices or other laws; (iii) transparency laws and related reporting and/or disclosures such as the Sunshine Act; and/or (iv) state law equivalents of each of the above federal laws, such as anti-kickback and false claims laws which may apply to items or services reimbursed by any third-party payer, including commercial insurers, many of which differ from their federal counterparts in significant ways, thus complicating compliance efforts.\nIf our operations are found to be in violation of any of the laws described above or any other governmental regulations that apply to us, we may be subject to penalties, including civil and criminal penalties, exclusion from participation in government healthcare programs, damages, fines and the curtailment or restructuring of our operations. Any penalties, damages, fines, curtailment or restructuring of our operations could adversely affect our ability to operate our business and our financial results. The risk of our being found in violation of these laws is increased by the fact that their provisions are open to a variety of evolving interpretations and enforcement discretion. Any action against us for violation of these laws, even if we successfully defend against it, could cause us to incur significant legal expenses and divert our managements attention from the operation of our business.\nOur communications regarding product candidates, even while in development, are subject to extensive government scrutiny. We may be subject to governmental, regulatory and other legal proceedings relative to advertising, promotion, and marketing, and communications with study subjects and healthcare professionals, which could have a significant negative effect on our business.\nWe are subject to governmental oversight and associated civil and criminal enforcement relating to advertising, promotion, and marketing, and such enforcement is evolving and intensifying. Communications regarding our products in development and regarding our clinical trials may subject us to enforcement if they do not comply with applicable laws and regulations. In the United States, we are potentially subject to enforcement from the FDA, other divisions of the Department of Health and Human Services, the U.S. Federal Trade Commission (the FTC), the Department of Justice, and state and local governments. Other parties, including private plaintiffs, are also commonly bringing suit against pharmaceutical and medical device companies. We may be subject to liability based on the actions of individual employees and third-party contractors carrying out activities on our behalf.\nU.S. legislative or FDA regulatory reforms may make it more difficult and costly for us to obtain regulatory approval of our product candidates and to manufacture, market and distribute our products after marketing authorization is obtained.\nFrom time to time, legislation is drafted and introduced in Congress that could significantly change the statutory provisions governing the regulatory approval, manufacture and marketing of regulated products or the reimbursement thereof. In addition, FDA regulations and guidance are often revised or reinterpreted by the FDA in ways that may significantly affect our business and our products. Any new regulations or revisions or reinterpretations of existing regulations may impose additional costs or lengthen review times of future products. In addition, FDA regulations and guidance are often revised or reinterpreted by the agency in ways that may significantly affect our business and our products. It is impossible to predict whether legislative or FDA regulation changes will be enacted, or whether guidance or interpretations will change, and what the impact of such changes, if any, may be.\nRisks Related to our Business Operations\nFailure to implement our business strategy could adversely affect our operations.\nOur financial position, liquidity and results of operations depend on our managements ability to execute our business strategy. Key factors involved in the execution of the business strategy include:\n· successful sales through indirect sales distribution;\n· continued investment in technology to support operating efficiency;\n· continued access to significant funding and liquidity sources;\n· achieving the desired cost of goods on inventory; and\n· obtaining the required regulatory clearances or approvals from the FDA.\nOur failure or inability to execute any element of our business strategy could materially adversely affect our financial position, liquidity and results of operations.\nOur inability to attract, train and retain additional qualified personnel may harm our business and impede the implementation of our business strategy.\nWe may need to attract, integrate, motivate and retain personnel with specific qualifications in the future. Competition for these individuals in our industry and geographic region is intense, and we may be unable to attract, assimilate or retain such highly qualified personnel in the future. Our business cannot continue to grow if we are unable to attract such qualified personnel. Our failure to attract and retain highly trained personnel that are essential to our business may limit our growth rate, which would harm our business and impede the implementation of our business strategy.\nWe may be unable to maintain sufficient product liability insurance.\nWe may incur product liability for products sold through our distribution chain. Consumers may sue if products sold through our distribution chain or purchased through our websites are defective or injure the user. This type of claim could require us to spend significant time and money in litigation or to pay significant damages. At this time, we carry no product liability insurance. As a result, any legal claims, whether or not successful, could seriously damage our reputation and business.\nConducting any future clinical trials of our product candidates and any future commercial sales of a product candidate may expose us to expensive product liability claims, and we may not be able to maintain product liability insurance on reasonable terms or at all and may be required to limit commercialization of our product candidates.\nWe face an inherent risk of product liability as a result of the preclinical and future clinical testing of our product candidates and will face an even greater risk when and if we commercialize any products. For example, we may be sued if our product candidates cause or are perceived to cause injury or are found to be otherwise unsuitable during preclinical or clinical testing, manufacturing, marketing or sale. Any such product liability claims may include allegations of defects in manufacturing, defects in design, a failure to warn of dangers inherent in the product, negligence, strict liability or a breach of warranties. Claims could also be asserted under state consumer protection acts. If we cannot successfully defend ourselves against product liability claims, we may incur substantial liabilities or be required to limit testing and commercialization of our product candidates. Even successful defense would require significant financial and management resources. Regardless of the merits or eventual outcome, liability claims may result in:\n· decreased or interrupted demand for our products;\n· injury to our reputation;\n· withdrawal of clinical trial participants and inability to continue our clinical trials;\n· initiation of investigations by regulators;\n· costs to defend the related litigation;\n· a diversion of managements time and our resources;\n· substantial monetary awards to trial participants or patients;\n· product recalls, withdrawals or labeling, marketing or promotional restrictions;\n· loss of revenue;\n· exhaustion of any available insurance and our capital resources;\n· the inability to commercialize any product candidate; and\n· a decline in our share price.\nOur inability to obtain sufficient product liability insurance at an acceptable cost to protect against potential product liability claims could prevent or inhibit the commercialization of products we develop, alone or with collaborators. Our insurance policies may have various exclusions, and we may be subject to a product liability claim for which we have no coverage. We may have to pay any amounts awarded by a court or negotiated in a settlement that exceed our coverage limitations or that are not covered by our insurance, and we may not have, or be able to obtain, sufficient capital to pay such amounts. Even if our agreements with any future corporate collaborators entitle us to indemnification against losses, such indemnification may not be available or adequate should any claim arise.\nWe anticipate growth in our business, and any inability to manage such growth could harm our business.\nOur success will depend, in part, on our ability to effectively manage our growth and expansion. Any growth in, or expansion of, our business is likely to continue to place a significant strain on our management and administrative resources, infrastructure and systems. In order to succeed, we will need to continue to implement management information systems and improve our operating, administrative, financial and accounting systems and controls. We will also need to train new employees and maintain close coordination among our executive, accounting, finance and operations organizations. These processes are time consuming and expensive, will increase management responsibilities and will divert management attention. Our inability or failure to manage our growth and expansion effectively could substantially harm our business and adversely affect our operating results and financial condition.\nOur inability to retain and properly insure against the loss of the services of our chief executive officer and other key personnel may harm our business and impede the implementation of our business strategy.\nOur future success depends significantly on the skills and efforts of Joseph Michael Redmond, President, CEO and Director and possibly other key personnel. The loss of the services of any of these individuals could harm our business and operations. In addition, we have not obtained key person life insurance on any of our key employees. If any of our executive officers or key employees left or were seriously injured and unable to work and we were unable to find a qualified replacement and/or to obtain adequate compensation for such loss, we may be unable to manage our business, which could harm our operating results and financial condition.\nWe participate in transactions and make tax calculations for which the ultimate tax determination may be uncertain.\nWe participate in many transactions and make tax calculations during the course of our business for which the ultimate tax determination is uncertain. While we believe we maintain provisions for uncertain tax positions that appropriately reflect our risk, these provisions are made using estimates of the amounts expected to be paid based on a qualitative assessment of several factors. It is possible that liabilities associated with one or more transactions may exceed our provisions due to audits by, or litigation with, relevant taxing authorities which may materially adversely affect our financial condition and results of operations.\nWe may indemnify our directors and officers against liability to us and our stockholders, and such indemnification could increase our operating costs.\nOur bylaws allow us to indemnify our directors and officers against claims associated with carrying out the duties of their offices. Our bylaws also allow us to reimburse them for the costs of certain legal defenses. Insofar as indemnification for liabilities arising under the Securities Act of 1933 may be permitted to our directors, officers or control persons, we have been advised by the SEC that such indemnification is against public policy and is therefore unenforceable. Since our directors and officers are aware that they may be indemnified for carrying out the duties of their offices, they may be less motivated to meet the standards required by law to properly carry out such duties, which could increase our operating costs. Further, if our directors and officers file a claim against us for indemnification, the associated expenses also could increase our operating costs.\nIf we fail to develop or maintain an effective system of internal controls, we may not be able to accurately report our financial results or prevent financial fraud. As a result, current and potential stockholders could lose confidence in our financial reporting.\nWe are subject to the risk that sometime in the future our independent registered public accounting firm could communicate to the board of directors that we have deficiencies in our internal control structure that they consider to be significant deficiencies. A significant deficiency is defined as a deficiency, or a combination of deficiencies, in internal control over financial reporting such that there is more than a remote likelihood that a material misstatement of the entitys financial statements will not be prevented or detected by the entitys internal controls.\nEffective internal controls are necessary for us to provide reliable financial reports and effectively prevent fraud. If we cannot provide reliable financial reports or prevent fraud, we could be subject to regulatory action or other litigation and our operating results could be harmed. We are required to document and test our internal control procedures to satisfy the requirements of Section 404 of the Sarbanes-Oxley Act of 2002 (the Sarbanes-Oxley Act, or SOX), which requires our management to annually assess the effectiveness of our internal control over financial reporting.\nWe currently are not an accelerated filer as defined in Rule 12b-2 under the Securities Exchange Act of 1934, as amended. Section 404 of the Sarbanes-Oxley Act of 2002 (Section 404) requires us to include an internal control report with our Annual Report on Form 10-K. That report must include managements assessment of the effectiveness of our internal control over financial reporting as of the end of the fiscal year. This report must also include disclosure of any material weaknesses in internal control over financial reporting that we have identified. As of July 31, 2023, management assessed the effectiveness of our internal control over financial reporting based on SEC guidance on conducting such assessments and on the criteria for effective internal control over financial reporting established in Internal Control and Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Management concluded, during the year ended July 31, 2023, that our internal controls and procedures were not effective to detect the inappropriate application of U.S. GAAP rules. Management realized there were deficiencies in the design or operation of our internal control that adversely affected our internal control, which management considers to be material weaknesses. A material weakness in the effectiveness of our internal control over financial reporting may increase the chance of fraud and the loss of customers, reduce our ability to obtain financing, and require additional expenditures to comply with these requirements. Any of these consequences could have a material adverse effect on our business, results of operations and financial condition. For additional information, see Item 9A - Controls and Procedures.\nIt may be time-consuming, difficult, and costly for us to develop and implement the internal controls and reporting procedures required by the Sarbanes-Oxley Act. We may need to hire additional financial reporting, internal controls, and other finance personnel in order to develop and implement appropriate internal controls and reporting procedures. If we are unable to comply with the internal control requirements of the Sarbanes-Oxley Act, then we may not be able to obtain the independent accountant certifications required by such act, which may preclude us from keeping our filings with the SEC current.\nIf we are unable to maintain the adequacy of our internal controls, as those standards are modified, supplemented, or amended from time to time, we may not be able to ensure that we may conclude on an ongoing basis that we have effective internal control over financial reporting in accordance with Section 404. Failure to achieve and maintain an effective internal control environment could cause us to face regulatory action and cause investors to lose confidence in our reported financial information, either of which could adversely affect the value of our common stock.\nOur Articles of Incorporation provide that certain proceedings may only be instituted in the District Courts of Nevada, which may prevent or delay such proceedings and will increase the costs to enforce stockholder rights.\nOur Articles of Incorporation provide that the following actions and proceedings may only be brought in the courts located in the State of Nevada: (i) derivative actions brought on behalf of the company, (ii) any action asserting breach of fiduciary duty by the directors or officers, (iii) any action brought under the Business Associations, Securities and Commodities statutes of the State of Nevada, and (iv) actions asserting a claim under the internal affairs doctrine. No court has determined that such provisions are enforceable in Nevada, and we may be forced to defend proceedings brought in other states if such provision is ruled unenforceable. If enforceable, claims covered by this provision may be maintained in the courts of the State of Nevada only if such courts have personal jurisdiction over the defendants. If the State of Nevada does not have personal jurisdiction over any named defendant, this provision may have the effect of preventing the prosecution of any claim. Additionally, because stockholders may initiate such actions only in the State of Nevada, stockholders will be required to incur additional costs and expense such as engaging legal counsel authorized to practice in Nevada. Moreover, the laws of the State of Nevada may be more favorable to us or our management than the laws of the state in which any stockholder resides.\nOur certificate of incorporation allows our board to create new series of preferred stock without approval by our stockholders, which could adversely affect the rights of the holders of our common stock.\nOur board of directors has the authority to fix and determine the relative rights and preferences of preferred stock. Our board of directors also has the authority to issue preferred stock without stockholder approval. As a result, our board of directors could authorize the issuance of a series of preferred stock granting holders a preferred right to our assets upon liquidation, the right to receive dividend payments before dividends are distributed to the holders of common stock, and the right to redemption of the shares, together with a premium prior to the redemption of our common stock. In addition, our board of directors could authorize the issuance of a series of preferred stock that has greater voting power than our common stock or that is convertible into our common stock, which could decrease the relative voting power of our common stock or result in dilution to our existing stockholders.\nIf our expenses are greater than anticipated, then we will have fewer funds with which to pursue our plan of operations and our financing requirements will be greater than anticipated.\nWe may find that the costs of carrying out our plan of operations are greater than we anticipate. We expect our expenses to increase over time in connection with our ongoing activities, particularly if and as we: invest in marketing and distribution capabilities in support of developing and potentially commercializing our products in the U.S., if cleared or approved; make improvements to product design; launch the ONP-002 trial or conduct other trials of the products, subject to discussion with the FDA; pursue regulatory clearances and approvals; maintain, expand and protect our intellectual property portfolio; engage third party manufacturers; and add additional personnel. Increased operating costs may cause the amount of financing that we require to increase. Investors may be more reluctant to provide additional financing if we cannot demonstrate that we can control our operating costs. There is no assurance that additional financing required as a result of our operating costs being greater than anticipated will be available to us. If we do not control our operating expenses, then we will have fewer funds with which to carry out our plan of operations, which could result in the failure of our business.\nWe are heavily dependent upon the ability and expertise of our management team and a very limited number of employees and the loss of such individuals could have a material adverse effect on our business, operating results or financial condition.\nWe currently have a very small management team. Our success is dependent upon the ability, expertise and judgment of our senior management. While employment agreements are customarily used as a primary method of retaining the services of key employees, these agreements cannot assure the continued services of such employees. Any loss of the services of such individuals could have a material adverse effect on our business, operating results or financial condition.\nOur ability to use net operating losses to offset future taxable income may be subject to certain limitations.\nUnder Section 382 of the Internal Revenue Code of 1986, as amended, or the Code, substantial changes in a corporations ownership may limit the amount of net operating losses, or NOLs, that can be utilized annually in the future to offset the corporations (and the corporations affiliates) U.S. federal and state taxable income. Specifically, this limitation may arise in the event of a cumulative change in ownership of more than 50% within any three-year period. The amount of the annual limitation is determined based on the value of the corporation that underwent the ownership change, immediately before the ownership change. Subsequent ownership changes may further affect any limitation in future years (including by way of exercising of warrants).\nWe are a smaller reporting company under federal securities laws and we cannot be certain whether the reduced reporting requirements applicable to such companies will make our common stock less attractive to investors.\nWe are a smaller reporting company under federal securities laws. For as long as we continue to be a smaller reporting company, we may take advantage of exemptions from various reporting requirements that are applicable to other public companies, including reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements. We will remain a smaller reporting company so long as our public float remains less than $250 million as of the last business day of our most recently-completed second fiscal quarter. We cannot predict if investors will find our common stock less attractive because we may rely on these exemptions. If some investors find our common stock less attractive as a result, there may be a less active trading market for our common stock and our stock price may decline or be more volatile.\nInvestors could lose confidence in our financial reports, and the value of our common stock may be adversely affected, if our internal controls over financial reporting are found not to be effective by management or by our independent registered public accounting firm.\nAs long we remain a non-accelerated filer, we are exempt from the attestation requirement in the assessment of our internal control over financial reporting by our independent auditors pursuant to section 404(b) of the Sarbanes-Oxley Act of 2002 but are required to make our own internal assessment of the effectiveness of our internal controls over financial reporting. The existence of one or more material weaknesses could affect the accuracy and timing of our financial reporting. Investors could lose confidence in our financial reports, and the value of our common stock may be harmed, if our internal controls over financial reporting are found not to be effective by management or by our independent registered public accounting firm.\nSeveral people who work for us on a part-time consulting basis may be subject to conflicts of interest.\nSeveral people who provide services to us are part-time consultants. Each may devote part of his working time to other business endeavors, including consulting relationships with other corporate entities, and may have responsibilities to these other entities. Because of these relationships, some of the persons who provide services to us may be subject to conflicts of interest. Such conflicts may include deciding how much time to devote to our affairs, as well as what business opportunities should be presented to us.\nOur business and operations would suffer in the event of computer system failures, cyber-attacks or a deficiency in our cyber-security.\nDespite the implementation of security measures, our internal computer systems, and those of third parties on which we rely, are vulnerable to damage from computer viruses, malware, natural disasters, terrorism, war, telecommunication and electrical failures, cyber-attacks or cyber-intrusions (including ransomware attacks) over the Internet, attachments to emails, persons inside our organization, or persons with access to systems inside our organization. No network or system can ever be completely secure, and the risk of a security breach or disruption, particularly through cyber-attacks or cyber intrusion, including, but not limited to,by computer hackers, foreign governments, and cyber terrorists, have generally increased as the number, intensity and sophistication of attempted attacks, and intrusions from around the world have increased. If such an event were to occur and cause interruptions in our operations, it could result in operations, reputation, or a material disruption of our development programs for an indeterminate period of time. For example, the loss of clinical trial data from completed or ongoing or planned clinical trials could result in delays in our regulatory approval efforts and significantly increase our costs to recover or reproduce the data. In some cases, data cannot be reproduced. To the extent that any disruption or security breach was to result in a loss of or damage to our data or applications, or inappropriate disclosure of confidential or proprietary information, we could incur material legal claims and liability, damage to our reputation, and the further development of our devices and drugs or any future product candidate could be delayed. If a security breach results in the exposure or unauthorized disclosure of personal information, we could incur additional costs associated with data breach notification and remediation expenses, investigation costs, regulatory penalties and fines, and legal proceedings. Our insurance coverage may not be adequate to cover all the costs related to such breaches or attacks.\nChallenges to our tax positions in U.S. or non-U.S. jurisdictions, the interpretation and application of recent U.S. tax legislation or other changes in U.S. or non-U.S. taxation of our operations could harm our business, revenue and financial results.\nWe operate, or intend to operate, in a number of tax jurisdictions, including in the United States at the federal, state and local levels, and in Australia, and we therefore are or will be subject to review and potential audit by tax authorities in these various jurisdictions. Significant judgment is required in determining our worldwide provision for income taxes and other tax liabilities. Tax authorities may disagree with tax positions we take and challenge our tax positions. Successful unilateral or multi-jurisdictional actions by various tax authorities may increase our worldwide effective tax rate, result in additional taxes or other costs or have other material consequences, which could harm our business, revenue and financial results.\nOur effective tax rate may also change from year to year or vary materially from our expectations based on changes or uncertainties in the mix of activities and income allocated or earned among various jurisdictions in the US, changes in tax laws and the applicable tax rates in these jurisdictions (including future tax laws that may become material), tax treaties between countries, our eligibility for benefits under those tax treaties and the valuation of deferred tax assets and liabilities. Such changes could result in an increase in the effective tax rate applicable to all or a portion of our income, impose new limitations on deductions, credits or other tax benefits or make other changes that may adversely affect our business, cash flows or financial performance. For example, if we are unable to fully realize the benefit of interest expense incurred in future periods as a result of recent tax law changes (as discussed below), we may need to recognize a valuation allowance on any related deferred tax assets, which would impact our annual effective income tax rate.\nRisks Related to Our Common Stock and Its Market Value\nYour ownership will be diluted by future issuances of capital stock.\nOur business strategy requires us to raise additional equity capital through the sale of common stock or preferred stock. Your percentage of ownership will become diluted as we issue new shares of stock. Stockholders have no rights to buy additional shares of stock in the event we issue new shares of stock, known as preemptive rights. We may issue common stock, convertible debt or common stock pursuant to a public offering or a private placement, upon exercise of warrants or options, or to sellers of properties we directly or indirectly acquire instead of, or in addition to, cash consideration. Investors purchasing common stock in this Offering who do not participate in any future stock issues will experience dilution in the percentage of the issued and outstanding stock they own.\nWe have limited capitalization and may require financing, which may not be available.\nWe have limited capitalization, which increases our vulnerability to general adverse economic and industry conditions, limits our flexibility in planning for and reacting to changes in our business and industry, and may place us at a competitive disadvantage to competitors with sufficient capitalization. If we are unable to obtain sufficient financing on satisfactory terms and conditions, we will be forced to curtail or abandon our plans or operations. Our ability to obtain financing will depend upon a number of factors, many of which are beyond our control.\nInvestors may experience dilution in the value of the shares of common stock.\nWe anticipate offering common stock or preferred stock in offerings, which could cause further dilution.\nIf our business is unsuccessful, our stockholders may lose their entire investment.\nAlthough our stockholders will not be bound by or held personally liable for our expenses, liabilities or obligations beyond their total original investments in our common stock, if we suffer a deficiency in funds with which to satisfy our obligations, our stockholders as a whole may lose their entire investment in our company.\nThe sale or issuance of our common stock to Lincoln Park may cause dilution and the sale of the shares of common stock acquired by Lincoln Park, or the perception that such sales may occur, could cause the price of our common stock to fall.\nOn August 14, 2020, we entered into a Purchase Agreement with Lincoln Park and, on that date, we sold 602,422 shares of our common stock to Lincoln Park in an initial purchase under the Purchase Agreement for a total purchase price of $250,000. We also issued 793,802 shares of our common stock to Lincoln Park as consideration for its irrevocable commitment to purchase our common stock under the Purchase Agreement. The remaining shares of our common stock that may be issued under the Purchase Agreement may be sold by us to Lincoln Park at our discretion from time to time over a 36-month period commencing after the satisfaction of certain conditions set forth in the Purchase Agreement, including that the SEC has declared effective the related registration statement and that such registration statement remains effective. The purchase price for the shares that we may sell to Lincoln Park under the Purchase Agreement will fluctuate based on the price of our common stock. Depending on market liquidity at the time, sales of such shares may cause the trading price of our common stock to fall.\nSubject to the terms of the Purchase Agreement, we generally have the right to control the timing and amount of any future sales of our shares to Lincoln Park. Additional sales of our common stock, if any, to Lincoln Park will depend upon market conditions and other factors to be determined by us. We may ultimately decide to sell to Lincoln Park all, some, or none of the additional shares of our common stock that may be available for us to sell pursuant to the Purchase Agreement. If and when we do sell shares to Lincoln Park, after Lincoln Park has acquired the shares, Lincoln Park may resell all or some of those shares at any time or from time to time in its discretion. Therefore, sales to Lincoln Park by us could result in substantial dilution to the interests of other holders of our common stock. Additionally, the sale of a substantial number of shares of our common stock to Lincoln Park, or the anticipation of such sales, could make it more difficult for us to sell equity or equity-related securities in the future at a time and at a price that we might otherwise wish to effect sales. As of July 31, 2023, Lincoln Park had purchased a total of 7,382,518 shares of our common stock at a weighted average price of $0.35 per share for total proceeds of $2,600,487. Subsequent to July 31, 2023 and through October 30, 2023, we sold 500,000 shares of our common stock to LPC for total proceeds of $45,820. As of October 30, 2023, LPC had purchased a total of 7,882,518 shares of our common stock for total proceeds of $2,646,306 and the remaining purchase availability was $7,603,694 and the remaining shares available were 11,388,846.\nA limited public trading market exists for our common stock, which makes it difficult for our stockholders to sell their common stock on the public markets. Any trading in our shares may have a significant effect on our stock prices.\nAlthough our common stock is listed for quotation on the OTC Markets, under the symbol ODYY, the trading activity of our common stock is volatile and may not develop or be sustained. As a result, any trading price of our common stock may not be an accurate indicator of the valuation of our common stock. Any trading in our shares could have a significant effect on our stock price. If a more liquid public market for our common stock does not develop, then investors may not be able to resell the shares of our common stock that they have purchased and may lose all of their investment. No assurance can be given that an active market will develop or that a stockholder will ever be able to liquidate its shares of common stock without considerable delay, if at all. Many brokerage firms may not be willing to effect transactions in the securities. Even if an investor finds a broker willing to affect a transaction in our securities, the combination of brokerage commissions, state transfer taxes, if any, and any other selling costs may exceed the selling price. Furthermore, our stock price may be impacted by factors that are unrelated or disproportionate to our operating performance. These market fluctuations, as well as general economic, political, and market conditions, such as recessions, interest rates, and international currency fluctuations, may adversely affect the market price and liquidity of our common stock.\nOur common stock may never be listed on a national exchange and is subject to being removed from the OTC Marketplace.\nOur common stock is quoted for trading on the OTCQB Marketplace. Should we fail to satisfy the fully reporting eligibility standards of OTC Markets for the OTC Markets, the trading price of our common stock could continue to suffer, and the trading market for our common stock may become less liquid and our common stock price may be subject to increased volatility.\nOur common stock is deemed to be a penny stock, which may make it more difficult for investors to sell their shares due to suitability requirements.\nOur stock is categorized as a penny stock, as that term is defined in SEC Rule 3a51-1, which generally provides that a penny stock is any equity security that has a market price (as defined) less than U.S. $5.00 per share, subject to certain exceptions. Our securities are covered by the penny stock rules, including Rule 15g-9, which imposes additional sales practice requirements on broker-dealers who sell to persons other than established customers and accredited investors. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document in a form prepared by the SEC which provides information about penny stocks and the nature and level of risks in the penny stock market. The broker-dealer must also provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction, and monthly account statements showing the market value of each penny stock held in the customers account. The bid and offer quotations, and the broker-dealer and salesperson compensation information, must be given to the customer orally or in writing prior to effecting the transaction and must be given to the customer in writing before or with the customers confirmation. In addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from these rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written agreement to the transaction. These disclosure requirements may have the effect of reducing the level of trading activity in the secondary market for the stock that is subject to these penny stock rules. Consequently, these penny stock rules may affect the ability of broker-dealers to trade our securities and reduce the number of potential investors. We believe that the penny stock rules discourage investor interest in, and limit the marketability of, our common stock.\nThe sale of shares of our common stock could cause the price of our common stock to decline.\nDepending on market liquidity at the time, a sale of shares covered by a registration statement could cause the trading price of our common stock to decline. The sale of a substantial number of shares of our common stock under a registration statement, or the anticipation of such a sale, could make it more difficult for us to sell equity or equity-related securities in the future at a time and at a price that we otherwise might desire to affect such sales.\nA low market price would severely limit the potential market for our common stock.\nHistorically, our common stock has traded at a price below $5.00 per share, subjecting trading in the stock to certain SEC rules requiring additional disclosures by broker-dealers. These rules generally apply to any non-NASDAQ equity security that has a market price share of less than $5.00 per share, subject to certain exceptions (a penny stock). Such rules require the delivery, before any penny stock transaction, of a disclosure schedule explaining the penny stock market and the risks associated therewith and impose various sales practice requirements on broker-dealers who sell penny stocks to persons other than established customers and institutional or wealthy investors. For these types of transactions, the broker-dealer must make a special suitability determination for the purchaser and have received the purchasers written consent to the transaction before the sale. The broker-dealer must also disclose the commissions payable to the broker-dealer, current bid and offer quotations for the penny stock, and, if the broker-dealer is the sole market maker, the broker-dealer must disclose this fact and the broker-dealers presumed control over the market. Such information must be provided to the customer orally or in writing before or with the written confirmation of trade sent to the customer. Monthly statements must be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks. The additional burdens imposed on broker-dealers by such requirements could discourage broker-dealers from effecting transactions in our common stock.\nIf applicable, FINRA sales practice requirements could limit a stockholders ability to buy and sell our stock.\nIn addition to the penny stock rules promulgated by the SEC, above, FINRA rules (which would apply to our common stock in the event that our common stock ultimately becomes traded over the counter via the OTC Electronic Bulletin Board) require that, in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Under these FINRA rules, before recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. If these FINRA rules were to apply to our common stock, such application would make it more difficult for broker-dealers to recommend that their customers buy our common stock, which could limit the ability to buy and sell our common stock and have an adverse effect on the market value for our shares of common stock.\nAn investors ability to trade our common stock may be limited by trading volume.\nA consistently active trading market for our common stock may not occur on a national stock exchange or an automated quotation system. A limited trading volume may prevent our stockholders from selling shares at such times or in such amounts as they otherwise may desire.\nA limited number of stockholders collectively own a significant portion of our common shares and may act, or prevent corporate actions, to the detriment of other stockholders.\nA limited number of stockholders, including our founders and members of the Board of Directors and our management, currently own a significant portion of our outstanding common shares. Accordingly, these stockholders may, if they act together, exercise significant influence over all matters requiring stockholder approval, including the election of a majority of our directors and the determination of significant corporate actions. This concentration could also have the effect of delaying or preventing a change in control that could otherwise be beneficial to our stockholders.\nThe reverse split of our common stock could decrease our total market capitalization and increase, and may continue to increase, the volatility of our stock price.\nAt our annual stockholder meeting held on January 12, 2023, the stockholders approved the proposal that granted the Board discretionary authority to amend our Certificate of Incorporation to effect a reverse stock split of the issued and outstanding shares of our common stock in a range of not less than two shares and not more than 200 shares at any time on or before December 31, 2023. As determined by our Board, such stock split could be effected at a time and choosing of the Board. The amendment did not change the number of authorized shares of common stock or preferred stock or the relative voting power of our stockholders. The number of authorized shares will not be reduced. The number of authorized but unissued shares of our common stock will materially increase and will be available for re-issuance. We reserve the right not to effect any reverse stock split if the Board does not deem it to be in the best interests of our stockholders and the Board's decision as to whether and when to effect the reverse stock split will be based on a number of factors, including prevailing market conditions, existing and expected trading prices for our common stock, actual or forecasted results of operations, and the likely effect of such results on the market price of our common stock.\nThere can be no assurance that the total market capitalization of our common stock after the reverse stock split will be equal to or greater than the total market capitalization before the reverse stock split or that the per share market price of our common stock following the reverse stock split will increase in proportion to the reduction in the number of shares of common stock outstanding before the reverse stock split. Furthermore, a decline in the market price of our common stock after the reverse stock split may result in a greater percentage decline than would occur in the absence of a reverse stock split, and the liquidity of our common stock could be adversely affected following such a reverse stock split.\nThe reverse stock split could increase our authorized but unissued shares of common stock, which could negatively impact a potential investor.\nBecause the number of authorized shares of our common stock will not be reduced proportionately, the reverse stock split could increase the Boards ability to issue authorized and unissued shares without further stockholder action. The issuance of additional shares of common stock or securities convertible into common stock may have a dilutive effect on earnings per share and relative voting power and may cause a decline in the trading price of the common stock. We could use the shares that are available for future issuance in dilutive equity financing transactions, or to oppose a hostile takeover attempt or delay or prevent changes in control or changes in or removal of management, including transactions that are favored by a majority of the stockholders or in which the stockholders might otherwise receive a premium for their shares over then-current market prices or benefit in some other manner.\nA decline in the price of our common stock could affect our ability to raise any required working capital and adversely affect our operations.\nA decline in the price of our common stock could result in a reduction in the liquidity of our common stock and a reduction in our ability to raise any required capital for our operations. Because our operations to date have been principally financed through the sale of equity securities, a decline in the price of our common stock could have an adverse effect upon our liquidity and our continued operations. A reduction in our ability to raise equity capital in the future may have a material adverse effect upon our business plans and operations. If our stock price declines, we may not be able to raise additional capital or generate funds from operations sufficient to meet our obligations.\nTrading of our common stock could be sporadic, and the price of our common stock may be volatile; we caution you as to the highly illiquid nature of an investment in our shares.\nOur common stock is listed on the OTCQB. Securities of microcap and small-cap companies have experienced substantial volatility in the past, often based on factors unrelated to the companies financial performance or prospects. We believe that trading in our stock has been and will likely continue to be subject to significant volatility. These factors include macroeconomic developments in North America and globally and market perceptions of the attractiveness of particular industries. Factors unrelated to our performance that may affect the price of our common stock include the following: the extent of analytical coverage available to investors concerning our business may be limited if investment banks with research capabilities do not follow us, a reduction in trading volume and general market interest in our common stock may affect an investors ability to trade significant numbers of shares of our common stock; the size of our public float may limit the ability of some institutions to invest in our common stock. As a result of any of these factors, the market price of our common stock at any given point in time may not accurately reflect our long-term value. The price of our common shares may increase or decrease in response to a number of events and factors, including: changes in financial estimates; our acquisitions and financings; quarterly variations in our operating results; the operating and share price performance of other companies that investors may deem comparable; and purchase or sale of blocks of our common stock. Any of these factors, may materially adversely affect the prices of our common shares regardless of our operating performance.\nThe market price of our common stock is affected by many other variables which are not directly related to our success and are, therefore, not within our control. These include other developments that affect the breadth of the public market for shares of our common stock and the attractiveness of alternative investments. The effect of these and other factors on the market price of our common stock is expected to make our common stock price volatile in the future, which may result in losses to investors.\nWe have not paid any dividends and do not foresee paying dividends in the future.\nWe intend to retain earnings, if any, to finance the growth and development of our business and do not intend to pay cash dividends on shares of our common stock in the foreseeable future. The payment of future cash dividends, if any, will be reviewed periodically by the board of directors and will depend upon, among other things, conditions then existing including earnings, financial condition and capital requirements, restrictions in financing agreements, business opportunities and other factors.\nIf securities or industry analysts do not publish or cease publishing research or reports about us, our business or our market, or if they change their recommendations regarding our stock adversely, our stock price and trading volume could decline.\nThe trading market for our common stock will be influenced by the research and reports that industry or securities analysts may publish about us, our business, our market or our competitors. If any of the analysts who may cover us, adversely change their recommendation regarding our stock, or provide more favorable relative recommendations about our competitors, our stock price would likely decline. If any analyst who may cover us were to cease coverage of our company or fail to regularly publish reports on us, we could lose visibility in the financial markets, which in turn could cause our stock price or trading volume to decline.\nCautionary Note\nWe have sought to identify what we believe to be the most significant risks to our business, but we cannot predict whether, or to what extent, any of such risks may be realized nor can we guarantee that we have identified all possible risks that might arise. Investors should carefully consider all of such risk factors before making an investment decision with respect to our common stock. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nAs of July 31, 2023, we own no real property and lease minimal office space. Our principal address is located at 2300 West Sahara Avenue, Suite 800 - #4012, Las Vegas, Nevada, 89102. Item 3. Legal Proceedings\nAs of the date of this filing, we are currently not a party to any legal proceedings. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for the Registrants Common Stock, Related Shareholder Matters, and Issuer Purchases of Equity Securities\nMarket Information\nOur stock trades on the OTC Markets under the symbol ODYY. The following table sets forth the bid prices quoted for our common stock during each quarter, as reported by the OTCQB in the last two fiscal years. The following quotations reflect inter-dealer prices, without retail mark-up, markdown or commission and may not necessarily represent actual transactions.\nHigh Low\nFiscal Year Ended July 31, 2023\nFourth Quarter $ 0.15 $ 0.06\nThird Quarter 0.17 0.07\nSecond Quarter 0.39 0.12\nFirst Quarter 0.51 0.12\nFiscal Year Ended July 31, 2022\nFourth Quarter $ 0.53 $ 0.15\nThird Quarter 0.60 0.30\nSecond Quarter 0.64 0.11\nFirst Quarter 0.60 0.28\nTransfer Agent\nOur transfer agent is Empire Stock Transfer, 1859 Whitney Mesa Drive, Henderson, Nevada 89014 (702) 818-5898.\nHolders of our Common Stock\nAs of October 30, 2023, 81,495,269 shares of our common stock were outstanding. There are approximately 2,500 stockholders of record.\nDividends\nWe have never paid dividends with respect to our common stock and cannot provide any assurance that we will declare or pay cash dividends on our common stock. Any future determination to declare cash dividends will be made at the discretion of our board of directors, subject to applicable laws, and will depend on our financial condition, results of operations, capital requirements, general business conditions and other factors that our board of directors may deem relevant. Our board of directors expects to retain future earnings (if any) to finance our growth. See Managements Discussion and Analysis of Financial Condition and Results of Operations.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nSee Item 12 of this report for disclosure regarding securities authorized for issuance under equity compensation plans required by Item 201(d) of Regulation S-K.\nRecent Sales of Unregistered Securities\nUnreported sales of unregistered securities were as follows:\nIn fiscal 2023 and 2022, the Board granted the following stock options and restricted stock units (RSUs):\nFiscal 2023 Fiscal 2022\nStock Options Number of\nstock options Average\nexercise price Number of\nstock options Average\nexercise price\nDirectors - $ - 2,000,000 $ 0.30\nOfficers 500,000 0.32 1,350,000 0.30\nEmployees 2,200,000 0.28 200,000 0.30\nConsultants 3,400,000 0.18 995,000 0.24\nMilitary advisory board 200,000 0.07 400,000 0.45\nScientific advisory board 200,000 0.18 - -\nSports advisory board - - 650,000 0.47\n6,500,000 $ 0.22 5,595,000 $ 0.32\nFiscal 2023 Fiscal 2022\nRestricted Stock Units Number\nof RSUs Average\nexercise price Number\nof RSUs Average\nexercise price\nDirectors 1,500,000 $ 0.30 1,500,000 $ 0.45\nOfficers 1,000,000 0.30 - -\nEmployees 300,000 0.30 - -\n2,800,000 $ 0.30 1,500,000 $ 0.45\nStock options and RSUs granted to directors, officers and employees were in exchange for ongoing services in their respective capacities.\nThe stock options and RSUs granted to others were in exchange for services provided in an amount equal to the fair value of awards granted.\nIn June 2021, we sold 500,000 shares of our common stock at $0.59 per share along with a five-year share purchase warrant exercisable for 500,000 shares of our common stock at a price of $1.00 per share, for a total aggregate purchase price of $295,000 to Tysadco, an accredited investor, which also provided certain consulting services to us. The purchase price was paid with $250,000 cash and the satisfaction of $45,000 of amounts due to Tysadco for its consulting services.\nIn August 2021, in connection with Tysadco convertible debt financing, we issued Tysadco 200,000 shares of our common stock with a value of $17,718.\nIn October 2021, in connection with an equity financing with LPC, to which we received $250,000 in cash from LPC and LPC received (i) 1,500,000 restricted shares of our common stock, and (ii) 833,333 warrants exercisable at $0.50 per common share expiring in five years.\nIn October 2021, in connection with an equity financing with Tysadco, to which we received $250,000 in cash from Tysadco and Tysadco received (i) 1,500,000 restricted shares of our common stock, and (ii) 833,333 warrants exercisable at $0.50 per common share expiring in five years.\nIn February 2022, in connection with an amendment to the LGH Note, we issued LGH 100,000 shares of our common stock with a value of $51,000.\nIn February 2022, in connection with an investor relations consulting agreement with Tysadco, we issued Tysadco 3,000,000 restricted shares of our common stock valued at $0.53 per share. The agreement includes a leak out provision until the shares have been sold.\nIn May and July 2022, we entered into consulting agreements for investor relations services. We granted the investor relations firms a total of 745,000 shares of our common stock valued at an average price of $0.23 per share for a total value of $171,650.\nIn June 2022, in connection with our agreement with Prevacus entered into on March 1, 2021, we issued Prevacus 1,000,000 shares of our common stock with a value of $77,800 related to the successful first dosing in our Phase I clinical trial related to our ONP-002 neurosteroid concussion treatment.\nIn September and October 2022 and March 2023, in connection with entering into consulting agreements, we issued consultants 2,300,000 shares of our common stock valued at an average price of $0.19 per share for a total value of $433,800.\nIn September 2022, we entered into a promissory note for $30,000 with a consultant for investor relations services with an interest rate of 8% per annum and a due date of December 31, 2022. On December 30, 2022, this promissory note was amended to extend the maturity date to January 31, 2023. On January 31, 2023, the note was extended to June 30, 2023. As consideration, the consultant was granted a five-year stock option for 50,000 shares of common stock at $0.17 per share with a value of $7,700. On June 9, 2023, we entered into Amendment No. 2 to this promissory note pursuant to which we converted the loan into 300,000 shares of our common stock with a value of $36,000.\nIn November 2022, in connection with the Option Agreement with Prevacus, we issued 1,000,000 shares of our common stock with a value of $0.17 per share for a total value of $170,000.\nIn December 2022, we entered into a Securities Purchase Agreement (the SPA) with Mast Hill Fund, L.P. (Mast Hill). We issued a five-year share purchase warrant entitling Mast Hill to acquire 2,000,000 shares of our common stock at $0.20 per share with a value of $274,000 and a five-year warrant for 4,000,000 shares of our common stock at $0.20 per share with a value of $548,000 issuable in the event of default. In connection with the agreement, we issued Carter Terry & Company, Inc. 213,725 shares of our common stock valued at $13,443.\nIn June 2023, we entered into Amendment No. 1 to the SPA dated December 13, 2022. Pursuant to the Amendment, we issued a five-year common stock purchase warrant to Mast Hill Fund L.P. for the purchase of 1,000,000 shares of our common stock at $0.20 per share with a fair value of $28,448.\nIn June 2023, Mast Hill converted $40,250 of accrued interest and $1,750 of fees for a total of $42,000 into 560,000 shares of our common stock.\nIn issuing these shares, we relied on an exemption from the registration requirements of the Securities Act of 1933 provided by Section 4(a)(2) of the Securities Act of 1933.\nIssuer Purchases of Equity Securities\nNone. Item 6. Reserved Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nThis Annual Report on Form 10-K contains forward-looking statements that involve substantial risks and uncertainties. All statements, other than statements of historical fact, included in this report regarding our strategy, future operations, future financial position, future revenues, projected costs, prospects and plans and objectives of management are forward-looking statements. The words anticipates, believes, estimates, expects, intends, may, plans, projects, will, would and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words.\nWe have based these forward-looking statements on our current expectations and projections about future events. Although we believe that the expectations underlying our forward-looking statements are reasonable, these expectations may prove to be incorrect, and all of these statements are subject to risks and uncertainties. Therefore, you should not place undue reliance on our forward-looking statements. You should understand that the following important factors could affect our future results and could cause those results or other outcomes to differ materially from those expressed or implied in our forward-looking statements.\nWe have based these forward-looking statements on our current expectations and projections about future events. Although we believe that the expectations underlying our forward-looking statements are reasonable, these expectations may prove to be incorrect, and all of these statements are subject to risks and uncertainties. Therefore, you should not place undue reliance on our forward-looking statements. You should understand that the following important factors could affect our future results and could cause those results or other outcomes to differ materially from those expressed or implied in our forward-looking statements:\n· our limited operating history and lack of revenue, on which to evaluate our ability to achieve our business objective and projected cash needs and our expected future revenues, operations and expenditures;\n· our potential ability to obtain additional financing on favorable terms;\n· our public securities potential liquidity and trading;\n· the extent to which we acquire or invest in businesses, products, and technologies; the scope, progress, results and costs of our clinical trials for our drug candidates and medical devices;\n· our ability to successfully integrate our acquired products and technologies into our business, including the possibility that we wont fully realize the expected benefits of the transactions will not be fully realized by us or may take longer to realize than expected;\n· our ability to successfully consummate our asset purchase agreement with Oragenics;\n· the safety and efficacy of our product candidates;\n· the progress and timing of clinical trials;\n· the costs, timing, and outcome of regulatory review of our product candidates;\n· the timing of submissions to, and decisions made by the U.S. Food and Drug Administration (FDA) and other regulatory agencies, related to our product candidates to the satisfaction of the FDA and such other regulatory agencies;\n· our ability to obtain, maintain and successfully enforce adequate patent and other intellectual property or regulatory exclusivity protection of our product candidates and the ability to operate our business without infringing on the intellectual property rights of others;\n· the costs of preparing, filing, and prosecuting patent applications and maintaining, enforcing, and defending intellectual property-related claims;\n· the emergence of competing technologies and other adverse market developments;\n· changes in accounting standards; and\n· the other risks and uncertainties discussed herein and in our other filings with the SEC.\nOverview\nOur business model is to develop or acquire unique medical related products, engage third parties to manufacture such products and then distribute the products through various distribution channels, including third parties. We plan to develop potentially life-saving technologies: the CardioMap® heart monitoring and screening device, the Save A Life choking rescue device, a unique neurosteroid drug compound intended to treat concussions and a unique drug compound to treat rare brain disorders in partnership with Prevacus, Inc. To date, none of our product candidates have received regulatory clearance or approval for commercial sale.\nWe plan to license, improve, and develop our products and identify and select distribution channels. We intend to establish agreements with distributors to get products to market quickly, and undertake and engage in direct marketing efforts effort as we move closer to regulatory approvals. We will determine the most effective distribution method for each unique product we include in our portfolio. We will engage third-party research and development firms that specialize in creating products to assist us in developing our own products, and we will apply for trademarks and patents once we have developed proprietary products.\nRecent Funding\nMast Hill Fund L.P.\nOn December 13, 2022, we entered into a Securities Purchase Agreement (the SPA) with Mast Hill Fund, L.P. (Mast Hill). Pursuant to the SPA, we sold Mast Hill (i) an $870,000 face value, one-year, 10% per annum Promissory Note convertible into shares of our common stock at $0.12 per share, (ii) a five-year share purchase warrant entitling Mast Hill to acquire 2,000,000 shares of our common stock at $0.20 per share (the Warrant), and (iii) a five-year warrant for 4,000,000 shares of our common stock at $0.20 per share issuable in the event of default. Net proceeds after original discount, fees and expenses, was $723,868.\nOn June 13, 2023, we entered into Amendment No. 1 to the SPA dated December 13, 2022. Pursuant to the Amendment, we (i) increased the principal balance by $50,000 to a total of $920,000 to be amortized over the life of the note, (ii) issued a five-year common stock purchase warrant to Mast Hill Fund L.P. for the purchase of 1,000,000 shares of our common stock at $0.20 per share with a fair value of $28,448, (iii) extended the maturity dated to June 13, 2024, (iv) extended the amortization payments, and (v) changed the terms of the repayment from proceeds from other sources.\nLPC Purchase Agreement Draws\nDuring fiscal 2023, LPC purchased a total of 3,633,591 shares of our common stock for total proceeds of $580,220 pursuant to the August 14, 2020, LPC Purchase Agreement. Subsequent to July 31, 2023 and through October 30, 2023, LPC purchased an additional 500,000 shares of our common stock to LPC for total proceeds of $45,820. As of October 30, 2023, LPC had purchased a total of 7,882,518 shares of our common stock for total proceeds of $2,646,306 and the remaining purchase availability was $7,603,694 and the remaining shares available were 11,388,846.\nPromissory Note\nOn September 21, 2022, we entered into a promissory note for $30,000 with a consultant for investor relations services with an interest rate of 8% per annum and a due date of December 31, 2022. The promissory note was amended on December 30, 2022, to extend the maturity date to January 31, 2023. On January 31, 2023, the note was extended to June 30, 2023. As consideration, the consultant was granted a five-year stock option for 50,000 shares of common stock at $0.17 per share. On June 9, 2023, we entered into Amendment No. 2 to this promissory note pursuant to which we converted the loan into 300,000 shares of our common stock with a value of $36,000.\nNote Purchase Agreement\nOn July 7, 2023, we received a $150,000 advance from an accredited investor related to a $500,000 Note Purchase Agreement (the NPA) entered into with two accredited investors on August 15, 2023, at which time the remaining $350,000 of the $500,000 was received.\nAsset Purchase Agreement with Oragenics, Inc.\nOn October 4, 2023, we entered into an Asset Purchase Agreement (the Purchase Agreement) with Oragenics, Inc. (Oragenics the Purchaser). Pursuant to the Purchase Agreement, we have agreed to sell and assign, certain assets and certain liabilities related to a segment of Odysseys business focused on developing medical products that treat brain related illnesses and diseases (the Purchased Assets) to Oragenics in exchange for (i) $1,000,000 in cash and 8,000,000 shares of convertible Series F Preferred Stock (Series F Preferred Stock), on and subject to the terms and conditions set forth therein (such transaction, the Odyssey Asset Purchase). The Purchased Assets include drug candidates for treating mild traumatic brain injury (mTBI), also known as concussion, and for treating Niemann Pick Disease Type C (NPC), as well as our proprietary powder formulation and its nasal delivery device.\nWe received $500,000 upon the execution of the Purchase Agreement on October 4, 2023 and will receive the additional $500,000 upon the earlier of (a) the closing of the Purchase Agreement (the Closing), (b) within three (3) business days after the date that the Company has obtained the its stockholders approval approving the Odyssey Asset Purchase and (c) immediately upon the Purchasers wrongful termination of the Purchase Agreement in breach of the Purchase Agreement.\nThe closing of the Asset Purchase is expected to be at the end of the fourth calendar quarter of 2023.\nSee Notes 6 and 13 of Notes to Consolidated Financial Statements for additional information.\nGoing Concern\nSee Note 1 of Notes to Financial Statements.\nCritical Accounting Policies and Estimates\nThe SEC defines critical accounting policies as those that are, in managements view, important to the portrayal of our financial condition and results of operations and require managements judgment. Our discussion and analysis of our financial condition and results of operations are based on our audited consolidated financial statements, which have been prepared in accordance with U.S. GAAP.\nThe preparation of these consolidated financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue and expenses. We base our estimates on experience and on various assumptions that we believe are reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from those estimates.\nReference is made to our significant accounting policies set forth in Note 2 of Notes to Consolidated Financial Statements.\nResults of Operations\nWe do not currently sell or market any products and we did not have any revenue for the years ended July 31, 2023 or 2022. We will commence actively marketing products after the products and drugs in development have been FDA cleared or approved, but there can be no assurance, however, that we will be successful in obtaining FDA clearance or approval for our products.\nFiscal Year Ended July 31, $ %\nChange Change\nIn-process research and development $ 170,000 $ - $ 170,000 100%\nResearch and development 201,329 1,317,024 (1,115,695 ) -85%\nStock-based compensation 2,820,311 3,870,465 (1,050,154 ) -27%\nGeneral and administrative 2,122,375 2,919,091 (796,716 ) -27%\nLoss from operations (5,314,015 ) (8,106,580 ) (2,792,565 ) -34%\nInterest expense (614,083 ) (836,294 ) 222,211 -27%\nOther income, net 8,677 498,743 (490,066 ) -98%\nNet loss $ (5,919,421 ) $ (8,444,131 ) $ (2,524,710 ) -30%\nBasic and diluted net loss per share $ (0.07 ) $ (0.09 ) $ 0.02 -25%\nIn-Process Research and Development\nIn-process research and development in fiscal 2023 relates to the value of the 1,000,000 shares of our common stock with a value of $0.17 per share issued to Prevacus in connection with the November 2022 Option Agreement. See Note 2.\nResearch and Development\nResearch and development relates to our current projects and includes expenses for clinical research, design and manufacturing, formulation, regulatory and consultants.\nThe change in Research and development was due to the following:\nFiscal Year Ended July 31, 2023 compared to\nFiscal Year Ended July 31, 2022\nIncrease (decrease) in:\nConsultants $ (125,998 )\nDrug development (524,876 )\nPhase 1 clinical trial 566,142 )\nAustralian research and development rebate 338,480\nPrototype phase (225,059 )\nRegulatory (12,100 )\n$ (1,115,695 )\nThe decreases in drug development, consultants and prototype phase were the result of the completion of the development of the concussion drug in the fourth quarter of fiscal 2022. The decrease in Phase I clinical trial costs were the result of the completion of dosing patients in the Phase I clinical trial of our concussion drug device trial in first quarter of fiscal 2023.\nGeneral and Administrative\nGeneral and administrative includes expenses related to salaries and related benefits for employees in finance, accounting, sales, administrative and research and development activities, as well as stock-based compensation, costs related to maintaining compliance as a public company and legal and professional fees.\nThe change in General and administrative was due to the following:\nFiscal Year Ended July 31, 2023 compared to\nFiscal Year Ended July 31, 2022\nIncrease (decrease) in:\nStock-based compensation $ 297,627\nBusiness development and investor relations (1,598,381 )\nConsulting fees 21,487\nFinancing fees (209,793 )\nInsurance expense 8,395\nLegal and professional fees (10,004 )\nWages (355,191 )\nOther (1,010 )\n$ (1,846,870 )\nThe increase in stock-based compensation was due to the vesting of restricted stock units and the granting of stock options in fiscal 2023. The decrease in business development and investor relations was a result of decreased activities related to business development. The decrease in wages was due to the $400,000 bonus granted to our executive officers in January 2022.\nInterest Expense\nInterest expense includes interest on debt outstanding, as well as the amortization of unamortized debt issuance costs and debt closing costs. Certain information regarding debt outstanding was as follows:\nFiscal Year Ended July 31,\nWeighted average debt outstanding $ 2,003,425 $ 1,456,991\nWeighted average interest rate 7.10% 7.57%\nThe increase in weighted average debt outstanding was due to the issuance of an $870,000 promissory note during the second quarter of fiscal 2023 and a $150,000 deposit received on a note purchase agreement during the fourth quarter of fiscal 2023. In addition, the increase to the weighted average debt outstanding is due to the addition of principal to the LGH, ClearThink and Mast Hill notes in exchange for extending the maturity dates on the notes.\nThe weighted average interest rate decreased due to the extension of maturity dates on the LGH and ClearThink notes that have set dollar amounts of interest.\nOther Income, net\nOther income, net in fiscal 2022 included a $500,000 donation in partnership with the Erase PTSD Now organization and the Glenn Greenberg and Linda Vester Foundation. Other income, net in both periods included foreign exchange gains and losses related to invoices denominated and paid in foreign currencies.\nNet Loss\nNet loss decreased in fiscal 2023 compared to fiscal 2022 due to decreased research and development, general and administrative and interest expense as discussed above.\nLiquidity and Capital Resources\nThe following table sets forth the primary sources and uses of cash:\nFiscal Year Ended July 31,\nNet cash used in operating activities $ (1,474,696 ) $ (3,175,783 )\nNet cash used in investing activities (10,061 ) (45,220 )\nNet cash provided by financing activities 1,449,088 2,736,953\nTo date, we have financed our operations primarily through debt financing and limited sales of our common stock. Our ability to continue to access capital could be affected adversely by various factors, including general market and other economic conditions, interest rates, the perception of our potential future earnings and cash distributions, any unwillingness on the part of lenders to make loans to us and any deterioration in the financial position of lenders that might make them unable to meet their obligations to us. If these conditions continue and we cannot raise funds through a public or private debt financing, or an equity offering, our ability to grow our business may be negatively affected. In such case, we may need to suspend research and development activities until market conditions improve.\nCash used in investing activities was for a patent related to our ONP-002 drug device combination.\nDebt\nThe following notes payable were outstanding:\nJuly 31, July 31,\nConvertible note issued to LGH due December 31, 2023, with a set interest amount of $84,000 through July 6, 2023, then an interest rate of 8.0% per annum of the then outstanding principal of $1,055,000 and convertible at $0.12 per share $ 1,055,000 $ 1,180,000\nPromissory notes issued to officers and directors due October 31, 2023, with an interest rate of 8.0% per annum (see Note 10) 125,000 125,000\nNote purchase agreement issued to an accredited investor due August 15, 2024, with an interest rate of 12% per annum 150,000 -\nClearThink convertible promissory note payable due December 31, 2023, with a set interest amount of $20,000 and convertible at $0.20 per share 175,000 275,000\nMast Hill convertible promissory note due June 13, 2024, with an interest rate of 10% per annum and convertible at $0.12 per share 920,000 -\n2,425,000 1,580,000\nUnamortized beneficial conversion feature, debt discount and closing costs (280,340 ) (48,063 )\n$ 2,144,660 $ 1,531,937\nResearch and Development Rebate due from Australian Government\nIn fiscal 2023, we incurred $495,414 of expenses related to our Phase I clinical trial of our concussion drug device combination that are eligible for the Australian research and development rebate for a rebate due of $261,238, which was recorded as an offset to Research and development expense.\nOn November 18, 2022, we received a research and development rebate from the government of Australia in the amount of $313,709 for clinical work performed in Australia related to our Phase I human clinical trial during the fiscal year ended July 31, 2022.\nOn December 8, 2022, we received a goods and service tax refund, which was accrued as part of our research and development rebate due from the Australian government, in the amount of $82,705 related to our Phase I human clinical trial during July, August and September 2022.\nOn February 10, 2023, we received a goods and service tax refund, which was accrued as part of our research and development rebate due from the Australian government, in the amount of $9,231 related to our Phase I human clinical trial during October, November and December 2022.\nOn July 3, 2023, we received a goods and service tax refund, which was accrued as part of our research and development rebate due from the Australian government, in the amount of $3,908, related to our Phase I human clinical trial during January, February and March 2023.\nInflation\nInflation did not have a material impact on our business and results of operations during the periods being reported on.\nOff Balance Sheet Arrangements\nWe do not have any material off balance sheet arrangements. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nAs a Smaller Reporting Company, we are not required to provide information under this item. Item 8. Financial Statements and Supplementary Data\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nFinancial statements of Odyssey Health, Inc.\nReport of Independent Registered Public Accounting Firm (PCAOB ID 76)\nConsolidated Balance Sheets as of July 31, 2023 and 2022\nConsolidated Statements of Operations for the Years Ended July 31, 2023 and 2022\nConsolidated Statements of Stockholders Deficit for the Years Ended July 31, 2023 and 2022\nConsolidated Statements of Cash Flows for the Years Ended July 31, 2023 and 2022\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Odyssey Health, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Odyssey Health, Inc. (the Company) as of July 31, 2023 and 2022, the related consolidated statements of operations, stockholders deficit and cash flows, for each of the two years in the period ended July 31, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2023 and 2022 and the results of its operations and its cash flows for each of the two years in the period ended July 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph - Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has incurred losses and negative cash flows from operations since inception and is currently dependent on the stockholders and lenders to fund its operating activities. Managements plans in regard to these matters are also described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nStock based compensation\nAs discussed in Note 7 to the financial statements, the Company entered into certain transactions which included the issuance of options or warrants for goods and services which were valued using a pricing model.\nWe identified the valuation and accounting treatment of these issuances to be a critical audit matter because determining the fair value and related accounting treatment of these issuances involves a high degree of auditor judgment and an increased extent of effort to evaluate the Companys conclusions.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the conclusions associated with the valuation and accounting treatment for these issuances involved the following procedures, among others:\n· We obtained managements pricing model for the various issuances and tested the significant inputs of the pricing model used to determine the fair value these items.\n· We reviewed the underlying agreements supporting these issuances and agreed the terms of the issuances to the pricing model used by management.\n· We recomputed managements fair value estimate using a similar pricing model to ensure the output was consistent with managements pricing model output.\n/s/ Turner, Stone & Company, L.L.P.\nWe have served as the Companys auditor since 2020.\nDallas, Texas\nOctober 30, 2023\nOdyssey Health, Inc. and Subsidiaries\nConsolidated Balance Sheets\nJuly 31,\nAssets\nCurrent assets:\nCash $ 36,865 $ 72,534\nResearch and development rebate due from the Australian government 276,566 366,475\nPrepaid expenses and other current assets 92,457 87,408\nTotal current assets 405,888 526,417\nIntangible assets, net 49,905 43,260\nTotal assets $ 455,793 $ 569,677\nLiabilities and Stockholders' Deficit\nCurrent liabilities:\nAccounts payable $ 1,797,656 $ 1,549,568\nAccrued wages 1,402,348 896,700\nAccrued interest 142,032 110,063\nAsset purchase liability 1,125,026 1,125,026\nNotes payable, officers and directors 125,000 125,000\nNotes payable, net of unamortized beneficial conversion feature, debt discount and closing costs of $280,340 and $48,063 2,019,660 1,406,937\nTotal current liabilities 6,611,722 5,213,294\nFair value, commitments and contingencies (Note 5) - -\nStockholders' deficit:\nPreferred stock, $.001 par value; 100,000,000 shares authorized, no shares issued or outstanding - -\nCommon stock, $.001 par value; 500,000,000 shares authorized with 79,067,879 and 77,860,563 issued and outstanding 79,068 77,861\nAdditional paid-in capital 53,862,378 49,456,476\nAccumulated deficit (60,097,375 ) (54,177,954 )\nTotal stockholders deficit (6,155,929 ) (4,643,617 )\nTotal liabilities and stockholders deficit $ 455,793 $ 569,677\nThe accompanying notes are an integral part of these consolidated financial statements.\nOdyssey Health, Inc. and Subsidiaries\nConsolidated Statements of Operations\nFiscal Year Ended July 31,\nIn-process research and development $ 170,000 $ -\nResearch and development 201,329 1,317,024\nStock-based compensation 2,820,311 3,870,465\nGeneral and administrative 2,122,375 2,919,091\nLoss from operations (5,314,015 ) (8,106,580 )\nInterest expense (614,083 ) (836,294 )\nOther income, net 8,677 498,743\nNet loss $ (5,919,421 ) $ (8,444,131 )\nBasic net loss per share $ (0.07 ) $ (0.09 )\nDiluted net loss per share $ (0.07 ) $ (0.09 )\nShares used for basic net loss per share 82,677,354 88,995,280\nShares used for diluted net loss per share 82,677,354 88,995,280\nThe accompanying notes are an integral part of these consolidated financial statements.\nOdyssey Health, Inc. and Subsidiaries\nConsolidated Statements of Stockholders Deficit\nCommon Stock\nAdditional\nPaid-In\nAccumulated\nTotal\nStockholders\nShares Dollars Capital Deficit Deficit\nBalances July 31, 2021 87,191,168 $ 87,191 $ 42,879,278 $ (45,733,823 ) $ (2,767,354 )\nCommon stock issued for compensation and services 4,245,000 4,245 1,777,405 - 1,781,650\nCommon stock issued in connection with Prevacus milestone 1,000,000 1,000 (1,000 ) - -\nStock-based compensation - - 2,088,815 - 2,088,815\nCommon stock issued in connection with debt financing 300,000 68,418 - 68,718\nCommon stock issued in equity financing 8,653,970 8,655 2,460,567 - 2,469,222\nBeneficial conversion feature issued with debt - - 159,463 - 159,463\nReturn of shares to treasury (23,529,578 ) (23,530 ) 23,530 - -\nNet loss - - - (8,444,131 ) (8,444,131 )\nBalances July 31, 2022 77,860,563 77,861 49,456,476 (54,177,954 ) (4,643,617 )\nStock-based compensation 2,300,000 2,300 2,818,011 - 2,820,311\nCommon stock issued in debt financing 213,725 13,230 - 13,443\nWarrants issued in debt financing - - 345,135 - 345,135\nCommon stock issued in equity financing 3,633,591 3,634 576,586 - 580,220\nCommon stock issued in conversion of debt 2,860,000 2,860 475,140 - 478,000\nCommon stock issued in option purchase agreement 1,000,000 1,000 169,000 - 170,000\nReturn of shares to treasury (8,800,000 ) (8,800 ) 8,800 - -\nNet loss - - - (5,919,421 ) (5,919,421 )\nBalances July 31, 2023 79,067,879 $ 79,068 $ 53,862,378 $ (60,097,375 ) $ (6,155,929 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nOdyssey Health, Inc. and Subsidiaries\nConsolidated Statements of Cash Flows\nFiscal Year Ended July 31,\nCash flows from operating activities\nNet loss $ (5,919,421 ) $ (8,444,131 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nAmortization 3,416 2,374\nStock issued for services and stock-based compensation 2,820,311 3,870,465\nAmortization of beneficial conversion feature, debt discount and closing costs 532,434 687,429\nStock issued for in-process research and development 170,000 -\nFinancing costs paid with stock 1,750 68,718\nChanges in operating assets and liabilities:\nIncrease in prepaid expenses and other current assets (5,049 ) (33,873 )\nDecrease (increase) research and development rebate due from Australian government 89,909 (366,475 )\nIncrease in accounts payable 248,088 324,785\nIncrease in accrued wages 505,648 637,213\nIncrease in accrued interest 78,219 77,712\nNet cash used in operating activities (1,474,696 ) (3,175,783 )\nCash flows from investing activities\nPurchased intellectual property (10,061 ) (45,220 )\nCash flows from financing activities\nProceeds from borrowings on notes 903,868 375,000\nPrincipal payments made on notes payable (35,000 ) (107,269 )\nProceeds from equity financing 580,220 2,469,222\nNet cash provided by financing activities 1,449,088 2,736,953\nNet change in cash (35,669 ) (484,050 )\nCash, beginning of year 72,534 556,584\nCash, end of year $ 36,865 $ 72,534\nSupplemental disclosure of cash flow information\nCash paid for interest $ - $ 954\nNoncash Investing and Financing Activities\nCommon stock issued for conversion of notes payable and accrued interest $ 478,000 $ -\nCommon stock issued for debt financing commitment shares - 68,718\nCommon stock issued in exchange for closing costs 13,443 -\nWarrants issued in connection with financings 345,135 -\nOriginal issue discount on debt 98,048 -\nBeneficial conversion feature recognized - 200,100\nAccounts payable converted into common stock - 20,000\nIncrease in principal of notes payable 406,132 225,000\nCommon stock issued for Prevacus milestone - 1,000\nShares returned to treasury 8,800 23,530\nThe accompanying notes are an integral part of these consolidated financial statements.\nOdyssey Health, Inc.\nNotes to Consolidated Financial Statements\nNote 1. Nature of Operations and Going Concern\nOur corporate mission is to create or acquire distinct assets, intellectual property, and technologies with an emphasis on acquisition targets that have clinical utility and will generate positive cash flow. Our business model is to develop or acquire medical related products, engage third parties to manufacture such products and then distribute the products through various distribution channels, including third parties. We have three different life saving technologies; the CardioMap® heart monitoring and screening device, the Save a Life choking rescue device and a unique neurosteroid drug compound intended to treat concussions and rare brain disorders. We intend to acquire other technologies and assets and plan to be a trans-disciplinary product development company involved in the discovery, development and commercialization of products and technologies that may be applied over various medical markets. We plan to license, improve and/or develop our products and identify and select distribution channels. We intend to establish agreements with distributors to get products to market quickly as well as to undertake and engage in our own direct marketing efforts. We will determine the most effective method of distribution for each unique product that we include in our portfolio. We will engage third-party research and development firms who specialize in the creation of our products to assist us in the development of our own products and we will apply for trademarks and patents once we have developed proprietary products.\nWe are not currently selling or marketing any products, as our products are in development and Food and Drug Administration (\"FDA\") clearance or approval to market our products will be required to sell in the United States. In addition, it would require additional European union or country specific clearance or approvals to sell internationally.\nWe did not recognize any revenues for the years ended July 31, 2023 (fiscal 2023) or 2022 (fiscal 2022) and we had an accumulated deficit of $60,097,375 as of July 31, 2023. For the foreseeable future, we expect to experience continuing operating losses and negative cash flows from operations. Cash available at July 31, 2023 of $36,865 will not provide enough working capital to meet our current operating expenses through the first quarter of fiscal 2024.\nThe operating deficit and cash balance at July 31, 2023 indicate substantial doubt about our ability to continue as a going concern. Our continued existence depends on the success of our efforts to raise additional capital necessary to meet our obligations as they come due and to obtain sufficient capital to execute our business plan. We may obtain capital primarily through issuances of debt or equity or entering into collaborative arrangements with corporate partners. There can be no assurance that we will be successful in completing additional financing or collaboration transactions or, if financing is available, that it can be obtained on commercially reasonable terms. If we are not able to obtain the additional financing on a timely basis, we may be required to scale down or perhaps even cease operations.\nThe issuance of additional equity securities could result in a significant dilution in the equity interests of our current stockholders. Obtaining commercial loans, assuming those loans would be available, would increase our liabilities and future cash commitments. Our financial statements do not include adjustments that might result from the outcome of this uncertainty.\nWe are continually adjusting our business plan to reflect our current liquidity expectations. Due to the unknown and volatile nature of the stock price and trading volume of our common stock, it is difficult to predict the timing and amount of availability pursuant to our equity line of credit with Lincoln Park Capital Fund, LLC (LPC). Due to the limitations in the equity line of credit, we will need to do one or more of the following during fiscal 2024; secure additional debt financing, secure additional equity financing, secure a strategic partner, reduce our operating expenditures, or seek bankruptcy protection. Given our recurring losses, negative cash flow, and accumulated deficit, there is substantial doubt about our ability to continue as a going concern.\nNote 2. Summary of Significant Accounting Policies\nBasis of consolidation\nThe consolidated financial statements include the accounts of Odyssey Health, Inc. and our wholly-owned subsidiary Odyssey Group International Australia, Pty Ltd (collectively, the Company). All intercompany balances and transactions have been eliminated.\nUse of estimates\nThe preparation of financial statements in conformity with Generally Accepted Accounting Principles (GAAP) generally requires management to make estimates and assumptions that affect amounts reported in the financial statements and accompanying notes. Actual results could differ from those estimates.\nBasis of accounting\nWe measure all of our assets and liabilities on the historical cost basis of accounting unless otherwise required by GAAP.\nResearch and development rebate due from the Australian government\nWe receive a 43.5% rebate at the end of each fiscal year from the Australian government on all research and development performed in Australia. We record the rebate as expenses are incurred as an offset to research and development.\nPrepaid expenses and other current assets\nPrepaid expenses and other current assets consist of loans and advances receivable and prepaid insurance. At July 31, 2023 there were no impairment concerns.\nProperty and equipment, net\nAs of July 31, 2022, all property and equipment was fully depreciated. Depreciation was recorded on a straight-line basis over the estimated useful lives of the assets. We recognized depreciation expense of $0 and $414, respectively, in fiscal 2023 and 2022.\nIntangible assets, net\nIntangible assets consist of costs related to a patent for our ONP-002 drug device combination are analyzed for potential impairment at least annually or whenever events or changes in circumstances indicate the carrying value may not be recoverable and exceeds the fair value, which is the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the intangible assets. We recognized amortization expense of $3,416 and $2,374, respectively, in fiscal 2023 and 2022.\nFuture amortization of intangible assets is as follows:\nSchedule of future amortization expense assets\nFiscal 2024 $ 3,708\nFiscal 2025 3,685\nFiscal 2026 3,685\nFiscal 2027 3,685\nFiscal 2028 3,685\nThereafter 31,457\nTotal $ 49,905\nBeneficial conversion feature of convertible notes payable\nThe beneficial conversion feature (BCF) of a convertible note (Note 6) is normally characterized as the convertible portion or feature of certain notes payable that provide a rate of conversion that is below market value or in-the-money when issued. We record a BCF related to the issuance of a convertible note when issued. Beneficial conversion features that are contingent upon the occurrence of a future event are recorded upon the occurrence of the event.\nThe BCF of a convertible note is a reduction of the carrying amount of the convertible note equal to the intrinsic value of the conversion feature, both of which are credited to additional paid-in-capital and such discount is amortized over the expected term of the convertible note (or to the conversion date of the note, if sooner) and is charged to interest expense.\nNet loss per share\nBasic net loss per share is computed by dividing net loss by the weighted-average number of common shares outstanding for the year. Diluted net loss per share is computed giving effect to all potentially dilutive common stock and common stock equivalents, including stock options, convertible notes, RSUs and warrants. Basic and diluted net loss per share were the same for all years presented as we were in a loss position for all periods.\nThe following securities were excluded from the calculation of diluted net loss per share because their effect would have been anti-dilutive:\nSchedule of antidilutive shares\nFiscal Year Ended July 31,\nOptions to purchase common stock 11,795,000 6,645,000\nEquivalent shares of convertible notes into common stock 25,547,822 7,303,333\nWarrants to purchase common stock 14,558,607 7,558,607\nUnvested restricted stock units 3,055,554 2,189,695\nTotal potentially dilutive securities 54,956,983 23,696,635\nStock-based compensation\nWe recognize stock-based compensation expense for all restricted stock and stock option awards made to employees, directors and independent contractors.\nThe fair value of stock option awards (Note 7) is estimated at the grant date using the Black-Scholes option-pricing model, and the portion that is ultimately expected to vest is recognized as compensation cost over the requisite service period. We have elected to recognize compensation expense for all options with graded vesting on a straight-line basis over the vesting period of the entire option. The determination of fair value using the Black-Scholes pricing model is affected by our stock price, as well as by assumptions regarding a number of complex and subjective variables, including expected stock price volatility, risk free interest rate, expected dividends and projected stock option exercise behaviors. We estimate volatility based on historical volatility of our common stock, and estimate the expected term based on several criteria, including the vesting period of the grant and the term of the award. We estimate stock option exercise behavior based on assumptions regarding future exercise activity of unexercised, outstanding options.\nThe fair value of stock awards is determined based on the fair value of our common stock on the date of grant.\nFair value measurements\nThe carrying values of cash, prepaid expenses and other current assets, accounts payable and accrued wages approximate their estimated fair values because of the short-term nature of these instruments.\nIn-process research and development\nIn-process research and development relates to the value of 1,000,000 shares of our common stock with a value of $0.17 per share issued to Prevacus in connection with the November 2022 Option Agreement (Note 8).\nResearch and development\nResearch and development costs are expensed in the period when incurred.\nIncome taxes\nIncome taxes are accounted for based upon an asset and liability approach. Accordingly, deferred tax assets and liabilities arise from the difference between the tax basis of an asset or liability and its reported amount in the financial statements. Deferred tax amounts are determined using the tax rates expected to be in effect when the taxes will actually be paid or refunds received, as provided under currently enacted tax law. Valuation allowances are established when necessary to reduce deferred tax assets to the amount expected to be realized. Income tax expense or benefit is the tax payable or refundable, respectively, for the period plus or minus the change in deferred tax assets and liabilities during the period.\nAccounting guidance requires the recognition of a financial statement benefit of a tax position only after determining that the relevant tax authority would more likely than not sustain the position following an audit. For tax positions meeting the more-likely-than-not threshold, the amount recognized in the financial statements is the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement with the relevant tax authority. We believe our income tax filing positions and deductions will be sustained upon examination and, accordingly, no reserves or related accruals for interest and penalties have been recorded at July 31, 2023 or 2022. We recognize interest and penalties on unrecognized tax benefits as well as interest received from favorable tax settlements within income tax expense.\nNote 3. New Accounting Pronouncements\nASU 2020-06\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40), which simplifies the accounting for convertible instruments, reduces complexity for preparers and practitioners and improves the decision usefulness and relevance of the information provided to financial statement users. ASU 2020-06 also amends the guidance for the derivatives scope exception for contracts in an entitys own equity to reduce form-over-substance-based accounting conclusions. ASU 2020-06 is effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020. We have not yet determined the impact of adopting this standard on our financial position, results of operations or cash flows.\nNote 4. Asset Purchase Agreement and Asset Purchase Liability\nOn January 7, 2021, we entered into an Asset Purchase Agreement (the APA) with Prevacus, Inc. (Prevacus), pursuant to which we purchased the assets and all of the rights, interests and intellectual property in a certain drug program (ONP-002) for treating mild brain trauma (concussion) and the delivery device (collectively, the Asset) in exchange for (i) 7,000,000 shares of our common stock plus (ii) the Milestone Consideration. Prevacus is a related party, as we are party to a Joint Venture and Intellectual Property Purchase Agreement entered into in June 2019 and its President, Dr. Jacob VanLandingham, is an employee.\nThe Milestone Consideration (Milestone) may be earned by Prevacus as follows:\n(i) 2,000,000 shares of our common stock when the United States Patents are revived in our name by the U.S. Patent and Trademark Office and any international patents that have lapsed also revived in our name by the respective countrys patent offices. The value of shares issued were not to exceed $6.0 million based on the price of our common stock on the date the payment would have been due. This milestone will not be met as the relevant patents lapsed;\n(ii) 1,000,000 shares of our common stock upon successful first dosing in a Phase I Clinical Trial for the Asset. This milestone was met in March 2022;\n(iii) 2,000,000 shares of our common stock upon the grant and issuance to us of a Patent for the Asset from the U.S. Patent and Trademark Office, the value of which shall not exceed $10.0 million based on the price of our common stock on the date the payment is due;\n(iv) 1,000,000 shares of our common stock upon our receipt of net proceeds of at least $1.0 million in a Non-Dilutive Financing relating directly to the development of the Asset within one year after the Closing Date or, in the event of any Non-Dilutive Financing submitted prior to the one-year anniversary of the Closing Date, the milestone will stay effective until the second year anniversary of the Closing Date. This milestone will not be met as the one-year deadline lapsed;\n(v) 2,000,000 shares of our common stock if we sell the Asset to a Third Party resulting in net proceeds to us of at least $50.0 million after a Phase IB Clinical Trial for which we are the sponsor is complete, but prior to completion of a Phase II Clinical Trial. The value of the 2,000,000 shares related to this milestone shall not exceed $25.0 million based on the price of our common stock on the date the payment is due;\n(vi) 4,000,000 shares of our common stock upon the successful completion of a Phase II Clinical Trial for the Asset that leads to (I) our sale of the Asset to a Third Party resulting in net proceeds to us of at least $50.0 million; or (II) the administration of the first dose in a Phase III Clinical Trial for the Asset for which we are, or one of our affiliates or licensees is the sponsor; and\n(vii) 2,000,000 shares of our common stock after the first dosing in a Phase II Clinical Trial and the successful completion of a Phase 1B human clinical trial.\nAll Milestone payments shall only be paid once, upon the initial achievement of the particular Milestone event. We, at our sole and absolute discretion, shall determine if any Milestone event has occurred. To extent the related milestones are not achieved, the above-mentioned Milestone payments will terminate and cease to exist, and we will no longer be liable thereunder, if said Milestone is not completed within four years after the Closing Date. See Note 5 for additional information.\nOn March 1, 2021 (the Closing Date), our APA with Prevacus closed and we issued 6,000,000 shares of our common stock valued at $1.18 per share for the stock granted on the date of acquisition for $7,080,000. We withheld 1,000,000 shares of our common stock valued at $1.18 per share, for $1,180,000, in exchange for our payment of certain liabilities of Prevacus which was recorded as an Asset purchase liability on our Consolidated Balance Sheets. Any remaining Asset purchase liability, once all obligations have been paid, will be satisfied with the release of shares of our common stock at $1.18 per share.\nIn addition, 1,000,000 shares of our common stock valued at $1.18 per share for $1,180,000 was recorded as a component of Additional Paid in Capital for achievement of the milestone related to the first dosing in a Phase I Clinical Trial in March 2022.\nWe determined that, in accordance with Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 730 Research and Development (ASC 730-10-25-2(c)) and pursuant to ASC 730-10-25-2(c), intangibles purchased from others for use in particular research and development projects and that have no alternative future use in research and development or otherwise, represent costs of research and development as acquired, and therefore are expensed when incurred. Accordingly, On March 1, 2021, the date of acquisition, we expensed $9,440,000 as In-process research and development.\nNote 5. Fair Value, Commitments and Contingent Liabilities\nThe fair value of financial assets and liabilities are determined utilizing a three-level framework as follows:\nLevel 1 - Observable inputs, such as unadjusted quoted prices in active markets, for substantially identical assets and liabilities.\nLevel 2 - Observable inputs other than quoted prices within Level 1 for similar assets and liabilities. These include quoted prices for similar assets and liabilities in active markets, quoted prices for identical assets and liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data. If the asset or liability has a specified or contractual term, the input must be observable for substantially the full term of the asset or liability.\nLevel 3 - Unobservable inputs that are supported by little or no market activity, generally requiring a significant amount of judgment by management.\nThe methods described above may produce a fair value calculation that may not be indicative of net realizable value or reflective of future fair values. Further, although we believe our valuation methods are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the reporting date.\nWe did not have any transfers of assets or liabilities measured at fair value on a recurring basis to or from Level 1, Level 2 or Level 3 during the fiscal years ended July 31, 2023 or 2022.\nThe carrying values of cash, prepaid expenses and other, accounts payable and accrued wages approximate their fair value due to their short maturities.\nNo changes were made to our valuation techniques during the fiscal year ended July 31, 2023.\nContingent Liabilities\nAt July 31, 2023 and 2022, we had contingent consideration related to the acquisition of intellectual property, know-how and patents for an anti-choking, life-saving medical device in fiscal 2019. According to the agreement, we will make a one-time cash payment totaling $250,000 upon FDA clearance of the device. The fair value of the contingent consideration is reviewed quarterly and determined based on the current status of the project (Level 3). We determined the value was zero at both periods since it is not yet probable that we will file for FDA clearance.\nWe also had contingent consideration at July 31, 2023 and 2022 related to milestones in our Asset Purchase Agreement with Prevacus, Inc. The fair value of the contingent consideration is reviewed quarterly and determined based on the current status of the project (Level 3). Based on these reviews, the fair value of the contingent consideration was determined to be zero at both periods as it is not yet probable that any of the remaining milestones will be met. See Note 4 for additional information.\nFixed-Rate Debt\nWe have fixed-rate debt that is reported on our Balance Sheets at carrying value less unamortized debt discount and closing costs. The fair value of our fixed rate debt was calculated using a discounted cash flow methodology with estimated current interest rates based on similar risk profile and duration (Level 2). The carrying value, excluding unamortized debt discount and debt issuance costs, and the fair value of our fixed-rate long-term debt was as follows:\nSchedule of fixed-rate debt\nJuly 31,\nCarrying value $ 2,425,000 $ 1,580,000\nFair value $ 2,425,000 $ 1,580,000\nNon-Financial Assets\nNon-financial assets, such as Intangible assets, are measured at fair value on a non-recurring basis when events or circumstances indicate that an impairment may have occurred. If we determine these assets to be impaired, they are reported at fair value as calculated during the period. No non-financial assets were recorded at fair value during fiscal 2023 or 2022.\nNote 6. Debt\nPromissory Note\nOn September 21, 2022, we entered into a promissory note for $30,000 with a consultant for investor relations services with an interest rate of 8% per annum and a due date of December 31, 2022.\nOn December 30, 2022, this promissory note was amended to extend the maturity date to January 31, 2023. On January 31, 2023, the note was extended to June 30, 2023. As consideration, the consultant was granted a five-year stock option for 50,000 shares of common stock at $0.17 per share. All other terms and conditions remained the same.\nOn June 9, 2023, we amended this promissory note in order to convert the loan into 300,000 shares of our common stock with a value of $36,000.\nLGH Investments, LLC\nOn September 29, 2022, we entered into Amendment No. 3 to the Convertible Promissory Note to the Securities Purchase Agreement dated April 5, 2021, with LGH Investments, LLC (LGH). Pursuant to Amendment No. 3, the maturity date of the note was extended to December 31, 2022. As consideration, $115,000 was added to the principal amount outstanding and is being amortized as interest expense over the remaining term of the Note. All other terms and conditions remain the same.\nOn November 10, 2022, LGH provided notice to convert $300,000 of their outstanding convertible note into 1,500,000 shares of our common stock at $0.20 per share.\nOn December 29, 2022, we entered into Amendment No. 4 to the Convertible Promissory Note to the Securities Purchase Agreement dated April 5, 2021, with LGH. Pursuant to the Amendment No. 4, the maturity date of the note was extended to March 31, 2023. As consideration, we paid $35,000 towards the principal amount outstanding and $50,000 was added to the principal amount outstanding. All other terms and conditions remain the same.\nOn March 31, 2023, we entered into Amendment No. 5 to the Convertible Promissory Note to the Securities Purchase Agreement dated April 5, 2021, with LGH. Pursuant to the Amendment No. 5, the maturity date of the note was extended to June 30, 2023. As consideration, $20,000 was added to the principal amount outstanding. All other terms and conditions remain the same. Subsequent to Amendment No. 5 and the conversion, $1,030,000 remained outstanding on the convertible note.\nOn July 6, 2023, we entered into Amendment No. 6 to the Convertible Promissory Note to the Securities Purchase Agreement dated April 5, 2021, with LGH. Pursuant to the Amendment No. 6, the maturity date of the note was extended to December 31, 2023. As consideration, $25,000 was added to the principal amount outstanding and interest shall be charged on the unpaid Principal Amount at the rate of 8% per annum from July 6, 2023. All other terms and conditions remain the same. Subsequent to Amendment No. 6 , $1,055,000 remained outstanding on the convertible note.\nTysadco Partners, LLC/ClearThink Capital Partners, LLC\nOn March 14, 2023, we entered into a Second Amendment to the Convertible Promissory Note (the Second Amendment) to the Securities Purchase Agreement dated August 29, 2021, with Tysadco Partners, LLC (Tysadco). Pursuant to the Second Amendment, the maturity date of the note was extended to December 31, 2023. As consideration, the conversion price was amended to $0.20 per share from $0.30 per share and, upon execution, we converted $100,000 of the note into 500,000 shares of our common stock. Subsequent to this conversion, $175,000 remained outstanding on the note. In addition, Tysadco assigned this note to ClearThink Capital Partners, LLC.\nDirectors and Officers Promissory Notes\nOn December 21, 2021, and December 22, 2021, we entered into a total of five Promissory Notes (the Promissory Notes) with three of our directors and two officers.\nMr. Joseph Michael Redmond, President and Chief Executive Officer, Ms. Christine M. Farrell, Chief Financial Officer, Mr. Jerome H. Casey, Director, Mr. John P. Gandolfo, Director, and Mr. Ricky W. Richardson, Director, each loaned us $25,000 for total proceeds of $125,000. The Promissory Notes bear interest at 8% per annum and were originally due March 31, 2022.\nOn June 30, 2023, we entered into five Promissory Note Amendments (the Amendments) to the Promissory Notes entered into December 21, 2021 and December 22, 2021, and as amended April 20, 2022, June 3, 2022, September 30, 2022, December 30, 2023 and March 31, 2023 with three directors and two officers. Pursuant to the Amendments, the maturity date of the Promissory Notes were extended to October 31, 2023, and the note holder may convert the note prior to maturity at a conversion price of $0.12 per share. All other terms and conditions remain the same.\nAt July 31, 2023 and 2022, we had $16,058 and $6,063, respectively, of accrued interest related to these Promissory Notes.\nMast Hill Fund L.P.\nOn December 13, 2022, we entered into a Securities Purchase Agreement (the SPA) with Mast Hill Fund, L.P. (Mast Hill). Pursuant to the SPA, we sold Mast Hill (i) an $870,000 face value, one-year, 10% per annum Promissory Note convertible into shares of our common stock at $0.12 per share, (ii) a five-year share purchase warrant entitling Mast Hill to acquire 2,000,000 shares of our common stock at $0.20 per share (the Warrant), and (iii) a five-year warrant for 4,000,000 shares of our common stock at $0.20 per share issuable in the event of default. Net proceeds after original discount, fees, and expenses, was $723,868. Pursuant to our agreement with Mast Hill, we were required to notify Mast Hill of any draws on the LPC equity line of credit and at their request remit 30% of the proceeds. In connection with the Mast Hill agreement, we issued Carter Terry & Company, Inc. 213,725 shares of our common stock valued at $13,443.\nOn June 13, 2023, we entered into Amendment No. 1 to the SPA dated December 13, 2022. Pursuant to the Amendment, we (i) increased the principal balance by $50,000 to a total of $920,000 to be amortized over the life of the note, (ii) issued a five-year common stock purchase warrant to Mast Hill Fund L.P. for the purchase of 1,000,000 shares of our common stock at $0.20 per share with a fair value of $28,448, (iii) extended the maturity dated to June 13, 2024, (iv) extended the amortization payments, and (v) changed the terms of the repayment from proceeds from other sources.\nLabrys Fund, LP\nOn August 14, 2020, we entered into a Securities Purchase Agreement (the Labrys SPA) with Labrys Fund, LP (Labrys), pursuant to which Labrys purchased a $350,000 (the Principal Amount) Self-Amortization Promissory Note (the Note) for $315,000 in cash with an original issuance discount of approximately 10%. The Note bore interest at 12% per year. In consideration for entering into the Labrys SPA, we issued 420,000 shares (the Commitment Shares) of our common stock with a value of $197,400. 350,000 of the Commitment Shares (the Second Commitment Shares) were to be returned to us if the Note was fully repaid and satisfied on or prior to August 14, 2021 (the Maturity Date). The Note was fully repaid on August 4, 2021 and the shares were returned on August 6, 2021.\nWe paid Alliance Global Partners, LLP (A.G.P.) as a placement agent a fee of $25,200 and other closing costs of $6,500 for total closing costs of $31,700 which were amortized over the one-year life of the Note.\nAccredited Investors Note Purchase Agreement\nOn July 7, 2023, we received a $150,000 advance from an accredited investor related to a $500,000 Note Purchase Agreement (the NPA) entered into with two accredited investors on August 15, 2023, at which time the remaining $350,000 of the $500,000 was received. See Note 13.\nNotes Payable Outstanding\nSchedule of Notes Payable\nJuly 31, July 31,\nConvertible note issued to LGH due December 31, 2023, with a set interest amount of $84,000 through July 7, 2023, then an interest rate of 8.0% per annum of the then outstanding principal of $1,055,000 and convertible at $0.12 per share $ 1,055,000 $ 1,180,000\nPromissory notes issued to officers and directors due October 31, 2023, with an interest rate of 8.0% per annum (see Note 10) 125,000 125,000\nNote purchase agreement issued to an accredited investor due August 15, 2024, with an interest rate of 12% per annum 150,000 -\nClearThink convertible promissory note payable due December 31, 2023, with a set interest amount of $20,000 and convertible at $0.20 per share 175,000 275,000\nMast Hill convertible promissory note due June 13, 2024, with an interest rate of 10% per annum and convertible at $0.12 per share 920,000 -\n2,425,000 1,580,000\nUnamortized beneficial conversion feature, debt discount and closing costs (280,340 ) (48,063 )\n$ 2,144,660 $ 1,531,937\nNote 7. Stock-Based Compensation\n2021 Omnibus Stock Incentive Plan\nAt our annual stockholder meeting held September 14, 2021, the stockholders approved the Amended and Restated 2021 Omnibus Stock Incentive Plan (the 2021 Plan). The purpose of the 2021 Plan is to enable us to recruit and retain highly qualified employees, directors and consultants and to provide incentives for productivity and the opportunity to share in our growth and value. Subject to certain adjustments, the maximum number of shares of common stock, incentive stock options, stock appreciation rights, restricted stock, restricted stock units, cash or other stock-based awards that may be issued under the 2021 Plan is 20,000,000. At July 31, 2023, no shares remained available for future issuances and 19,475,000 shares of our common stock were reserved for issuance for awards outstanding pursuant to the 2021 Plan. Awards covering a total of 2,545,000 shares were granted outside of the 2021 Plan in fiscal 2023, all of which were outstanding at July 31, 2023.\nGrants to Directors, Officers and Named Executive Officers Pursuant to the 2021 Plan\nOn September 14, 2021, three independent Board members each received 500,000 RSUs with a value of $0.45 per share. In addition, Mr. Richardson received an initial equity grant of 500,000 RSUs with a value of $0.73 per share upon joining the Board on May 6, 2021. All of the RSUs vested monthly over a 12-month period from the date of grant. During fiscal 2023, we recognized $795,951 of stock-based compensation related to these awards as a component of General and administrative.\nOn May 19, 2022, the Board granted options exercisable for 500,000 shares of our common stock to each of our four independent directors, 750,000 to Mr. Redmond and 600,000 to Ms. Farrell. All of these awards vested 50% in one year and 50% in two years and 100,000 to Dr. VanLandingham vesting based upon milestones for a total of 3,450,000 options granted. The exercise price per share is $0.30 and the options have a 10 year expiration. During fiscal 2023 and 2022, we recognized $524,362 and $148,238, respectively, of stock-based compensation related to these awards as a component of General and administrative.\nOn October 14,2022, The Board granted Ms. Farrell, granted options exercisable for 500,000 shares of our common stock vesting upon a listing to a higher exchange. The exercise price is $0.318 and the options have a 10 year expiration. During fiscal 2023, we recognized $120,735 of stock-based compensation related to these awards as a component of General and administrative.\nOn January 12, 2023, three independent Board members each received 500,000 RSUs with a value of $0.30 per share. All of the RSUs vest 100% on January 12, 2024. During fiscal 2023, we recognized $243,750 of stock-based compensation related to these awards as a component of General and administrative.\nIn January 2023, one independent director retired and voluntarily forfeited all vested and unvested equity awards, which resulted in a reversal of stock-based compensation of $68,497 in fiscal 2023.\nOn January 12, 2023, Mr. Redmond and Ms. Farrell, our two executive officers, each received 500,000 RSUs with a value of $0.30 per share. 100,000 shares vested immediately, and 400,000 vest on December 31, 2023. During fiscal 2023, we recognized $201,816 of stock-based compensation related to these awards as a component of General and administrative.\nDuring fiscal 2023, we recognized total $866,784 of RSU stock-based compensation as a component of General and administrative.\nStock Options\nStock option activity during fiscal 2023 was as follows:\nSchedule of stock option activity\nNumber of\nOptions\nWeighted Average Exercise Price\nOptions outstanding at July 31, 2022 6,645,000 $ 0.46\nOptions granted 6,500,000 0.22\nOptions canceled or expired (1,350,000 ) (0.38 )\nOptions outstanding at July 31, 2023 11,795,000 $ 0.34\nCriteria used for determining the Black-Scholes value of options granted were as follows:\nSchedule of assumptions\nYear Ended July 31,\nExpected stock price volatility\n140% - 151%\n137% - 149%\nRisk free interest rate\n2.73% - 4.25%\n1.17% - 3.02%\nExpected life of options (years)\n3.0 - 10.0\n3.0 - 10.0\nExpected dividend yield\n-\n-\nRestricted Stock Units (RSUs)\nRSU activity during fiscal 2023 was as follows:\nSchedule of RSU activity\nNumber of RSUs Weighted Average\nGrant Date\nFair Value\nRSUs outstanding at July 31, 2022 2,189,695 $ 0.23\nRSUs issued 2,800,000 0.30\nRSUs vested (934,141 ) 0.60\nRSUs forfeited (1,000,000 ) (1.10 )\nRSUs outstanding at July 31, 2023 3,055,554 $ 0.28\nWarrants\nWarrant activity during fiscal 2023 was as follows:\nSchedule of warrant activity\nNumber of Warrants Weighted Average Exercise Price\nWarrants outstanding at July 31, 2022 7,558,607 $ 0.69\nWarrants issued 7,000,000 0.20\nWarrants outstanding at July 31, 2023 14,558,607 $ 0.46\nUnrecognized Stock-Based Compensation Costs\nAt July 31, 2023, we had total unrecognized stock-based compensation of $1,116,020, which will be recognized over the weighted average remaining vesting period of .74 years.\nNote 8. Common Stock\nReturn of shares\nOn August 5, 2021, our loan with Labrys Fund, LP was repaid in full and, per the agreement, on August 6, 2021, 350,000 restricted stock shares were returned to treasury.\nOn December 21, 2021, Vivakor, Inc., a shareholder, returned 3,309,578 shares of our common stock and the shares were returned to treasury.\nOn December 29, 2021, Regal Growth, LLC, a shareholder, returned 5,000,000 shares of our common stock and the shares were returned to treasury.\nOn February 2, 2022, LBL Professional Consulting, Inc., a shareholder, returned 7,500,000 shares of our common stock and the shares were returned to treasury.\nOn July 27, 2022, PLC Investments, Inc., a shareholder, returned 7,370,000 shares of our common stock and the shares were returned to treasury.\nIn September and October 2022, two shareholders returned at total of 8,800,000 shares of our common stock valued at $8,800 to treasury.\nCommon Stock Issued for Services\nOn February 9, 2022, in connection with an investor relations consulting agreement with Tysadco, we issued Tysadco 3,000,000 restricted shares of our common stock valued at $0.53 per share for a total value of $1,590,000 which was expensed as a component of General and administrative. The agreement includes a leak out provision until the shares have been sold.\nOn May 8, 2022, we entered into a six-month consulting agreement for investor relations services. We granted the investor relations firm 45,000 shares of our common stock valued at $0.37 per share for a total value of $16,650 which was expensed as a component of General and administrative.\nOn May 19, 2022, we entered into a six-month consulting agreement for investor relations services. We granted the investor relations firm 500,000 shares of our common stock valued at $0.23 per share for a total value of $115,000 which was expensed as a component of General and administrative.\nOn June 10, 2022, in connection with our agreement with Prevacus entered into on March 1, 2021, we issued Prevacus 1,000,000 shares of our common stock upon the successful first dosing in our Phase I clinical trial related to our ONP-002 neurosteroid concussion treatment in the quarter ended April 30, 2022.\nOn July 20, 2022, we entered into a consulting agreement for investor relations services. We granted the investor relations firm 200,000 shares of our common stock valued at $0.20 per share for a total value of $40,000 which was expensed as a component of General and administrative.\nIn September and October 2022 and March 2023, in connection with entering into consulting agreements, we issued consultants 2,300,000 restricted shares of our common stock valued at an average price of $0.19 per share for a total value of $433,800 which was expensed as a component of General and administrative.\nReverse Split\nAt our annual stockholder meeting held on January 12, 2023, the stockholders approved the proposal that granted the Board discretionary authority to amend our Certificate of Incorporation to effect a reverse stock split of the issued and outstanding shares of our common stock in a range of not less than two shares and not more than 200 shares at any time on or before December 31, 2023. As determined by our Board, such stock split could be effected at a time and choosing of the Board. The amendment did not change the number of authorized shares of common stock or preferred stock or the relative voting power of our stockholders. The number of authorized shares will not be reduced. The number of authorized but unissued shares of our common stock will materially increase and will be available for re-issuance. We reserve the right not to effect any reverse stock split if the Board does not deem it to be in the best interests of our stockholders and the Board's decision as to whether and when to effect the reverse stock split will be based on a number of factors, including prevailing market conditions, existing and expected trading prices for our common stock, actual or forecasted results of operations, and the likely effect of such results on the market price of our common stock.\nTysadco Partners\nOn October 18, 2021, we entered into a Securities Purchase Agreement (the SPA) with Tysadco Partners (Tysadco) pursuant to which we received $250,000 in cash from Tysadco and Tysadco received (i) 1,500,000 restricted shares of our common stock, and (ii) 833,333 warrants exercisable at $0.50 per common share expiring in five years.\nIn June 2021, we sold 500,000 shares of our common stock at $0.59 per share along with a five-year share purchase warrant exercisable for 500,000 shares of our common stock at a price of $1.00 per share for total an aggregate purchase price of $295,000 to Tysadco, an accredited investor, which also provided certain consulting services to us. The purchase price was paid with $250,000 cash and the satisfaction of $45,000 of amounts due to Tysadco for its consulting services.\nLincoln Park Capital Fund\nOctober 2021 Securities Purchase Agreement\nOn October 22, 2021, we entered into a Securities Purchase Agreement (the SPA) with Lincoln Park Capital Fund, LLC (LPC) pursuant to which we received $250,000 in cash from LPC and LPC received (i) 1,500,000 restricted shares of our common stock, and (ii) 833,333 warrants exercisable at $0.50 per common share expiring in five years.\nAugust 2020 Securities Purchase Agreement\nOn August 14, 2020, we entered into a Purchase Agreement (the LPC Purchase Agreement) with Lincoln Park Capital Fund, LLC (Lincoln Park or LPC). Pursuant to the LPC Purchase Agreement, we have the right, in our sole discretion, to sell to LPC up to $10,250,000 in shares of our common stock, from time to time over a 36-month period. In consideration for entering into the LPC Purchase Agreement, we issued 793,802 shares of our common stock to LPC.\nUpon entering into the LPC Purchase Agreement, we sold 602,422 shares of our common stock to LPC in an initial purchase for a total purchase price of $250,000. Thereafter, and subject to the conditions of the LPC Purchase Agreement and RRA, on any business day and subject to certain customary conditions, we may direct LPC to purchase to up to 200,000 shares of our common stock (such purchases, Regular Purchases). The amount of a Regular Purchase may increase up to 100,000 shares of common stock under certain circumstances based on the market price of the common stock. There are no limits on the price per share that LPC may pay to purchase common stock under the LPC Purchase Agreement, provided that LPCs committed obligation under any Regular Purchase shall not exceed $50,000 unless the median aggregate dollar value of the volume of shares of common stock during the 20 consecutive trading day period ending on the date of the applicable Regular Purchase equals or exceeds $100,000, in which case LPCs committed obligation under such single Regular Purchase shall not exceed $500,000.\nIn addition, if we have directed LPC to purchase the full amount of common stock available as a Regular Purchase on a given day, we may direct LPC to purchase additional amounts as accelerated purchases and additional accelerated purchases as set forth in the LPC Purchase Agreement. The purchase price of shares of our common stock will be based on the then prevailing market prices of such shares at the time of sale. The LPC Purchase Agreement limits our sale of shares of common stock to LPC, and LPCs purchase or acquisition of common stock from us, to an amount of common stock that, when aggregated with all other shares of our common stock then beneficially owned by LPC would result in LPC having beneficial ownership, at any single point in time, of more than 4.99% of the then total outstanding shares of our common stock.\nThe LPC Purchase Agreement contains customary representations, warranties, covenants, closing conditions and indemnification and termination provisions. LPC has covenanted not to cause or engage in any manner whatsoever, any direct or indirect short selling or hedging of our common stock. The LPC Purchase Agreement does not limit our ability to raise capital from other sources in our sole discretion; provided, however, that we shall not enter into any Variable Rate Transaction as defined in the LPC Purchase Agreement, including the issuance of any floating conversion rate or variable priced equity-like securities, but excluding any At-the-Market offering with a registered broker-dealer, until the later of (i) the 36-month anniversary of the date of the LPC Purchase Agreement, and (ii) the 36-month anniversary of the Commencement Date (if the Commencement has occurred), in either case irrespective of any earlier termination of the LPC Purchase Agreement. The LPC Purchase Agreement may be terminated by us at any time and at our discretion without any cost to us.\nIn connection with the LPC transaction, we engaged A.G.P. as a placement agent to help raise capital. A.G.P. introduced us to LPC, for which we agreed to pay A.G.P. a fee of 8% of the amount of the funds received from LPC, which totaled $20,000 in the quarter ended October 31, 2020. A.G.P. will also receive a fee totaling 8% of any additional funds raised pursuant to the LPC Purchase Agreement. At July 31, 2021, we paid A.G.P. a total of $97,718 in connection with the 1,550,904 shares purchased from January 2021 through July 31, 2021 and at July 31, 2023, we have accrued $13,750 in Accounts payable related to this amount and no additional fees are required to be paid.\nIn addition, and in consideration for the service provided in connection with Labrys and LPC, we granted warrants that were immediately exercisable for a total of 550,000 shares of our common stock at $0.50 per share to A.G.P. and two partners of A.G.P. The warrants had a value of $220,000 and expire August 6, 2024. Of the $220,000, $91,667 was netted against the LPC equity transaction and $128,333 was recorded as debt closing costs related to the Labrys transaction and is being amortized over the one-year life of the note.\nShares purchased by LPC, including the initial purchase, are summarized below:\nSchedule of Shares purchased\nPurchase Date Number of\nShares\nPurchased\nAverage\nPurchase\nPrice\nper Share\nTotal\nPurchase\nPrice\nRemaining\nPurchase\nAvailability\nAugust 14, 2020 602,422 $ 0.41 $ 250,000 $ 10,000,000\nJanuary 2021 200,000 0.18 35,080 9,964,920\nFebruary 2021 330,106 0.63 206,798 9,758,122\nMarch 2021 1,020,798 0.96 979,597 8,778,525\nAugust 2021 600,000 0.40 237,940 8,540,585\nSeptember 2021 374,482 0.35 129,096 8,411,489\nFebruary 2022 100,000 0.52 51,500 8,359,989\nMarch 2022 100,000 0.49 48,700 8,311,289\nJuly 2022 421,119 0.19 81,556 8,229,733\nAugust 2022 233,591 0.17 39,610 8,190,124\nSeptember 2022 200,000 0.15 29,000 8,161,124\nOctober 2022 700,000 0.25 172,100 7,989,024\nNovember 2022 800,000 0.19 154,320 7,834,704\nDecember 2022 300,000 0.15 46,000 7,788,704\nFebruary 2023 600,000 0.11 66,750 7,721,953\nMarch 2023 500,000 0.10 48,520 7,673,434\nApril 2023 200,000 0.08 16,420 7,657,014\nJune 2023 100,000 0.08 7,500 7,649,514\n7,382,518\n$ 2,600,487\nSee Note 13 for information regarding subsequent sales to LPC.\nLGH\nIn connection with an amendment to the LGH Note, dated February 1, 2022, we issued LGH 100,000 shares of our common stock with a value of $51,000. See Note 6 for additional information.\nPrivate Placement\nOn February 2, 2022, we entered into an agreement to raise money through a private investment in a public entity (PIPE). We offered up to 14,285,714 Units (the Units) at $0.35 per Unit (the Offering). Each Unit consisted of one share of our common stock (the Shares) and one-half of an accompanying warrant (the Investor Warrants). Each full warrant is exercisable for one share of our common stock at $0.70 per share. The Investor Warrants have a term of 5 five years and, in certain circumstances, may be exercised on a cashless basis. The Share and Investor Warrant comprising each Unit are immediately separable and were issued separately.\nThe Offering was made on a Minimum basis, meaning a minimum amount of money must be raised. The minimum amount of $1,000,000 was raised effective April 14, 2022. Accordingly, we issued a total of 2,870,800 Units, consisting of 2,870,800 Shares and 1,435,400 Investor Warrants for gross proceeds to us of $1,004,780. Net proceeds after deducting commissions and fees were $849,302.\nOn May 3, 2022, the second closing of the PIPE occurred, pursuant to which we issued 1,187,572 Units, consisting of 1,187,572 shares of our common stock at $0.25 per Unit and warrants to purchase 593,786 shares of our common stock for which we received $415,650 in gross proceeds. Net proceeds after deducting commissions and fees were $374,085. As part of the second closing, we issued Laidlaw 608,755 warrants with an exercise price of $0.35 per share with a five-year cashless exercise.\nIn connection with the Offering, we paid Laidlaw & Company (UK) Ltd. (Laidlaw), our introducing broker, 10% of the proceeds, or $100,478 in cash, as a finder fee. At the second closing of the Offering, we are obligated to issue Laidlaw warrants equal to 10% of the Shares sold in the Offering, including any common stock issued or issuable. The Warrants will have an exercise price equal to the lowest price per share of the share of common stock issued or issuable to investors in the offering and will expire in five years. The Laidlaw warrants will include cashless exercise provisions.\nWe filed a Form S-1 on July 29, 2022 to register all shares issued and issuable pursuant to the PIPE and it became effective on August 9, 2022.\nPrevacus Option Agreement\nOn November 21, 2022, we entered into an Option to Purchase Intellectual Property Agreement (the Option Agreement) with Prevacus, Inc., which expired May 20, 2023. We had the option to purchase and acquire from Prevacus, free and clear of all encumbrances, 100% of Prevacus right, title, and interest in the worldwide and USPTO Patents to ONP-001 and one Enantiomer. As consideration, we issued Prevacus 1,000,000 shares of our common stock at $0.17 per share for a total value of $170,000 which was expensed as In-process research and development in fiscal 2023. The compensation that would have been paid to Prevacus for 100% of ONP-001 was 2,000,000 shares of our common stock and the consideration for the enantiomer would have been 1,000,000 shares of our common stock. The total purchase price would have been net of any equity paid to purchase the Option.\nCommon Stock Issued in Connection with Debt Financings\nAs discussed above in Note 6, we issued the following shares of our common stock in connection with debt financings during fiscal 2023 and 2022:\n· 200,000 shares in connection with Tysadco convertible debt financing with a fair value of $17,718;\n· 100,000 shares in connection with LGH convertible debt amendment with a fair value of $51,000;\n· 213,725 shares with a value of $13,443 issued to Carter Terry & Company, Inc. in connection with Mast Hill Fund, L.P. financing;\n· 1,500,000 shares upon the conversion by LGH of $300,000 of their outstanding convertible note;\n· 500,000 shares upon the conversion by ClearThink of $100,000 of their outstanding convertible note,\n· 300,000 shares upon the conversion by a consultant of $36,000 of their outstanding convertible note, and\n· 560,000 shares upon the conversion by Mast Hill of $40,250 accrued interest and $1,750 fees.\nNote 9. Income Taxes\nWe file income tax returns in the U.S. federal jurisdiction and the various states in which we operate. We registered with the Franchise Tax Board in the State of California in tax year 2020. Our tax returns are not currently under examination for any year. Our deferred tax assets consist of federal net operating loss carryforwards that expire through the year 2036. The deferred tax assets are net of a 100% valuation allowance as it is more likely than not at this time the deferred tax assets will not be realized within the carryforward period due to substantial uncertainty as to our ability to continue as a going concern (Note 1).\nThe following table reconciles the U.S. federal statutory rate to our effective tax rate:\nSchedule of effective income tax rate reconciliation\nFor the year ended July 31,\nUS federal statutory rates 21% 21%\nValuation allowance (21)% (21)%\nEffective tax rate 0% 0%\nOur tax provision (benefit) was as follows:\nSchedule of components of income tax expense (Benefit)\nFor the year ended July 31,\nCurrent deferred $ 485,300 $ 885,400\nIncrease in valuation allowance (485,300 ) (885,400 )\nTotal $ - $ -\nOur net deferred tax asset was as follows:\nSchedule of deferred tax assets and liabilities\nJuly 31,\nDeferred tax asset $ 2,960,400 $ 2,475,100\nValuation allowance (2,960,400 ) (2,475,100 )\nNet deferred tax asset $ - $ -\nAs of July 31, 2023, we had $13,745,873 of federal net operating loss carry forwards. These carry forwards, if not used, will begin to expire in 2039. Current or future ownership changes may severely limit the future realization of these net operating losses.\nWe provide for a valuation allowance when it is more likely than not that they will not realize a portion of the deferred tax assets. We established a valuation allowance against our net deferred tax asset due to the uncertainty that enough taxable income will be generated in those taxing jurisdictions to utilize the assets. Therefore, we have not reflected any benefit from such deferred tax assets in the accompanying financial statements.\nWe reviewed the issuance of stock to certain senior executives who received stock in conjunction with becoming an officer and director. In this case, as an officer and director of a publicly-traded company, the sale of shares could be subject to the short-swing profits rules of Securities Exchange Act Section 16(b) and is subject to a substantial risk of forfeiture per IRC § 83 (c)(3)(A). Given that such stock is subject to a substantial risk of forfeiture, such stock is treated as nonvested stock under IRC § 83. As the stock received was nonvested stock, income inclusion is deferred until the year in which the stock vests unless the employee makes an affirmative election to include income in the year of receipt.\nWe reviewed all income tax positions taken or that are expected to be taken for all open years and determined that our income tax positions are appropriately stated and supported for all open years. We are subject to U.S. federal income tax examinations by tax authorities for years after 2022 due to unexpired net operating loss carryforwards originating in and subsequent to that year. We may be subject to income tax examinations for the various taxing authorities which vary by jurisdiction. Our policy is to record interest and penalties associated with unrecognized tax benefits as additional income taxes in the statements of operations. As of July 31, 2023, there were no unrecognized tax benefits, or any tax related interest or penalties. We do not have any examinations ongoing. Tax returns for the years 2014 onwards are subject to federal, state or local examinations.\nNote 10. Related Party Transactions\nDue to Officers\nThe following amounts were due to our officers for reimbursement of expenses and were included in Accounts payable on our Consolidated Balance Sheets:\nSchedule of related party payables\nJuly 31,\nJoseph M. Redmond, CEO $ 668 $ 2,642\nChristine Farrell, CFO 1,633\n$ 2,301 $ 3,387\nThe amount of unpaid salary and bonus due to our officers was included in Accrued wages on our Consolidated Balance Sheets and was as follows:\nSchedule of accrued wages\nJuly 31,\nJoseph M. Redmond, CEO $ 935,831 $ 696,154\nChristine Farrell, CFO 257,771 124,617\n$ 1,193,602 $ 820,771\nOn January 31, 2022, the Compensation Committee and our full Board approved the 2021 bonus plan. Pursuant to the plan, Mr. Redmond received a $360,000 bonus and Ms. Farrell received a $40,000 bonus based upon meeting fund raising goals. The bonuses will be paid when funds are available and are included in the amounts disclosed in the above table.\nSee Note 6 for a discussion of $25,000 Promissory Notes payable to each of two officers and three directors.\nSee Note 7 for a discussion of RSUs and stock option grants to each of our four directors, two officers and Dr. VanLandingham.\nRelated Party Transaction\nOn March 1, 2021, as part of the Prevacus APA and Dr. VanLandinghams employment agreement, Dr. VanLandingham was granted 1,000,000 stock options with a fair market value of $941,000. 250,000 shares vested on signing of closing documents; 250,000 shares vest on Phase 1A first dosing of human, 250,000 shares vest on Phase 1B first dosing of human; and 250,000 shares vest upon us being accepted on NASDAQ. This amount is being expensed over the life of the awards and $37,872, and $295,845 was expensed to General and administrative in fiscal 2023 and 2022, respectively. As of July 31, 2023, $11,138 remained to be expensed in future periods.\nIn March, May and December 2021, November and December 2022 and January 2023, we entered into loans with Prevacus Inc. for a total of $25,192. The loans have an annual interest rate of 3% per annum. At July 31, 2023, accrued interest totaled $930 and to date the loans had not been repaid and continue to accrue interest.\nAt July 31, 2023, we have advanced Dr. VanLandingham $35,700, which is being repaid through payroll deductions.\nNote 11. Donation Received\nOn January 5, 2022, we received a donation in the amount of $500,000 in partnership with the Erase PTSD Now organization and the Glenn Greenberg and Linda Vester Foundation. These funds were recorded as Other income in our Statements of Operations and were used to progress the Phase I human clinical trials for drug candidate ONP-002 for the treatment of concussion. It was contemplated, a royalty of one-half of one percent be paid to Erase PTSD Now in perpetuity. At this time there is no agreement in place and the parties may or may not enter into an agreement in the future.\nNote 12. Research and Development Rebate due from Australian Government\nWe incurred expenses related to our Phase I clinical trial of our concussion drug device combination that are eligible for the Australian research and development rebate which were recorded as an offset to research and development expense as follows:\nSchedule of research and development rebate\nFor the year ended July 31,\nResearch and development expense offset $ 261,738 $ 538,135\nNote 13. Subsequent Events\nLPC\nSubsequent to July 31, 2023 and through October 30, 2023, we sold 500,000 shares of our common stock to LPC for total proceeds of $45,820. As of October 30, 2023, LPC had purchased a total of 7,882,518 shares of our common stock for total proceeds of $2,646,306 and the remaining purchase availability was $7,603,694 and the remaining shares available were 11,388,846.\nMast Hill\nOn August 7, 2023, pursuant to the SPA, Mast Hill converted a portion of their warrant exercisable for 2,000,000 shares of our common stock into 1,610,390 shares of our common stock at an exercise price of $0.075 per share. Following this conversion, 389,610 shares remained available pursuant to this warrant.\nNote Purchase Agreement\nOn August 15, 2023, we entered into a $500,000 Note Purchase Agreement (the NPA) with two accredited investors. Pursuant to the terms and conditions as set forth in the NPA (i) the note is due and payable in full on or after the later of August 15, 2024 or completion of a Senior Exchange Listing of, or a Spinout (Spinco) of, our ONP Technology, (ii) interest shall accrue at a rate of 12% per annum, (iii) the note is convertible at our option into shares of Spinco common stock at a price that is 70% of Spincos IPO price, and (iv) Common Stock Purchase Warrants which permit each investor to acquire a number of shares of common stock of Spinco equal to 200% of such investors original face amount of the loan divided by the IPO price of Spinco.\nLGH Promissory Note\nOn August 28, 2023, we paid LGH $30,000 of principal on their outstanding promissory note due December 31, 2023. Following this payment, $1,025,000 of principal remained outstanding.\nMast Hill Promissory Note\nOn September 13, 2023 we paid Mast Hill $100,000 of principal and $26,382 of interest on their outstanding promissory note due June 13, 2024. Following this payment, $820,000 of principal and no accrued interest remained due. On October 9, 2023, Mast Hill converted $47,653 together with $637 interest, and $1,750 for fees totaling $50,040 into 417,000 shares of common stock at a conversion price of $0.12 per share. Following this conversion, $727,451 of principal remained outstanding.\nOragenics, Inc.\nOn October 4, 2023, we entered into an Asset Purchase Agreement (the Purchase Agreement) with Oragenics, Inc. (Oragenics the Purchaser). Pursuant to the Purchase Agreement, the we have agreed to sell and assign, certain assets and certain liabilities related to a segment of Odysseys business focused on developing medical products that treat brain related illnesses and diseases (the Purchased Assets) to Oragenics in exchange for (i) $1,000,000 in cash and 8,000,000 shares of convertible Series F Preferred Stock (Series F Preferred Stock), on and subject to the terms and conditions set forth therein (such transaction, the Odyssey Asset Purchase). The Purchased Assets include drug candidates for treating mild traumatic brain injury (mTBI), also known as concussion, and for treating Niemann Pick Disease Type C (NPC), as well as our proprietary powder formulation and its nasal delivery device.\nWe received $500,000 upon the execution of the Purchase Agreement on October 4, 2023 and will receive the additional $500,000 upon the earlier of (a) the closing of the Purchase Agreement (the Closing), (b) within three (3) business days after the date that the Company has obtained the its stockholders approval approving the Odyssey Asset Purchase and (c) immediately upon the Purchasers wrongful termination of the Purchase Agreement in breach of the Purchase Agreement.\nThe closing of the Asset Purchase is expected to be at the end of the fourth calendar quarter of 2023, subject to the satisfaction of customary closing conditions, which include: (1) we shall have obtained all required consents to the Odyssey Asset Purchase; (2) We shall have obtained shareholder approval to the Asset Purchase; (3) the Oragenics shareholders shall have approved (a) the increase in the its authorized Common Stock from 4,166,666 to 350,000,000 and (b) the conversion of the Series F Preferred Stock into Common Stock; (4) no material adverse change shall have occurred to the Purchased Assets; (5) Oragenics must have at least $5,000,000 in cash at Closing; and (6) Oragenics must have completed its due diligence of the Purchased Assets to its satisfaction.\nAt the Closing, Oragenics will issue 8,000,000 shares of convertible Series F Preferred Stock to Odyssey, 1,592,000 of which will automatically convert into 1,592,0000 shares of Oragenics common stock, resulting in Odyssey holding 19.9% of Oragenics common stock. As of October 27, 2023, Oragenics common stock traded at $3.37 per share. At this price, the 8,000,000 shares of convertible Series F Preferred Stock would be valued at $27 million and the 19.9% 1,592,000 shares of Oragenics common stock would be valued at $5.4 million.\nThe remaining 6,408,000 shares of convertible Series F Preferred Stock will convert upon certain listing and change in control criteria being achieved.\nOTCQB\nOn October 4, 2023, we uplisted to the OTCQB Market.\nResignation of Director and Employment Matters\nOn October 5, 2023, John Gandolfo resigned as a director of the Company. On October 19, 2023, Mr. Gandolfo converted his convertible promissory note plus accrued interest into 238,792 shares of our common stock at an exercise price of $0.12 per share.\nOn October 26, 2023, Dr. VanLandingham separated his employment from the Company as Technical Lead and was engaged on a contractual basis to continue working on the ONP-002 concussion drug clinical research and development. At October 26, 2023, the Company owed Dr. VanLandingham $31,838 and his incentive stock options will continue to vest as long as he remains a consultant. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nManagement, with the participation of our Chief Executive Officer and Chief Accounting Officer, evaluated the effectiveness of our disclosure controls and procedures as of April 30, 2021. The term disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act), means controls and other procedures of a company that are designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the companys management, including its principal executive and principal financial officers, as appropriate to allow timely decisions regarding required disclosure. Management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving their objectives. Based on the evaluation of our disclosure controls and procedures as of July 31, 2023, our Chief Executive Officer and Chief Accounting Officer concluded that, as of such date, as a result of the material weaknesses in internal control over financial reporting that are described below in Managements Report on Internal Control Over Financial Reporting, our disclosure controls and procedures were not effective.\nManagement's Annual Report on Internal Control Over Financial Reporting\nIn light of the material weakness described below, as of July 31, 2023, prior to the filing of this Form 10-K for the period ended July 31, 2023, management determined that key controls were performed timely and additional procedures were performed, including validating the completeness and accuracy of the underlying data used to support the amounts reported in the financial statements. These control activities and additional procedures have allowed us to conclude that, notwithstanding the material weaknesses, the financial statements in this Form 10-K fairly present, in all material respects, our financial position, results of operations, statement of shareholder equity and cash flows for the periods presented in conformity with United States GAAP.\nWe are responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act.\nInternal control over financial reporting includes those policies and procedures that: (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of its management and directors; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nManagement recognizes that there are inherent limitations in the effectiveness of any system of internal control, and accordingly, even effective internal control can provide only reasonable assurance with respect to financial statement preparation and may not prevent or detect material misstatements. In addition, effective internal control at a point in time may become ineffective in future periods because of changes in conditions or due to deterioration in the degree of compliance with our established policies and procedures.\nA material weakness is a significant deficiency, or combination of significant deficiencies, that results in there being a more than remote likelihood that a material misstatement of the annual or interim financial statements will not be prevented or detected.\nUnder the supervision and with the participation of our president and chief financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting, as of July 31, 2023, based on the framework set forth in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in 2013. Based on our evaluation under this framework, we concluded that our internal control over financial reporting was not effective as of the evaluation date due to the factors stated below.\nInsufficient Resources: We have an inadequate number of personnel with requisite expertise in the key functional areas of finance and accounting.\nInadequate Segregation of Duties: We have an inadequate number of personnel to properly implement control procedures.\nWe are committed to improving the internal controls and will (1) continue to use third party specialists to address shortfalls in staffing and to assist us with accounting and finance responsibilities, (2) increase the frequency of independent reconciliations of significant accounts, which will mitigate the lack of segregation of duties until there are sufficient personnel, and (3) may consider appointing additional outside directors and audit committee members in the future.\nWe have discussed the material weakness noted above with our independent registered public accounting firm. Due to the nature of this material weakness, there is a more than remote likelihood that misstatements, which could be material to the annual or interim financial statements could occur that would not be prevented or detected.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Our report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only our report in this annual report.\nChanges in Internal Controls Over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during the quarter ended July 31, 2023, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nNot applicable.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nInformation required by this item will be included in our Proxy Statement for our 2023 Annual Meeting of Stockholders and, upon filing with the SEC within 120 days of July 31, 2023, is incorporated herein by reference. Item 11. Executive Compensation.\nInformation required by this item will be included in our Proxy Statement for our 2023 Annual Meeting of Stockholders and, upon filing with the SEC within 120 days of July 31, 2023, is incorporated herein by reference. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table provides information about our equity compensation plans as of July 31, 2023:\nPlan Category Number of securities\nto be issued upon exercise\nof outstanding options,\nwarrants and rights\n(a)\nWeighted average\nexercise price of\noutstanding options,\nwarrants and rights\n(b)\nNumber of securities\nremaining available for\nfuture issuance under\nequity compensation\nplans (excluding\nsecurities reflected in\ncolumn (a))\n(c)\nEquity compensation plans approved by security holders 9,250,000 (1) $ 0.40 -\nEquity compensation plans not approved by security holders 2,545,000 0.13 -\nTotal 11,795,000 $ 0.34 -\n(1) Does not include 3,055,554 Restricted Stock Units (RSUs) outstanding at July 31, 2023 at a weighted average grant date fair value of $0.14 per share.\nSee Note 7 of Notes to Financial Statements included in Part II, Item 8 of this Form 10-K.\nThe additional information required by this item will be included in our Proxy Statement for our 2023 Annual Meeting of Stockholders and, upon filing with the SEC within 120 days of July 31, 2023, is incorporated herein by reference. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nInformation required by this item will be included in our Proxy Statement for our 2023 Annual Meeting of Stockholders and, upon filing with the SEC within 120 days of July 31, 2023, is incorporated herein by reference. Item 14. Principal Accounting Fees and Services.\nInformation required by this item will be included in our Proxy Statement for our 2023 Annual Meeting of Stockholders and, upon filing with the SEC within 120 days of July 31, 2023, is incorporated herein by reference.\nPART IV Item 15. Exhibits and Financial Statement Schedules\nFinancial Statements and Schedules\nThe Financial Statements, together with the report thereon by Turner, Stone & Company, L.L.P., Independent Registered Public Accounting Firm, are included on the pages indicated below:\nReport of Independent Registered Public Accounting Firm\nBalance Sheets as of July 31, 2023 and 2022\nStatements of Operations for the Years Ended July 31, 2023 and 2022\nStatements of Stockholders Deficit for the Years Ended July 31, 2023 and 2022\nStatements of Cash Flows for the Years Ended July 31, 2023 and 2022\nNotes to Financial Statements\nThere are no schedules required to be filed herewith.\nExhibits\nThe following list is intended to constitute the exhibit index.\nEXHIBIT INDEX\nExhibit Number\nExhibit Description\n3.1\nArticles of Incorporation of Odyssey Group International, Inc. (incorporated by reference to Exhibit 3.1 to the Companys Registration Statement on Form S-1 filed on December 8, 2014).*\n3.2\nBylaws of Odyssey Group International, Inc. (incorporated by reference to Exhibit 3.2 to the Companys Registration Statement on Form S-1 filed on December 8, 2014).*\n10.1\nForm of Odyssey Group International, Inc. Subscription Agreement for Common Stock (incorporated by reference to Exhibit 10.1 to the Companys Amendment No. 2 of the Registration Statement on Form S-1/A filed on February 26, 2015).*\n10.3\nEmployment Agreement, dated January 21, 2021 by and between Odyssey Group International, Inc. and Joseph Michael Redmond (incorporated by reference to Exhibit 10.1 to Form 8-K filed on January 26, 2021).*, ***\n10.4\nEmployment Agreement, dated January 21, 2021 by and between Odyssey Group International, Inc. and Christine M. Farrell (incorporated by reference to Exhibit 10.2 to Form 8-K filed on January 26, 2021).*, ***\n10.5\nEmployment Agreement dated November 1, 2022 by and between Odyssey Group International, Inc. and Erik Emerson (incorporated by reference to Exhibit 10.1 to Form 8-K filed on November 4, 2022). *, ***\n10.6\nEmployment Agreement by and between Odyssey Group International, Inc. and Gregory W. Gironda, dated November 1, 2022 (incorporated by reference to Exhibit 10.2 to Form 8-K filed on November 4, 2022). *, ***\n10.7\nLicense Transfer Agreement, effective as of January 31, 2019, by and between Odyssey Group International, Inc. and Electromedica, LLC (incorporated by reference to Exhibit 10.5 to Form S-1 filed on November 23, 2020).*\n10.8\nMaster Agreement for a Joint Venture and Intellectual Property Purchase Agreement, effective as of June 26, 2019, by and among Odyssey Group International, Inc. and Prevacus, Inc. (incorporated by reference to Exhibit 10.6 to Form S-1 filed on November 23, 2020).*\n10.7\nIntellectual Property Purchase Agreement, effective as of June 26, 2019, by and among Odyssey Group International, Inc., James De Luca and Murdock Capital Partners (incorporated by reference to Exhibit 10.7 to the Form S-1 filed on November 23, 2020).*\n10.11\nForm of Common Stock Purchase Warrant totaling 550,000 Shares of Common Stock of Odyssey Group International, Inc. issued to Alliance Global Partners, Alejandro Barrientos and David Bocchi, effective August 6, 2020 (incorporated by reference to Exhibit 10.10 to Form S-1 filed November 23, 2020).*\n10.12\nSecurities Purchase Agreement, dated August 14, 2020, by and between Odyssey Group International, Inc. and Labrys Fund, LP (incorporated by reference to Exhibit 10.1 to Form 8-K filed on August 14, 2020).*\n10.13\n12% Self-Amortization Promissory Note issued to Labrys Fund, LP on August 14, 2020 (incorporated by reference to Exhibit 10.2 to Form 8-K filed on August 14, 2020).*\n10.14\nPurchase Agreement, dated August 14, 2020, by and between Odyssey Group International, Inc. and Lincoln Park Capital Fund, LLC (incorporated by reference to Exhibit 10.1 to Form 8-K filed on August 17, 2020).*\n10.15\nRegistration Rights Agreement, dated August 14, 2020, by and between Odyssey Group International, Inc. and Lincoln Park Capital Fund, LLC (incorporated by reference to Exhibit 10.2 to Form 8-K filed on August 17, 2020).*\n10.16\nAmendment No. 1 to Purchase Agreement, dated August 14, 2020, by and between Odyssey Group International, Inc. and Lincoln Park Capital fund, LLC (incorporated by reference to Exhibit 10.2 to Form 8-K filed on November 19, 2020).*\n10.17\nSecurities Purchase Agreement with LGH Investments, LLC. (incorporated by reference to Exhibit 4.1 to Form 8-K filed on December 15, 2020).*\n10.18\nPrevacus Asset Agreement. (incorporated by reference to Exhibit 10.5 to Form 8-K filed on January 8, 2021).*\n10.19\nAmendment No. 1 to the Warrant Agreement, dated December 11, 2020, by and between Odyssey Group International, Inc. and LGH Investments, LLC. (incorporated by reference to Exhibit 10.1 to Form 8-K filed on January 28, 2021).*\n10.20\nSecurities Purchase Agreement with LGH Investments, LLC.(incorporated by reference to Exhibit 10.1 to Form 8-K filed on April 7, 2021).*\n10.21\nLGH Investments, LLC Settlement Agreement (incorporated by reference to Exhibit 10.3 to Form 10-Q filed on June 21, 2021).*\n10.22\nSecurities Purchase Agreement, dated October 18, 2021 by and between Odyssey Group International, Inc. and Tysadco Partners LLC. (incorporated by reference to Exhibit 10.1 to Form 8-K filed on September 1, 2021).*\n10.23\nSecurities Purchase Agreement, dated October 18, 2021 by and between Odyssey Group International, Inc. and Tysadco Partners LLC (incorporated by reference to Exhibit 10.1 to Form 8-K filed on October 21, 2021).*\n10.24\nWarrant, dated October 18, 2021 issued to Tysadco Partners LLC. (incorporated by reference to Exhibit 10.2 Form 8-K filed on October 21, 2021).*\n10.25\nAmended Securities Purchase Agreement, dated October 18, 2021 by and between Odyssey Group International, Inc. and Tysadco Partners LLC. (incorporated by reference to Exhibit 10.2 to Form 8-K/A filed on October 26, 2021).*\n10.26\nSecurities Purchase Agreement, dated October 22, 2021 by and between Odyssey Group International, Inc. and Lincoln Park Capital, LLC. (incorporated by reference to Exhibit 10.1 to Form 8-K filed on October 26, 2021).*\n10.27\nWarrant dated October 22, 2021 issued to Lincoln Park Capital, LLC. (incorporated by reference to Exhibit 10.2 to Form 8-K filed on October 26, 2021).*\n10.28\nForm of Subscription Agreement dated April 14, 2022 between Odyssey Health, Inc. and certain purchasing security holders (incorporated by reference to Exhibit 10.1 to Form 10-Q filed on June 14, 2022).*\n10.29\nForm of Stock Purchase Agreement dated April 14, 2022 between Odyssey Health, Inc. and certain purchasing security holders (incorporated by reference to Exhibit 10.2 to Form 10-Q filed on June 14, 2022).*\n10.30\nForm of Warrant Agreement dated April 14, 2022 between Odyssey Health, Inc. and certain purchasing security holders (incorporated by reference to Exhibit 10.3 to Form 10-Q filed on June 14, 2022).*\n10.31\nForm of Registration Rights Agreement dated April 14, 2022 between Odyssey Health, Inc. and certain purchasing security holders (incorporated by reference to Exhibit 10.4 to Form 10-Q filed on June 14, 2022).*\n10.32\nForm of Promissory Note dated December 2021 between Odyssey Group International, Inc. and various officers and directors (incorporated by reference to Form 8-K filed on December 27, 2021). *, ***\n10.33\nForm of Amendment to Promissory Note dated April 20, 2022 between Odyssey Health, Inc. and various officers and directors (incorporated by reference to Exhibit 10.5 to Form 10-Q filed on June 14, 2022).*, ***\n10.34\nForm of Amendment to Promissory Note dated June 4, 2022 between Odyssey Health, Inc. and various officers and directors (incorporated by reference to Exhibit 10.8 to Form 10-Q filed on June 14, 2022).* ***\n10.35\nForm of Amendment No. 4 dated December 30, 2022 to Promissory Note with Directors and Officers dated December 21, 2021 (incorporated by reference to Exhibit 10.2 to Form 8-K filed on January 3, 2023).*, ***\n10.36\nForm of Amendment No. 5 dated March 31, 2023 to Promissory Note with Directors and Officers dated December 21, 2021 (incorporated by reference to Exhibit 10.2 to Form 8-K filed on April 4, 2023).*, ***\n10.37\nForm of Amendment No. 6 dated June 30, 2023 to Promissory Note with Directors and Officers dated December 21, 2021 (incorporated by reference to Exhibit 10.1 to Form 8-K filed on July 7, 2023).*, ***\n10.38\nConvertible Promissory Note dated August 29, 2021 with Tysadco Partners, LLC**\n10.39\nAmendment to Convertible Promissory Note dated March 31, 2022 between Odyssey Health, Inc. and Tysadco Partners, LLC (incorporated by reference to Exhibit 10.1 to Form 8-K filed on April 14, 2022).*\n10.40\nSecond Amendment and Assignment to Convertible Promissory Note dated March 14, 2023 to Promissory Note dated August 29, 2021 with Tysadco Partners, LLC (incorporated by reference to Exhibit 10.5 to Form 10-Q filed on March 17, 2023).*\n10.41\nAmendment to Convertible Promissory Note dated February 1, 2022 between Odyssey Health, Inc. and LGH Investments, LLC (incorporated by reference to Exhibit 10.1 to Form 8-K filed on February 18, 2022).*\n10.42\nAmendment No. 1 to Convertible Promissory Note with LGH Investments, LLC dated February 15, 2022 (incorporated by reference to Form 8-K filed on February 18, 2022).*\n10.43\nAmendment to Convertible Promissory Note dated June 10, 2022 between Odyssey Health, Inc. and LGH Investments, LLC (incorporated by reference to Exhibit 10.9 to Form 10-Q filed on June 14, 2022).*\n10.44\nAmendment No. 3 to Convertible Promissory Note dated September 29, 2022 between Odyssey Health, Inc. and LGH Investments, LLC (incorporated by reference to Form 8-K filed on October 3, 2022).*\n10.45\nAmendment No. 4 dated December 29, 2022 to Convertible Promissory Note with LGH Investments, LLC dated April 5, 2021 (incorporated by reference to Exhibit 10.1 to Form 8-K filed on January 3, 2023.)*\n10.46\nAmendment No. 5 to Convertible Promissory Note dated March 31, 2023 between Odyssey Health, Inc. and LGH Investments LLC (incorporated by reference to Exhibit 10.1 to Form 8-K filed on April 4, 2023).\n10.47\nAmendment No. 6 to Convertible Promissory Note dated July 6, 2023 between Odyssey Health, Inc. and LGH Investments LLC (incorporated by reference to Exhibit 10.2 to Form 8-K filed on July 7, 2023).\n10.48\nOption to Purchase Intellectual Property Agreement by and between Prevacus, Inc. and Odyssey Health, Inc. (incorporated by reference to Exhibit 10.1 to Form 8-K filed on November 23, 2022).*\n10.49\nPromissory Note with accredited investor Jonathan Lutz, dated September 21, 2022**\n10.50\nAmendment No. 1 dated December 30, 2022 to Promissory Note with accredited investor Jonathan Lutz, dated September 21, 2022 (incorporated by reference to Exhibit 10.3 to Form 8-K filed on January 3, 2023).*\n10.51\nAmendment No. 2 dated January 31, 2023 to Promissory Note with accredited investor Jonathan Lutz, dated September 21, 2022 (incorporated by reference to Exhibit 10.4 to Form 10-Q filed on March 17, 2023).\n14.1\nOdyssey Group International, Inc. Code of Ethics (incorporated by reference to Exhibit 14 to Form 10-K filed on October 23, 2019).*\n23.1\nConsent of Turner, Stone and Company, LLP**\n31.1\nRule 13(a)-14(a)/15(d)-14(a) Certification of Chief Executive Officer**\n31.2\nRule 13(a)-14(a)/15(d)-14(a) Certification of Chief Financial Officer **\n32.1\nSection 1350 Certification of Chief Executive Officer **\n32.2\nSection 1350 Certification of Chief Financial Officer **\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)**\n101.SCH\nInline XBRL Taxonomy Extension Schema Document**\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document**\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document**\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document**\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document **\nCover Page Interactive Data File (formatted in inline XBRL, and included in exhibit 101) **\nPreviously furnished.\n* Previously filed.\n** Filed herewith.\n*** Indicates a management contract or compensatory plan or arrangement.\nItem 16. Form 10-K Summary.\nNone\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized, as of October 30, 2023.\nODYSSEY HEALTH, INC.\nBy: /s/ Joseph Michael Redmond\nJoseph Michael Redmond\nChief Executive Officer, President and Director\n(Principal Executive Officer)\nIn accordance with the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Joseph Michael Redmond\nChief Executive Officer, President, Director\nOctober 30, 2023\nJoseph Michael Redmond\n(Principal Executive Officer)\n/s/ Christine M. Farrell\nChief Financial Officer and Secretary\nOctober 30, 2023\nChristine M. Farrell\n(Principal Financial and Accounting Officer)\n/s/ Jerome Casey\nDirector\nOctober 30, 2023\nJerome Casey\n/s/ Ricky W. Richardson\nDirector\nOctober 30, 2023\nRicky W. Richardson"
}