{
    "cik": "1627041",
    "company": "VISIBER57 CORP.",
    "filing_type": "10-K",
    "filing_date": "2022-12-16",
    "period_of_report": "2022-08-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "F5",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1627041/0001493152-22-035659-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1627041/000149315222035659/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1627041/0001493152-22-035659.txt",
    "filename": "1627041_10K_2022_0001493152-22-035659.htm",
    "content": "Item 1. Business\nOverview and Corporate History\nVISIBER57 CORP. (the Company) formerly eBizware, Inc., a Delaware corporation, was formed on December 31, 2013. The Company was headquartered at Unit B19, 9/F, Efficiency House, 35 Tai Yau Street, San Po Kong, Kowloon, Hong Kong. The Company was engaged in the electronic management and appointment of licensed producers in the insurance industry of the United States. On August 5, 2021, the Company relocated its headquarter to No. 104-2F, Section 1, Yanping North Road, Datong District, Taipei City 10341, Taiwan.\nOn August 12, 2016, in connection with the sale of a controlling interest in the Company, Mark W. DeFoor (the Seller), the Companys then Chief Executive Officer and Director entered into and closed on that certain Share Purchase Agreement (the Agreement) with 57 Society International Limited, (57 Society), a Hong Kong company, whereby 57 Society purchased from the Seller a total of 5,000,000 shares of the Companys common stock (the Shares) for an aggregate price of $321,000. The Shares acquired represented approximately 94.70% of the issued and outstanding shares of common stock of the Company. Following the closing of the Agreement, Mark W. DeFoor resigned from all positions held of the Company and Choong Jeng Hew was appointed as the Chief Executive Officer and President of the Company. The Company then ceased its activities in the electronic management and appointment of licensed producers in the insurance industry and abandoned that business model.\nOn March 23, 2017, the Company filed a Certificate of Amendment to its Certificate of Incorporation with the Delaware Secretary of State to change its name from eBizware, Inc. to VISIBER57 CORP. and its trading symbol to VCOR with an effective date of April 11, 2017. The Company is currently seeking new business opportunities or acquisitions.\nOn September 18, 2019, the Company filed a Certificate of Amendment to its Certificate of Incorporation with the Delaware Secretary of State to implement a 2.5-for-1 forward stock split (the Forward Stock Split) of the Companys issued and outstanding common stock, which became effective on November 8, 2019. Each one (1) share owned by a stockholder was exchanged for two-and-one-half (2.5) shares of common stock, and the number of shares of the Companys common stock issued and outstanding was increased proportionately based on the Forward Stock Split. The number of authorized shares was not adjusted.\nOn February 20, 2020, 57 Society International Ltd. transferred 5,587,000 shares of the Companys common stock to individual shareholders. The ownership of 57 Society International Ltd. decreased from 94.70% to 52.37%.\nOn June 7, 2021, the Companys Board of Directors has authorized the Company to create a new series of one share of preferred stock designated the Series A Preferred Stock at par value of $0.0001 per share. The voting power of each share of Series A Preferred Stock is equal to 110% of the issued and outstanding shares of common stock of the Company. Each share of Series A Preferred Stock shall be convertible into one fully paid and non-assessable share of common stock at the option of the holder. On June 8, 2021, 57 Society International Ltd. had completed the transfer of 6,200,000 shares of common stock to the Company. The ownership of 57 Society International Ltd. decreased from 52.37% to 10.19%. On July 8, 2021, the Company and 57 Society International Ltd. entered into a stock purchase agreement. Pursuant to the agreement, the Company issued one share of Series A Preferred Stock to 57 Society International Ltd.in consideration of the return of 6,200,000 shares of common stock.\nOur Business\nThe Company was engaged in the electronic management and appointment of licensed producers in the insurance industry of the United States. In connection with the Companys plan to expand its business and rebrand its identity, the Company changed its name to VISIBER57 CORP. and its trading symbol to VCOR effective April 11, 2017. The Company is currently seeking new business opportunities or acquisitions including the exploration of acquiring, developing and launching a cloud-based APP that utilizes a predictive algorithm to foster closely knitted communities made up of individuals, families and businesses from a diverse background.\nNo timetable has been set to accomplish our business objectives and we do not presently have any firm commitment from any third parties to acquire or develop this business or raise the capital needed upon terms acceptable to us. When we commence this implementation and secure financing, we will identify our plan of operations, a marketing strategy, opportunities and competition.\nEmployees\nAt August 31, 2022 we had no full-time employees. None of our employees are covered by collective bargaining agreements.\nAvailable Information\nWe do not have a corporate website. The public may read and copy any materials that we file with the SEC at the SECs Public Reference Room at 100 F Street, NE, Washington, D.C. 20549. The public may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The address of that site is www.sec.gov. Item 1A. Risk Factors.\nNot applicable to a smaller reporting company. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties\nOur principal executive offices are located at No. 104-2F, Section 1, Yanping North Road, Datong District, Taipei City 10341, Taiwan which we share with our controlling shareholder 57 Society International Limited (57 Society) are furnished to us by 57 Society without charge. When we commence implementation of our business objectives, we will begin searching for additional office space to accommodate planned future growth. Item 3. Legal Proceedings\nFrom time to time we may become involved in various legal proceedings that arise in the ordinary course of business, including actions related to our intellectual property. Although the outcomes of these legal proceedings cannot be predicted with certainty, we are currently not aware of any such legal proceedings or claims that we believe, either individually or in the aggregate, will have a material adverse effect on our business, financial condition, or results of operations. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock is quoted on the OTCQB tier of the OTC Markets Group, Inc. and has been quoted under the symbol VCOR since July 2016. Our stock is thinly traded on the OTCQB and there can be no assurance that a liquid market for our common stock will ever develop.\nThe following table reflects the high and low closing sales information for our common stock for each fiscal quarter during the fiscal years ended August 31, 2022 and 2021. This information was obtained from the OTCQB, adjusted to reflect the 2.5-for-1 split of our common stock effected on September 18, 2019, and reflects inter-dealer prices without retail mark-up, markdown or commission and may not necessarily represent actual transactions.\nQuarter Ended High Low\nFiscal Year 2022\nAugust 31, 2022 $ 1 $ 1\nMay 31, 2022 $ 1 $ 1\nFebruary 28, 2022 $ 1 $ 1\nNovember 30, 2021 $ 1 $ 1\nFiscal Year 2021\nAugust 31, 2021 $ 1 $ 1\nMay 31, 2021 $ 1 $ 1\nFebruary 28, 2021 $ 1 $ 1\nNovember 30, 2020 $ 1 $ 1\nSecurity Holders\nAs of December 16, 2022, there were approximately 68 record holders, an unknown number of additional holders whose stock is held in street name and 7,000,000 shares of common stock issued and outstanding.\nAuthorized Capital Stock\nWe are authorized to issue 425,000,000 shares of common stock, par value $0.0001, 75,000,000 shares of preferred stock, par value $0.0001 and 1 share of Series A preferred stock, par value $0.0001. As of December 16, 2022, there were 7,000,000 shares of common stock issued and outstanding, no shares of preferred stock issued and outstanding and 1 share of series A preferred stock issued and outstanding.\nDividend Policy\nWe have never paid a cash dividend on our common stock. We currently intend to retain all earnings, if any, to finance the growth and development of our business. We do not anticipate paying any cash dividends in the foreseeable future.\nEquity Compensation Plans\nNone.\nRecent Sales of Unregistered Securities\nNone. Item 6 - Selected Financial Data\nNot applicable. Item 7. Managements Discussion and Analysis of Financial Conditions and Results of Operations\nThe following discussion of our financial condition and results of operations should be read in conjunction with our financial statements and associated notes appearing elsewhere in this Report on Form 10-K. This discussion contains forward-looking statements based upon current expectations that involve risks and uncertainties. See Cautionary Note Regarding Forward-Looking Statements. Our actual results may differ materially from those contained in or implied by any forward-looking statements as a result of various factors.\nCompany Overview\nVISIBER57 CORP. (the Company), formerly eBizware, Inc., a Delaware corporation, was formed on December 31, 2013. The Company was headquartered at Unit B19, 9/F, Efficiency House, 35 Tai Yau Street, San Po Kong, Kowloon, Hong Kong. The Company was engaged in the electronic management and appointment of licensed producers in the insurance industry of the United States. On August 5, 2021, the Company relocated its headquarter to No. 104-2F, Section 1, Yanping North Road, Datong District, Taipei City 10341, Taiwan.\nOn August 12, 2016, in connection with the sale of a controlling interest in the Company, Mark W. DeFoor, the Companys former Chief Executive Officer and Director, entered into and closed on that certain Share Purchase Agreement with 57 Society, whereby 57 Society purchased from Mr. DeFoor a total of 5,000,000 shares of the Companys common stock for an aggregate price of $321,000. The shares acquired represented approximately 94.70% of the issued and outstanding shares of common stock of the Company. Following the closing of the Agreement, Mark W. DeFoor resigned from all positions held of the Company and Choong Jeng Hew was appointed as the Chief Executive Officer and President of the Company. The Company then ceased its activities in the electronic management and appointment of licensed producers in the insurance industry and abandoned that business model.\nOn March 23, 2017, the Company filed a Certificate of Amendment to its Certificate of Incorporation with the Delaware Secretary of State to change its name from eBizware, Inc. to VISIBER57 CORP. and its trading symbol to VCOR with an effective date of April 11, 2017. The Company is currently seeking new business opportunities or acquisitions including the exploration of acquiring, developing and launching a cloud-based application (APP) that utilizes a predictive algorithm to foster closely knitted communities made up of individuals, families and businesses from a diverse background.\nOn September 18, 2019, the Company filed a Certificate of Amendment to its Certificate of Incorporation with the Delaware Secretary of State to implement a 2.5-for-1 forward stock split (the Forward Stock Split) of the Companys issued and outstanding common stock, which became effective on November 8, 2019. Each one (1) share owned by a stockholder was exchanged for two-and-one-half (2.5) shares of common stock, and the number of shares of the Companys common stock issued and outstanding was increased proportionately based on the Forward Stock Split. The number of authorized shares was not adjusted. All issued and outstanding shares and per share amounts in the accompanying historical financial statements have been retroactively adjusted to reflect the Forward Stock Split.\nOn February 20, 2020, 57 Society International Ltd. transferred 5,587,000 shares of the Companys common stock to individual shareholders. The ownership of 57 Society International Ltd. decreased from 94.70% to 52.37%.\nOn June 7, 2021, the Companys Board of Directors has authorized the Company to create a new series of one share of preferred stock designated the Series A Preferred Stock at par value of $0.0001 per share. The voting power of each share of Series A Preferred Stock is equal to 110% of the issued and outstanding shares of common stock of the Company. Each share of Series A Preferred Stock shall be convertible into one fully paid and non-assessable share of common stock at the option of the holder. On June 8, 2021, 57 Society International Ltd. had completed the transfer of 6,200,000 shares of common stock to the Company. The ownership of 57 Society International Ltd. decreased from 52.37% to 10.19%. On July 8, 2021, the Company and 57 Society International Ltd. entered into a stock purchase agreement. Pursuant to the agreement, the Company issued one share of Series A Preferred Stock to 57 Society International Ltd. in consideration of the return of 6,200,000 shares of common stock.\nNo timetable has been set to accomplish our business objectives and we do not presently have any firm commitment from any third parties to acquire or develop this business or raise the capital needed upon terms acceptable to us. When we commence this implementation and secure financing, we will identify our plan of operations, a marketing strategy, opportunities and competition.\nResults of Operations\nThe following comparative analysis on results of operations was based primarily on the comparative audited financial statements, footnotes and related information for the periods identified below and should be read in conjunction with the financial statements and the notes to those statements that are included elsewhere in this report.\nRevenue:\nWe did not generate revenues for the fiscal years ended August 31, 2022 and 2021.\nTotal Operating Expenses:\nWe incurred operating expenses for the year ended August 31, 2022, in the amount of $45,325 compared to $36,415 for the year ended August 31, 2021, an increase of $8,910 or 24.47%. The increase was attributable to an increase in professional fees of $6,443 or 36.28%, primarily due to increase in auditing fee.\nNet Loss:\nWe incurred losses for the fiscal years ended August 31, 2022 and 2021, in the amounts of $45,325 compared to $36,415, respectively.\nLiquidity and Capital Resources\nLiquidity is the ability of an enterprise to generate adequate amounts of cash to meet its needs for cash requirements. As of August 31, 2022, working capital deficit amounted to $350,698, an increase of $45,325 of working capital deficit as compared to working capital of $305,373, as of August 31, 2021. This increase in working capital deficit is primarily a result of an increase in the current liability account due to related party of $42,763.\nProperty and Equipment\nThe Company currently owns no equipment.\nIn 2022 and 2021, the Company did not issue any shares of common stock.\nBalance Sheet Data August 31, 2022 August 31, 2021\nCash $ - $ -\nTotal Assets $ 1,623 $ 1,247\nTotal Liabilities $ 352,321 $ 306,620\nShareholders Deficit $ (350,698 ) $ (305,373 )\nDuring the fiscal years ended August 31, 2022 and 2021, 57 Society, a company under the common control of Choong Jeng Hew, the Companys Chief Executive Officer, paid $41,140 and $36,427 of operating expenses, respectively, and made $1,623 and $1,248 of prepayment on behalf of the Company, respectively. As of August 31, 2022 and 2021, we had an outstanding payable to 57 Society in the amount of $346,441 and $303,678, respectively, an increase of $42,763. The payable is unsecured, does not bear interest and is due on demand.\nFor the fiscal years ended August 31, 2022 and 2021, net cash used in operating activities were both $0.\nFor the fiscal years ended August 31, 2022 and 2021, net cash provided by financing activities were both $0.\nWe do not have sufficient resources to effectuate our business plan. We will have to raise additional funds to pay for all of our planned expenses. We potentially will have to issue additional debt or equity, or enter into a strategic arrangement with a third party to carry out some aspects of our business plan. There can be no assurance that additional capital will be available to us. We currently have no agreements, arrangements or understandings with any person to obtain funds through bank loans, lines of credit or any other sources. Since we have no other such arrangements or plans currently in effect, our inability to raise funds for the above purposes will have a severe negative impact on our ability to remain a viable company. We are dependent upon our controlling shareholders to provide or loan us funds to meet our working capital needs.\nGoing Concern\nOur financial statements have been prepared assuming that we will continue as a going concern, which contemplates, among other things, the realization of assets and the satisfaction of liabilities in the normal course of business. As reflected in the accompanying financial statements, we had a net loss of $45,325 and $36,415 for the fiscal years ended August 31, 2022 and 2021, respectively. The working capital deficit was $350,698 as of August 31, 2022. These factors raise substantial doubt about the Companys ability to continue as a going concern. Management cannot provide assurance that the Company will ultimately achieve profitable operations or become cash flow positive, or raise additional debt and/or equity capital. The Company is seeking to raise capital through additional debt and/or equity financings to fund its operations in the future. Although the Company has historically raised capital from sales of equity, from related party working capital advances, and from the issuance of promissory notes, there is no assurance that it will be able to continue to do so. If the Company is unable to raise additional capital or secure additional lending in the near future, management expects that the Company will need to curtail its operations. These financial statements do not include any adjustments related to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nIn the opinion of our independent registered public accounting firm for our fiscal year end August 31, 2022, our auditor included a statement that as a result of our accumulated deficit at August 31, 2022, our net loss and net cash used in operating activities for the reporting period then ended, there is a substantial doubt as our ability to continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nInflation\nIn the opinion of management, inflation has not and will not have a material effect on our operations in the immediate future. Management will continue to monitor inflation and evaluate the possible future effects of inflation on our business and operations.\nOff-Balance Sheet Arrangements\nUnder SEC regulations, we are required to disclose our off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, such as changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. As of August 31, 2022, we have no off-balance sheet arrangements.\nCritical Accounting Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nEffect of Recently Issued Accounting Pronouncements\nThere were various other updates recently issued, most of which represented technical corrections to the accounting literature or application to specific industries. None of the updates are expected to a have a material impact on our financial position, results of operations or cash flows. Item 7A. Qualitative and Quantitative Disclosures About Market Risk\nNot applicable. Item 8. Financial Statements and Supplementary Data\nThe Companys financial statements, together with the report of the independent registered public accounting firm thereon and the notes thereto, are presented beginning at page. The Companys balance sheets as of August 31, 2022 and 2021 and the related statements of operations, changes in stockholders deficit and cash flows for the fiscal years then ended have been audited by MaloneBailey, LLP, which is an independent registered public accounting firm. These financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America and pursuant to Regulation S-K as promulgated by the Securities and Exchange Commission and are included herein pursuant to Part II, Item 8 of this Form 10-K. The financial statements have been prepared assuming the Company will continue as a going concern. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act that are designed to ensure that information required to be disclosed by us in reports that we file under the Exchange Act is recorded, processed, summarized and reported as specified in the SECs rules and forms and that such information required to be disclosed by us in reports that we file under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure. Management, with the participation of our Chief Executive Officer and Chief Financial Officer, performed an evaluation of the effectiveness of our disclosure controls and procedures as of August 31, 2022. Based on that evaluation, our management, including our Chief Executive Officer and Chief Financial Officer, concluded that our disclosure controls and procedures were not effective as of August 31, 2022 for the reasons discussed below.\nManagements Annual Report on Internal Control over Financial Reporting\nManagement is responsible for the preparation of our financial statements and related information. Management uses its best judgment to ensure that the financial statements present fairly, in material respects, our financial position and results of operations in conformity with generally accepted accounting principles.\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as defined in the Exchange Act. These internal controls are designed to provide reasonable assurance that the reported financial information is presented fairly, that disclosures are adequate and that the judgments inherent in the preparation of financial statements are reasonable. There are inherent limitations in the effectiveness of any system of internal controls including the possibility of human error and overriding of controls. Consequently, an ineffective internal control system can only provide reasonable, not absolute, assurance with respect to reporting financial information.\nOur internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that, in reasonable detail, accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements in accordance with generally accepted accounting principles and that the receipts and expenditures of company assets are made in accordance with our management and directors authorization; and (iii) provide reasonable assurance regarding the prevention of or timely detection of unauthorized acquisition, use or disposition of assets that could have a material effect on our financial statements.\nUnder the supervision of management, including our Chief Executive Officer and our Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and subsequent guidance prepared by the Commission specifically for smaller public companies. Based on that evaluation, our management concluded that our internal control over financial reporting was not effective as of August 31, 2022 because it identified the following material weaknesses:\n1) We do not have an Audit Committee.\n2) We did not maintain appropriate segregation of duties.\n3) We have not implemented policies and procedures that provide for multiple levels of supervision and review.\n4) The Company does not have well-established procedures to authorize and approve related party transactions.\nA material weakness is a deficiency or a combination of deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the annual or interim consolidated financial statements will not be prevented or detected on a timely basis.\nWe expect to be materially dependent upon third parties to provide us with accounting consulting services for the foreseeable future which we believe mitigates the impact of the material weaknesses discussed above. Until such time as we have a chief financial officer with the requisite expertise in U.S. GAAP and establish an audit committee and implement internal controls and procedures, there are no assurances that the material weaknesses and significant deficiencies in our disclosure controls and procedures will not result in errors in our financial statements which could lead to a restatement of those financial statements.\nOur management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal controls will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our company have been detected.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the companys registered public accounting firm pursuant to SEC rules that permit us to provide only managements report on internal control over financial reporting in this annual report on Form 10-K.\nChanges in Internal Controls over Financial Reporting\nThere have been no changes in our internal control over financial reporting during the quarter ended August 31, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nThe following table and biographical summaries set forth information, including principal occupation and business experience, about our directors and executive officers as of December 16, 2022. There are no family relationships between any of the executive officers and directors of the Company.\nName\nAge\nPositions and Offices to be Held\nChoong Jeng Hew\nChief Executive Officer, President and Director\nChip Jin Eng\nChief Financial Officer, Treasurer, Secretary and Director\nOur directors are appointed for a one-year term to hold office until the next annual general meeting of our shareholders or until removed from office in accordance with our bylaws. Our officers are appointed by our board of directors and hold office until removed by the board. All officers and directors listed above will remain in office until the next annual meeting of our stockholders, and until their successors have been duly elected and qualified. There are no agreements with respect to the election of Directors. Our Board of Directors appoints officers annually and each Executive Officer serves at the discretion of our Board of Directors.\nThe following is a brief description of the background on our recently appointed officer and director.\nChoong Jeng Hew, age 54, has served as our Chief Executive Officer, President and member of our Board of Directors since August 12, 2016. Mr. Hew currently serves as the Chief Executive Officer of 57 Society and VISIBER Group of Companies, where he oversees their overall daily operations as well as strategic development. Prior to joining the Company, Mr. Hew worked at General Electric Information Services from 1992 to 1993, SITA/SCITOR from 1993 to 1994, Oracle Malaysia from 1997 to 1998 and Health Communication Network (HCN) from 1991 to 2001, where he had roles that included information technology and management, sales and marketing business development and strategic consulting. In addition, Mr. Hew was conferred the honorary title of Datoship by the State Sovereign of Pahang, Malaysia. Mr. Hew received a Bachelor of Science degree in Computer Science from Ohio State University. Mr. Hew also received a postgraduate diploma in Computer and Information Systems from the Curtin University of Technology in Australia in 1994.\nAs the Chief Executive Officer of our company, Mr. Hew brings our board his considerable experience in the strategic planning and growth of companies and qualifies him to continue to serve as a director or our company.\nChip Jin Eng, age 54, has served as our Chief Financial Officer, Treasurer, Secretary and Director since August 12, 2016. Mr. Eng currently serves as the Executive Director for VISIBER SdnBhd and VISIBER International (Singapore) Pte. Ltd and is the Chief Financial Officer of 57 Society. Since 2004 Mr. Eng has also served as an Independent Non-Executive Director and the Audit Committee Chairman of OilcorpBhd, a company listed on the Main Board of Bursa Malaysia stock exchange. Prior to joining 57 Society, since 1999, Mr. Eng established two consulting companies providing corporate advisory and consulting services. Mr. Eng was an auditor with Coopers & Lybrand, Charted Accountants in 1993 before joining Moores Rowland, Chartered Accountants in 1994. Mr. Eng graduated from the Royal Melbourne Institute of Technology, Melbourne, Australia and has been a Chartered Accountant registered with the Malaysian Institute of Accountants since 1996 and the Australian Society of Certified Practicing Accountants (ASCPA) since 2002.\nAs the Chief Financial Officer of our company, Mr. Eng brings our board his considerable experience in the finance and qualifies him to continue to serve as a director or our company.\nInvolvement in Certain Legal Proceedings\nNone of our directors, executive officers, significant employees or control persons has been involved in any legal proceeding listed in Item 401(f) of Regulation S-K in the past 10 years.\nCorporate Governance\nOur board of directors has not established any committees, including an audit committee, a compensation committee or a nominating committee, or any committee performing a similar function. The functions of those committees are being undertaken by our board. Because we do not have any independent directors, our board believes that the establishment of committees of our board would not provide any benefits to our company and could be considered more form than substance.\nWe do not have a policy regarding the consideration of any director candidates that may be recommended by our stockholders, including the minimum qualifications for director candidates, nor has our officers and directors established a process for identifying and evaluating director nominees. We have not adopted a policy regarding the handling of any potential recommendation of director candidates by our stockholders, including the procedures to be followed. Our officers and directors have not considered or adopted any of these policies as we have never received a recommendation from any stockholder for any candidate to serve on our board of directors.\nGiven our relative size and lack of directors and officers insurance coverage, we do not anticipate that any of our stockholders will make such a recommendation in the near future. While there have been no nominations of additional directors proposed, in the event such a proposal is made, all current members of our board will participate in the consideration of director nominees.\nAs with most small, early stage companies until such time as we further develop our business, achieve a stronger revenue base and have sufficient working capital to purchase directors and officers insurance, we do not have any immediate prospects to attract independent directors. When we are able to expand our board to include one or more independent directors, we intend to establish an audit committee of our board of directors. It is our intention that one or more of these independent directors will also qualify as an audit committee financial expert. Our securities are not quoted on an exchange that has requirements that a majority of our board members be independent and we are not currently otherwise subject to any law, rule or regulation requiring that all or any portion of our board of directors include independent directors, nor are we required to establish or maintain an audit committee or other committee of our board.\nCode of Ethics\nWe expect that we will adopt a code of business conduct and ethics that applies to all of our employees, officers and directors, including those officers responsible for financial reporting. Once adopted, we will make the code of business conduct and ethics available on a corporate website, additionally we do not currently have a website but are planning to create one. We intend to post any amendments to the code, or any waivers of its requirements, on our planned website.\nBoard Structure\nOur Board has not chosen to separate the positions of Chief Executive Officer and Chairman of the Board in recognition of the fact that our operations are sufficiently limited that such separation would not serve any useful purpose.\nRole of Board in Risk Oversight Process\nManagement is responsible for the day-to-day management of risk and for identifying our risk exposures and communicating such exposures to our board. Our board is responsible for designing, implementing and overseeing our risk management processes. The board does not have a standing risk management committee, but administers this function directly through the board as a whole. The whole board considers strategic risks and opportunities and receives reports from its officers regarding risk oversight in their areas of responsibility as necessary. We believe our boards leadership structure facilitates the division of risk management oversight responsibilities and enhances the boards efficiency in fulfilling its oversight function with respect to different areas of our business risks and our risk mitigation practices.\nCommunications with the Board of Directors\nStockholders with questions about the Company are encouraged to contact the Company by sending communications to the attention of the Chief Executive Officer at No. 104-2F, Section 1, Yanping North Road, Datong District, Taipei City 10341, Taiwan. If stockholders feel that their questions have not been sufficiently addressed through communications with the Chief Executive Officer, they may communicate with the Board of Directors by sending their communications to the Board of Directors, c/o the Chief Executive Officer at the same address.\nDirector Compensation\nHistorically, our non-employee directors have not received compensation for their service outside the compensation set forth in the Summary Compensation Table below, but we may compensate our directors for their service in the future. We reimburse our non-employee directors for reasonable travel expenses incurred in attending board and committee meetings. We also intend to allow our non-employee directors to participate in any equity compensation plans that we adopt in the future.\nProcedures for Nominating Directors\nThere have been no material changes to the procedures by which security holders may recommend nominees to the Board during the year ended August 31, 2022. Item 11. Executive Compensation\nThe following table sets forth certain compensation information for: (i) our principal executive officer or other individual serving in a similar capacity during our fiscal year ended August 31, 2022, (ii) our two most highly compensated executive officers other than our principal executive officers who were serving as executive officers at August 31, 2022 whose compensation exceed $100,000 and (iii) up to two additional individuals for whom disclosure would have been required but for the fact that the individual was not serving as an executive officer at August 31, 2022. Compensation information is shown for the fiscal years ended August 31, 2022 and 2021.\nFISCAL 2021 AND 2020 SUMMARY COMPENSATION TABLE\nName and principal position Year Salary Bonus Stock\nAwards Option\nAwards All Other\nCompensation Total\nChoong Jeng Hew, $ - $ - $ - $ - $ - $ -\nPresident and Chief Executive Officer(1) $ - $ - $ - $ - $ - $ -\nChip Jin Eng, $ - $ - $ - $ - $ - $ -\nChief Financial Officer(2) $ - $ - $ - $ - $ - $ -\n(1) Mr. Hew was appointed as our President, Chief Executive Officer and Director on August 12, 2016.\n(2) Mr. Eng was appointed Chief Financial Officer on August 12, 2016.\nEmployment Agreements with Executive Officers\nAt this time, we do not have any written employment agreement or other formal compensation agreements with our officers and director. If we do enter into such agreements with our officers and directors, we will make appropriate additional disclosures as they are further developed and formalized.\nOUTSTANDING EQUITY AWARDS AT AUGUST 31, 2022\nThe following tables set forth, for each person listed in the Summary Compensation Table set forth above, as of August 31, 2022:\nWith respect to each option award:\n● the number of shares of our common stock issuable upon exercise of outstanding options that have been earned, separately identified by those exercisable and unexercisable;\n● the number of shares of our common stock issuable upon exercise of outstanding options that have not been earned;\n● the exercise price of such option; and\n● the expiration date of such option; and\n● with respect to each stock award -\n● the number of shares of our common stock that have been earned but have not vested;\n● the market value of the shares of our common stock that have been earned but have not vested;\n● the total number of shares of our common stock awarded under any equity incentive plan that have not vested and have not been earned; and\n● the aggregate market or pay-out value of our common stock awarded under any equity incentive plan that have not vested and have not been earned.\nOUTSTANDING EQUITY AWARDS AT 2022 FISCAL YEAR-END\nOPTION AWARDS STOCK AWARDS\nName Number of Securities Underlying Unexercised Options (#) Exercisable Number of Securities Underlying Unexercised Options (#) Unexercisable Equity Incentive Plan Awards: Number of Securities Underlying Unexercised Unearned Options\n(#) Option Exercise Price\n($) Option Expiration Date Number of Shares or Units of Stock That Have Not Vested (#) Market Value of Shares or Units of Stock That Have Not Vested ($) Equity Incentive Plan Awards: Number of Unearned Shares, Units or Other Rights That Have Not Vested (#) Equity Incentive Plan Awards: Market or Payout Value of Unearned Shares, Units or Other Rights That Have Not Vested (#)\nChoong Jeng Hew - - - $ - - - $ - - -\nChip Jin Eng - - - $ - - - $ - - -\nDirector Compensation\nHistorically, our non-employee directors have not received compensation for their service outside the compensation set forth in the Summary Compensation Table below, but we may compensate our directors for their service in the future. We reimburse our non-employee directors for reasonable travel expenses incurred in attending board and committee meetings. We also intend to allow our non-employee directors to participate in any equity compensation plans that we adopt in the future. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth information known to us, as of December 16, 2022, relating to the beneficial ownership of shares of common stock by:\n● each person who is known by us to be the beneficial owner of more than 5% of the Companys outstanding common stock;\n● each director;\n● each executive officer; and\n● all executive officers and directors as a group.\nUnder securities laws, a person is considered to be the beneficial owner of securities owned by him (or certain persons whose ownership is attributed to him) or securities that can be acquired by him within 60 days, including upon the exercise of options, warrants or convertible securities. The Company determines a beneficial owners percentage ownership by assuming that options, warrants and convertible securities that are held by the beneficial owner, but not those held by any other person, and which are exercisable within 60 days, have been exercised or converted.\nThe Company believes that all persons named in the table have sole voting and investment power with respect to all shares of Common Stock and preferred stock shown as being owned by them. Unless otherwise indicated, the address of each beneficial owner in the table set forth below is care of VISIBER57 Corp., No. 104-2F, Section 1, Yanping North Road, Datong District, Taipei City 10341, Taiwan.\nName and Address of Beneficial Owner Common Stock\nAmount and\nNature of\nBeneficial\nOwnership\nPercent of\nClass(1)\nChoong Jeng Hew, President, Chief Executive Officer and Director(2) 713,000 10.19 %\nChip Jin Eng, Chief Financial Officer - -\nTotal Held by Officers and Directors of Each Class (2 persons): 713,000 10.19 %\nFive Percent Shareholders\n57 Society International Limited(2) 713,000 10.19 %\nKok Low Kau 1,125,000 16.07 %\nKwok Yee Loh 497,500 7.11 %\n(1) Includes, where applicable, shares of common stock issuable upon the exercise of warrants and conversion of debt held by such person that may be exercised within 60 days after December 16, 2022. Unless otherwise indicated, we believe that all persons named in the table above have sole voting power andor investment power with respect to all shares of common stock beneficially, warrants and convertible debt owned by them. Based on 7,000,000 shares of the Companys common stock issued and outstanding on December 16, 2022.\n(2) The number of shares beneficially owned by Mr. Hew includes 713,000 shares of common stock owned by 57 Society International Limited (57 Society). Mr. Hew has a pecuniary interest in and exercises voting and dispositive control over 100% of the Companys common stock owned by 57 Society. Item 13. Certain Relationships and Related Transactions and Director Independence\nDuring the year ended August 31, 2022, 57 Society, a company under the common control of Choong Jeng Hew, the Companys Chief Executive Officer, paid $41,140 of operating expenses and made $1,623 prepayment on behalf of the Company. As of August 31, 2022 and 2021, we had an outstanding payable to 57 Society in the amount of $346,441 and $303,678, respectively, an increase of $42,763. The payable is unsecured, does not bear interest and is due on demand.\nThe Companys principal executive offices relocated to Taiwan on August 5, 2021, which it shares with its controlling shareholder, 57 Society, are furnished to the Company by 57 Society without any charge.\nPolicy Regarding Transactions with Related Persons\nWe do not have a formal, written policy for the review, approval or ratification of transactions between us and any director or executive officer, nominee for director, 5% stockholder or member of the immediate family of any such person that are required to be disclosed under Item 404(a) of Regulation S-K. However, our policy is that any activities, investments or associations of a director or officer that create, or would appear to create, a conflict between the personal interests of such person and our interests must be assessed by our Chief Executive Officer and must be at arms length. Item 14. Principal Accounting Fees and Services\nThe following table shows the fees that were billed for the audit and other services provided by MaloneBailey, LLP for the fiscal years ended August 31, 2022 and 2021, respectively.\nAudit Fees $ 22,500 $ 15,000\nAudit-Related Fees - -\nTax Fees - -\nTotal $ 22,500 $ 15,000\nAudit Fees - This category includes the audit of our annual financial statements, review of financial statements included in our Quarterly Reports on Form 10-Q and services that are normally provided by the independent registered public accounting firm in connection with engagements for those fiscal years. This category also includes advice on audit and accounting matters that arose during, or as a result of, the audit or the review of interim financial statements.\nAudit-Related Fees - This category consists of assurance and related services by the independent registered public accounting firm that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees. The services for the fees disclosed under this category include consultation regarding our correspondence with the SEC and other accounting consulting.\nTax Fees - This category consists of professional services rendered by our independent registered public accounting firm for tax compliance and tax advice. The services for the fees disclosed under this category include tax return preparation and technical tax advice.\nAll Other Fees - This category consists of fees for other miscellaneous items.\nOur Board of Directors has adopted a procedure for pre-approval of all fees charged by our independent registered public accounting firm. Under the procedure, the Board approves the engagement letter with respect to audit, tax and review services. Other fees are subject to pre-approval by the Board, or, in the period between meetings, by a designated member of the Board. Any such approval by the designated member is disclosed to the entire Board at the next meeting. Item 15. Other Information\nCreation of Series A Preferred Stock\nOn June 7, 2021, the Company designated a class of preferred stock titled, Series A Preferred Stock, with a par value of $0.0001 per share, and consisting of one share. The Series A Preferred Stock carries voting rights equal to 110% of the total voting rights of the outstanding common stock and voting power of the Company, and has the right to appoint one director of the Company.\nAdditionally, the one share of Series A Preferred Stock contains protective provisions, which precludes the Company from taking the certain actions without the approval of the holder of the share of Series A Preferred Stock. More specifically, so long as any shares of Series A Preferred Stock are outstanding, the Company shall not, without first obtaining the approval (by vote or written consent, as provided by law) of the holders of at least a majority of the then outstanding shares of Series A Preferred Stock, voting as a separate class:\n(a) amend the Articles of Incorporation or, unless approved by the Board of Directors, including by the Series A Director, amend the Companys Bylaws;\n(b) change or modify the rights, preferences or other terms of the Series A Preferred Stock, or increase or decrease the number of authorized shares of Series A Preferred Stock;\n(c) reclassify or recapitalize any outstanding equity securities, or, unless approved by the Board of Directors, including by the Series A Director, authorize or issue, or undertake an obligation to authorize or issue, any equity securities or any debt securities convertible into or exercisable for any equity securities (other than the issuance of stock-options or securities under any employee option or benefit plan);\n(d) authorize or effect any transaction constituting a Deemed Liquidation under the Articles, or any other merger or consolidation of the Company;\n(e) increase or decrease the size of the Board of Directors as provided in the Bylaws of the Company or remove the Series A Director (unless approved by the Board of Directors, including the Series A Director);\n(f) declare or pay any dividends or make any other distribution with respect to any class or series of capital stock (unless approved by the Board of Directors, including the Series A Director);\n(g) redeem, repurchase or otherwise acquire (or pay into or set aside for a sinking fund for such purpose) any outstanding shares of capital stock (other than the repurchase of shares of Common Stock from employees, consultants or other service providers pursuant to agreements approved by the Board of Directors under which the Company has the option to repurchase such shares at no greater than original cost upon the occurrence of certain events, such as the termination of employment) (unless approved by the Board of Directors, including the Series A Director);\n(h) create or amend any stock option plan of the Company, if any (other than amendments that do not require approval of the stockholders under the terms of the plan or applicable law) or approve any new equity incentive plan;\n(i) replace the President and/or Chief Executive Officer of the Company (unless approved by the Board of Directors, including the Series A Director);\n(j) transfer assets to any subsidiary or other affiliated entity (unless approved by the Board of Directors, including the Series A Director);\n(k) issue, or cause any subsidiary of the Company to issue, any indebtedness or debt security, other than trade accounts payable and/or letters of credit, performance bonds or other similar credit support incurred in the ordinary course of business, or amend, renew, increase or otherwise alter in any material respect the terms of any indebtedness previously approved or required to be approved by the holders of the Series A Preferred Stock (unless approved by the Board of Directors, including the Series A Director);\n(l) modify or change the nature of the Companys business;\n(m) acquire, or cause a Subsidiary of the Company to acquire, in any transaction or series of related transactions, the stock or any material assets of another person, or enter into any joint venture with any other person (unless approved by the Board of Directors, including the Series A Director); or\n(n) sell, transfer, license, lease or otherwise dispose of, in any transaction or series of related transactions, any material assets of the Company or any Subsidiary outside the ordinary course of business (unless approved by the Board of Directors, including the Series A Director).\nAdditionally, as long as any shares of Series A Preferred Stock remain outstanding, the holders of a majority of the shares of Series A Preferred Stock represented at a duly called special or annual meeting of such stockholders or by an action by written consent for that purpose shall be entitled to elect a special director to the board of directors.\nStock Purchase Agreement\nOn July 8, 2021, the Company entered into a Stock Purchase Agreement (the Stock Purchase Agreement) with 57 Society International Ltd., a Hong Kong corporation (57 Society), controlled by ChoongJeng Hew, our President and Chief Executive Officer, anda director, of the Company, pursuant to which the Company sold to 57 Society one share of Series A Preferred Stock in exchange for 6,200,000 shares of common stock of the Company. The Company subsequently canceled and returned to its authorized capital stock the 6,200,000 shares of common stock purchased from 57 Society. Under the Stock Purchase Agreement, 57 Society also has an option to purchase 6,200,000 shares of common stock in exchange for one share of Series A Preferred Stock so long as 57 Society holds its share of Series A Preferred Stock.\nRisk Factor\nChoong Jeng Hew, through his control of 57 Society, beneficially owns and has the right to vote 100% of our Series A Preferred Stock, which has voting power equal to 110% of the total voting rights of the Companys common stock. As a result, Mr. Hew has controlling voting power in all matters submitted to our stockholders for approval including:\n● The election of our board of directors;\n● The amendment of our Certificate of Incorporation or bylaws;\n● The adoption of measures that could delay or prevent a change in control or impede a merger, takeover or other business combination involving us.\nAs a result of his ownership and position, Mr. Hew is able to substantially influence all matters requiring stockholder approval, including the election of directors and approval of significant corporate transactions. Mr. Hews beneficial stock ownership may discourage a potential acquirer from making a tender offer or otherwise attempting to obtain control of us, which in turn could reduce our stock price or prevent our stockholders from realizing a premium over our stock price.\nPART IV\nItem 16. Exhibits\n(a) 1.\nFinancial Statements\nThe financial statements and Report of Independent Registered Public Accounting Firm are listed in the Index to Financial Statements on page and included on pages through.\n2.\nFinancial Statement Schedules\nAll schedules for which provision is made in the applicable accounting regulations of the SEC are either not required under the related instructions, are not applicable (and therefore have been omitted), or the required disclosures are contained in the financial statements included herein.\n3. Exhibits (including those incorporated by reference).\nExhibit Number\nDescription of Exhibit\n3.1\nArticles of Incorporation (Incorporated by reference to Exhibit 3.1 to the Companys Registration Statement on Form S-1 (SEC File No. 333-201239) filed with the SEC on December 23, 2014).\n3.2\nCertificate of Amendment to the Certificate of Incorporation of eBizware Inc. filed with the Delaware Secretary of State on March 23, 2017 (Incorporated by reference to Exhibit 3.1 to the Companys Form 10-Q filed with the SEC on April 11, 2017).\n3.3*\nCertificate of Designation of Series A Preferred Stock, dated June 7, 2021\n3.4\nBylaws (Incorporated by reference to Exhibit 3.2 to the Companys Registration Statement on Form S-1 (SEC File No. 333-201239) filed with the SEC on December 23, 2014).\n3.5*\nCertificate of Amendment to the Certificate of Incorporation of VISIBER57 Corp. filed with the Delaware Secretary of State on September 18, 2019.\n10.1\nStock Purchase Agreement, dated July 8, 2021, by and between Visiber57 Corp., a Delaware corporation, and 57 Society International, Ltd., a Hong Kong corporation.\n21.1*\nSubsidiaries of the Registrant.\n31.1*\nCertification of Principal Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act Of 2002\n31.2*\nCertification of and Principal Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act Of 2002\n32.1*\nCertification of Principal Executive Officer and Principal Financial Officer Pursuant to Section 906 of the Sarbanes-Oxley Act Of 2002\n101.INS*\nXBRL INSTANCE DOCUMENT\n101.SCH*\nXBRL TAXONOMY EXTENSION SCHEMA\n101.CAL*\nXBRL TAXONOMY EXTENSION CALCULATION LINKBASE\n101.DEF*\nXBRL TAXONOMY EXTENSION DEFINITION LINKBASE\n101.LAB*\nXBRL TAXONOMY EXTENSION LABEL LINKBASE\n101.PRE*\nXBRL TAXONOMY EXTENSION PRESENTATION LINKBASE\n* Filed herewith.\nVISIBER57 CORP.\nAugust 31, 2022 and 2021\nCONTENTS\nReport of Independent Registered Public Accounting Firm (PCAOB ID 206)\nFinancial Statements:\nBalance Sheets - As of August 31, 2022 and 2021\nStatements of Operations - For the Years Ended August 31, 2022 and 2021\nStatements of Changes in Stockholders Deficit - For the Years Ended August 31, 2022 and 2021\nStatements of Cash Flows - For the Years Ended August 31, 2022 and 2021\nNotes to Financial Statements to\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of\nVISIBER57 CORP.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of VISIBER57 CORP. (the Company) as of August 31, 2022 and 2021, and the related statements of operations, changes in stockholders deficit, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a net capital deficiency that raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ MaloneBailey, LLP\nwww.malonebailey.com\nWe have served as the Companys auditor since 2014.\nHouston, Texas\nDecember 16, 2022\nVISIBER57 CORP.\nBALANCE SHEETS\nAugust 31,\nASSETS\nCURRENT ASSETS:\nPrepaid expenses $ 1,623 $ 1,247\nTotal Current Assets 1,623 1,247\nTOTAL ASSETS $ 1,623 $ 1,247\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCURRENT LIABILITIES:\nAccounts payable $ 5,880 $ 2,942\nDue to related party 346,441 303,678\nTotal Current Liabilities 352,321 306,620\nTOTAL LIABILITIES 352,321 306,620\nSTOCKHOLDERS DEFICIT:\nPreferred stock, $0.0001 par value, 75,000,000 shares authorized, no\nshares issued and outstanding at August 31, 2022 and 2021\n- -\nCommon stock, $0.0001 par value, 425,000,000 shares authorized, 7,000,000 shares issued and outstanding at August 31, 2022 and\nSeries A Preferred stock, $0.0001 par value, 1 share issued and outstanding at August 31, 2022 and 2021\nPreferred Stock Value\nAdditional paid-in capital 23,800 23,800\nAccumulated deficit (375,198 ) (329,873 )\nTOTAL STOCKHOLDERS DEFICIT (350,698 ) (305,373 )\nTOTAL LIABILITIES AND STOCKHOLDERS DEFICIT $ 1,623 $ 1,247\nThe accompanying notes are an integral part of these financial statements.\nVISIBER57 CORP.\nSTATEMENTS OF OPERATIONS\nFor the Years Ended\nAugust 31,\nOPERATING EXPENSES:\nProfessional fees $ 24,200 $ 17,757\nGeneral and administrative expense 21,125 18,658\nTotal Operating Expenses 45,325 36,415\nLOSS BEFORE INCOME TAX (45,325 ) (36,415 )\nINCOME TAX EXPENSE - -\nNET LOSS $ (45,325 ) $ (36,415 )\nBASIC AND DILUTED LOSS PER COMMON SHARE:\nNet loss per common shares - basic and diluted $ (0.01 ) $ (0.00 )\nWEIGHTED AVERAGE COMMON SHARES OUTSTANDING:\nBasic and diluted 7,000,000 11,773,151\nThe accompanying notes are an integral part of these financial statements.\nVISIBER57 CORP.\nSTATEMENTS OF CHANGES IN STOCKHOLDERS DEFICIT\nFor the Years Ended August 31, 2022 and 2021\nShares Amount Shares Amount Shares Amount Additional Deficit Deficit\nPreferred Stock Series A\nPreferred Stock\nCommon Stock\nTotal\nNumber of\nNumber of\nNumber of\nAdditional Paid-in Accumulated Stockholders\nShares Amount Shares Amount Shares Amount Capital Deficit Deficit\nBalance, August 31, 2020 - $ - - $ - 13,200,000 $ 1,320 $ 23,180 $ (293,458 ) $ (268,958 )\nIssuance of Series A preferred stock in exchange of common stock - $ - $ 0 (6,200,000 ) $ (620 ) $ 620 $ - $ -\nNet loss -\n- - - - - (36,415 ) (36,415 )\nBalance, August 31, 2021 - $ - $ 0 7,000,000 $ 700 $ 23,800 $ (329,873 ) $ (305,373 )\nNet loss - - - - - - - (45,325 ) (45,325 )\nBalance, August 31, 2022 - $ - $ 0 7,000,000 $ 700 $ 23,800 $ (375,198 ) $ (350,698 )\nThe accompanying notes are an integral part of these financial statements.\nVISIBER57 CORP.\nSTATEMENTS OF CASH FLOWS\nFor the Years Ended\nAugust 31,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (45,325 ) $ (36,415 )\nAdjustments to reconcile net loss from operations to net cash used in operating activities: \nChanges in operating assets and liabilities:\nPrepaid expenses 1,247 2,331\nAccounts payable 44,078 34,084\nNET CASH USED IN OPERATING ACTIVITIES - -\nNET DECREASE IN CASH AND CASH EQUIVALENTS - -\nCASH AND CASH EQUIVALENTS - BEGINNING OF YEAR - -\nCASH AND CASH EQUIVALENTS - END OF YEAR $ - $ -\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid for:\nInterest $ - $ -\nIncome taxes $ - $ -\nNON-CASH TRANSACTION\nPrepayment made by related party $ 1,623 $ 1,248\nOperating expenses paid by related party $ 41,140 $ 36,427\nIssuance of series a preferred stock in exchange of common stock $ - $ 620\nThe accompanying notes are an integral part of these financial statements.\nVISIBER57 CORP.\nNotes to Financial Statements\nAugust 31, 2022\nNOTE 1 - ORGANIZATION AND NATURE OF OPERATIONS\nVISIBER57 Corp. (the Company), was incorporated in the State of Delaware on December 31, 2013 and established a fiscal year end of August 31. Effective on March 23, 2017, the Company changed its name to VISIBER57 CORP. and its trading symbol to VCOR effective April 11, 2017 in connection with its plan to expand its business and rebrand its identity. The Company was engaged in the electronic management and appointment of licensed producers in the insurance industry of the United States.\nOn August 12, 2016, in connection with the sale of a controlling interest in the Company, Mark W. DeFoor (the Seller), the Companys Chief Executive Officer and Director entered into and closed on a Share Purchase Agreement (the Agreement) with 57 Society International Limited, (57 Society), a Hong Kong company, whereby 57 Society purchased from the Seller a total of 5,000,000 shares of the Companys common stock. The Shares acquired represent approximately 94.70% of the issued and outstanding shares of common stock of the Company. Following the closing of the agreement, Mark W. DeFoor resigned from all positions held of the Company and Choong Jeng Hew was appointed as the Chief Executive Officer and President of the Company. The Company then ceased its activities in the electronic management and appointment of licensed producers in the insurance industry and abandoned that business model. The Company is currently seeking new business opportunities or acquisitions.\nOn June 7, 2021, the Companys Board of Directors has authorized the Company to create a new series of one share of preferred stock designated the Series A Preferred Stock at par value of $0.0001 per share. The voting power of each share of Series A Preferred Stock is equal to 110% of the issued and outstanding shares of common stock of the Company. Each share of Series A Preferred Stock shall be convertible into one fully paid and non-assessable share of common stock at the option of the holder. On June 8, 2021, 57 Society International Ltd. had completed the transfer of 6,200,000 shares of common stock to the Company. The ownership of 57 Society International Ltd. decreased from 52.37% to 10.19%. On July 8, 2021, the Company and 57 Society International Ltd. entered into a stock purchase agreement. Pursuant to the agreement, the Company issued one share of Series A Preferred Stock to 57 Society International Ltd. in consideration of the return of 6,200,000 shares of common stock.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of presentation\nThe accompanying financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America and the rules and regulations of the United States Securities and Exchange Commission.\nVISIBER57 CORP.\nNotes to Financial Statements\nAugust 31, 2022\nGoing concern\nOur financial statements have been prepared assuming that we will continue as a going concern, which contemplates, among other things, the realization of assets and the satisfaction of liabilities in the normal course of business. As reflected in the accompanying financial statements, we had a net loss of $45,325 and $36,415 for the fiscal years ended August 31, 2022 and 2021, respectively. The working capital deficit was $350,698 as of August 31, 2022. These factors raise substantial doubt about the Companys ability to continue as a going concern. Management cannot provide assurance that the Company will ultimately achieve profitable operations or become cash flow positive, or raise additional debt and/or equity capital. The Company is seeking to raise capital through additional debt and/or equity financings to fund its operations in the future. Although the Company has historically raised capital from sales of equity, from related party working capital advances, and from the issuance of promissory notes, there is no assurance that it will be able to continue to do so. If the Company is unable to raise additional capital or secure additional lending in the near future, management expects that the Company will need to curtail its operations. These financial statements do not include any adjustments related to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nUse of estimates\nThe preparation of the financial statements in conformity with generally accepted accounting principles in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of expenses during the reporting period. Actual results could differ from these estimates.\nFair value of financial instruments and fair value measurements\nThe Company adopted the guidance of Accounting Standards Codification (ASC) 820 for fair value measurements which clarifies the definition of fair value, prescribes methods for measuring fair value, and establishes a fair value hierarchy to classify the inputs used in measuring fair value as follows:\nLevel 1 - Inputs are unadjusted quoted prices in active markets for identical assets or liabilities available at the measurement date.\nLevel 2 - Inputs are unadjusted quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, inputs other than quoted prices that are observable, and inputs derived from or corroborated by observable market data.\nLevel 3 - Inputs are unobservable inputs which reflect the reporting entitys own assumptions on what assumptions the market participants would use in pricing the asset or liability based on the best available information.\nThe carrying amounts reported in the balance sheet for prepaid expenses, accounts payable, and amounts due to related party approximate their fair market value based on the short-term maturity of these instruments. The Company did not have any non-financial assets or liabilities that are measured at fair value on a recurring basis as of August 31, 2022 and 2021.\nManagement believes it is not practical to estimate the fair value of related party payables and due to related party because the transactions cannot be assumed to have been consummated at arms length, the terms are not deemed to be market terms, there are no quoted values available for these instruments, and an independent valuation would not be practical due to the lack of data regarding similar instruments, if any, and the associated potential costs.\nVISIBER57 CORP.\nNotes to Financial Statements\nAugust 31, 2022\nASC 825-10 Financial Instruments allows entities to voluntarily choose to measure certain financial assets and liabilities at fair value (fair value option). The fair value option may be elected on an instrument-by-instrument basis and is irrevocable, unless a new election date occurs. If the fair value option is elected for an instrument, unrealized gains and losses for that instrument should be reported in earnings at each subsequent reporting date. The Company did not elect to apply the fair value option to any outstanding instruments.\nRelated party\nThe Company follows ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions.\nIncome taxes\nDeferred income tax assets and liabilities arise from temporary differences associated with differences between the financial statements and tax basis of assets and liabilities, as measured by the enacted tax rates, which are expected to be in effect when these differences reverse. Deferred tax assets and liabilities are classified as current or non-current, depending upon the classification of the asset or liabilities to which they relate.\nDeferred tax assets and liabilities not related to an asset or liability are classified as current or non-current depending on the periods in which the temporary differences are expected to reverse. Valuation allowances are established when necessary to reduce deferred tax assets to the amount expected to be realized.\nThe Company follows the provisions of FASB ASC 740-10 Uncertainty in Income Taxes (ASC 740-10). Certain recognition thresholds must be met before a tax position is recognized in the financial statements. An entity may only recognize or continue to recognize tax positions that meet a more-likely-than-not threshold. As of August 31, 2022, and 2021, the Company does not believe it has any uncertain tax positions that would require either recognition or disclosure in the accompanying financial statements.\nNet loss per common share\nBasic net loss per common share is computed by dividing net loss by the weighted-average number of common shares outstanding during the period. Diluted net loss per share is computed similar to basic net loss per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. In periods where losses are reported, the weighted-average number of common stock outstanding excludes common stock equivalents, because their inclusion would be anti-dilutive. At August 31, 2022, and 2021, there were no outstanding common share equivalents.\nRecent accounting pronouncements\nManagement does not believe that any other recently issued, but not yet effective accounting pronouncements, if adopted, would have a material effect on the accompanying financial statements.\nVISIBER57 CORP.\nNotes to Financial Statements\nAugust 31, 2022\nNOTE 3 - RELATED PARTY TRANSACTIONS\nOur related parties are the following individuals and entities:\nName\nNature of Relationships\nChoong Jeng Hew\nCompanys Chief Executive Officer, President and Director\nChip Jin Eng\nCompanys Chief Financial Officer\nSociety international Limited (57 Society)\nCompanys shareholder and owned by Choong Jeng Hew.\nKok Low Kau\nCompanys shareholder and relative of Choong Jeng Hew\nDuring the fiscal years ended August 31, 2022 and 2021, 57 Society paid $41,140 and $36,427 of operating expenses, respectively, and made $1,623 and $1,248 prepayment on behalf of the Company, respectively. As of August 31, 2022 and 2021, the Company had an outstanding payable to 57 Society in the amount of $346,441 and $303,678, respectively. The payable is unsecured, does not bear interest and is due on demand.\nThe Companys principal executive offices relocated to Taiwan on August 5, 2021, which it shares with its controlling shareholder, 57 Society, are furnished to the Company by 57 Society without any charge.\nNOTE 4 - INCOME TAXES\nThe Company maintains deferred tax assets and liabilities that reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. The deferred tax assets at August 31, 2022 and 2021 consist of net operating loss carry forwards. The net deferred tax asset has been fully offset by a valuation allowance because of the uncertainty of the attainment of future taxable income.\nThe Company has a deferred tax asset which is summarized as follows at:\nSummary of Deferred Tax Asset\nAugust 31,\nDeferred Tax Assets:\nNet operating loss carry forward $ 78,792 $ 69,273\nTotal deferred tax assets before valuation allowance 78,792 69,273\nValuation allowance (78,792 ) (69,273 )\nNet deferred tax assets $ - $ -\nAdditionally, the future utilization of the net operating loss carry forward to offset future taxable income is subject to annual limitations as a result of ownership or business changes that may occur in the future. The Company has not conducted a study to determine the limitations on the utilization of these net operating losses carry forwards. If necessary, the deferred tax assets will be reduced by any carry forward that may not be utilized or expires prior to utilization as a result of such limitations, with a corresponding reduction of the valuation allowance.\nSIGNATURE\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.\nVISIBER57 Corp.\nDated: December 16, 2022 By:\n/s/ Choong Jeng Hew\nChoong Jeng Hew,\nPresident and Chief Executive Officer\n(Principal executive officer)\nDated: December 16, 2022 By:\n/s/ Chip Jin Eng\nChip Jin Eng, Chief Financial Officer\n(Principal financial and accounting officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Choong Jeng Hew\nDirector\nDecember 16, 2022\nChoong Jeng Hew\n/s/ Chip Jin Eng\nDirector\nDecember 16, 2022\nChip Jin Eng"
}