{
    "cik": "1629210",
    "company": "Paramount Gold Nevada Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-06-30",
    "sic": "1000",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1629210/0000950170-22-019552-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1629210/000095017022019552/pzg-20220630.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1629210/0000950170-22-019552.txt",
    "filename": "1629210_10K_2022_0000950170-22-019552.htm",
    "content": "Item 1. Business.\nParamount Gold Nevada Corp. is a Nevada corporation formed on June 15, 1992 under the name X-Cal (USA), Inc. Paramount Gold Nevada Corp. common stock trades on the NYSE American LLC under the symbol PZG. Unless the context otherwise requires, reference to we, us, our, Paramount, the Company and other similar references refer to Paramount Gold Nevada Corp.\nINITIAL PUBLIC OFFERING AND ORGANIZATIONAL TRANSACTIONS\nOn April 17, 2015, we entered into the previously disclosed separation and distribution agreement (the Separation Agreement) with Paramount Gold and Silver Corp. (PGSC), to effect the separation (the separation) of the Company from PGSC, and to provide for the allocation between the Company and PGSC of the Companys and PGSCs assets, liabilities and obligations attributable to periods prior to, at and after the separation.\nWe filed a registration statement on Form S-1 in connection with the distribution (the distribution) by PGSC to its stockholders of all the outstanding shares of common stock of the Company, par value $0.01 per share. The registration statement was declared effective by the Securities and Exchange Commission (SEC) on April 9, 2015. On April 6, 2015, the Company filed a Form 8-A with the SEC to register its shares of common stock under Section 12(b) of the Securities Exchange Act of 1934, as amended. The distribution, which effected a spin-off of the Company from PGSC, was made on April 17, 2015, to PGSC stockholders of record on April 14, 2015. On the distribution date, stockholders of PGSC received one share of Company common stock for every 20 shares of PGSC common stock held. Up to and including the distribution date, PGSC common stock traded on the regular-way market; that is, with an entitlement to shares of Company common stock distributed pursuant to the distribution. As a result of the distribution, the Company is now a publicly traded company independent from PGSC. On April 20, 2015, the Companys shares of common stock commenced trading on the NYSE American LLC (formerly NYSE MKT) under the symbol PZG. An aggregate of 8,101,371 shares of Company common stock were distributed in the distribution. In connection with our separation from PGSC and PGSCs merger with and into Coeur Mining, Inc. (Coeur), PGSC contributed approximately $8.45 million to us as an equity contribution, and we issued 417,420 shares of our common stock, par value $0.01 per share, to Coeur in exchange for a cash payment by Coeur in the amount of $1.47 million.\nOn March 14, 2016, Paramount Gold Nevada Corp. and Calico Resources Corp. (Calico) entered into an Arrangement Agreement providing for the acquisition of Calico by Paramount. On July 7, 2016, after having received the approval of the Supreme Court of British Columbia to the transaction, Paramount and Calico completed the transaction contemplated by the Arrangement Agreement, pursuant to which Calico became a wholly owned subsidiary of Paramount.\nOn November 14, 2016, Calico Resources Corp. was merged into Calico Resources USA Corp. As a result, Calico Resources USA Corp. became a wholly owned subsidiary of Paramount.\nOVERVIEW OF PARAMOUNT GOLD NEVADA CORP.\nWe are engaged in the business of acquiring, exploring and developing precious metal projects in the United States of America. Paramount owns both exploration and development stage projects in the states of Nevada and Oregon. We enhance the value of our projects by implementing exploration and engineering programs that are likely to expand and upgrade known mineral resources to mineral reserves. To further advance our projects towards the production decision, we manage the completion of the appropriate technical studies including feasibility studies and undertake permitting processes with the relevant local, state and federal regulators. Paramount believes there are several ways to realize the value of its projects: selling its projects to producers; joint venturing its projects with other companies; or building and operating small mines on its own.\nThe Companys material Nevada property, the Sleeper Gold Project (\"Sleeper\"), is located in Humboldt County, Nevada.\nOur material Oregon property, known as the Grassy Mountain Project (Grassy Mountain), is located in Malheur County, Oregon, and was acquired by way of statutory plan of arrangement in the Province of British Columbia, Canada with Calico in July 2016.\nINTER-CORPORATE RELATIONSHIPS\nWe currently have three active wholly owned direct subsidiaries:\nNew Sleeper Gold LLC and Sleeper Mining Company, LLC, which operate our mining interests in Nevada.\nCalico Resources USA Corp., which holds our interest in the Grassy Mountain Project in Oregon.\nThe Companys corporate structure is as follows:\nCOMPETITION\nThe mineral exploration industry is highly competitive. We compete with junior and senior mineral exploration companies, independent producers and institutional and individual investors who are actively seeking to acquire mineral exploration properties throughout the United States together with the equipment, labor and materials required to explore on those properties. Competition for the acquisition of mineral exploration properties is intense with many mineral exploration leases or concessions available through a competitive bidding process in which we may lack the technological information or expertise available to other bidders. Accordingly, these competitors may be able to spend greater amounts on acquiring mineral exploration interests of merit or on exploring or developing their mineral exploration properties. This advantage could enable our competitors to acquire mineral exploration properties of greater quality and interest to prospective investors who may choose to finance their exploration and development projects instead of the Companys. Such competition could adversely impact our ability to attain the financing necessary for us to acquire further mineral exploration properties.\nWe do not compete with anyone with respect to our existing mineral claims because they are 100% controlled or owned by us. We believe we have or can acquire on reasonable terms to the equipment, technical expertise and materials necessary to explore and develop our current properties.\nGOVERNMENT REGULATION\nGeneral\nOur business is subject to extensive federal, state and local laws governing the exploring, development, production, mine closure and reclamation, labor standards, taxes, protection of wildlife and other matters. The costs to comply with government regulations are substantial and possible future regulation could cause additional expenditures, restrictions and delays in the exploration and development of our properties. We cannot predict to extent future regulations might have an impact. Future changes to U.S. federal, state or local laws and regulations could have a material adverse effect upon us and our results of operations. For additional information regarding key regulatory risks, please the section titled \"Risk Factors\" included in Item 1A. Risk Factors.\nDescribed below are certain risks that we believe apply to our business and the industry in which we operate. You should carefully consider each of the following risk factors in conjunction with others provided in this Annual Report on Form 10-K and in our other public disclosures. The risks described below highlight potential events, trends or other circumstances that could adversely affect our business, financial condition, results of operations, cash flows, liquidity or access to sources of financing, and consequently, the market value of our common stock. These risks could cause our future results to differ materially from historical results. The risks described below are those that we have identified as material and is not an exhaustive list of all the risks we face. There may be others that we have not identified or that we have deemed to be immaterial. All forward-looking statements made by us or on our behalf are qualified by the risks described below.\nRisk Related to Our Industry\nThe estimation of mineral reserves and mineral resources is imprecise and depends upon subjective factors.\nEstimated mineral reserves and mineral resources may not be realized in actual production. Our results of operations and financial position may be adversely affected by inaccurate estimates. The mineral reserve and mineral resource figures presented in our public filings are estimates made by independent mining consultants with whom we contract. Mineral reserve and mineral resource estimates are a function of geological and engineering analyses that require us to make assumptions about production costs, recoveries and gold and silver market prices. Mineral reserve and mineral resource estimation is an imprecise and subjective process. The accuracy of such estimates is a function of the quality of available data and of engineering and geological interpretation, judgment and experience. Assumptions about gold and silver market prices are subject to great uncertainty as those prices fluctuate widely. Declines in the market prices of gold, silver, zinc or lead may render mineral reserves and mineral resources containing relatively lower grades of mineralization uneconomic to exploit, and we may be required to reduce mineral reserve and mineral resource estimates, discontinue development at one or more of our properties or write down assets as impaired. New or updated technical or geological information may also impact anticipated metal recovery rates. Any of these adjustments may adversely affect our financial condition, results of operations and cash flows.\nThe precious metals markets are volatile markets. This will have a direct impact on our revenues (if any) and profits (if any) and could have an adverse effect on our ongoing operations.\nThe price of both gold and silver has fluctuated significantly over the past few years. Despite the volatility in the price of gold, there continues to be interest in gold and silver mining and companies engaged in that business, including the exploration for both gold and silver. However, in the event that the price of these metals falls, the interest in the gold and silver mining industry may decline and the value of our business could be adversely affected. Even if we are able to generate revenues, there can be no assurance that any of our operations will prove to be profitable. Finally, in recent decades, there have been periods of both overproduction and underproduction of both gold and silver resources. Such conditions have resulted in periods of excess supply of and reduced demand on a worldwide basis and on a domestic basis. These periods have been followed by periods of short supply of and increased demand for both gold and silver. We cannot predict what the market for gold or silver will be in the future.\nMining operations are hazardous, raise environmental concerns and raise insurance risks.\nThe development and operation of a mine or mineral property involves many risks, which even a combination of experience, knowledge and careful evaluation may not be able to overcome. These risks include, among other things, ground fall, flooding, environmental hazards and the discharge of toxic chemicals, explosions and other accidents. Such occurrences may result in work stoppages, delays in production, increased production costs, damage to or destruction of mines and other producing facilities, injury or loss of life, damage to property, environmental damage and possible legal liability for such damages as well. Although the Company maintains liability coverage in an amount which it considers adequate for its operations, such occurrences, against which the Company\nmay not be able, or may elect not to insure, may result in a material adverse change in the Companys financial position. The nature of these risks is such that liabilities may exceed policy limits, in which event the Company would incur substantial uninsured losses.\nWe are subject to numerous environmental and other regulatory requirements.\nAll phases of mining and exploration operations are subject to governmental regulation including environmental regulation. Environmental legislation is becoming stricter, with increased fines and penalties for non-compliance, more stringent environmental assessments of proposed projects and heightened responsibility for companies and their officers, directors and employees. There can be no assurance that possible future changes in environmental regulation will not adversely affect our operations. As well, environmental hazards may exist on a property in which we hold an interest that was caused by previous or existing owners or operators of the properties and of which the Company is not aware at present.\nGovernment approvals and permits are required to be maintained in connection with our mining and exploration activities. Although we believe we currently have all required permits for our operations as currently conducted, there is no assurance that delays will not occur in connection with obtaining all necessary renewals of such permits for the existing operations or additional permits for any possible future changes to the Companys operations, including any proposed capital improvement programs. Failure to comply with applicable laws, regulations and permitting requirements may result in enforcement actions thereunder, including orders issued by regulatory or judicial authorities causing operations to cease or be curtailed, and may include corrective measures requiring capital expenditures, installation of additional equipment, or remedial actions. Parties engaged in mining operations may be required to compensate those suffering loss or damage by reason of the mining activities and may be liable for civil or criminal fines or penalties imposed for violations of applicable laws or regulations. Amendments to current laws, regulations and permitting requirements, or more stringent application of existing laws, may have a material adverse impact on the Company resulting in increased capital expenditures or production costs, reduced levels of production at producing properties or abandonment or delays in development of properties.\nRisks Related to our Business Operations\nThere is substantial doubt about our ability to continue as a going concern.\nThe accompanying consolidated financial statements have been prepared assuming the Company will continue as a going concern. This assumes continuing operations and the realization of assets and liabilities in the normal course of business.\nWe have incurred significant losses since our inception and expect to continue to incur losses as a result of costs and expenses related to maintaining our properties and general and administrative expenses. As of June 30, 2022, we had cash of approximately $2.5 million and an accumulated deficit of approximately $67.9 million. As a result of our evaluation of the Companys liquidity for the next twelve months, we have included a discussion about our ability to continue as a going concern in our consolidated financial statements, and our independent auditors report for year ended June 30, 2022 includes an explanatory paragraph that expresses substantial doubt about our ability to continue as a going concern. Our capital needs have, in recent years, been funded through sales of our debt and equity securities. In the event that we are unable to raise sufficient additional funds, we may be required to delay, reduce or severely curtail our operations or otherwise impede our on-going business efforts, which could have a material adverse effect on our business, operating results, financial condition, long-term prospects and ability to continue as a viable business.\nIt is possible investors may lose their entire investment in the Company.\nProspective investors should be aware that if we are not successful in our endeavors, your entire investment in the Company could become worthless. Even if we are successful in identifying mineral reserves that can be commercially developed, there can be no assurances that we will generate any revenues and therefore our losses will continue.\nNo revenue generated from operations.\nWe have not generated any revenues from operations. Our net loss for the fiscal year ended June 30, 2022 totaled $7,837,316. We have incurred losses in the past, and we will likely continue to incur losses in the future. Even if our drilling programs identify gold, silver or other mineral deposits, there can be no assurance that we will be able to commercially exploit these resources, generate any revenues or generate sufficient revenues to operate profitably.\nWe will require significant additional capital to continue our exploration activities, and, if warranted, to develop mining operations.\nNone of our projects currently have proven or probable reserves. Substantial expenditures will be required to determine if proven and probable mineral reserves exist at any of our properties, to develop metallurgical processes to extract metal, to develop the mining and\nprocessing facilities and infrastructure at any of our properties or mine sites and, in certain circumstances, to acquire additional property rights. We have spent and will be required to continue to expend significant amounts of capital for drilling, geological and geochemical analysis, assaying, and, when warranted, feasibility studies with regard to the results of our exploration. We may not benefit from these investments if we are unable to identify commercially exploitable mineral reserves. If we decide to put one or more of our properties into production, we will require significant amounts of capital to develop and construct the mining and processing facilities and infrastructure required for mining operations. Our ability to obtain necessary funding for these purposes, in turn, depends upon a number of factors, including the status of the national and worldwide economy and the price of gold, silver and other precious metals. We may not be successful in obtaining the required financing, or if we can obtain such financing, such financing may not be on terms that are favorable to us. Failure to obtain such additional financing could result in delay or indefinite postponement of further exploration or development and the possible, partial or total loss of our potential interest in certain properties. Any such delay could have a material adverse effect on our results of operations or financial condition.\nWe cannot be assured that any of our projects are economically feasible or that feasibility studies will accurately forecast operating results.\nOur future profitability depends on the economic feasibility of our projects. We have completed a feasibility study on our Grassy Mountain Project. There can be no assurance that the results of any feasibility study for the Sleeper Gold Project will be positive. Economic feasibility depends on many factors which include estimates on production rates, revenues, operating and capital costs. Completed feasibility studies for any of our projects and obtain financing to construct and initiate mining operations, there can be no assurance that actual operating results will not vary unfavorably from the estimates and assumptions included in a feasibility study.\nWe may acquire additional exploration stage properties, and we may face negative reactions if reserves are not located on acquired properties.\nWe may acquire additional exploration stage properties. There can be no assurance that we will be able to identify and complete the acquisition of such properties at reasonable prices or on favorable terms or that reserves will be identified on any properties that we acquire. We may also experience negative reactions from the financial markets if we are unable to successfully complete acquisitions of additional properties or if reserves are not located on acquired properties. These factors may adversely affect the trading price of our common stock or our financial condition or results of operations.\nOur industry is highly competitive, attractive mineral lands are scarce, and we may not be able to obtain quality properties.\nWe compete with many companies in the mining industry, including large, established mining companies with substantial capabilities, personnel and financial resources. There is a limited supply of desirable mineral lands available for claim staking, lease or acquisition in the United States of America where we may conduct exploration activities. We may be at a competitive disadvantage in acquiring mineral properties because we compete with these individuals and companies, many of which have greater financial resources and larger technical staffs.\nTitle to mineral properties can be uncertain, and we are at risk of loss of ownership of one or more of our properties. Our ability to explore and operate our properties depends on the validity of our title to that property. A significant amount of our mineral properties consist of leases of unpatented mining claims. Unpatented mining claims provide only possessory title and their validity is often subject to contest by third parties or the federal government, which makes the validity of unpatented mining claims uncertain and generally more risky. These uncertainties relate to such things as the sufficiency of mineral discovery, proper posting and marking of boundaries, assessment work and possible conflicts with other claims not determinable from public record. Since a substantial portion of all mineral exploration, development and mining in the United States now occurs on unpatented mining claims, this uncertainty is inherent in the mining industry. We have not obtained title opinions covering our entire properties, with the attendant risk that title to some claims, particularly title to undeveloped property, may be defective. There may be valid challenges to the title to our property which, if successful, could impair development and/or operations.\nWe have no mining operations and no history as a mining company.\nWe are a development stage company and have no ongoing mining operations of any kind. We have interests in mining claims which may or may not lead to production.\nWe have no history of earnings or cash flow from mining operations. If we are able to proceed to production, commercial viability will be affected by factors that are beyond our control such as the particular attributes of the deposit, the fluctuation in metal prices, the cost of constructing and the operation of a mine, prices and refining facilities, the availability of economic sources for energy, government regulations including regulations relating to prices, royalties, restrictions on production, quotas on exploration of minerals, as well as the costs of protection of the environment.\nIf our exploration and development costs are higher than anticipated, then our profitability will be adversely affected.\nWe are currently proceeding with plans to explore and develop our mineral properties on the basis of estimated costs. If our exploration and development costs are greater than anticipated, then we will have fewer capital resources for other expenses and losses could increase. Factors that could cause exploration and development costs to increase include adverse weather conditions, difficult terrain, increased government regulation and shortages of qualified personnel.\nAssuming no adverse developments outside of the ordinary course of business, our exploration and development budget will be approximately up to $4.0 million for the next twelve months. Exploration will be funded by our available cash reserves and future issuances of common stock, warrants or units. Our exploration program may vary significantly from what we have budgeted depending upon the results we achieve. Even if we identify mineral reserves which have the potential to be commercially developed, we will not generate revenues until such time as we undertake mining operations. Mining operations will involve a significant capital infusion. Mining costs are speculative and dependent on a number of factors including mining depth, terrain and necessary equipment. We do not believe that we will have sufficient funds to implement mining operations without additional capital raises of debt and or equity or without a joint venture partner, of which there can be no assurance.\nOur continuing reclamation obligations at our properties could require significant additional expenditures.\nWe are responsible for the reclamation obligations related to disturbances located on all of our properties. We have posted a bond in the amount of the estimated reclamation obligation at the Sleeper Gold Project and the Grassy Mountain Project. At the Sleeper Gold Project, we are required to submit a mine closure plan to the BLM every three years. Based on a review by the BLM of our mine closure plan that Paramount submitted in July 2020, the BLM determined that our existing bond was sufficient. There is a risk that any cash bond, even if increased based on the analysis and work performed to update the reclamation obligations, could be inadequate to cover the actual costs of reclamation when carried out. The satisfaction of bonding requirements and continuing reclamation obligations will require a significant amount of capital. There is a risk that we will be unable to fund these additional bonding requirements, and further, that the regulatory authorities may increase reclamation and bonding requirements to such a degree that it would not be commercially reasonable to continue exploration activities, which may adversely affect our results of operations, financial performance and cash flows.\nThere may be insufficient mineral reserves to develop any of our properties, and our estimates may be inaccurate.\nThere is no certainty that any expenditures made in the exploration of any properties will result in discoveries of commercially recoverable quantities of ore. Most exploration projects do not result in the discovery of commercially mineable deposits of ore and no assurance can be given that any particular level of recovery of precious metals from discovered mineralization will in fact be realized or that any identified mineral deposit will ever qualify as a commercially mineable ore body which can be legally and economically exploited. Estimates of reserves, mineral deposits and production costs can also be affected by such factors as environmental regulations and requirements, weather, environmental factors, unforeseen technical difficulties, unusual or unexpected geological formations and work interruptions. In addition, the grade of ore ultimately mined may differ from that indicated by drilling results. Short term factors relating to reserves, such as the need for orderly development of ore bodies or the processing of new or different grades, may also have an adverse effect on mining operations and on the results of operations. There can be no assurance that precious metals recovered in small scale laboratory tests will be duplicated in large scale tests under on-site production conditions. Material changes in estimated reserves, grades, stripping ratios or recovery rates may affect the economic viability of any project.\nWe face fluctuating gold and mineral prices.\nThe value of any mineral reserves we develop, and consequently the value of our common stock, depends significantly on the value of such minerals. The price of gold and silver as well as other precious and base metals have experienced volatile and significant price movements over short periods of time and are affected by numerous factors beyond our control, including international economic and political trends, expectations of inflation, interest rates, global or regional consumption patterns, speculative activities and increases in production due to improved mining and production methods. The supply of and demand for gold and silver, as well as other precious and base metals, are affected by various factors, including political events, economic conditions and production costs in major mineral producing regions.\nOur estimates of mineral reserves and mineral resources are subject to uncertainty.\nEstimates of mineral reserves and other mineral resources are subject to considerable uncertainty. Such estimates are arrived at using standard acceptable geological techniques and are based on the interpretations of geological data obtained from drill holes and other sampling techniques. Engineers use feasibility studies to derive estimates of cash operating costs based on anticipated tonnage and grades of ore to be mined and processed, the predicted configuration of the ore bodies, expected recovery rates of metal from ore, comparable facility and operating costs and other factors. Actual cash operating costs and economic returns on projects may differ\nsignificantly from the original estimates, primarily due to fluctuations in the current prices of metal commodities extracted from the deposits, changes in fuel costs, labor rates, changes in permit requirements, and unforeseen variations in the characteristics of the ore body. Due to the presence of these factors, there is no assurance that any geological reports will accurately reflect actual quantities of gold, silver or other metals that can be economically processed and mined by us.\nIf we are unable to obtain all of our required governmental permits, our operations could be negatively impacted.\nOur future operations, including exploration and development activities, required permits from various governmental authorities. Such operations are and will be governed by laws and regulations governing prospecting, development, mining, production, exports, taxes, labor standards, occupational health, waste disposal, toxic substances, land use, environmental protection, mine safety and other matters. There can be no assurance that we will be able to acquire all required licenses or permits or to maintain continued operations at our properties.\nThere is no assurance that there will not be title or boundary disputes.\nAlthough we have investigated the right to explore and exploit our properties and obtained records from government offices with respect to all of the mineral claims comprising our properties, this should not be construed as a guarantee of title. Other parties may dispute the title to any of our properties or any property may be subject to prior unregistered agreements and transfers or land claims by aboriginal, native, or indigenous peoples. The title may be affected by undetected encumbrances or defects or governmental actions.\nLocal infrastructure may impact our exploration activities and results of operations.\nMining, processing, development and exploration activities depend, to one degree or another, on adequate infrastructure. Reliable roads, bridges, power and water supplies are important determinants that affect capital and operating costs. Unusual or infrequent weather phenomena, sabotage or government or other interference in the maintenance or provision of such infrastructure could adversely affect our activities and profitability.\nBecause of the speculative nature of exploration for gold and silver properties, there is substantial risk that our business will fail.\nThe search for precious metals as a business is extremely risky. We cannot provide any assurances that the gold or silver mining interests that we acquired will contain commercially exploitable reserves of gold or silver. Exploration for minerals is a speculative venture necessarily involving substantial risk. Any expenditure that we make may not result in the discovery of commercially exploitable reserves of precious metals.\nWe are in competition with companies that are larger, more established and better capitalized than we are.\nMany of our potential competitors have greater financial and technical resources, as well as longer operating histories and greater experience in mining.\nExploration for economic deposits of minerals is speculative.\nThe business of mineral exploration is very speculative, since there is generally no way to recover any of the funds expended on exploration unless the existence of mineable reserves can be established. We can exploit those reserves by either commencing mining operations, selling or leasing our interest in the property or entering into a joint venture with a larger resource company that can further develop the property to the production stage. Unless we can establish and exploit reserves before our sources of funds are exhausted, we will have to discontinue operations, which could make our stock valueless.\nThe loss of key members of our senior management team could adversely affect the execution of our business strategy and our financial results.\nWe believe that the successful execution of our business strategy and our ability to move beyond the exploratory stages depends on the continued employment of key members of our senior management team. If any members of our senior management team become unable or unwilling to continue in their present positions, our financial results and our business could be materially adversely affected.\nWe operate in a regulated industry and changes in regulations or violations of regulations may result in increased costs or sanctions that could reduce our revenues.\nOur organization is subject to extensive and complex federal and state laws and regulations. If we fail to comply with the laws and regulations that are directly applicable to our business, we could suffer civil and/or criminal penalties or be subject to injunctions or cease and desist orders. While we believe that we are currently compliant with applicable rules and regulations, if there are changes in the future, there can be no assurance that we will be able to comply in the future, or that future compliance will not significantly adversely impact our operations.\nThe COVID-19 pandemic may adversely impact our business and may negatively impact our financial results in the future, and the ultimate impact will depend on future developments, which are highly uncertain and cannot be predicted, including the scope and duration of the pandemic and actions taken by governmental authorities in response to the pandemic.\nThe COVID-19 pandemic has negatively impacted the global economy, disrupted global supply chains, lowered equity market valuations, created significant volatility and disruption in financial markets, and increased unemployment levels. In addition, the pandemic has resulted in temporary closures of many businesses and the institution of social distancing and sheltering in place requirements in many states and communities. As a result, our ability to continue with our planned activities may be significantly impacted, which could adversely affect the timing of completing our development programs which include the federal and state permitting of our Grassy Mountain Project in eastern Oregon. Furthermore, our business operations may also be disrupted if significant portions of our workforce are unable to work effectively, including because of illness, quarantines, government actions, or other restrictions in connection with the pandemic. The extent to which the COVID-19 pandemic impacts our business, results of operations, and financial condition, will depend on future developments, which are highly uncertain and cannot be predicted, including the scope and duration of the pandemic and actions taken by governmental authorities and other third parties in response to the pandemic.\nIf we fail to maintain an effective system of internal controls, we may not be able to accurately report our financial results or prevent fraud. As a result, current and potential stockholders could lose confidence in our financial reporting, which would harm our business and the trading price of our common stock.\nEffective internal controls are necessary for us to provide reliable financial reports, prevent fraud and operate successfully as a public company. If we cannot provide reliable financial reports or prevent fraud, our reputation and operating results would be harmed. We cannot be certain that our efforts to develop and maintain our internal controls will be successful, that we will be able to maintain adequate controls over our financial processes and reporting in the future or that we will be able to comply with our obligations under Section 404 of the Sarbanes-Oxley Act of 2002. Any failure to develop or maintain effective internal controls, or difficulties encountered in implementing or improving our internal controls, could harm our operating results or cause us to fail to meet our reporting obligations. Ineffective internal controls could also cause investors to lose confidence in our reported financial information, which would likely have a negative effect on the trading price of our common stock.\nWe are dependent upon information technology systems, which are subject to cybersecurity incidents, disruption, damage, failure and other risks associated with implementation and integration.\nOur information technology systems used in our operations are subject to disruption, damage or failure from a variety of sources, including, without limitation, computer viruses, security breaches, cyberattacks, natural disasters and defects in design. Cybersecurity incidents, in particular, are evolving and include, but are not limited to, malicious software, attempts to gain unauthorized access to data or machines and equipment, and other electronic security breaches that could lead to disruptions in systems, unauthorized release of confidential or otherwise protected information, the corruption of data or the disabling, misuse or malfunction of machines and equipment. Various measures have been implemented to manage our risks related to information technology systems and network disruptions. However, given the unpredictability of the timing, nature and scope of information or operational technology disruptions, we could potentially be subject to production downtimes, operational delays, operating accidents, the compromising of confidential or otherwise protected information, destruction or corruption of data, security breaches, other manipulation or improper use of our systems and networks or financial losses from remedial actions, any of which could have a material adverse effect on cash flows, financial condition or results of operations.\nWe could also be adversely affected by system or network disruptions if new or upgraded information technology systems are defective, not installed properly or not properly integrated into operations. Various measures have been implemented to manage the risks related to the system implementation and modification, but system modification failures could have a material adverse effect on our business, financial position and results of operations.\nRisks Related to Our Common Stock and Indebtedness\nOur stock price may be volatile.\nThe market price of our common stock has been volatile. We believe investors should expect continued volatility in our stock price. Such volatility may make it difficult or impossible for you to obtain a favorable selling price for our shares.\nWe may not have sufficient cash to meet our debt obligation.\nAs of June 30, 2022, we have $4.2 million in outstanding indebtedness in the form of convertible notes. Our ability to repay the outstanding debt on at maturity will depend on the Company having sufficient cash on hand. We could face substantial liquidity problems and could be forced to reduce or delay investments and capital expenditures, dispose of material assets or operations, seek additional debt or equity capital or restructure or refinance our indebtedness. We cannot predict whether we would be able to refinance debt, issue equity or debt securities or dispose of assets to raise funds on a timely basis or on satisfactory terms. In a rising interest rate environment, the costs of borrowing additional funds or refinancing outstanding indebtedness would also be expected to increase. We may not be able obtain proceeds in an amount sufficient to meet any debt service obligations when due.\nWe do not intend to pay dividends for the foreseeable future.\nWe have never declared or paid any dividends on our common stock. We intend to retain all of our earnings, if any, for the foreseeable future to finance the operation and expansion of our business, and we do not anticipate paying any cash dividends in the future. As a result, you may only receive a return on your investment in our common stock if the market price of our common stock increases. Our board of directors retains discretion to change this policy.\nThe exercise of our outstanding options may depress our stock price.\nThe exercise of outstanding options and the subsequent sale of the underlying common stock in the public market, or the perception that future sales of these shares could occur, could have the effect of lowering the market price of our common stock below current levels and make it more difficult for us and our stockholders to sell our equity securities in the future.\nSales or the availability for sale of shares of common stock by stockholders could cause the market price of our common stock to decline and could impair our ability to raise capital through an offering of additional equity securities. Item 1B. Unresolved Staff Comments.\nNot applicable as a smaller reporting company. Item 2. Properties.\nThe following description of the Companys mining properties is qualified in its entirety by reference to the Technical Report Summary for each of the properties included as exhibits to this Annual Report on Form 10-K (Report) and incorporated by reference into this Item 2. The information concerning our mining properties in this Report has been prepared in accordance with the requirements of subpart 1300 of Regulation S-K. Subpart 1300 of Regulation S-K requires us to disclose our mineral resources, in addition to our mineral reserves, as of the end of our most recently completed fiscal year in the aggregate and for each of our individually material mining properties.\nYou are cautioned that mineral resources do not have demonstrated economic value. Mineral resources are subject to further exploration and development, are subject to additional risks, and no assurance can be made that they will eventually convert to future reserves. Investors are cautioned not to assume that any part of all of the Inferred Resource exists or is economically or legally mineable. See Item 1A, Risk Factors.\nSummary Disclosure\nNone of the Companys material properties are in the production stage.\nAs summary overview of each material property is as follows:\nProperty:\nGrassy Mountain\nStage:\nDevelopment\nLocation:\nOregon\nOwnership:\n100%\nTitles and Mining Claims:\n3 patented lode claims (62 acres), 455 unpatented lode claims (8,173 acres), 9 mill site claims (45 acres) and totaling approximately 8,280 acres\nKey Permit Conditions:\nPrivate and BLM administered land. Plan of Operations and other required State permits in place for exploration.\nMine Type:\nUnderground\nCommodity:\nGold, Silver\nMineralization Styles:\nHot Spring Style, Low Sulfidation Epithermal\nOther:\nCertain royalty interests have been granted with respect to the Grassy Mountain Project\nA security interest in the Grassy Mountain Project has been granted in favor of the Convertible Note Holders (as defined below)\nProperty:\nSleeper Gold\nStage:\nExploration\nLocation:\nNevada\nOwnership:\n100%\nTitles and Mining Claims:\n2474 unpatented lode claims (approximately 44,917 acres)\nKey Permit Conditions:\nBLM administered land. Plan of Operations and other required State permits in place for exploration.\nMine Type:\nOpen Pit Heap Leach\nCommodity:\nGold, Silver\nMineralization Styles:\nLow Sulfidation, Vein\nOther:\nCertain royalty interests have been granted with respect to the Sleeper Gold Project\nA security interest in the Sleeper Gold Project has been granted in favor of the Convertible Note Holders (as defined below)\nSummary Gold Mineral Resources as of June 30, 2022(1,2,4,10):\nMeasured Mineral Resources\nIndicated Mineral Resources\nMeasured + Indicated Mineral Resources\nInferred Mineral Resources\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nUnited States\nGrassy Mountain 3, 5,\n21,153\n0.017\n12,902\n0.0300\n34,055\n0.022\n1,151\n0.0370\nSleeper 6, 7, 8, 9\n237,600\n0.0102\n2,417\nTotal\n21,153\n0.0170\n12,902\n0.0300\n34,055\n0.022\n238,751\n0.0103\n2,459\nSummary of Silver Mineral Resources as of June 30, 2022(1,2,4,10):\nMeasured Mineral Resources\nIndicated Mineral Resources\nMeasured + Indicated Mineral Resources\nInferred Mineral Resources\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nUnited States\nGrassy Mountain 3, 5,\n21,153\n0.0170\n1,529\n12,902\n0.115\n34,055\n0.088\n3,009\n1,151\n0.1090\nSleeper 6, 7, 8, 9\n237,600\n0.1030\n24,458\nTotal\n21,153\n0.0170\n1,529\n12,902\n0.115\n1,480\n34,055\n0.088\n3,009\n238,751\n0.1030\n24,584\n1.The term resource means that it is a concentration or occurrence of material of economic interest in or on the Earths crust in such form, grade or quantity that there are reasonable prospects for economic extraction. Inferred, Indicated, and Measured resources are in order of increasing confidence based on level of underlying geological evidence. The term ‘inferred resource is that part of a mineral resource for which quantity and grade or quality are estimated on the basis of limited geological evidence and sampling. The term limited geological evidence means evidence that is only sufficient to establish that geological and grade or quality continuity is more likely than not. The level of geological uncertainty associated an inferred mineral resource is too high to apply relevant technical and economic factors likely to influence the prospects of economic extraction in a manner useful for evaluation of economic viability and must have a reasonable expectation that the majority of inferred mineral resources could be upgraded to indicated or measured mineral resources with continued exploration.\n2.Mineral Resources estimates are reported exclusive of mineral reserves, are current as of June 30, 2022, and are reported using the definitions in SK 1300 and were prepared by RESPEC Company LLC for the Grassy Mountain Property and the Sleeper Gold Property.\n3.Mineral Resources comprised all model blocks at a 0.011 oz/ton AuEq cut-off that lie within an optimized pit plus blocks at a 0.085 oz/ton AuEq cut-off that lie outside of the optimized pit.\n4.Mineral Resources summarized in the table immediately above are reported exclusive of the Mineral Resources converted to Mineral Reserves. Mineral Resources that are not Mineral Reserves do not have demonstrated economic viability.\n5.Mineral Resources potentially amenable to open pit mining methods are reported using a gold price of US$1,750/oz, a silver price of US$22/oz, a throughput rate of 5,000 tons/day, assumed metallurgical recoveries of 80% for Au and 60% for Ag, mining costs of US$2.50/ton mined, processing costs of US$13.00/ton processed, general and administrative costs of $2.22/ton processed, and refining costs of $5.00/oz Au and $0.50/oz Ag produced. Mineral Resources potentially amenable to underground mining methods are reported using a gold price of US$1,750/oz, a silver price of US$22/oz, a throughput rate of 5,000 tons/day, assumed metallurgical recoveries of 90% gold equivalent, mining costs of US$90/ton mined, processing costs of US$30/ton processed, general and administrative costs of $15.00/ton processed, and refining costs of $5.00/oz gold equivalent produced.\n6.Mineral Resources comprised all model blocks at a 0.137 g Au/t cut-off for Oxide and Mixed within an optimized pit; 0.251 g Au/t for Sulfide within an optimized pit; and 0.137 g Au/t for dumps.\n7.The average grades of the Inferred Mineral Resources are comprised of the weighted average of Oxide, Mixed, Sulfide, and dumps mineral resources. Alluvium mineralized materials are not included in the mineral resources.\n8.Mineral Resources within the optimized pit are block-diluted tabulations. Dumps mineral resources are undiluted tabulations.\n9.Mineral Resources potentially amenable to open pit mining methods are reported using a gold price of US$1,750/oz, a silver price of US$22/oz, a throughput rate of 30,000 tonnes/day, assumed metallurgical recoveries of 72.7% for Au and 28.2% for Ag, mining costs of US$2.00/tonne mined, heap leach processing costs of US$3.08/tonne processed, bio-leach processing costs of US$9.84/tonne processed general and administrative costs of $0.46/tonne processed. Gold and silver commodity prices were selected based on analysis of the three-year running average at the end of August 2022.\n10.Rounding may result in apparent discrepancies between tons, grade, and contained metal content.\nSummary Gold Mineral Reserves as of June 30, 2022(1,2,3,4):\nProven Mineral Reserves\nProbable Mineral Reserves\nTotal Mineral Reserves\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nUnited States\nGrassy Mountain\n0.18\n1,652\n0.20\n1,911\n0.20\nTotal\n0.18\n1,652\n0.20\n1,911\n0.20\nSummary Silver Mineral Reserves as of June 30, 2022(1,2,3,4):\nProven Mineral Reserves\nProbable Mineral Reserves\nTotal Mineral Reserves\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nUnited States\nGrassy Mountain\n0.26\n1,652\n0.29\n1,911\n0.29\nTotal\n0.26\n1,652\n0.29\n1,911\n0.29\n1.The term reserve means that part of a mineral deposit that can be economically and legally extracted or produced at the time of the reserve determination. The term proven (measured) reserves means reserves for which (a) quantity is computed from dimensions revealed in outcrops, trenches, workings or drill holes, grade and/or quality are computed from the results of detailed sampling; and (b) the sites for inspection, sampling and measurements are spaced so closely and the geologic character is sufficiently defined that size, shape, depth and mineral content of reserves are well established. The term probable (indicated) reserves means reserves for which quantity and grade and/or quality are computed from information similar to that used for proven (measured) reserves, but the sites for inspection, sampling and measurement are farther apart or are otherwise less adequately spaced. The degree of assurance, although lower than that for proven (measured) reserves, is high enough to assume continuity between points of observation. The term cutoff grade means the lowest grade of mineralized material considered economic to process. Cutoff grades vary between deposits depending upon prevailing economic conditions, mineability of the deposit, by-products, amenability of the mineralized material to silver or gold extraction and type of milling or leaching facilities available.\n2.Mineral reserves have an effective date of June 30, 2022. The Qualified Person firm responsible for the mineral reserves estimate is Arrowhead Underground LLC.\n3.Mineral Reserves are reported inside stope designs assuming drift-and-fill mining methods, and an economic gold equivalent cut-off grade of 0.10 oz/ton AuEq. The economic cut-off grade estimate uses a gold price of $1,600/oz, mining costs of $100/ton processed, surface re-handle costs of $0.20/ton processed, process costs of $35/ton processed, general and administrative costs of $20/ton processed, and refining costs of $6/oz Au recovered. Metallurgical recovery is 92.8% for gold. Mining recovery is 97% and mining dilution is assumed to be 8%. Mineralization that was either not classified or was assigned to Inferred Mineral Resources was set to waste. A 1.5% NSR royalty is payable. The reserves reference point is the FS mill crusher.\n4.Total fully diluted Mineral Reserves includes Proven and Probable reserves plus dilution les ore lost, see detail table for each project\nIndividual Properties\nGRASSY MOUNTAIN PROPERTY\nOverview and Location\nThe Grassy Mountain Project is located in Malheur County, Oregon, approximately 22 miles south of Vale, Oregon, and roughly 70 miles west of Boise, Idaho (43°40'10.8\"N 117°21'34.2\"W). The property is accessed by vehicle from the town of Vale by a private and BLM maintained dirt road. The project site is situated in the rolling hills of the high desert region of the far western Snake River Plain and consists of 455 unpatented lode claims and 3 patented lode claims all totaling roughly 8,280 acres. The local terrain is gentle to moderate, with elevations ranging from 3,300 to 4,300 feet above mean sea level. The geological setting, hydrothermal alteration, styles of gold-silver mineralization, and close spatial and timing association with silica sinter deposition, indicate that Grassy Mountain is an example of the hot-springs subtype of low-sulfidation, epithermal precious-metals deposits.\nPower and Water\nTo effect mining operations power and water source infrastructure would need to be developed as it does not currently exist.\nProperty Agreements and Royalty Obligations\nThe following map illustrates the mining claims subject to royalty payments at the Grassy Mountain Project:\nSherry and Yates Inc.\nPrior to 2018, Calico had an annual lease agreement in place with Sherry & Yates Inc. Under the agreement Calico was required to make annual advance royalty payments at a rate of $100,000 per year. In a mining production scenario, the agreement provided for a production royalty payments based on the price of gold. In February 2018, Paramount exercised its option to reduce the existing Net Smelter Royalty from 6% down to 1.5% and acquired all the rights to the unpatented and patented mining claims subject to the agreement at the Grassy Mountain Project for a total payment of $2.4 million.\nSeabridge Gold\nSeabridge Gold Inc. (Seabridge), a TSX and NYSE listed company, holds a net profits interest (NPI) in a mining scenario at Grassy Mountain. The NPI is calculated at a rate of 10% on net profits on certain mining claims. Seabridge also holds an NPI put option in which during the 30-day period immediately following the day that Calico had delivered notice to Seabridge that a positive production decision has been made and construction financing has been secured with respect to the Grassy Mountain Project, Seabridge may cause Calico to purchase the NPI for CDN$10,000,000. If Seabridge exercises the right to cause Calico to purchase the NPI, the Company would likely need to seek additional equity or other financing to fund the purchase, which financing may not be available to the Company on favorable terms or at all.\nOther agreements\nCryla LLC (\"Cryla\") leased 28 unpatented lode mining claims located west of Grassy Mountain to Calico in 2018. Calico is required to make an annual lease payment of $60,000. After June 2020, Calico may elect to acquire the property for $560,000 plus $3/oz of gold reserves, as defined by a prefeasibility or higher confidence-level study. Cryla is entitled to a 2% NSR if the gold price is ≤US$1,500/oz and a 4% NSR if the gold price >US$1,500/oz. Calico is entitled to reduce the NSR to 1% by paying Cryla $800,000 under any circumstances. No Mineral Resources or Mineral Reserves are estimated on the Cryla claims.\nPrevious Operators\nCompanies and individuals involved in exploration prior to Paramounts Project interest include prospectors Richard Dick Sherry and Eugene Skip Yates (1986), Atlas Precious Metals (Atlas) (1986 to 1992), Golden Predator Mines U.S. Inc., Newmont\nExploration Ltd (Newmont) (1992-1996), Tombstone Exploration Company Ltd (Tombstone) (1998), Seabridge, and Calico (2000 to 2015). Work completed included reconnaissance, geological mapping, geochemical sampling (soil, float, rock chip), geophysical surveys (airborne magnetic and radiometric, ground-based gravity, gradient array (IP/resistivity) controlled-source audio-frequency magnetotelluric (CSAMT)), core and reverse circulation (RC) drilling, and Mineral Resource estimation. This work defined the Grassy Mountain deposit, on which a feasibility study was completed in 1990 by Atlas assuming a combined heap leach/milling operation and open pit mining methods.\nWork Completed by Paramount\nSince acquiring its Project interest in 2016, Paramount has conducted an exploration review of the available Project data, helicopter-borne aeromagnetic and radiometric and CSAMT ground geophysical surveys, drilling, Mineral Resource and Mineral Reserve estimation, baseline environmental studies, and mining studies.\nIn addition to the above exploration programs, Paramount has progressed the Grassy Mountain Project through several stages of the state and federal permitting process. The Project will require county level, state level and federal permits to construct, operate and close a mining operation.\nIn November 2019, Paramount submitted its Consolidated Permit Application (CPA) to DOGAMI to enable the Company to build and operate its proposed, high grade underground gold mine located in Malheur County. The Application was reviewed by the DOGAMI and cooperating agencies for completeness. As part of this process, the permitting agencies provided Paramount with a list of supplemental information and recommendations required to submit a modified CPA. Paramount, the DOGAMI and the permitting agencies continued to work together to discuss the additional information requested, ensuring the submission of a complete modified CPA which will trigger the 225 day maximum permit evaluation process, upon which draft permits are issued.\nIn February 2020, the Company submitted a revised Plan of Operation (the PoO) to the BLM outlining the Companys plans to build and operate the proposed Grassy Mountain underground gold mine. The BLM has reviewed the PoO for completeness and has provided the Company with comments to address. The BLM has previously reviewed 19 of the baseline data reports (BDRs) and their requests for clarifications have all been addressed. The BLM will register a Notice of Intent (the Notice) in the Federal Register once the application is deemed complete. The Notice initiates the Environmental Impact Statement (EIS) process under the National Environmental Policy Act.\nIn December of 2021, Paramount submitted a modified CPA with the State of Oregon and submitted a modified PoO to the BLM. Both modified applications incorporated additional information required by the regulators and mine design optimizations that were a result of feedback provided in Paramounts initial application.\nAs of June 30, 2022, the net book value of the Grassy Mountain Property was approximately $23.2 million.\nTechnical Report Summary\nThe following is a brief summary of the proposed mining operation as detailed in the Technical Report Summary (the \"Grassy TRS\") on the Grassy Mountain Project, Oregon U.S.A. prepared for the Company by QP, Ausenco with an effective date of June 30, 2022. For more information, see Exhibit 96.1.\nThe Grassy Mountain mine will be an underground operation accessed via one decline and a system of internal ramps. One ventilation raise is included in the design to be used for ventilation and secondary egress. The mechanized cut-and-fill mining method was selected. The mining direction will be underhand. Cemented rock fill (CRF) will be used for backfill. The mechanized cut-and-fill method is highly flexible and can achieve high recovery rates in deposits with complex geometries, as is the case at the Grassy Mountain deposit. The estimated mine life is eight years\nThe process plant will be designed with conventional processing unit operations frequently used within the gold processing industry. The process plant will treat 750 tons/d and will operate with two shifts per day, 365 days per year, producing gold doré bars. The major equipment within the process plant is specified in accordance with the climate, site conditions, metal grades and metallurgical performance outlined in this report. Any deleterious metals present in the ore such as Mercury will be abated by specialized equipment installed in the process plant and are not expected to impact payability terms. The plant will have average head grades of 0.206 oz/ton Au and 0.293 oz/ton Ag.\nThe plant feed will be trucked from the underground mine to a modular crushing facility that will include a jaw crusher as the primary stage and a cone crusher for secondary size reduction. The crushed ore will be ground by a ball mill in closed circuit with a hydro-cyclone cluster. The hydro-cyclone overflow with P80 of 150 mesh (106 µm) will flow to a leach-carbon-in-leach (CIL) recovery circuit via a pre-aeration tank. Gold and silver leached in the CIL circuit will be recovered onto activated carbon and eluted in a pressurized Zadra-style elution circuit and then recovered by electrowinning in the gold room. The gold-silver precipitate will be dried in a mercury retort oven and then mixed with fluxes and smelted in a furnace to pour doré bars. Carbon will be re-activated in a carbon regeneration kiln before being returned to the CIL circuit. CIL tails will be treated for cyanide destruction prior to pumping to the tailings storage facility (TSF) for disposal. The installed power for the process plant will be 4,445 hp and the power consumption is estimated to be 72 kWh/ton processed. Raw water will be pumped from borehole wells to a raw-water storage tank. Potable water\nwill be sourced from the raw water tank and treated by a potable water treatment plant. Gland water will be supplied from the raw-water tank. Process water will primarily consist of TSF reclaim water. Reagents will include lime, sodium cyanide, sodium hydroxide, copper sulfate, hydrochloric acid and sodium metabisulfite.\nA summary of the forecast project economics are as follows:\nArea\nItem\nUnits\nLOM Total/Avg.\nGeneral\nGold price\nUS$/oz\n1,750\nSilver price\nUS$/oz\n22.00\nMine life\nyears\n7.75\nTotal mill feed tons\ntons x 1,000\n2,070\nProduction (gold)\nMill head grade Au\noz/ton\n0.19\nMill recovery rate Au\n%\n92.78%\nTotal mill ounces recovered Au\noz x 1,000\n361.8\nTotal average annual production Au\noz x 1,000\n46.6\nProduction (silver)\nMill head grade Ag\noz/ton\n0.28\nMill recovery rate Ag\n%\n73.46%\nTotal mill ounces recovered Ag\noz x 1,000\n424.8\nTotal average annual production Ag\noz x 1,000\n54.5\nOperating Costs\nMining cost\nUS$/ton milled\n67.29\nProcessing cost\nUS$/ton milled\n33.92\nG&A cost\nUS$/ton milled\n16.57\nTotal operating costs\nUS$/ton milled\n117.78\nRefining cost Au\nUS$/oz\n5.00\nRefining cost Ag\nUS$/oz\n0.50\n*Cash costs net of by-products\nUS$/oz Au\n680.97\n**AISC net of by-products\nUS$/oz Au\n815.09\nCapital Costs\nInitial capital\nUS$ M\n136.2\nSustaining capital\nUS$ M\n36.1\nClosure costs\nUS$ M\n12.4\nFinancials(pre-tax)\nPre-tax NPV, 5%\nUS$ M\n134.9\nPre-tax IRR\n%\n24.22%\nPre-tax Payback\nyears\n3.32\nFinancials(post-tax)\nPost-tax NPV, 5%\nUS$ M\n114.1\nPost-tax IRR\n%\n22.54%\nPost-tax Payback\nyears\n3.32\nPermitting and Current Proposed Development Program\nParamount expects to continue with both state and federal permitting activities for its proposed underground gold mine. With 22 baseline studies approved and accepted by the State of Oregon and the submitted modified CPA, the Company will continue working with the appropriate permitting agencies to ensure a complete permit application. Once the State of Oregon determines that the CPA is complete it will proceed to the drafting permits process which includes issuing an environmental evaluation and socio-economic impact analysis and the drafting of all relevant permits for the project. Under Oregon law the drafting permits process, which includes public notice and public hearing period, must be completed within 225 days. Subsequent to the drafting permit process if draft permits are issued, up to an additional 120 days is provided for further public consultation and the development and distribution of final permits. The costs incurred by the State of Oregon for the drafting permit and final permit processes will be reimbursed by the Company directly through cost recovery invoices received from DOGAMI or by permit fees established by individual permitting agencies. In addition to the state incurred costs, the Company will engage with its permitting and technical advisors and consultants to respond to any further information requests from the State's permitting agencies.\nWith respect to federal permitting, once the Notice is registered and the EIS had commenced, Paramount will also engage with its permitting and technical advisors to assist in the process. Paramount is required to reimburse the BLM for the cost of the EIS.\nParamount has budgeted $3.0 million for its fiscal year ended June 30, 2023, for the above stated development program.\nGrassy Mountain Property Summary of Mineral Resources at the End of June 30, 2022\nGold (Au)(1,2,3,4,5,6,7)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nMetallurgical Recovery\nMeasured mineral resources\n21,153\n0.017\n%\nIndicated mineral resources\n12,902\n0.030\n%\nMeasured + Indicated mineral resources\n34,055\n0.022\n%\nInferred mineral resources\n1,151\n0.037\n%\nSilver (Ag)(1,2,3,4,5,6,7)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nMetallurgical Recovery\nMeasured mineral resources\n21,153\n0.072\n1,529\n%\nIndicated mineral resources\n12,902\n0.115\n1,480\n%\nMeasured + Indicated mineral resources\n34,055\n0.088\n3,009\n%\nInferred mineral resources\n1,151\n0.109\n%\n1.The Qualified Person firm responsible for the mineral resources estimate is RESPEC Company LLC.\n2.Mineral Resources comprised all model blocks at a 0.011 oz/ton AuEq cut-off that lie within an optimized pit plus blocks at a 0.085 oz/ton AuEq cut-off that lie outside of the optimized pit.\n3.oz/ton AuEq (gold equivalent grade) = oz/ton Au + (oz/ton Ag ÷ 106).\n4.Mineral Resources summarized in the table immediately above are reported exclusive of the Mineral Resources converted to Mineral Reserves. Mineral Resources that are not Mineral Reserves do not have demonstrated economic viability.\n5.Mineral Resources potentially amenable to open pit mining methods are reported using a gold price of US$1,750/oz, a silver price of US$22/oz, a throughput rate of 5,000 tons/day, assumed metallurgical recoveries of 80% for Au and 60% for Ag, mining costs of US$2.50/ton mined, processing costs of US$13.00/ton processed, general and administrative costs of $2.22/ton processed, and refining costs of $5.00/oz Au and $0.50/oz Ag produced. Mineral Resources potentially amenable to underground mining methods are reported using a gold price of US$1,750/oz, a silver price of US$22/oz, a throughput rate of 5,000 tons/day, assumed metallurgical recoveries of 90% gold equivalent, mining costs of US$90/ton mined, processing costs of US$30/ton processed, general and administrative costs of $15.00/ton processed, and refining costs of $5.00/oz gold equivalent produced.\n6.The effective date of the estimate is June 30, 2022;\n7.Rounding may result in apparent discrepancies between tons, grade, and contained metal content.\nGrassy Mountain Property Summary of Mineral Reserves at the End of June 30, 2022\nGold (Au)(1,2,3)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nMetallurgical Recovery\nProven mineral reserves\n0.18\n94.5\n%\nProbable mineral reserves\n1,652\n0.20\n94.5\n%\nTotal mineral reserves\n1,912\n0.20\n94.5\n%\nTotal plus mining loss & dilution\n2,070\n0.19\n94.5\n%\nSilver (Ag)(1,2,3)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nMetallurgical Recovery\nProven mineral reserves\n0.26\n73.4\n%\nProbable mineral reserves\n1,652\n0.29\n73.4\n%\nTotal mineral reserves\n1,912\n0.29\n73.4\n%\nTotal plus mining loss & dilution\n2,070\n0.28\n73.4\n%\n1.Mineral reserves have an effective date of June 30, 2022. The Qualified Person firm responsible for the mineral reserves estimate is Arrowhead Underground LLC.\n2.Mineral Reserves are reported inside stope designs assuming drift-and-fill mining methods, and an economic gold equivalent cut-off grade of 0.10 oz/ton AuEq. The economic cut-off grade estimate uses a gold price of $1,600/oz, mining costs of $100/ton processed, surface re-handle costs of $0.20/ton processed, process costs of $35/ton processed, general and administrative costs of $20/ton processed, and refining costs of $6/oz Au recovered. Metallurgical recovery is 94.5% for gold. Mining recovery is 97% and mining dilution is assumed to be 8%. Mineralization that was either not classified or was assigned to Inferred Mineral Resources was set to waste. A 1.5% NSR royalty is payable. The reserves reference point is the FS mill crusher.\n3.Tonnage and contained metal have been rounded to reflect the accuracy of the estimate. Apparent discrepancies are due to rounding.\nInternal Controls - Grassy Mountain Property\nParamounts internal controls at the Grassy Mountain project are designed to provide reasonable assurance that information and processes utilized in assessing its exploration results, as well as mineral resource and reserve estimation, and are reasonable and in line with industry best practices. These internal controls include quality assurance and quality control (QA/QC) programs in the collection and analysis of drillhole assay information based on:\nThird-party certified labs used for assays reported in public disclosure or resource models;\nDrill programs with insertion of blank, duplicate, and certified reference materials; and\nSufficient QA/QC results for the analytical programs.\nAll core and reverse-circulation samples were cataloged and stored in secure and designated areas on Paramounts warehouse in vale Oregon. Data has been subject to validation, which includes checks on downhole surveys, collar coordinates, geological data, and assay data.\nPrior to use in mineral resource or mineral reserve estimation, the selected data to support estimation were compiled from Paramounts databases into RESPECs GeoSequel database and reviewed for improbable entries. Written procedures and guidelines are used to support estimation methods and approaches. Estimations include evaluation of modifying and technical factors. Internal controls and resource estimation procedures are discussed where required in the relevant chapters of the technical report summary.\nSLEEPER GOLD PROJECT\nOverview and Location\nSleeper is a material exploration property of the Company. The Company has the rights to explore, develop and mine the property through our 100% ownership of unpatented lode mining claims. Sleeper is located 26 miles northwest of Winnemucca, Nevada (41°20'03.1\"N 118°03'09.7\"W). Automobile and truck access to the property is by Interstate Highway 80 to Winnemucca, north on Highway 95 for 32 miles, west on Highway 140 for 14 miles, and then south for 6 miles on the maintained gravel Sod House Road to the project site. An office building, heavy equipment enclosure and warehousing facility are present on the Sleeper Gold Property. Necessary supplies, equipment and services to carry out full sequence exploration and mining development projects are available in Winnemucca, Reno, and Elko, Nevada.\nMining Claims\nThe Sleeper Gold mine and its 1,044 unpatented lode mining claims were acquired by PGSC through its acquisition of X-Cal Resources Ltd. in August 2010. Additional mining claims have been staked or acquired which now comprise the Sleeper Gold Project.\nThe 100% owned mining claims are summarized in the following table, (acreage is approximate):\nThe Sleeper Gold Project Properties\nClaims\nApproximate Acres\nSleeper Gold Mine\n1,044\n16,171\nDunes\n7,405\nMimi\n18,243\nSouth Sleeper\n3,098\nTotal\n2,474\n44,917\nThe following map illustrates the general location of the Sleeper Gold Project and the associated mining claims:\nProperty Agreements and Royalty Obligations:\nThe Snyder Syndicate, a private company, holds a one percent (1%) net smelter return royalty on the 1,044 Sleeper Gold mine claims in a mining scenario.\nFranco-Nevada U.S. Corporation (Franco) holds a two percent (2%) net smelter return royalty on minerals produced from 2,474 mining claims at the Sleeper Gold Project.\nEvolving Gold holds a 2% net smelter return royalty on minerals produced from the SSG, SP and SS mining claims.\nDry Lake Placer Association hold a 3% net smelter return royalty on minerals produced from the Dry Creek Placer mining claims.\nICN holds a 0.5% net smelter return royalty on the SS & SP mining claims as well as a 1.5% net smelter return royalty on the Blue mining claims.\nThe following map illustrates the claims subject to the royalty:\nHistory of Previous Operations\nThe Sleeper Gold Project includes a historic open pit mine (the Sleeper Gold mine) operated by AMAX Gold Inc. (Amax) from 1986 until 1996, which produced 1.66 million ounces of gold and 2.3 million ounces of silver. All processing facilities and equipment related to the mining operations conducted by Amax have been removed from the site.\nPower and Water\nAs a result of Amaxs mine operation from 1986 to 1996, electrical power is provided to the property by power lines. Water is available from two deep wells located on the property.\nParamounts Exploration History at Sleeper Gold Project\nPGSC conducted its first exploration program at the Sleeper Gold mine in October 2010. It consisted of 19 drill holes totaling 18,065 feet and focused on verifying data on existing models and confirming continuity and strike extension of known mineralized zones. From July 1, 2011 through June 30, 2012, PGSC completed 79 drill holes totaling 21,013 feet and followed that up in the period from July 1, 2012, through June 30, 2013, with 38 drill holes totaling 55,104 feet.\nIn August 2011, PGSC announced the acquisition of 606 unpatented lode mining claims (the Dunes Project) located eleven miles south of the Sleeper Gold mine from ICN Resources Ltd. (ICN). In consideration, PGSC issued 400,000 shares of its common stock to ICN.\nIn July 2012, PGSC announced the staking of 920 new lode mining claims (the Mimi Project) adjacent to the west and immediately south, of the Sleeper Gold mine. The Mimi Project totals 18,400 acres.\nIn 2013, PGSC announced several results of a drilling campaign which was focused in and around the existing resource and pit areas. Assay results extended the mineralization east and south of the existing resource, opened up new depth potential below the existing sleeper pit and intercepted exceptional results in several zones. Additionally, PGSC undertook an extensive database review and as a result, a total of 473 core and RC holes have been re-logged and new cross-sections were generated. Paramount completed a re-interpreted lithological and structural model which will allow us to plan a new drill program and to update our mineralized material estimate model.\nIn August 2014, PGSC dropped a total of 212 mining claims from the Dunes and Mimi areas of the Sleeper Gold Project. These claims no longer had any geological value to the Company.\nIn August 2015, we completed an initial geophysical survey which consisted of a helicopter magnetometry study. The survey defined several possible exploration targets which were reviewed by our geological team. Additional surveys on areas covered by overburden will be evaluated for further testing. This testing can include Induced Polarization programs or other indirect methodologies. The Company believes that the resulting data derived from the geophysical program will produce valuable drilling targets. Future drill programs will be designed with the aim identifying new zones of mineralization with an emphasis on areas covered with overburden.\nIn April 2021, we purchased 152 unpatented lode claims from South Sleeper Resources LLC for a total consideration of $365,441. The claims are located approximately 2 miles south of past producing Sleeper Gold Mine. The purchased claims carry a mineral production royalty based on a Net Smelter Returns (NSR) of one percent (1%). The purchased claims are without known mineral reserves.\nAs of June 30, 2022, the net book value of the Sleeper Gold Property was approximately $28.5 million.\nTechnical Report Summary\nThe Company is reporting a mineral resource estimate as prepared by QP, RESPEC Company LLC with an effective date of June 30, 2022. To determine the estimate the following material assumptions and criteria were used:\nThe Sleeper deposit has the potential to be mined by open pit methods. The Mineral Resources were tabulated to reflect potential open pit mining and heap leach and bio-oxidation extraction as the primary scenario. To meet the requirement of reasonable prospects for eventual economic extraction, a pit optimization was run using the parameters summarized in following Table:\nItem\nValue\nUnit\nMining Cost\n2.00\n$/tonne\nHeap Leach Processing cost\n3.08\n$/tonne processed\nBiooxidation Processing cost\n9.84\n$/tonne processed\nProcess rate\n30,000\ntonnes per day processed\nGeneral and Administration cost\n0.46\n$/tonne processed\nAu price\n1,750\n$/oz\nAg price\n$/oz\nAu recovery\n72.7\npercent\nAg recovery\n28.2\npercent\nRoyalty\n1.5%\nNSR\nThe pit shell created by the optimization was used to constrain the mineral resources, which are reported at a cut-off grade of 0.137 g Au/t for oxide and mixed materials, whereas the sulfide material is reported at a cut-off grade of 0.251 g Au/t. The gold cut-off grade was calculated using the processing, general and administrative costs, gold price, recovery, refining cost, and royalty provided in above Table. The mining cost is not included in the determination of the cut-off grade, as all material in the conceptual pit would potentially be mined as either ore or waste. The reference point at which the mineral resources are defined is therefore at the top rim of the pit, where material equal to or greater than the cut-off grade would be processed.\nThe metal prices used in the pit optimization and the determination of the gold cut-off grade and gold-equivalency factor are derived roughly from three-year moving-average prices as of August 2022 ($1,750/oz and $22/oz for gold and silver, respectively).\nThe open pit resource estimates are based on a 30,000 tonnes per day processing rate, with processing assumed to consist of crushing, milling, and first-stage gravity separation followed by carbon-in-leach recovery.\nFor more information for mineral resource estimate, see Exhibit 96.1 section 11.8, the Technical Report Summary on the Sleeper Gold Project, Nevada, U.S.A. (\"Sleeper TRS\") prepared for the Company by QP, RESPEC Company LLC with an effective date of June 30, 2022.\nCurrent Proposed Program\nIn completing the Sleeper TRS, the Company undertook a comprehensive review of the projects database which included over 4,000 drill holes dating back to the early 1980s from the time of the first discovery of mineralization to when the mine was closed in 1996. Given the lack of digitization of the original drill hole database, the Company has, under the direction of QP RESPEC Company LLC, engaged in digitizing and re-verifying the entire Sleeper database.\nOnce the data verification is complete and a higher confidence level can be applied to the resources and allowing for additional 3D modeling, Paramount will continue to advance the evaluation of Sleeper to update the Initial Assessment in 2023. The Company has budgeted $0.25 million for this program.\nGeology and Mineralization\nThe Sleeper Gold Project is situated within the western, apparently older, part of the Northern Nevada Rift geologic province of Miocene age, along the western flank of the Slumbering Hills within Desert Valley. The geological structures that underlie Desert Valley appear to have been down-dropped 3,000 to 3,300 feet along the north-to northeast-trending normal faults along the western edge of the Slumbering Hills.\nFour main types of gold mineralization are found within the Sleeper Gold Project deposit and may represent a continuum as the system evolved from a high level, high sulfidation system dominated by intrusion related fluids and volatiles to a low sulfidation meteoric water dominant system. In this setting the paragenetic relationships of the differing mineralization styles are as follows:\nEarly - quartz-pyrite-marcasite stockwork;\nIntermediate - medium-grade, silica-pyrite-marcasite cemented breccias localized on zones of structural weakness;\nLate - high-grade, banded, quartz-adularia-electrum-(sericite) veins; and\nPost - alluvial gold-silver deposits in Pliocene gravels.\nReclamation\nParamount is responsible for managing the reclamation activities from the previous mine operations at the Sleeper Gold Mine as directed by the BLM and the Nevada State Department of Environmental Protection. Under the filed BLM Plan of Operations (PoO) and reclamation permit a surety bond in the amount of $4,010,403 has been posted as financial security to ensure that required reclamation activities are fulfilled. The surety bond for the Sleeper mine reclamation activities has been posted on behalf of the Company by an insurance company and forms a part of the Companys comprehensive insurance program. The insurance policy, which is in effect until 2033, covers reclamation costs up to an aggregate of $25 million. The Company periodically submits updates to its Reclamation Cost Estimate (RCE) to the BLM to account for completed reclamation work or new reclamation requirements. As of September 2020, the Companys RCE submitted in October 2019 was accepted by the BLM and the posted surety bond was deemed sufficient. The Company expects to file a revised RCE in the second half of 2021 with the BLM. The revised RCE will incorporate the significant reclamation work that has been completed by the Company over the past several years.\nIn addition to the BLM reclamation requirements, the Company is required to satisfy the State of Nevadas reclamation requirements under various permits it holds for the Sleeper Gold Project.\nSummary of Sleeper Gold Property Mineral Resources at the End of June 30, 2022\nGold (Au) (1,2,3,4,5,6,7)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nMetallurgical Recovery\nInferred mineral resources\n237,600\n0.0102\n2,417\n72.7\n%\nSilver (Ag) (1,2,3,4,5,6,7)\nTons (000s)\nGrade (oz./ton)\nOunces (000s)\nMetallurgical Recovery\nInferred mineral resources\n237,600\n0.1030\n24,458\n28.2\n%\n1.The estimate of mineral resources was done by RESPEC Company LLC in metric tonnes.\n2.Mineral Resources comprised all model blocks at a 0.137 g Au/t cut-off for Oxide and Mixed within an optimized pit; 0.251 g Au/t for Sulfide within an optimized pit; and 0.137 g Au/t for dumps.\n3.The average grades of the Inferred Mineral Resources are comprised of the weighted average of Oxide, Mixed, Sulfide, and dumps mineral resources. Alluvium mineralized materials are not included in the mineral resources.\n4.Mineral Resources within the optimized pit are block-diluted tabulations. Dumps mineral resources are undiluted tabulations.\n5.Mineral Resources that are not Mineral Reserves do not have demonstrated economic viability.\n6.Mineral Resources potentially amenable to open pit mining methods are reported using a gold price of US$1,750/oz, a silver price of US$22/oz, a throughput rate of 30,000 tonnes/day, assumed metallurgical recoveries of 72.7% for Au and 28.2% for Ag, mining costs of US$2.00/tonne mined, heap leach processing costs of US$3.08/tonne processed, bio-leach processing costs of US$9.84/tonne processed general and administrative costs of $0.46/tonne processed. Gold and silver commodity prices were selected based on analysis of the three-year running average at the end of August 2022.\n7.Rounding may result in apparent discrepancies between tonnes, grade, and contained metal content.\nInternal Controls - Sleeper Gold Property\nParamounts internal controls at the Sleeper project are designed to provide reasonable assurance that information and processes utilized in assessing its exploration results, as well as mineral resource and reserve estimation, and are reasonable and in line with industry best practices. These internal controls include quality assurance and quality control (QA/QC) programs in the collection and analysis of drillhole assay information based on:\nThird-party certified labs used for assays reported in public disclosure or resource models;\nDrill programs with insertion of blank, duplicate, and certified reference materials; and\nSufficient QA/QC results for the analytical programs.\nAll core and reverse-circulation samples were cataloged and stored in secure and designated areas on Paramounts property. Data has been subject to validation, which includes checks on downhole surveys, collar coordinates, geological data, and assay data.\nPrior to use in mineral resource or mineral reserve estimation, the selected data to support estimation were compiled from Paramounts databases into RESPECs GeoSequel database and reviewed for improbable entries. Written procedures and guidelines are used to support estimation methods and approaches. Estimations include evaluation of modifying and technical factors. Internal controls and resource estimation procedures are discussed where required in the relevant chapters of the technical report summary.\nExploration and Drilling\nParamounts internal controls protocols for exploration drilling are summarized in Section 8.2 of the technical report summary for the Sleeper property.\nMineral Resource Estimates\nThe methods and procedures used by RESPEC for the estimation of Paramounts mineral resources at the Sleeper property are summarized in Section 11 of the Sleeper technical report summary. Mineral resources and mineral reserves are estimates that contain inherent risk and depend upon geologic interpretation and statistical inferences drawn from drilling and sampling analysis, which may prove to be unreliable. In addition, there are risks inherent to the assumptions of gold and silver recoveries and prices used to estimate cut off grades for the pit optimizations that constrain the estimated resources. Sections 11.8 and 11.9 of the Sleeper technical report summary provide information on the assessment of these risks.\nOther Non-Material Properties\nNEVADA\nThe Company owns additional mining claims in the State of Nevada that represents its non-material properties. The Mill Creek property which comprises 36 unpatented lode mining claims are located in Lander County. The Company intends to maintain the annual mining claim fees of approximately $7,000 for these claims.\nThe Mill Creek claims are without known mineral reserves and there is no current exploratory work being performed.\nIn August 2021, Paramount entered into an agreement with Nevada Select Royalty (\"Nevada Select\") to purchase 100% interest in the Bald Peak Project located in Mineral County, Nevada. The total consideration of $300,000 is payable to Nevada Select based upon a schedule determined by when Paramount receives a drilling permit from the federal regulators. Nevada Select will retain a 3% NSR and Paramount will have the right to reduce the NSR to 2% for a payment of $1 million.\nOREGON\nIn October 2018, Paramount entered into an agreement with Cryla LLC (Cryla) that gives the Company the right to acquire 44 mining claims covering 580 acres located immediately to the west of the proposed Grassy Mountain Project. Paramount will make annual lease payments to Cryla and following year three of the agreement, Paramount has the right to purchase the claims for a cash payment of $560,000. If purchased, Cryla will maintain a production NSR based on the prevailing price of gold. Paramount has the right to reduce the NSR from 2% to 1% for a payment of $800,000.\nIn November 2018, Paramount entered into an agreement with Nevada Select to purchase 100% interest in the Frost Project, which consists of 40 mining claims located approximately 12 miles west of its Grassy Mountain Project. A total consideration of $250,000 payable to Nevada Select will be based on certain events over time. Nevada Select will retain a 2% NSR on the Frost Claims and Paramount has the right to reduce the NSR to 1% for a payment of $1 million. Item 3. Legal Proceedings.\nNone Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMARKET INFORMATION\nOur common stock began trading on the NYSE American LLC under the symbol PZG on April 20, 2015. Prior to that time, there was no public market for our stock. The following table sets forth for the indicated periods the high and low intra-day sales prices per share for our common stock on the NYSE American LLC for the two most recent years.\nHigh\nLow\nYear Ended June 30, 2022\nFirst Quarter\n$\n1.02\n$\n0.76\nSecond Quarter\n$\n0.91\n$\n0.65\nThird Quarter\n$\n1.10\n$\n0.53\nFourth Quarter\n$\n0.72\n$\n0.45\nYear Ended June 30, 2021\nFirst Quarter\n$\n1.48\n$\n1.05\nSecond Quarter\n$\n1.30\n$\n0.96\nThird Quarter\n$\n1.59\n$\n0.98\nFourth Quarter\n$\n1.10\n$\n0.96\nHOLDERS\nAs of October 11, 2022, there were 155 registered shareholders of our common stock.\nDIVIDENDS\nWe currently do not anticipate paying cash dividends for the foreseeable future.\nRECENT SALE OF UNREGISTERED SECURITIES AND USE OF PROCEEDS\nDuring the year-ended June 30, 2022, we issued 404,584 shares of common stock for payment of interest accrued and owing on our outstanding 2019 Convertible Notes. In issuing the foregoing securities, we relied on the exemptive provisions of Section 4(a)(2) of the Securities Act and Rule 506 thereunder.\nEQUITY COMPENSATION PLAN\nSet out below is information as of June 30, 2022 with respect to compensation plans (including individual compensation arrangements) under which our equity securities are authorized for issuance under our Equity Incentive Plan.\nEquity Compensation Plan Information\nPlan Category\nNumber of\nsecurities to be\nissued upon\nexercise of\noutstanding\noptions and RSUs\nWeighted-\naverage exercise\nprice per share of\noutstanding\noptions and RSUs\nNumber of\nsecurities\nremaining\navailable for\nfuture issuance\nunder equity\ncompensation\nplans\nEquity compensation plans approved by\nsecurity holders\n2,509,995\n$\n1.14\n724,005\nEquity compensation plans not approved by\nsecurity holders\n-\n$\n-\n-\nTOTAL\n2,509,995\n724,005\nAs of June 30, 2022, 701,000 restricted share units (\"RSUs\") were outstanding and 1,808,995 stock options were outstanding under our Equity Incentive Plans to acquire 2,509,995 Common Shares. Item 6. Selected Financial Data.\nNot applicable as a smaller reporting company. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nOverview\nWe are engaged in the business of acquiring, exploring and developing precious metal projects in the United States of America. Paramount owns both exploration and development stage projects in the states of Nevada and Oregon. We enhance the value of our projects by implementing exploration and engineering programs that are likely to expand and upgrade known mineral resources to mineral reserves. To further advance our projects towards the production decision, we manage the completion of the appropriate technical studies including feasibility studies and undertake permitting processes with the relevant local, state and federal regulators. The following discussion updates our outlook and plan of operations for the foreseeable future. It also analyzes our financial condition and summarizes the results of our operations for the years ended June 30, 2022 and 2021 and compares each years results to the results of the prior year.\nOperating Highlights:\nDuring the fiscal year-ended June, 2022, the Company conducted several exploration programs and continued with its permitting at its Grassy Mountain Project. Highlights include:\nSubmitted a modified Consolidated Permit Application (the CPA) with the State of Oregon seeking approval to construct and operate its proposed gold mine for its Grassy Mountain Project.\nSubmitted a modified Plan of Operation to the Bureau of Land Management (the BLM) for its proposes mining operations for its Grassy Mountain Project.\nEntering into an option agreement with Nevada Select Royalty to purchase 100% interest in the Bald Peak Project (Bald Peak) located in Mineral County, Nevada. Total consideration of $300,000 will be paid based on achieving certain milestones over time.\nCompleted a drill exploration program to test several targets identified to bring the Sleeper Gold Project back into production.\nCompleted surface sampling and a geophysical survey at its Bald Peak Project in Nevada. Both these programs confirm a large and shallow target that the Company will design and plan a new drill program in 2022.\nReceived positive assay results from geotechnical drill holes at its Grassy Mountain Project that indicate the potential for additional economic material to be used during mine operations.\nReceived from Malheur County an extension on the Conditional Use Permit for the proposed Grassy Mountain underground mine.\nCompleted a 15-hole reverse circulation drill program at the Frost Project which is located 12 miles from the Companys Grassy Mountain Project in Eastern Oregon. The program was designed to locate and test historical gold intercepts from drilling that was performed by the previous operators.\nCompleted a metallurgical testing program using Atmospheric Alkaline Oxidation recovery process for the treatment of sulfide mineralization at the Sleeper Gold Project.\nOutlook:\nWe believe that investors will gain a better understanding of our company if they understand how we measure and talk about our results. As an exploration and development company, we recognize the importance of managing our liquidity and capital resources. We pay close attention to non-discretionary cash expenses and look for ways to minimize them when possible. We ensure we have sufficient cash on hand to meet our annual land holding costs as the maintenance of mining claims and leases are essential to preserve the value of our mineral property assets.\nComparison of Operating Results for the year ended June 30, 2022 as compared to June 30, 2021\nResults of Operations\nWe did not earn any revenue from mining operations for the years ended June 30, 2022 and 2021. During the year ended June 30, 2022, we completed various activities and milestones as described above in operating highlights. Other normal course of business\nactivities included filing annual mining claim fees with the BLM, reclamation work at the Sleeper mine site and on-going reviews of its mining claims were completed.\nNet Loss\nOur net loss for the year ended June 30, 2022 was $7,837,316 compared to a net loss of $5,903,618 in the previous year. The increase of approximately 33% is fully described below. We will continue to incur losses for the foreseeable future as we continue with our planned exploration and development programs.\nExpenses\nExploration, Development and Reclamation and Land Holding Costs\nFor the year ended June 30, 2022, exploration and development expenses were $4,436,266 compared to $2,816,685 in the prior year. This represents an increase of 57% or $1,619,581 which was mainly due to the Company completing several exploration and development activities at both its Oregon and Nevada based properties. At Grassy Mountain, the Company continued with the permitting process with the State of Oregon and the BLM and submitted modified permit applications and at our Frost Property completed a drill program. Total exploration and development expenses at Grassy Mountain and Frost Project during the year were $2,859,348. At Sleeper, the Company completed a small drill program to test zones of mineralization and at its Bald Peak Project conducted rock surface sampling, completed a geophysical survey and planned for a future exploratory drill program. We also incurred expenses related to the reclamation program at the Sleeper Project. These reclamation expenses are reimbursed from an insurance policy the Company holds related to the closure and reclamation of the past producing Sleeper mine. Total exploration and reclamation expenses at our Nevada based properties during the year were $1,576,918.\nFor the year ended June 30, 2021, the Company mainly focused its development activities on the permitting process with the State of Oregon. Total development expense at Grassy Mountain in the previous year were $1,949,753. For the year ended June 30, 2021, the Company incurred $866,932 at its Sleeper Gold Project for reclamation and general exploration activities which included drill program planning.\nFor the year ended June 30, 2022, land holding costs increased by $99,948 or by 18% from the prior year of $540,401 to $640,349. The increase is primarily due the additional mining claim maintenance from the acquisition of new exploration properties.\nSalaries and Benefits\nFor the year ended June 30, 2022, salary and benefits decreased by 13% or by $177,149 from the prior year to $1,196,302. Salary and benefits are comprised of cash and stock-based compensation of the Companys executive and corporate administration teams. The decrease primarily reflects lower cash bonus and stock-based compensation recorded in the current year compared to the previous comparable year. Included in the salary and benefits expense amount for the year ended June 30, 2022 and 2021 was non-cash stock based compensation of $262,398 and $332,786 respectively.\nDirectors Compensation\nFor the year ended June 30, 2022, directors compensation decreased by 28% or by $44,977 from the prior year ended June 30, 2021. The decrease is due to the stock-based compensation recorded in the current year-ended June 30, 2022 compared to the prior year ended June 30, 2021.\nProfessional Fees and General and Administration\nFor the year ended June 30, 2022, professional fees were $130,765 compared to $174,039 in the prior year. This represents a decrease of 25% or $43,274. Professional fees included legal, advisory and consultant expenses incurred on corporate and operational activities being performed by the Company on a period-by-period basis.\nFor the year ended June 30, 2022, general and administration expenses increased by 17% to $565,466 from $483,608 in the prior year. The increase in expenses was mainly due to an increase in travel and marketing costs.\nAsset Retirement Obligation\nFor the year ended June 30, 2022, the Company's asset retirement obligation for the Sleeper Gold Project increased to $4,475,270 from $1,849,644 from the prior year ended June 30, 2021. $2,475,169 of the increase was a result of a change in estimate in the cost to convert ponds from the past mining operations to evaporation cell as required by NDEP. Due to the engineered designs required and approved by NDEP, the Company requested proposals to complete the pond conversions from third party contractors which were materially higher than its previous estimates. The work to complete the ponds are expected to be completed in the second half of\ncalendar year 2024 and the costs are expected to be reimbursed by the insurance policy held by the Company for government mandated reclamation at the Sleeper Gold Project.\nLiquidity and Capital Resources\nOperating, Investing and Financing Activities\nAt June 30, 2022, we had cash and cash equivalents of $2,484,156 compared to $3,113,064 as at June 30, 2021. In May 2020, the Company established an at the market equity offering program (ATM) with Cantor Fitzgerald & Co. and Canaccord Genuity LLC to proactively increase financial flexibility. During the fiscal year ended June 30, 2022 the Company issued 7,766,388 shares (2021- 3,209,133 shares) for net proceeds of $6,119,954 (2021 -$3,722,554) under the program. At June 30, 2022, the Companys prepaid expenses were $1,280,895 compared to $1,152,396 for the year-ended June 30, 2021. Included in the total for the year-ended June 30, 2022 were annual payments to hold the Companys mining claims for all its mineral properties of $568,572. The prepaid expenses also included amounts to secure a helicopter for Paramounts planned drill program at the Bald Peak Project.\nThe main uses of cash were comprised of the following material amounts:\nCash used to fund our operations, which included general and administration expenses, land holding costs, exploration and development programs at our mineral properties, of $6,701,139.\nIn addition to cash used in operating activities, the Company used and received cash as follows:\nCash used to purchase mining claims in the State of Nevada and equipment of $47,723;\nCash received from equity financings of $6,119,954.\nGoing Concern\nThe Consolidated Financial Statements of the Company have been prepared on a going concern basis, which means that the continuation of the Company is presumed even though events and conditions exist that, when considered in aggregate, raise substantial doubt about the Companys ability to continue as a going concern because it is possible that the Company will be required to adversely change its current business plan or many be unable to meet its obligations as they become due with one year after the date of that these financial statements were issued.\nParamount expects to continue to incur losses as a result of costs and expenses related to maintaining its properties and general and administrative expenses. Since 2015, the Company has relied on equity financings, debt financings and sale of royalties to fund its operations and the Company expects to rely on these forms of financing to fund operations into the near future. The Company will also continue to identify ways to reduce its cash expenditures.\nParamounts current business plan requires working capital to fund non-discretionary expenditures for its exploration and development activities on its mineral properties, mineral property holding costs and general and administrative expenses. It also requires approximately $4.3 million in capital to repay the 2019 convertible notes which become due in September 2023.\nWe anticipate our twelve-month cash expenditures for our fiscal year ending June 30, 2023 to be as follows:\n$3.3 million on corporate, land claim maintenance and general expenses\nFor discretionary exploration and development, subject to available cash on hand and additional share issuances, we are budgeting the following amounts:\n$3.0 million on the Grassy Mountain Project state and federal permitting activities\n$0.25 million on the Sleeper Gold Project\n$0.8 million on the Bald Peak exploration programs\nFor the planned reclamation activities required by state and federal regulators at Sleeper, the Company expects that these expenditures will be reimbursed by insurance proceeds. For any interest that accrues and is owing on the outstanding convertible debt, the Company expects to elect to pay the semi-annual interest payment in shares of its Common Stock.\nSubsequent to October 13, 2022, the Company expects to fund operations as follows:\nExisting cash on hand and working capital.\nThe existing ATM with Cantor Fitzgerald & Co. and Canaccord Genuity LLC.\nOther debt, equity financings and sale of royalties.\nHistorically, we have been successful in accessing capital through equity and debt financing arrangements or by the sale of royalties on its mineral properties, no assurance can be given that additional financing will be available to it in amounts sufficient to meet its needs, or on terms acceptable to the Company. In the event that we are unable to obtain additional capital or financing, our operations, exploration and development activities will be significantly adversely affected. The continuation of the Company as a going concern is dependent on having sufficient capital to maintain our operations and to repay the convertible notes which become due in September 2023. In considering our financing plans, our current working capital position and our ability to reduce operating expenses the Company believes there is substantial doubt about its ability to continue as a going concern twelve months after the date that our financial statements are issued.\nCritical Accounting Policies and Estimates\nManagement considers the following policies to be most critical in understanding the judgments that are involved in preparing the Companys consolidated financial statements and the uncertainties that could impact the results of operations, financial condition and cash flows. Our financial statements are affected by the accounting policies used and the estimates and assumptions made by management during their preparation. Management believes the Companys critical accounting policies are those related to mineral property acquisition costs, exploration and development cost, stock-based compensation, derivative accounting and foreign currency translation.\nEstimates\nThe Company prepares its consolidated financial statements and notes in conformity to United States Generally Accepted Accounting Principles (U.S. GAAP) and requires management to make estimates and assumptions that affect the reported amount of assets and liabilities and the reported amounts of revenue and expenses during the reporting period. On an ongoing basis, management evaluates these estimates, including those related the adequacy of the Companys reclamation and environmental obligation, share based compensation, valuation of deferred tax assets and assessment of impairment of mineral properties. Management bases these estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis of making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nMineral property acquisition costs\nThe Company capitalizes the cost of acquiring mineral properties and will amortize these costs over the useful life of a property following the commencement of production or expense these costs if it is determined that the mineral property has no future economic value or the properties are sold or abandoned. Costs include cash consideration and the fair market value of shares issued on the acquisition of mineral properties. Properties acquired under option agreements, whereby payments are made at the sole discretion of the Company, are recorded in the accounts of the specific mineral property at the time the payments are made.\nThe amounts recorded as mineral properties reflect actual costs incurred to acquire the properties and do not indicate any present or future value of economically recoverable reserves.\nExploration expenses\nWe record exploration expenses as incurred. When we determine that precious metal resource deposit can be economically and legally extracted or produced based on established proven and probable reserves, further exploration expenses related to such reserves incurred after such a determination will be capitalized. To date, we have not established any proven or probable reserves and will continue to expense exploration costs as incurred.\nAsset Retirement Obligation\nThe fair value of the Companys asset retirement obligation (ARO) is measured by discounting the expected cash flows using a discount factor that reflects the credit-adjusted risk free rate of interest, while taking into account the inflation rate. The Company prepares estimates of the timing and amounts of expected cash flows and ongoing reclamation expenditures are charged against the ARO as incurred to the extent they relate to the ARO. Significant judgments and estimates are made when estimating the fair value of ARO.\nStock Based Compensation\nFor stock option grants with market conditions that affect vesting, the Company uses a lattice approach incorporating a Monte Carlo simulation to value stock options granted.\nOption awards are generally granted with an exercise price equal to the market price of Paramounts stock at the date of grant and have contractual lives of 5 years. To better align the interests of its key executives, employee and directors with those of its shareholders a significant portion of those share option awards will vest contingent upon meeting certain stock price appreciation performance goals and other performance conditions. Option and share awards provide for accelerated vesting if there is a change in control (as defined in the employee share option plan). For the year ended June 30, 2022, the Company did not grant any stock\noptions. For the year ended June 30, 2021, the Company used the Black-Scholes option valuation model to value stock options granted. The Black-Scholes option valuation model was developed for use in estimating the fair value of traded options that have no vesting restrictions and are fully transferable. The model requires management to make estimates which are subjective and may not be representative of actual results. Changes in assumptions can materially affect estimates of fair values. For purposes of the calculation, the following assumptions were used for the fiscal years ended June 30, 2022 and 2021:\nWA Risk free interest rate\nN/A\n.22%\nWA Expected dividend yield\nN/A\n0%\nWA Expected stock price volatility\nN/A\n60%\nWA Expected life of options\nN/A\n5 years\nOff-Balance Sheet Arrangements\nWe are not currently a party to, or otherwise involved with, any off-balance sheet arrangements that have or are reasonably likely to have a current or future material effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, or capital resources. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nForeign Currency Exchange Rate Risk\nThe Company holds cash balances in both U.S. and Canadian dollars. We transact most of our business in U.S. dollars. We do not manage our foreign currency exchange rate risk through the use of financial or derivative instruments, forward contracts or hedging activities.\nIn general, the strengthening of the U.S. dollar will positively impact our expenses transacted in Canadian dollars. Conversely, any weakening of the U.S dollar will increase our expenses transacted in Canadian dollars. We do not believe that any weakening of the U.S. dollar as compared to the Canadian dollar will have an adverse material effect on our operations.\nInterest Rate Risk\nThe Companys investment policy for its cash and cash equivalents is focused on the preservation of capital and supporting the liquidity requirements of the Company. The Companys interest earned on its cash balances is impacted on the fluctuations of U.S. interest rates. We do not use interest rate derivative instruments to manage exposure to interest rate changes. We do not believe that interest rate fluctuations will have any material effect on our operations. Item 8. Financial Statements and Supplementary Data.\nOur financial statements, accompanying notes and Report of Independent Registered Public Accounting Firm are included in this Annual Report on Form 10-K beginning on page, which are incorporated in this Item 8 by reference. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nResignation of Previous Independent Registered Public Accounting Firm\nOn July 25, 2022, MNP LLP (MNP) resigned its positions as the independent registered public accounting firm of the Company.\nMNPs reports on the Companys consolidated financial statements as of and for the fiscal years ended June 30, 2021 and 2020 did not contain any adverse opinion or a disclaimer of opinion, nor were they qualified or modified as to uncertainty, audit scope or accounting principles.\nDuring the Companys two most recent fiscal years ended June 30, 2021 and 2020 and during the period from July 1, 2021 through July 25, 2022, the Company has not had any disagreement with MNP on any matter of accounting principles or practices, financial statement disclosure or auditing scope or procedures, which disagreements, if not resolved to MNPs satisfaction, would have caused MNP to make reference to the subject matter of disagreement in their reports on the Companys consolidated financial statements. In addition, during such periods, there were no reportable events as that term is defined in Item 304(a)(1)(v) of Regulation S-K.\nEngagement of New Independent Registered Public Accounting Firm\nOn July 25, 2022, the Company engaged Moss Adams LLP (Moss Adams) as the Companys independent registered public accounting firm for the fiscal year ending June 30, 2022. During the years ended June 30, 2021 and 2020 and the subsequent interim periods through July 25, 2022, neither the Company nor anyone acting on its behalf consulted with Moss Adams regarding either: (i) the application of accounting principles to a specified transaction, either completed or proposed, or the type of audit opinion that might be rendered on the Companys financial statements, and neither a written report nor oral advice was provided to the Company that Moss Adams concluded was an important factor considered by the Company in reaching a decision as to the accounting, auditing or financial reporting issue or (ii) any matter that was either the subject of a disagreement (as that term is defined in Item 304(a)(1)(iv) of Regulation S-K and the related instructions to Item 304 of Regulation S-K) or a reportable event (as that term is defined in Item 304(a)(1)(v) of Regulation S-K). Item 9A. Controls and Procedures.\nDISCLOSURE CONTROLS AND PROCEDURES\nUnder the supervision and with the participation of our management, including the Principal Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) as of the end of the period covered by this report. Based on this evaluation, our Principal Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of such date. Our disclosure controls and procedures are designed to ensure that information required to be disclosed in the reports we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and that such information is accumulated and communicated to management, including the Principal Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure.\nMANAGEMENT'S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) or 15d-15(f) promulgated under the Securities Exchange Act of 1934 as a process designed by, or under then supervision of, the companys principal executive and principal financial officers and effected by the companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\nPertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the company;\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Our management assessed the\neffectiveness of our internal control over financial reporting as of June 30, 2022. In making this assessment, the Companys management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated 2013 Framework. Based on this assessment, our management concluded that, as of June 30, 2022, our internal control over financial reporting is effective based on those criteria.\nBecause we are a smaller reporting company, our independent registered public accounting firm will not be required to attest to the effectiveness of our internal control over financial reporting for so long as we are a smaller reporting company.\nCHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING\nThere were no changes to our internal control over financial reporting that occurred during the year ended June 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe information required by Items 401, 405, 406, 407(c)(3), (d)(4) and (d)(5) of Regulation S-K will be contained in the Companys 2022 Proxy Statement, to be filed with the SEC 120 days following the end of the Companys fiscal year ended June 30, 2022 (the 2022 Proxy Statement) and is hereby incorporated by reference thereto. Item 11. Executive Compensation.\nThe information required by Item 402 and paragraph (e)(4) and (e)(5) of Item 407 of Regulation S-K will be contained in the Companys 2021 Proxy Statement, to be filed with the SEC 120 days following the end of the Companys fiscal year ended June 30, 2022 and is hereby incorporated by reference thereto. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe information required by Item 201(d) and Item 403 of Regulation S-K will be contained in the Companys 2022 Proxy Statement, to be filed with the SEC 120 days following the end of the Companys fiscal year ended June 30, 2022 and is hereby incorporated by reference thereto. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe information required by Item 404 and Item 407(a) of Regulation S-K will be contained in the Companys 2022 Proxy Statement, to be filed with the SEC 120 days following the end of the Companys fiscal year ended June 30, 2022 and is hereby incorporated by reference thereto. Item 14. Principal Accounting Fees and Services.\nThe information required by Item 9(e) of Schedule 14A will be filed in the Companys 2022 Proxy Statement, to be filed with the SEC within 120 days following the end of the Companys fiscal year ended June 30, 2022 and is hereby incorporated by reference thereto. The Company's independent registered public accounting firm is Moss Adams LLP, Denver, CO, PCAOB ID: 659.\nPART IV Item 15. Exhibits, Financial Statement Schedules.\n(a)The following report and financial statements are filed together with this Annual Report:\n(1)Audited Consolidated Financial Statements of Paramount Gold Nevada Corp.\nIncluded in Part II of this report:\nReports of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations for the years ended June 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended June 30, 2022 and 2021\nConsolidated Statements of Stockholders Equity for the years ended June 30, 2022 and 2021\nNotes to Consolidated Financial Statements\n(b)Index to Exhibits\nExhibit\nNumber\nDescription\n1.1\nControlled Equity OfferingSM Sales Agreement, dated as of May 20, 2020, by and between Paramount Gold Nevada Corp., Cantor Fitzgerald & Co. and Canaccord Genuity LLC (Incorporated herein by reference to Exhibit 1.1 to Current Report on Form 8-K of the Company filed on May 20, 2020)\n1.2\nAgency Agreement, dated as of June 24, 2020, by and between Paramount Gold Nevada Corp., Canaccord Genuity Corp. and Cantor Fitzgerald Canada Corporation. (Incorporated herein by reference to Exhibit 1.2 to Current Report on Form 8-K of the Company filed on June 25, 2020)\n2.1\nForm of Separation and Distribution Agreement by and between Paramount Gold and Silver Corp. and the Registrant.1\n2.2\nAgreement and Plan of Merger among Coeur Mining, Inc., Hollywood Merger Sub, Inc., Paramount Gold and Silver Corp., and the Registrant, Dated as of December 16, 2014.1\n2.3\nArrangement Agreement and Plan of Arrangement dated March 14, 2016, among Paramount Gold Nevada Corp. and Calico Resources Corp. (Incorporated herein by reference to Exhibit 2.1 to Current Report on Form 8-K of the Company filed on March 17, 2016)\n3.1\nCertificate of Amended and Restated Articles of Incorporation.2\n3.2\nAmended and Restated Bylaws.2\n4.1*\nDescription of Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934\n4.2\nForm of Warrant (Incorporated herein by reference to Exhibit 4.1 to Current Report on Form 8-K of the Company filed on February 9, 2017)\n4.3\nForm of Warrant (Incorporated herein by reference to Exhibit 4.1 to Current Report on Form 8-K of the Company filed on June 29, 2018)\n4.4\nForm of Senior Secured Convertible Note (Incorporated herein by reference to Exhibit 4.1 to Current Report on Form 8-K of the Company filed on September 13, 2019)\n10.1\n2015 Stock Incentive and Equity Compensation Plan.2\n10.2\n2016 Stock Incentive and Equity Compensation Plan (Incorporated herein by reference to Exhibit 1 to Definitive Proxy Statement on Schedule 14A of the Company filed on October 28, 2016)\n10.3\nForm of Stock Subscription Agreement between Coeur Mining, Inc. and the Registrant.3\n10.4\nEmployment Agreement dated October 26, 2015 between Company and Glen Van Treek (Incorporated herein by reference to Exhibit 10.1 to Current Report on Form 8-K of the Company filed on October 26, 2015)\n10.5\nEmployment Agreement dated October 26, 2015 between Company and Carlo Buffone (Incorporated herein by reference to Exhibit 10.2 to Current Report on Form 8-K of the Company filed on October 26, 2015)\n10.6\nAmended Employment Agreement Glen Van Treek dated August 10, 2016 (Incorporated herein by reference to exhibit 10.1 to Current Report on Form 8-K of the Company filed on August 12, 2016)\n10.7\nAmended Employment Agreement Carlo Buffone dated August 10, 2016 (Incorporated herein by reference to exhibit 10.2 to Current Report on Form 8-K of the Company filed on August 12, 2016)\n10.8\nForm of Subscription Agreement (Incorporated herein by reference to Exhibit 10.1 to Current Report on Form 8-K of the Company filed on February 9, 2017)\n10.9\nForm of Subscription Agreement (Incorporated herein by reference to Exhibit 10.1 to Current Report on Form 8-K of the Company filed on June 29, 2018)\n10.10\nForm of Security Agreement (Incorporated herein by reference to Exhibit 10.1 to Current Report on Form 8-K of the Company filed on September 13, 2019)\n21.1*\nList of subsidiaries.\n23.1*\nConsent of Moss Adams LLP, Independent Registered Public Accounting Firm\n23.2*\nConsent of MNP LLP\n23.3*\nConsent of Qualified Person for Technical Report Summary of The Sleeper Gold Project - Respec Company LLC\n23.4*\nConsent of Qualified Person for Technical Report Summary of The Sleeper Gold Project - Woods Process Services LLC\n31.1*\nCertification of Principal Executive Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of Principal Financial Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1*\nCertification of Principal Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2*\nCertification of Principal Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n96.1\nTechnical Report Summary for the Grassy Mountain Project, Oregon, U.S.A. (Incorporated by reference to exhibit 96.1 to the Registrant's Current Report on Form 8-K filed on October 6, 2022 (File. No. 001-36908)\n96.2*\nTechnical Report Summary for the Sleeper Gold Project, Nevada, U.S.A.\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nInteractive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n* Filed herewith.\n1 Incorporated by reference to the exhibit filed in the Registrants Amendment No. 1 to Registration Statement on Form S-1 filed on February 23, 2015.\n2 Incorporated by reference to the exhibit filed in the Registrants Form 10-Q filed on May 22, 2015.\n3 Incorporated by reference to the exhibit filed in the Registrants Amendment No. 3 to Registration Statement on Form S-1 filed on April 2, 2015.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nParamount Gold Nevada Corp.\nDate: October 13, 2022\nBy:\n/s/ Rachel Goldman\nRachel Goldman\n(Director and CEO)\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this Report has been signed below by the following persons on behalf of the Registrant in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ Rachel Goldman\nDirector and CEO (Principal Executive Officer)\nOctober 13, 2022\nRachel Goldman\n/s/ Carlo Buffone\nChief Financial Officer (Principal Financial Officer and Principal Accounting Officer)\nOctober 13, 2022\nCarlo Buffone\n/s/ Glen Van Treek\nDirector, President and Chief Operating Officer\nOctober 13, 2022\nGlen Van Treek\n/s/ Rudi Fronk\nDirector\nOctober 13, 2022\nRudi Fronk\n/s/ John Carden\nDirector\nOctober 13, 2022\nJohn Carden\n/s/ Eliseo Gonzalez-Urien\nDirector\nOctober 13, 2022\nEliseo Gonzalez-Urien\n/s/ Christopher Reynolds\nDirector\nOctober 13, 2022\nChristopher Reynolds\n/s/ Pierre Pelletier\nDirector\nOctober 13, 2022\nPierre Pelletier\n/s/ Samantha Espley\nDirector\nOctober 13, 2022\nSamantha Espley\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm (PCAOB Audit ID 659)\nReport of Independent Registered Public Accounting Firm (PCAOB Audit ID 1930)\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations for the Years ended June 30, 2022 and 2021\nConsolidated Statements of Stockholders Equity for the Years ended June 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the Years ended June 30, 2022 and 2021\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of\nParamount Gold Nevada Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Paramount Gold Nevada Corp. and subsidiaries (the Company) as of June 30, 2022 the related consolidated statements of operations, stockholders equity and cash flows for the year then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of June 30, 2022 and the consolidated results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Uncertainty\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the consolidated financial statements, the Company has not generated revenues or cash flows from operations and does not expect to generate any in the near future, and the Company expects to settle the convertible notes that mature in September 2023 with current working capital, which raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the (consolidated) financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Moss Adams LLP\nDenver, Colorado\nOctober 13, 2022\nWe have served as the Companys auditor since 2022.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Paramount Gold Nevada Corp.\nOpinion the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheet of Paramount Gold Nevada Corp. (the Company) as of June 30, 2021, and the related consolidated statement of operations and comprehensive loss, stockholders equity, and cash flow for the year ended June 30, 2021, and the related notes (collectively referred to as the consolidated financial statements).\nIn our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of June 30, 2021, and the result of its consolidated operations and its consolidated cash flow for the year ended June 30, 2021,in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nAssessment of the Provision for Reclamation and Environmental Obligations\nCritical Audit Matter Description\nAs described in Note 8 to the consolidated financial statements, as at June 30, 2021, the provision for reclamation and environmental obligations amounted to $1,849,644. The provision is determined using estimates of the nature, timing and amount of future costs to be incurred to reclaim the mine sites, future inflation and discount rates. These assumptions are subject to change due to continued mining, reclamation of properties and regulatory changes.\nWe identified the assessment of the provision for reclamation and environmental obligations as a critical audit matter due to the subjective judgment involved in assessing the amount of the provision. Significant assumptions included amounts of future reclamation costs, inflation rates and discount rates. These assumptions are challenging to evaluate, as minor changes in these assumptions have a significant effect on the Companys determination of the provision for reclamation and environmental obligations.\nAudit Response\nWe responded to this matter by performing audit procedures over the provision for reclamation and environmental obligations. Our audit work in relation to this included, but was not restricted to, the following:\nObtained and evaluated managements asset retirement obligation working papers and examined assumptions regarding the discount rate, inflation rate, and the amounts and timing of future costs.\nInquired with management whether there have been any changes to the original obligation estimates or activities that would impact the value of the obligation.\nEngaged an internal valuation specialist with specialized skill and knowledge to assist in evaluating the discount rates used to determine the amount of the provision.\nAssessed the future inflation rate by comparing to a third-party source.\nObtained confirmation from managements experts regarding the future reclamation costs.\nAssessed certain elements of the future costs to be incurred to reclaim the mine sites by comparing the costs to recent rehabilitation activities.\nAssessed the appropriateness and completeness of related disclosures in the consolidated financial statements.\n/s/ MNP LLP\nChartered Professional Accountants\nWe have served as the Companys auditor since 2015.\nVancouver, Canada\nSeptember 17, 2021\nPARAMOUNT GOLD NEVADA CORP.\nConsolidated Balance Sheets\nas of June 30, 2022 and 2021\nAs at June 30,\nAs at June 30,\nAssets\nCurrent Assets\nCash and cash equivalents\n$\n2,484,156\n$\n3,113,064\nPrepaid expenses and deposits\n1,280,895\n1,152,396\nTotal Current Assets\n3,765,051\n4,265,460\nNon-Current Assets\nMineral properties\n51,742,873\n49,197,704\nReclamation bond\n498,276\n533,703\nProperty and equipment\n6,513\n5,959\nTotal Non-Current Assets\n52,247,662\n49,737,366\nTotal Assets\n$\n56,012,713\n$\n54,002,826\nLiabilities and Stockholders' Equity\nCurrent Liabilities\nAccounts payable and accrued liabilities\n$\n638,256\n$\n638,950\nReclamation and environmental obligation, current portion\n120,000\n310,022\nTotal Current Liabilities\n758,256\n948,972\nNon-Current Liabilities\nConvertible debt\n3,570,430\n3,517,082\nCovertible debt, related parties\n651,380\n644,420\nDeferred tax liability\n277,627\n-\nReclamation and environmental obligation, non-current portion\n4,355,270\n1,539,622\nTotal Non-Current Liabilities\n8,854,707\n5,701,124\nTotal Liabilities\n9,612,963\n6,650,096\nCommitments and Contingencies (Note 13)\nStockholders' Equity\nCommon stock, par value $0.01, 200,000,000 authorized shares, 46,591,081 issued and outstanding at June 30, 2022 and 200,000,000 authorized shares, 38,154,109 issued and outstanding at June 30, 2021\n465,912\n381,542\nAdditional paid in capital\n113,805,101\n107,005,135\nAccumulated deficit\n(67,871,263\n)\n(60,033,947\n)\nTotal Stockholders' Equity\n46,399,750\n47,352,730\nTotal Liabilities and Stockholders' Equity\n$\n56,012,713\n$\n54,002,826\nThe accompanying notes are an integral part of these consolidated financial statements.\nPARAMOUNT GOLD NEVADA CORP.\nConsolidated Statements of Operations\nfor the Years ended June 30, 2022 and 2021\nFor the Year Ended June 30, 2022\nFor the Year Ended June 30, 2021\nExpenses\nExploration and development\n4,436,266\n2,816,685\nLand holding costs\n640,349\n540,401\nProfessional fees\n130,765\n174,039\nSalaries and benefits\n1,196,302\n1,373,451\nDirectors' compensation\n113,717\n158,694\nGeneral and administrative\n565,466\n483,608\nInsurance\n223,033\n220,480\nDepreciation\n2,169\n2,508\nAccretion\n183,693\n60,040\nTotal Expenses\n7,491,760\n5,829,906\nNet Loss before Other Expense\n7,491,760\n5,829,906\nOther Expense (Income)\nOther income\n(330,971\n)\n(330,259\n)\nInterest income\n(3\n)\n(2,293\n)\nInterest and service charges\n398,903\n442,211\nGain on forgiveness of promissory note\n-\n(35,947\n)\nNet Loss before Income Taxes\n7,559,689\n5,903,618\nIncome Taxes\nDeferred tax expense\n277,627\n-\nNet Loss\n$\n7,837,316\n$\n5,903,618\nLoss per Common Share\nBasic and diluted\n$\n0.19\n$\n0.17\nWeighted Average Number of Common\nShares Used in Per Share Calculations\nBasic and diluted\n42,354,842\n35,533,269\nThe accompanying notes are an integral part of these consolidated financial statements.\nPARAMOUNT GOLD NEVADA CORP.\nConsolidated Statements of Stockholders Equity\nfor the Years ended June 30, 2022 and 2021\nShares (#)\nCommon Stock\nAdditional\nPaid-In Capital\nDeficit\nTotal Stockholders'\nEquity\nBalance at June 30, 2021\n38,154,109\n$\n381,542\n$\n107,005,135\n$\n(60,033,947\n)\n$\n47,352,730\nStock based compensation\n266,000\n2,660\n437,667\n-\n440,327\nCapital issued for financing\n7,766,388\n77,664\n6,042,290\n-\n6,119,954\nCapital issued for payment of interest\n404,584\n4,046\n320,009\n-\n324,055\nNet loss\n-\n-\n-\n(7,837,316\n)\n(7,837,316\n)\nBalance at June 30, 2022\n46,591,081\n$\n465,912\n$\n113,805,101\n$\n(67,871,263\n)\n$\n46,399,750\nShares (#)\nCommon Stock\nAdditional\nPaid-In Capital\nDeficit\nTotal Stockholders'\nEquity\nBalance at June 30, 2020\n32,958,404\n$\n329,584\n$\n100,881,957\n$\n(54,130,329\n)\n$\n47,081,212\nStock based compensation\n-\n-\n436,777\n-\n436,777\nCapital issued for purchase of mineral properties\n257,353\n2,574\n275,367\n-\n277,941\nCapital issued for services\n166,792\n1,668\n179,790\n-\n181,458\nCapital issued for payment of interest\n362,427\n3,624\n395,153\n-\n398,777\nCapital issued for financing\n3,209,133\n32,092\n3,690,462\n-\n3,722,554\nCapital issued on conversion of debt\n1,200,000\n12,000\n1,145,629\n-\n1,157,629\nNet loss\n-\n-\n-\n(5,903,618\n)\n(5,903,618\n)\nBalance at June 30, 2021\n38,154,109\n$\n381,542\n$\n107,005,135\n$\n(60,033,947\n)\n$\n47,352,730\nThe accompanying notes are an integral part of these consolidated financial statements.\nPARAMOUNT GOLD NEVADA CORP.\nConsolidated Statements of Cash Flows\nfor the Years ended June 30, 2022 and 2021\nFor the Year Ended June 30, 2022\nFor the Year Ended June 30, 2021\nNet Loss\n$\n(7,837,316\n)\n$\n(5,903,618\n)\nAdjustments to reconcile net loss to net cash used in operations:\nDepreciation\n2,169\n2,508\nShare based payments\n-\n181,458\nStock based compensation\n440,327\n436,777\nAmortization of debt issuance costs\n60,308\n62,903\nInterest expense\n325,283\n359,253\nAccretion expense\n183,693\n60,040\nGain upon forgiveness of promissory note\n-\n(35,947\n)\nSettlement of asset retirement obligations\n(33,236\n)\n-\nChange in reclamation bonds and commutation accounts\n35,427\n(163,178\n)\nDeferred tax expense\n277,627\n-\nEffect of changes in operating working capital items:\n(Increase)/Decrease in prepaid expenses\n(153,499\n)\n(709,800\n)\nIncrease/(Decrease) in accounts payable\n(1,922\n)\n(246,467\n)\nCash used in operating activities\n(6,701,139\n)\n(5,956,071\n)\nCash flows from investing activities:\nPurchase of mineral properties\n(45,000\n)\n(87,500\n)\nPurchase of equipment\n(2,723\n)\n-\nCash used in investing activities\n(47,723\n)\n(87,500\n)\nCash flows from financing activities:\nCapital issued for financing, net of share issuance costs\n6,119,954\n3,722,554\nCash provided by financing activities\n6,119,954\n3,722,554\nChange in cash during period\n(628,908\n)\n(2,321,017\n)\nCash at beginning of period\n3,113,064\n5,434,081\nCash at end of period\n$\n2,484,156\n$\n3,113,064\nSee Note 4 for supplemental cash flow information\nThe accompanying notes are an integral part of these consolidated financial statements.\nPARAMOUNT GOLD NEVADA CORP.\nNotes to Consolidated Financial Statements\nNote 1. Description of Business and Summary of Significant Accounting Policies\nParamount Gold Nevada Corp. (the Company or Paramount), incorporated under the General Corporation Law of the State of Nevada, and its wholly-owned subsidiaries are engaged in the acquisition, exploration and development of precious metal properties. The Companys wholly owned subsidiaries include New Sleeper Gold LLC, Sleeper Mining Company, LLC, and Calico Resources USA Corp (Calico). The Company is in the process of exploring its mineral properties in Nevada and Oregon, United States. The Companys activities are subject to significant risks and uncertainties, including the risk of failing to secure additional funding to advance its projects and the risks of determining whether these properties contain reserves that are economically recoverable. The Companys shares of common stock trade on the NYSE AMERICAN LLC under the symbol PZG.\nBasis of Presentation and Preparation\nThe consolidated financial statements are prepared by management in accordance with U.S. generally accepted accounting principles (‘U.S. GAAP) and are presented in US dollars. The consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries. All significant intercompany accounts and transactions are eliminated in consolidation.\nThe Company faces various risks related to the COVID-19 global pandemic. The Companys primary goal during the COVID-19 pandemic is to safeguard the health of our employees, suppliers and the communities where we operate while minimizing business interruption. To date, COVID-19 pandemic has not had a material impact on our business however because of the highly uncertain and dynamic nature of events relating to the COVID-19 pandemic, it is not currently possible to predict any future impact of the COVID-19 pandemic, but these impacts could have a material adverse effect on the business, financial position, results of operations and/or cash flows. We will continue to monitor the COVID-19 situation closely.\nForeign Currency Translation and Transactions\nThe Companys functional and reporting currency is the United States dollar. Foreign denominated monetary assets and liabilities are translated into their U.S. dollar equivalents using foreign exchange rates which prevailed at the balance sheet date. Income and expenses are translated at average rates of exchange during the period. Related translation adjustments as well as gains or losses resulting from foreign currency transactions are reported as part of operating expenses on the statement of operations and comprehensive loss.\nUse of Estimates\nThe preparation of these consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the consolidated financial statements, and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates.\nSignificant estimates made by management in the accompanying consolidated financial statements include the adequacy of the Companys reclamation and environmental obligation, share based compensation, valuation of deferred tax asset, and assessment of impairment of mineral properties.\nCash and Cash Equivalents\nAll highly liquid investments with maturities of three months or less at the date of purchase are classified as cash and cash equivalents. The carrying amount of these securities approximates fair value because of the short-term maturity of these instruments.\nConcentration of Credit Risk\nFinancial instruments that potentially subject the Company to a concentration of credit risk consist principally of cash and cash equivalents. The Company maintains cash in accounts which may, at times, exceed federally insured limits. At June 30, 2022 and 2021, the Company had $2.23 million and $2.81 million, respectively, of balances in excess of federally insured limits. The Company deposits its cash with financial institutions which it believes have sufficient credit quality to minimize the risk of loss.\nFair Value Measurements\nThe Company has adopted FASB ASC 820, Fair Value Measurements and Disclosures, which defines fair value, establishes guidelines for measuring fair value and expands disclosures regarding fair value measurements. The Company applies fair value accounting for all financial assets and liabilities and non - financial assets and liabilities that are recognized or disclosed at fair value\nin the consolidated financial statements on a recurring basis. The Company defines fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date.\nThe Company has adopted FASB ASC 825, Financial Instruments, which allows companies to choose to measure eligible financial instruments and certain other items at fair value that are not required to be measured at fair value. The Company has not elected the fair value option for any eligible financial instruments.\nStock Based Compensation\nThe Company has adopted the provisions of FASB ASC 718, Stock Compensation (ASC 718), which establishes accounting for equity instruments exchanged for employee services and for acquiring goods and services from nonemployees. Under the provisions of ASC 718, stock-based compensation cost is measured at the grant date and based on the calculated fair value of the award. For grants to employees an expense is recognized over the employees requisite service period (generally the vesting period of the equity grant) using the graded vesting method. For grants to nonemployees, an expense is recognized when the good or service is received.\nFor options with performance conditions, the Company accrues compensation if it is probable that the performance condition will be achieved and recognizes the compensation cost over the requisite service period. The requisite service period for options with performance conditions is estimated based on the analysis of the terms of the award and the specific performance conditions. The Company shall recognize the effect of forfeited awards in compensation cost when they occur. New shares of the Companys common stock will be issued for any options exercised.\nThe fair value of Restricted Share Units (\"RSUs\") and stock awards are based on the Company's stock price on the day of grant. Stock based compensation expense related to RSUs and stock awards is generally recognized over the requisite service period using the graded vesting method. Vesting dates for RSUs with performance conditions are determined by an analysis of the implicit service period of the performance target. The Company shall recognize the effect of forfeited awards in compensation cost when they occur. New shares of the Company's common stock will be issued for any RSUs that vest to recipient.\nMineral Properties\nMineral property acquisition costs are capitalized when incurred and will be amortized using the units-of-production method over the estimated life of the reserve following the commencement of production. If a mineral property is subsequently abandoned or impaired, any capitalized costs will be expensed in the period of abandonment or impairment.\nAcquisition costs include cash consideration and the fair market value of shares issued on the acquisition of mineral properties. Net proceeds from the sale of royalties are deducted from the carrying value of the mineral properties.\nThe recoverability of the costs incurred for the exploration and development of precious mineral properties is dependent on the ability of the Company to obtain the necessary financing to advance the projects to production, upon future profitable production or from proceeds from sale of properties or production royalties. The Company will continue to incur losses and have negative cash flows from operating activities and as such we will require additional capital to fund exploration and development programs, future property acquisitions and for general corporate purposes. If the Company is unable to obtain additional funding, we may be unable to continue its operations, and amounts realized for assets may be less than amounts reflected in these consolidated financial statements.\nExploration Costs\nExploration costs, which include maintenance, development and exploration of mineral claims, are expensed as incurred. When it is determined that a mineral deposit can be economically developed as a result of establishing proven and probable reserves, the costs incurred after such determination will be capitalized until the commencement of production and amortized over their useful lives. To date, the Company has not established the commercial feasibility of its exploration prospects; therefore, all exploration costs are being expensed.\nProperty and Equipment\nEquipment is recorded at cost less accumulated depreciation. All equipment is depreciated over its estimated useful life at the following annual rates:\nComputer equipment\n30% declining balance\nEquipment\n20% declining balance\nImpairment of Long-Lived Assets\nThe Company tests long-lived assets or asset groups for recoverability when events or changes in circumstances indicate that their carrying amount may not be recoverable. Circumstances which could trigger a review include, but are not limited to: significant\ndecreases in the market price of the asset; significant adverse changes in the business climate or legal factors; accumulation of costs significantly in excess of the amount originally expected for the acquisition or construction of the asset; current period cash flow or operating losses combined with a history of losses or a forecast of continuing losses associated with the use of the asset; and current expectation that the asset will more likely than not be sold or disposed significantly before the end of its estimated useful life.\nThe Company assesses the carrying value of mineral properties for whenever information or events indicate the potential for impairment. This would include our inability to obtain all the necessary regulatory permits to build and operate mines related to our mineral properties, government actions, the results of exploration activities and technical evaluations and changes in key economic conditions such as the price of gold and silver or key inputs to the building and operating of a mine including initial capital, yearly production levels and operating expenses. We compare estimated future net cash flows with our carrying costs and future obligations on an undiscounted basis. The undiscounted cash flows are based on the amounts we expect to receive from the sale of gold and silver produced from the mine, the level of operating expenses we expect to incur to produce the gold and silver that is recovered from the mineral deposit and the level of capital expected to build, operate and sustain the mine operations. If it is determined that the estimated future undiscounted cash flows are less than the carrying value of the property, a write-down to the estimated fair value will be reported in our Consolidated Statement of Income/(Loss) for the period. There has been no impairment of our mineral properties for the fiscal years-ended June 30, 2022 and 2021.\nReclamation and Environmental Obligation\nThe Company follows the provisions of ASC 410, Asset Retirement and Environmental Obligations, which establishes the standards for the initial measurement and subsequent accounting for obligations associated with the sale, abandonment, or other disposal of long-lived tangible assets arising from the acquisition, construction or development and for normal operations of such assets. The fair value of a liability for an asset retirement obligation will be recognized in the period in which it is incurred if a reasonable estimate of fair value can be made. The fair value of the liability is added to the carrying amount of the associated asset. An accretion cost, representing the increase over time in the present value of the liability, is recorded each period. As reclamation work is performed or liabilities are otherwise settled, the recorded amount of the liability is reduced. Future reclamation costs are accrued based on managements best estimate at the end of each period of the discounted costs expected to be incurred for the asset. Such costs include facilities removal, earthworks, revegetation and on-going monitoring. Changes in estimates are reflected prospectively in the period an estimate is revised.\nNet Loss per Share\nBasic loss per share is computed by dividing net loss available to common shareholders by the weighted average number of shares outstanding during each period. Diluted loss per share reflect the potential dilution that could occur if securities or other contracts to issue common stock were exercised or converted into common stock.\nFor the years ended June 30, 2022 and 2021, the shares of common stock equivalents related to outstanding stock options have not been included in the diluted per share calculation as they are anti-dilutive as the Company has recorded a net loss from continuing operations for each year.\nLeases\nThe Company determines if an arrangement is, or contains, a lease at the inception date. Right-of-use (ROU) assets related to operating leases are included in Other assets, non-current with related liabilities included in Accrued liabilities and Other long-term liabilities. ROU assets under finance leases, which primarily represent property and equipment, are included in Property, plant and equipment, net with related liabilities in debt, current and debt, non-current on the Consolidated Balance Sheet.\nOperating lease assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease assets and liabilities are recognized at the lease commencement date based on the estimated present value of lease payments over the lease term. We use our estimated incremental borrowing rate in determining the present value of lease payments. Variable components of the lease payments such as maintenance costs are expensed as incurred and not included in determining the present value. Our lease terms include options to extend or terminate the lease when it is reasonably certain that we will exercise that option. Lease expense is recognized on a straight-line basis over the lease term. Currently, the Company does not have any leases with terms greater than 12 months.\nConvertible Debt\nThe Company reviews the terms of its convertible notes payable to determine whether to account for any portion of the proceeds towards the conversion feature. In general, when the convertible notes instrument has the following characteristics and terms no portion of the proceeds from the issuance shall be accounted for as attributable to the conversion feature: a) is convertible into common stock of the Company at a specified price at the option of holder; b) the debt is sold at a price or has value at issuance not significantly in excess of the face amount; c) an interest rate that is lower than the Company could establish for nonconvertible debt;\nd) an initial conversion price that is greater than the fair value of the common stock at time of issuance and; e) a conversion price that does not decrease except pursuant to antidilution provisions. When proceeds are not attributable to the conversion features of the debt, the Company records the entire amount as a liability. If the fair value option is not elected, the Company will reduce the initial carrying amount of the debt by any direct and incremental issuance costs paid to third parties that are associated with the convertible debt issuance.\nThe Company also reviews the terms of its convertible notes payable to determine whether there are embedded derivatives, including the embedded conversion option, that are required to be bifurcated and accounted for as individual derivative financial instruments. In circumstances where convertible debt contains embedded derivatives that are required to be separated from the host contracts, the total proceeds received are first allocated to the fair value of the derivative financial instruments determined using the binomial model. The remaining proceeds, if any, are then allocated to the debenture cost contracts, usually resulting in those instruments being recorded at a discount from their principal amount. This discount is accreted over the expected life of the instruments to profit (loss) using the effective interest method.\nThe debenture host contracts are subsequently recorded at amortized cost at each reporting date, using the effective interest method. The embedded derivatives are subsequently recorded at fair value at each reporting date, with changes in fair value recognized in profit (loss). As of June 30, 2022 and 2021, there were no embedded derivatives.\nIncome Taxes\nIncome taxes are determined using the asset and liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. Deferred tax assets and liabilities are measured using the enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the period that includes the enactment date. In addition, a valuation allowance is established to reduce any deferred tax asset for which it is determined that it is more likely than not that some portion of the deferred tax asset will not be realized.\nPotential benefits of income tax losses are not recognized in the accounts until realization is more likely than not. Potential benefits of net operating losses have not been recognized in these financial statements because the Company cannot be assured it is more likely than not it will utilize the net operating losses carried forward in future periods; and accordingly is offset by a valuation allowance.\nTo the extent interest and penalties may be assessed by taxing authorities on any underpayment of income tax, such amounts would be accrued and classified as a component of income tax expense in our Consolidated Statements of Operations and Comprehensive Loss.\nNote 2. Recent Accounting Guidance\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40): Accounting for Convertible Instruments and Contracts in an Entitys Own Equity, which addresses the complexity of its guidance for certain financial instruments with characteristics of liabilities and equity. ASU 2020-06 removes the accounting models that require beneficial conversion features or cash conversion features associated with convertible instruments to be recognized as a separate component of equity, adds certain disclosure requirements for convertible instruments, amends the guidance for the derivatives scope exception for contracts in an entitys own equity and simplifies the diluted earnings per share calculation for certain situations. This ASU is effective for the Company beginning on July 1, 2024. The Company is currently evaluating the impact of implementing these changes on the Companys consolidated financial position, operating results and cash-flows.\nNote 3. Going Concern\nThe Company has not generated any revenues or cash flows from operations to date. As such the Company is subject to all the risks associated with development stage companies. Since inception, the Company has incurred losses and negative cash flows from operating activities which have been funded from the issuance of common stock, convertible notes and the sale of royalties on its mineral properties. The Company does not expect to generate positive cash flows from operating activities in the near future, if at all, until such time it successfully initiates production at its Grassy Mountain Project, including obtaining construction financing, completing the construction of the proposed mine and anticipates incurring operating losses for the foreseeable future.\nThe Consolidated Financial Statements of the Company have been prepared on a going concern basis, which means that the continuation of the Company is presumed even though events and conditions exist that, when considered in aggregate, raise substantial doubt about the Companys ability to continue as a going concern because it is possible that the Company will be required to adversely change its current business plan or many be unable to meet its obligations as they become due with one year after the date of that these financial statements were issued.\nParamount expects to continue to incur losses as a result of costs and expenses related to maintaining its properties and general and administrative expenses. Since 2015, the Company has relied on equity financings, debt financings and sale of royalties to fund its operations and the Company expects to rely on these forms of financing to fund operations into the near future. The Company will also continue to identify ways to reduce its cash expenditures.\nParamounts current business plan requires working capital to fund non-discretionary expenditures for its exploration and development activities on its mineral properties, mineral property holding costs and general and administrative expenses. It also requires approximately $4.3 million in capital to repay the 2019 convertible notes which become due in September 2023.\nSubsequent to October 13, 2022, the Company expects to fund operations as follows:\nExisting cash on hand and working capital.\nThe existing ATM with Cantor Fitzgerald & Co. and Canaccord Genuity LLC.\nOther debt, equity financings and sale of royalties.\nHistorically, we have been successful in accessing capital through equity and debt financing arrangements or by the sale of royalties on its mineral properties, no assurance can be given that additional financing will be available to it in amounts sufficient to meet its needs, or on terms acceptable to the Company. In the event that we are unable to obtain additional capital or financing, our operations, exploration and development activities will be significantly adversely affected. The continuation of the Company as a going concern is dependent on having sufficient capital to maintain our operations and to repay the convertible notes which become due in September 2023. In considering our financing plans, our current working capital position and our ability to reduce operating expenses the Company believes there is substantial doubt about its ability to continue as a going concern twelve months after the date that our financial statements are issued.\nNote 4. Fair Value Measurements\nFair value is the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Fair value is estimated by applying the following hierarchy, which prioritizes the inputs used to measure fair value into three levels and bases the categorization with the hierarchy upon the lowest level of input that is available and significant to the fair value measurement:\nThe fair value hierarchy consists of three broad levels, which gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1) and the lowest priority to unobservable inputs (Level 3).\nThe three levels of the fair value hierarchy under ASC 820 are described below:\nLevel 1 Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities.\nLevel 2 Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly, including quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; inputs other than quoted prices that are observable for the asset or liability (e.g., interest rates); and inputs that are derived principally from or corroborated by observable market data by correlation or other means.\nLevel 3 Inputs that are both significant to the fair value measurement and unobservable.\nFinancial assets and liabilities measured at fair value on a recurring basis by level within the fair value hierarchy. As required by ASC 820, assets and liabilities are classified in their entirety based on the lowest level of input that is significant to the fair value measurement.\nOur financial instruments include cash, accounts payable, accrued liabilities and convertible debt. Due to their short maturity of our cash, accounts payable and accrued liabilities, we believe that their carrying amounts approximate fair value as of June 30, 2022 and 2021. The carrying amount of convertible debt approximates fair value as the interest rate charged represents a market rate of interest.\nNote 5. Non-Cash Transactions\nDuring the year-ended June 30, 2022, the Company issued 404,584 shares of Common Stock for payment of interest accrued and owing on its outstanding 2019 Convertible Notes with a fair value of $324,055. During the year-ended June 30, 2021, the Company issued 362,427 shares of Common Stock for payment of interest accrued and owing on its outstanding 2019 Convertible Notes with a\nfair value of $398,777. The Company also issued 266,000 shares of Common stock under its equity compensation plans with a fair value of $170,240 and increased its asset retirement obligation and mineral properties by $2,475,169.\nDuring the year-ended June 30, 2021, the Company issued 257,353 shares of its common stock with a fair value of $277,941 for the acquisition of mining claims.\nDuring the year-ended June 30, 2021, the Company issued 1,200,000 shares of Common Stock upon the conversion of 1,200 of its outstanding 2019 Convertible Notes. The Company also issued 166,792 shares of Common Stock to Ausenco Engineering USA South Inc. in exchange for consulting services to complete the Grassy Mountain feasibility study valued at $181,458 and increased its asset retirement obligation by $1,498,950.\nNote 6. Capital Stock\nAuthorized Capital\nAuthorized capital stock consists of 200,000,000 shares of Common Stock with par value of $0.01 per common share (2021- 200,000,000 shares of Common Stock with par value $0.01 per common share). An increase to authorized capital stock was approved by the Companys stockholders during the year-ended June 30, 2021.\nDuring the year-ended June 30, 2022, the Company issued 7,766,388 shares for net proceeds of $6,119,954 through its at-the-market offering. The Company also issued 404,584 shares for the payment of accrued interest (Note 7) with a fair value of $324,055.\nDuring the year-ended June 30, 2021, the Company issued 3,209,133 shares for net proceeds of $3,722,554 through its at-the market offering. The Company also issued 362,427 shares for payment of interest accrued and owing (Note 5 and Note 7) with a fair value of $398,777. The Company also issued 1,200,000 shares upon the conversion of 1,200 of the 2019 Senior Secured Convertible Notes (Note 5 and Note 7).\nIn addition, during the year-ended June 30, 2021, the Company issued 166,792 shares at a value of $1.09 per share of Common Stock to Ausenco in exchange for services to complete a feasibility study at its Grassy Mountain Project (Note 5). It also issued 257,353 shares for the purchase of a mineral property with a fair value of $277,941 (Note 5 and 8).\nStock Options, Restricted Stock Units and Stock Based Compensation\nParamounts 2015 and 2016 Stock Incentive and Compensation Plans, which are stockholder-approved, permits the grant of stock options, restricted stock units and stock to its employees and directors for up to 3.5 million shares of common stock.\nTotal stock-based compensation for the years-ended June 30, 2022 and 2021 were $440,327 and $436,777, respectively. Total stock-based compensation for the year-ended June 30, 2022 consists of the aggregate of stock-based compensation recorded for outstanding stock-option awards ($97,681), restricted stock unit awards ($172,406) and restricted stock grant awards ($170,240).\nRestricted Stock Grants\nDuring the year-ended June 30, 2022, the Company granted and issued 266,000 shares of common under its equity compensation plan with a fair value of $170,240.\nStock Options and Stock Based Compensation\nStock option awards are generally granted with an exercise price equal to the market price of Paramounts stock at the date of grant and have contractual lives of 5 years. To better align the interests of its key executives, employee and directors with those of its shareholders a significant portion of those share option awards will vest contingent upon meeting certain stock price appreciation performance goals and other performance conditions. Option and share awards provide for accelerated vesting if there is a change in control (as defined in the employee share option plan).\nFor the year-ended June 30, 2022 and 2021, the Company granted nil and 755,000 stock options to employees, directors and consultants, respectively.\nFor the year-ended June 30, 2022, share-based compensation expense relating to service conditions options and performance conditions options were $50,861 and $46,820, respectively (2021 - $286,096 and $150,681).\nThe fair value for these options was calculated using the Black-Scholes option valuations method. The weighted average assumptions used for the fiscal years ending June 30, 2022 and 2021 were as follows:\nWeighted average risk-free interest rate\nN/A\n0.22\n%\nWeighted-average volatility\nN/A\n%\nExpected dividends\nN/A\n$\n0.00\nWeighted average expected term (years)\nN/A\n5.00\nWeighted average fair value\nN/A\n$\n0.57\nA summary of option activity under the Stock Incentive and Compensation Plan as of June 30, 2022 and 2021, and changes during the years ended June 30, 2022 and 2021 are presented below.\nOptions\nOptions\nWeighted\nAverage\nExercise Price\nWeighted-\nAverage Remaining\nContractual Term (Years)\nAggregate\nIntrinsic Value\nOutstanding at June 30, 2020\n1,243,995\n$\n1.20\n3.63\n$\n165,600\nGranted\n755,000\n1.13\n4.44\n-\nExercised\n-\n-\n-\n-\nForfeited or expired\n-\n-\n-\n-\nOutstanding at June 30, 2021\n1,998,995\n$\n1.17\n3.31\n$\n-\nGranted\n-\n-\n-\n$\n-\nExercised\n-\n-\n-\n-\nForfeited or expired\n(190,000\n)\n1.42\n1.48\n-\nOutstanding at June 30, 2022\n1,808,995\n$\n1.14\n2.42\n$\n-\nExercisable at June 30, 2022\n1,151,662\n$\n1.15\n2.47\n$\n-\nA summary of the status of Paramounts non-vested options as of June 30, 2022 and 2021 and changes during the years ended June 30, 2022 and 2021 are presented below.\nNon-vested Options\nOptions\nWeighted-\nAverage Grant-\nDate Fair Value\nNon-vested at June 30, 2020\n943,992\n$\n0.51\nGranted\n755,000\n0.56\nVested\n(664,994\n)\n0.50\nForfeited or expired\n-\n-\nNon-vested at June 30, 2021\n1,033,998\n$\n0.55\nGranted\n-\n-\nVested\n(288,332\n)\n0.53\nForfeited or expired\n(88,333\n)\n0.73\nNon-vested at June 30, 2022\n657,333\n$\n0.55\nAs of June 30, 2022 and 2021, there was $22,960 and $143,998 respectively of total unrecognized compensation cost related to non-vested share-based compensation arrangements granted under the employee share option plan. That cost is expected to be recognized over a weighted-average period of 1.16 years. The total fair value of shares vested during the years ended June 30, 2022 and 2021, was $152,486 and $332,835, respectively.\nRestricted Stock Units (\"RSUs\")\nRSUs are awards for service and performance which upon vesting and settlement entitle the recipient to receive one common share of the Company's Common Stock for no additional consideration, for each RSU held.\nDuring the year-ended June 30, 2022, the Company granted 701,000 RSUs (2021 - Nil)\nDuring the year-ended June 30, 2022, share-based compensation expenses related to service condition RSUs and performance condition RSUs was $76,003 and $96,403, respectively (2021 - $nil and $nil)\nA summary of RSUs activity is summarized as follows:\nRestricted Share Unit Activity\nOutstanding RSUs\nWeighted average grant date fair value\nOutstanding at June 30, 2020\n-\n$\n-\nGranted\n-\n-\nVested\n-\n-\nForfeited\n-\n-\nOutstanding at June 30, 2021\n-\n$\n-\nGranted\n701,000\n$\n0.65\nVested\n-\n-\nForfeited\n-\n-\nOutstanding at June 30, 2022\n701,000\n$\n0.65\nAs of June 30,2022, there was approximately $284,366 of unamortized stock-based compensation expense related to outstanding RSUs. The expenses are expected to be recognized over the remaining weighted-average vesting periods of 0.91 years.\nNote 7. Debt\nDebt\nJune 30, 2022\nJune 30, 2021\nCurrent\nNon-Current\nCurrent\nNon-Current\n2019 Secured Convertible Notes\n$\n-\n$\n4,277,690\n$\n-\n$\n4,277,690\nLess: unamortized discount and issuance costs\n-\n(55,880\n)\n-\n(116,188\n)\n$\n-\n$\n4,221,810\n$\n-\n$\n4,161,502\nIn September 2019, the Company completed a private offering of 5,478 Senior Secured Convertible Notes (2019 Convertible Notes) at $975 per $1,000 face amount due in September 2023. Each 2019 Convertible Note will bear an interest rate of 7.5% per annum, payable semi-annually. The effective interest rate of the 2019 Convertible Notes is 9.24%. The principal amount of the 2019 Convertible Notes will be convertible at a price of $1.00 per share of Paramount common stock. Unamortized discount and issuance costs of $275,883 will be amortized as an additional interest expense over the four-year term of the 2019 Convertible Notes. During the year-ended June 30, 2022, the Company amortized $60,308 (2021-$62,903) of discount and issuance costs. At any point after the second anniversary of the issuance of the convertible notes, Paramount may force conversion if the share price of its common stock remains above $1.75 for 20 consecutive trading days. The convertible notes are secured by a lien on all assets of the Company and the Company is required to maintain a working capital balance of $250,000. At June 30, 2022, the working capital covenant was met by the Company.\nDuring the year-ended June 30, 2022, there were no notes converted to shares of Common Stock (2021 - 1,200 notes converted in 1,200,000 shares of Common Stock). Also during the year-ended June 30, 2022, the Company recorded an interest expense of $325,283 (2021 - $359,253).\nAs of June 30, 2022, there were 4,278 (2021 - 4278) notes outstanding of which 660 (2021 - 660) were held by related parties. Related parties consisted of a director of the Company and an affiliate shareholder.\nOn May 5, 2020, the Company was granted a loan (the PPP Loan) from Wells Fargo Bank, N.A. in the amount of $35,628 pursuant to the Paycheck Protection Program (the PPP) under Division A, Title I of the CARES Act, which was enacted March 27, 2020. The PPP Loan which was in the form of a Promissory Note matures on May 3, 2022 and bears interest at a rate of 0.98% per annum, payable monthly commencing on November 1, 2020. The Note may be prepaid by the Company at any time prior to maturity with no prepayment penalties. Under the terms of the PPP, certain amounts of the PPP Loan may be forgiven if they are used for qualifying expenses as described in the CARES Act. During the year-ended June 30, 2021, the PPP Loan and accrued interest was forgiven and a gain of $35,947 was recorded on the Companys Consolidated Statements of Operation.\nNote 8. Mineral Properties\nThe Company has capitalized acquisition costs on mineral properties as follows:\nJune 30, 2022\nJune 30, 2021\nSleeper and other Nevada based Projects\n$\n28,507,145\n$\n26,011,976\nGrassy Mountain and other Oregon based Projects\n23,235,728\n23,185,728\n$\n51,742,873\n$\n49,197,704\nSleeper:\nSleeper is located in Humbolt County, Nevada approximately 26 miles northwest of the town of Winnemucca.\nDuring the year-ended June 30, 2022, the Company recorded an increase in reclamation and environmental obligation of $2,475,169 (2021 - $1,498,950) (Note 9) for the Sleeper Gold Project.\nAlso, during the year-ended June 30, 2021, the Company purchased 152 unpatented lode mining claims by issuing 257,353 shares of common stock for a fair value of $277,941 and cash payment of $87,500 for a total consideration of $365,441. These claims have been included as part of the Sleeper Gold Project.\nGrassy Mountain:\nThe Grassy Mountain Project is located in Malheur County, Oregon, approximately 22 miles south of Vale, Oregon, and roughly 70 miles west of Boise, Idaho.\nNote 9. Reclamation and Environmental Obligation:\nReclamation and environmental costs are based principally on legal requirements. Management estimates costs associated with reclamation of mineral properties and properties under mine closure. On an ongoing basis the Company evaluates its estimates and assumptions; however, actual amounts could differ from those based on estimates and assumptions.\nThe Company has posted several cash bonds as financial security to satisfy reclamation requirements for its BLM mining claims. The balance of posted cash reclamation bonds at June 30, 2022 is $498,276 (June 30, 2021 - $533,703).\nParamount is responsible for managing the reclamation activities from the previous mine operations at the Sleeper Gold Mine as directed by the BLM and the Nevada State Department of Environmental Protection (NDEP). Paramount has estimated the undiscounted reclamation costs for existing disturbances at the Sleeper Gold Project required by the BLM to be $3,557,944. These costs are expected to be incurred between the calendar years 2022 and 2060. At June 30, 2022, Paramount has also estimated undiscounted reclamation cost as required by the NDEP to be $5,280,000 (2021- $1,470,000). These costs include on-going monitoring and new requests from the NDEP to convert three processing ponds from the historical operations to evaporation cell ponds by 2023. These costs are expected to be incurred between calendar years 2022 and 2039. The sum of expected costs by year are discounted using the Companys credit adjusted risk free interest rate from the time it expects to pay the retirement to the time it incurs the obligation. The asset retirement obligation for the Sleeper Gold Project recorded on the balance sheet is equal to the present value of the estimated reclamation costs as required by both the BLM and NDEP.\nThe following variables were used in the calculation for the fiscal years ending June 30, 2022 and 2021:\nYear Ended\nJune 30, 2022\nYear Ended\nJune 30, 2021\nWeighted-average credit adjusted risk free rate\n9.94\n%\n9.89\n%\nWeighted-average inflation rate\n2.32\n%\n2.31\n%\nChanges to the Companys asset retirement obligation for the Sleeper Gold Mine for the years ended June 30, 2022 and 2021 are as follows:\nYear Ended\nJune 30, 2022\nYear Ended\nJune 30, 2021\nBalance at beginning of period\n$\n1,849,644\n$\n615,170\nAccretion expense\n183,693\n60,040\nChange in estimates\n2,475,169\n179,150\nAdditions\n-\n1,319,800\nSettlements\n(33,236\n)\n(324,516\n)\nBalance at end of period\n$\n4,475,270\n$\n1,849,644\nThe balance of the reclamation and environmental obligation of $4,475,270 (2021 - $1,849,644) is comprised of a current portion of $120,000 (2021 - $310,022) and a non-current portion of $4,355,270 (2021 - $1,539,622).\nNote 10. Other Income\nThe Companys other income details were as follows:\nYear Ended\nJune 30, 2022\nYear Ended\nJune 30, 2021\nRe-imbursement of reclamation costs\n$\n321,113\n$\n324,516\nLeasing of water rights to third party\n5,858\n5,743\nRestitution payment\n4,000\n-\nTotal\n$\n330,971\n$\n330,259\nNote 11. Segmented Information\nSegmented information has been compiled based on the material mineral properties in which the Company performs exploration activities.\nExpenses and mineral property carrying values by material project for the year ended June 30, 2022:\nExploration and Development\nExpenses\nLand Holding Costs\nMineral Properties\nSleeper Gold Project and other Nevada based Projects\n$\n1,576,918\n$\n486,714\n$\n28,507,145\nGrassy Mountain Project and other Oregon based Projects\n2,859,348\n153,635\n23,235,728\n$\n4,436,266\n$\n640,349\n$\n51,742,873\nExpenses and mineral property carrying values by material project for the year ended June 30, 2021:\nExploration and Development\nExpenses\nLand Holding Costs\nMineral Properties\nSleeper Gold Project and other Nevada based Projects\n$\n866,932\n$\n437,671\n$\n26,011,976\nGrassy Mountain Project and other Oregon based Projects\n1,949,753\n102,730\n23,185,728\n$\n2,816,685\n$\n540,401\n$\n49,197,704\nAdditional operating expenses incurred by the Company are treated as corporate overhead with exception of accretion expense which is discussed in note 9.\nNote 12. Income Taxes\nAt June 30, 2022, the Company has net operating loss carry forwards of $38,209,398 (2021- $38,219,334) expiring between the years 2023 and 2038 which are available to reduce future taxable income. Tax losses incurred after June 30, 2018 of $23,983,360 (2021 - $17,456,576) may be carried forward indefinitely. The tax effects of the significant components within the Companys deferred tax asset (liability) at June 30, 2022 and 2021 are as follows:\nUnited States\nMineral properties\n$\n683,600\n$\n868,970\nAsset retirement obligation\n939,807\n388,425\nFixed assets\nStock options\n540,381\n447,913\nNet operating losses\n13,060,479\n11,676,822\n$\n15,224,471\n$\n13,382,516\nValuation allowance\n(14,015,248\n)\n(11,333,208\n)\nMineral properties\n$\n1,209,223\n$\n2,049,308\nNet deferred tax asset\n$\n-\n$\n-\nThe income tax recovery differs from the amounts computed by applying statutory tax to pre-tax losses as a result of the following:\nLoss before taxes\n$\n(7,559,689\n)\n$\n(5,903,618\n)\nUS Statutory tax rate\n21.00\n%\n21.00\n%\nExpected income recovery\n(1,587,535\n)\n(1,239,760\n)\nNon-deductible items\nChange in estimates\n(1,094,670\n)\n1,196,349\nOther items\n-\n-\nChange in tax rates\n-\n-\nChange in valuation allowance\n2,959,667\n43,254\nTotal income taxes (recovery)\n277,627\n$\n-\nCurrent tax expense (recovery)\n-\n-\nDeferred tax expense (recovery)\n277,627\n-\n$\n-\n$\n-\nThe potential tax benefits of net operating losses have not been recognized in these financial statements because the Company cannot be assured it is more likely than not it will utilize the net operating losses carried forward in future years.\nAccounting for uncertainty for Income Tax\nIncome taxes are determined using assets and liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. Deferred tax assets and liabilities are measured using the enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the period that includes the enactment date. In addition, a valuation allowance is established to reduce any deferred tax asset for which it is determined that it is more likely than not that some portion of the deferred tax asset will not be realized.\nAs at June 30, 2022 and 2021, the Companys consolidated balance sheets did not reflect a liability for uncertain tax positions, nor any accrued penalties or interest associated with income tax uncertainties. The Company is subject to income taxation at the federal and state levels. The Company is subject to US federal tax examinations for the tax years 2019 through 2022. Loss carryforwards generated or utilized in years earlier than 2019 are also subject to examination and adjustment. The Company has no income tax examinations in process.\nNote 13. Commitments and Contingencies:\nOther Commitments\nParamount has an agreement to acquire 44 mining claims (Cryla Claims) covering 589 acres located immediately to the west of the proposed Grassy Mountain site from Cryla LLC. Paramount is obligated to make annual lease payments of $40,000 per year the first two years of the lease term and $60,000 per year thereafter with an option to purchase the Cryla Claims for $560,000 at any time. The term of the agreement is 25 years. In the event Paramount exercises its option to acquire the Cryla Claims, all annual payments shall be credited against a production royalty that will be based on a prevailing price of the metals produced from the Cryla Claims. The royalty rate ranges between 2% and 4% based on the daily price of gold. The agreement with Cryla can be terminated by Paramount at any time. Paramount made the annual lease payment of $60,000 as required by the agreement during the year ended June 30, 2022. The Cryla Claims are without known mineral reserves and there is no current exploratory work being performed.\nParamount has an agreement with Nevada Select Royalty (Nevada Select) to purchase 100% in the Frost Project, which consists of 40 mining claims located approximately 12 miles west of its Grassy Mountain Project. A total consideration of $250,000 payable to Nevada Select will be based on certain events over time. Upon signing the agreement, Paramount made a payment of $10,000 to Nevada Select. Nevada Select will retain a 2% NSR on the Frost Claims and Paramount has the right to reduce the NSR to 1% for a payment of $1 million. All required payments under the agreement due at June 30, 2022 have been paid. The Frost Claims are without known mineral reserves.\nDuring the year-ended June 30, 2022, the Company entered into an option agreement with Nevada Select to purchase the Bald Peak mining claims in the State of Nevada and California for a total consideration of $300,000. Payments under the agreement will be based on achieving certain events over time. Upon signing the agreement Paramount made a payment to Nevada Select of $20,000. The Bald Peak Claims are without known mineral reserves.\nSeabridge holds an NPI put option in which during the 30-day period immediately following the day that the Company has delivered notice to Seabridge that a positive production decision has been made and construction financing has been secured with respect to the Grassy Mountain Project, Seabridge may cause the Company to purchase the NPI for CDN$10,000,000. If Seabridge exercises the right to cause the Company to purchase the NPI, the Company would likely need to seek additional equity or other financing to fund the purchase, which financing may not be available to the Company on favorable terms or at all.\nNote 14. Subsequent Events\nSubsequent to the fiscal year ended June 30, 2022, the Company issued 341,297 shares at a fair value price of $0.47 per share for the payment of interest accrued and owing at June 30, 2022 for its outstanding convertible debt. It also issued 50,000 stock options to a director of the Company."
}