{
    "cik": "1636051",
    "company": "FUSE GROUP HOLDING INC.",
    "filing_type": "10-K",
    "filing_date": "2023-12-27",
    "period_of_report": "2023-09-30",
    "sic": "1000",
    "state_of_inc": "NV",
    "state_location": "CA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1636051/0001185185-23-001351-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1636051/000118518523001351/fusegroup20230930_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1636051/0001185185-23-001351.txt",
    "filename": "1636051_10K_2023_0001185185-23-001351.htm",
    "content": "ITEM 1 - BUSINESS\nOverview and History\nFuse Group Holding Inc. (the Company or Fuse Group or we) was incorporated under the laws of the State of Nevada on December 24, 2013. Fuse Group currently explores opportunities in mining, biotech and consulting businesses. On December 6, 2016, the Company incorporated Fuse Processing, Inc. (Processing) in the State of California. Processing seeks business opportunities in mining and is currently investigating potential mining targets in Asia and North America. Fuse Group is the sole shareholder of Processing. In March 2017, Processing acquired 100% ownership of Fuse Trading Limited (Trading) for HKD1 ($0.13). Trading had no operations prior to the acquisition by Processing, and Trading was expected to be engaged in mining-related businesses. On April 22, 2022, Processing transferred 100% ownership of Trading to an unrelated third party for HKD1. On May 3, 2018, the Company incorporated Fuse Technology Inc. in the State of Nevada, which changed its name to Fuse Biotech Inc. on November 30, 2020. Fuse Group is the sole shareholder of Fuse Biotech Inc. (Fuse Biotech). Fuse Biotech was mainly engaged in IMETAL system development. The Company originally planned to operate IMETAL as a platform to facilitate investment and trade in raw metals, find specialized minerals, exploit these opportunities and issue tokens to be used on the platform, subject to compliance with applicable laws and regulations. Due to the development of laws and regulations on token issuance and trading, management discussed with the designer of the platform its function and compliance issues and believed the project has more issues and costs for compliance than originally expected. On December 23, 2019, the Board decided to terminate the IMETAL project. Currently, Fuse Biotech is seeking business opportunities in the biotech area.\nFuse Group and Processing provide consulting services to mining industry clients to find acquisition targets within the parameters set by the clients, when the mine owner is considering selling its mining rights. The services of Fuse Group and Processing include due diligence on the potential mine seller and the mine, such as ownership of the mine and whether the mine meets all operation requirements and/or is currently in operation.\nOn January 4, 2017, Processing entered into a Consulting and Strategist Agreement with a consulting company for a six-month term. On July 3, 2017, Processing and the consulting company extended the Consulting and Strategist Agreement until January 3, 2018 at no additional cost, and the Agreement was subsequently extended to July 3, 2018. The consultant provides Processing with market research, exploration and advise on business development opportunities in certain countries, and other general business advisory services. Processing paid a deposit of $1,325,000 for the consulting fee, of which, $325,000 was expensed as a consulting fee based on the agreement, and the remaining $1,000,000 of which would have been refunded to the Company if the Company had not made an investment and/or entered into a business relationship in Mexico. The consulting company found acquisition targets for the Company, and on June 22, 2018, the Company entered into a Memorandum of Understanding (MOU) with a seller to purchase concessions rights to five mineral locations located in different areas of Mexico for $1,000,000. Upon execution of the MOU, the Company acquired the exclusive right to purchase the concessions rights to mines from the seller until September 30, 2018. The parties entered into an oral agreement that the Company would pay a purchase price of $1,000,000 to purchase concessions rights to five mineral locations that would be consolidated into a local company in Mexico upon the approval from the Mexican government allowing the transfer of all mining concession to a Mexican company. On February 9, 2021, the Company and Processing entered into a Share Exchange Agreement (the Agreement) with Choo Keam Hui, Goh Hau Guan, Lim Hui Sing, Teh Boon Nee and Tia Chai Teck (collectively as the Sellers). Pursuant to the Agreement, the Company agreed to issue to the Sellers, in lieu of $1,000,000 in cash, an aggregate of 14,285,715 shares of common stock of the Company (the Fuse Shares) in exchange of all the outstanding shares of Portafolio en Investigacion Ambiental S.A. de C.V., a Mexican company that owns concessions rights to five mineral locations. The five mines have not been explored and have no operations, no existing contracts for the sale of output, no permits or licenses to conduct mining operations. Portafolio only has five concessions to explore for minerals and owns no facilities or equipment. There is no assurance that we will be able to obtain the surface rights and permits that are necessary to extract the minerals from the areas covered by the concessions. The Company is waiting for the Sellers to complete the transfer process for the equity interest of Portafolio to the Processing to complete the transaction which is subject to the Mexican government approval and has not happened yet.\nOn April 29, 2019, the Board of Directors of the Company approved an amendment to the Companys Articles of Incorporation (the Amendment) to change its name from Fuse Enterprises Inc. to Fuse Group Holding Inc. Also on April 29, 2019, stockholders holding a majority of the Companys outstanding capital stock approved the Amendment. The Amendment was filed with the Secretary of State for the State of Nevada on April 30, 2019, and became effective on May 13, 2019. On May 29, 2019, the Company changed its trading symbol on OTC Markets from FNST to FUST.\nOn March 11, 2021, Fuse Group and Biotech entered into a Share Exchange Agreement with E-Mo Biotech Holding Inc., a company incorporated under the laws of Nevada (the E-Mo Biotech), Qiyi Xie, a resident of California (Xie), Quan Qinghua, a citizen and resident of China (Quan), Jing Li, a citizen and resident of China (Li) and HWG Capital Sdn Bhd, a company incorporated under laws of Malaysia (HWG and hereinafter collectively with Xie, Quan and Li, the Sellers). Pursuant to the Agreement, the Company will issue the Sellers 100,000,000 shares of Companys common stock (the Fuse Shares) for all the issued and outstanding shares of E-Mo (the E-Mo Shares) owned by the Sellers. E-Mo Biotech Holding Inc. is a start-up, development-stage company involving in vaccine, immunological treatment and diagnostic product research and development and has no commercial sales of vaccines, treatments, or diagnostic products. The acquisition was not completed and the Fuse Shares were not issued. On September 30, 2021, the Company and Fuse Biotech entered into a Termination Agreement with E-Mo Biotech, the Sellers, effective on September 30, 2021. Pursuant to the Termination Agreement, the parties agreed to terminate the Share Exchange Agreement, which was originally entered into by and among the Company, Fuse Biotech, the Sellers and E-Mo Biotech on March 11, 2021.\nOn December 13, 2023, the Company entered into a Consulting Agreement (the Agreement) with Beijing Jixiang Fengqi Tech Company Limited, a company organized under the laws of China (the Customer). Pursuant to the Agreement, the Company will provide consulting services to the Customer, including marketing research, competitive analysis and business development strategy in North America as well as marketing strategies, product development, identifying and partnering with local businesses or distributors and other general business advisory services. The Agreement has a term of one year from December 13th, 2023 to December 12th, 2024 and may be renewed by the parties. For the services rendered by the Company as required by the Agreement, the Customer agrees to pay a service fee to the Company of $10,000 per month, payable monthly. The Company is diversifying its business to new growth area of consulting services, especially in the catering and culinary consulting service business.\nResearch and Development Activities\nOther than time spent researching our proposed business, we have not spent any funds on research and development activities to date. We do not currently plan to spend any funds on research and development activities in the near future.\nWe are not aware of any environmental laws that have been enacted, nor are we aware of any such laws contemplated for the future, that affect our current operations.\nHuman Capital Resources\nWe understand that our success depends on our ability to attract, train and retain our employees. We strive to attract, recruit, and retain employees through competitive compensation and benefit programs, and development opportunities that support career growth and advancement opportunities, and employee engagement initiatives that foster a strong Company culture. We also recognize the importance of keeping our employees safe. In response to the COVID-19 pandemic, we implemented changes that we determined were in the best interest of our employees and have followed local government orders to prevent the spread of COVID-19.\nEmployees\nAs of the date of this Annual Report we have two employees, all of which are full-time. Our officers and directors are responsible for planning, developing and operational duties, and will continue to do so throughout the early stages of our growth.\nReports to Securities Holders\nWe file an annual report that includes audited financial information which is available to our shareholders. We will make our financial information equally available to any interested parties or investors through compliance with the disclosure rules for a small business issuer under the Securities Exchange Act of 1934. We are subject to disclosure filing requirements including filing Form 10-K annually and Form 10-Q quarterly. In addition, we will file Forms 8-K from time to time as required. We do not intend to voluntarily file the above reports if our obligation to file such reports is suspended under the Exchange Act. The shareholders and public may read and copy any materials that we file with the Securities and Exchange Commission, (SEC or Commission), at the SECs Public Reference Room at 100 F Street NE, Washington, DC 20549.\nThe public may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC maintains an Internet site (http://www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. ITEM 1A - RISK FACTORS\nAn investment in the Companys common stock involves a high degree of risk. In addition to the following risk factors, you should carefully consider the risks, uncertainties and assumptions discussed herein, and in other documents that the Company subsequently files with the SEC, that update, supplement or supersede such information for which documents are incorporated by reference into this Report. Additional risks not presently known to the Company, or which the Company considers immaterial based on information currently available, may also materially adversely affect the Companys business. If any of the events anticipated by the risks described herein occur, the Companys business, cash flow, results of operations and financial condition could be adversely affected, which could result in a decline in the market price of the Companys common stock, causing you to lose all or part of your investment.\nWe are a smaller reporting company and we cannot be certain if the reduced reporting requirements applicable to smaller reporting companies will make our shares of common stock less attractive to investors.\nWe are currently a smaller reporting company, meaning we are not an investment company, an asset-backed issuer, or a majority-owned subsidiary of a parent company that is not a smaller reporting company and have a public float of less than $250 million and annual revenues of less than $100 million during the most recently completed fiscal year. Smaller reporting companies are able to provide simplified executive compensation disclosures in their filings; are exempt from the provisions of Section 404(b) of the Sarbanes-Oxley Act requiring that independent registered public accounting firms provide an attestation report on the effectiveness of internal control over financial reporting; and have certain other decreased disclosure obligations in their SEC filings, including, among other things, only being required to provide two years of audited financial statements in annual reports.\nDecreased disclosures in our SEC filings due to our status as a smaller reporting company may make it harder for investors to analyze the Companys results of operations and financial prospects.\nWe lack an operating history. There is no assurance our future operations will result in profitable revenues. If we cannot generate sufficient revenues to operate profitably, our business will fail.\nWe were incorporated on December 24, 2013, and as of September 30, 2023, we had accumulated a deficit of $7,909,019. We have a limited operating history upon which an evaluation of our future success or failure can be made. Based upon current plans, we expect to continue generating revenues. However, our revenues may not be sufficient to cover our operating costs. We cannot guarantee we will be successful in generating significant revenues in the future. Failure to achieve a sustainable sales level will cause us to go out of business.\nOur success depends substantially on the continued retention of certain key personnel and our ability to hire and retain qualified personnel in the future to support our growth.\nIf our senior executive or other key personnel are unable or unwilling to continue in their present positions, our business may be disrupted and our financial condition and results of operations may be materially and adversely affected. We are dependent upon Mr. Umesh Patel, our chief executive officer (CEO) and chief financial officer (CFO) and director. The loss of the service of Mr. Patel for any reason could significantly adversely impact our business and results of operations. Competition for senior management in the U.S. is intense and the pool of qualified candidates is very limited. Accordingly, we cannot guarantee that the services of our senior executive and other key personnel will continue to be available to us, or that we will be able to find a suitable replacement for them if they were to leave.\nWe face intense competition in our industry. If we are unable to compete successfully, our business will be seriously harmed.\nThe market for mining consulting services is highly competitive and has low barriers to entry. Our competitors vary in size and in the variety of services they offer. Many of our current and potential competitors have longer operating histories, significantly greater financial, technical, marketing and other resources, and an established client base. These competitors may be able to adapt more quickly to new or emerging technologies and changes in customer requirements. They may also be able to devote greater resources to the promotion and sales of their services than we can, or may adopt more aggressive pricing policies. If we fail to compete successfully against our competitors, our revenue could decline and our business could be harmed.\nWe dont have an audit committee. If we fail to maintain an effective system of internal control over financial reporting, we may not be able to accurately report our financial results. As a result, current and potential shareholders could lose confidence in our financial reporting, which would harm our business and the trading price of our stock.\nManagement determined our internal audit function is also deficient due to insufficient qualified resources to perform internal audits and we have not established an Audit Committee of our Board of Directors (BOD).\nWe are a smaller reporting company with limited resources. Currently, we do not have an audit committee and has not implemented appropriate information technology controls and is lack of sufficient accounting personnel with the appropriate level of knowledge, experience and training in U.S. GAAP and SEC reporting requirements as we have given priority in the use of the limited resources to the development of our business. Therefore, we cannot assure investors that we will be able to maintain effective internal controls over financial reporting based on criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework.\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. For these reasons, we are considering the costs and benefits associated with improving and documenting our disclosure controls and procedures and internal controls and procedures, which includes (i) hiring additional personnel with sufficient U.S. GAAP experience and (ii) implementing ongoing training in U.S. GAAP requirements for our accounting and other finance personnel. If the result of these efforts are not successful, or if material weaknesses are identified in our internal control over financial reporting, our management will be unable to report favorably as to the effectiveness of our internal control over financial reporting and/or our disclosure controls and procedures, and we could be required to further implement expensive and time-consuming remedial measures and potentially lose investor confidence in the accuracy and completeness of our financial reports which could have an adverse effect on our stock price and potentially subject us to litigation.\nWe do not have a majority of independent directors on our Board and the Company has not voluntarily implemented various corporate governance measures, in the absence of which shareholders may have more limited protections against interested director transactions, conflicts of interest and similar matters.\nFederal legislation, including the Sarbanes-Oxley Act of 2002, resulted in the adoption of various corporate governance measures designed to promote the integrity of the corporate management and the securities markets. Some of these measures have been adopted in response to legal requirements. Others have been adopted by companies in response to the requirements of national securities exchanges, such as the NYSE or the NASDAQ Stock Market, on which their securities are listed. Among the corporate governance measures that are required under the rules of national securities exchanges are those that address board of directors independence, audit committee oversight, and the adoption of a code of ethics. We have not yet adopted any of these other corporate governance measures and since our securities are not yet listed on a national securities exchange, we are not required to do so.\nOur BOD is comprised of two individuals, one of whom is also our executive officer.\nWe have not adopted corporate governance measures such as an audit or other independent committee of our Board. If we expand our Board membership in future periods to include additional independent directors, we may seek to establish an audit and other committees of our Board. It is possible that if our BOD included independent directors and if we were to adopt some or all of these corporate governance measures, shareholders would benefit from somewhat greater assurance that internal corporate decisions were being made by disinterested directors and that policies had been implemented to define responsible conduct.\nFor example, at present in the absence of audit, nominating and compensation committees comprised of independent directors, decisions concerning matters such as compensation packages or employment contracts to our senior officers are made by a majority of directors who have an interest in the outcome of the matters being decided. However, as a general rule, the Board, in making its decisions, determines first that the terms of such transaction are no less favorable to us that those that would be available to us with respect to such a transaction from unaffiliated third parties. The Company executes the transaction between executive officers and the Company once it was approved by the BOD.\nProspective investors should bear in mind our current lack of corporate governance measures in formulating their investment decisions.\nLandbond Home Limited, our largest shareholder, will have control over key decision making as a result of its control of a substantial amount of our voting stock.\nAs of December 26, 2023, Landbond Home Limited (Landbond), and its sole director, Mr. Yong Zhang, directly and indirectly owned 21,046,862 shares, or 31.7%, of our then outstanding common stock. Landbonds beneficial ownership of 31.7% of our issued and outstanding common stock give it significant influence to the outcome of matters submitted to shareholders for approval in the future, including the election of directors and any merger, consolidation, or sale of all or substantially all of their respective assets. This concentrated ownership could delay, defer, or prevent a change of control, merger, consolidation, or sale of all or substantially all of their respective assets that other shareholders support, or conversely this concentrated control could result in the consummation of such a transaction that other shareholders do not support. This concentrated ownership could also discourage a potential investor from acquiring our common stock, due to the limited voting power of such shares. As a shareholder, even a major shareholder, Landbond is entitled to vote its shares in its own interests, which may not always be in the interests of our shareholders generally.\nThe Company is subject to the 15(d) reporting requirements under the Securities Exchange Act of 1934 which does not require a company to file all the same reports and information as fully reporting company.\nPursuant to Section 15(d), we are required to file periodic reports with the SEC, such as annual reports on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K. That filing obligation will generally apply even if our reporting obligations have been suspended automatically under section 15(d) of the Exchange Act prior to the due date for the Form 10-K.\nOn the first day of any fiscal year after fiscal year 2016 and provided the Company has fewer than 300 shareholders, the Company is not required to file these reports. If the reports are not filed, the investors will have reduced visibility as to the Company and its financial condition. In addition, as a filer subject to Section 15(d) of the Exchange Act, the Company is not required to prepare proxy or information statements; our common stock will not be subject to the protection of the going private regulations; the company will be subject to only limited portions of the tender offer rules; our officers, directors, and more than ten percent shareholders are not required to file beneficial ownership reports about their holdings in our company; that these persons will not be subject to the short-swing profit recovery provisions of the Exchange Act; and that more than five percent holders of classes of your equity securities will not be required to report information about their ownership positions in the securities.\nAn occurrence of an uncontrollable event such as the COVID-19 pandemic may negatively affect our operations and financial results.\nIn December 2019, a novel strain of coronavirus, causing a disease referred to as COVID-19, was reported and has spread to multiple countries, including the United States. In March 2020, the World Health Organization declared the COVID-19 outbreak a pandemic. The pandemic has resulted in quarantines, travel restrictions, and the temporary closure of office buildings and facilities in the US.\nOur business and services and results of operations have been adversely affected and could continue to be adversely affected by the COVID-19 pandemic. The effects of quarantines, travel restrictions, and the temporary closure of office buildings have negatively impacted our business development, and disrupted or delayed our current mine projects and services to our clients during the outbreak. These and similar, and perhaps more severe, disruptions in our operations could negatively impact our business, operating results and financial condition.\nQuarantines, travel restrictions, shelter-in-place and other restrictions related to COVID-19 have impacted our abilities to visit mines in Mexico and Asian counties as well as meeting with potential clients and miner owners for our consulting business and our own investment in mine projects during the outbreak.\nThe global economy was materially negatively affected by COVID-19 and it is difficult to predict any new variants or outbreak of COVID-19, however, a widespread pandemic could result in significant disruption of global financial markets, reducing our ability to access capital, which could negatively affect our liquidity. In addition, a recession or market correction resulting from the outbreak of a pandemic could materially affect our business and the value of our common stock.\nFurther, as we do not have access to a revolving credit facility, there can be no assurance that we would be able to secure commercial debt financing in the future in the event that we require additional capital. We currently believe that our financial resources will be adequate to see us through the next 12 months. However, in the event that we do need to raise capital in the future, the outbreak-related instability in the securities markets could adversely affect our ability to raise additional capital.\nIn general, our business could be adversely affected by the effects of epidemics, including, but not limited to, COVID-19, avian influenza, severe acute respiratory syndrome (SARS), the influenza A virus, the Ebola virus, or other outbreaks. In response to an epidemic or other outbreaks, government and other organizations may adopt regulations and policies that could lead to severe disruption to our daily operations, including temporary closure of our offices and other facilities. These severe conditions may cause us and/or our business partners to make internal adjustments, including but not limited to, temporarily closing down business, limiting business hours, and setting restrictions on travel and/or visits with clients and partners for a prolonged period of time. Various impacts arising from severe conditions may cause business disruption, resulting in material adverse effects to our financial condition and results of operations.\nIf our costs and demands upon management increase disproportionately to the growth of our business and revenue as a result of complying with the laws and regulations affecting public companies, our operating results could be harmed.\nAs a public company, we do and will continue to incur significant legal, accounting, and other expenses, including costs associated with public company reporting requirements. We also have incurred and will incur costs associated with current corporate governance requirements, including requirements under Section 404 and other provisions of Sarbanes-Oxley, as well as rules implemented by the SEC and the OTC Markets on which our common stock is traded. The expenses incurred by public companies for reporting and corporate governance purposes have increased dramatically over the past several years. These rules and regulations have increased our legal and financial compliance costs substantially and make some activities more time consuming and costly. If our costs and demands upon management increase disproportionately to the growth of our business and revenue, our operating results could be harmed.\nWe do not intend to pay dividends and there may be fewer ways in which you can make a gain on any investment in the Company.\nWe have never paid any cash dividends and currently do not intend to pay any dividends for the foreseeable future. To the extent that we require additional funding currently not provided for in our financing plan, our funding sources may likely prohibit the payment of a dividend. Because we do not intend to declare dividends, any gain on an investment in the Company will need to come through appreciation of the stocks price.\nWe may engage in future acquisitions involving significant expenditures of cash, the incurrence of debt or the issuance of stock, all of which could have a materially adverse effect on our operating results.\nAs part of our business strategy, we review acquisition and strategic investment prospects that we believe would offer strategic growth opportunities. From time to time, we review investments in new businesses and we expect to make investments in, and to acquire, businesses, products or technologies in the future. In the event of future acquisitions, we may expend significant cash, incur substantial debt and/or issue equity securities and dilute the percentage ownership of current shareholders, all of which could have a material adverse effect on our operating results and the price of our common stock. We cannot guarantee we will be able to successfully integrate any businesses, products, technologies or personnel that we may acquire in the future, and our failure to do so could have a material adverse effect on our business, operating results and financial condition.\nThere is a very limited public market for our common stock and therefore, our investors may not be able to sell their shares.\nOur common stock is listed on the over-the-counter exchange, and is thinly traded. As a result, shareholders may be unable to liquidate their investments, or may encounter considerable delay in selling shares of our common stock. If an active trading market does develop, the market price of our common stock is likely to be highly volatile due to, among other things, the nature of our business and because we are a public company with a limited operating history. Further, even if a public market develops, the volume of trading in our common stock will presumably be limited and likely be dominated by a few individual shareholders. The limited volume, if any, will make the price of our common stock subject to manipulation by one or more shareholders and will significantly limit the number of shares that one can purchase or sell in a short period of time. The market price of our common stock may also fluctuate significantly in response to the following factors, most of which are beyond our control:\n- variations in our quarterly operating results;\n- changes in general economic conditions;\n- price competition or pricing changes by us or our competitors;\n- new services offerings or other actions by our competitors;\n- loss of a major customer, partner or joint venture participant; and\n- the addition or loss of key managerial and collaborative personnel.\nThe equity markets have, on occasion, experienced significant price and volume fluctuations that have affected the market prices for many companies securities and that have often been unrelated to the operating performance of these companies.\nAny such fluctuations may adversely affect the market price of our common stock, regardless of our actual operating performance. As a result, shareholders may be unable to sell their shares, or may be forced to sell them at a loss.\nOur common stock was accepted for quotation on the OTCQB, as a result, the application of the Penny Stock rules could adversely affect the market price of our common shares and increase your transaction costs to sell those shares. The SEC has Rule 3A51-1, which establishes the definition of a Penny Stock, for the purposes relevant to us, as any equity security that has market price of less than $5.00 per share or within an exercise price of less than $5.00 per share, subject to certain exceptions. For any transaction involving a penny stock, unless exempt, Rule 15G-9 require:\n- that a broker or dealer approve a persons account for transactions in penny stocks; and\n- the broker or dealer receive from the investor a written agreement to the transaction, setting forth the identity and quantity of the penny stock to be purchased.\nIn order to approve a persons account for transactions in penny stocks, the broker or dealer must:\n- obtain financial information and investment experience objectives of the person; and\n- make a reasonable determination that the transactions in penny stocks are suitable for that person and the person has sufficient knowledge and experience in financial matters to be capable of evaluating the risks of transactions in penny stocks.\nThe broker or dealer must also deliver, prior to any transaction in a penny stock, a disclosure schedule prescribed by the SEC relating to the penny stock market, which, in highlight form:\n- sets forth the basis on which the broker or dealer made the suitability determination; and\n- that the broker or dealer received a signed, written agreement from the investor prior to the transaction.\nGenerally, brokers may be less willing to execute transactions in securities subject to the penny stock rules. This may make it more difficult for investors to dispose of our common stock and cause a decline in the market value of our stock.  ITEM 2 - PROPERTIES\nWe lease office space in Arcadia, California for monthly rent of approximately $2,200 pursuant to a lease with a term from December 31, 2018 to November 30, 2021. On February 28, 2022, the Company renewed lease for three more years, commencing on December 1, 2021. The new monthly base rent is $2,243 payable on the first day of each month, with a 6% increase each year. The lease will expire on November 30, 2024. ITEM 3 - LEGAL PROCEEDINGS\nWe may from time to time be party to litigation and subject to claims incident to the ordinary course of business. As we grow and gain prominence in the marketplace we may become party to an increasing number of litigation matters and claims. The outcome of litigation and claims cannot be predicted with certainty, and the resolution of these matters could materially affect our future results of operations, cash flows or financial position. We are not currently a party to any legal proceedings. ITEM 4 - MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5 - MARKET FOR REGISTRANTS COMMON EQUITY, RELATED SHAREHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOn August 8, 2016, our common stock was approved for trading on OTCQB under the trading symbol FSNT. Prior to that time, there was no public market for our stock. On May 29, 2019, the Company changed its trading symbol on OTC Markets from FNST to FUST.\nHolders.\nAs of December 26, 2023, there were 79 record holders of the Companys common stock and 66,370,866 shares of our Common Stock issued and outstanding.\nDividends.\nThe Company has not paid any cash dividends to date and does not anticipate or contemplate paying dividends in the foreseeable future. It is the present intention of management to utilize all available funds for the development of the Companys business.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nNone.\nRecent Sales of Unregistered Securities and Use of Proceeds\nThe Company did not make any sales of unregistered securities during the fiscal year ended September 30, 2023 that were not previously disclosed in a quarterly report on Form 10-Q or a current report on Form 8-K. ITEM 6 - SELECTED FINANCIAL DATA\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 7 - MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nDISCLAIMER REGARDING FORWARD-LOOKING STATEMENTS\nThe following discussion and analysis of the consolidated financial condition and results of operations should be read in conjunction with our consolidated financial statements and related notes appearing elsewhere in this report. This discussion and analysis contains forward-looking statements that involve risks, uncertainties and assumptions. Our actual results could differ materially from the results described in or implied by these forward-looking statements as a result of various factors, including those discussed below and elsewhere in the Annual Report on Form 10-K, particularly under the heading Risk Factors and those set forth from time to time in our other filings with the SEC.\nOverview\nFuse Group Holding Inc. (the Company or Fuse Group or we) was incorporated under the laws of the State of Nevada on December 24, 2013. Fuse Group currently develops opportunities in mining, biotech and consulting areas. On December 6, 2016, the Company incorporated Fuse Processing, Inc. (Processing) in the State of California. Processing seeks business opportunities in mining and is currently investigating potential mining targets in Asia and North America. Fuse Group is the sole shareholder of Processing. In March 2017, Processing acquired 100% ownership of Fuse Trading Limited (Trading) for HKD1 ($0.13). Trading had no operations prior to the acquisition by Processing, and Trading was expected to be engaged in mining-related businesses. On April 22, 2022, Processing transferred 100% ownership of Trading to an unrelated third party for HKD1. On May 3, 2018, the Company incorporated Fuse Technology Inc. in the State of Nevada, which changed its name to Fuse Biotech Inc. on November 30, 2020. Fuse Group is the sole shareholder of Fuse Biotech Inc. (Fuse Biotech). Fuse Biotech originally engaged in IMETAL system development. The Company originally planned to operate IMETAL as a platform to facilitate investment and trade in raw metals, find specialized minerals, exploit these opportunities and issue tokens to be used on the platform, subject to compliance with applicable laws and regulations. Due to the development of laws and regulations on token issuance and trading, management discussed its function and compliance issues with the designer of the platform and concluded the project had more issues and costs for compliance than originally expected, on December 23, 2019, the Board decided to terminate the IMETAL project. Currently, Fuse Biotech seeks business opportunities in the biotech area.\nFuse Group and Processing provide consulting services to mining industry clients to find acquisition targets within the parameters set by the clients, when the mine owner is considering selling its mining rights. The services of Fuse Group and Processing include due diligence on the potential mine seller and the mine, such as ownership of the mine and whether the mine meets all operation requirements and/or is currently in operation.\nOn January 4, 2017, Processing entered into a Consulting and Strategist Agreement with a consulting company for a six-month term. On July 3, 2017, Processing and the consulting company extended the Consulting and Strategist Agreement until January 3, 2018 at no additional cost, and the Agreement was subsequently extended to July 3, 2018. The consultant provides Processing with market research, exploration and advise on business development opportunities in certain countries, and other general business advisory services. Processing paid a deposit of $1,325,000 for the consulting fee, of which, $325,000 was expensed as a consulting fee based on the agreement, and the remaining $1,000,000 of which would have been refunded to the Company if the Company had not made an investment and/or entered into a business relationship in Mexico. The consulting company found acquisition targets for the Company, and on June 22, 2018, the Company entered into a Memorandum of Understanding (MOU) with a seller to purchase concessions rights to five mineral locations located in different areas of Mexico for $1,000,000. Upon execution of the MOU, the Company acquired the exclusive right to purchase the concessions rights to mines from the seller until September 30, 2018. The parties entered into an oral agreement that the Company would pay a purchase price of $1,000,000 to purchase concessions rights to five mineral locations that would be consolidated into a local company in Mexico upon the approval from the Mexican government allowing the transfer of all mining concession to a Mexican company.\nOn February 9, 2021, the Company and Processing entered into a Share Exchange Agreement (the Agreement) with Choo Keam Hui, Goh Hau Guan, Lim Hui Sing, Teh Boon Nee and Tia Chai Teck (collectively as the Sellers). Pursuant to the Agreement, the Company agreed to issue to the Sellers in aggregate of 14,285,715 shares of common stock of the Company (the Fuse Shares) in exchange of all the outstanding shares of Portafolio en Investigacion Ambiental S.A. de C.V., a Mexican company (\"Portafolio) owned by the Sellers. Portafolio owns concessions rights to five mineral locations and the five mines have not been explored and have no operations, no existing contracts for the sale of output, no permits or licenses to conduct mining operations. Portafolio only has five concessions to explore for minerals and owns no facilities or equipment. There is no assurance that we will be able to obtain the surface rights and permits that are necessary to extract the minerals from the areas covered by the concessions. The Company is waiting for the Sellers to complete the transfer process for the equity interest of Portafolio to the Processing to complete the transaction which is subject to the Mexican government approval and has not happened yet.\nStock certificates for 14,285,715 shares were prepared by the Company for the closing of the transaction contemplated in the Agreement but were not delivered to the Sellers. After reevaluation of the Agreement, the Company determined that the transaction was incorrectly recorded, as such stock certificates remained in the custody of the Company and not delivered (i.e. provided as consideration) to the Sellers. On October 20, 2021, the Company cancelled these stock certificates.\nOn April 29, 2019, the Board of Directors (BOD) of the Company approved an amendment to the Companys Articles of Incorporation (the Amendment) to change its name from Fuse Enterprises Inc. to Fuse Group Holding Inc. Also on April 29, 2019, stockholders holding a majority of the Companys outstanding capital stock approved the Amendment. The Amendment was filed with the Secretary of State for the State of Nevada on April 30, 2019, and became effective on May 13, 2019. On May 29, 2019, the Company changed its trading symbol on OTC Markets from FNST to FUST.\nIn March 2020, the World Health Organization declared the COVID-19 outbreak a pandemic, and the pandemic has resulted in quarantines, travel restrictions, and the temporary closure of office buildings and facilities in the US. Our business and services and results of operations were adversely affected. The pandemic negatively impacted our business development, and disrupted or delayed our mine projects and services to our clients. Quarantines, travel restrictions, shelter-in-place and other restrictions related to COVID-19 have impacted our abilities to visit mines in Mexico and Asian counties as well as to meet with potential clients and mine owners for our consulting business and our own investment in mine projects. Our clients that are negatively impacted by the outbreak of COVID-19 may cancel or suspend their mine acquisition projects, which in turn will reduce their demands for our services and materially adversely impact our revenue. The businesses are back to normal in the U.S. and in California, however, the U.S. and global growth forecast are still uncertain, which would seriously affect peoples investment desires in mines in Mexico, Asia and internationally.\nWe received a $49,600 Paycheck Protection Program loan (PPP loan) and a $105,500 Economic Injury Disaster Loan (EIDL loan) from US Small Business Administration (the SBA) during the year ended September 30, 2020. The forgiveness of $49,600 PPP loan was approved in June 2021.\nOn March 11, 2021, Fuse Group and Fuse Biotech entered into a Share Exchange Agreement with E-Mo Biotech Holding Inc., a company incorporated under the laws of Nevada (the E-Mo Biotech), Qiyi Xie, a resident of California (Xie), Quan Qinghua, a citizen and resident of China (Quan), Jing Li, a citizen and resident of China (Li) and HWG Capital Sdn Bhd, a company incorporated under laws of Malaysia (HWG and hereinafter collectively with Xie, Quan and Li, the Sellers). Pursuant to the Agreement, the Company will issue the Sellers 100,000,000 shares of Companys common stock (the Fuse Shares) for all the issued and outstanding shares of E-Mo Biotech (the E-Mo Shares) owned by the Sellers. E-Mo Biotech Holding Inc. is a start-up, development-stage company involving in vaccine, immunological treatment and diagnostic product research and development and has no commercial sales of vaccines, treatments, or diagnostic products. The acquisition was not completed and the Fuse Shares were not issued. On September 30, 2021, the Company and Fuse Biotech entered into a Termination Agreement with E-Mo Biotech, the Sellers, effective on September 30, 2021. Pursuant to the Termination Agreement, the parties agreed to terminate the Share Exchange Agreement, which was originally entered into by and among the Company, Fuse Biotech, the Sellers and E-Mo Biotech on March 11, 2021.\nOn June 30, 2023, the Company received a written notice from Liu Marketing (M) SDN BHD (the Lender), pursuant to certain Convertible Promissory Notes made by the Company in favor of Lender on February 15, 2022, March 23, 2022, June 9, 2022, July 1, 2022, August 19, 2022, October 6, 2022, November 7, 2022, December 16, 2022, January 30, 2023, February 24, 2023, April 10, 2023 and May 29, 2023 (the Notes), that the Lender elected to convert all of the Notes balances (including principal and interest of the Notes) of $716,767 for 1,592,816 shares of common stock of the Company (the Shares) at the conversion price of $0.45 per share. On July 7, 2023, the Shares were issued to the Lender pursuant to an exemption from registration under Regulation S, promulgated under the Securities Act of 1933, as amended.\nOn December 13, 2023, the Company entered into a Consulting Agreement (the Agreement) with Beijing Jixiang Fengqi Tech Company Limited, a company organized under the laws of China (the Customer). Pursuant to the Agreement, the Company will provide consulting services to the Customer, including marketing research, competitive analysis and business development strategy in North America as well as marketing strategies, product development, identifying and partnering with local businesses or distributors and other general business advisory services. The Agreement has a term of one year from December 13th, 2023 to December 12th, 2024 and may be renewed by the parties. For the services rendered by the Company as required by the Agreement, the Customer agrees to pay a service fee to the Company of $10,000 per month, payable monthly. The Company is diversifying its business to new growth area of consulting services, especially in the catering and culinary consulting service business.\nResults of operations for the years ended September 30, 2023 and 2022\nRevenue and Cost of Revenue\nWe develop our business in mining and investigate potential mining targets in Asia and North America. In addition to our own investment in mining businesses, we provide consulting services to clients which are mining business investors with potential mine acquisition targets within the specific parameters set by those clients, where the mine owner is considering selling its mining rights. Our services include due diligence on the potential mine seller and the mine, such as ownership of the mine and whether the mine meets all operation requirements and/or is currently in operation.\nOur revenue for the year ended September 30, 2023 was nil. For the year ended September 30, 2022, we provided two potential mine opportunities in Mexico to a client. For the year ended September 30, 2022, the Company recorded revenue of $200,000 for the services provided. Our cost of revenues for the years ended September 30, 2023 and 2022 was nil and $10,015, respectively, which was mainly for the consulting expenses paid for mine expertise during the mine due diligence period, resulting in a gross profit of nil and $189,985 for the year ended September 30, 2023 and 2022, respectively.\nCosts and Expenses\nThe major components of our expenses for the years ended September 30, 2023 and 2022 are in the table below:\nIncrease\n(Decrease)\nGeneral and administrative\n$ 393,119\n$ 551,236\n$ (158,117\n)\nConsulting fees\n62,000\n72,403\n(10,403\n)\nTotal operating expenses\n$ 455,119\n$ 623,639\n$ (168,520\n)\nThe decrease in our operating expenses for the year ended September 30, 2023, compared to the year ended September 30, 2022, was mainly due to a decrease in consulting fee by $10,403, a decrease in auditing fee by $47,000, a decrease in insurance expense by $11,216, a decrease in payroll expense by $50,283, a decrease in travel expense by $17,414, a decrease in lawyer fee by $14,895, and a decrease in other general and administrative expenses by $17,309.\nNon-operating income (expenses), net\nNet non-operating expenses was $17,283 for the year ended September 30, 2023, compared to non-operating expenses of $8,438 for year ended September 30, 2022. For the year ended September 30, 2023, non-operating expenses mainly consisted of interest expense on EIDL of $4,600 and interest expense on convertible notes of $12,683. For the year ended September 30, 2022, non-operating expenses mainly consisted of interest expense on EIDL of $4,032 and interest expense on convertible notes of $4,466.\nLiquidity and Capital Resources\nThe table below provides selected working capital information as of September 30, 2023 and 2022:\nSeptember 30,\nSeptember 30,\nTotal current assets\n$ 39,256\n$ 45,014\nTotal current liabilities\n93,134\n37,573\nWorking capital\n$ (53,878\n)\n$ 7,441\nLiquidity\nDuring the years ended September 30, 2023 and 2022, we had net loss of $474,802 and net loss of $444,492, respectively.\nIf we are not successful in developing the mining business and establishing profitability and positive cash flow, additional capital may be required to maintain ongoing operations. We have explored and continue to explore options to obtain additional financing to fund future operations as well as other possible courses of action. Such actions may include, but are not limited to, securing lines of credit, sales of debt or equity securities (which may result in dilution to existing shareholders), loans and cash advances from other third parties or banks, and other similar actions. There can be no assurance we will be able to obtain additional funding (if needed), on acceptable terms or at all, through a sale of our common stock, loans from financial institutions, or other third parties, or any of the actions discussed above. If we cannot sustain profitable operations, and additional capital is unavailable, lack of liquidity could have a material adverse effect on our business viability, financial position, results of operations and cash flows.\nCash Flows\nThe table below, for the periods indicated, provides selected cash flow information for the years ended September 30, 2023 and 2022:\nNet cash used in operating activities\n$ (439,770\n)\n$ (449,844\n)\nNet cash provided by financing activities\n433,362\n347,337\nNet decrease in cash\n$ (6,408\n)\n$ (102,507\n)\nCash Flows from Operating Activities\nOur cash used in operating activities for the years ended September 30, 2023 and 2022 was $439,770 and $449,844, respectively. The slight decrease in cash outflow during the year ended September 30, 2023 was due to increased cash inflow from other payable by $43,171, increase in cash inflow from accrued interest by $8,217, which was partly offset by increased cash outflow resulted from net loss after noncash adjustments by $28,086, increased cash outflow on prepaid expense by $11,514, and increased lease payment by $1,714.\nCash Flows from Investing Activities\nDuring the years ended September 30, 2023 and 2022, we did not have any investing activities.\nCash Flows from Financing Activities\nOur cash from financing activities for the years ended September 30, 2023 and 2022, was $433,362 and $347,337, respectively. For the year ended September 30, 2023, cash provided by financing activities mainly consisted of proceeds from issuance of convertible notes of $400,000, and cash advance from CEO of $35,973, which was partly offset by repayment to EIDL loan of $2,611. For the year ended September 30, 2022, cash provided by financing activities mainly consisted of proceeds from issuance of convertible notes of $350,000, which was partly offset by repayment to EIDL loan of $2,663.\nRecent Accounting Pronouncements\nSee Note 2 to the Consolidated Financial Statements.\nOff Balance Sheet Arrangements\nAs of September 30, 2023, we did not have any off-balance-sheet arrangements. ITEM 7A - QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8 - FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe information called for by this item is included in the Companys consolidated financial statements beginning on page of this Annual Report on Form 10-K. ITEM 9 - CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nChanges in Registrants Certifying Accountant\n(A) On April 5, 2022, the Board of Directors of the Company approved the dismissal of Paris, Kreit & Chiu CPA LLP (Paris Kreit) as the Companys independent registered public accounting firm, effective immediately.\nParis Kreits audit reports on the Companys consolidated financial statements as of and for the fiscal years ended September 30, 2021 did not contain an adverse opinion or a disclaimer of opinion and were not qualified or modified as to uncertainty, audit scope or accounting principles, except that the audit reports on the consolidated financial statements of the Company for the fiscal years ended September 30, 2021 contained an uncertainty about the Companys ability to continue as a going concern.\nDuring the fiscal years ended September 30, 2021, and in the subsequent interim period through April 4, 2022, there were (i) no disagreements between the Company and Paris Kreit on any matter of accounting principles or practices, financial statement disclosure or auditing scope or procedure, which disagreements, if not resolved to the satisfaction of Paris Kreit, would have caused Paris Kreit to make reference to the subject matter of the disagreement in their reports on the financial statements for such years, and (ii) no reportable events as that term is defined in Item 304(a)(1)(v) of Regulation S-K, except as noted in the following paragraph:\nDuring the fiscal years ended September 30, 2021, and through the interim period ended April 4, 2022, there were the following reportable events (as such term is defined in Item 304 of Regulation S-K). As disclosed in Part I, Item 4 of the Companys Form 10-Q for the quarter ended December 31, 2021, the Companys management determined that the Companys internal controls over financial reporting were not effective as of the end of such period due to the existence of material weaknesses related to the following:\n1. We do not have an Audit Committee. While we are not legally obligated to have an audit committee, it is the managements view that such a committee, including a financial expert member, is of the utmost importance for entity-level control over the Companys financial statements. Currently, the Board of Directors acts in the capacity of an audit committee.\n2. We did not implement appropriate information technology controls. As of December 31, 2021, the Company was retaining copies of all financial data and material agreements; however there is no formal procedure or evidence of normal backup of the Companys data or off-site storage of the data in the event of theft, misplacement, or loss due to unmitigated factors.\n3. We currently lack sufficient accounting personnel with the appropriate level of knowledge, experience and training in U.S. GAAP and SEC reporting requirements. We have one employee assigned to a position that involves processing financial information, resulting in a lack of segregation of duties so that all journal entries and account reconciliations are reviewed by someone other than the preparer, heightening the risk of error or fraud.\nThese material weaknesses have not been remediated as of the date of dismissal of Paris Kreit.\nOn April 5, 2022, the Companys Board of Directors approved the engagement of KCCW Accountancy Corp. (KCCW), as the Companys independent registered public accounting firm, effective as of April 5, 2022. The Board of Directors also approved KCCW to act as the Companys independent registered public accounting firm for the fiscal year ending September 30, 2022.\nDuring the Companys two fiscal years ended September 30, 2021 and through April 4, 2022, neither the Company nor anyone on its behalf consulted KCCW regarding (i) the application of accounting principles to a specified transaction, either completed or proposed, or the type of audit opinion that might be rendered on the consolidated financial statements of the Company; or (ii) any matter that was either the subject of a disagreement or a reportable event as described above; and there was neither a written report nor was oral advice provided to the Company by KCCW that was an important factor considered by the Company in reaching a decision as to an accounting, auditing or financial reporting issue.\n(B) On January 6, 2022, the Board of Directors of the Company approved the dismissal of Prager Metis CPAs, LLP (\"Prager Metis\") as the Companys independent registered public accounting firm, effective immediately.\nPrager Metiss audit reports on the Companys consolidated financial statements as of and for the fiscal years ended September 30, 2020 and 2019 did not contain an adverse opinion or a disclaimer of opinion and were not qualified or modified as to uncertainty, audit scope or accounting principles, except that the audit reports on the consolidated financial statements of the Company for the fiscal years ended September 30, 2020 and 2019 contained an uncertainty about the Companys ability to continue as a going concern.\nDuring the two fiscal years ended September 30, 2020 and 2019, and in the subsequent interim period through January 5, 2022, there were (i) no disagreements between the Company and Prager Metis on any matter of accounting principles or practices, financial statement disclosure or auditing scope or procedure, which disagreements, if not resolved to the satisfaction of Prager Metis, would have caused Prager Metis to make reference to the subject matter of the disagreement in their reports on the financial statements for such years, and (ii) no reportable events as that term is defined in Item 304(a)(1)(v) of Regulation S-K, except as noted in the following paragraph:\nDuring the two fiscal years ended September 30, 2020 and 2019, and through the interim period ended January 5, 2022, there were the following reportable events (as such term is defined in Item 304 of Regulation S-K). As disclosed in Part I, Item 4 of the Companys Form 10-Q for the quarter ended June 30, 2021, the Companys management determined that the Companys internal controls over financial reporting were not effective as of the end of such period due to the existence of material weaknesses related to the following:\n1. We do not have an Audit Committee. While we are not legally obligated to have an audit committee, it is the managements view that such a committee, including a financial expert member, is of the utmost importance for entity-level control over the Companys financial statements. Currently, the Board of Directors acts in the capacity of an audit committee.\n2. We did not implement appropriate information technology controls. As of June 30, 2021, the Company was retaining copies of all financial data and material agreements; however there is no formal procedure or evidence of normal backup of the Companys data or off-site storage of the data in the event of theft, misplacement, or loss due to unmitigated factors.\n3. We currently lack sufficient accounting personnel with the appropriate level of knowledge, experience and training in U.S. GAAP and SEC reporting requirements. We have one employee assigned to a position that involves processing financial information, resulting in a lack of segregation of duties so that all journal entries and account reconciliations are reviewed by someone other than the preparer, heightening the risk of error or fraud.\nThese material weaknesses have not been remediated as of the date of dismissal of Prager Metis.\nOn January 6, 2022, the Companys Board of Directors approved the engagement of Paris, Kreit & Chiu CPA LLP (Paris Kreit), as the Companys independent registered public accounting firm, effective as of January 6, 2022. The Board of Directors also approved Paris Kreit to act as the Companys independent registered public accounting firm for the fiscal year ending September 30, 2021.\nDuring the Companys two fiscal years ended September 30, 2021 and through January 5, 2022, neither the Company nor anyone on its behalf consulted Paris Kreit regarding (i) the application of accounting principles to a specified transaction, either completed or proposed, or the type of audit opinion that might be rendered on the consolidated financial statements of the Company; or (ii) any matter that was either the subject of a disagreement or a reportable event as described above; and there was neither a written report nor was oral advice provided to the Company by Paris Kreit that was an important factor considered by the Company in reaching a decision as to an accounting, auditing or financial reporting issue. ITEM 9A - CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls\nIn connection with the preparation of this annual report, an evaluation was carried out by the Companys management, with the participation of the principal executive officer and the principal financial officer, of the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act (Exchange Act) as of the fiscal year ended September 30, 2023. This evaluation was conducted with the participation of our chief executive officer (CEO) and chief financial officer (CFO).\nDisclosure controls are controls and other procedures that are designed to ensure that information that we are required to be disclosed in the reports we file pursuant to the Securities Exchange Act of 1934 is recorded, processed, summarized and reported.\nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our Exchange Act reports is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms, and that such information is accumulated and communicated to management, including the CEO and CFO, as appropriate, to allow timely decisions regarding required disclosure. Management necessarily applies its judgment in assessing the costs and benefits of such controls and procedures, which, by their nature, can provide only reasonable assurance regarding managements control objectives.\nWith the participation of management, our CEO and CFO evaluated the effectiveness of the design and operation of our disclosure controls and procedures at the conclusion of the period ended September 30, 2023. Based upon this evaluation, the CEO and CFO concluded that our disclosure controls and procedures were ineffective in ensuring that material information required to be disclosed is included in the reports that we file with the SEC.\nManagements Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (ICFR) for the Company. ICFR is a process to provide reasonable assurance regarding the reliability of our financial reporting for external purposes in accordance with accounting principles generally accepted in the U.S. ICFR includes maintaining records that in reasonable detail accurately and fairly reflect our transactions; providing reasonable assurance that transactions are recorded as necessary for preparation of our financial statements; providing reasonable assurance that receipts and expenditures of Company assets are made in accordance with management authorization; and providing reasonable assurance that unauthorized acquisition, use or disposition of Company assets that could have a material effect on our financial statements would be prevented or detected on a timely basis. Because of the inherent limitations of ICFR, misstatements may not be prevented or detected on a timely basis. Also, projections of any evaluation of the effectiveness of the ICFR to future periods are subject to the risk that the controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement, with the participation of the CEO and CFO, assessed the effectiveness of our ICFR as of September 30, 2023. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework. Based on this assessment, management, with the participation of the CEO and CFO, believes that, as of September 30, 2023, our ICFR reporting is not effective based on those criteria. If we are unable to remediate the material weakness, or other control deficiencies are identified, we may not be able to report our financial results accurately, prevent fraud or file our periodic reports as a public company in a timely manner.\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. In its assessment of the effectiveness of ICFR as of September 30, 2023, the Company determined that there were control deficiencies that constituted material weaknesses, as described below.\n1. We do not have an Audit Committee. While we are not legally obligated to have an audit committee, it is the managements view that such a committee, including a financial expert member, is of the utmost importance for entity-level control over the Companys financial statements. Currently, the BOD acts in the capacity of an audit committee.\n2. We did not implement appropriate information technology controls. As of September 30, 2023, the Company was retaining copies of all financial data and material agreements; however there is no formal procedure or evidence of normal backup of the Companys data or off-site storage of the data in the event of theft, misplacement, or loss due to unmitigated factors.\n3. We currently lack sufficient accounting personnel with the appropriate level of knowledge, experience and training in U.S. GAAP and SEC reporting requirements.\nAs a result of the material weaknesses described above, management concluded the Company did not maintain effective ICFR as of September 30, 2023 based on criteria established in Internal Control-Integrated Framework issued by COSO (2013 framework).\nWe have taken certain actions to remediate the material weakness related to our lack of U.S. GAAP experience. We engaged an outside CPA with U.S. GAAP knowledge and experience to supplement our current internal accounting personnel and assist us in the preparation of our financial statements to ensure that our financial statements are prepared in accordance with U.S. GAAP. The Companys operations are relatively uncomplicated; the Company had limited sales and expenses. The Company maintains adequate policies and procedures for ensuring that receipts and expenditures of Company assets are made in accordance with management authorization; and any investing and financing activities are made with both management and Board authorization, and any unauthorized expenses or usage of the Companys assets that could have a material effect on our financial statements would be prevented or detected on a timely basis. The Company also keeps accounting records for each of the Companys transactions including expenses, assets purchase, prepayments, notes receivable and payable that in reasonable detail accurately and fairly reflect the transaction; and for providing reasonable assurance that transactions are recorded as necessary for preparation of our financial statements.\nWe have limited capital resources and have given priority in the use of those resources to the development of our business. As our operations grow and become more complex, we intend to hire additional personnel in financial reporting and other areas. However, there can be no assurance of when, if ever, we will be able to remediate the identified material weaknesses.\nChanges in Internal Control over Financial Reporting\nOther than discussed above, there has been no changes in the Companys internal control over financial reporting that occurred during the period covered by this Annual Report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nThis Annual Report does not include an attestation report of the Companys registered public accounting firm regarding ICFR. As a smaller reporting company, the managements report is not subject to attestation by the Companys registered public accounting firm. ITEM 9B - OTHER INFORMATION\nThere were no trading arrangements for the purchase or sale of our securities entered into, modified or terminated by our directors or officers during the period covered by this report.\nITEM 9C - DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable\nPART III ITEM 10 - DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe following table sets forth as of December 26, 2023 the names, positions and ages of our current executive officers and directors. Our directors serve until the next meeting of shareholders or until their successors are elected and qualified. Our officers are elected by the Board and their terms of office are, except to the extent governed by an employment contract, at the discretion of the Board.\nName of Current Director and/or Executive Officer\nAge\nPosition(s)\nUmesh Patel (1)\nDirector, Chief Executive Officer and Chief Financial Officer\nMan Shek (Alex) Ng (2)\nDirector\n(1)\nMr. Patel has served as a director and the Companys CEO since February 15, 2017 and Chief Financial Officer since November 28, 2022.\n(2)\nMr. Ng has served as a director and the Companys CFO since November 28, 2022.\nUmesh Patel\nMr. Patel has served as a director and a member of audit committee, compensation committee and nominating and corporate governance committee of the Board of Nova Lifestyle, Inc. (NASDAQ: NVFY), a distributor of contemporary styled residential and commercial furniture, since October 2016. Mr. Patel became the Chairman of the audit committee of Nova Lifestyle, Inc. since July 2020. Mr. Patel has also served as a managing partner of DviBri LLC, a California-based consulting company providing services to private companies interested in conducting initial public offerings, along with other associated securities and investment services, since December 2009. Mr. Patel has been a consultant and coordinator for Eos-Petro Inc., an international and domestic petroleum exploration and production company based in Southern California from March 2013 to December 2019. Mr. Patel received his Bachelor of Commerce degree specializing in audits and accounts, and an Associate degree in hotel management and catering from Maharaja Sayaji Rao University in Baroda, India in 1978. The Board believes Mr. Patel is well qualified to serve as a member of the Board and as the Companys CEO and CFO due to his extensive business, regulatory and investment experience.\nMan Shek (Alex) Ng\nMr. Ng served as an executive director and corporate secretary of Antelope Enterprise Holdings Limited (Nasdaq: AEHL, formerly known as China Ceramics Co., Ltd.) from October 2017 to October 2022 and its operations manager from July 2017 to October 2017. Mr. Ng was the corporate secretary of Nova Lifestyle Inc. (NASDAQ: NVFY) from June 2011 to October 2016. Mr. Ng received his Bachelors degree in Economics from York University in Toronto, Ontario, Canada in 1994 and received a Certificate in Securities Course in 1998, a Certificate in Technical Analysis Course in 2001 and a Certificate in Derivatives Course in 2002 from The Canadian Securities Institute. The Board believes Mr. Ng is well qualified to serve as a member of the Board due to his extensive business, operation and public company experience.\nGiven the Companys limited operations, it has not adopted a code of ethics applicable to its principal executive officer and principal financial officer. Our Board will revisit this issue in the future to determine if, and when, adoption of a code of ethics is appropriate. In the meantime, our management intends to promote honest and ethical conduct, full and fair disclosure in our reports to the SEC, and comply with applicable governmental laws and regulations.\nSection 16(a) Beneficial Ownership Reporting Compliance\nThe Companys officers and directors are not subject to Section 16(a). ITEM 11 - EXECUTIVE COMPENSATION\nCompensation Discussion and Analysis\nWe currently have one executive officer: Mr. Umesh Patel who is our CEO and CFO. The executive, along with other individuals who served in those positions during the last fiscal year, comprise our Named Executive Officers (NEOs) for purposes of applicable SEC disclosure regulations.\nCompensation Objectives\nWe operate in a highly competitive and rapidly changing industry. The key objectives of our executive compensation programs are to:\n●\nattract, motivate and retain executives who drive our success and industry leadership; and provide each executive with a base salary on the market value of that role, and\n●\nthe individuals demonstrated ability to perform that role.\nEmployment Agreements\nWe currently dont have an employment agreement with Mr. Umesh Patel, our CEO and CFO.\nSummary Compensation of Named Executive Officers\nThe following table summarizes the compensation earned by, awarded to or paid to our named executive officers in the years ended September 30, 2023 and 2022:\nName and Principal\n\t\t\tPosition\nYear\n\t\t\tEnded\nSalary\n\t\t\t($)\nBonus\n\t\t\t($)\nStock Awards\nOption Awards\nNon-Equity Incentive Plan Compensation\n\t\t\t($)\nNon-Qualified Deferred Compensation Earnings\n\t\t\t($)\nAll Other Compensation\n\t\t\t($)\nTotal\n\t\t\t($)\nUmesh Patel (1)\n88,000\n-\n-\n-\n-\n-\n-\n88,000\n88,000\n-\n-\n-\n-\n-\n-\n88,000\nMichael Viotto (2)\n50,000\n-\n-\n-\n-\n-\n-\n50,000\n(1)\nMr. Patel was appointed as the CEO and a director on February 15, 2017 and as the CFO on November 28, 2022.\n(2)\nMr. Viotto was appointed as CFO and a director on August 16, 2017 and resigned on November 27, 2022.\nOutstanding Equity Awards at September 30, 2023\nThere were no outstanding stock options and stock awards held by our NEOs as of September 30, 2023.\nCompensation of Directors\nOur directors did not receive compensation for their service on the BOD for the fiscal years ended September 30, 2023 and 2022. ITEM 12 - SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED SHAREHOLDER MATTERS\nSecurity Ownership of Certain Beneficial Owners and Management\nThe following table provides information concerning beneficial ownership of our capital stock as of December 26, 2023 by:\n●\neach shareholder or group of affiliated shareholders who owns more than 5% of our outstanding capital stock;\n●\neach of our named executive officers;\n●\neach of our directors; and\n●\nall of our directors and executive officers as a group.\nThe following table lists the number of shares and percentage of shares beneficially owned based on 66,370,866 shares of our Common Stock outstanding as of December 26, 2023.\nBeneficial ownership is determined in accordance with the SEC rules, and generally includes voting power and/or investment power with respect to the securities held. Shares of Common Stock subject to options and warrants currently exercisable or exercisable within 60 days of December 26, 2023 or issuable upon conversion of convertible securities which are currently convertible or convertible within 60 days of December 26, 2023 are deemed outstanding and beneficially owned by the person holding those options, warrants or convertible securities for purposes of computing the number of shares and percentage of shares beneficially owned by that person, but are not deemed outstanding for purposes of computing the percentage beneficially owned by any other person. Except as indicated in the footnotes to this table, and subject to applicable community property laws, the persons or entities named have sole voting and investment power with respect to all shares of our Common Stock shown as beneficially owned by them.\nUnless otherwise indicated in the footnotes, the principal address of each of the shareholders below is c/o Fuse Group Holding Inc., 805 W. Duarte Rd., Suite 102, Arcadia, CA 91007.\nShares Beneficially Owned\nName of Beneficial Owner\nNumber\nPercent\nDirectors, Named Executive Officers and 5% Shareholders\nLandbond Home Limited (1)\n21,046,862\n31.7\n%\nE Zhao\n6,987,683\n10.5\n%\nChau-Ho Chen\n6,542,683\n9.8\n%\nCuixia Sun\n6,592,684\n9.9\n%\nUmesh Patel, CEO, CFO and director(2)\n3,162,511\n4.8\n%\nMan Shek (Alex) Ng, director\n-\n-\n%\nAll current directors and executive officers as a group (2 persons)\n3,162,511\n4.8\n%\n(1) Mr. Yong Zhang is the sole director and beneficial owner of the securities held of record by Landbond Home Limited.\n(2) Including 162,511 shares directly owned by Umesh Patel and 3,000,000 shares owned by Umesh Patel and Trupit Patel Family Trust. ITEM 13 - CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nRelated Transactions\nAs of September 30, 2023, the Company had advance of $35,973 from its CEO, for the Companys working capital needs. The advance from its CEO did not bear any interest, and payable upon demand. Other than that, we did not enter into any transactions with our directors, officers, persons who own more than five percent of our common stock and any other related parties, or with their relatives and entities they control.\nDirector Independence\nOur board of directors has determined that Mr. Man Shek (Alex) Ng is qualifies as independent as the term is defined by Nasdaq Rule as 5605(a)(2). ITEM 14 - PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table shows the fees that we paid or accrued for audit and other services for fiscal years ended September 30, 2023 and 2022. All of the services described in the following fee table were approved in conformity with the BODs pre-approval process.\nAudit Fees\n$ 57,000\n85,000\nTax Fees\n3,300\n-\nAll Other Fees\n6,000\n25,000\nTotal\n$ 66,300\n110,000\nAudit Fees\nThe amounts set forth opposite Audit Fees above reflect the aggregate fees billed or billable by KCCW, Paris, Kreit and Prager Metis.\nOn January 6, 2022, the Companys Board of Directors approved the engagement of Paris, Kreit & Chiu CPA LLP, as the Companys independent registered public accounting firm, effective as of January 6, 2022 and for the fiscal year ended September 30, 2021. Paris, Kreit provided professional services for the audit of our fiscal year 2021 and reviews of our first quarterly financial statement for our fiscal year 2022. $44,000 related to serviced provided by Paris, Kreit & Chiu CPA LLP was paid during the fiscal year ended September 30, 2022.\nOn April 5, 2022, the Companys Board of Directors approved the engagement of KCCW Accountancy Corp. (KCCW), as the Companys independent registered public accounting firm, effective as of April 5, 2022. The Board of Directors also approved KCCW to act as the Companys independent registered public accounting firm for the fiscal year ending September 30, 2022. KCCW provided professional services for the audit of our fiscal year 2022 financial statement and review of our quarterly financial statements and $8,000 was paid to KCCW during the fiscal year ended September 30, 2022. KCCW provided professional services for the audit of our fiscal year 2023 financial statement and review of our quarterly financial statements and $41,000 was paid to KCCW during the fiscal year ended September 30, 2023.\nAll Other Fees\nThe amounts set forth opposite All Other Fees above reflect the fees paid for the audit of E-Mo Biotech when the Company was planning to acquire E-Mo Biotech.\nOur policy is to pre-approve all audit and permissible non-audit services performed by the independent accountants. These services may include audit services, audit-related services, tax services and other services. Under our policy, pre-approval is generally provided for particular services or categories of services, including planned services, project based services and routine consultations. In addition, the BOD may also pre-approve particular services on a case-by-case basis. Our BOD approved all services that our independent accountants provided to us in the past two fiscal years.\nPART IV ITEM 15 - EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) (1) FINANCIAL STATEMENTS:\nThe following financial statements, including notes thereto and the independent auditors report with respect thereto, are filed as part of this Annual Report on Form 10-K, starting on page hereof.\n(b) EXHIBITS:\nExhibit Index\nExhibit Number\nDescription\n3.1\nArticles of Incorporation. Incorporated by reference to the Companys Registration Statement on Form S-1 filed with the SEC on March 24, 2015.\n3.2\nCertificate of Change, dated May 19, 2017. Incorporated by reference to the Companys Current Report on Form 8-K filed with the SEC on June 2, 2017.\n3.3\nCertificate of Change, date April 30, 2019. Incorporated by reference to the Companys Current Report on Form 8-K filed with SEC on May 1, 2019.\n3.4\nBylaws. Incorporated by reference to the Companys Registration Statement on Form S-1 filed with the SEC on March 24, 2015.\n3.5\nAmended and Restated Bylaws. Incorporated by reference to the Companys Current Report on Form 8-K filed with SEC on May 1, 2019.\n10.1\nConsulting and Strategist Agreement, by and between the Fuse Processing, Inc. and Brilliant Star Investment Inc., dated January 4, 2017. Incorporated by reference to the Companys Form 10-Q filed on May 11, 2017.\n10.2\nConsulting and Strategist Agreement, by and between the Company and Risun Intelligent Technology Co., Limited, dated August 1, 2018., incorporated by reference to the Companys Form 10-K filed on December 31, 2018.\n10.3\nShare Exchange Agreement by and among the Company, Fuse Processing, Inc., Choo Keam Hui, Goh Hau Guan, Lim Hui Sing, Teh Boon Nee and Tia Chai Teck dated on February 9, 2021, incorporated by reference to the Companys Current Report on Form 8-K filed on February 16, 2021, amended on September 28, 2021.\n10.4\nShare Exchange Agreement by and among the Company, Fuse Biotech, Inc. E-Mo Biotech Holding Inc., Qiyi Xie, Quan Qinghua, Jing Li and HWG Capital Sdn Bhd dated on March 11, 2021, incorporated by reference to the Companys Current Report on Form 8-K filed on March 17, 2021, amended on October 1, 2021.\n10.5\nEmployment Agreement by and between the Company and Mr. Michael Viotto, dated August 22, 2021, incorporated by reference to the Companys Current Report on Form 8-K filed on August 23, 2021.\n10.6\nTermination Agreement by and among the Company, Fuse Biotech, Inc. E-Mo Biotech Holding Inc., Qiyi Xie, Quan Qinghua, Jing Li and HWG Capital Sdn Bhd dated on September 30, 2021. incorporated by reference to the Companys Current Report on Form 8-K filed on October 1, 2021.\n10.7\nConvertible Promissory Notes Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated February 15, 2022, incorporated by reference to the Companys Current Report on Form 8-K filed on February 18, 2022.\n10.8\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated February 15, 2022, incorporated by reference to the Companys Current Report on Form 8-K filed on February 18, 2022.\n10.9\nConvertible Promissory Notes Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated March 23, 2022, incorporated by reference to the Companys Current Report on Form 8-K filed on March 24, 2022.\n10.10\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated March 23, 2022, incorporated by reference to the Companys Current Report on Form 8-K filed on March 24, 2022.\n10.11\nConvertible Promissory Notes Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated June 9, 2022, incorporated by reference to the Companys quarterly report on Form 10-Q filed on August 12, 2022.\n10.12\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated June 9, 2022, incorporated by reference to the Companys quarterly report on Form 10-Q filed on August 12, 2022.\n10.13\nConvertible Promissory Notes Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated July 1, 2022, incorporated by reference to the Companys quarterly report on Form 10-Q filed on August 12, 2022\n10.14\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated July 1, 2022, incorporated by reference to the Companys quarterly report on Form 10-Q filed on August 12, 2022.\n10.15\nEmployment Agreement, dated August 22, 2022, between Fuse Group Holding Inc. and Michael Viotto, incorporated by reference to the Companys Current Report on Form 8-K filed on August 23, 2022\n10.16\nConvertible Promissory Notes Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated August 19, 2022, incorporated by reference to the Companys Current Report on Form 8-K filed on August 24, 2022.\n10.17\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated August 19, 2022, incorporated by reference to the Companys Current Report on Form 8-K filed on August 24, 2022.\n10.18\nConvertible Promissory Note Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated October 6, 2022, incorporated by reference to the Companys Current Report on Form 8-K filed on November 14, 2022.\n10.19\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated October 6, 2022 incorporated by reference to the Companys Current Report on Form 8-K filed on November 14, 2022.\n10.20\nConvertible Promissory Note Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn Bhd, dated November 7, 2022, incorporated by reference to the Companys Current Report on Form 8-K filed on November 14, 2022.\n10.21\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated November 7, 2022, incorporated by reference to the Companys Current Report on Form 8-K filed on November 14, 2022.\n10.22\nConvertible Promissory Note Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn Bhd, dated December 16, 2022, incorporated by reference to the Companys Annual Report on Form 10-K filed on December 29, 2022.\n10.23\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated December 16, 2022 incorporated by reference to the Companys Annual Report on Form 10-K filed on December 29, 2022.\n10.24\nConvertible Promissory Notes Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated January 30, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on February 3, 2023.\n10.25\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated January 30, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on February 3, 2023.\n10.26\nConvertible Promissory Notes Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated February 24, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on April 13, 2023.\n10.27\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated February 24, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on April 13, 2023.\n10.28\nConvertible Promissory Notes Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated April 10, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on April 13, 2023.\n10.29\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated April 10, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on April 13, 2023.\n10.30\nConvertible Promissory Notes Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated May 29, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on May 30, 2023.\n10.31\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated May 29, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on May 30, 2023.\n10.32\nConvertible Promissory Notes Purchase Agreement by and between Fuse Group Holding, Inc. and Liu Marketing (M) Sdn. Bhd, dated June 29, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on July 6, 2023.\n10.33\nConvertible Promissory Note, issued by Fuse Group Holding, Inc. to Liu Marketing (M) Sdn. Bhd., dated June 29, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on July 6, 2023.\n10.34\nConsulting Agreement by and between Fuse Group Holding, Inc. and Beijing Jixiang Fengqi Tech Company Limited, dated December 13, 2023, incorporated by reference to the Companys Current Report on Form 8-K filed on December 15, 2023.\n21.1\nSubsidiaries of the Registrant*\n31.1\nRule 13a-14(a) Certification of Principal Executive Officer and Principal Financial Officer of Registrant*\n32.1\nSection 1350 Certification of Principal Executive Officer and Principal Financial Officer of Registrant. *\n101.INS\nInline XBRL Instance Document*\n101.SCH\nInline XBRL Taxonomy Extension Schema Document*\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document*\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document*\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document*\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document*\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*Filed herewith\nManagement agreement.\nPage\nFinancial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 2851)\nBalance Sheets\nStatements of Operations\nStatements of Changes in Shareholders Equity\nStatements of Cash Flows\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of Fuse Group Holding, Inc.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Fuse Group Holding, Inc. and its subsidiaries (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of operations, changes in shareholders equity (deficit), and cash flows for the years then ended and the related notes (collectively referred to as consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for the years ended September 30, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the consolidated financial statements, as of September 30, 2023 and 2022, the Company had recurring losses from operations, an accumulated deficit, and a negative cash flows from operating activities. As such there is substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/KCCW Accountancy Corp.\nWe have served as the Companys auditor since 2022.\nDiamond Bar, California\nDecember 26, 2023\nFUSE GROUP HOLDING INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nSEPTEMBER 30, 2023\nSEPTEMBER 30, 2022\nASSETS\nCURRENT ASSETS\nCash and equivalents\n$ 26,588\n$ 32,996\nPrepaid expenses\n12,668\n12,018\nTotal current assets\n39,256\n45,014\nNON-CURRENT ASSETS\nProperty and equipment, net\n2,276\nRight-of-use asset, net\n32,494\n58,835\nTotal non-current assets\n32,949\n61,111\nTOTAL ASSETS\n$ 72,205\n$ 106,125\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCURRENT LIABILITIES\nOther payables\n$ 25,715\n$ 4,670\nAccrued interest on convertible notes\n4,466\nLease liability\n29,128\n26,207\nLoan payable\n1,936\n2,230\nDue to related party\n35,973\n-\nTotal current liabilities\n93,134\n37,573\nNON-CURRENT LIABILITIES\nConvertible notes\n50,000\n350,000\nLease liability\n5,038\n34,167\nLoan payable\n101,790\n104,107\nTotal non-current liabilities\n156,828\n488,274\nTOTAL LIABILITIES\n249,962\n525,847\nCONTINGENCIES AND COMMITMENTS\nSTOCKHOLDERS DEFICIT\nCommon stock, par value $0.001 per share, 375,000,000 shares authorized; 66,370,866 and 64,778,050 shares issued and outstanding at September 30, 2023 and 2022, respectively\n66,371\n64,778\nAdditional paid-in capital\n7,664,891\n6,949,717\nAccumulated deficit\n(7,909,019 )\n(7,434,217 )\nTotal stockholders deficit\n(177,757 )\n(419,722 )\nTOTAL LIABILITIES AND STOCKHOLDERS DEFICIT\n$ 72,205\n$ 106,125\nThe accompanying notes are an integral part of these consolidated financial statements.\nFUSE GROUP HOLDING INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFOR THE YEARS ENDED\nSEPTEMBER 30,\nRevenue\n$ -\n$ 200,000\nCost of revenue\n-\n10,015\nGross profit\n-\n189,985\nOperating expenses\nGeneral and administrative\n393,119\n551,236\nConsulting\n62,000\n72,403\nTotal operating expenses\n455,119\n623,639\nLoss from operations\n(455,119 )\n(433,654 )\nNon-operating income (expenses)\nInterest expense\n(17,283 )\n(8,498 )\nOther income\n-\nTotal non-operating income (expenses), net\n(17,283 )\n(8,438 )\nLoss before income tax\n(472,402 )\n(442,092 )\nIncome tax\n2,400\n2,400\nNet loss\n$ (474,802 )\n$ (444,492 )\nBasic weighted average shares outstanding\n65,153,344\n64,778,050\nBasic loss per share\n$ (0.01 )\n$ (0.01 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nFUSE GROUP HOLDING INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS EQUITY (DEFICIT)\nCommon Stock\nAdditional\nAccumulated\nShares\nAmount\nPaid-in Capital\nDeficit\nTotal\nBalance at September 30, 2021\n64,778,050\n$ 64,778\n$ 6,949,717\n$ (6,989,725 )\n$ 24,770\nNet loss\n-\n-\n-\n(444,492 )\n(444,492 )\nBalance at September 30, 2022\n64,778,050\n64,778\n6,949,717\n(7,434,217 )\n(419,722 )\nNet loss\n-\n-\n-\n(474,802 )\n(474,802 )\nShares issued for notes conversion\n1,592,816\n1,593\n715,174\n-\n716,767\nBalance at September 30, 2023\n66,370,866\n$ 66,371\n$ 7,664,891\n$ (7,909,019 )\n$ (177,757 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nFUSE GROUP HOLDING INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFOR THE YEARS ENDED\nSEPTEMBER 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss\n$ (474,802 )\n$ (444,492 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation\n1,821\n1,914\nOperating lease expense\n28,772\n26,455\nChanges in assets and liabilities:\nPrepaid expenses\n(650 )\n10,864\nOther payables\n21,045\n(22,126 )\nAccrued interest\n12,683\n4,466\nPayment of lease liability\n(28,639 )\n(26,925 )\nNet cash used in operating activities\n(439,770 )\n(449,844 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from convertible notes\n400,000\n350,000\nRepayment of loan payable\n(2,611 )\n(2,663 )\nDue to related party\n35,973\n-\nNet cash provided by financing activities\n433,362\n347,337\nNET DECREASE IN CASH AND EQUIVALENTS\n(6,408 )\n(102,507 )\nCASH AND EQUIVALENTS, BEGINNING OF PERIOD\n32,996\n135,503\nCASH AND EQUIVALENTS, END OF PERIOD\n$ 26,588\n$ 32,996\nSupplemental cash flow data:\nIncome tax paid\n$ 2,400\n$ 2,400\nInterest paid\n$ 4,600\n$ 4,032\nSupplemental disclosures of non-cash operating activities:\nRight-of-use assets obtained in exchange for new operating lease liabilities\n$ -\n$ 80,180\nConversion of notes payable and accrued interest\n$ 716,767\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nFUSE GROUP HOLDING INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 - Organization and Operations\nFuse Group Holding Inc. (the Company or Fuse Group or We) was incorporated under the laws of the State of Nevada on December 24, 2013. Fuse Group currently develops business opportunities in the mining and biotech areas. On December 6, 2016, the Company incorporated Fuse Processing, Inc. (Processing) in the State of California. Processing seeks business opportunities in mining and is currently investigating potential mining targets in Asia and North America. Fuse Group is the sole shareholder of Processing.\nFuse Group and Processing provide consulting services to mining industry clients to find mine acquisition targets within the parameters set by the clients, when the mine owner is considering selling its mining rights. The services of Fuse Group and Processing include due diligence on the potential mine seller and mine, such as ownership and whether the mine meets all operational requirements and/or is currently in operation.\nIn March 2017, Processing acquired 100% ownership of Fuse Trading Limited (Trading) for HKD1 ($0.13). Trading had no operations prior to the acquisition by Processing. Trading was seeking mining-related business opportunities in Asia. On April 22, 2022, Processing entered into a Share Transfer Agreement to transfer 100% ownership of Trading to an unrelated party for HKD1. There was no gain or loss recognized from the ownership transfer of Trading. Trading did not have any assets or business operations as of the date of transfer.\nOn May 3, 2018, the Company incorporated Fuse Technology Inc. in the State of Nevada, which changed its name to Fuse Biotech Inc. on November 30, 2020. Fuse Group is the sole shareholder of Fuse Biotech Inc. (Fuse Biotech). Fuse Biotech seeks business opportunities in the biotech area.\nOn April 29, 2019, the Board of Directors of the Company approved an amendment to the Companys Articles of Incorporation (Amendment) to change its name from Fuse Enterprises Inc. to Fuse Group Holding Inc. Also on April 29, 2019, stockholders holding a majority of the Companys outstanding capital stock approved the Amendment. The Amendment was filed with the Secretary of State for the State of Nevada on April 30, 2019 and became effective May 13, 2019. On May 29, 2019, the Company changed its trading symbol on OTC Markets from FNST to FUST.\nOn February 9, 2021, Fuse Group and Processing entered into a Share Exchange Agreement (the Agreement) with five individuals who own Portafolio en Investigacion Ambiental S.A. de C.V., a Mexican company (Portafolio). Pursuant to the Agreement, the Company agreed to issue 14,285,715 shares of Companys common stock for all the shares of Portafolio they owned. Portafolio owns concessions rights to five mineral locations in Mexico. The five mines have not been explored and have no operations, no facilities or equipment, no existing contracts for the sale of output, and no permits or licenses to conduct mining operations other than five concessions to explore. There is no assurance that we will be able to obtain the surface rights and permits that are necessary to extract the minerals from the areas covered by the concessions. The transfer of shares of Portafolio to Processing are subject to Mexican government approval, which has not happened yet.\nStock certificates for 14,285,715 shares were prepared for the closing of the Agreement which was entered into by the Company and Processing with the five individuals who own Portafolio on February 9, 2021. The stock certificates were prepared by the Company, but not delivered to the sellers. After reevaluation of the Agreement, the Company determined that the transaction was incorrectly recorded, as such stock certificates remained in the custody of the Company and not delivered (i.e. provided as consideration) to the sellers. On October 20, 2021, the Company cancelled these stock certificates.\nOn March 11, 2021, Fuse Group and Fuse Biotech entered into a Share Exchange Agreement with E-Mo Biotech Holding Inc., a company incorporated under the laws of Nevada (the E-Mo Biotech), Qiyi Xie, a resident of California (Xie), Quan Qinghua, a citizen and resident of China (Quan), Jing Li, a citizen and resident of China (Li) and HWG Capital Sdn Bhd, a company incorporated under laws of Malaysia (HWG and hereinafter collectively with Xie, Quan and Li, the Sellers). Pursuant to the agreement, the Company agreed to issue the Sellers 100,000,000 shares of Companys common stock (the Fuse Shares) for all the issued and outstanding shares of E-Mo Biotech (the E-Mo Shares) owned by the Sellers. E-Mo Biotech Holding Inc. is a start-up, development-stage company involving in vaccine, immunological treatment and diagnostic product research and development and has no commercial sales of vaccines, treatments, or diagnostic products. The acquisition was not completed and the Fuse Shares were not issued. On September 30, 2021, the Company and Fuse Biotech entered into a Termination Agreement with E-Mo Biotech, Qiyi Xie, Quan Qinghua, Jing Li and HWG Capital Sdn Bhd, effective on September 30, 2021. Pursuant to the Termination Agreement, the parties agreed to terminate the Share Exchange Agreement, which was originally entered into by and among the Company, Fuse Biotech, the Sellers and E-Mo Biotech on March 11, 2021.\nNote 2 - Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying consolidated financial statements were prepared in conformity with accounting principles generally accepted in the United States of America (US GAAP), and pursuant to the rules and regulations of the Securities and Exchange Commission (SEC).\nPrinciple of Consolidation\nThe consolidated financial statements include the accounts of Fuse Group and its subsidiaries, Processing, Trading, and Biotech. All significant inter-company accounts and transactions and balances were eliminated in consolidation.\nReclassification\nCertain prior periods accounts have been reclassified in conformity with current periods presentation. These reclassifications had no effect on the reported results of operations.\nCash\nThe Company considers all highly liquid instruments with an original maturity of three months or less to be considered cash equivalents. The carrying value of these investments approximates fair value. The Company had $26,588 and $32,996 in cash at September 30, 2023 and 2022, respectively.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates. The significant areas requiring the use of management estimates include, but are not limited to, the estimated useful life and residual value of property, plant and equipment, recognition and measurement of deferred income taxes and the valuation allowance for deferred tax assets. Although these estimates are based on managements knowledge of current events and actions management may undertake in the future, actual results may ultimately differ from those estimates and such differences may be material to the consolidated financial statements.\nFair Value Measurements and Disclosures\nThe carrying amounts of certain of the Companys financial instruments, including cash and equivalents, accrued liabilities and accounts payable, approximate their fair value due to their short maturities. FASB ASC Topic 825, Financial Instruments, requires disclosure of the fair value of financial instruments held by the Company. The carrying amounts reported in the balance sheets for current liabilities qualify as financial instruments and are a reasonable estimate of their fair value because of the short period of time between the origination of such instruments and their expected realization and the current market rate of interest.\nFASB ASC Topic 820, Fair Value Measurements, defines fair value, and establishes a three-level valuation hierarchy for disclosures that enhances disclosure requirements for fair value measures. The three levels are defined as follows:\n●\nLevel 1 inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets.\n●\nLevel 2 inputs to the valuation methodology include other than those in level 1 quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.\n●\nLevel 3 inputs to the valuation methodology are unobservable and significant to the fair value measurement.\nFinancial assets are considered Level 3 when their fair values are determined using pricing models, discounted cash flow methodologies or similar techniques and at least one significant model assumption or input is unobservable.\nThe fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. If the inputs used to measure the financial assets and liabilities fall within more than one level described above, the categorization is based on the lowest level input that is significant to the fair value measurement of the instrument.\nThe carrying amount of the Companys financial assets and liabilities, such as cash, prepaid expenses and other payables, approximate their fair value because of the short maturity of those instruments.\nTransactions involving related parties cannot be presumed to be carried out on an arms-length basis, as the requisite conditions of competitive, free-market dealings may not exist. Representations about transactions with related parties, if made, shall not imply that the related party transactions were consummated on terms equivalent to those that prevail in arms-length transactions unless such representations can be substantiated.\nAs of September 30, 2023 and 2022, the Company did not identify any assets and liabilities that are required to be presented on the balance sheet at fair value on a recurring basis.\nAccounts Receivable\nThe Company maintains reserves for potential credit losses on accounts receivable. Management reviews the composition of accounts receivable and analyzes historical bad debts, customer concentrations, customer credit worthiness, current economic trends and changes in customer payment patterns to evaluate the adequacy of these reserves. The Company had $0 accounts receivable at September 30, 2023 and 2022.\nProperty and Equipment\nProperty and equipment are stated at cost, net of accumulated depreciation and impairment losses, if any. Expenditures for maintenance and repairs are expensed as incurred; while additions, renewals and improvements are capitalized. When property and equipment are retired or otherwise disposed of, the related cost and accumulated depreciation is removed from the respective accounts, and any gain or loss is included in operations. Depreciation of property and equipment is provided using the straight-line method for substantially all assets and estimated lives as follows:\nComputer and office equipment\n5 years\nOffice furniture\n7 years\nLeasehold decoration and renovation\n10 years\nRelated Parties\nThe Company follows subtopic 850-10 of the FASB ASC for the identification of related parties and disclosure of related party transactions. Pursuant to Section 850-10-20, related parties include: (a) affiliates of the Company; (b) entities for which investments in their equity securities would be required, absent the election of the fair value option under the Fair Value Option Subsection of Section 825-10-15, to be accounted for by the equity method by the investing entity; (c) trusts for the benefit of employees, such as pension and profit-sharing trusts that are managed by or under the trusteeship of management; (d) principal owners of the Company; (e) management of the Company; (f) other parties with which the Company may deal if one party controls or can significantly influence the management or operating policies of the other to an extent that one of the transacting parties might be prevented from fully pursuing its own separate interests; and (g) other parties that can significantly influence the management or operating policies of the transacting parties or that have an ownership interest in one of the transacting parties and can significantly influence the other to an extent that one or more of the transacting parties might be prevented from fully pursuing its own separate interests.\nThe financial statements shall include disclosures of material related party transactions, other than compensation arrangements, expense allowances, and other similar items in the ordinary course of business. However, disclosure of transactions eliminated in the preparation of financial statements is not required in those statements.\nThe disclosures shall include: (a) the nature of the relationship(s) involved; (b) a description of the transactions, including transactions to which no amounts or nominal amounts were ascribed, for each of the periods for which income statements are presented, and such other information deemed necessary to an understanding of the effects of the transactions on the financial statements; (c) the dollar amounts of transactions for each of the periods for which income statements are presented and the effects of any change in the method of establishing the terms from that used in the preceding period; and (d) amounts due from or to related parties as of the date of each balance sheet presented and, if not otherwise apparent, the terms and manner of settlement.\nContingencies\nThe Company follows FASB ASC 450-20 to account for contingencies. Certain conditions may exist as of the date the financial statements are issued, which may result in a loss to the Company, but which will only be resolved when one or more future events occur or fail to occur. The Company assesses such contingent liabilities, and such assessment inherently involves an exercise of judgment.\nIn assessing loss contingencies related to legal proceedings pending against the Company or unasserted claims that may result in such proceedings, the Company evaluates the perceived merits of any legal proceedings or unasserted claims as well as the perceived merits of the amount of relief sought or expected to be sought therein.\nIf the assessment of a contingency indicates it is probable that a material loss was incurred and the amount of the liability can be reasonably estimated, then the estimated liability would be accrued in the Companys financial statements. If the assessment indicates that a potential material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed.\nLoss contingencies considered remote are generally not disclosed unless they involve guarantees, in which case the guarantees would be disclosed. Management does not believe, based upon information available at this time, that these matters will have a material adverse effect on the Companys financial position, results of operations or cash flows. However, there is no assurance that such matters will not materially and adversely affect the Companys business, financial position, and results of operations or cash flows.\nRevenue Recognition\nThe Company follows FASB Accounting Standards Update (ASC 606), Revenue from Contracts with Customers.\nThe core principle underlying FASB ASC 606 is that the Company recognizes revenue to represent the transfer of goods and services to customers in an amount that reflects the consideration to which the Company expects to be entitled in such exchange. This requires the Company to identify contractual performance obligations and determine whether revenue should be recognized at a point in time or over time, based on when control of goods and services transfers to a customer. The Companys revenue streams are recognized when control of goods and services transfers to a customer, in an amount that reflects the consideration it expects to receive for those goods.\nThe Company recognizes revenues following the five step model prescribed under ASC 606: (i) identify contract(s) with a customer; (ii) identify the performance obligations in the contract; (iii) determine the transaction price; (iv) allocate the transaction price to the performance obligations in the contract; and (v) recognize revenues when (or as) we satisfy the performance obligation. For the Companys mine information service, revenue is recognized when the mine information is forwarded to the client. The services of Fuse Group and Processing include due diligence on the potential mine seller and the mine, such as ownership of the mine and whether the mine meets all operation requirements and/or is currently in operation.\nIncome Tax\nThe Company uses the asset and liability method of accounting for income taxes in accordance with FASB ASC Topic 740, Income Taxes. Under this method, income tax expense is recognized for the amount of: (i) taxes payable or refundable for the current period and (ii) deferred tax consequences of temporary differences resulting from matters that have been recognized in an entitys financial statements or tax returns. Deferred tax assets also include the prior years net operating losses carried forward. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the results of operations in the period that includes the enactment date. A valuation allowance is provided to reduce the deferred tax assets reported if based on the weight of the available positive and negative evidence, it is more likely than not some portion or all of the deferred tax assets will not be realized.\nThe Company follows FASB ASC Topic 740, which prescribes a more-likely-than-not threshold for financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. FASB ASC Topic 740 also provides guidance on recognition of income tax assets and liabilities, classification of current and deferred income tax assets and liabilities, accounting for interest and penalties associated with tax positions, accounting for income taxes in interim periods, and income tax disclosures.\nUnder FASB ASC Topic 740, when tax returns are filed, it is likely that some positions taken would be sustained upon examination by the taxing authorities, while others are subject to uncertainty about the merits of the position taken or the amount of the position that would be ultimately sustained. The benefit of a tax position is recognized in the financial statements in the period during which, based on all available evidence, management believes it is more likely than not that the position will be sustained upon examination, including the resolution of appeals or litigation processes, if any. Tax positions taken are not offset or aggregated with other positions. Tax positions that meet the more-likely-than-not recognition threshold are measured as the largest amount of tax benefit that is more than 50 percent likely of being realized upon settlement with the applicable taxing authority. The portion of the benefits associated with tax positions taken that exceeds the amount measured as described above is reflected as a liability for unrecognized tax benefits in the accompanying balance sheets along with any associated interest and penalties that would be payable to the taxing authorities upon examination. Interest associated with unrecognized tax benefits is classified as interest expense and penalties are classified in selling, general and administrative expenses in the statement of operations. As of September 30, 2023, the Company had no unrecognized tax benefits and there were no charges during the year ended September 30, 2023, and accordingly, the Company did not recognize any interest or penalties related to unrecognized tax benefits. There was no accrual for uncertain tax position as of September 30, 2023. The Company files a U.S. income tax return. With few exceptions, the U.S. income tax returns filed for the years ending on September 30, 2020 and thereafter are subject to examination by the relevant taxing authorities.\nEarnings (Loss) per Share\nBasic EPS is computed by dividing net income by the weighted average number of common shares outstanding for the period. Diluted EPS is computed similar to basic EPS except that the denominator is increased to include the number of additional common shares that would have been outstanding if all the potential common shares, warrants and stock options had been issued and if the additional common shares were dilutive. Diluted EPS is based on the assumption that all dilutive convertible shares and stock options and warrants were converted or exercised. Dilution is computed by applying the treasury stock method for the outstanding options and warrants, and the if-converted method for the outstanding convertible instruments. Under the treasury stock method, options and warrants are assumed to be exercised at the beginning of the period (or at the time of issuance, if later) and as if funds obtained thereby were used to purchase common stock at the average market price during the period. Under the if-converted method, outstanding convertible instruments are assumed to be converted into common stock at the beginning of the period (or at the time of issuance, if later).\nCash Flows Reporting\nThe Company follows paragraph 230-10-45-24 of FASB ASC for cash flows reporting, classifies cash receipts and payments according to whether they stem from operating, investing, or financing activities and provides definitions of each category, and uses the indirect or reconciliation method (Indirect Method) as defined by paragraph 230-10-45-25 of FASB ASC to report net cash flow from operating activities by adjusting net income to reconcile it to net cash flow from operating activities by removing the effects of (a) all deferrals of past operating cash receipts and payments and all accruals of expected future operating cash receipts and payments and (b) all items that are included in net income that do not affect operating cash receipts and payments. The Company reports the reporting currency equivalent of foreign currency cash flows, using the current exchange rate at the time of the cash flows and the effect of exchange rate changes on cash held in foreign currencies is reported as a separate item in the reconciliation of beginning and ending balances of cash and cash equivalents and separately provides information about investing and financing activities not resulting in cash receipts or payments in the period pursuant to paragraph 830-230-45-1 of FASB ASC.\nLeases\nThe Company determines if an arrangement contains a lease at the inception of a contract under ASC Topic 842. At the commencement of each lease, management determines its classification as an operating or finance lease. For leases that qualify as operating leases, Right of Use (ROU) assets and liabilities are recognized at commencement date based on the present value of remaining lease payments over the lease term. For this purpose, the Company considers only payments that are fixed and determinable at the time of commencement. As most of its leases do not provide an implicit rate, the Company uses its incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. The Companys incremental borrowing rate is a hypothetical rate based on its understanding of what its credit rating would be. The ROU assets include adjustments for prepayments and accrued lease payments. The ROU asset also includes any lease payments made prior to commencement and is recorded net of any lease incentives received. The Companys lease terms may include options to extend or terminate the lease when it is reasonably certain that it will exercise such options.\nThe Company leases premises for office under non-cancellable operating lease. Operating lease payments are expensed over the term of lease. The Companys current lease does not include options to extend nor any restrictions or covenants. Under the terms of the lease agreements, the Company has no legal or contractual asset retirement obligations at the end of the lease. Operating leases are included in operating lease ROU assets and operating lease liabilities (current and non-current), on the consolidated balance sheets.\nA short-term lease is defined as a lease that, at the commencement date, has a lease term of 12 months or less and does not include an option to purchase the underlying asset that the lessee is reasonably certain to exercise. When determining whether a lease qualifies as a short-term lease, the Company evaluates the lease term and the purchase option. Hence, the Company does not recognize any operating lease ROU assets and operating lease liabilities for short-term leases.\nROU assets are reviewed for impairment when indicators of impairment are present. ROU assets from operating and finance leases are subject to the impairment guidance in ASC 360, Property, Plant, and Equipment, as ROU assets are long-lived nonfinancial assets. ROU assets are tested for impairment individually or as part of an asset group if the cash flows related to the ROU asset are not independent from the cash flows of other assets and liabilities. An asset group is the unit of accounting for long-lived assets to be held and used, which represents the lowest level for which identifiable cash flows are largely independent of the cash flows of other groups of assets and liabilities. The Company recognized no impairment of ROU assets as of September 30, 2023 and 2022.\nRecently Issued Accounting Pronouncements\nIn June 2016, the FASB issued ASU No. 2016-13, Financial Instruments-Credit Losses (Topic 326), which requires entities to measure all expected credit losses for financial assets held at the reporting date based on historical experience, current conditions, and reasonable and supportable forecasts. This replaces the existing incurred loss model and is applicable to the measurement of credit losses on financial assets measured at amortized cost. This guidance is effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2022. Early application will be permitted for all entities for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2018. The Company is currently evaluating the impact that the standard will have on its consolidated financial statements.\nIn January 2017, the FASB issued ASU No. 2017-04, Simplifying the Test for Goodwill Impairment. The guidance removes Step 2 of the goodwill impairment test, which requires a hypothetical purchase price allocation. A goodwill impairment will now be the amount by which a reporting units carrying value exceeds its fair value, not to exceed the carrying amount of goodwill. The guidance should be adopted on a prospective basis. As a smaller reporting company, the standard will be effective for the Company for interim and annual reporting periods beginning after December 15, 2022, with early adoption permitted. The Company is currently evaluating the impact of adopting this standard on its consolidated financial statements.\nIn March 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848) (ASU 2020-04). ASU 2020-04 contains practical expedients for reference rate reform related activities that impact debt, leases, derivatives and other contracts. The guidance in ASU 2020-04 is optional and may be elected over time as reference rate reform activities occur. The Company continues to evaluate the impact of the guidance and may apply the elections as applicable as changes in the market occur.\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470- 20) and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40): Accounting for Convertible Instruments and Contracts in an Entitys Own Equity (ASU 2020-06), which simplifies the accounting for certain financial instruments with characteristics of liabilities and equity. This ASU (1) simplifies the accounting for convertible debt instruments and convertible preferred stock by removing the existing guidance in ASC 470-20, Debt: Debt with Conversion and Other Options, that requires entities to account for beneficial conversion features and cash conversion features in equity, separately from the host convertible debt or preferred stock; (2) revises the scope exception from derivative accounting in ASC 815-40 for freestanding financial instruments and embedded features that are both indexed to the issuers own stock and classified in stockholders equity, by removing certain criteria required for equity classification; and (3) revises the guidance in ASC 260, Earnings Per Share, to require entities to calculate diluted earnings per share (EPS) for convertible instruments by using the if-converted method. In addition, entities must presume share settlement for purposes of calculating diluted EPS when an instrument may be settled in cash or shares. For SEC filers, excluding smaller reporting companies, ASU 2020-06 is effective for fiscal years beginning after December 15, 2021 including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020. For all other entities, ASU 2020-06 is effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Entities should adopt the guidance as of the beginning of the fiscal year of adoption and cannot adopt the guidance in an interim reporting period. The adoption of this ASU does not have a significant impact on the Companys consolidated financial statements.\nNote 3 - Going Concern\nThe accompanying consolidated financial statements were prepared assuming the Company will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business.\nAs reflected in the accompanying consolidated financial statements, the Company had an accumulated deficit of $7,909,019 at September 30, 2023, the Company incurred net loss of $474,802 for the year ended September 30, 2023, and the Company had cash outflow from operating activities of $439,770 for the year ended September 30, 2023. These raise substantial doubt about the Companys ability to continue as a going concern.\nManagement intends to raise additional funds by way of a private or public offering, or by obtaining loans from banks or others. While the Company believes in the viability of its strategy to generate sufficient revenue and in its ability to raise additional funds on reasonable terms and conditions, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon the Companys ability to further implement its business plan and generate sufficient revenue and its ability to raise additional funds by way of a public or private offering or loans from banks or others.\nThe consolidated financial statements do not include any adjustments related to the recoverability and classification of recorded asset amounts or the amounts and classification of liabilities that might be necessary if the Company is unable to continue as a going concern.\nNote 4 - Property and Equipment\nProperty and equipment at September 30, 2023 and 2022 consisted of the following:\nSeptember 30, 2023\nSeptember 30, 2022\nComputer equipment\n$ 1,852\n$ 1,852\nLess accumulated depreciation\n(1,852\n)\n(1,852\n)\nComputer equipment, net\n-\n-\nOffice furniture\n12,746\n12,746\nLess accumulated depreciation\n(12,291\n)\n(10,470\n)\nOffice furniture, net\n2,276\nTotal property and equipment, net\n$\n$ 2,276\nDepreciation for the years ended September 30, 2023 and 2022 was $1,821 and $1,914, respectively.\nNote 5 - Prepaid Expenses\nAs of September 30, 2023 and 2022, the Company had current prepaid expenses of $12,668 and $12,018, respectively. As of September 30, 2023, prepaid expense mainly consisted of prepaid OTC listing fee of $12,500. As of September 30, 2022, prepaid expense mainly consisted of prepaid OTC listing fee of $12,018.\nNote 6 - Convertible Notes\nConvertible notes at September 30, 2023 and 2022 consisted of the following:\nConvertible Notes\nSeptember 30,\nSeptember 30,\nConvertible notes - current\n$ -\n$ -\nConvertible notes - non-current\n50,000\n350,000\nAccrued interest\n4,466\nTotal outstanding balance\n$ 50,382\n$ 354,466\nOn June 30, 2023, the Company received a written notice from Liu Marketing (M) SDN BHD (the Lender), pursuant to certain Convertible Promissory Notes made by the Company in favor of Lender on February 15, 2022, March 23, 2022, June 9, 2022, July 1, 2022, August 19, 2022, October 6, 2022, November 7, 2022, December 16, 2022, January 30, 2023, February 24, 2023, April 10, 2023 and May 29, 2023 (the Notes), that the Lender elected to convert all of the Notes balances (including principal and interest of the Notes) of $716,767 for 1,592,816 shares of common stock of the Company (the Shares) at the conversion price of $0.45 per share. On July 7, 2023, the Shares were issued to the Lender pursuant to an exemption from registration under Regulation S, promulgated under the Securities Act of 1933, as amended.\nOn June 29, 2023, the Company entered into a Convertible Promissory Notes Purchase Agreement with Liu Marketing (M) SDN BHD, a company incorporated under the laws of Malaysia (the Purchaser). Pursuant to the agreement, the Company sold a Convertible Promissory Note to the Purchaser with a principal amount of $50,000. The Note bears interest at the rate of 3% per annum, which are payable on June 29 of 2024 and 2025. The Note will mature on the date that is twenty-four months from the date that the purchase price of the Note is paid to the Company. Any outstanding principal and interest on the Note may be converted to the shares of common stock of the Company at the holders option at a conversion price of $0.45 per share at any time until the total outstanding balance of the Note is paid.\nAs of September 30, 2023, the Company had outstanding convertible notes and accrued interest of $50,000 and $382, respectively. As of September 30, 2022, the Company had outstanding convertible notes and accrued interest of $350,000 and $4,466, respectively. For the years ended September 30, 2023 and 2022, the Company recorded $12,683 and $4,466 interest expense for the convertible promissory notes, respectively.\nNote 7 - Other Payables\nAs of September 30, 2023 and 2022, the Company had other payables of $25,715 and $4,670, respectively. As of September 30, 2023, other payables mainly consisted of salary payable of $7,764, accrued professional fee of $16,000, and payroll tax payable of $1,951. As of September 30, 2022, other payables mainly consisted of salary payable of $4,670.\nNote 8 - Loans Payable\nOn June 24, 2020, Fuse Biotech received $105,400 from the Economic Injury Disaster Loan (EIDL loan) from the SBA after deducting $100 Uniform Commercial Code (UCC) handling charge and filing fee. This is a low-interest federal disaster loan for working capital to small businesses and non-profit organizations of any size suffering substantial economic injury as a result of the Coronavirus (COVID-19), to help the businesses to meet financial obligations and operating expenses that could have been met had the disaster not occurred. This loan has annual interest of 3.75% and is not forgivable. The maturity of the loan is 30 years, installment payments including principal and interest of $515 monthly will begin 12 months from the date of loan approval date. For the years ended September 30, 2023 and 2022, the Company recorded $4,600 and $4,032, respectively, as interest expense for the EIDL loan. For the years ended September 30, 2023 and 2022, the Company made $7,211 and $6,180 (including principal and interest) repayment of the EIDL loan, respectively.\nAs of September 30, 2023, the future minimum principal amount of loan payments to be paid by year are as follows:\nYear Ending September 30,\nAmount\n$ 1,936\n2,404\n2,495\n2,591\n2,689\nThereafter\n91,611\nTotal\n$ 103,726\nNote 9 - Due to Related Party\nAs of September 30, 2023, the Company had advance of $35,973 from its CEO, for the Companys working capital needs. The advance from its CEO did not bear any interest, and payable upon demand.\nNote 10 - Income Tax\nAt September 30, 2023 and 2022, the Company had net operating loss (NOL) carryforwards for income tax purposes. For federal income tax purposes, NOLs arising in tax years beginning after 2017 may only reduce 80% of a taxpayers taxable income and may be carried forward indefinitely; for California income tax purposes, the entire NOL can be carried forward up to 20 years. However, the coronavirus Aid, Relief and Economic Security Act (the CARES Act), issued in March 2020, provides tax relief to both corporate and noncorporate taxpayers by adding a five-year carryback period and temporarily repealing the 80% limitation for NOLs arising in 2018, 2019 and 2020. The Company estimated NOL carry-forwards for Federal and California income tax purposes of $5.34 million and $5.30 million for each of Federal and California state at September 30, 2023, respectively. No tax benefit was reported with respect to these NOL carry-forwards in the accompanying consolidated financial statements because the Company believes the realization of the Companys net deferred tax assets for the NOL for both federal and California State of approximately $1.49 million as of September 30, 2023, was not considered more likely than not and accordingly, the potential tax benefits of the net loss carry-forwards are fully offset by a full valuation allowance.\nComponents of deferred tax assets as of September 30, 2023 and 2022 are as follows:\nSeptember 30, 2023\nSeptember 30, 2022\nNet deferred tax assets:\nExpected income tax benefit from NOL carry-forwards\n$ 1,490,909\n$ 1,358,751\nAllowance for non-current prepaid expense\n279,836\n279,836\nLease expense under ASU 842\nLess valuation allowance\n(1,771,213\n)\n(1,639,018\n)\nDeferred tax assets, net of valuation allowance\n$ -\n$ -\nIncome Tax Provision in the Statements of Operations\nA reconciliation of the consolidated federal statutory income tax rate and the effective income tax rate as a percentage of income before income taxes for the years ended September 30, 2023 and 2022 is as follows:\nFederal statutory income tax expense (benefit) rate\n(21.00\n)%\n(21.00\n)%\nFederal income tax rate difference\n0.00\n%\n0.00\n%\nState statutory income tax (benefit) rate, net of effect of state income tax deductible to federal income tax\n(6.48\n)%\n(6.44\n)%\nChange in valuation allowance on net operating loss carry-forwards\n27.99\n%\n27.98\n%\nEffective income tax rate\n0.51\n%\n0.54\n%\nNote 11 - Revenue, Cost of Revenue and Major Customers\nFuse Group and Processing provide consulting services to mining industry clients to find mine acquisition targets within the parameters set by the clients, in circumstances in which the mine owner is considering selling its mining rights. The services of Fuse Group and Processing include due diligence on the potential mine seller and the mine, such as ownership of the mine and whether the mine meets all operation requirements and/or is currently in operation.\nCost of revenue mainly consisted of the managements travel expenses to visit these mines and consulting expenses paid for mine expertise during the mine due diligence period.\nFor the years ended September 30, 2023 and 2022, the Company recorded revenue of $0 and $200,000 for the services provided, respectively.\nFor the year ended September 30, 2023, the Company had no customer which accounted for more than 10% of the Companys revenue.\nFor the year ended September 30, 2022, the Company had one customer which accounted for 100% of the Companys revenue.\nNote 12 - Acquisition of Mining Rights in Mexico\nOn February 9, 2021, Fuse Group and Processing entered into a Share Exchange Agreement with five individuals who owned Portafolio. Pursuant to the agreement, the Company would issue, in lieu of $1,000,000 cash payment, and deliver to the five sellers 14,285,715 shares of common stock of the Company for all the outstanding shares of Portafolio (the Mexican Shares) owned by these five sellers upon closing when the five sellers deliver all outstanding shares of Portafolio. Portafolio owns concessions rights to five mineral locations in Mexico. There are no business, no mining operations, no existing contracts for the sale of output, and no permits or licenses to conduct mining operations other than the concessions to explore the five mineral locations. The acquisition has not been completed yet as of September 30, 2023 as the Company was waiting for the completion of the transfer of Mexican Shares from the sellers to the Processing. The transfer of shares of Portafolio to Processing is subject to Mexican government approval, which has not happened yet.\nNote 13 - Commitments\nLease Commitment\nEffective December 1, 2018, the Company entered a three-year lease for an office in the city of Arcadia, California. The monthly base rent is $2,115 payable on the first day of each month, with a 3% increase each year. The lease expired on November 30, 2021. On February 28, 2022, the Company renewed lease for three more years, commencing on December 1, 2021. The new monthly base rent is $2,243 payable on the first day of each month, with a 6% increase each year. The lease will expire on November 30, 2024.\nThe components of lease costs, lease term and discount rate with respect to the office lease with an initial term of more than 12 months are as follows:\nFor the years Ended September 30,\nOperating Lease costs\n$ 28,772\n$ 26,455\nWeighted Average Remaining Lease Term\n1.17\n2.17\nWeighted Average Discount Rate\n%\n%\nThe following is a schedule of maturities of lease liabilities as of September 30, 2023:\nFor the year ending September 30,\nOperating Leases\n$ 30,180\n5,070\nTotal lease payments\n35,250\nLess: imputed interest\n(1,084\n)\nTotal lease liabilities\n34,166\nLess: current portion\n29,128\nLease liabilities - non-current portion\n$ 5,038\nConsulting and Service Agreements\n1)\nOn April 1, 2017, the Company entered into a strategic consulting agreement with a consulting company with a term of one year. The consulting company provides the Company the strategic advices on business development and marketing. The compensation to the consulting company is $50,000 per year, payable in equal installments at the end of each month. The agreement was extended to March 31, 2023 with the same terms. On April 1, 2023, the Company and the consulting company mutually agreed to extend the consultancy agreement for another year to March 31, 2024 at no further cost.\n2)\nExploratory Drilling Agreement and Related Costs. On April 1, 2018, the Company entered into a contract with an individual owner of a mining concession in Mexico. The mine is located in Mexico, in the state of Sinaloa, Badiraguato municipality, Nocoriba village. The latitude is 25.2520000 and the longitude is -107.225500. The Company started drilling within the concession 10HAAS. For the years ended September 30, 2023 and 2022, the Company spent $0 on this mine. If the project is successful, the Company will receive 3% equity in the mine (which percentage will be paid upon successful completion of exploration and drilling of the mine). The mine owner has been in discussion with a potential buyer to purchase this mine and the buyer is analyzing the minerals of this mine. The mine owner and Fuse Group have agreed to put exploration on hold until this buyer completes its analysis in preparation for making the acquisition decision. The project is currently on hold due to the delay caused by COVID-19 pandemic and negotiations will resume once the analysis of minerals of the mine is completed and accepted by the potential buyer.\nNote 14 - Subsequent Events\nThe Company has evaluated subsequent events through the date on which the financial statements were available to be issued. All subsequent events requiring recognition as of September 30, 2023 have been incorporated into these financial statements and there are no other subsequent events that require disclosure in accordance with FASB ASC Topic 855, Subsequent Events except the following:\nOn December 13, 2023, the Company entered into a Consulting Agreement with Beijing Jixiang Fengqi Tech Company Limited, a company organized under the laws of China (the Customer). Pursuant to the Consulting Agreement, the Company will provide consulting services to the Customer, including marketing research, competitive analysis and business development strategy in North America as well as marketing strategies, product development, identifying and partnering with local businesses or distributors and other general business advisory services. The Consulting Agreement has a term of one year from December 13th, 2023 to December 12th, 2024 and may be renewed by the parties. For the services rendered by the Company as required by the Consulting Agreement, the Customer agrees to pay a service fee to the Company of $10,000 per month, payable monthly.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nFuse Group Holding Inc.\nBy:\n/s/ Umesh Patel\nUmesh Patel\nDate: December 27, 2023\nChief Executive Officer and Chief Financial Officer\n(principal executive officer, principal financial officer and accounting officer)\nName and Title\nDate\n/s/ Umesh Patel\nUmesh Patel\nDecember 27, 2023\nChief Executive Officer, Chief Financial Officer and Director\n(principal executive officer, principal financial officer and accounting officer)\n/s/ Man Shek (Alex) Ng\nMan Shek (Alex) Ng\nDecember 27, 2023\nDirector\nNONE false FY\n2022-10-01 2023-09-30\n2023-03-31\n2023-12-26\n2023-09-30\n2022-09-30\n2021-10-01 2022-09-30\nus-gaap:CommonStockMember\n2021-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-09-30\nus-gaap:RetainedEarningsMember\n2021-09-30\n2021-09-30\nus-gaap:RetainedEarningsMember\n2021-10-01 2022-09-30\nus-gaap:CommonStockMember\n2022-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-09-30\nus-gaap:RetainedEarningsMember\n2022-09-30\nus-gaap:RetainedEarningsMember\n2022-10-01 2023-09-30\nus-gaap:CommonStockMember\n2022-10-01 2023-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-10-01 2023-09-30\nus-gaap:CommonStockMember\n2023-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2023-09-30\nus-gaap:RetainedEarningsMember\n2023-09-30\nfsnt:FuseTradingLimitedTradingMember\n2017-03-31\nfsnt:FuseTradingLimitedTradingMember\n2017-03-31\nfsnt:FuseTradingLimitedTradingMember\n2022-04-22 2022-04-22\nfsnt:PortafolioEnInvestigacionAmbientalSADeCVPortafolioMember\n2021-02-09 2021-02-09\nfsnt:EMoBiotechHoldingIncMember\n2021-03-11 2021-03-11\nfsnt:EstimatedUsefulLivesMember\n2022-10-01 2023-09-30\nus-gaap:ComputerEquipmentMember\n2023-09-30\nus-gaap:OfficeEquipmentMember\n2023-09-30\nus-gaap:LeaseholdImprovementsMember\n2023-09-30\nfsnt:PropertyPlantAndEquipment1Member\n2022-10-01 2023-09-30\nus-gaap:ComputerEquipmentMember\n2022-09-30\nus-gaap:FurnitureAndFixturesMember\n2023-09-30\nus-gaap:FurnitureAndFixturesMember\n2022-09-30\nfsnt:OTCListingFeeMember\n2023-09-30\nfsnt:OTCListingFeeMember\n2022-09-30\nus-gaap:ConvertibleDebtMember\n2023-06-30 2023-06-30\n2023-06-30 2023-06-30\nus-gaap:ConvertibleDebtMember\n2023-06-30\n2023-06-29\n2023-06-29 2023-06-29\nus-gaap:ConvertibleDebtMember\n2022-10-01 2023-09-30\nus-gaap:ConvertibleDebtMember\n2021-10-01 2022-09-30\nus-gaap:LoansPayableMember\n2020-06-24 2020-06-24\nus-gaap:LoansPayableMember\n2020-06-24\nus-gaap:LoansPayableMember\n2022-10-01 2023-09-30\nus-gaap:LoansPayableMember\n2021-10-01 2022-09-30\nfsnt:PrincipalAndInterestMember\n2022-10-01 2023-09-30\nfsnt:PrincipalAndInterestMember\n2021-10-01 2022-09-30\nus-gaap:DomesticCountryMember\n2023-09-30\nus-gaap:StateAndLocalJurisdictionMember\n2023-09-30\nfsnt:CustomerOneMember us-gaap:SalesRevenueNetMember us-gaap:CustomerConcentrationRiskMember\n2021-10-01 2022-09-30\nfsnt:PortafolioEnInvestigacionAmbientalSADeCVAMexicanCompanyPortafolioMember\n2021-02-09 2021-02-09\n2021-02-09 2021-02-09\nsrt:MinimumMember fsnt:ArcadiaCaliforniaMember fsnt:LeaseOfOfficeSpaceMember\n2018-12-01 2018-12-01\nfsnt:ArcadiaCaliforniaMember fsnt:LeaseOfOfficeSpaceMember\n2018-12-01 2018-12-01\nsrt:MinimumMember fsnt:ArcadiaCaliforniaMember fsnt:LeaseOfOfficeSpaceMember\n2021-12-01 2021-12-01\nfsnt:ArcadiaCaliforniaMember fsnt:LeaseOfOfficeSpaceMember\n2021-12-01 2021-12-01\nfsnt:StrategicConsultingAgreementMember\n2017-04-01 2017-04-01\nfsnt:ExploratoryDrillingAgreementAndRelatedCostsMember\n2022-10-01 2023-09-30\nfsnt:ExploratoryDrillingAgreementAndRelatedCostsMember\n2021-10-01 2022-09-30\nus-gaap:SubsequentEventMember\n2023-12-13\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure"
}